{
    "app_id": 418250,
    "name": "Polaris Sector",
    "release_date": "2016-03-22",
    "developer": [
        "SoftWarWare"
    ],
    "publisher": [
        "Slitherine Ltd."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Simulation",
        "4X"
    ],
    "achievements": 0,
    "positive_ratings": 245,
    "negative_ratings": 101,
    "price": 29.99,
    "description": "Can anyone build an empire in a place like this? Other factions are naturally suspicious of newcomers and may wage war at the first sign of unidentified craft. Here, a natural death is an uncommon luxury.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/418250/header.jpg?t=1510672519",
    "minimum_requirements": "OS: Windows® Vista/7/8/10 Processor: Core i3 Memory: 2 GB RAM Graphics: DirectX or OpenGL Compatible Video card DirectX: Version 9.0c Storage: 4 GB available space Sound Card: DirectX Compatible Sound Card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I had the fortune to play the Beta before release and have been pleasantly surprised after initially being unaware of the game. I’m now totally hooked on Polaris Sector to the point that I would rate this game more highly than any Space 4X release in the last 12 months, including Galactic Civilizations 3 and Stardrive 2.  Here are the top reasons why:  1. There is a competent AI which is impressive for a new release. The AI builds decent colonies and uses well designed ships. If you are too aggressive too early an invasion will often falter and you have to think about what you are building against the AI and how to best deploy them in combat.   2. The game is well balanced and avoids out of control exploitation. For example, you can't build early game unbeatable doom fleets, you don't find huge amounts of weapons late game that are worthless and so on.  3. The colony governors are really good. I don’t feel the need to excessively micromanage colonies which vastly reduces the tedium mid to late game. In fact the game shines mid to late for various reasons including the ability to significantly speed up the game.  4. There is a surprising amount of content for a new release. The game includes an end game threat that had me starting at the screen with my mouth open in shock (noting that I consider the Shakturi in Distant Worlds to be total wimps), a novel ship based espionage system and a good ship design system where component selection matters in-game.  5. There are some really cool Spiral galaxy maps to play which can make the game really interesting strategically. For example you might start in an outer ring and find yourself blocked by other races from accessing inner rings or the core without using star tunnels and tankers to provide enough range for early to mid-game fleets.  6. During the beta I have had no crashes at all and just a couple of bugs which the developer promptly responded to.   Some cautions to consider:  1. It’s primarily a war game and although there is some variety in the domination victories (e.g. technology), there aren’t a wide variety of victory conditions.  2. The innovative research is great but it takes a game or two to really get used to it so some patience is recommended.   3. There is some exploration but it could use more events and anomalies to spice it up.  4. The combat is fun and tactical but isn’t as pretty as some other games.  5. A Battle Arena to test designs would have been great but unfortunately not in the game.  6. The tutorials are very limited so checking some Youtube videos might help.",
            "review_score": "1"
        },
        {
            "review_text": "Very nice game, What it does it does it really great. A mix of SOTS/SEV and real time battle lot of tension.  It could be seen as a more viral Distant World, mostly centered on expansion and war than trade and preaceful negociations. The 8 resources vs the 20+ of Distant World made it easier to handle while still keeping the diversity up. Population management is quite basic and AI takes properly care of the colonies, but between exploration, infiltration, sabotage, defence, invasion and planning constructions of warships/satelites/troops and fighters you are keept quite busy.   The ship design is fantastic, with lot of options and decisions that will enter at play in the main game (number vs quality, cool system but expensive in resource I miss a bit or less cool but less survivability etc..).    If you need a 4X fix, or want a challenging game 'in the stars' without touching the 'too cold' Endless Space, the too complete/complex Distant World or the outdated SpaceEmpireV/SOTS, this one is the one to go.   As it is a one man show don t expect the polish of a AAA title, but it is functional, the GUI is well designed and it comes bug free and fun with an author answering directly on the forums! The only part which could have needed more love is the 'alien race design' which feels a bit cartoonesque... but they included blue space babes;)",
            "review_score": "1"
        },
        {
            "review_text": "Polaris Sector is a very good game and I would recommend it to any 4X space strategy fan. What makes this game interesting is how it manages your empire without a lot of work and lets you focus on whatever part of gameplay you enjoy. The ship building is fun, the science research is interesting, and the exploration and expansion system makes you feel like you are playing a game in space, where planets are very far apart.  Some people don't like new ideas, or changing up what they are 'use too' in a 4X game, Polaris mixes up a lot of the standard ideas and adds in new and updated systems that makes it stand out from the crowd. This game is for a new generation of 4X space players, with new ideas, new ways of doing things, and a good interface that allows you to focus on the fun and let the game manage the stuff you don't want to mess with. Highly recommend this to any space explorer out there interested in playing something new and interesting.",
            "review_score": "1"
        },
        {
            "review_text": "Impressions currently: It needs some more diversity &amp; balancing when we speak of weapons, races, and (Possibly) Activatable modules. Besides that, this is a stunning and amazing 4x title, if a bit rough around the edges. As developement goes on and mods begin to add onto the game itself, I have no doubt it will become one of the best 4x titles in the past 6 years or so.",
            "review_score": "1"
        },
        {
            "review_text": "Pros: Excellent 4x with a light (but not insignificant) focus on planetary development but heavy focus on ship design and combat. Reverse the gameplay focus of GalCiv III, add some Imperium Galactica II -esque music to the mix and you've got Polaris Sector. Combat and ship design is OUTSTANDING with an incredible variety of weapons, modules, and tactics. The ships, while not true 3D, are beautiful to behold IMO.   Cons: Micromanagement can be a pain (loading fighters into carriers for instance) , but there are some features that help with that (such as the plan invasion mechanic). Exploration could stand to be better fleshed out and some better fleet organization/management tools would be nice.",
            "review_score": "1"
        },
        {
            "review_text": "As many have mentioned, there is a lot this game does very well. On the downside, there could be more tooltips thaty tell what does what, but I have also found some of what I need just by RTFM. I see a review that didn't know what economic and scientic treaties benefit. What they do is open up additional dialogs to let you buy minerals or barrow minerals with interest in the case of economic and buy/trade technologies (if they are willing) for research treaties. There have been numerous times I find myself running out of plutonium but have an extreme excess of another mineral and with 3 or 4 races in economic treaties, I could buy enough plutonium to keep my ship factories working while I adjusted mining planets for more extractors of a certain type (in this case plutonium) or colonized new worlds to specifically mine the mineral. Every planet can be colonized with the right technology with 1-3 planets per system and hundreds of systems, there is a lot to manage. At the same time, the AI helps a lot in intuitive ways.",
            "review_score": "1"
        },
        {
            "review_text": "Tacking on another positive review: Favorite part: Love the research tree If I could ask for anything: A mass production mode for planets (Sorta like how America mass produced Shermans in WW2) that speeds up a single ship building by 30-40% so that I can mass produce 1 type of ship (It could take time to create 'optimized factory setup' which freezes the planets production otherwise) ",
            "review_score": "1"
        },
        {
            "review_text": "Finally a Pax Imperia successor.",
            "review_score": "1"
        },
        {
            "review_text": "If Sid Meier's Civilization 5 and Vega Conflict had a baby, this would be it. Control your units in combat, colonize space, create custom warships, handle diplomacy, and get smashed by space pirates until you build a super-corvette! It doesn't get better than this! I can NOT STOP PLAYING HEELP!!!",
            "review_score": "1"
        },
        {
            "review_text": "NON TECHNICAL VERSION:The games good fun and different from other 4x's but its annoying at the same time don't get me wrong its fun and rewarding but things happen that just annoy the player like invasion forces dissapearing which made me lose my war that was turning into my favour just because my whole ground army vanished from the transports along with that causing my warfleet to be stuck in that planets orbit allowing pirates to destroy every single orbital structure i had which made my empire fall apart but thats the game and the challenge about it i do recommend giving it a try even though this glitch was weird maybe it was just they starved to death since my farm planets were destroyed by the drill(annoying ugly things) but weak in tech but so far its just been negitive so heres the possitives that makes this game a buy to start it takes parts from other games that are really good and brings them into one big game at first you will fail no chance youll even have a idea what your doing and its trial and error which gives you the rewarding factor of succeeding at making a empire like me where the army starved to death which is the trial and error system that truthfully even though its annoying and horrible its actually fun like 5 min after it happens its weird all the sudden i find the joy in that fail with food management and are ready to try again  TECHNICAL VERSION: This game is a good 4x game that brings elements from other famous 4xs into one the ship building is great you have to think of each part and generally what the role of the ship is and have to use the tech you currently have which brings us to the tech tree its different then any other ive seen really some may hate it but i like it it has bars for how much persentage of your scientists time goes into math cemistry physics and biology which will increase and lower speed some tech becomes researched which is great since you choose your focus instead of tech trees this game also has a fuel system where it'll limit jumps you can do without refueling at a planet you or a ally own to get more fuel you need fuel containers the more you add to a ship and the more advanced it is makes the ship take longer and will need more resources to build which makes you have to think more on if you have a more advanced smaller fleet or a less advanced huge fleet ground forces play a important role letting you conquer planets and defend your own planets but will consume food thus they can starve if you run out of food so balancing the perpose of planets is needed each planet has bonuses in a material production science or food the planets specialty should be what you use it for the last thing i want to point out is the AI its incredible attacks at prime moments to try to take you out for example the human republic started a war with me the drill who conquered another space empire that had space near me also declared war since they thought i couldn't attack on two front which was true but they never reached my core systems intact this continued on till my food ran out and my military starved and my war fleet was stranded above a planet i wouldve conquered if my army didnt starve  SHOULD YOU BUY THIS GAME: Yes if you want wait till it goes on sale and give it a try if you don't like it get a refund simple as that but i do recommend you try it and if your like me at first youll hate it since you cant do like anything right but after 2-3 attempts you start to understand i should do this maybe i should try that and youll start to love the game for what it is which is a great 4x that will knock you down and beat you up at first then you get that sense of acheivement when you kick it in the face and beat the game",
            "review_score": "1"
        },
        {
            "review_text": "Not a bad 4x game... its just the ♥♥♥♥ing space faring koalas, et al, that seem to be a requirement for so many 4x games that ♥♥♥♥s me off.  What are you pulling through ya, SoftWarWare? Grrr. XD  'Pass the blunderbuss, Jeeves. There's a bloody great beast of a killer koala hiding in that tree!'.   [Edit] removed some expletives.",
            "review_score": "1"
        },
        {
            "review_text": "Update after forcing myself to finish the game at least once (refund got rejected).  So did i enjoy my 20 hours of play time? Well. It is a 4x. So meh. I always SOMEWHAT enjoy them. This has to be the worst 4x game in my library tho, by far. And the most expensive as well.   Compared to Master of Orion: MoO has A LOT less features, like really... it sounds and plays so much simpler. BUT the few things you CAN do are real choices. You can decide what you do, when you do it and how you do it. And multiple ways are possible to advance and win. Polaris Sector has one way and the automation does it for you.   So no, i will not recomment it. A 4x on rails just shouldn't exist.  The game does not get any better like i hoped at the end of my review. It stays a pure illusion of freedom. There is always that ONE best way to do something. Most of the time it is perfectly clear so you just do it, or let automation do it.   As the game progresses you are more and more a watcher only. You do some fights here and there and thats about it. The rest is done by the AI and automation. And really you simply can't do much the AI is not doing on its own. Few minor adjustments come into play lategame once you get all the techs. You can do some minor tweaks to planets then. At that point it does not matter anymore tho.  My playtrough ended with the 'endgame threat'. Let's just put it this way: The ONE thing you can choose yourself is how your ships fire. What they fire with. At up to this point i believed that. WRONG again. DON'T even hope to do a lategame ship without missiles. The endgame enemy is immun to anything but a special variation of a missile. Don't use it? Bad luck.  Let me put this into perspective. I had 3 armys, each one as big as the biggest 2 AIs had combined. So pretty much invincible, right? Well no. The endgame enemy jumped in, attacked one army. I killed all their ships within seconds,... all but 2. 2 Battleships. They are immun to all but that one missile type. Those 2 battleships destroyed 30 of my battleships without any return fire.  So that is what happens if you think there is that ONE thing you can choose yourself. All my 3 armadas destroed within 5 ingame years (a few seconds), without being able to shoot back.  By the time i rebuild an armada with the right weapon choice (silly me to use something else then what the game pushes onto me),.. the endgame enemy grew out of proportion. 200 Battleships, 500 Destroyer... needless to say my playtrough ended there.  Also you better love fighters.  --------------------------------------------------------------------------------------------- Start of original review after about 3 hours played:  The game has many features and looks awesome for any 4x fan on paper. I will happily admit that and i have fallen for exactly that.   Let me call the game 'an illusion of freedom'. It fits pretty good.  All those features and 'stuff' for a lack of a better word: Basically clutter on the UI without doing anything. Hear me out on this one: The game does an awesome job at making you THINK you can control so many aspects,... but you actually don't control anything. My whole playtime has been a kind of autopilot so far. You can turn of automation on planets, but there are no alternatives anyways. There is that one clear way to go and you just do it, or cripple yourself. Automation works just as good. Illusion of freedom.  Ship battles: Looked so awesome in those videos. And turned out to be simple rock, paper, scissor fights. Your enemy has this one ship tye? Better send in THIS first, or be destroyed. Auto resolve is less of a pain because you have this one way of doing it again. Do it that way, or fail. Automation does it better then me, since i dislike playing rock, paper, scissor in space. Illusion of freedom.  Ship building: Key aspect. Stardrive like building. Real freedom, right? No. Weapons only go into yellow slots. Any reason to plug something else in there? No. So... just plug in weapons. 3x3 take small turrets...4x4 take medium turrets,... 6x6 take 4 smalls,... you get the idea. All weapons are of the same size as well. But the other slots are freedom, right? Well... yes. If you dislike your armada and want to destroy it in your first battle. If you don't follow a strict focused approach, the ship will be worthless. So,... well. You gotta plug in x, y and z. If you can fit two x or two y,... great! Thats the real freedom. If you find a layout that takes one more module in all the wasted space. Real illusion of freedom.  AI: Not. Exactly. Smart. I don't know yet if the AI is just dumb or it is 'roleplaying' silly. The agressive guys wanted open boarders... the 'never go to war' guys declared war like 30min in without having a single ship i noticed. They did have half a dozen freighters in my space when they declared war tho. Sounds smart, right?  Planetbuilding: Tackeled it in my first point, but let me alaborate a little: You can focus your planets and you should do that. If you build something, you lock space for other stuff. Building ONE FARM out of 100 slots... locked 24 slots out of my 36 industrial slots on one planet. God knows how or why. But 'balanced' is not going to pay off. Illusion of freedom again.  So i don't know. Ill still play for a while and hope i just did not 'get it'. Or it grows on me,... kinda sad i have spend 33 bucks on this and hope i will stop hating myself for it. Obviously a refund is no option because a 4x game is nothing you can judge after 2 hours.  Stay away for now. Unless you don't mind the illusion of freedom and choice. If you like a 4x on rails, give it a go. It is like watching a movie. And everytime something happens the pause key is pressed. You can read what the AI did, nod a bit and let pause go.",
            "review_score": "-1"
        },
        {
            "review_text": "Well no matter how many opponents you have they will spawn right around you and box you in so the only way to win is war. Also it seems that they can manufacture colonizers and warships pretty much every turn as there fleets will consist of several big ships and about 200 fighters and there fleets move fast so they colonize pretty much everywhere all the time.. Pirates will spawn and head right for you and destroy your orbital manufacturing facilities. Most of your opponents will declare war on you pretty soon as your explorers will probably cross there space and aggravate them to no end. The science is confusing and will take you a long time to research and if you are lucky enough to get an opponent to agree to a science treaty they may have one tech they will exchange and pretty much nada after that. The only way to really win is to play on easy mode as this takes away all the above advantages they have. There is no way to modify your opponents to take away some advantages as there is in Gal CIv 3. Good try but Gal Civ 3 is better",
            "review_score": "-1"
        },
        {
            "review_text": "I really wanted to like this game but I just dont. After the initial thrill of spreading across the galaxy there is really nothing left to do but fight. no real economy to speak of. Dissappointing.",
            "review_score": "-1"
        },
        {
            "review_text": "Another dud. I just may be done buying in this genre because 'space' seems to be a marketing buzzword that substitutes for polish or balance.  The AI is so heavily cheated that you'll either stomp it or your empire will be a hopeless case. There is no balance at all, and what I'm calling the 'AI' really consists of a function that spams stuff at you.   The interface is confusing. The parts you could probably stand to be reminded of show up on your first playthrough and never again, but you're reminded of the easy stuff every playthrough. It's overly complicated and fiddly, time has almost no sense of meaning at all, and trying to plan your technological development alongside your production means you'll always be upgrading fleets that you never get to field, and the AI's will always be better.   In battle, sometimes your ships don't attack at all. You have to use autoresolve to stand a chance because it's that bugged. You'll command your ships to attack, or even tell them to act on their own and tell them to attack, and they'll just kind of fly near the enemy and do nothing, even when they're fully mounted with weapons that have no ammunition requirement (ie, missiles need ammo; lasers don't).  Your corvettes are made of tissue paper, but from the very first pirate fleet you encounter, enemy corvettes are made of the strongest stuff imaginable, with the best weapons. Or, so it seems. No matter how you outfit your ships, the pirate corvettes tear through them like nothing.  The settings menu for the launcher is so bugged on 4k screens that it manages to crash twice at the same time, unless you disable the Steam overlay. Yeah, that should be impossible, so this one actually has cutting edge, ground-breaking levels of failure. If you don't disable high DPI, the settings menu for the launcher will only appear offscreen. If you have a modern system, you'll need to edit the settings CFG manually, which isn't really pleasant because it's a jumbled mess.  Research is divided into theoretical and applied sciences, which is nice. Sadly, the interface is so badly designed with such an obvious lack of thought or effort that it's next to impossible to plan your research. It's as if the developers forgot that players don't know the source code. Ship modules in the tech tree don't show their stats, so even when you manage to find them, you can't tell what you should be pursuing first.  Settings for the galaxy are hard-coded such that you don't actually have options beyond the space between your primary planets ('Earth-like,' and oceanic, typically). Want a big galaxy, where the distance between empires is enormous, as if space is big? Too bad. If you lower the number of opponents, the maximum number of stars you can set it to is lowered as well. On top of that, the AI cheats so heavily that while your empire is wasting decades or centuries building and dispatching fuel ships, the AI just kind of teleports around the map free of cost.  The colony management system violates its own rules sometimes, blocking you from building things like factories on Earth-like planets that have nothing else built on them, even if you have the population to build them. This bug happens if you initially set the planet to 'agricultural' and let the AI fill it up with farms. Even if you destroy every building on the planet except the base colony building, the game will never let you construct another building there.  The AI is the most war-loving I've ever seen. You'll meet them, and unless the RNG decides they're already at war with each other, you will usually very soon after have them demand half your resources and declare war on you when you don't provide them. The developers claim that only happens on 'hard' mode, but I've seen in repeated games that it happens on 'normal' difficulty. They ignored my posting that. These developers don't even know their own game, which suggests that most of the development was outsourced to the lowest bidder.  You can't defeat enemy fleets because retreat can't be stopped. In the rare case when you do manage to do well (which involves zerging very small fleets), there will always be at least one remaining enemy ship that you have to chase all over the map, will never be able to kill, and if you don't keep chasing it then it will go destroy your orbital infrastructure. So, battles ultimately can't be won at all. The appearance of an enemy means you've already lost, either thanks to the massive buffs and cheats the AI has, or because the game will never permit you to destroy all their ships anyway.  The forums are filled with developers for the game outright lying about the mechanics and rules of the game while demonstrating in regard to bugs that they don't actually know how their own code works. It seems like most of the developers' work on this game involves using sockpuppets to convince players who complain that they're basically hallucinating and what they see happen in the game doesn't happen. Rather than develop a game, they try to use the forum to con the would-be buyer into thinking it's already developed.   And this, you get for $40.   So, here's what's happening with this genre. Developers slap 'space', '4E', and 'Grand Strategy' labels on it, release unpolished, unbalanced, lazily thrown together garbage, hire a PR firm to post good reviews, sockpuppet their forums to shout down anyone who has problems with it or (if they go the polite route) simply lie about the game, and by the time you know you've bought yet another dud, it's too late for a refund because the games are designed to take a long time to find out whether they're ultimately playable, with nothing but timesinks.   This genre is dead. Steam killed it. I just wish I could get back all the money I've spent trying to find one of these that's actually fun without it ending up just a blatant clone of the bare minimum design first created twenty years ago. In all honesty, it seems that if you see 'Space' together with '4E' and/or 'Grand Strategy' tags on Steam, you might as well withdraw your money from the bank and light it on fire because you'll get more for your buck that way.  I don't know why I'm bothering to post this when the devs, the PR firm they hired, and a few fanbois and friends are just going to rate it down. Hey, if you can make a small set of pixel art or some low poly spaceships, you have a month to learn a little about Unity, and you have a few friends willing to help with fake reviews, then now you know how to con nearly free money through Steam. And because nobody knows for sure if they've been scammed until it's too late for a refund, you won't have to worry about anyone catching you.",
            "review_score": "-1"
        },
        {
            "review_text": "Looks good a first glance but once you dig deeper it’s fairly bad.   Full disclosure, I only have a few hours in the game but I just could not keep going.   The game speed options are schizophrenic. Most are way too slow for the build and research times of early gameplay but the faster options mean you get spammed with alerts that either auto pause the game, or if you turned the pause off, disappear before you can read the first word. There is no comfortable middle ground as far as I could tell.   Turn pirates off unless you like swarms of ships that kill all your early game tech based ships in seconds and appear at random one system out from your settled worlds. Seriously I had not even researched the first few weapons techs and my home world was attacked by a fleet of 15 pirate ships with 90 fighters.  When they say they don’t use a tech tree, they mean they use a tech tree that doesn’t look like a tech tree. Ok, yes it’s not the old standard of basic laser&gt; ok laser&gt; good laser&gt; OMGWTFBBQ laser. Instead they fill the list with numerous meaningless middleman techs that are prerequisites for several other useful techs. The path you take to get the a better laser may also result in you getting some other tech you didn’t expect but its convoluted enough that the end result for gameplay is you ignore the various sliders and simply tell the system to auto prioritize the tech you want leading you right back to the old standard of basic laser&gt; ok laser&gt; good laser&gt; OMGWTFBBQ laser.   There are a few new ideas in the ship design function but I didn’t get far enough into the game to see if they are well executed. One thing I did not see was any way to easily update ships from one design to another. Unless there are better ways with better techs in the later game it looks like you have to send each ship to a system with a ship yard and tell each hull class to upgrade. That will get time consuming if you have a huge empire with hundreds of ships.   Overall the game feels like it could use a lot more time in the oven.",
            "review_score": "-1"
        },
        {
            "review_text": "the game doesnt even start! the launcher opens, i press play andit crashes. WTF? help please",
            "review_score": "-1"
        },
        {
            "review_text": "Game has many bugs.",
            "review_score": "-1"
        }
    ]
}