{
    "app_id": 418360,
    "name": "Gurgamoth",
    "release_date": "2016-02-16",
    "developer": [
        "Galvanic Games"
    ],
    "publisher": [
        "Galvanic Games"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Local Multi-Player",
        "Shared/Split Screen",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Local Multiplayer"
    ],
    "achievements": 0,
    "positive_ratings": 67,
    "negative_ratings": 11,
    "price": 3.99,
    "description": "Gurgamoth is a flying fighting game where the level is your weapon. Each match is lightning quick and focuses on intense flying combat and getting in your opponent's head. The controls are simple, but the mechanics and interesting levels bring out the game’s depth.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/418360/header.jpg?t=1548803463",
    "minimum_requirements": "OS: Windows 7 Processor: Dual Core CPU Memory: 2 GB RAM Graphics: Integrated Storage: 500 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I received a copy of this game through Keymailer and was excited to try it because I enjoy combative local-multiplayer games. I was very satisfied with my gameplay experience. Be advised: this game works optimally when played with a controller.  If you enjoy arena-based local-multiplayer games, killing your friends, and fast-paced gameplay, then you will enjoy Gurgamoth.  The aesthetics are good - the amount of detail in the environment, characters, and different special effects is very high. There are a number of different characters you can play as, however, this offers only a cosmetic change. The music and sound assets are appropriate for the quick playstyle of the game.  Controls are very simple and easy to learn, however, I must again stress the importance of using a controller when playing; you can use the keyboard and mouse, but Gurgamoth is optimized for gamepad use. You can also play with up to three people using the keyboard and mouse, but it can be quite clutter-some to set things up this way. There is a pop up tutorial of the controls whenever you begin a match, but the different stage hazards/items (appear in the form of asteroids) are not explained anywhere, and must be learned the hard (and fun) way. The learning curve is mostly minimal, but mastering gameplay can take some time. The most challenging part of Gurgamoth will probably be perfecting your timing - a well-executed dodge+boost combo can end with your opponent's death (or yours).  Gameplay consists of you trying to kill your opponents by boosting into them, usually pushing them into some type of environmental hazard that varies depending on stage. For example, one stage has spikes along the edges of the map, but a covering layer must first be hit before the hazard is active (you can do this by boosting into it yourself, or by pushing an enemy). Other hazards include electricity towers that periodically turn on and laser-spitting meteors. The first player to 3 rounds won takes the cake. You begin the game with 3 boosts - there is a cooldown that will slowly recover - and the game handles balancing very well because if you are losing by a lot (ex: 0-2), it will give you 4 boosts and handicap the person winning to 2 boosts.  Other asteroids will offer you temporary bonuses - like infinite boosts, a one-hit shield, slowing down time, and warping the stage perspective (ex: shrinking the map). These, along with the different hazard set up of each stage, help add a lot to the game's replayability.  Overall, the game plays really well for an arena-based local multiplayer game, so long as you have enough controllers handy. If you enjoy fast-paced gameplay, then you should definitely give this title a try.  Recommend!  Cheers, DJSF  @DJSF's Rogue Reviews    My Website  [theroguereviews.com] ",
            "review_score": "1"
        },
        {
            "review_text": "fun little game, not a lot of content, but good controls and a fun concept. local multiplayer only!",
            "review_score": "1"
        },
        {
            "review_text": "Insanly good graphics, fun gameplay, but limited replayablity",
            "review_score": "1"
        }
    ]
}