{
    "app_id": 418440,
    "name": "Tick Tock Isle",
    "release_date": "2015-11-19",
    "developer": [
        "Squiddershins"
    ],
    "publisher": [
        "Squiddershins"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Casual"
    ],
    "achievements": 0,
    "positive_ratings": 212,
    "negative_ratings": 24,
    "price": 0.79,
    "description": "In the year 20XX a confident, young horologist by the name of Strike is inadvertently transported into the past while attempting to repair a mysterious, abandoned clock tower.  Endeavoring to return to the future, Strike must fix both the time machine and the island’s dysfunctional family who are responsible for much of the clock’s...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/418440/header.jpg?t=1449821889",
    "minimum_requirements": "Минимальные: ОС: Windows 10, 8.x, 7, Vista, XP, 2000 or 98 operating system Процессор: 200 Mhz Pentium processor or higher Оперативная память: 256 MB ОЗУ Место на диске: 124 MB",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Some adventure games are light on the gameplay in favor of going hard on the adventure. Tick Tock Isle is an interesting case because it goes light on both the gameplay AND the adventure. That might not sound too appealing, but the whimsical, off-beat story really works to bring this one together.  You play a young Tintin-looking fellow by the ridiculous name of Strike Mainspring, called out to a remote island to fix a busted clock. Ascending the one towering building on the isle, you encounter a time machine that sends you back to the heady year 2009, when the island was still inhabited by its eclectic cast. Your adventure, then, is to repair the time machine and get back to where you belong.  Accomplishing this is going to take a lot of running around, opening doors, picking up stuff, and talking to people. The family that resides on the island includes an elderly couple at imaginary war, a workaholic wife and her useless husband, a firey seductress, and a luchador. They each have their problems that you can help address, and often must help with to progress. The dialog is plenty charming between you and the strange players, though it's all kooky and irreverent without a lot of depth.  As for the rest, it's as simple as can be. The controls are left and right to scoot around, up to jump, and down to interact. Enter opens your notebook with your inventory, map, and to do list. The map isn't terribly important as the game world is quite small, just a circuit around the island and a bunch of interconnected rooms in the building that you'll get used to soon enough. Your inventory is more helpful, with a slot for every item in the game, an indication of when it's been used, and a cutesy description that hints at its purpose.  That's the game, running around fixing crazy people problems, scooping up items, and using them where they need to be used. I can't really say there's much in the way of puzzles, because items are used automatically when interacting with a point of interest. That means you can solve just about every puzzle by picking up an item and trying all the interaction points, which can also mean a lot of backtracking. There are a few brief platforming interludes but they're very much the exception and not at all challenging. The time travel theme at least is used to great effect, I won't spoil how but it gives a hint of cleverness to the simplistic puzzles.  Once you grok the layout of the island and start digging into the tasks at hand, you'll be able to speed through the game in about an hour. That's not long, but it's an hour full of charm and levity. The excellent pixel graphics help keep things interesting, and the sound design fits the atmosphere well all the way to the adorable ending. You won't find much depth or story here, but Tick Tock Isle was a short and sweet experience that kept a smile on my face the whole time.",
            "review_score": "1"
        },
        {
            "review_text": "Just completed a run-through of the Tick Tock Isle. In brief, I would describe it as functional, but forgettable in pretty much every regard. The graphic are sharp enough for a 2D title but the music, SFX, character and world design is uninspired, both in terms of aesthetics and mechanics.   Gameplay comes almost entirely from the old adventure school of ‘use item x on spot y’, except the game automatically prompts you at interactive spots, and automatically selects the correct item to be used. This effectively removes what little engagement this style of gameplay can bring to the table, meaning that most of the game just has you running systematically from room to room and hitting the down key whenever it tells you to do so. There is minimal thought involved, and after about 20m or so, it just felt like a chore.   While character interaction is serviceable, the writing really isn’t strong enough to carry the game either. I didn’t feel particularly engaged either in the story or any particular plotline, and it seems that they didn’t really make much use of the potential their setting had to offer. You could probably call the dialogue mildly humorous, though it’s in the random/non-sequitur/pop-reference sort of way.   On the positive side, gameplay length is about 90 minutes, which, given the amount of content is just long enough not to wear out its welcome.   It’s not a bad game, but Steam has better to offer, even at this price point.",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty charming little game, beautiful visuals, pretty great soundtrack and some memorable likable characters, the humor can be surprisingly spot on, only takes about 1 1/2 hours to beat, but I would reccomend it, worth the $2.99 price tag",
            "review_score": "1"
        },
        {
            "review_text": "Hard to believe this is finally here. I remember playing a prototype of it years ago back on the TIG Source forums. Props to the developer for sticking with it!  Side-scrolling inventory adventure games have become a lot bigger lately (The Cat Lady, Case &amp; Clownbot), and this brings a nice, clean art style and streamlined interface to the table. A lot of the interface is kept behind the curtain leaving you to simply pick items up and talk to people to solve various quests, as well as leaping back and forth through time.  It's really short, about an hour in length, but you're not paying $60, alright?? It's nice when a game ends right before its concept starts to wear thin, and Tick Tock Isle pulls it off.",
            "review_score": "1"
        },
        {
            "review_text": "It's fun - go beat it!",
            "review_score": "1"
        },
        {
            "review_text": "Your job is to fix a clock. You end up time travelling back and forth and fixing a family (and the clock, which is actually a time machine). A fairly simple game with minimal buttons and a good story. The music is lovely and the art is pixely goodness. Lots of time travelling references in the form of pictures on the wall. Two hours very well spent!",
            "review_score": "1"
        },
        {
            "review_text": "Great snack-sized game. Charming characters and dialog.",
            "review_score": "1"
        },
        {
            "review_text": "Fun little game, very enjoyable music and art style. Although it´s pretty short, I didn´t found every item on the inventory, so I will give it another playthrough. I got it on a Humble Bundle, but its Steam full price is worth it in my opinion.",
            "review_score": "1"
        },
        {
            "review_text": "This game has a lot of repetition and can sometimes lead to walking in circles multiple times, but overall it has good charm, simple to understand mechanics, and some humorous content as well. Good game to spend an hour on if you're bored. Might be good for speed runs, if that's your thing.",
            "review_score": "1"
        },
        {
            "review_text": "This is a super casual and short game that's worth the play for some relaxing fun. Getting through the house and island can be repetitive at times, but the mini level games are really cute and fun to play.   Play this if you want some short and simple fun to while away the time.",
            "review_score": "1"
        }
    ]
}