{
    "app_id": 41900,
    "name": "The Bard's Tale",
    "release_date": "2009-12-11",
    "developer": [
        "inXile Entertainment"
    ],
    "publisher": [
        "inXile Entertainment"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Adventure",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Adventure",
        "Comedy"
    ],
    "achievements": 51,
    "positive_ratings": 644,
    "negative_ratings": 188,
    "price": 6.99,
    "description": "You are the Bard, a selfish rogue weary of pointless sub-quests and rat-infested cellars. Now includes original classic games The Bard’s Tale 1, 2 &amp; 3!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/41900/header.jpg?t=1535045615",
    "minimum_requirements": "OS: Windows 7 Processor: Pentium 4 2Ghz / AMD AthlonXP 2400 Memory: 512Mb Graphics: GeForce FX5700 or better / ATI Radeon 9600 or better DirectX®: 9.0c Hard Drive: 6GB of free space Sound: DirectX 9 Compatible Sound Card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I enjoyed the game from the very beginning till the very end and probably will replay it at least once sometime later to buy all the extras (funny songs and arts there) and find two last tunes. The game is short enough (about 20 to 25 hours of gameplay tops, and you level cap could be achieved easily) but very funny and costs every cent of its price.   The strongest part of the game are its witty dialogues and excellent voicing, however the plot is not so bad too and jokes are good (and yes, I’m almost forty). Combat is simple, especially with a bow and easy mode (which affects only start attributes and number of save points, so don’t bother with harder difficulty). This game is really a game, not some kind of computer sport where you need huge guides on spell usage and skills allocation. Still, the summons are fun and efficient, the weapons are sparse but don't become obsolete too fast. You are free to experiment. Save points number and location are well chosen. Songs and music are awesome! I sing them under my nose now and then.  In short I like the game, the way it is designed, its gameplay and humour. If you are not combat-obsessed power gamer try it. If you are, still try it to for a change.",
            "review_score": "1"
        },
        {
            "review_text": "This game is not a challenger to Diablo. You will not horde items and decide whether you would like the quicker sword with a less power, or the more powerful t hat's a bit slower. You won't have to make difficult decisions about whether to save a woman or save a town. The RPG mechanics are not innovative or thought-provoking. And the quest will not demand countless hours of your life. You will, however, enjoy every step in your (short) journey.  It's funny, it's quirky, and you'll never have to worry about anything except from moving forward. Everything you pick up is something you automatically equip or something that turns instantly to gold. (you should still look at what these things are, though, as often times it's hilarious). Even new weapons when you find one, will be automatically equipped, and your old sword will turn to gold. These are not admirable designs in deep, generic adventure games. In this game though, which you play alone, they are godsends.  It's cheap right now on Steam, and worth every penny. It won't change your life, but it will leave you happy.",
            "review_score": "1"
        },
        {
            "review_text": "An absolutely underrated gem by inXile. With a combat system remnicient of the Dark Alliance and Champions of Norrath games for PS2, this wonderful adventure filled with song and dance has some of the most clever writing and dialogue I've seen in a comedic RPG. You play The Bard, a quick-witted silver-tongued minstrel with the power to summon creatures and companions through song. Narrated by the sultry Tony Jay, this snarky, heart-warming tale of adventure will have you singing in bloody stitches.  Prepare your Fourth Wall. It's in for a good breaking.",
            "review_score": "1"
        },
        {
            "review_text": "Loved this game, fairly witty dialogue and decent game play.",
            "review_score": "1"
        },
        {
            "review_text": "My childhood, my, was I bad at this game I got past where I got to in the console in like no time what so ever.",
            "review_score": "1"
        },
        {
            "review_text": "Simple yet addictive fun a must for any gamer with a sense of humour!",
            "review_score": "1"
        },
        {
            "review_text": "Good, but different take on the old 3D Amiga game. Very tongue in cheek and it only runs in low resolutions. Kind of an action RPG but mainly magic user instead of warrior type classes. Cant go wrong if you are like me and love RPG's, good for a runaround in short bursts.",
            "review_score": "1"
        },
        {
            "review_text": "I love the humor and game play in The Bards Tale. The story line makes it interesting and fun in the natural flow of the game.",
            "review_score": "1"
        },
        {
            "review_text": "The story seems to be your typical fantasy RPG story: the world needs saving and you are the one to save it.  Here's the thing though: you don't really want to.  The Bard's Tale is a comedic fantasy RPG set in yet another medival fantasy land with your typical story, but a rather atypical hero, mostly because he doesn't want to be a hero. But after he's promised money and the damsel in distress, he moves out, fighting bad guys and monsters, meeting up with a whole lot of strange characters, collecting new gear and summoning the help of his magic companions, all while arguing with the narrator as he goes along.  It may not be the most refined RPG, but it's a lot of fun. The combat, while a bit tedious at times, is good, the dialogue is absolutely great, partly so because of the voice actors who do a great job at delivering the lines.  All in all an enjoyable game, especially for action RPG fans who don't mind the abscence of serious business.",
            "review_score": "1"
        },
        {
            "review_text": "I can't really recommend this game but I also can't so I would give it a 5/10 cause I don't like it nor do I hate it with all of my hate.",
            "review_score": "1"
        },
        {
            "review_text": "It's hilarious, it's got unique uh... music. And stuff. Beer beer beer beer tiddly beer beer beer beer~",
            "review_score": "1"
        },
        {
            "review_text": "This game is AMAZING - Story, Voice Acting, RPG elements the whole package. I believe I have played ALL platforms available: XBOX, PC (Steam) and Android. InExile Entertainment is a great company making uniquely different games that are a hoot to play.",
            "review_score": "1"
        },
        {
            "review_text": "it is great if u like adventure casting spells and fighting enemys i would recommend it :)",
            "review_score": "1"
        },
        {
            "review_text": "This is one of me best games i´ve ever played, if not for it´s playability which is decent enough, because of the story, the characters (specially the Bard), the choices, the twists...and of course: the karaokes  I couldn´t stop laughing all game long. It kept surprising me untill the end and when i lost my hard copy when moving, i bought it again here.  It´s worth every cent spent on it :)",
            "review_score": "1"
        },
        {
            "review_text": "Hillarious story and characters, intuitive system and you kill rats, what's not to love?",
            "review_score": "1"
        },
        {
            "review_text": "If you played The Bard's Tale series, just pick this up; stop thinking about it, just buy it. You will want it.  If you never played The Bard's Tale series, just pick this up; stop thinking about it, just buy it. You will want it.",
            "review_score": "1"
        },
        {
            "review_text": "A nice satirical view of the fantasy/D&amp;D RPG games.",
            "review_score": "1"
        },
        {
            "review_text": "This game is hillarious!",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely, hillariously enjoyable! Well worth the buy!",
            "review_score": "1"
        },
        {
            "review_text": "A fun adventure game that hangs lampshades on many classic adventure and rpg elements.",
            "review_score": "1"
        },
        {
            "review_text": "I can not say to other systems, but the Linux version is bugged.  I recommend do not buy it for those who want the play on Linux.",
            "review_score": "-1"
        },
        {
            "review_text": "After a year of making a bug report, there have been no updates or comments from the developer. This game is no longer maintained. Don't expect it to work in future versions of Mac OSX, or Windows (Windows 10 is supposed to be the 'last' windows version, according to Microsoft, after which they will focus on maintaining the system only).  If you're buying this game because it supports Linux, don't. The audio/video codec used here is seriously bugged. The video/audio will play for a short while, pause, then play again--and I'm running this on an 4.0 Ghz 8-core system with 32G of RAM. If you're in a quest, the audio playback is based on a timer, so you'll only hear half of what the other characters were trying to say, so the game is essentially unplayable.  If it weren't for this playback bug, it probably would be a good game. It's been over a year since I reported this bug. Since then I've built a new system with all new hardware, and upgraded my OS to 14.04. The bug still exists for me-- you can expect it to also exist for you. You can also expect new bugs and compatibility issues to go unfixed that can surface with the release of new operating systems and video drivers.  I got this game for free when I bought Wasteland 2, which is a great game, and runs perfectly on Linux (in fact, it runs better in Linux than it does in Windows for me on my system).",
            "review_score": "-1"
        },
        {
            "review_text": "I tried playing it but it just couldnt grab me. The combat is fairly lackluster and the humor just isn't really my cup of tea.  When its al said and done I just didnt have any drive to push through the combat and what I saw of the story to see if it gets any better later on. It might but Im not going to find out.  The dated graphics dont bother me but if thats important for you keep that in mind.",
            "review_score": "-1"
        },
        {
            "review_text": "This game was better when I was 13, but now the humour doesn't really get me like it used to, and the gameplay was dull. Still worth playing for the nostalgia though.",
            "review_score": "-1"
        },
        {
            "review_text": "those accents tho  I literally made a category in my library called 'never again' just for this game.  but liek I can't handle that voice acting and just what even is this  poor guy doesn't get the teets  poor guy maybe I was really tired when I tried playing this game but what the HECK this is a 2004 video game using voice acting from a kindergarten christmas pageant  lol jk I didn't like the game tho I don't recommend it to my parents sister or ex girlfriend THAT'S FOR SURE",
            "review_score": "-1"
        },
        {
            "review_text": "Not really a great game, clunky UI and crude humor that gets stale fast. The combat mechanics feel sluggish as well, and you're constantly fighting the camera.  Not reccomended.",
            "review_score": "-1"
        },
        {
            "review_text": "i can´t compete with the frustrating gameplay. maybe it´s just me, but the healt-restore system is just ♥♥♥♥in depressing, when you need to regain life in the middle of a fight.   will continue playing though, maybe it gets less annoying.   the fights are difficult as hell. i would call this an unbalanced game. it´s pretty hard to fight through a scenario, the story advances quickly and despite you level up constantly, your hero is simply weak.   another con would be the backtracking. silly game makes you fight through the same scenarios and same enemies all the time. this combined with quite annoying health-restore system makes it not an easy task for you. HOWEVER...  you may use cheats, like I do :-)  i simply don´t have time to deal with dying over and over, and thus want to go through the story, cause it´s really funny!  yeah! the dialogues are hilarious, the jokes are (mostly) intelligent, and the satire is obvious. that´s something I really love about the bard. the pointless quest of neverending saving of a princess is wonderful when served like this. the story is a big motivation for me to go on. and the bard himself is just a selfish ♥♥♥♥♥♥♥, who just wants to reproduce and drink. whis is totally ok with me :-)  + story + dialogues (fun satire) + songs + the hero + the narrator  - repetitive gameplay - backtracking - frustrating health-recovery system - poor weapon variety - hard overall difficulty",
            "review_score": "-1"
        },
        {
            "review_text": "Hilariously funny. Also voiced by the Dread Pirate Roberts, so you can't go wrong there.",
            "review_score": "1"
        },
        {
            "review_text": "I've played RPG Games since I was 3 years old! I've played 'Gothic', 'Risen', the RPG Shooter Game 'Hitman', and others. These games don't need high graphics to be played. So does 'The Bard's Tale'! It's an awesome RPG, even if doesn't have high graphics!  I really like the storyline of this game and I like that you can choose which side to be on, what you can say in the NPC Chat, and other cool stuff.  I really like and recommend this game !!!",
            "review_score": "1"
        },
        {
            "review_text": "I first played this on the PS2 after playing Dark Alliance half expecting the cliche D&amp;D adventure game, which is basically is with quite a bit of humor. The Bard is selfish, he breaks the fourth wall, he's sarcastic. It's all quite good. Combat can be a bit repetitive but it never dulled my experience. Would recommend to any adventure RPG fans.",
            "review_score": "1"
        },
        {
            "review_text": "Fun, hilarious. Relaxing and refreshing.  Expect a proper bit of dirt in your beer with this one.",
            "review_score": "1"
        },
        {
            "review_text": "'Ooooooooh, it's baaaaad luckto be you!'  This game almost managed to get me a scottish accent. Try it! :P",
            "review_score": "1"
        },
        {
            "review_text": "At less than $5, this is a great game for the money. The narrator and story are worth the money alone.  It is old, but well done for its year.",
            "review_score": "1"
        },
        {
            "review_text": "for some reason it will only play the opening creditds an then just crash idk what the problem is i tryed to uninstal an instal afew times but still gives me the same problem . was a great game tho whin i had it for ps2",
            "review_score": "1"
        },
        {
            "review_text": "Fun little Action RPG. Not the most exciting game in the world but the dialogue / voice acting is above average for sure.  Too bad they didn't have the review feature available when I first commented on this game. I'm sure I would have had much more to say but it's been too long now for me to recall all the finer details.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun &amp; entertaining game. Makes fun of standard RPG without losing the RPG feel. Bard is one of the best characters I've seen in a RPG.",
            "review_score": "1"
        },
        {
            "review_text": "An old game, i think originally for the PS2, they made it on PC for there aniversery thing &amp; i just had to get it, funniest game you will ever play.",
            "review_score": "1"
        },
        {
            "review_text": "The humor in this game is a driving factor for why I play. It may be dated but the ease in which the story unfolds is akin to being sprawled out on a sofa next to a fire. It is an omage to simpler times in a modern package. The combat, however, doesn't suit the game type. What has historically been a multiplayer genre (pen and paper RPG) is now a single player experience with no ability for co-op fun. This alone hurts this game and ultimately prevents it from reaching 'Classic' status. Worth your money? Yes. Could it be better? Yes.",
            "review_score": "1"
        },
        {
            "review_text": "very fun,great RPG,gameplay is awsom",
            "review_score": "1"
        },
        {
            "review_text": "Oh dear Lord, GET THIS GAME! I have this for the PS2, and it is all kinds of funny!",
            "review_score": "1"
        },
        {
            "review_text": "This game is actually good.",
            "review_score": "1"
        },
        {
            "review_text": "Old school RPG at its best,funny and keeps you into it!",
            "review_score": "1"
        },
        {
            "review_text": "As soon as I played the demo, years ago, I knew I had to buy it, and so I did.  Even though I do not know why exactly I waited years to play it, I found this game to be absolutely brilliant, fullfilling all fun and sarcasm present in the demo, and delivering it in spades. There are so many single moments in this game I bloody loved, but I won't spoil it for you. If you're concerned about the graphics (it's still a 2004 game), you should absolutely look past the aesthetics and do yourself a favour playing this. You won't regret it.  It even comes with the original 3 games, developed for Apple II. Absolutely amazing.",
            "review_score": "1"
        },
        {
            "review_text": "Extremely funny all the way through with decent isometric rpg gameplay. This is one of the best comedic games I have ever had the pleasure of playing and cannot reccomend enough to a fan of fantasy rpgs, wanting a good laugh. As a bonus it also has great songs.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the most magical and nostalgic games from my childhood. Great sense of humor, a delightful flow of history, awesome character... and songs of those goblins!  Admiration is impossible to put into words)) This is really cool!  And if you don't know or don't want try this game... so... it's a bad luck to be you! =)",
            "review_score": "1"
        },
        {
            "review_text": "Solid, whimsical, albeit dated and bit clunky. Despite an odd pov and some stilted game play, still a decent experience. I'll give it a lukewarm recommendation at the right price.  7/10",
            "review_score": "1"
        }
    ]
}