{
    "app_id": 419090,
    "name": "Vector Strain",
    "release_date": "2015-12-09",
    "developer": [
        "OMNIDREAM CREATIONS"
    ],
    "publisher": [
        "OMNIDREAM CREATIONS"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Shoot 'Em Up"
    ],
    "achievements": 36,
    "positive_ratings": 45,
    "negative_ratings": 10,
    "price": 3.99,
    "description": "Addictive fast-paced shoot-em-up with beautiful 3D graphics and an amazing soundtrack. 5 ships to choose from and 5 action-packed Stages.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/419090/header.jpg?t=1462561521",
    "minimum_requirements": "OS: Windows 7 Processor: Intel Dual Core Memory: 1 GB RAM Graphics: GeForce 9600 GT DirectX: Version 9.0c Storage: 1 GB available space",
    "recommended_requirements": "OS: Windows 7, Windows 8, Windows 10 Processor: Intel Core I5 2500k/AMD FX 8350 Memory: 4 GB RAM Graphics: Geforce GTX 670/Radeon HD 7870 DirectX: Version 11 Storage: 1 GB available space",
    "reviews": [
        {
            "review_text": "Good pacing with mix between fast bullets aimed at the player and 'bullet-hell' slow bullets that fill the screen. The game offers a good challenge even on the 'easy' difficulty (at least for me). Looks nice and works smoothly on my outdated PC. Recommended!",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game, a big boy classic arcade shooter.",
            "review_score": "1"
        },
        {
            "review_text": "My Grandfather smoked his whole life. I was about 10 years old when my mother said to him, 'If you ever want to see your grandchildren graduate, you have to stop immediately.'. Tears welled up in his eyes when he realized what exactly was at stake. He gave it up immediately. Three years later he died of lung cancer. It was really sad and destroyed me. My mother said to me- 'Don't ever smoke. Please don't put your family through what your Grandfather put us through.' I agreed. At 28, I have never touched a cigarette. I must say, I feel a very slight sense of regret for never having done it, because this game gave me cancer anyway.",
            "review_score": "1"
        }
    ]
}