{
    "app_id": 419590,
    "name": "Tales from the Void",
    "release_date": "2016-05-20",
    "developer": [
        "PortaPlay"
    ],
    "publisher": [
        "Black Dog "
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Action",
        "Adventure"
    ],
    "achievements": 29,
    "positive_ratings": 31,
    "negative_ratings": 14,
    "price": 6.99,
    "description": "Lost in time and space and fighting for survival, it is up to you to save the crew of a World War I submarine in Tales from the Void, a squad-based, atmospheric real time tactics game.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/419590/header.jpg?t=1482158601",
    "minimum_requirements": "OS: Win7 Processor: AMD A10 6700 (Quad core 3,4GHz) Memory: 8 GB RAM Graphics: GeForce GT 640 DirectX: Version 9.0 Storage: 2 GB available space Sound Card: Onboard sound card (stereo) Additional Notes: This game is made for dedicated 3D graphics cards of some performance, which e.g. low-end laptops might not have. Playing Tales from the Void on a low-end system might also demand playing on lower resolutions to increase FPS (e.g. 1680*1020 or lower).",
    "recommended_requirements": "OS: Win10 Processor: AMD A10 7700K (Quad core 3,4GHz) Memory: 12 GB RAM Graphics: GeForce GTX970 DirectX: Version 11 Storage: 2 GB available space Sound Card: Onboard sound card (stereo)",
    "reviews": [
        {
            "review_text": "EDIT: After giving it multiple second thoughts, I have changed my mind about the way I wish to review this game. The only problem i found myself having was the camera angle sometimes got in the way. This game has beautiful graphics, unique controls, an amazing atmosphere, and definitely a fresh feel.  This game is new and can only grow from here.  -------------------  I don't know if it's a problem on my end, but this game's physics and controls are just so unbearable. If you like overly difficult games that have poor controls and over exaggerated physics you might like this game.  3.5/10 Definitely has potential. Definitely is a cool concept. Definitely is not for me.   ",
            "review_score": "1"
        }
    ]
}