{
    "app_id": 420,
    "name": "Half-Life 2: Episode Two",
    "release_date": "2007-10-10",
    "developer": [
        "Valve"
    ],
    "publisher": [
        "Valve"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Captions available",
        "Partial Controller Support",
        "Steam Cloud",
        "Stats",
        "Includes Source SDK",
        "Commentary available"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "FPS",
        "Action",
        "Sci-fi"
    ],
    "achievements": 22,
    "positive_ratings": 13902,
    "negative_ratings": 696,
    "price": 5.79,
    "description": "Half-Life&reg; 2: Episode Two is the second in a trilogy of new games created by Valve that extends the award-winning and best-selling Half-Life&reg; adventure. As Dr. Gordon Freeman, you were last seen exiting City 17 with Alyx Vance as the Citadel erupted amidst a storm of unknown proportions.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/420/header.jpg?t=1530046627",
    "minimum_requirements": "1.7 GHz Processor, 512MB RAM, DirectX&reg; 8.1 level Graphics Card (Requires support for SSE), Windows&reg; 7 (32/64-bit)/Vista/XP, Mouse, Keyboard, Internet Connection Recommended: Pentium 4 processor (3.0GHz, or better), 1GB RAM, DirectX&reg; 9 level Graphics Card, Windows&reg; 7 (32/64-bit)/Vista/XP, Mouse, Keyboard, Internet Connection",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Nominated for 'GAME THAT DESERVES A SEQUEL' AWARD",
            "review_score": "1"
        },
        {
            "review_text": "Half-Life 3 = Waiting Simulator",
            "review_score": "1"
        },
        {
            "review_text": "I MIGHT JUST FORGIVE YOU FOR THAT DEBACLE AT BLACK MESA.  YOU KNOW THE ONE I MEAN  INVOLVING A CERTAIN MICROWAVE CASSEROLE",
            "review_score": "1"
        },
        {
            "review_text": "Nice told with Alyx  HALF-LIFE 2 EPISODE 2 starts immediately where Half-Life 2 Episode 1 ended. Gordon Freeman and Alyx Vance must continue their fight, alongside the resistance, against the evil Combine. After the ever so slightly below par Episode 1, Episode 2 is a real return to form. Everything that was so good about HL2 is developed here and made even better. The narrative arc is strong, the dialogue well-written and witty, the voice acting accomplished and convincing, the environments spectacular and varied, and the mix between puzzle solving and combat just right. We meet several new enemies and some of the combat is pretty challenging, especially the final battle which is big on scale and mayhem and requires real strategy to complete. It’s a tough finale but well worth the effort. There’s so much to enjoy in the whole Half-Life series I can’t recommend these games enough.  5/5",
            "review_score": "1"
        },
        {
            "review_text": "‎",
            "review_score": "1"
        },
        {
            "review_text": "best part has been ever created. Now i will wait Patiently for EP3",
            "review_score": "1"
        },
        {
            "review_text": "The fact we're still eagerly awaiting a sequel after a nearly 10 year long cliffhanger speaks for itself.",
            "review_score": "1"
        },
        {
            "review_text": "I don't care if I'm 75 years old when it comes out.Because as long as I know the date that it comes out,on that very day, I'll play it.   -Samuel J. Farmer ",
            "review_score": "1"
        },
        {
            "review_text": "...............................................................-Gordon Freeman talking about Half life 3-2014",
            "review_score": "1"
        },
        {
            "review_text": "'Half-Life® 2: Episode Two is the second in a trilogy of new games created by Valve that extends the award-winning and best-selling Half-Life® adventure.'  'second in a trilogy'  Release Date: Oct 10, 2007  y tho",
            "review_score": "1"
        },
        {
            "review_text": "I don't know if I should recommend this, the ending still irks me for one reason: ITS NOT A ♥♥♥♥ING ENDING ITS A FREAKING CLIFFHANGER, ♥♥♥♥ U GABE!! other then that it was prefectly lovely, gg valve",
            "review_score": "1"
        },
        {
            "review_text": "Don't cry . . . don't cry . . . don't cry. . . don't cry . . . don't cry. . .  Hopefully valve will help me forget it one day . . . .  By continuing it.",
            "review_score": "1"
        },
        {
            "review_text": "What do you mean it's on Foxtel?",
            "review_score": "1"
        },
        {
            "review_text": "Worst cliffhanger/10",
            "review_score": "1"
        },
        {
            "review_text": "First of all Gabe, you're amazing. You're my messiah and the knight in the shining armour.  I will be willing to give you my cash, I will be willing to give you my wallet, I will also be willing to give you my banking account and I will ALSO be willing to go live out in the street and get drawn into debt if I have to!  ...but, you know, just release HL3 already? Pretty please.  After 10+ years of development, hopefully, it will be worth the weig-wait*.  Thanks, and I will have 'fun' waiting!",
            "review_score": "1"
        },
        {
            "review_text": "Don't start what you can't finish.",
            "review_score": "1"
        },
        {
            "review_text": "This is Half-life 2........ EPISODE 2 now this game not only diffines GOOD GRAPHICS AND LEVEL DESIGN ALL MIXED IN WITH GAMEPLAY. So I guess yeah. This game also introduces 2 new enimies that you could not interact with in Half-life 2 or Half-life 2 episode 1. This game also has most of the gmod content that you are going to want. This game also introduces a new charactor so do yourself a favor and pick this game up for you and a friend. My final rating for this game is a 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good game aye.",
            "review_score": "1"
        },
        {
            "review_text": "This is the continuation of the story from the end of Half-Life 2 Episode One. This is the classic Valve first person shooter single person campaign. If you buy one game on Steam, this and the Half Life 2 episodes should be it. The classic story of Gordon Freeman.  Exploreable environments and useable / moveable objects, voiceover actors with alternate conversations. Is linear but you can explore alittle of each map. Autosave works good. Has a great story.",
            "review_score": "1"
        },
        {
            "review_text": "Emotions, presentation, story and overall action-packed gameplay makes this game an excellent addition to the Half-Life 2 series and PC gaming in general.  Also that ending was one of the biggest cliffhangers in the gaming history.",
            "review_score": "1"
        },
        {
            "review_text": "YOU NOMINATED THIS GAME FOR: THE “GAME THAT DESERVES A SEQUEL” AWARD ",
            "review_score": "1"
        },
        {
            "review_text": "Please vote this for 'GAME THAT DESERVES A SEQUEL' in The Steam Awards!!",
            "review_score": "1"
        },
        {
            "review_text": "I have recently played through all the Half-Life 2 games and I believe this one is the best. Let me explain. I am a total sucker for great endings (which is the main reason Portal 2 is my favorite game ever) and this one REALLY delivered. I mean, even for a series that ALWAYS ends on a cliffhanger, this is one damn big cliffhanger. The gameplay is solid, but it's a half-life game so thats a given. The new enemies were a lot of fun to fight. You will die a lot, especially on the final fight, which is a blast. But yeah, go buy it if you haven't yet.     *SPOILER ALERT*  The reason the ending got to me is that it's something that wouldn't fly in a modern game. It's not even done in a cutscene. The fact that they decided to kill Eli, a character who's been with us since the very beginning, shows Valve's got guts. And I respect them for that.  9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "VOTE FOR 'GAME THAT DESERVES A SEQUEL'",
            "review_score": "1"
        },
        {
            "review_text": "Its all awesome, well except for the difficult final boss and sad ending.",
            "review_score": "1"
        },
        {
            "review_text": "This game deserves a sequel. PERIOD. Valve get up off your lazy asses and make us a sequel to this.. the greatest video game of all time!",
            "review_score": "1"
        },
        {
            "review_text": "I bought this for gmod",
            "review_score": "1"
        },
        {
            "review_text": "Half life 2 episode 2 is an excellent game. This game introduce lots of thing such as new enemy, new kind of gameplay, new world to explore and a great story. Half life 2 episode 2 opens immediately after the first episode ended.  This episode is better than the first episode mainly because it's a lot longer, new enemy and more. I like the new enemy ' Hunter ' and the new antlion worker. These new enemies are challenging and i love it. The level design is also very interesting just like the part when you're objective is to defend the vortigaunt while healing Alyx from hordes of antlion in the cave and the part when you have to kill lots of strider in white forest base. this game also makes me emotionally invested by the end of it.  Half life 2 episode 2 is one of the best game i play in recent years. This game alson have one of the best cliffhanger and makes me want to play episode 3.  I hope Gabe Newell do make Half life 2 episode 3 or half life 3 because Gordon's adventure can't end like that. we still have to save Dr. Judith Mossman so.... Gordon's adventure still continue. For that i highly recommend this game to everybody who likes video game obviously.  10/10 for me for sure",
            "review_score": "1"
        },
        {
            "review_text": "Even better than Episode 1. Much more dramatic than the story of Episode 1 and adds new modifcations to the Source engine with improved AI, new characters, new enemies, and new environments. Oh and a spoiler: G Man comes back and thickens the plot and the end will make you cri evry tim.",
            "review_score": "1"
        },
        {
            "review_text": "Where's Episode Three... Nominate this for 'GAME THAT DESERVES A SEQUEL'",
            "review_score": "1"
        },
        {
            "review_text": "GAME THAT DESERVES A SEQUEL!",
            "review_score": "1"
        },
        {
            "review_text": "GAME THAT DESERVES A SEQUEL",
            "review_score": "1"
        },
        {
            "review_text": "This game needs a sequel",
            "review_score": "1"
        },
        {
            "review_text": "I would REALLY like a conclusion to this awesome story Valve. Please?",
            "review_score": "1"
        },
        {
            "review_text": "7 out of 10 would bang  I would rate higher but had bugs in the beggining and had to wait about 2 weeks until an update fixed it. I feel that this shouldn't have been a problem to begin with and was very stressful",
            "review_score": "1"
        },
        {
            "review_text": "-Half-Life game -As fun as HL2 -HUGE cliffhanger -Concept art exists of the next game -No official announcement -I cry myself to sleep every night -plz valve -Half-Life 3",
            "review_score": "1"
        },
        {
            "review_text": "This game was so great, it deserves a sequel",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Stands the test of time. I nominated it for 'Most in need of a sequel.'",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME THAT DESERVES A SEQUEL",
            "review_score": "1"
        },
        {
            "review_text": "I am just going to say this right now. I really loved this game. This is going to be a long review as well. Just sayin'.  Now, I do have reasons to say so. I personally disliked Half-Life 2, and Half-Life 2 Episode 1. Still buy them, because to get the full experience of Episode 2 you need to know not only the story, but how much the game improved.  Now, the entire Half-Life 1 (classic?) series was great, while sometimes buggy. What can I say? Golden Source is golden. The gameplay was smooth, the weapons were nice and powerfull-ish, and you played as a variety of characters.  (STILL BUY THIS GAME! SKIP IF YOU DON'T LIKE CRITICISM) Here is where Half-Lfe 2 comes in. Gordon Freeman in a City 17 train, waiting with the rest of the ctizens. Commence with an overly long section without even a crowbar, picking up and throwing spare junk. A little while after, you spend way too long speeding around in an airboat. Then the Gravity Gun, to pick up and throw even more spare junk, but at high speeds. A dunebuggy with suspension level ten thousand, not to mention two types of portable infinite ammo. Last but not least, the 1500 Megawatt Black Mesa Heavy Duty Super-Colliding Super Gravity Gun. One last way to run around with over 9000 HEV and the one weapon to rule them all. The NPCs in the game? 'Oh, Gordon Freeman. We worship you, even though you basically caused this whole mess and only saved yourself.' Barney Calhoun, the dropout hero of Blue Shift? 'Headhumper. Headhumper. Hey, I finally took one down!'  All of these were fun, but too drawn-out. No offense to Valve, but the majority of gamers can learn how to use a gimmick in much less time than otherwise thought. Overall, Half-Life 2 had long expanses of nothing, but in reality some of the best gameplay experiences I've ever had.  (SERIOUSLY, STILL BUY THIS GAME! YOU, THE READER, HAVE THE POWER TO SKIP AT ANY TIME!) Half-Lide 2 Episode 1. Where do I begin? Morg- Gordon Freeman wakes up, and for some reason goes right back into the Citadel. Here he aquires the Conveniently Temporary Over-Powered Blue Zero-Point Energy Manipulator. I didn't think highly of this game from up front, remembering the whimper in which Half-Life 2 ended. From here on, The gameplay is mostly indoors with airducts, similar to Half-Life 1. But, the story was meh. To add, Alyx's AI walked right up to every enemy, and died too often. The fights were really intense, though. All being said, the game kind of ended after about three hours and one strider.  Overall verdict: intense, even difficult action, but compressed into too little time, squeezing out story.  vvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvv Half-Life 2 Episode 2. This game is EXCELLENT. If I can say this to the entirety of Steam after knocking the rest of Half-Life 2, I must mean something. Gordon now wakes up inside of the train that crashed. As the train slowly topples over, the obstacle course that you need to climb down changes. I also happen to love changing terrain, so good first impression. Now I begin to notice things. The flashlight that wore out in about ten seconds in the other games was replaced with one much more similar to Half-Life 1. Also on an individual battery, allowing you to dash for more than a few seconds. I gaze deeply into my teammate's eyes, she awkwardly turns away to avoid eye contact. Very human of her. The car is come-and-go. You can struggle through most areas either with or without the car. It lasted just as long as it was needed. and no longer. As for action, there was never a point without it. All was unique, as well. Half-Life 2 got stale, while Episode 1 was overwhelming. Episode 2 managed to get just the right mix of the two, combining into THE perfect balance. Rochelle- I mean, Alyx's AI was realistic, even to the level of the player. Then there's the Gnome. My good friend the Garden Gnome. As a display of how much Valve in the greatest compaby on this side of the universe, you get an achievement for carrying this guy through almost the whole game. While a pain as some points, I kind of grew to like the guy. The ALyx Vance mauled by a Hunter? 'Don't look, Gnome. Shield thou purest of eyes.' It's a showcase of how great the gameplay is. You literally could have taken ANY item throughout the entire game. Now, back on topic. The Characters were recovered to what they should have been. Barney as a security guard. Refugees as refugees. The vortigaunts actually using their green electricity bolts. The characters were essential to the rich storyline. The storyline alone could have made a movie, as it was what made me start rooting for Half-Life 3. Basically, every problem that I have found in any other Half-Life game was remedied in this one fantastic sequel. ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^   Seriously, just buy the game.  Now.  Sell your house if you really have to.",
            "review_score": "1"
        },
        {
            "review_text": "An amazing ending and just an overall great story! So glad I played this game! And I am hyped for HL3!",
            "review_score": "1"
        },
        {
            "review_text": "I have a dream.  I have a dream that one day Gaben will rise from his office chair and shout ''Half Life 3 is finally here!''.  I have a dream that one day bronies and furries, console peasants and PC masters will sit together at the table of fellowship and play Half Life 3.  I have a dream that one day, even Gaben, his lips so utterly sealed on the fate of the franchise, will proclaim that the wait is over.  I have a dream that one day Half Life 3 will sit in my Steam library, shining forth like a beacon for all to see.  I have a dream that one day my children, my grandchildren and my great-grandchildren will each own their own copy of Half Life 3.  For I have a dream that one day I will be granted the honour of picking up the crowbar and beating scores of headcrabs with it.  For I have a dream that one day that every human on this Earth - Caucasian, Negro, Hispanic or otherwise - will be granted the honour of experiencing Half Life 3 for themselves.  This is our hope, and this is the hope that I live with.  And if this Earth is to be a heavenly Earth, then this must be true.  So let Half Life 3 be announced from The North!  Let Half Life 3 be announced from The South!  Let Half Life 3 be announced from The East!  Let Half Life 3 be announced from The West!  May every corner of this good Earth experience the joy of Half Life 3 in their own hands!  And when this happens, when Gaben bestows upon us Half Life 3, let it be announced from every metropolis, every city, every town, every village, every square inch of Earth! For when that day is finally upon us, let every individual of every race, creed and likewise finally play Half Life 3!  For when that day is upon us, we shall join our hands together and sing:  ''Half Life 3 is here at last!''  ''Thank God Almighty, Half Life 3 is here at last!'' ",
            "review_score": "1"
        },
        {
            "review_text": "WHAT THE HECK WAS THAT ENDING???  Episode 2 continues on where Episode 1 left off. Gordon and Alyx have already escaped from City 17 and have to get to White Forest - a resistance base. Throughout their journey they are constantly chased by the Combine.  While in Episode 1 the setting was mostly urban, in Episode 2 you traverse through the countryside and the area around it. When you have progressed enough through the game you will find an old muscle car that you will use to get to White Forest, func_vehicle returns in Episode 2, not seen in Episode 1. Not that much puzzles are tied to the passage of the car being blocked, though they still are present.  New enemies added include the notorious Hunters. They usually travel in packs and are tough opponents. Alyx is the first to have an experince with a Hunter and it seems that they are too strong, but they can be defeated relatively easy, depending on what you shoot them with. You will also face a lot of striders and obtain a new device used to destroy them - a Magnusson Device.  Episode 2 is made with the same engine as HL2 and Episode 1 so the graphics are the same.  In the end, if you have played the other games, but not this one, then you should buy it.",
            "review_score": "1"
        },
        {
            "review_text": "Best game I've ever played. Amazing storyline, amazing graphics for its time, and a very good variety of puzzles to complete blended in with the things in the level. Amazing. 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "Get it. Now. Amazing storyline, amazing gameplay, amazing everything. GET IT.",
            "review_score": "1"
        },
        {
            "review_text": "Expanding on the story of Hale-Life 2, this additon in the series will surely give you 10 more hours of new gameplay and opens up the opportunity for installing new mods.",
            "review_score": "1"
        },
        {
            "review_text": "'Game that deserves a sequel' award please. Gabe will know what to do",
            "review_score": "1"
        },
        {
            "review_text": "Nominated for 'GAME THAT DESERVES A SEQUEL' AWARD",
            "review_score": "1"
        },
        {
            "review_text": "Its been almost 10 years and we need a sequel",
            "review_score": "1"
        },
        {
            "review_text": "Since HL2 Episode 2 ends with a cliffhanger, I nominated it for The 'Game That Needs A Sequel' Award.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Nominate this for 'GAME THAT DESERVES A SEQUEL'",
            "review_score": "1"
        },
        {
            "review_text": "Nominated this for 'GAME THAT DESERVES A SEQUEL'.",
            "review_score": "1"
        },
        {
            "review_text": "The right game at the right time can make all of the difference.  Wake up, Valve.  Wake up and smell the profit...   HL3",
            "review_score": "1"
        },
        {
            "review_text": "Game That Deserves A Sequel",
            "review_score": "1"
        },
        {
            "review_text": "Nominate this for 'GAME THAT DESERVES A SEQUEL'",
            "review_score": "1"
        },
        {
            "review_text": "Looking forward to playing the sequel sometime before the heat death of the universe.",
            "review_score": "1"
        },
        {
            "review_text": "Great story, but until they release Episode Three, I still feel incomplete.",
            "review_score": "1"
        },
        {
            "review_text": "'Game that deserves a sequel' award please. Gabe will know what to do",
            "review_score": "1"
        },
        {
            "review_text": "The final entry for a franchise that taunts its players for wanting more. Every polish is still as refined and was a blast to play.",
            "review_score": "1"
        },
        {
            "review_text": "a thrilling conclusion to the Half life series. It didn't answer all the questions, but just like real life, it can end suddenly at a moment's notice.    i give it my highest rating of two stars",
            "review_score": "1"
        },
        {
            "review_text": "Pros:    Gameplay    Story    Graphics   Cons:    The Wait for Half Life 3  ",
            "review_score": "1"
        },
        {
            "review_text": "amazing i love it a love the hunters",
            "review_score": "1"
        },
        {
            "review_text": "Yet again the only game series that actually gets my heart racing.  110% must buy if you have played HL2  Just waiting for HL3 now... ",
            "review_score": "1"
        },
        {
            "review_text": "big black man ♥♥♥♥♥ shoots a septic facial so you can suck down the juices right into your fetal bug brained penorse mythology of a ♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "Amazing. One of the best games I've ever played. I told my friend that I have never legitamtely beaten a Half Life game, so I was going to beat all of Half Life. When it came to Episode 2, I was amazed better graphics, gameplay, and feel. It was intense, amazing story, and jesus christ did I love the cliffhanger.",
            "review_score": "1"
        },
        {
            "review_text": "Incredibly action packed and amazingly fun. This makes me wait for half life 3/ half life 2 episode 3.",
            "review_score": "1"
        },
        {
            "review_text": "My favorite of all the Half Life games. Absolutely spectacular balance of linear and open ended gameplay and a nice change of scenery. I just want to smack the person who designed the final boss battle upside the head...it's genious, but super frustrating :/",
            "review_score": "1"
        },
        {
            "review_text": "I'd give this a λ / 3  Make you want more Half-Life",
            "review_score": "1"
        },
        {
            "review_text": "One of the best experiences ive ever had while playing a game! I love the Half Life series and for it to end in this way, or rather not end..? Is why I realise Half Life 3 should be made. Compared to the other Half Life games, this by far has the best graphics and story line and I felt they did everything right in this, unlike the other games this had the perfect balance of action and story. It ends on the weirdest possible moment, so..HL3 confirmed?",
            "review_score": "1"
        },
        {
            "review_text": "This game was FANTASTIC. It is easily one of my favorite games to date now. Half-Life 2: Episode 2 is an amazing game, I can't even describe why. DO NOT look up ANYTHING about this game, it is too great to be spoiled. It's not the best game ever, but it is really fun! I loved this more than Episode 1, and there were some parts in this game that I enjoyed more than some of HL and HL2's levels. This is more open than Episode 1, which means there are a ton of ways to take down baddies. There is only one part of this game that I didn't like, and that is a certain level that is a bit tedious and you need to backtrack a lot. Other than that the only terrible thing is the wait for Episode 3 and HL3. If you haven't played HL2, and Episode 2, you will be lost, so play those games first. 9/10 in my opinion.",
            "review_score": "1"
        },
        {
            "review_text": "very good... but can someone get me beta code?(sorry beta looks better) 20/20",
            "review_score": "1"
        },
        {
            "review_text": "play this and join the rebel for HL3",
            "review_score": "1"
        },
        {
            "review_text": "GAME THAT DESERVES A SEQUEL",
            "review_score": "1"
        },
        {
            "review_text": "Nominated for 'GAME THAT DESERVES A SEQUEL' AWARD",
            "review_score": "1"
        },
        {
            "review_text": "Nominated. This series - the story, the world, and the characters - stay with you.",
            "review_score": "1"
        },
        {
            "review_text": "Should totally win Test of time category. Not only is one of the greatest games ever made, We are still waiting more of it years later...  Talking about test of time...",
            "review_score": "1"
        },
        {
            "review_text": "If you haven't already, nominate this for 'GAME THAT DESERVES A SEQUEL'. You know it does.",
            "review_score": "1"
        },
        {
            "review_text": "This game is mandatory for any steam user, a great game all around, can't wait for the sequel.",
            "review_score": "1"
        },
        {
            "review_text": "The story is amazing and i can't wait for the next one...! When ever that will come.",
            "review_score": "1"
        },
        {
            "review_text": "This is a pretty cool game, I suggest you nominate it for 'Game that Deserves a Sequel'",
            "review_score": "1"
        },
        {
            "review_text": "GAME THAT DESERVES A SEQUEL",
            "review_score": "1"
        },
        {
            "review_text": "Most deserving of a sequel 2016.",
            "review_score": "1"
        },
        {
            "review_text": "Buy it, buy it now. I don't think you will regret it. ",
            "review_score": "1"
        },
        {
            "review_text": "So good. pls more",
            "review_score": "1"
        },
        {
            "review_text": "Beautifully written and executed sequel to the sequel to the sequel. Good pacing, mix of action and puzzles, and a silly little gnome that you can cart around through the whole game!",
            "review_score": "1"
        },
        {
            "review_text": "2nd time playing it through. Did the Gnome achievment which was awesome. This game is a great addition to the series, and I anxiosuly await the next installment. Challenging, but not overly so.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best PC games ever . A Valve masterpiece and much more . But by completing this game a curse is put on you , now you will have to wander the hole earth for that that little star , Half-Life 3 ..... WHERE THE F%U&amp;K IS HL 3 ??? ",
            "review_score": "1"
        },
        {
            "review_text": "Simply the Best HL2 episode!!!",
            "review_score": "1"
        },
        {
            "review_text": "Great short game. Sad thing is, Valve never finished the story, so you'll be left with a huge cliff hanger that may be never concluded. That's the only complaint. This game is good from the beginning to the end, it's the highest moment of the Half-Life franchise.",
            "review_score": "1"
        },
        {
            "review_text": "Half Life 2 Episode 2.... did you like the story, and gameplay to Half Life 2, and Episode 1, you will like the story to episode 2. If you did you will like this. It is a continuation to the epic story from Half Life 2, and Half Life 2 Episode 1.  Pros. -Great graphics considering its age (over 10 years old) -runs great even on low end machines. -epic story -good weapon selection -good AI  cons: my main gripes about Episode 2 is the same as Episode 1, do not take this as a do not buy this however. I bought this game again even though I own it already on XBox 360 and played through it again here. I love this game :).  -In Episode 1 and Episode 2 there are no new weapons. -In episode 1 and Episode 2 the story length feels short (the episodes are however cheaper than the base game) -No full controller support (This game does not work witha controller like with the 360.) It is not a big deal, but to say partial controller support is spinning the truth. You cannot celect all of your weapons with a controller. This seems like something that could have been fixed with a patch.  All said and done I did play this with a keyboard and mouse. IT was a blast, and the computer version was converted to use a controller (even if with poor support,) so playing with a keyboard and mouse like old school games is no big deal. If you do not already own this game BUY IT, YOU WILL NOT REGRET IT.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing Game And What An Ending! (Wont Spoil) :)",
            "review_score": "1"
        },
        {
            "review_text": "Now this sequence they hit right in the spot. Great vistas, nice feeling of the atmosphere. The final fight using the car is fantastic.",
            "review_score": "1"
        },
        {
            "review_text": "Should really say something about this one ?",
            "review_score": "1"
        },
        {
            "review_text": "Although this was my least favorite out of any of the half life series, I must say it was still phenomenal and a must play! Like everyone else has stated it is a huge cliff hanger but I'm sure Valve does these things on purpose to keep the large customer base hanging on for the next game...if it ever shows up that is lol.  Buy it. Play it.",
            "review_score": "1"
        },
        {
            "review_text": "Still waiting on Half Life 2: Episode Three Gabe, common! Its been 8 years and its still leaving a gripping tale left untold!",
            "review_score": "1"
        },
        {
            "review_text": "Half-Life 2: Episode Two continues where Episode One's cliffhanger left off.  Episode 2 is the best HL2 episodic content to date. New and large outdoor locations, 4 new enemies added to the roster for you to dispatch, and a awesome muscle car. The story is great and keeps you hooked. There are quite a few new allies to meet and interact with and the battles are just great.",
            "review_score": "1"
        },
        {
            "review_text": "It is the third half life 2 game. I am confused",
            "review_score": "1"
        },
        {
            "review_text": "As adventures of Gordon and Alyx continues, the story unfolds further, leading to the climax in highly anticipated Episode 3.",
            "review_score": "1"
        },
        {
            "review_text": "Now I get why everyone wants HL3. Hell, just play this game.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "EPIC! I WILL TEACH A COMBINE HIS LESSION IN EP3! AFTER WHAT THEY HAVE DONE TO ELI!",
            "review_score": "1"
        },
        {
            "review_text": "Best waiting simulator. 99/10",
            "review_score": "1"
        },
        {
            "review_text": "I finally know how to count to two!",
            "review_score": "1"
        },
        {
            "review_text": "Half-Life 2: Episode 2 is an excellent continuation of the series, and introduces several fun new enemies and challenges, along with the unforgettable muscle car. I found it to be the most intense and difficult game of the Half-Life 2 anthology, especially in the finale (even on Easy). Episode 2 thrusts you back into the H.E.V. Suit of Gordon Freeman once more, but in a completely new forested environment. As the game progressed, I found it even more emotional than all the precursors, as well as giving a strong sense of buildup to a climax (HL3, anyone?). However, this Episode is not all glitter and sparkles. I did find the first hour or so of gameplay to be a bit redundant, but after that, it sucked me right back in. Anyway, Episode 2 is still a worthy addition to the franchise and a must-play for anyone remotely interested in the series, and still a great experience for anyone else. Totally worth buying.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great! I love every bit of it. The cars, The guns, the story, And every dang headcrab. I'm not gonna lie, I cried at the end. I nominate this game for the steam awards, 10/10. You done good Valve.",
            "review_score": "1"
        },
        {
            "review_text": "you know what we want valve",
            "review_score": "1"
        },
        {
            "review_text": "Done!  The GAME THAT DESERVES A SEQUEL award!",
            "review_score": "1"
        },
        {
            "review_text": "Really good, deserves a sequel",
            "review_score": "1"
        },
        {
            "review_text": "It does deserve a sequel! So nominate it for 'Game That Deserves A Sequel' award, please!",
            "review_score": "1"
        },
        {
            "review_text": "This game honestly just needs a sequel so badly, it's such a great game",
            "review_score": "1"
        },
        {
            "review_text": "GAME THAT DESERVES A SEQUEL",
            "review_score": "1"
        },
        {
            "review_text": "Valve, I've almost finished my education and the sequal to this isn't released. Release it one day, and make it the greatest game of all time, so good that nothing will ever top it.",
            "review_score": "1"
        },
        {
            "review_text": "A wonderful franchise that I dearly love, I hope to see it continued someday.",
            "review_score": "1"
        },
        {
            "review_text": "Well yeah it's half-life doesn't matter if it's generic or not, you just loving being gordon freeman, not sure why to be honest, I mean it really is a generic shooter.   I really can't explain it, I wish I could, something about the game.",
            "review_score": "1"
        },
        {
            "review_text": "Nominated this game for The “Game that most deserves a sequel” Award ",
            "review_score": "1"
        },
        {
            "review_text": "It's been 9 years since the girl started crying. Today, she's still there, by the side of his father. Nothing is more heartbreaking than this.",
            "review_score": "1"
        },
        {
            "review_text": "Vote this for 'GAME THAT DESERVES A SEQUEL' in The Steam Awards!",
            "review_score": "1"
        },
        {
            "review_text": "God this game needs a sequel.",
            "review_score": "1"
        },
        {
            "review_text": "GAME THAT DESERVES A SEQUEL !!!",
            "review_score": "1"
        },
        {
            "review_text": "the one that must have a sequal",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ing great. NOW WERE IS MY SEQUEL",
            "review_score": "1"
        },
        {
            "review_text": "A great game, but unfortunately let down by the lack of a sequel.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ing great. NOW WERE IS MY SEQUEL",
            "review_score": "1"
        },
        {
            "review_text": "I cannot say anything that hasn't already been said. Simply fantastic game.",
            "review_score": "1"
        },
        {
            "review_text": "Nominated for 'We need a sequel award'",
            "review_score": "1"
        },
        {
            "review_text": "Definitely a game that deserves a sequel.",
            "review_score": "1"
        },
        {
            "review_text": "Nominated for 'GAME THAT DESERVES A SEQUEL' !",
            "review_score": "1"
        },
        {
            "review_text": "Just make a sequel to this game already !",
            "review_score": "1"
        },
        {
            "review_text": "Great game. A sequel would be nice.",
            "review_score": "1"
        },
        {
            "review_text": "I nominated for 'GAME THAT DESERVES A SEQUEL' Award",
            "review_score": "1"
        },
        {
            "review_text": "I think this game should win the award for the most anticipated sequel.  GabeN... Give us EP3 or HL3!",
            "review_score": "1"
        },
        {
            "review_text": "now to wait for part 3...",
            "review_score": "1"
        },
        {
            "review_text": "Nominate for 'GAME THAT DESERVES A SEQUEL'",
            "review_score": "1"
        },
        {
            "review_text": "I know Valve doesn't want to make another episode because they're already making so much money with micro-trans and with Steam, TF2, CS:GO, Dota 2, etc. But with anything they have got can you make Episode 3 or Half-Life 3 just because you love us as a community? Or atleast make it final that you're not making it. Please Valve talk with us! Half-Life, Half-Life 2 and Half-Life 2 Episodes rated by me is a 10/10!",
            "review_score": "1"
        },
        {
            "review_text": "Not the best of the half-life series, but a great game nonetheless.",
            "review_score": "1"
        },
        {
            "review_text": "oh wow I am very extremely what this will be in the future ",
            "review_score": "1"
        },
        {
            "review_text": "Nominate this for 'GAME THAT DESERVES A SEQUEL'",
            "review_score": "1"
        },
        {
            "review_text": "The most insane cliff-hanger of all time.",
            "review_score": "1"
        },
        {
            "review_text": "WOW!!!! For some reason I couldn't remember playing this after it come out in 2007. I think it was something to do with the episonic releasing format and I wasn't going to be a part of that then. Anyhow, flash forward to 2016 and I'm playing through all the halflife games front-to-finish. This one surprises me, had me by the nose the entire game and I couldn't put it down or walk away. Finished it finally and NOW after all these nine years I see why everyone has been harping on 'WHERE IS EPISODE 3? Where is HL3?!?!?!' Just amazing. I love it! Want more. Want to stomp those suckers too! Can't wait for the future of this series. Well... guess I will be, but.... Hey Valve! Hurry up and take my money! PLEASE. :)",
            "review_score": "1"
        },
        {
            "review_text": "Much better than the first episode and that is saying a lot, considering this is an expansion it provides a lot of content and if you are a fan of the original you already own and beat this haha, but if you are not consider getting the original and both addons, you won't regret it.",
            "review_score": "1"
        },
        {
            "review_text": "THE BEST STARTREK GAME EVER MADE",
            "review_score": "1"
        },
        {
            "review_text": "Find out for yourself why so many people want Half-Life 3",
            "review_score": "1"
        },
        {
            "review_text": "ah... a new half life game still not 3 but i will try it start: ok so the train got trashed now i got to make it on foot what a new portal?!? this is strange wow it helped me thanks! ok combine and any lions not to hard ok so the combine are trying to make a portal for combine enemys to come to this world ok seems like the plot of the last one but hey we are on the move what?!? what was that thing?!? we seen it in ep 1 ah no alex look out! noooooo!!!!!!!!!!!! why?!? oh hey the aliens crow bar is blocking the elevator from working nice ahhhh!!!!!!! final: ok so i got to defend the bomb from striders pretty simple ok that was hard now lets move on yes the bomb destroyed it oh no that thing again! noooooooooooooo!!!!!!!!!!!! why?!? thats the end? hmm 7/10 and thats my first time playing it",
            "review_score": "1"
        },
        {
            "review_text": "This is the definition of 'Why not game?' I will have to do 9.5/10 because there are glitches so bad that make some chapters unplayable. But it's Half-Life, so you kep on pushing (or killing).",
            "review_score": "1"
        },
        {
            "review_text": " ———  9/10  ———    + Level Design/Aesthetics + Kinaesthetics + Difficulty Fairness/Gameplay Diversity + Achievements +  AI  + Score + Lore  -  Characters development /Narration -  CLIFFHANGER!!!   Recomended  controls scheme :  PC  Recomended  difficulty :  Hard ",
            "review_score": "1"
        },
        {
            "review_text": "is Half-Life 3 comfirmed :3  ",
            "review_score": "1"
        },
        {
            "review_text": "+1",
            "review_score": "1"
        },
        {
            "review_text": "Where HL2's third day was slow and boring, and Episode One was claustrophobic and close-quarters, Episode Two provides a new experience for the series.   The environments are open and beautiful, and the new vehicle, an old 1970 Dodge Charger, along with the new vehicle physics system makes this vehicle leagues abouve the buggy from HL2.  Victory Mine, the Radio Station, the White Forest Inn, and of course White Forest Missile Base all provide new environments that give different and new experiences to the series.  Arne Magnusson, Uriah, Eli, Kleiner, the Vortiguants, and of course the dynamic duo of Sheckley &amp; Griggs each provide engaging dialogue with everyone, even though Gordon as usual speaks not a word.  The ending however, leaves a feel-bad hole, even now almost six years after first playing it. The fact that we don't have HL3 or Episode Three to see the conclusion makes the ending of the game almost surreal, as we have an incomplete story.  One last thing, that damn gnome, Rufus, is just plain evil. If you're going for 'Little Rocket Man', be prepared to use your quicksave key frequently.",
            "review_score": "1"
        },
        {
            "review_text": "Gabe Newell has officially pimp-slapped all of us with the greatest cliffhanger of all time...  7.5/10 would get pimp-slapped again....",
            "review_score": "1"
        },
        {
            "review_text": "half life 3 ?",
            "review_score": "1"
        },
        {
            "review_text": "Pretty nice but it didnt feel like the end..",
            "review_score": "1"
        },
        {
            "review_text": "The game that just won't ♥♥♥♥ing end lol. And I have a feeling that valve will never make the third episode...",
            "review_score": "1"
        },
        {
            "review_text": "if you own half-life 2 epiode one and blackmassa you will cry at the end becuse the good days backthen i love this game i give it a 10/10 for every thing i hope half-life 2 episode three come out then i am going give it a 20/20",
            "review_score": "1"
        },
        {
            "review_text": "Don't like that they ended on a cliffhanger. It's a good game and works fine.  I am downvoting this one for Valve not finishing the trilogy.",
            "review_score": "-1"
        },
        {
            "review_text": "Hahahaha look at all these losers crapping up the review section for their badge. Look at me contributing.  But yeah, this is a masterpiece. Get it. Just like I just got my 100XP.",
            "review_score": "1"
        },
        {
            "review_text": "This installment of the series does an impeccable job introducing players to the mysteries and plot points that will presumably continue to shape the trajectory of the overall story following the climactic end of Half Life 2. Like effectively everyone else who's played the games. I'm still quite avidly awaiting its sequel in spite of the delay.",
            "review_score": "1"
        },
        {
            "review_text": "✔",
            "review_score": "1"
        },
        {
            "review_text": "loljk this is better",
            "review_score": "1"
        },
        {
            "review_text": "Great game definitely deserves a sequel. A big cliffhanger in the end.",
            "review_score": "1"
        },
        {
            "review_text": "Can't recommend this game because Valve will never make Half-Life 3.",
            "review_score": "-1"
        },
        {
            "review_text": "Where da fuq is da theird",
            "review_score": "1"
        },
        {
            "review_text": "  The black guy dies.    10/10, GabeN is racist",
            "review_score": "1"
        },
        {
            "review_text": "I love half life games",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games i ever played. Great Story, Great Gameplay, Great Ending. Half life 3 confirmed.",
            "review_score": "1"
        },
        {
            "review_text": "Half-life 3 ? :c",
            "review_score": "1"
        },
        {
            "review_text": "where is the third one ? xd",
            "review_score": "1"
        },
        {
            "review_text": "The game went by fast for me, stil amazing and fun. But that god damn gnome, welp, time to go spend 6 hours trying to send him to space!",
            "review_score": "1"
        },
        {
            "review_text": "Nominated for “LONGEST WAIT FOR SEQUEL RELEASE” Award",
            "review_score": "1"
        },
        {
            "review_text": "See my Half Life 2 Review.",
            "review_score": "1"
        },
        {
            "review_text": "Please Gabe, i am begging you for half life 3! Then you can work on portal 3, then Team Fortress 3 and yada yada yada..... Anyways i need you to make half life 3! I NouEED IT! When episode 2 was done, i cryed! Eli.......! I must play hl3! I must see the Borealis! I played Portal 2! I KNOW THE BACKSTORY! But i need it!  please Gabe, im counting on you.................... ANYWAYSE EVERYONE PLAY THE HALF LIFE SERIES!!!!",
            "review_score": "1"
        },
        {
            "review_text": "EPISODE THREE",
            "review_score": "1"
        },
        {
            "review_text": "Me: Mr.Newell, how many leaks will it take to get 3? Gaben: Lets see if I know... A, One! A, Two! , A, Four! *DELAY*   How many leaks will it take to get 3? THE WORLD MAY NEVER KNOW....",
            "review_score": "1"
        },
        {
            "review_text": "Half-Life 1 Gordon is stronger than Half-life 2 Gordan 1 + 2 = 3 Half-Life 3 isn't coming out",
            "review_score": "1"
        },
        {
            "review_text": "volvo wheres hl3",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "Its awsome!",
            "review_score": "1"
        },
        {
            "review_text": "I saw one of the worst things imaginable in the past two episodes...  A man ♥♥♥♥♥ in the neck by an alien thing and an old man ♥♥♥♥♥ in the neck by an alien thing.  10/10 wouldn't hear Alyx cry again",
            "review_score": "1"
        },
        {
            "review_text": "7.8/10  Too much Freeman",
            "review_score": "1"
        },
        {
            "review_text": "9/11 would noclip again",
            "review_score": "1"
        },
        {
            "review_text": "Someone got hurt bad.... 10/10 Would see someone get hurt again",
            "review_score": "1"
        },
        {
            "review_text": "Get this. Then download Nightmare house. I'll love you long time.",
            "review_score": "1"
        },
        {
            "review_text": "This game deserves a sequel. Make Half Life Great Again.",
            "review_score": "1"
        },
        {
            "review_text": "Nominate this for 'GAME THAT DESERVES A SEQUEL'",
            "review_score": "1"
        },
        {
            "review_text": "Nominate this for 'GAME THAT DESERVES A SEQUEL'",
            "review_score": "1"
        },
        {
            "review_text": "The best episode.",
            "review_score": "1"
        },
        {
            "review_text": "This episode could stand on its own as a sequel. Makes the HL universe feel less claustrophobically boxed-in.",
            "review_score": "1"
        },
        {
            "review_text": "Nominate it for the game that deserves a sequel award.",
            "review_score": "1"
        },
        {
            "review_text": "A wonderfull game, i loved every minute of it. The only thing that i really can't take without feeling sad is the ending.  The story in Half-Life 2 is just so touching. Good Job Valve. I'm proud of you all! (Except Robin)",
            "review_score": "1"
        },
        {
            "review_text": "I am nominating this for the 'game most deserving of a sequel.' reward because I am unfunny, unoriginal, and don't know when a joke is dead",
            "review_score": "1"
        },
        {
            "review_text": "Do not finish this game, it didn't want to finish itself.",
            "review_score": "-1"
        },
        {
            "review_text": "I'm waitting for Half life 3....... Hunters!?.....Hunters?!...Hunters Everywhere.",
            "review_score": "1"
        },
        {
            "review_text": "Half life 2 electric bad game episode worst game",
            "review_score": "1"
        },
        {
            "review_text": "Come on Valve, I wanna Ride the Chopper already.",
            "review_score": "1"
        },
        {
            "review_text": "episode 3 is never coming out",
            "review_score": "1"
        },
        {
            "review_text": "Half-life 2 Episode Two is a sequel of Half-life Series..  Now Let's review it!  The Gameplay: It's kinda improve and now there's new enemies such as the antlion ones... Weapons are still the same by the way.. no improvement for the weapons.. The Game is quite easy when you know how they act..  The Graphics: Now I've seen a lot of texture's improvement on Half-life 2 Episode 2, it has a massive of Texture's improvement all around me... Now you can't still see the difference? I play on 1080p with it's highest Settings.. as possible in anyway.. Now I don't really care about the graphics, but the game is smoothly and it's simply.. beautiful.  The AI's *Artifical Intelligence*: Still the same as Half-life 2 and Half-life 2 Episode 1  Rating: 8.5/10 Why? The Ending is very dissapointing... now we're still waitng for Half-life 3, I hope it's good... we hope it's good..  Alyx didn't get any improvements... just the wound on the back.. If there's at least a Weapon Improvement I would be gladly to put my ratings to 9 and a bit of bugs around me.. That's all, I highly suggest people buy this for the ones only who really likes Half-life Series or First Person Shooter Game *Sci-Fi*",
            "review_score": "1"
        },
        {
            "review_text": "ayyyyyyy lmao half life 2 still sucks get over it you cucks. you know it sucks but can't get the taste of gabe's chode out of you're mouth. bring it fanboi's",
            "review_score": "1"
        },
        {
            "review_text": "Failed To Load The DLL  The Specified Module Could Not Be Found  How to fix? please help.",
            "review_score": "1"
        },
        {
            "review_text": "You get to squash maggots and then find out after you're outside the lair, you squashed them all but One and have to redo it all over again from the start. Oh yeah, also Gabe is fat and he keeps delaying Episode 3 and Valve shouldn't announced Half-Life 3 and the new engine already.",
            "review_score": "1"
        },
        {
            "review_text": "Abandoned by developers.",
            "review_score": "-1"
        },
        {
            "review_text": "Please stop :(",
            "review_score": "-1"
        },
        {
            "review_text": "Thia is a terrific continuation for the legacy of Half-Life 2. I had alot f fun, until the very end, where all the Striders attack. ♥♥♥♥ that part, it almost ruined the game for me. 6/10",
            "review_score": "-1"
        },
        {
            "review_text": "it been nearlly nine years and episode 3 isnt out yet...",
            "review_score": "-1"
        },
        {
            "review_text": "Found the litte smrf man under table thing  make it half way thought the game  forgot to put him in the lift  got mad  uninstalled  1/10",
            "review_score": "-1"
        },
        {
            "review_text": "The only game in your life that you'll say 'Wait why are the credits rolling with like 5 hours of gameplay left?'",
            "review_score": "-1"
        },
        {
            "review_text": "This episode has the best shader in the half life 2 series lol ! =))",
            "review_score": "-1"
        },
        {
            "review_text": "Atrocious graphics and Non- Existent Micro-transactions!! 😠 😠 😠 😠",
            "review_score": "-1"
        },
        {
            "review_text": "VALVe? Are you there? Why did you become such a greedy monster? Why your interests only contain money in it? Why do you produce only a wasting time games? Why do you create so many cheaters? Why don't do anything about it? Why did you become such a mistake?  I guess it's over for you. Sleep tight my old friend. You are dead for me...",
            "review_score": "-1"
        },
        {
            "review_text": "Gabe : the thing about episodes is we can make more in periods of time rather than taking years on one whole game.     Half life 3 is never coming out kids.   ",
            "review_score": "-1"
        },
        {
            "review_text": "If and when this game loads it will lock up during play. Do not buy this one! Steam support does not exist.",
            "review_score": "-1"
        },
        {
            "review_text": "this error is apperently still not fixed 'Engine Error: Could not Load Library Client'. I can NOT play the game I have PAID for ! Waste of money !",
            "review_score": "-1"
        },
        {
            "review_text": "Episode Two? more like episode Poo, just like the original game this game isn't actually fun to play it's basically just a maze cluttered with stupid junk like weapons and bad guys and rubble that no one understands.  Once again you're stuck with a boring protagonist who obviously has a bad case of Aphasia, combine that with a name like Gordon and you have a character with the story depth of a brick from super mario bros.  You spend this whole game trying to smuggle a gnome through the combines base just to get a ♥♥♥♥♥♥ achievement and so you can witness this games inferior physics engine when games like grand theft auto III have a way better physics engine and that game came out in like 1985 and HL2 Ep2 was released in like 2002?  2/10 - hl3 shouldn't be released.",
            "review_score": "-1"
        },
        {
            "review_text": "Why do you sell a CD when I have to download the damn thing anyway. What happened to games that you just install and play !!??!!??!!??",
            "review_score": "-1"
        },
        {
            "review_text": "This episode is ♥♥♥♥ing ♥♥♥♥♥♥♥t, I died 50+ times on the part where you have to fight the striders....still didn't beat it dont buy this piece of ♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "Fun game. A little too frustrating and not very fun at the last battle. Other than that it is very fun gameplay wise. Very dissapointed that the story was not finished and was left open for a sequil!",
            "review_score": "1"
        },
        {
            "review_text": "This game made me understand why people wnat Half Life 3 so bad If you hate cliffhangers, this is not for you",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game. Just can't wait for Episode Three.",
            "review_score": "1"
        },
        {
            "review_text": "When jupiter and the other planets come in one big line Gabe Newell will tell the crew at Valve HQ will suddenly start developing a game, a game that will be a phenomenon the game were all waiting for...                       RICOCHET 2!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "From the day I finnished playing the last episode of HL2 (so far I hope) I feel like the half of my body is gone ...",
            "review_score": "1"
        },
        {
            "review_text": "Amazing. Just wondering where Half Life 3 is...",
            "review_score": "1"
        },
        {
            "review_text": "5/5 stars Waiting for episode 3",
            "review_score": "1"
        },
        {
            "review_text": "You owe it to yourself to finish this.",
            "review_score": "1"
        },
        {
            "review_text": "Have to say, this is a good continuation from the Half-Life 2 plotline in what happening in the after match and hopefully the reason was Half-Life 3 has still not been released, so much plotline to explore! So throw in some more Freeman, some interesting new characters and a trippy mission to try and meet up with the family and you've got HL2 EP2. It's an enjoyable play, though the last level with the walkers is solid if you're not in the zone!",
            "review_score": "1"
        },
        {
            "review_text": "Good game but they need to make episode 3  ",
            "review_score": "1"
        },
        {
            "review_text": "Not much to say. Much better than the first episode, its a shame there was never a third.",
            "review_score": "1"
        },
        {
            "review_text": "amazing game and instant favorite",
            "review_score": "1"
        },
        {
            "review_text": "its glitchy and crashes for me",
            "review_score": "1"
        },
        {
            "review_text": "Half Life 2 Ep 2 Been awhile since played and still enjoy played Ep1 last week . This and System Shock 2 If I remember correcty are the 1st Pc Games I played. The fact that today still playing says how good these game were back then. I see alot of todays games from these. If you do not have these games I say buy. They are still a challenge in a good way.",
            "review_score": "1"
        },
        {
            "review_text": "The part where you need to defend white forest from the striders is immpossible because my car was trashed in the wreckage of the sawmill, so i cant use it. also, since i have no ammo, and you cant find any, the hunters blow up the sticky boms as soon as i pick them up. i cant kill the striders in time. ♥♥♥♥ this part.",
            "review_score": "1"
        },
        {
            "review_text": "This final part to the Half-Life 2 franchise is well thought out and worth every penny, adding new gameplay mechanics and opening the final door into the world on HL2 mods. I fully recommend this game as it to offers a continuation to Episode one and sets the stage for the proposed Half-Life 3 that will hopefully be released with the steam box later this year. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "It's freakin' Half-Life.",
            "review_score": "1"
        },
        {
            "review_text": "Half life is a really great game! I like this series and it is fascinating me alot. Here game physics is fantastic. However something that I liked 10 years ago in HL1 is so boring today. I can't stand of one long corridor through all the game. Only one door you can open, only one way to the end =( . I hope they will add more freedom in future!",
            "review_score": "1"
        },
        {
            "review_text": "Very nice, i recommend this game to every shooter lover out there !",
            "review_score": "1"
        },
        {
            "review_text": "The best zombie shooter cooperative game of all time... :)",
            "review_score": "1"
        },
        {
            "review_text": "just 1 advice! they could use more soundtracks in this game, i mean not playing 1 soundtrack the hole game but many more tracks than the usual, cus they are GOOD with the atmosphere enviroment and everything; i know they put it like the start of an scene but they could make more impact in this game with a more enviromental feeling.",
            "review_score": "1"
        },
        {
            "review_text": "Still waiting...",
            "review_score": "1"
        },
        {
            "review_text": "VERY interesting but one thing MAKE HALF LIFE TWO EP 3 and also gordon freeman a hero who is awakend once again fight with your trusty grav gun and crowbar and other munitions as your comrades aid you and help you ",
            "review_score": "1"
        },
        {
            "review_text": "Now I See Alyx being stomped by a Hunter poor alyx :( AWESOME GAME DOE",
            "review_score": "1"
        },
        {
            "review_text": "Same as HL2 only with a +3. (+2 is for the flirty Alex)",
            "review_score": "1"
        },
        {
            "review_text": "Episode 2 is a great edition to the Half-Life Series. Episode 2 excels in all that Half-Life 2 did, with one difference. Episode 2 has the best battles than any other game. The first of which is the Vortigant/Antlion battle in the mines. This battle stood out to me becuase of the 2 stages of the battle one where you control the turrets and the other fighting alongside the vortigants. The other exceptional battle was the final strider battle. In the first game Valve introduced Striders, however they were difficult to defeat. This time they added in a new weapon to help defeat the striders. To make up for the lost difficulty they added hunters that needed to be killed before all of the striders. To me, Half-Life 2 Episode 2's final strider battle is the best boss battle I have ever seen in a game, making HL2: EP2 one of my favorite games.",
            "review_score": "1"
        },
        {
            "review_text": "Perfect game,i hope they will make EP 3 or Half-Life 3 really soon,cause Half-Life series is just amazing!",
            "review_score": "1"
        },
        {
            "review_text": "The final known installment of the Odyssey of Gordon Freeman, the universe's most powerful mute, Episode Two picks up after the last one and promptly continues with some interesting plot twists and then everything sorta ends... Like the games before it, its a polished sci-fi horror adventure game with old school shooting mechanics and physics puzzles galore! The game can be completed in about 6-7 hours and like the one before it is not bad considering the price (though i bought it at 1.99 instead of the regular 7.99). The adventure is enjoyable and the end is nicely climatic, the only issue i have is that when you find your self in a dilapidated mineshaft or tunnel or enclosed area or warehouse you can predict what's coming at you (Hint: It's zombies and headcrabs), and there seems to always be reasons for Gordon to have to travel to these places. Other than that, everything is quite peachy. Be warned, like the installment before it, don't get it until you've played Half Life 2 and Episode One (in that order) before hand. There is nothing to get you up to speed and remember that there is a reason why Valve fans have abandonment issues.",
            "review_score": "1"
        },
        {
            "review_text": "This episode is honestly even better than the past HL2 games. Just be sure to keep a box of tissues next to you because the ending...",
            "review_score": "1"
        },
        {
            "review_text": "At this point i'm just writing recommendations because screw it. Short as well but it came with Portal, Half Life 2 +Ep1 and TF2. At the time, this was great value.",
            "review_score": "1"
        },
        {
            "review_text": "app id is 420",
            "review_score": "1"
        },
        {
            "review_text": "The best half-life there is. They took the best of all the HL2 and merged it together. The gameplay changes up enough to stay fresh, but always feels like the same game. The plot picks up quite a ton, and it is what makes the series worth playing. Also, one of my Top 10 games of all time. (Including HL2/EP1)",
            "review_score": "1"
        },
        {
            "review_text": "A greate Episode of Half-life 2. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Half-life 2 episode two. Now if you want to know about Half-life 2 in general, please look at my half-life 2 recommendation. This game was really fun to play and ended on a cliffhanger...I can not wait for valve to bring out episode 3 so we can see more of their great game making skills.",
            "review_score": "1"
        },
        {
            "review_text": "Wow, probably the greatest FPS I ever played. Perfectly paced with excellently designed levels. Only problem is that the ending leaves you wanting more but Half-life 3 is no where in sight.",
            "review_score": "1"
        },
        {
            "review_text": "A further continuation to the HL series, this particular episode is probably the weakest written of all of them, but the gameplay stays solid. It innovates in a few areas (as each of the games tended to do) and keeps a few other concepts more or less the same.  There are a few arduous parts, but for the bulk of it, continues to shine as an excellent source of entertainment. Thumbs up and recommend for consumption after HL1, HL2, &amp; HL2: Ep 1.  Many have heard about the controversial ending. I find it to be (definite spoiler alert)   kind of nice that tragedy is not beyond the writers at Valve. Stories are not meant to be meaningless 'hero saves the day' / 'Hero's journey' clones. Stories are snippits from life that have both good AND bad endings. Stories tell of what happened, not a useless formula of success. Stories force us to deal with loss--the minor, the profound, and the unavoidable. We have mostly gotten into the habit of looking for that good ending. We rarely see a movie or game written where victory isn't assumed. I find this refreshing to hear of a fictional misery, because it's so raw and real, and because it's fiction, we can face the troubles without practical consequence. Kudos to the writers for slapping us in the face, and doing so as effectively as they did here.  ",
            "review_score": "1"
        },
        {
            "review_text": "96%",
            "review_score": "1"
        },
        {
            "review_text": "Easily my favorite of the two Half-Life episodes (though I still recommend anyone to play the first one in order to understand what's going on, obviously). I was a bit skeptical, and honestly a little tired of the formula of the Half-Life games and had a lurking suspicion that Episode Two would just follow a stream of monotony. But of all four Half-Life installments, I'd definitely say this one had the biggest emotional impact on me. The moment that Episode Two hooked me, was when I had to avoid getting killed by The Guadrian down in the caves. I never felt such a strange experience of fear and adrenaline, as I'd hear The Guardian thumping down the halls and I'd race for the nearest hole to hide in.  Episode Two is filled with plenty more memorable moments beyond this. Without spoiling the story, there were plenty of moments I'd feel very unique emotions (stress, unease, sadness, relief) during some of the most enjoyable moments in the Half-Life series. The only problem I have with the game are it's plot conveniences. Like when you happen to find the vortigaunts after trekking through the maze of caves. Or how the vortigaunts are able to undo something that seemed to me already done (again, without spoiling anything). And of course, the semi-cliff-hanger ending. Episode One ended on more of a final note. Like the loose ends were tied, even though there was still something else to do. Episode Two leaves a wide open gap in story that I know plenty of gamers want to know (which now I completely understand, for the righteous frustration behind the Steam community's demand for Half-Life 3).  Despite these flaws HL2:E2 is, in my opinion, one of the better Half-Life games out there and succeeds a lot more in creative level design, unique puzzles, evocative story-telling, and just excellent variety in gameplay so you'll never be bored. A wonderful game, but a sad departure from the Half-Life series (hopefully, for now).",
            "review_score": "1"
        },
        {
            "review_text": "No more hugs and kisses from Alyx ;_; I wonder if they will still have a sex scene in Ep 3 0/10  Nah jk 10/10 Would headcrab again",
            "review_score": "1"
        },
        {
            "review_text": "I need help! When I start the game and load the first section, it always freezes for a short time. When it's not frozen anymore, it's still at the hl2 ep2 intro screen.",
            "review_score": "1"
        },
        {
            "review_text": "Love it!",
            "review_score": "1"
        },
        {
            "review_text": "In general, the game is really great. I like how they kinda added more to the antlions as in Half life 2 we didnt see too much of the antlions. Also in this game it does introduce new aspects that are amazing in my opinion, I recommend this game",
            "review_score": "1"
        },
        {
            "review_text": "the best paid game ever and when i downloaded this game it also down loaded hl2",
            "review_score": "1"
        },
        {
            "review_text": "a Half life 3 would probaly be so popular and good selling that it will be history, unfortauntly valve didn't made it yet  (i say yet cuz i think they wait on purpose)",
            "review_score": "1"
        },
        {
            "review_text": "Lots of action, scenery changes pretty often, very entertaining. Not too short, not too long.",
            "review_score": "1"
        },
        {
            "review_text": "I've gotta say this is probably the best first person shooter I know of. The storyline is extremely gripping and once you play it, you can't stop. What falls behind in the lack of multiplayer is made up for in the immense gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "After 8 years,, I finally got to play HL2:E2. Ok, so where's Half Life Episode 3?! 0_o Does everyone on Steam have to beat the Half Life series in order HL3 to come out!? UGH!",
            "review_score": "1"
        },
        {
            "review_text": "If you thought that Episode 1 was great, Episode 2 is arguably the better of the two episodic sequels of Valve's Half Life 2. This is mostly due to the increased number of assets added to the game, ranging from the new environments of White Forest and its surrounding countryside to the Antlion nest to especially the Hunters (or mini-striders as I once thought of them). If I remember correctly it was also a period of change for Source as it provided an update to the engine, not to mention the reference to everyone's favorite teleportation-based puzzle game.  I like Episode 2, but I also have a love-hate relationship with it, simply because I, like so many others out there, have been waiting far too long for Episode 3. I would really like to see an Episode 3...however with all the hype for Half Life 3 I feel like if Valve ever introduced an Episode 3 they'd likely start a World War 3. In any case, this is a definitely satisfying closure to the current events of Half Life 2.  If you've never played this game before, I recommend it; just so that you can be on the edge of that cliffhanger right along with the rest of us.",
            "review_score": "1"
        },
        {
            "review_text": "Better than episode 1, arguably better than Half life 2.",
            "review_score": "1"
        },
        {
            "review_text": "This game might have medium quality graphics but I'm going to tell you what really matters in the game, its the story. The story of Half-Life 2 Episodes 1 &amp; 2 is such an amazing experience. I was amazed at how little cut-scenes it had, but in my book cut-scenes are bad they're a waste of game time. All in all it's a great game, I would give it a 9.5/10          Also when you pin it to the task bar you get episode 1. That should be fixed.",
            "review_score": "1"
        },
        {
            "review_text": "Love this game",
            "review_score": "1"
        },
        {
            "review_text": ". . .",
            "review_score": "1"
        },
        {
            "review_text": "Great Game, great Story, awesome^^",
            "review_score": "1"
        },
        {
            "review_text": "It's more Half-Life 2.",
            "review_score": "1"
        },
        {
            "review_text": "Sequal to hl2 ep 1 and rly good, would be better if longer, but worth it still. =3",
            "review_score": "1"
        },
        {
            "review_text": "half life 2 is a great game and it about time for half life 4.",
            "review_score": "1"
        },
        {
            "review_text": "-towards the end of the game- (spoilers)  *awesome battle scene ends*,  'dang... I'm a boss at this'   Slowly walks through the halls as everyone cheers.. then Alex leads you through to see the enemy portal get blown up.  *enemy walks in*  watch as one of your favorite characters die...  credits roll... you feel a tear going down your face.   Gaben... why?  half life 2 season 2 ep 1 at least?     ",
            "review_score": "1"
        },
        {
            "review_text": "this was my first half life game ( i have to now (hl2 deathmatch and hl2 ep 2(this one im writing a review for) ) and i now know why everyone wants hl3!  Btw im looking forward for black mesa (its a game on steam (like hl) ) and im curios to see what changed. ",
            "review_score": "1"
        },
        {
            "review_text": "░░░░░▐▀█▀▌░░░░▀█▄░░░ ░░░░░▐█▄█▌░░░░░░▀█▄░░ ░░░░░░▀▄▀░░░▄▄▄▄▄▀▀░░ ░░░░▄▄▄██▀▀▀▀░░░░░░░ ░░░█▀▄▄▄█░▀▀░░ ░░░▌░▄▄▄▐▌▀▀▀░░ THIS IS BOB ▄░▐░░░▄▄░█░▀▀ ░░ ▀█▌░░░▄░▀█▀░▀ ░░ COPY AND PASTE HIM ░░░░░░░▄▄▐▌▄▄░░░ SO HE CAN TAKE ░░░░░░░▀███▀█░▄░░ OVER STEAM ░░░░░░▐▌▀▄▀▄▀▐▄░░ AND THAT WILL TELL VALVE ░░░░░░▐▀░░░░░░▐▌░░ TO GIVE US HALF LIFE",
            "review_score": "1"
        },
        {
            "review_text": "Probably one of my favourite from the HL2 episodes. I like how almost the whole game is set in a forest,   White Forest  . Great atmosphere.",
            "review_score": "1"
        },
        {
            "review_text": "Pls make HL3 already",
            "review_score": "1"
        },
        {
            "review_text": "Give us Half-Life 3 right off the bat!, LOl :)  9/10",
            "review_score": "1"
        },
        {
            "review_text": "I still want to ride in that helicopter",
            "review_score": "1"
        },
        {
            "review_text": "great, by far one of the best single player experiences i have ever had :D",
            "review_score": "1"
        },
        {
            "review_text": "Go to Half-Life 2 review its same as this one",
            "review_score": "1"
        },
        {
            "review_text": "too much overpowered vortigaunts in this game i feel sorry for the medic",
            "review_score": "-1"
        },
        {
            "review_text": "Hi i think about why is the game so short i mean why is there no borealis map and it all ended with elis death its a weird ending but can someone tell about there is a half life 2 episode 3 or half life 3???",
            "review_score": "1"
        },
        {
            "review_text": "  Half-Life 2: Episode Two  is a first-person shooter video game, the second episode in a series of sequels to the 2004 Half-Life 2.  Compared to HL2 and HL2 EP1, this is my favourite. Episode starts exactly after EP1. This time, main characters escaped City 17 with train and crashed. The main goal is to reach White Forest, bring data and launch rocket to destroy Combine portal...    VERDICT     Pros:",
            "review_score": "1"
        },
        {
            "review_text": "Worst 10+ year cliffhanger wait ever, for one of the best games ever made.",
            "review_score": "1"
        },
        {
            "review_text": "Half-Life 2 and its two additional episodes are genius, there's no denying it. The second instalment is better than the first (which is really saying something), capping off a landmark FPS which, I think, only the Metroid Prime trilogy matches. Everything's here from the trademark intensity to the scary stuff (being pursued by an outraged ant monster is terrifying) to the clever moments. A triumph!",
            "review_score": "1"
        },
        {
            "review_text": ":)",
            "review_score": "1"
        },
        {
            "review_text": "what if this game is updated to λ2.9 ¯\\_(ツ)_/¯",
            "review_score": "1"
        },
        {
            "review_text": "amazing, now when you finish it, you'll just become another one of us begging for half life 3",
            "review_score": "1"
        },
        {
            "review_text": "The reason I don't recommend this game is just because after like 4-5 seconds it freezes the screen so you can't see anything. I love half life but the game keeps glitching out but this has only happened with episode two. ",
            "review_score": "-1"
        },
        {
            "review_text": "Episode 3 is never coming out is it... this is still worth playing even though the story isnt complete. Its a must play if you like half life 2.  9/10 (Amazing)",
            "review_score": "1"
        },
        {
            "review_text": "I'm so jaded now thx Valve.",
            "review_score": "-1"
        },
        {
            "review_text": "it's great",
            "review_score": "1"
        },
        {
            "review_text": "A great game, but my game is plagued with game-breaking bugs.",
            "review_score": "1"
        },
        {
            "review_text": "It takes a lot of effort to make a gamer like me, a fan of headshots, fatalities, ludicrous gibs, someone to played Manhunt, Postal 2, brutal Doom, MK 10 and other ultraviolent games, to get so emotional with a game, you are ****ing geniuses, that story, that ending, those battles (although the elevator battle in the dark from ep1 takes the cake for me), those environments, this game, and the whole series is a masterpiece.  Would open another account to buy it again. Would hit my head to lose memory and live this game again.  MASTERPIECE",
            "review_score": "1"
        },
        {
            "review_text": "If you've played the earlier Half-Life releases it's worth a play through. Quite short story though, took me 6 hours to complete the entire game with no stress.",
            "review_score": "1"
        },
        {
            "review_text": "Waaay better than Episode one! and I liked EP1 a lot but this is much more like HL2.If you like HL2 this episode is a must!",
            "review_score": "1"
        },
        {
            "review_text": "The final installment to Half-Life 2, the gameplay continues to be excellent. It's about half the length of the base game by itself, and continues the story from Episode 1. Gameplay continues to keep things interesting with a solid balance of gunplay, tag teaming with a NPC, vehicle missions, and a little base defense. It's just as high quality as the rest of the franchise, and once you play it, you will realize why there is such a clamor for Half-life 3, even 10 years later.",
            "review_score": "1"
        },
        {
            "review_text": "This would be a great game... if Valve could count to three and finish it ffs.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best installments of the Half Life universe to date. I highly recommend playing Every single game previous, starting with the original Half Life, not the source port. If you don't understand the references you didn't play the previous games enough.  That ending though...oh man...",
            "review_score": "1"
        },
        {
            "review_text": "Nominate this for 'GAME THAT DESERVES A SEQUEL'",
            "review_score": "1"
        },
        {
            "review_text": "GAME THAT DESERVES A SEQUEL!",
            "review_score": "1"
        },
        {
            "review_text": "Sequel to one of the best games ever made and most likely to not get a further Sequel (except maybe when VR goes mainstream). Half life 2: Episode Two is a short spin off of high quality that promised to lead to more. Good fun, interesting few puzzles but play Half life 2 and Half life 2: episode 1 First.",
            "review_score": "1"
        },
        {
            "review_text": "GAME THAT DESERVES A SEQUEL!! Take the hint please gabe",
            "review_score": "1"
        },
        {
            "review_text": "This is the reason everyone wants Half Life 3.",
            "review_score": "1"
        },
        {
            "review_text": "WHERE IS THE ENDING WHY GOD  Oh right the game... this one is probally my favorite of the Half Life 2 games, get ready for a good time when you buy it.",
            "review_score": "1"
        },
        {
            "review_text": "Great expansion to the even more great game. Masterpiece.",
            "review_score": "1"
        },
        {
            "review_text": "Second ♥♥♥♥♥iest Half-Life game after Episode 1 (not counting Blue Shift and Decay, but who cares about those) but it's still like, pretty good",
            "review_score": "1"
        },
        {
            "review_text": "This game has it all: a main character who doesn't speak and whose most imporant skill is to know how to flip a switch, a beautiful and witty NPC, a nice vehicle to travel around, fearless and dangerous hunters and a complelling story that leaves you wondering how it will continue for a long time... literally, for years.... come on Valve, where is Episode Three?  I herewith nominate this great game for a 'Desperately In Need For A Sequel' Award!",
            "review_score": "1"
        },
        {
            "review_text": "please give us closure, in whatever form.",
            "review_score": "1"
        },
        {
            "review_text": "Nominated for 'GAME THAT DESERVES A SEQUEL' AWARD",
            "review_score": "1"
        },
        {
            "review_text": "Great game. 11 years and still no conclusion puts a bit stain on it's legacy for those invested in the story or the previous titles.",
            "review_score": "1"
        },
        {
            "review_text": "Nominate this for 'GAME THAT DESERVES A SEQUEL'",
            "review_score": "1"
        },
        {
            "review_text": "This has just been nominated for the 'Game most in need of a sequel' award.",
            "review_score": "1"
        },
        {
            "review_text": "Even my unborn kids want a sequal to this game and yet the saddest things is... even their unborn children will likely never play it either.",
            "review_score": "1"
        },
        {
            "review_text": "Ohhhhhhhhhhhhh so thats why everyone wants hl3!",
            "review_score": "1"
        },
        {
            "review_text": "It made me cry like a baby!",
            "review_score": "1"
        },
        {
            "review_text": "A series so good, it's a shame it's been left in this spot for the last 10 years. Episodic development suits a specific type of game and a specific type of studio. Valve learned that the hard way and as a result, the fans have had to suffer for it. Let us hope an experiment like that will never be repeated. Let's also hope the people who genuinely care about Half Life aren't all dead before Half Life 3 ships.",
            "review_score": "1"
        },
        {
            "review_text": "Simply put, a perfect game. It's so sad that there's not been a sequel but I live in hope that one day it will come!",
            "review_score": "1"
        },
        {
            "review_text": "Great game that deserves a sequel!",
            "review_score": "1"
        },
        {
            "review_text": "Great game, really the best game.",
            "review_score": "1"
        },
        {
            "review_text": "I know HL3 probably won't come out,  but anything at all would be nice Valve, a comic, a movie, an interactive children's book. Please, just give us something.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 'GAME THAT DESERVES A SEQUEL'",
            "review_score": "1"
        },
        {
            "review_text": "This game needs a sequel, so nominate it for one!",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good ey. Sequel when?",
            "review_score": "1"
        },
        {
            "review_text": "Much longer and more satisfying than episode 1, Leaves you wanting more.",
            "review_score": "1"
        },
        {
            "review_text": "Nominated for 'GAME THAT DESERVES A SEQUEL'  PLEASE, VALVE",
            "review_score": "1"
        },
        {
            "review_text": "A fantastic game, we're all waiting for ep 3 or hl3...",
            "review_score": "1"
        },
        {
            "review_text": "This is the game that made me buy a computer.",
            "review_score": "1"
        },
        {
            "review_text": "There's nothing I can say about this game other than what has already been said.",
            "review_score": "1"
        },
        {
            "review_text": "HL3 when?  Great game, interesting mechanics but ends too abruptly.",
            "review_score": "1"
        },
        {
            "review_text": "Overwhelmingly positive",
            "review_score": "1"
        },
        {
            "review_text": "absolutely amazing game, needs a sequel tho",
            "review_score": "1"
        },
        {
            "review_text": "One day man will walk on Mars.  I'm optomistic so I can see a sequel for this franchise coming out sometime after that. maybe",
            "review_score": "1"
        },
        {
            "review_text": "There was something about the episode system, that should've made new parts come out more frequently. Don't remember, it was 9 years ago",
            "review_score": "1"
        },
        {
            "review_text": "Great Game. The only down side to playing this today is knowing that you will not have a proper end to the Gordon story. If some day Lord Gabe give us the Ep3 or HL3 i just hope is not VR crap.  Anyway if you never played this you are missing out, go play the Half Life story starting by the first.",
            "review_score": "1"
        },
        {
            "review_text": "Half-Life 3. Where is it Valve?",
            "review_score": "1"
        },
        {
            "review_text": "It holds up just as well now as it did all those years ago - A good shooter and great game, pretty and oozing love and hard work.  This game deserves the 'I NEED A Sequel' Award.  And I'm sure it will get that sequel, one day, when Valve feels that what they have is ready.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games I've ever played. Has the interesting and engaging gameplay/story elements like in portal 2 and has fun running and gunning like in the originals. I look forward to the second.",
            "review_score": "1"
        },
        {
            "review_text": "As life goes on and we all ponder the question when will half life 3 be released just rmember Gabe of the thousands of people who have and will due never having seen this dream",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games ever made with the worst cliffhanger.",
            "review_score": "1"
        },
        {
            "review_text": "It's good, but ends in a cliffhanger.  Needs a sequel.",
            "review_score": "1"
        },
        {
            "review_text": "Its a good game",
            "review_score": "1"
        },
        {
            "review_text": "Good game, cool additions, the memorable gnome challenge. There are many first person shooters but not many that capture that certain 'half-life'y feel.",
            "review_score": "1"
        },
        {
            "review_text": "Nominate for Game for most deserving of a sequel",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game! Needs a sequel",
            "review_score": "1"
        },
        {
            "review_text": "Well... Leaving aside all the memes of Half Life 3 never coming out, this is a totally worthy game of being played, well, the entire franchise, alongside with the 2 Portal games, for a complement of the entire story. So that's it, i'm not saying so much, this is a great game, Valve did it well, and hopefully Half Life 3 will be worth the wait",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game, good continuation of the series. I wish it would come back, because that cliffhanger is killer....",
            "review_score": "1"
        },
        {
            "review_text": "Hard is pretty ♥♥♥♥ing hard. I advise nobody get drunk while playing this game on that difficulty. Can't even get out of the ♥♥♥♥♥ antlion part. Jesus Gabe.",
            "review_score": "1"
        },
        {
            "review_text": " Half-Life 2: Episode Two    Positives",
            "review_score": "1"
        },
        {
            "review_text": "This game is by far the best of all of the Half-Life games. It takes everything that worked in Half-Life 2 and improves upon it. Some levels are a lot more open, and there are numerous ways to kill your enemies. Among the coolest looking enemies ever, Hunters are sure to give you a great fight and are challenging enough to force you to stop and think. This game also introduces the muscle car, and the level involved with it are by far the most fun. The final boss is a very interesting fight and it keeps your heart racing for sure.  Even through the midst of all this action, VALVe doesn't skimp out on story. This game has the most character development and even reveals more information on the infamous G-man.  Bit of a warning though: by the end of this game, and after one HELL OF A CLIFFHANGER, you are going to find yourself wanting Half-Life 3 more than anything else. I'm still waiting guys. This is my favorite series of all time, and its been almost 7 years.  Overall, best of the series. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Need this for Garrys Mod.",
            "review_score": "1"
        },
        {
            "review_text": "Again it's a direct sequel of Episode One. Freeman and Alyx Vance are still on the hunt from the Combine. Fight your way through a new type of enemies called Hunters, but the strong point of Episode Two is the plot. You don't want to miss out on this.",
            "review_score": "1"
        },
        {
            "review_text": "I'M STILL WAITING ON EPISODE THREE!!! Oh wait, we all are.",
            "review_score": "1"
        },
        {
            "review_text": "Great game",
            "review_score": "1"
        },
        {
            "review_text": "Wow awesome game I played episode one and the half life 2 original!This game is amazing but too short. Left me with a big cliff hanger at the head which sucks.",
            "review_score": "1"
        },
        {
            "review_text": "This is a really good game to play if you love Half-Life altogether.",
            "review_score": "1"
        },
        {
            "review_text": "Great story, stunning visuals and alot of thought provoking gameplay!",
            "review_score": "1"
        },
        {
            "review_text": "Episode 2, it was longer than episode one and my second favorite in the Half Life series. It was still great although short. Same quality as all the other ones.  Rating 95% A+  Hurry up Valve and make HL3!",
            "review_score": "1"
        },
        {
            "review_text": "Half-Life 2 episode two what episode one wanted to be. The graphics are the same, the gameplays the same, and the storys the same. The only thing that is different between the two games is the lenght of episode two is much greater.     Half-Life 2 episode two gets a 9/10",
            "review_score": "1"
        },
        {
            "review_text": "HL2 is the best FPS game of all time.",
            "review_score": "1"
        },
        {
            "review_text": "Half-life ^2  ----+2------  1/2^2+2  =Making it Half life Episode 2 1/2",
            "review_score": "1"
        },
        {
            "review_text": "Not only did they make this episode much longer than Episode One, they added so much more into the game, which made you have to think about how to survive. Several parts take a long time to get through (Like the cave near the start) and some are really cinematic (like the last battle). Recommend this one to anyone who likes to shoot things and not do anything useful for a couple of hours.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game! Driving is the most challenging part though....and the hunters...*shiver*",
            "review_score": "1"
        },
        {
            "review_text": "Great game. What can I say, Half-Life, a must have among first person shooter games!",
            "review_score": "1"
        },
        {
            "review_text": "Shorter, but just as good as Half Life 2.",
            "review_score": "1"
        },
        {
            "review_text": "It has to be played by every Half Life fan.",
            "review_score": "1"
        },
        {
            "review_text": "Suddenly, in the countryside around City 17, we're thrown against new challenges as the next episode is revealed. Now, admittedly, I found the episodic format fairly underwhelming, as if the real rich story was lacking until a HL game of a length found in the main two titles (hence my hopes for HL3's longer but more significant, memorable and enriching chapter). And by the end of the episode, we are left on a real cliffhanger that'll no doubt nicely introduce us to the lore for HL3. Nevertheless, I would not dismiss Episode 2, especially in how it takes us once again to new scenery and a variation in strategy and combat: it's just the episodic format ought to end here. I want a real HL3 to follow, rather than a shorter, leaner Episode 3.",
            "review_score": "1"
        },
        {
            "review_text": "Bloody awesome! Must-have!",
            "review_score": "1"
        },
        {
            "review_text": "Unlike Episode 1, this is a full size game.. and it was an improvement from the first episode.. do strive to get all achievements.  Has one of the biggest cliff hangers in gaming history!  Damn it Valve",
            "review_score": "1"
        },
        {
            "review_text": "This is the best one. The last battle is one of the most fun times you will have in a half life game.",
            "review_score": "1"
        },
        {
            "review_text": "A significant improvement over its predecessor, Half-Life 2: Episode 2 continues the sci-fi FPS experience that Episode 1 started. The longer, more creative, and more memorable experience makes the “Episode” games feel worthwhile. Unfortunately, its cliffhanger ending has left fans hungry for Episode 3 since 2007. (Rating: 8/10 'Very good')",
            "review_score": "1"
        },
        {
            "review_text": "80/100",
            "review_score": "1"
        },
        {
            "review_text": "Very good ending sadly there is not going to be another game to complete it :C. ",
            "review_score": "1"
        },
        {
            "review_text": "Great Game. Obviously going to play this if you played the rest of the half-life series.",
            "review_score": "1"
        },
        {
            "review_text": "LOOK AT TEH HUGE SPIDAH!",
            "review_score": "1"
        },
        {
            "review_text": "How can you not play this game? That's like not taking a shower everyday. Quick, play it before you stink up the entire room with your ignorance.",
            "review_score": "1"
        },
        {
            "review_text": "this is a very fun game sort of like garys mod but better",
            "review_score": "1"
        },
        {
            "review_text": "Even if you've not played Half-Life 1 you will be satisfied with the story of the game series.",
            "review_score": "1"
        },
        {
            "review_text": "The last part before the long long weight. Also proof that valve cant count to three.",
            "review_score": "1"
        },
        {
            "review_text": "A game worth playing. It is strongly recommended that you play Half-Life 2 and Half-Life 2 Episode One. The story continues at the cliffhanger you were left with in Episode One. The game definately changes the order of events in a usual story, and it produces one heck of a story. The end is something you have to experience yourself, and it is why many a fan of Half-Life is waiting to see the next title in the Half-Life series be released. You can't go wrong with the price. Don't forget about the items added to Garry's Mod too!",
            "review_score": "1"
        },
        {
            "review_text": "Is techincally half life 1 when you reduce fractions",
            "review_score": "1"
        },
        {
            "review_text": "Visually stunning, a worthy and apt successor to Episode One.  I absolutely love many of the 'cinematics', they're just far and beyond what most games can pull.  If this is the jumping off point for Episode 3, it is going to be one hell of a wild ride :D",
            "review_score": "1"
        },
        {
            "review_text": "This game as far as the series is one of my favirote out of the three half life 2 games which means they alreading made 3 games but refuse to name it half life episode 3 which confuse it me on the title of the game but besides that. The level design is fantastic being in the forest driving and walking exploreing the region to white castle (I MEAN WHITE FOREST). As far as story line goes it pretty good making you feel intitled to the character which brings the enemys. Such as a new antlion type which is basicly a bullsquid from HL1 then the hunters my god you think fast zombies where annoying jesus its like they put togethor Antlion, strider and possibly a combine togethor. Which doesnt mean its a bad thing bringing a powerful foe against you anyway the map design is what make me get into the feeling such as having firefights, driving like a pissoff lindsey lohan and looking into what they put into again the feel as actualy going to white forest.But at the end jesus Hunter much overall a great game. (WARNING CLIFFHANGER)",
            "review_score": "1"
        },
        {
            "review_text": "still not half life 3, great try though valve, thanks for playing.",
            "review_score": "1"
        },
        {
            "review_text": "Love it. Have not finsihed it the first time it came out. Really liking it now. I know I will want more once I am done, so taking my sweet time with it.",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "The third Half-Life 2 game, (Come on, Half-Life 3!). This sports improoved graphics, totally different gameplay, and a new vehicle. The game is otherwise much the same as the previous games, based around the journeys of Dr. Gordon Freeman, and the battle against the 'Combine' alien invaders, an all what they are armed with. I reccomend this to people who like FPS shooter games, and people who like science fiction.",
            "review_score": "1"
        },
        {
            "review_text": "This game was epic..... now i understand why everyone wants HL3! The ending was pretty sad though.....",
            "review_score": "1"
        },
        {
            "review_text": "This might actually be better than HL2, it's amazing. Probably the best story add on/expansion ever.",
            "review_score": "1"
        },
        {
            "review_text": "Another content expansion in the world of Half-Life 2, this one brings us to the quest of Gordon Freeman after he has successfully begun the uprising, saw to its fruition, and now must ensure that it bears fruit. The fate of humanity rests on one M.I.T. professor with a P.HD in Theoretical Physics and 'I'm going to kick your f****** ♥♥♥'.  Once again, the content expansion is incredible, and the change in scenery is both refreshing and intensifying. Not onlyt hat, but a good slew of new content, a great ride, character development, enemy additions, and probably one of the deeper segments in the entire series rests with thsi expansion.  Unlike the prior expansion, I feel that Episode Two is A MUST for the Half-Life experience. Questions are answered, many more are posed, and it sets us up for the culmination of the Half-Life 2 journey, Episode Three, which 'I believe may be as important even so thatn HL2 itself.",
            "review_score": "1"
        },
        {
            "review_text": "Even more Half-Life 2.",
            "review_score": "1"
        },
        {
            "review_text": "Alyx doesn't die, she just gets hurt a little?",
            "review_score": "1"
        },
        {
            "review_text": "10/10 - Alyx, Gordon, Cliffhanger and endless waiting for sequel.",
            "review_score": "1"
        },
        {
            "review_text": "IT'S AWESOME",
            "review_score": "1"
        },
        {
            "review_text": "Awesome. Better than Episode One.",
            "review_score": "1"
        },
        {
            "review_text": "More jokes about Gordon Freeman not talking.",
            "review_score": "1"
        },
        {
            "review_text": "Well I did finish this game when I pirated it :P Didn't play it on Steam yet tho.  But as far as I remember, this game was kinda too short. You still play as Gordon and you still must kill stuff and solve puzzles.  Graphics are the same as in other HL2 games, game runs smooth and i like it.  My rating: 6/10",
            "review_score": "1"
        },
        {
            "review_text": "The revolution will be televised.",
            "review_score": "1"
        },
        {
            "review_text": "If Half-life 2 was nearly perfect then this game is beyond perfect. This game has reached the pinnacle of game design, and is the greatest piece of entertainment that I have ever experienced.",
            "review_score": "1"
        },
        {
            "review_text": "One word: Awesome especially when it comes to story telling, Half-Life 2 series has never been more critical in terms of progressing the plot. And to makes matter interesting, instead of having to fight endless waves of enemies, you are sometimes tasked with environmental puzzle solving matter with your gravity gun. A must have for all even if you are not a Half-Life 2 fan!",
            "review_score": "1"
        },
        {
            "review_text": "The best Half-Life game ever created. In this game, the story becomes really interesting. The graphics are better than ever, and the gameplay changes completely, especially in the last part of the game. Highly recommended as part of The Orange Box.",
            "review_score": "1"
        },
        {
            "review_text": "amazing but the game ends without the story being completed.... and it doesn't look like episode 3 will be out any time soon.... even though its been 5 or so years since this last piece was released....",
            "review_score": "1"
        },
        {
            "review_text": "I'll bet my left hand that, today, the whole world has already heard the name 'Half Life' and if you never ever tryed any of its games, than I'm 100% sure to say that you are missing one of the greatest experiences of your life. Yes! This game, or better, the whole series are a total piece of awesomeness mixed with 1000% fun. (yes, I meant a thousand) And I'm confident to say that with Half Life 2: Episode 2, Valve just hit the spot one more time and for those who haven't played it yet, they should run now to the store and buy it! Episode 2 manages to give you an unforgetable experience of gameplay while it tells an impressive history that really shakes you apart. In other words, grab the d*mn game and go play!",
            "review_score": "1"
        },
        {
            "review_text": "This episode takes you to whole new enviroment, with heap of new things.  Well polished 10 hours of tense advanture of your hero Gordon Freeman !",
            "review_score": "1"
        },
        {
            "review_text": "Alright, this game makes me really, really want to play episode 3 now.",
            "review_score": "1"
        },
        {
            "review_text": "The true Valve masterpiece:  A perfect combination between action and brilliant storytelling. This guys are just amazing, they always surprise you in every game they make. After HL1, undoubtedly the best HL game. The one bad thing? It ends, and WHAT and ending my friends! We need HL3 right now Gabe, dont make us wait longer or there will be Unforeseen Consequences!! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "One of the best singleplayer games with an amazing ending! That just makes you want the next one even more! Cant wait for Half Life 3 or Half Life Episode 3! There is no way you are going to dislike this game.",
            "review_score": "1"
        },
        {
            "review_text": "It was good at first, then somehow I just wanted Alyx dead. In the end, I hated the final battle, but the initial missions were quite entertaining and a lot more fluid than in their previous games.",
            "review_score": "1"
        },
        {
            "review_text": "The expansion that perfects the Half Life formula",
            "review_score": "1"
        },
        {
            "review_text": "If you love Half Life 2 or shooting games in general, you should definitely get this game! The puzzles and gun fights are thrilling and clever, the graphics are top notch and atmospheric, the sound design is phenomenal, and the story is gripping. The ending is shocking, so shocking that Valve should hurry the ♥♥♥♥ up with HL2: Ep 3 already!! &gt;:O Highly recommend this game!",
            "review_score": "1"
        },
        {
            "review_text": "Played when first released - loved it. Had a bout of nostalgia about a year ago and played it again - the game is old but has aged well. Still feels polished and is a match for recent FPS. Makes my All Time Top 10 List easily.",
            "review_score": "1"
        },
        {
            "review_text": "A continuation of Half-Life 2: Episode One and, and... VALVE! Y U NO MAKE HL3 or Episode Three?!",
            "review_score": "1"
        },
        {
            "review_text": "It was quite something, thats for sure. Being outside really was an escape from the half life norm and i must say i nearly enjoyed this as much as i did episode 1 (DLC). Again like episode 1 it was well paced and quite possibly provided the best driving challenge of the series so its only fair to recommend this right alongside episode 1 as a must have.  LOST COAST DLC review  Lost coast is essentially a demonstration piece showcasing a revamp of the graphics. If your picturing discovering an abandoned fishing village and the like then think again as this very short piece gives you barely enough time to put a single bullet in anything.  While i cant recommend lost coast as a standalone purchase, as a freebie attachment its no harm, no fail.",
            "review_score": "1"
        },
        {
            "review_text": "this is the best games i have ever played well i don't play much games but this is the best game left sure the ending is so sad but awesome i totaly recommend this.",
            "review_score": "1"
        },
        {
            "review_text": "Simply the greatest FPS game to this day.",
            "review_score": "1"
        },
        {
            "review_text": "I wish I could give this a thumbs down just based off of the fact that there is no Episode Three yet... Curse you Valve!!!",
            "review_score": "1"
        },
        {
            "review_text": "i really liked half life two ep 2 because of it's unqiune style of game play.",
            "review_score": "1"
        },
        {
            "review_text": "A truly an amazing game and whould recommend this for older players for it has relatively dark content. Warning after you play this you join all the people who eagerly await half life 3, for it ends on one of the most powerfull deaths in video game history. My rating 9.9 out of 10",
            "review_score": "1"
        },
        {
            "review_text": "Half-life 2 ep.2 We waited no longer then a year. Half-life 3 I've been waiting for 8 BLOODY YEARS. Half-life 4? Gaben can't count to three.  But yes get dis game all da half-life games.",
            "review_score": "1"
        },
        {
            "review_text": "Half-Life 2 Episode Two is probably the greatest entry in the franchise. With much more beautiful graphics and the same top notch level desing, there are very few things this game falls short of. But if you plan on purchasing this game you should take into consideration that it will leave you in a massive cliffhanger and the story might never be concluded. Since Valve has been very clear that although they don't wanna close the door on the possiblity of a sequel, they're not interested in making, and i quote from waht Gabe Newell said on the GameSlice podcast, 'a super classic kind of product' unless a bunch of people internally at Valve simply decided that they wanted to do it.  What i'm saying is that even though there might be a sequel someday, don't spend your money unless you're happy with having this amazing story cut in the middle, because it is unlikely that it'll be concluded.",
            "review_score": "1"
        },
        {
            "review_text": "Oh. THAT'S why.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing gameplay, graphics and storytelling.",
            "review_score": "1"
        },
        {
            "review_text": "Like the other games in the Half-Life 2 Trilogy, this game was very good. The story continued as being consistantly good. This game was rather harder than previous parts of HL2, but that is part of the challenge in this game. Now that the Half-Life series is most likely over, I really liked this game because I enjoy games like this. I find First Person Shooters, with a story like Half-Life did. The ending, don't worry there are not any spoilers ahead, The ending...oh my...you hopefully brought some tissues to your computer. The ending will move you in unexpected ways. If you haven't purchased HL2, and HL2EP1, and are considering buying this one, it's worth it. This series is amazing. This is what Valve is known for. I assure you that this game is going to be one of your All-Time favorites.",
            "review_score": "1"
        },
        {
            "review_text": "hl3 is out hloragens dow",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "Rise and shine, Mister Freeman. Rise and... shine. Not that I... wish to imply you have been sleeping on the job. No one is more deserving of a rest, and all the effort in the world would have gone to waste until... well, let's just say your hour has... come again. The right man in the wrong place can make all the difference in the world. So, wake up, Mister Freeman. Wake up and... *smell the ashes*...",
            "review_score": "1"
        },
        {
            "review_text": "The worst of the Half Life 2 collection, can only give it a 9/10. It was only amazing.",
            "review_score": "1"
        },
        {
            "review_text": "Its cool but better to watch on youtube singleplayer",
            "review_score": "1"
        },
        {
            "review_text": "Best Half-Life so far. Now where is HL3?",
            "review_score": "1"
        },
        {
            "review_text": "Gre graphics, gameplay that brings you back to hl2, and funny space jokes make this an excellent game. 94/100 in my eyes",
            "review_score": "1"
        },
        {
            "review_text": "Technically Valve can count to three! ",
            "review_score": "1"
        },
        {
            "review_text": "Have play the Mod`s: Dangerous World , Calamity , Joutomaa and Offshore (Offshore is fore me Episode 3).....you find the LINKS to Mod´s on Grouppage or in the Game Synergy - 'Game-List'.....are you H-L Fan??.....play it !!!!...good game!!!",
            "review_score": "1"
        },
        {
            "review_text": "I think that this is one of the best games series I've ever played and I loved the fact that you fit first person shooter and sci-fi into one game. This game has well done grahpics and story line. When I play this game I realy feal like I am in the game which few games can make me fell truely inside the games. This game series should countinue for sure!",
            "review_score": "1"
        },
        {
            "review_text": "Wonderful storyline, characters, and everything. Also a great cliff-hanger of an ending. NOW WE ARE STUCK WAITING FOR THE GREAT VALVE GOD GABEN TO RELEASE THE HOLY HALF-LIFE 3 UPON US.",
            "review_score": "1"
        },
        {
            "review_text": "This game is nothing short of a 500 Mile-Per-Hour ride on a beautiful rollercoaster that runs on perfection. The only thing wrong with it is that I can't post more than one positive review.",
            "review_score": "1"
        },
        {
            "review_text": "As of the second chapter of the Half Life 2 game, this is a little bit much better than episode 1 in my opinion. This game introduces the new Combine Hunters and had a really huge cliffhanger at the end. But most of the game is Half Life 2. I wish Valve made this game with more gameplay, new weapons, and new enemies. I recommend this game to everyone.  My score for this game is 7/10  P.S. Gaben, if you are reading all of the Half Life 2 and it's episodes review, you better make Half Life 3 =)",
            "review_score": "1"
        },
        {
            "review_text": "Valve has done it again, with another best game of the year, Half-Life 2 Episode Two. In this game, you are in a race to get to Eli Vance's base before the Combine destroy it. You will find twists and turns, and even a suprise ending that will change everything. So what are you waiting for, Half Life 3? Get Half Life 2 Episode 3 on Steam now!",
            "review_score": "1"
        },
        {
            "review_text": "Play this game so you will understand why we need Half Life 3 so badly.",
            "review_score": "1"
        },
        {
            "review_text": "if you still haven't played through them all.. Damn well get them all! It's better than all those watered down FPS' that are multiplayer COD ripoffs now-a-days!",
            "review_score": "1"
        },
        {
            "review_text": "OH MY GOD  Half-Life® 2: Episode Two is the second in a trilogy of new games created by Valve  /\\/\\/\\/\\ /\\/\\/\\/\\ HALF LIFE EPISODE 3!!!!!!!!!!!!!!! ",
            "review_score": "1"
        },
        {
            "review_text": "Where's HL3?",
            "review_score": "1"
        },
        {
            "review_text": "OK so i just finished the Campaign (Which is among the best of every video game I have ever played EVER) and I've also finished Ep 1 and Half Life 2 (In the right order) and I'm on the verge of tears because although the ending is sad and amazing, we may have a while to be kept waiting for the next game in this series. Is it funny? Hella. Microwave casserole? Gnomes going to the moon? That's all here. Is it sad? YES. People you will grow to love DIE. In FRONT of you. That's SAD. Is it action packed? YEEEAAAH. You can chop zombies IN HALF. I got the Half Life Complete pack for £6. If another deal comes along, get it! It's amazing! That's about it so GET THE GAME. P.S. What happened to Barney Calhoun? ",
            "review_score": "1"
        },
        {
            "review_text": "If any one knows Valve in person ask them if Half-Life 3 i going to be made or when Half-Life 3 is ",
            "review_score": "1"
        },
        {
            "review_text": "One of the best FPS game based on a great story(story 10/10) !  Still have some bad ♥♥♥ graphics for this year (9/10) ! You have to play this game !",
            "review_score": "1"
        },
        {
            "review_text": "HALF LIFE IS AWESOME",
            "review_score": "1"
        },
        {
            "review_text": "As with all the Half-Life games, this is a brilliantly constructed thinking-man's first-person shooter. Incredibly imaginative environments with an engaging storyline and unique, exciting enemies to fight.   Although not vastly different at all from its predecessors, Half-Life 2: Episode Two is a rich adventure to discover one's way through. Each game is essentially incredibly linear in nature, however, designers Valve are masters in disguising this and giving the player the impression that they have found a unique antidote to each of the numerous problems that the hero Gordon Freeman is faced with.  Looking deeper into the game structure itself, one realises that besides being excellent first-person shooters, each instalment in the series is actually a series of clever puzzles, each very satisfying to solve.",
            "review_score": "1"
        },
        {
            "review_text": "Holly Molly! MAKE HALF LIFE 3 NOW VALVE!!!!! THIS IS TOO MUCH TO BARE!!! THE VORTAGAUNT WAS RIGHT!!!",
            "review_score": "1"
        },
        {
            "review_text": "It's only 4-5 hours long and the ending has been statistically proven to be the biggest cause of blue balls since 2007, but I still believe this is the best game in the Half-Life series. Great atmosphere and environment design, memorable set-pieces, clever puzzles and one hell of a climax.",
            "review_score": "1"
        },
        {
            "review_text": "It's shiny, it's Half-Life, and it's by Vavle. What more can you ask for?  If you are more into pretty environments then Episode 2 will easily make your day amongst the Half-Life series so far. With a smarter AI system and continuing the story of When Harry Met Sally, this game is one you would want to get. Why won't you want to if you liked Half-Life 2?",
            "review_score": "1"
        },
        {
            "review_text": "My favorite of the Half-life 2's, it's amazing!  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Cliff Hanger! Hanging from a Cliff! AND THAT'S WHY HE'S CALLED CLIFF HANGER!!!",
            "review_score": "1"
        },
        {
            "review_text": "Everyone loves HL2E2. Give us Episode Three and let's get on with our lives.",
            "review_score": "1"
        },
        {
            "review_text": "This game is 9/10 i really like the half life series but it would have goten a 10/10 if the part where you get swarmed by striders wasnt so hard i probobly would'nt have quit the game forever other than that perfect game would recomend.",
            "review_score": "1"
        },
        {
            "review_text": "HL2:EP1 was an amazing game, but it wasn't so innovative as HL2. HL2:EP2 take all the good things from the precursors games and adds new enemies, new environments, new characters, all packed with a brilliant history. This is my favorite HL game and the best in my opinion.  Positives: + More history development; + The characters are well developed. + All the good things from HL2 and HL2:EP1 + A lot of innovations: new weapons, new game mechanics, new environments, new enemies and new characters.  Negatives: - It's a little too short, like all the episodes. - Don't have a sequel :(   10/10 - You must play this!   And welcome to the Half Life 3 waiting community!",
            "review_score": "1"
        },
        {
            "review_text": "This is an awesome and memorable game. Yes, the ending is... heavy... I won't spoil it so if you want to find out what it is, play the game. I've heard that source 2 and L4D3 is in the works... take away the letters in L4D3, you get #s and what do we do with #s? math, 4-3 equals 1. Remove the letters from Source 2, you get 2.  2 plus 1 equals 3  HALF LIFE 3 CONFIRMED!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Great game, up untill the last stage. If I wanted to play a driving game I would have bought one.",
            "review_score": "-1"
        },
        {
            "review_text": "really really great story untill the end of the game. So... where's my Half-Life 3?",
            "review_score": "1"
        },
        {
            "review_text": "the game is crashing every time i run the game.",
            "review_score": "1"
        },
        {
            "review_text": "Great game and all, but here's the thing...",
            "review_score": "1"
        },
        {
            "review_text": "Wait, what just happened there ... that was the end!?",
            "review_score": "1"
        },
        {
            "review_text": "After having this game on a secondary account for a few years now, I recently decided to play it and see what's going on. Good semi-expansion, with a nice storyline - can't wait to see Half-Life 2: Episode Three and Half-Life 3.",
            "review_score": "1"
        },
        {
            "review_text": "WHAT????!!! What the hell was that ending? Just finished playing and now the wait for Half Life 3 begins. Valve really knows how to do cliffhangers. Obviously the game was amazing, graphics, gameplay, story, all perfect.   Absolutely reccomend. No, not reccomended; you MUST play this game.",
            "review_score": "1"
        },
        {
            "review_text": "I wonder what happens next in the story? Guess we'll find out soon.",
            "review_score": "1"
        },
        {
            "review_text": "Shame that its the last game in the series. Still an excellent installment in the series. Too many plot points left unanswered. 9/10 i would give it 10/10 but there's no final boss with Gaben sooooo...HL3 will probably grow legs and GTFO if it awakes from the abortion clinic at Valve sooo LMAO Jk this game is good tho im just messin wit you. XD",
            "review_score": "1"
        },
        {
            "review_text": "Well, I guess I'm waiting for Half-Life 3 now ( ͡° ͜ʖ ͡°)",
            "review_score": "1"
        },
        {
            "review_text": "Short but amazing",
            "review_score": "1"
        },
        {
            "review_text": "Its Good!",
            "review_score": "1"
        },
        {
            "review_text": "Half Life 2: Episode 2 is an continuation and the final installment of the Half Life 2 saga made by Valve who cancelled Half Life 4.  Postive: I actually really enjoyed this game, it was better than Episode 1. I loved that Episode 2 showed an new part of the world called the Outlands. The Outlands looked amazing it showed another part of this completly post- apocalyptic world. The destroyed Citadel looked EPIC! This game also made vortigants my favorite alien species in this series. This game wasn't predictible at ALL! I thought Alyx was dead when she was stabbed by a hunter. The advisors were very uh...strange? Arne Magunnson was awesome, lol.  Negative: Uriah was kind of useless in my opinion, he was only there to open a locked DOOR for you and the game developers decided to bascially make him at least a little useful by just adding lines. I disliked the Magnusson device, I know it does more damage then shooting a RPG at it. But, you have to get out your gravity gun and throw the magnusson device at the striders when the device sticks on, you have to take out a weapon and shoot it at the device and the strider explodes. I could've just used an RPG, Gordan Freeman took out 4 strides in one area in Half Life 2.  Conclusion: RIP ELI VANCE. 9/10.  ",
            "review_score": "1"
        },
        {
            "review_text": "I liked this one better than Episode One, which was good, but this one I had fun with. Squash the grubs!",
            "review_score": "1"
        },
        {
            "review_text": "Finish HL1 wooow my brain feels...WTF!?.., HL2 what a game, HL ep1 that´s awesome, HL ep2.....nooooo please god not that dude.....need ep3 or HL3 right meow! Gaben c´mon!",
            "review_score": "1"
        },
        {
            "review_text": "+) It has the most thrilling battles of all Half-Life 2.  +) There is a new type of enemy that makes the battle more thrilling.  +) Twitching when auto or quick saves has become shorter.  +) Mapping became easier.  +) NPCs don't block your way as much.   -) There are still twitches at quick or auto saves.  -) They should load each chapter at once instead of in the middle of the mission.",
            "review_score": "1"
        },
        {
            "review_text": "Only play this if you want to be left on a cliffhanger that'll never be resolved. Half life 2 episode 2: the eternal cliffhanger is still a good game and has much nicer scenery than any other game in the series and finally gets away from labs and dystopian cities. The soundtrack is great and the visuals still look nice today. 3/3 would be in a phantom pain over the lack of a proper conclusion.",
            "review_score": "1"
        },
        {
            "review_text": "IT HAS BEEN SAID THAT LORD GABEN HATES THE NUMBER 3 ALTHOUGH THERE IS SECRETS IN THE GAME LIKE AR3 (by the way that guy is a half life fan) YOU DROVE 3 VIACHALS IN THE GAMES",
            "review_score": "1"
        },
        {
            "review_text": "Episode 2 is once again a continuation to the last game which picks up on yet another cliffhanger. Gordon and Alyx have barely survived the blast of the Combine's reactor blast. They thought they succeed in their mission only to discover that the combine is attempting to reopen the rift to the Xem world. After Alyx contacts her father at the freedom fighters' base in the middle of the forest, Gordon and Alyx must travel there to help defend the base from the Combine and put an end to their attempt to connect to the Xem world. The game provides more to offer and has a very good way of putting a player through a lot of suspense. The game ends with a cliffhanger as it was intended to continue on to an Episodes 3 &amp; 4. However those segments were either cancelled or in development hell, and for years Valve went on and off about the status of a 'Half-Life 3' which is intended to give the franchise a conclusion. There has been leaked artwork on the project and a huge demand from die hard fans that want to see a true ending to the franchise with another game. Even the Naughty Dog company expressed high interest in making the third game by striking a deal with Valve. So there is a noise for a continuation for Half-Life, it's just uncertain when it will happen. I just hope it will happen in this life time cause Half-Life is one of the most prized first person shooter games of all time it strongly deserves a true conclusion cause after playing this game I want to see what will become of Gordon &amp; Alyx and maybe even see what becomes of the G-Man as well. Only time will tell from this point, so until then keep on fighting for Half-Life 3 to happen.",
            "review_score": "1"
        },
        {
            "review_text": "Half Life 2: Episode 2 was a great game, but if Episode 3 come out? Gaben. This is what we waiting for..",
            "review_score": "1"
        },
        {
            "review_text": "Short but good",
            "review_score": "1"
        },
        {
            "review_text": "This is without a doubt my fav release of half life 2 series, I don't recommend buying this game cause alot of the story of elements in the story are not explained, what happend to mossman, the g-man motives and the borealis? tbh im really ♥♥♥♥♥♥ at valve for leaving it like this the storyline has a great potential(ik its already awsome).its been 9 years and vlave promised ep3 when they released ep2 but then canceled the idea of episodic games and didnt confirm/denied hl3.some fans are still hoping for hl3 i personaly dont think they will ever release hl3 (propably not in my lifetime :) )",
            "review_score": "-1"
        },
        {
            "review_text": "fun to play, cant go wrong with Half-life games.",
            "review_score": "1"
        },
        {
            "review_text": "Good game but need episode 3 ASAP",
            "review_score": "1"
        },
        {
            "review_text": "This is a pretty wild game and fun too !",
            "review_score": "1"
        },
        {
            "review_text": "HL2 E2 was amasing defently buy this. More story was fun rather then puzzles and no story from E1. E2 changed me from E1 this is like better i dont know what to say now but defently a must buy.",
            "review_score": "1"
        },
        {
            "review_text": "Don't play this unless you want to cry at the end. (and ofc I don't have to tell you what you'll want after this)",
            "review_score": "1"
        },
        {
            "review_text": "LMAOOOOOOOOOOOOOOOOOOOOOO WHERE IS EPISODE 3 BOI",
            "review_score": "1"
        },
        {
            "review_text": "  THIS IS ACTUALLY THE BEST ONE IMHO.",
            "review_score": "1"
        },
        {
            "review_text": "A breathtaking experience that will leave you wanting more!",
            "review_score": "1"
        },
        {
            "review_text": "While it is a great game, need to say this for starters  1. Hunters and Acid Antlions are little S#!+s  2. Car has no mounted gun, so just run your enemies over.  3. Game ends on a super sour note.  Other than that, pretty good game FOR GOD'S SAKE MAKE HL3 ALREADY!!!",
            "review_score": "1"
        },
        {
            "review_text": "I can't believe Valve has let this cliffhanger hanging for so long!! Don't play this until HL3 is out, well, play it a little, there is plenty of exotic looking creatures to shoot in the face, including one level where you are surrounded by two giant galloping ♥♥♥♥♥ that try to kill you by throwing cars on your head - good fun! Also there is a lot of driving around in the buggy through the country side with Alyx which is cool, especially when she gives you a little wink, it gets my heart racing I tell you. Soon after that I realised I should probably get out of the house.",
            "review_score": "1"
        },
        {
            "review_text": "Good. still waiting for that episode 3 though",
            "review_score": "1"
        },
        {
            "review_text": "More challenge and more campaign to the Half Life 2 story, as the developers leave you wanting more, and never to have that desire satiated.  + More Half-Life + More vehicular fun + Perhaps the most challenging segment of Half-Life 2 yet + New Combine enemies + More explosions + That awesome soundtrack returns + Intense from start to finish + You're satisfied until the game ends + GNOME  - Too short - It ends way too soon - I always felt in need of ammunition - Ending",
            "review_score": "1"
        },
        {
            "review_text": "Ayeee nice.",
            "review_score": "1"
        },
        {
            "review_text": "Episode 2 is arguably the best HL game despite its short length. It is a bit more open than previous games in the series, meaning that you have more freedom to move around even though the game is still linear. This game, in my opinion is where Valve was at their best in terms of quality game design, and it really shows. Not to spoil anything, but the game also doubles as the world's best waiting simulator after the ending. You don't even have to have the game running to experience the waiting simulator part!  10/10 would wait for HL3 again",
            "review_score": "1"
        },
        {
            "review_text": "One of the greatest sequels to the greatest games of all time",
            "review_score": "1"
        },
        {
            "review_text": "What a wonderful way to leave us screaming for the much anticipated, much delayed, much wow, Half-life 3 PLS GABEN!",
            "review_score": "1"
        },
        {
            "review_text": "When you see a game that has all reviews that are not related to the game at all, you know its a good game..   50/10. Still waiting for HL3.",
            "review_score": "1"
        },
        {
            "review_text": "Episode Two is certainly the strongest of the two episodes. Using the Unreal engine it has managed to break through the fourth wall at many points in time, for example when Chell meets Gordon in the trainyard after killing the protagonist from Ricochet (SPOILERS). The game developers obviously thought long and hard about this, as the current consumer base have not taking a liking to DOG. As such, the developers have introduced a new character instead of DOG whose name is, you guessed it, WALRUS. Not only have the characters been revamped, but the game now features new destructible enviroments thanks to the Frostbite engine which can add realistic immersion. Ubisoft has outdone themselves on this one.",
            "review_score": "1"
        },
        {
            "review_text": "You carry a garden gnome all the way to White Forest just to get an achievement.",
            "review_score": "1"
        },
        {
            "review_text": "One of the classics of modern gaming.",
            "review_score": "1"
        },
        {
            "review_text": "Well its HF what do you expect? Damn you VALVE RELEASE HF3",
            "review_score": "1"
        },
        {
            "review_text": "Half-Life 2, but this time it's in the woods. Is it the last Half-Life thing? Hope not!",
            "review_score": "1"
        },
        {
            "review_text": "Half life!! Oh God! Half life! Please, half life!! Oh my God! No...No. Oh my God... No...Half life don't leave me.   ----------------------------------------------------------------------------------------------------------------------------------------------------- Half life!!! Tanrım! Half life lütfen, half life!! Allah'ım Hayır, hayır!!! Hayır... Hayır...Half life bırakma beni...",
            "review_score": "1"
        },
        {
            "review_text": "You know what you nominated this for                                                                           please gabe.",
            "review_score": "1"
        },
        {
            "review_text": "I am pretty sure everyone said I had in mind.",
            "review_score": "1"
        },
        {
            "review_text": "You know the drill now.",
            "review_score": "1"
        },
        {
            "review_text": "Nominated for 'GAME THAT DESERVES A SEQUEL' AWARD",
            "review_score": "1"
        },
        {
            "review_text": "Fun game.  Bit of a cliffhanger, though...",
            "review_score": "1"
        },
        {
            "review_text": "Valve please get back to what matters and make this happen!  The community has spoken and we demand Half-Life 3!",
            "review_score": "1"
        },
        {
            "review_text": "This is THE quintessential candidate for the GAME THAT DESERVES A SEQUEL award.   'We used to make games, now we make money.' - Lord Gaben  PS: 10 out of 8, loved this game.",
            "review_score": "1"
        },
        {
            "review_text": "Definitely worth the money. This game rocks. I played it for 7 hours straight and beat it. Please make half life 3 or half life 2 episode 3",
            "review_score": "1"
        },
        {
            "review_text": "If you are planning on playng this: DON'T WATCH THE SPOILERS. They'll ruin the ending completely.",
            "review_score": "1"
        },
        {
            "review_text": "This game is just amazing! Even if I played this years ago, this still remains the most tragic end of a great trilogy.    One more thing.......... Two has three letters, HALF LIFE 3 CONFIRMED!",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant series... Just it isn't finished. It's like a book with the last quarter torn out....  Except for that, Half-Life 2 and Episodes are a must play.",
            "review_score": "1"
        },
        {
            "review_text": "Half life 2 is my favorite video game and video game series and I can't recommend it enough. Even though it is 10 years old it still stands up to games being released today. I can't wait until Half life 3 is released as it will be even more proof that every game valve releases is absolutely groundbreaking and sets the new standard for developers everywhere.",
            "review_score": "1"
        },
        {
            "review_text": "' GAME THAT DESERVES A SEQUEL ' we must have the 3rd!",
            "review_score": "1"
        },
        {
            "review_text": "Nominate this game for 'game that deserves a sequel' award",
            "review_score": "1"
        },
        {
            "review_text": "Pls gib Half life 3",
            "review_score": "1"
        },
        {
            "review_text": "Game that Deserves a sequel award",
            "review_score": "1"
        },
        {
            "review_text": "Needs an Episode Three",
            "review_score": "1"
        },
        {
            "review_text": "Please, Newell, I know it is in your reach to decide to do it. So I voted this game to get the award: 'GAME THAT DESERVES A SEQUEL'. And may whatever that you belive or not, grant us this wish.",
            "review_score": "1"
        },
        {
            "review_text": "Did my part in voting for this game! ~^_^~",
            "review_score": "1"
        },
        {
            "review_text": "This game must be continued! There are countless people still living with the hope that lord Gaben on a day will return to create Half-Life 3!",
            "review_score": "1"
        },
        {
            "review_text": "'GAME THAT DESERVES A SEQUEL'",
            "review_score": "1"
        },
        {
            "review_text": "Still awesome.",
            "review_score": "1"
        },
        {
            "review_text": "The only game that TRULY deserves sequel.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. Nominated for 'GAME THAT DESERVES A SEQUEL'.",
            "review_score": "1"
        },
        {
            "review_text": "The last Half Life which will ever exist... because of this I rate is 7/8",
            "review_score": "1"
        },
        {
            "review_text": "Nominated for Game That Deserves A Sequel Award.",
            "review_score": "1"
        },
        {
            "review_text": "If you like the half lfie series or want a big cliffhanger at the end, then this game is the one for you. Also we need a Half Life 3 in 2017 or 2018. I'm tired of waiting!!!",
            "review_score": "1"
        },
        {
            "review_text": "GAME THAT DESERVES A SEQUEL",
            "review_score": "1"
        },
        {
            "review_text": "Half Life 2: Episode 2 Part 2 Chapter 2 Passage 2 Portion 2 Fragment 2 Section 2 confirmed.",
            "review_score": "1"
        },
        {
            "review_text": "this game needs a sequel",
            "review_score": "1"
        },
        {
            "review_text": "If I don't get to play Episode 3 or Half Life 3 before I die, I'm going to be ♥♥♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "Its just Awesome",
            "review_score": "1"
        },
        {
            "review_text": "Game is great! VALVE GET YOUR CRAP TOGETHER AND MAKE HALF LIFE 3/ EPISODE 3 ALREADY! Vote this game for 'Game Most Deserving Of A Sequal' In the Steam Awards",
            "review_score": "1"
        },
        {
            "review_text": "Where's episode 3?",
            "review_score": "1"
        },
        {
            "review_text": "Growing up, this was the game series that started the long journey of PC gaming for me. Still stands the test of time for gameplay and storyline. If only HL3 would come out...",
            "review_score": "1"
        },
        {
            "review_text": "WHERE IS EPISODE 3 GAYBEN",
            "review_score": "1"
        },
        {
            "review_text": "'Game That Deserves A Sequel' DO IT NOW",
            "review_score": "1"
        },
        {
            "review_text": "The final chapter in the Half-Life Saga, and a grand finale at that. Can't help but feel they left something out though. Ending felt an hour or twelve early.",
            "review_score": "1"
        },
        {
            "review_text": "My favourite game about bringing a garden gnome back to his garden in the sky.",
            "review_score": "1"
        },
        {
            "review_text": "Will we ever witness the exciting conclusion of this series? Ha JK I'll go ♥♥♥♥ myself",
            "review_score": "1"
        },
        {
            "review_text": "Vote for Game That Deserves A Sequel award!",
            "review_score": "1"
        },
        {
            "review_text": "Nominated for 'Game that deserves a sequel' award.",
            "review_score": "1"
        },
        {
            "review_text": "Nominate this for 'GAME THAT DESERVES A SEQUEL' If you dont know why just then dont",
            "review_score": "1"
        },
        {
            "review_text": "This game is fantastic and deserves a sequel.",
            "review_score": "1"
        },
        {
            "review_text": "Game still holds it's own nearly a decade later; the rest of the series is of the same quality.  Truly one of the best video game series ever created.",
            "review_score": "1"
        },
        {
            "review_text": "Game still holds it's own nearly a decade later; the rest of the series is of the same quality.  Truly one of the best video game series ever created.",
            "review_score": "1"
        },
        {
            "review_text": "In dire need of a sequel.",
            "review_score": "1"
        },
        {
            "review_text": "Need more pls",
            "review_score": "1"
        },
        {
            "review_text": "THE HYPE TRAIN IS REAL  BRING ON THE SEQUEL",
            "review_score": "1"
        },
        {
            "review_text": "Half Life 2 still the best game ever! -2016",
            "review_score": "1"
        },
        {
            "review_text": "  The stories not over, dammit!",
            "review_score": "1"
        },
        {
            "review_text": "  The stories not over, dammit!",
            "review_score": "1"
        },
        {
            "review_text": "It's shame that the Half-Life series has ended here for now. Hopefully Valve will one day pick the series back up and give it proper closure.",
            "review_score": "1"
        },
        {
            "review_text": "We will only bring chaos and challenge the word of Valve's ideas. This game deserves a sequel! Until then, we will finally rejoice over our greatest wishes!  'I would never openly challenge the creators and members of it's development team, for it's choice of abandoning this series. But this game needs to come forth and be reborn, ones again.'",
            "review_score": "1"
        },
        {
            "review_text": "This game is so addicting!",
            "review_score": "1"
        },
        {
            "review_text": "Nominated for 'Game That Deserves A Sequel' award",
            "review_score": "1"
        },
        {
            "review_text": "Worthy of a sequel. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game Valve, this game series deserves a sequel, we would all appreciate it....I`ll be waiting patiently, if Half Life 3 comes out when I turn 95, I`ll still play it, arthritis and all :)",
            "review_score": "1"
        },
        {
            "review_text": "I did what must be done and nominated this game for the 'game that deserves a sequel' award. Everyone else should to. Let our voices be heard. Wake up Valve, wake up and smell the ashes.",
            "review_score": "1"
        },
        {
            "review_text": "Sequel now plox... The world needs some hope. The world needs the ONE FREE MAN!",
            "review_score": "1"
        },
        {
            "review_text": "If you haven't played Half-Life 2 at all, you're missing out on (imo) one of the best games every made. Gameplay is great, characters are excellent, and the story, OH BABY THE STORY. Anyway, they moved from big releases to episodic releases as a strategy for bringing content out more frequently.   They then released episodes 1 &amp; 2 within a year of each other. Episode 2 ended on a huge cliffhanger that left people salivating for more. They then proceeded to do absolutely nothing for over 9 years (at the time of writing this), and at this point will probably never finish Half-Life 2's story.  I still hold hope to this day that they will release something, but the longer they take, the less likely it will ever happen, and consider it has been 9 years, there is almost no chance they will ever release something. We can take solace, however, in the fact they didn't release something that fell short. I think I'd rather they release nothing than something that blows goats.",
            "review_score": "1"
        },
        {
            "review_text": "HL3 confirmed - not.",
            "review_score": "1"
        },
        {
            "review_text": "Episode Two is my favourite of the Half-Life series. The final battle is the best I've ever played. The story is impeccable, the Hunters are one of the best enemies ever introduced, and the gut punch ending has left an entire generation on the edge of their seats for nearly a decade!",
            "review_score": "1"
        },
        {
            "review_text": "i cant wait for the sequel!",
            "review_score": "1"
        },
        {
            "review_text": "I like it but it's a bit hard to win.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game. Highly recommend if you don't mind unresolved cliffhangers.",
            "review_score": "1"
        },
        {
            "review_text": "Half-Life 3 is a lie.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game and worthy purchase ",
            "review_score": "1"
        },
        {
            "review_text": "The MOST fun I've had in an FPS game",
            "review_score": "1"
        },
        {
            "review_text": "Episode 2 remains, technically and structurally, the best game in the series. The Dev commentary is especially insightful.",
            "review_score": "1"
        },
        {
            "review_text": "This game just hit me right in the feels.",
            "review_score": "1"
        },
        {
            "review_text": "HL3 CONFIRMED!? nope. giant cliffhanger, sad ending.   WHERE THE ♥♥♥♥ IS IT!",
            "review_score": "1"
        },
        {
            "review_text": "Very good game, i have finished this game many times!!!",
            "review_score": "1"
        }
    ]
}