{
    "app_id": 420210,
    "name": "KRUM - Edge Of Darkness",
    "release_date": "2015-11-24",
    "developer": [
        "HA Studio Ltd."
    ],
    "publisher": [
        "HA Studio Ltd."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "RPG"
    ],
    "achievements": 0,
    "positive_ratings": 34,
    "negative_ratings": 68,
    "price": 2.09,
    "description": "It is a fun, hack and slash RPG game, аn action adventure with advanced combat tactics. You will face countless fearsome mobs and grotesque beasts, hidden deadly traps, powerful demon knights and dragons.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/420210/header.jpg?t=1483782270",
    "minimum_requirements": "OS: Windows XP / Vista / 7 / 8 / 10 Processor: Intel Core 2 Duo or better Memory: 2 GB RAM Graphics: GTX 280 or ATI analog with 1 GB RAM &amp; compatible with DirectX9.0c DirectX: Version 9.0c Storage: 1 GB available space Sound Card: Compatible with DirectX9.0c",
    "recommended_requirements": "OS: Windows 7 / 8 / 10 Processor: Intel i3 / i5 series or better Memory: 4 GB RAM Graphics: NVIDIA GTX 550Ti or ATI analog - with 1 GB RAM or better DirectX: Version 9.0c Storage: 1 GB available space Sound Card: Compatible with DirectX9.0c",
    "reviews": [
        {
            "review_text": "  Krum- The edge of....loading........loading......loading...........loading.......",
            "review_score": "-1"
        },
        {
            "review_text": "I can't get past the horrible framerate even on excellent hardware. level design and optimization could be a little better. I would suggest getting it as part of a bundle or on a very very very good sale. now comes hard part.. would I recommend this title, well its pretty much a tie yet it just barely squeeks by on positive and I mean BARELY. maybe I will update this as time progresses and some noticable fixes are done. And yes they came out at end of Jan with a slow FPS fix. maybe it helped some out with it but obviously not for AMD cpu users",
            "review_score": "1"
        },
        {
            "review_text": "Lucky i got this trash for free the battle tatics are so bad that i am constantly behind a shield and when i attack somehow some dude slices me before i can even hit what a bad game story and diologue is so bad it might of well give you ♥♥♥♥♥ herpies or some of that aid from a prostetute (Said it so it won't censor) so well this game is trash pls no buy and ok, bye.",
            "review_score": "-1"
        },
        {
            "review_text": "A Blender game. Barely playable. Those 'unique combat system' claims in the description are ridiculous.",
            "review_score": "-1"
        }
    ]
}