{
    "app_id": 420670,
    "name": "Elite vs. Freedom",
    "release_date": "2016-05-31",
    "developer": [
        "AVE"
    ],
    "publisher": [
        "AVE"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Online Multi-Player",
        "Local Multi-Player",
        "Co-op",
        "Online Co-op",
        "Local Co-op",
        "Steam Achievements",
        "Steam Trading Cards",
        "Captions available",
        "Partial Controller Support",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Violent",
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Violent"
    ],
    "achievements": 33,
    "positive_ratings": 26,
    "negative_ratings": 46,
    "price": 3.99,
    "description": "Elite vs. Freedom is an action-packed Indie third-person shooter game. In the near future, the Earth is controlled by a global government. Few dare to resist this neo-feudalistic, corporatist, police state. Leading the insurgence, a group known as Freedom takes up the fight.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/420670/header.jpg?t=1497298174",
    "minimum_requirements": "OS: Windows XP SP3 (32-bit only) with DirectX 9.0c, Windows Vista, Windows 7, Windows 8, Windows 8.1, Windows 10 Processor: 2 GHz or better - Single Core Processor Memory: 2 GB RAM Graphics: A graphics card with Shader Model 3.0 support, such as nVidia GeForce 7800 or ATI x1300+ DirectX: Version 9.0c Storage: 8 GB available space Additional Notes: If you launch Elite vs. Freedom for the first time, UnSetup.exe needs to be run with administrator privileges. It's recommended to install the latest drivers and updates.",
    "recommended_requirements": "OS: Windows Vista, Windows 7, Windows 8, Windows 8.1, Windows 10 Processor: 2.4 GHz Dual Core Processor or better Memory: 4 GB RAM Graphics: NVIDIA 8000 series or higher, ATI Radeon HD 2400 Pro 256 MB, or greater DirectX: Version 10 Network: Broadband Internet connection Storage: 8 GB available space Additional Notes: If you launch Elite vs. Freedom for the first time, UnSetup.exe needs to be run with administrator privileges. It's recommended to install the latest drivers and updates.",
    "reviews": []
}