{
    "app_id": 420740,
    "name": "The Deed",
    "release_date": "2015-11-23",
    "developer": [
        "Pilgrim Adventures",
        "GrabTheGames Studios"
    ],
    "publisher": [
        "GrabTheGames",
        "WhisperGames"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "RPG"
    ],
    "tags": [
        "RPGMaker",
        "Adventure",
        "Crime"
    ],
    "achievements": 17,
    "positive_ratings": 1378,
    "negative_ratings": 137,
    "price": 0.49,
    "description": "A keenly dark twist on the traditional murder mystery setting, The Deed is an Adventure/RPG game about getting away with murder. Arran Bruce, the rightful heir to Dunshiel House, returns home to settle a score with his estranged family.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/420740/header.jpg?t=1549401441",
    "minimum_requirements": "OS: Windows 98/XP/Vista/7/8/10 Processor: Intel Pentium III 800 Mhz Storage: 512 MB available space Sound Card: Generic",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "True little Gem. Small, but precious. I regret buying it on sale. I should have bought it when it had full price tag. If you are into games that impose consequences of your deeds on you, then it's something you have to play. There are a few endings, interesting dialogues. Consider it a mix of RGP, Stealth and Puzzle in a pill.  Overall presentantion is great and dark/grim atmosphere is perfect for this title. ",
            "review_score": "1"
        },
        {
            "review_text": "The Deed is truly an enjoyable game, which can be finished in a short time but can be played again many times thanks to the different choices you can make. Your deed is to kill your sister in order to inherit your father's possessions. You can use different weapons and try to frame the other people who are in the house. What you're going to say and to do will affect the outcome of your deed and make the difference between success or failure. The atmosphere fits perfectly the plot.",
            "review_score": "1"
        },
        {
            "review_text": "This is a short and simple indie game that really expands on the interactive game genre. Aesthetically, the designs are simplistic and sufficiently detailed to enhance the ambience of the game. At the affordable sale price of $0.49, there isn't really much of an opportunity for any nitpicking. Briefly summarising, the game places you in the shoes of a man plotting for a murder, striving to get away scot-free. With a vast range of options and various approaches you can take, the game flaunts its versatility and variety of game-ending outcomes. Honestly, if you're looking for a quick, cheap game for your entertainment, consider 'The Deed'.",
            "review_score": "1"
        },
        {
            "review_text": "Worth a dollar easily. Short but intriguing.   But I don't understand how a half hour game with such high replay value can have so many typos... Same with the sequel, only 1 minute into it, was there any testing?",
            "review_score": "1"
        },
        {
            "review_text": "1.) Hung my sister with a rope. Charged with murder. (2) 2.) Killed my sister with rat poison. Murder remained unsolved. (2) 3.) Strangled my sister with my bare hands just for the hell of it. Got caught with rat poison on me as well. Life sentence. (1) 4.) Killed my sister with broken glass. Life sentence. (1) 5.) Planted some love letters. Sprinkled some rat poison. Got away with it! (1) 6.) Killed my sister with my fencing sword. Life sentence. (1) 7.) Killed my sister with the shotgun. Guilty as hell. (1) 8.) Beat my sister to death with a broom handle. Life sentence. (1) 9.) Bashed my sister's brains in with a cue stick. Life sentence. (1) 10.) Killed my sister with the knife. Life. (1) 11.) Bludgeoned my sister to death with the candlestick. Life. (1) 12.) Planted some panties. Strangled my sister. Butler gets framed! (1) 13.) Planted some love letters. Killed my sister with broken glass. The Maid got framed! (1) 14.) Planted some diary entries. Killed my sister with a candlestick. Mother got framed! (1) 15.) Planted a tawse. Killed my sister with a shotgun. Father got the shaft! (1)  (17) achievements to fully complete the game. 4 hours of psychopathic fun!  8/10",
            "review_score": "1"
        },
        {
            "review_text": "An interesting RPG Maker gem. Quite short but pretty replayable. Recommended to anyone who has nothing better to do with a dollar.",
            "review_score": "1"
        },
        {
            "review_text": "  A short game it is but its length comes in those wanting to frame others, with it being short you don't have to be dragged through long conversations to get to a certain point to kill again which is nice. With having to frame others you find out more backstory to each character which I found fun to read, specially to go back and pick different options to see the reactions.  The main fun of this short game is just seeing which evidence goes were and how effective it will be in the end as well as which weapon suits the framing-item. I had fun with this in my time playing it and to be honest would go back and play it again to see which other item combinations work well.  P.S - Got what you deserved dad!",
            "review_score": "1"
        },
        {
            "review_text": "This game has definitely a lot of useful tips for when the time comes to murder my mentally insane sister so that I inherit all of my rich parents' property myself.    Brb, I think now is the right time actually.  ",
            "review_score": "1"
        },
        {
            "review_text": "The Deed is arguably the best game you can find on Steam for under 1 USD.  It is a game about plotting a murder on one of your family members (your sister) to inherit the wealth from your parents.  The story's protagonist has a variety of murder weapons as well as evidences to carry out the murder.  At the end of the game, depending on how intelligent and successful your plans are, you will experience a variety of different endings based on the respective circumstances.",
            "review_score": "1"
        },
        {
            "review_text": "The game is super short, but compelling, original and atmospheric, so it was worth the 1 dollar asking price for me.  Cons: there are a few punctuation and spellings mistakes, which shouldn't be there in a game this short, and a bug that stopped the mouse working after the first play-through. In fact, I had to restart my computer to be able to play the game again.   Good graphics (for an RPG maker game), good music, good writing and great characters, I can easily recommend this to anyone looking for a quick, intelligent adventure game. Just don't expect more than a couple of hours of playing time!",
            "review_score": "1"
        },
        {
            "review_text": "A fun little game that's basically about how to get away with murder and get what you want. With multiple endings it presents an engrossing puzzle, and the first time you get away with it is very gratifying.  Yes it's a short game, but it's perfectly priced. ",
            "review_score": "1"
        },
        {
            "review_text": "The Deed is a murder mystery game from Pilgrim Adventures and GrabTheGames. Let’s get rocking.  The Good  Aside from the 99 cent price tag, the best thing about this game is that every single dialog option you pick will either save you in the end or come back to royally screw you. Multiple endings means there are any number of ways for you to succeed or fail and it is a lot of fun to experiment with all of the possibilities.  The story is set up in the same vein as a classic mystery novel/novella. While I’ve never been a huge fan of the mystery genre, The Deed keeps things quick and to the point, making it quite enjoyable.  The Bad  Nothing here, sorry.  The Meh  Playing through the game multiple times to see multiple endings can become tedious in a hurry.  Verdict: Yea  For 99 cents? Hell yeah, I’d recommend it. If you’ve got a dollar burning a hole in your digital pocket and have nothing better to do with it, consider giving The Deed a chance.",
            "review_score": "1"
        },
        {
            "review_text": "This game is truly worth every single cent you spend. I bought it on sale, but I will buy another copy/copies when it goes off sale for a friend/friends, definitely. There are various routes you can pursue (along with various methods of murder.) This is basically Ace Attorney: Investigations, except you're murdering someone...not investigating the crime.  My only, small suggestion is making it a little more difficult, as I found it particularly easy- but others may beg to differ.  9.5/10 (-0.5 because of how easy it was, I love everything else about the game.)  EDIT: First time playing takes approx. 15-30 minutes, depending on your thoroughness. I talked to everyone and discovered every murder weapon in the game on the first trial. The rest of the times (to get 100%) achievement took me about 10 minutes to go through and complete.",
            "review_score": "1"
        },
        {
            "review_text": "The best game I've ever played made with RPG Maker.",
            "review_score": "1"
        },
        {
            "review_text": "Quirky fun little game! For a choose your own adventure it is interestingly dark and twisted, all in all I would call this a very entertaining find!",
            "review_score": "1"
        },
        {
            "review_text": "For anyone who has ever wanted to murder their sister and pin the blame on their parents.",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun little time waster. Easy to play and doesn't take long to master. It is very much like the classic board game 'Clue' in that you are in an old estate and there is a murder to be solved. The only difference is, you are the murderer, trying to get away with the perfect crime. Numerous weapons allow you to vary your crime and there are various types of incriminating evidence that you can plant in various rooms to pin your heinous crime on any of the NPC's you encounter, including the victim.   Your first few playthroughs can take 15 minutes each as you try to find every little secret in the estate, though each subsequent playthrough takes 5-10 minutes tops. The replay value is limited to about 2-3 hours though, as that is about how long it should take you to get all endings, and all achievements.  I encountered no bugs or gameplay issues and there is controller support. My only complaint is the the dialogue is a bit stiff, but it is still entertaining.  Final Verdict? Because of the low price point, and expectations, I can easily recommend this game. Two - Three hours of entertainment for $1 or less is a win in my book.",
            "review_score": "1"
        },
        {
            "review_text": "You're a rich boy priveleged with a crazy family, and not in the quirky way. Honestly I don't understand why someone didn't do the killing for you with how often they act like a bag of ♥♥♥♥♥. While albiet very very short (in total it took me two hours to get all the achievements in the game) the story is very interesting and there's definitely a lot to discover while adding a nice bit of humor and dialogue. I was surprised how much sympathy I felt for the main character with how short of a game it was.",
            "review_score": "1"
        },
        {
            "review_text": "First time I get away with murder, but fail to frame anyone and don't get the inheritence. Second time I act like a complete idiot, use my bare hands, wind up in jail.  Apparently I'm not a good murderer. But it's fun to try nonetheless. &gt;.&gt;",
            "review_score": "1"
        },
        {
            "review_text": "  Got this game for free, so im not going to complain. its fun for a while, i've only played for half an hour so i can't really say much but its interesting and good to play with a friend to see what you choose.  8/10 - Mystir",
            "review_score": "1"
        },
        {
            "review_text": "It's very easy to implicate everyone after reading through the options once. No great effort ot thinking required.",
            "review_score": "-1"
        },
        {
            "review_text": "A very fun little game, a choose your own (murder) adventure. It takes probably 15 minutes to beat, but it's fun enough and there are enough options and consequences that replaying is very fun. I replayed enough to see most of the outcomes through and for the price you get your moneys worth!",
            "review_score": "1"
        },
        {
            "review_text": "Creative, you have to kill you sister, it gives you a lot of ways to do that.",
            "review_score": "1"
        },
        {
            "review_text": "One goal: Murder your sister. Picture a story in your head of how she dies using the items lying around the house, and put it into action. That is defiantly the strongest part of this game, everything is incredibly logical and the game throws no off the wall curve balls at you. Your plan is not going to be sabotaged by some BS variable that seemed irrelevant, but instead by your own clumsiness, or the things you said. Due to the games incredibly short length, getting all of the endings is a very doable task and gives you plenty of room to play around.   That said the game does have some faults. While watching the detective piece your crime together is fun, he is not very smart. It can be alarmingly easy to get him off your back on certain issues which should raise more suspicion. Like saying you kept your coat on to stay warm, despite it being drenched by the rain. Or accusing him of asking you a leading question about your behavior, yet when he asks a leading question about your father immediately you play along with it. It makes it kind of obvious that he follows a point system to reach his verdict.  While the characters feel realistic for the most part, I did feel the sister's dialog was a little cartoony. I know she has a disorder, but she really showed no redeemable qualities and did not really have a reason to hate you as much as she did.  I also felt the flashbacks were a wasted opportunity, they are kind of interesting at first, but only tell you things you already know.  Despite the few nitpicks I had with the game, I did not regret playing this. The aesthetic reminded me of Clock Tower, and the fact that everything you say and do has consequences is truly impressive, and I will keep an eye peeled on this developer if they should ever construct bigger projects.   Also the game costs as much as a bag of potato chips, so there really is no excuse not to try it. ",
            "review_score": "1"
        },
        {
            "review_text": "The Deed is a short but neat puzzle/RPG.   Basically you're going to kill your sister, using various weapons, and you can blame it on another person, depending on your choices.   For half a buck you can either get this game or an ice cream,an ice cream only lasts for about 5 to 15 minutes, The Deed can lasts about 2 hours, therefore The Deed is better.   Worth the price it's asking for, buy it.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. It's short, but has so many endings and possible ways of going through it. I enjoy it a lot even though I suck at games like that! I might just resort to a guide later to uncover all the endings - definitely great value for money.",
            "review_score": "1"
        },
        {
            "review_text": "Really good for an RPGmaker game! I found out the perfect solution tho on my 3rd try so i was done with it pretty fast :P But totaly worth the 50 cents now its on sale :D  So yea, for those who want to know the solution is:   Go play the game yourself and find out :)  ",
            "review_score": "1"
        },
        {
            "review_text": "Arran in the dinning room, with the pool cue............   Great little game worth every penny",
            "review_score": "1"
        },
        {
            "review_text": "The Deed is a short game with an interesting premise.  There isn't any variance in the story (no random elements), but there are 'branching' paths to conviction in framing others murders, allowing for decent replayability.  I enjoyed the game because of its somewhat novel idea, but it is incredibley short and some mechanics are lacking.  Buy it if its cheap (which it seems to be).",
            "review_score": "1"
        },
        {
            "review_text": "Costs as much as a candy bar, lasts you longer and doesn't make you fat.",
            "review_score": "1"
        },
        {
            "review_text": "its okay. it has some replay value (not too much) not very long. but achievements dont unlock. i used the rope to kill her but didnt get that achievement. i would probably have played it A LOT more for the achievements.",
            "review_score": "1"
        },
        {
            "review_text": "thought i give this a go,the games not bad can keep you busy for a couple hours and a bargain price,only thing was steam cards didnt drop for me-ne of the reasons i went for it,overall ok apart from that",
            "review_score": "1"
        },
        {
            "review_text": "Similar to all reviews, this game comes to an excellent price and is definitely worth the loose change! and the story line only goes for about 10 minutes tops if you chose your own options and paths but overall it is very interesting and i do enjoy some Murder Plot games! Its the creativity and Fun that comes with it. Definitely worth my time!",
            "review_score": "1"
        },
        {
            "review_text": "For its price alone, every one should play this game! You got to get creative to get away and to have someone else take responsabilty for you. The murder weapons are all very funny to used. The dialogs are clever. This game is very short but is very interesting! Took me 3 hours to plan everything 'correctly' and unlock all achievements.  I enjoyed all the time spent on that game!  Would have like that the achievement about using each weapon would only be completed if you are not being caught at the end.",
            "review_score": "1"
        },
        {
            "review_text": "Great game just a little short",
            "review_score": "1"
        },
        {
            "review_text": "It's fun. i succeeded framing my dad lol",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Got it for 30 cents and got a couple hours play out of it. I recommend playing fullscreen for the best atmospheric effect.  You play as the son, Arran, and must kill your sister, who is a loony. The weapon you use and the evidence you plant is up to you.",
            "review_score": "1"
        },
        {
            "review_text": "Very short game with some replay value. I like what the game designer has done, trying to do something new with RPG Maker but it just falls a little flat. The doors are not very clear and neither is how to place 'evidence' after the crime has been commited. Overall not bad but not worth a thumbs up.",
            "review_score": "-1"
        },
        {
            "review_text": "And the brother of the year award goes to...not the main character.",
            "review_score": "1"
        },
        {
            "review_text": "  love this game  ",
            "review_score": "1"
        },
        {
            "review_text": "-Thought I could plant murder weapons as evidence.  -Detective finds out I have a shotgun.",
            "review_score": "1"
        },
        {
            "review_text": "After playing games where I die in many different ways it's refreashing to play something where I kill someone in many different ways (and blame someone for it)",
            "review_score": "1"
        },
        {
            "review_text": "$1, trading cards worth more than the game, free 100% achievements. Worth it :)",
            "review_score": "1"
        },
        {
            "review_text": "The screen in very very littel",
            "review_score": "-1"
        },
        {
            "review_text": "Make a second part of this game",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun short game",
            "review_score": "1"
        },
        {
            "review_text": "Small package, good content!",
            "review_score": "1"
        },
        {
            "review_text": "  its very good i mean its has like a RPG mixed with a little of Telltale games very hard to kill tho ha",
            "review_score": "1"
        },
        {
            "review_text": "Play to satisfy your inner devil.",
            "review_score": "1"
        },
        {
            "review_text": "Quick and clever, just like you have to be to get away with your sinister plot. ",
            "review_score": "1"
        },
        {
            "review_text": "  One word for each aspect of this game.",
            "review_score": "1"
        },
        {
            "review_text": "For a fairly short game, that I beat first go in 0.5hrs. I liked it. After playing it thru, and seeing other locked acheivments, this game should prove to be hard to 100% at least.. With its short playtime, its worth the dollar :)",
            "review_score": "1"
        },
        {
            "review_text": "Good choice and consequence game. The history is simple and can end the game in 15 minutes.   However, the good dialogues instigates you to play it a lot of times, to check where the possibilities leads you.   To get all the achievements i tried all the possibilities and it was not disappointing.   Considering the game costs less than 1 dollar, it is a worthy game.   Besides, you get the cards and, in the end, the game costs nothing.",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed this game and the end of it when the karma haunts you and lets you think of what you did (important lesson learned but at what cost...)     P.S: If you are a lazy bum like me use the guide(s) to see how to do all endings.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 value for money (or inheritance if you know what I mean). Strangled sister with my bare hands and had a whip in my pants. Still got father arrested.  Quite unique and well-written. Gets a bit repetitive and some spelling errors but still fun to play.  ",
            "review_score": "1"
        },
        {
            "review_text": "It gives off the feel of an old CD-ROM game, but I don't mean it isn't enjoyable.   The game is very intriguing, with many alternate endings based upon the evidence and murder weapon you choose. The graphics and sounds are basic and the story becomes repetitive.   It's a great game if you are looking for something to break away from the regular mainstream games. It is quite the little gem.",
            "review_score": "1"
        },
        {
            "review_text": "The Deed is a very short RPG game (completed within about 20-30 minutes if you read everything, 10 if you just click) where you have to murder your sister at a dinner party and not get caught. You have to pick up two items, one evidence item and one weapon. Or, you could plant two evidence items and use your bare hands to kill her.   Was the game worth the $0.60? YES. Would you say it is worth more? Yes, but not much due to its length. However, you can play it over and over again and as you do, you realize that the story behind the game is actually quite detailed. It's amazing how the creators of this game managed to portray every character's personality so well in the short amount of time the game takes to play.   An interesting thing in this game is the fact that you get to see some flashbacks from your past when you look at/interact with certain items, such as the mirror in the hallway and the chair in your parents' room. It's a nice touch and it really helps you get a sense of what the main character went through as a child and why he has his mind set on killing his sister.  And on to the best part: the weapons! Although this game takes place inside a house and runs a very short time, there are a great deal of weapons and things to choose from, such as but not limited to, a pool cue, a broom handle, a broken mirror, a shotgun and even a fencing sword! The variety in this game is phenominal and you can tell just by looking at it how much love and effort went into creating it - the atmosphere, the characters and everything.  Overall, if I was to give this game a rating out of 10, 1 being terrible and 10 being absolutely groundbreaking - I'd give this game a 7/10 for being a good, simple, and creative way to spend 20 minutes and $0.60. If you have a love for murder mysteries and the like, I highly recommend this game. Seriously, it's so cheap and so much fun, you'd be a fool not to buy it.",
            "review_score": "1"
        },
        {
            "review_text": "lol you can kill someone with rat poison",
            "review_score": "1"
        },
        {
            "review_text": "Really well thought and well made short game. Specially for the price. Found myself trying to unlock all of the archievements. Thumbs up.",
            "review_score": "1"
        },
        {
            "review_text": "Very very very very very very very very very very short game but with a nice little story about you trying to get away with murder. Multiple endings and multiple ways to kill.",
            "review_score": "1"
        }
    ]
}