{
    "app_id": 420790,
    "name": "StarBreak",
    "release_date": "2016-05-10",
    "developer": [
        "Crunchy Games"
    ],
    "publisher": [
        "Crunchy Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Multi-player",
        "MMO",
        "Co-op",
        "Cross-Platform Multiplayer",
        "Steam Achievements",
        "Full controller support",
        "In-App Purchases"
    ],
    "genres": [
        "Action",
        "Free to Play",
        "Indie",
        "Massively Multiplayer"
    ],
    "tags": [
        "Free to Play",
        "Action",
        "Massively Multiplayer"
    ],
    "achievements": 84,
    "positive_ratings": 728,
    "negative_ratings": 221,
    "price": 0.0,
    "description": "StarBreak is a unique skill-based action platformer MMO where you explore strange sci-fi worlds alongside dozens of other players, kill legions of dangerous aliens and fight epic boss battles.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/420790/header.jpg?t=1520965060",
    "minimum_requirements": "OS: Windows Vista or later Processor: 800 MHz Memory: 512 MB RAM Graphics: Intel HD Graphics 4000, OpenGL support Network: Broadband Internet connection Storage: 512 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "  I've been playing for 1.5 years now, ever since closed Alpha- I remember when it was just a small group of players trying to take down the Underground Base boss, repeatedly dying. When we finally did, it was the best thing ever- and that stands true to this day when it comes to bosses.   The game is permadeath, so when you die you lose everything. A lot is going on at all times, and no shell really has that much defense. Ironclad may have high health and defense, but it's slow and can't dodge well- you need skill for every single shell to stay alive. This makes every accomplishment all the better, compounded by the fact that Starbreak is a multiplayer game- you can share and brag about the things you've done~  I can't wait too see where this game goes, and I hope it survives. Hopefully we can still be playing years from now :3",
            "review_score": "1"
        },
        {
            "review_text": "Great and Addictive side scrolling MMO Game, its addictive because of the permadeath thing Good Graphics, Its like terraria on a whole new level but focuses on combat Challenging Dungeon and Bosses Great Soundtrack, Especially on Boss Battles  Not a Pay to win   To sum it all up 9/10   And also please fix the lag at Temple of the Lost Final Boss.",
            "review_score": "1"
        },
        {
            "review_text": "  The fact alone that there is little to no transactions already proves this a great game for f2p   You gotta love when everybody dies and you end up either attacking or stay in the corner until someone else comes by truly, the best game where you rush at the boss guns ablazing or you commando it by yourself i dont really find anything i hate about this game only small things like, being forced to stop while shooting, i mean, it helps sometimes but maybe it would work for other people`s playstyles if it was an on/off thing you could choose   but then again the animations must be very hard to make  ",
            "review_score": "1"
        },
        {
            "review_text": "I've been playing since beta (no uc, no way to pay to get stuff like char slots)  I wish the devs would keep working on it...   still good",
            "review_score": "1"
        },
        {
            "review_text": "  StarBreak is a roguelike co-operative platformer that's centered around player progression.  When I say 'centered around player progression' I say it as opposed to classic in-game character progression, which is what MMO's and most games do these days.  StarBreak has permadeath. If you die with your character (your shell, as the game calls it), all his stuff is lost, he's gone forever (god bless his soul) and you win experience points that level up your Soul based on how far he got. Having a higher soul level lets you unlock the other characters that have completely different playstyles from the original one you get.  What a lot of people don't seem to understand is that the level progression is entirely artificial. They make you wait to play the other characters because they want to player to get more experienced with the game and enemies to be able to know how to react to different situations according to the unlocked character and it's difficulty.  This game has basically no progression other than the stash, because as mentioned before it's a game about player progression. Getting further and further into the game can only be done through first-hand experience with the enemies, which feel consistent and fair given how they're placed strategically on the terrain. This is basically how it goes, in order: 1.You'll get hit by stuff you see coming. 2.You'll get hit by stuff you saw coming, but couldnt manage to avoid it. 3.You'll get hit a lot by stuff you didn't know could do X in X way. 4.You'll die to situations you couldn't predict other than experiencing them.  Now, all of the above will gradually go away, until you can control your character consistenyl and be constantly aware of the environment, which feels extremely rewarding for the player, complemented by it's MMO aspect:  When racing through a difficult dungeon with others, most of the times only the experienced, skilled and thick-skinned players push on and advance. Not the ones that tediously grinded for days, built their character differently, or whatever the hell other games do: They got there because they faced the challenges and persevered, by dying to them previously over and over and over again.   There is a cash currency in the game, known as UC. With it, you can buy additional stashes and player slots, coupled with a few vanity hats on rotation.Additional stashes are useful if you're keeping the equipment for the next character, and the hats are lost on death too. What I would argue goes against the main point of the game, are the additional player slots. Having additional player slots means you get more loot efficiency than other players that don't, should you choose to play more characters at once. In a game about not dying and getting as far as possible, being able to change shells sort of kills the feeling of only having one life as, since there's no trading, you're essentially saving the equipment you can't use with the current shell, to yourself. Not your 'future' self, but your 'now' self. A possibility free players don't have.  It is however, not a game for everyone. It seems extremely unforgiving in certain aspects and I feel like having to explain the fun of the game to someone else defeats the purpose if the person itself didn't find it fun. Many don't like it for it's permadeath aspect, yet I feel like they're just missing the point entirely. While it is quite sad to lose all the progress in a simple mistake, a lot of the times, to me, felt justified. Be it a bit of bad luck, bad positioning or a tough enemy: whenever I was about to die, I could feel it in my veins that those were my last moments, and that was exactly how it was meant to be. The game is what it is. There's no point in trying to make it something that it is not. Removing permadeath would remove a lot of the tension which IMO is a huge part of StarBreak.  If you liked the early days megaman and metroid, you'll probably have a blast with this game. The multiplayer aspect works really well with it, more than i'd initially thought it would. Coupled with the permadeath, it's a game where while in lower levels you just shrug off character deaths, later on you really feel for them, and i've sacrificed myself more than once in hopeless boss fights to let the other players teleport back to base (takes like 10 seconds of standing still) by providing them with cover fire. As another review said: 'It felt like ♥♥♥♥ing Starship Troopers.'  Some more technical points: The gamepad feel is great. I used and Xbox controller for it and it's already binded, with some emotes custom-bound to the D-pad. What bothers me is the second character's (Duskwing) dash control, since for some reason the special dash is canceled if you let your movement stick go back to neutral position. It can be really ♥♥♥♥ing confusing to see her just stall after doing the dash because you moved your stick to the same direction she's going, but that's minor once you get used to it. (THIS ISSUE WAS FIXED A FEW DAYS AFTER THIS REVIEW, CHEERS DEVS)  Needless to say, it runs well. The graphics aren't intensive, keeping it in a stable 60 fps, and the design aesthetics never feel off from the visual pacing aswell. Sound wise, the effects have a pleasant hit-noise and the music's good. It's not that memorable, but it definitely sets the scene for each environment and scenario presented, enough to make cold-blooded people have a decent surge of adrenaline.  All in all, it's a great free to play time-killer and tons of fun for those that like the jump'n'shoot genre and/or want to fool around with friends. It may feel rewarding to beat enemies you previously died to whilst growing as a player yourself, but it's always more satisfying when you do it with other people.",
            "review_score": "1"
        },
        {
            "review_text": "Nice boss fights and the permadeath make this game addictive.  8/10",
            "review_score": "1"
        },
        {
            "review_text": "Great game - one of the best permadeath games out there.",
            "review_score": "1"
        },
        {
            "review_text": "  Amazing game!! if you are looking for a challenge then i will recommend this game, it's a hard game, community is always active and its a good game! i highly recommend you to get the game and give it ago!",
            "review_score": "1"
        },
        {
            "review_text": "Oh cool, 8 people in an elite mission? Might be able to finish the dungeon.    Get placed at the beginning of the mission with the other 8 no where to be seen  Well.. maybe I can find them if I push ahead a bit.    Proceeds to die by getting trapped between unpassable walls of enemies (eTL)  THANKS DEVELOPERS FOR ASSISTING ME IN LOSING YET ANOTHER 3 WEEKS OF WORK BECAUSE OF YOUR ♥♥♥♥♥♥ CODING. Glad that's not getting fixed, lets just paste over more crappy low level content that gets steamrolled on a daily basis to make WF even easier of a class to play. Played this long and I'm just done. Buggy coding along with a ♥♥♥♥♥♥ selfish player base that will ditch you whenever they dont feel safe makes this game unbearable to play, especially when it results in you losing precious gear you worked hard to get and didn't leech like half the kids in each dungeon run.   7/10 start, and only gets progressively worse as you get bored with one class, try another, then get bored with the limited number of maps that only a few of them are played because of difficulty. (Vanquished, Underground Base, Frozen Blight, Temple of the Lost) Rinse and repeat. I'm done, regret ever buying chests to store my loot that just get lost to ♥♥♥♥♥♥♥t like that.",
            "review_score": "-1"
        },
        {
            "review_text": "Great Game",
            "review_score": "1"
        },
        {
            "review_text": "  Just an amazing game. I have never seen anything like it and hope that other people find as much enjoyment as i do in the game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is quite fun and addictive the classes are unique the weapons are balanced. The controls are a bit difficult to get used to but are easy to use once you have learned them. The only problem about this game is the permadeath it does add difficulty to the game but also makes it a bit grindy having to replay the same levels over and over again. Thankfully the shop makes up for it so you don't have to grind as much (or not grind at all and just buy coins). The gameplay is nice and not repetitive. The missions are amazing with others and alone. The graphics are not the best. The bosses are challenging and fun to battle at the same time.   Overall this is just a good game I recommend this game to any gamers that want a challenge   8/10 game",
            "review_score": "1"
        },
        {
            "review_text": "I started playing the tutorial of this game, found out the controls, and was surprised to see that it is a keyboard-only-needed game, which sparked my interest. (I'm aware that there is controller support, haven't yet tried that out.)  It's a permadeath, looting, MMO, side-scrolling platformer game. Not a combination you see very often. Yet, somehow, it works very well.  Once I got used to the controls (which didn't take very long), I was instantly in love with this game. Everything is so smooth in gameplay, and it's so fun right from the beginning.  Then I got to what is basically a hub world, and I smiled. Oh, I smiled.  What makes me so happy with this game is that it's a free-to-play game that doesn't shove paid currency stores and pay-to-win nonsense down your throat. It's very wonderful to play just as a player who doesn't invest amy money into it. Sure, you can spend real money to get extra item storage and customisation items, but to be honest, you don't really need them.  The community is awesome, in the sense that when you're in an area and there are a few people around you, you will all start sub-consciously helping each other and not knowing it. And trust me, it helps when you come to area bosses.  I probably haven't explained the game much, but believe me when I say that this is definitely a game worth trying. It's free, what have you got to lose? (Well, apart from hours of your time into this game...)  Would fully recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Nice rogue-like game with nice cartoony graphic.",
            "review_score": "1"
        },
        {
            "review_text": "  I completely decimated my entire setup within 30 minutes.      69/10",
            "review_score": "1"
        },
        {
            "review_text": "Its pretty cool",
            "review_score": "1"
        },
        {
            "review_text": "Its ♥♥♥♥ing frustrating. But not a bad game at all. Its grind and die lose errything. Restart. Its a casual whenver you're bored kind game. And they should give you some more chest space. But otherwise. This isn't a game to get committed to.",
            "review_score": "1"
        },
        {
            "review_text": "It's a pretty interesting game which feels like RofMG and has a nice old school feel to it. Only missing more story elements which looking forward to seeing in future updates.",
            "review_score": "1"
        },
        {
            "review_text": "Had 6.9 Hours ingame    Would play 6.9 hours again...",
            "review_score": "1"
        },
        {
            "review_text": "Before I begin: Don't go down-voting this review because you hate seeing your favorite game getting criticism. Instead, actually read through this review, and take into consideration the things I have to say, as much of what is here could be considered a legitimate reason for viewing a game so negatively. Many issues I will be pointing out here have also been pointed out by not just myself, but others on both sides of the 'aisle'. All I ask is that you allow a guy a moment to offer his opinion.   Seeing as I apparently earned the ire of a few people for being 'negative about a perfect game', I'm rewriting this review to give more people insight into why I cannot recommend this game. I even TRIED to enjoy it, TRIED to play it and see the good in it, even after writing this the first time. As you can plainly see: Not much has changed, and I've only come away from it with more to focus on.  First of all: I still stand by the feeling that this has the 'potential' to be a great game with some pretty interesting mechanics. However, the mechanics are also what make this such a difficult game for me (and others) to like and enjoy. The gameplay is fun when you're on a roll, when you're blasting through enemy after enemy, finding really good gear to use, and just nailing those difficult jumps and attacks when it really matters. But the progression and combat mechanics can also make all of that work you've put into leveling damn-near useless, no matter how good you get.  When you die, you lose everything, including gear and stats. When you enter a new shell, you start back at square 1: bare bones stats, the most basic of weapons, no body or mobility gear, and not one thing to show for the amount of work you put into playing, except for a little pocket change and a tiny handful of experience points. Even then, it's not worth the trouble, as money is currently useless, and your level only dictates which shells you can use.  When out on the field, you pick up stat boosts to enhance your shell's abilities, which is all fine and dandy, as a couple extra HP can mean the difference between life and death. As you collect these stats, you will sometimes find that you max out an ability. This means that you've just maxed out one ability needed for the increase of your shell's MK level! Awesome! But, like I said: You die, you lose it all, and you have to do it all again. The only way to keep those stats is to stay alive through the entire dungeon. What doesn't help is that you have to collect MK II upgrades from harder dungeons, which means...You guessed it. You're gonna lose all that work, and lose that shiny MK II rating. It's not fun, it's not an enjoyable feature, and the only players who claim to see this as enjoyable are the 'hardcore' players, or those who believe the risk-reward system is 'perfect'. Not everyone is a masochist.  If you want to save those stats, plus the gear you managed to scrape up off the ground in a dungeon, you have the choice to purchase the game's premium currency, which can then be used to unlock a shell storage container, allowing you to switch out to another shell when you want to. Buying the currency is the only way to get these handy dandy containers, as, even if you were given the option, you'll almost never be likely to have the cash on-hand to pay for it, seeing as dungeons pay you in literal pocket change.  Oh yeah, you can even buy cosmetics with that same premium currency! But, like every other item in the game, it can be rendered useless, not to mention non-existent, the moment you die. In other words, you're wasting your time and money on something that doesn't even help you. People say it only costs you a few cents, but the amount really starts to add up, as you grab those same items and try a dungeon again. And again. And again. And again. It starts to add up very quickly.  You may be wondering, though: 'Just how easy would it be to die in this game? It all looks easy!'  Trust me. You'll die easily. SO easily, in fact, that you can likely attribute your death to either sluggish framerate, poor terrain generation, enemy placement, or a ridiculous combo of any and all of those things. Or you can attribute it to the often-insane number of players on-screen, which makes jumping and fighting nearly impossible in some situations, and it limits the amount of points you get when you die. Of course, you COULD run a dungeon solo. Wait wherever you spawned in at, give everyone a few minutes to die off or move on, and then you have all of those respawned monsters and a few treasures waiting for you. Just don't expect it to amount to much.  Not only will you be fighting a ton of alien creatures looking to strip away all of those shiny boosts and pieces of gear you've picked up, you'll be fighting the controls as well. If you're using a controller, aiming is VERY clunky, not to mention very frustrating, as it's tied directly to your movement stick (left stick by default, or d-pad). You can only fire left or right, and then diagonally in between those directions. That's it. No shooting straight up or down. There's no precision shooting, and there's little garuntee you'll hit that enemy coming at you at an odd angle, as you have to find that sweet spot to make your shell fire in an upward direction. Controller users also have to wrestle with the VERY unusual right-stick special. Flick your right analog stick up, down, left or right, and you fire off a special skill. It's a pain trying to use that in the middle of a boss battle, especially when you try to quickly go back to your default primary and secondary fire buttons (B and X on Xbox controllers), and more so when you're trying to out-manuever both the boss AND it's minions (wo spawn in so frequently that you'll likely die in a pit of the blasted things).  If you enjoy platforming games, or maybe just enjoy being put through hell for a handful of XP and credits that will do you very little, sure, this game is fun. But for others, myself included, this game just isn't fun. Fighting controls, fighting framerate issues, fighting BS terrain generation and enemy spawning, fighting the game's mechanics...None of that is fun, nor is it worth spending time trying to adjust to it.  And there you have it. My reasons for not enjoying this game, and for not recommending it.",
            "review_score": "-1"
        },
        {
            "review_text": "I really, really, really. do not know why i play this game.  maybe i'm super masochist. yeah that's a good reason.  MASOCHISTS ONLYYY EXPECT TO DIE EVERY SEVERAL MINUTES ALL. THE. TIME.  Great for playing with buncha friends though.  4 classes \\ shells to choose from starter rifle man \\ gunner sleek fast moving critical hitting air harpy  huge tank of a guy with a hammer n shield support robot with a buncha tiny machines to help",
            "review_score": "1"
        },
        {
            "review_text": "Well not bad, but the control is kinda bit hard. :/",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun 2D shooting game.",
            "review_score": "1"
        },
        {
            "review_text": "Spark4lyf  OP class 10/10, spend most of my time playing as Spark. I really like to use this class against bosses.  F2P sidescrolling shmup with permadeath, gear etc. Nice art style and well designed bosses that you will grow to hate.  Have fun in Star Cathedral..",
            "review_score": "1"
        },
        {
            "review_text": "  i'm going to start out by saying i do not like this game even though i love the idea behind it and will tell you why that is.   firstly this game is built around hardcore modes. you have 1 life and when you die (and you will) you loose everything. in this game there are armor and weapons and 1 death can erase all that in a second. a character called dustwing which is a mobile hero with lots of movement abilities has roughly 50hp. a static trap that you can get knocked into on a medium difficulty map had delt me 28 damage with mulitple points in armor. that means if you get knockback/stunlock twice your f*cked. there are no options for a casual mode where you keep your gear. if there was this would be my new favorite game.  if you want to get anywhere towards mid to end game you have to pay. you have a tiny 6 slot 'freebie' chest and thats it. to get more storage or the option to have more than 1 character at a time you have to pay.   the game runs beautifully and uses less resources than watching youtube videos in html5 format. so this game will run on your ancient pc no problem.  the characters all look alike, like exactly the same, and the only way to tell your character apart from the others is a white glowing orb around your character. the problem in this lies with the fact that characters are silver so it blends in with character models, the bullets are white, the hit numbers are white, damn near everything in the game is white so on occasion you walk into stuff that damages you because the character you think is yours isnt. normally i wouldnt care but with the hardcore mode and the fact you loose everything this NEEDS changed to a different color. maybe lime green since that color isnt used in game that much.  one other thing that bothers me about this game is the fact it calles itself an mmo. the main thing about mmo's is that they have an economy built by the player base. that is impossible in this game due to the inability to give/trade your stuff away and there is no way to sell anything so you get stuff you dont have room for you just have to drop it and nobody can pick it up since all the items are instanced to your character.   there is an ingame text chat option but you have to register with their website in order to use it and ingame nobody does because of the 'hardcore' nature of the game.   the last and biggest issue i have with this game it the leveling system. you only gain experience if you do better than any other time you've played. that means you throw a grenade into a group of baddies and deal 500 points of damage. to get point every again you must deal greater than 500 damage. if you do less than 500 damage you get NOTHING!. to top it off you only get the points WHEN YOU DIE AND LOOSE EVERYTHING! thats right this game extends the playtime by making you repeat the same levels over and over for 0 gain. if you dont level up you cannot play all the characters. they are unlocked at level 1, 3, 5, and 7. i have played 5.7 hours and i'm just now lvl3 and i do not see that changing anytime soon.  another problem i have with this game is the controlls. pushing up or down on your control stick does not make you jump or crouch or fall through platforms. i can understand why they did this but at the same time its forcing you to learn a new way to play a game at the same time your platforming and being attacked by mobs (aka its rage inducing). on the same topic i'm using a steam controller which i've used for other games like american truck sim and in this game it doesnt want to registed that i'm point the stick down until its almost pointed straight down. this has actually got me killed numerous times since i couldnt shoot the monster at my feet and i watched my bullets shoot straight over its head. oh yeah you also cant shoot straight up or down which adds another layer of difficulty to certain mobs that hang from the cealing and your forced to take damage just to be able to shoot them.  overall i think if this game added a casual mode, way to sell excess gear to a vendor, trading system, and expanded the options for free players this could easily become the next big mmo since it has a retro feel and retro games are making a comeback (a good thing). they get a 10/10 for creativity but 5/10 for execution.  ",
            "review_score": "-1"
        },
        {
            "review_text": "It's free, so why not try it? Fantastic game overall.",
            "review_score": "1"
        },
        {
            "review_text": "Really needs a friends list. Point of Free multiplayer games is to play with friends D:",
            "review_score": "-1"
        },
        {
            "review_text": "  Risk of the realm of the mad rain!  Positive: FREE FREE FREE Good Controls Oh and its FREE ",
            "review_score": "1"
        },
        {
            "review_text": "Permadeath is too punishing since you can be killed by random things far too often. It is not rewarding and there is no sense of progress.",
            "review_score": "-1"
        },
        {
            "review_text": "If you like no customization options, and using your arrow keys... This is the game for you!",
            "review_score": "-1"
        },
        {
            "review_text": "So, NOT a newbee friendly game, they are going to constintly be either loosing there gear or leaving matches to save there gear, also WAY WAY WAY to expencive micro transaction store, you want 6 extra storage slots.... $4 USD..... pass on that gready BS  AND who is giveing this game such shining reviews, oh yea, review spam bots.... Steam really needs to make it so you can write reviews tell after at least 10 hours of play or so, at least then it would slow down all the 'vary positive' reviews...to then have like 604 players Actually playing(as of 5/12/2016) there are almost more 'postive reviews' then players playing, if your going to give it a positive review then uninstall it, that vote should become nutral not 'postive'",
            "review_score": "-1"
        },
        {
            "review_text": "trash trash trash trash trash so terrible how do u move with arrow keys wat is this trash trash controlls are horrible trash trash trash",
            "review_score": "-1"
        },
        {
            "review_text": "quite boring for the first 5 minutes..",
            "review_score": "-1"
        },
        {
            "review_text": "Fun game, when being bored",
            "review_score": "1"
        },
        {
            "review_text": "Starbreak is a permadeath platformer mmo developed and released by Crunchy Games. It is a fast paced, metroidvania style mmo with both unique and familiar features.  PROS: -Fast paced combat. -Nice level variety. -Great art and beautiful soundtrack. -Challenging gameplay with a lare skill ceiling. -4 classes with nice variety and gameplay differences. -Very addicting. -All the loot you see is yours, you don't have to worry about stealing other peoples loot and vice versa. -Fun and challenging bosses that are all unique. - Not pay to win  CONS: -The RNG can sometimes screw you over. Like beating a boss and getting no weapons for your class, or getting weapons with bad modifiers. -Visual clutter, other players can obscure projectiles, leading to some cheap shots. -Instakill traps in a permadeath game, some levels have instakill mechanics, need I say more ? -The community, about 50/50 on this one, some people are really nice and helpful, but some can be as toxic as hell. -Some sounds can feel out of place, like the health pickup noise sounding like instant messaging, as well as massive earrape from lare amounts of players hitting the same enemy.   Overall, I do reccomend you pick up this game, its free, its non intensive on hardware, and its a good time for fans of platformers, roguelikes, or mmos in general.",
            "review_score": "1"
        },
        {
            "review_text": "  The game desperatley needs a party system It seperates people by region needs more customization. Party system needs to be implimented to go into portals only with that party I can't really talk anything bad on this game it just came out of alpha, it's great, young and virtually free only until and if you want to buy more storage units which in my case is worth it. Game is beyond smooth, haven't seen any indication of lag what so ever even in a hub world where an uncountable amount of people unload into a single test dummy and don't drop a single frame. Possibly add upgrades to the guns and equipment, as in attachments and drops that can be put on excisting equipment to further enhance that stuff.  ",
            "review_score": "1"
        },
        {
            "review_text": "  Alright, as cheesy and crappy as this game looks and sounds based on its store page, it is absolutely incredible. It barely has a story but the game itself is enough fun to keep you playing for hours on end. I've always been a big fan of the platformer/metroidvania genre, and if you are, this game is a must have. If you enjoy teaming up with random players in MMORPG games such as Destiny and Tom Clancy's The Division, you'll love the MMO aspect of this game. It adds a whole other level to the genre. I've honestly never found a game I find quite as enjoyable as this one. Even better, it's free.",
            "review_score": "1"
        },
        {
            "review_text": "  Starbreak is a fantastic game, but it is lacking in many areas.   I'll start with a run-down of the good: -Fantastic Music and sound design that draws the player into the atmosphere -A breath of fresh air to the mmo genre and it changes the typical formula in many ways -An amazing art style that complements the game  Now, for the negative.   All of the negative problems stem from one thing: Microtransactions. The perma-death option is fantastic, but because you lose everything on death, that means you'll need to grab your spares from your stash or go back through the game to get new equipment. However, there is a lack of storage space, which can only be purchased through currency that must be purchased with real money. Similarly, since there are different characters(or 'Shells') in the game, you're going to need a LOT of storage to keep items for your previous character, and for your new one. Even if you start using a new shell, I would suggest keeping all the items from your previous one in storage in case you don't like your new shell. All these problems could be fixed with one of two things; either use the in-game currency as a way to purchase storage, or make goals to achieve in order to GAIN the purchasable currency. Also, there's barely any explanation on how to do anything or what everything is or is used for. The tutorial is great for introducing the mechanics, but not for anything else.  StarBreak is an incredible experience, even if it is flawed, but I'm not sure I would pin this ENTIRELY as 'pay-to-win.' More like, this is half pay to win, half traditional, and depending on which side you're on, you may or may not enjoy this game.   I like the idea of this game, and I look forward to seeing how this will be refined.",
            "review_score": "1"
        },
        {
            "review_text": "It's like Realm of the mad god, starbound, and contra had a baby. I love it.  Changing a bit of my review simply because of one reason, literally every single negative review here states that 'When you die, you lose everything! This is a bad choice.' No it's not, this is a roguelike. This is what happens, it's a design choice, if you don't like it it isn't your kind of game and I respect your opinion.  I also saw a few that say the devs are money hungry because you can spend money to buy extra space to store items? Yeah uh, you can literally do that in most MMO's, this isn't anything new. I'm a complete F2P user and I found that I don't really need anymore space than 6 slots, I don't pick up every single item I see, only the ones that I think I will need. For example, I ALWAYS keep an extra rifle for Wildfire (The first shell in the game) inside of the chest, because the starting shotgun is REALLY bad.  The only real flaws people are pointing out are ones that are design choices, they aren't flaws at that point, that just means you should play a different game. There are PLENTY of flaws with this game, which I have yet to see pointed out in the review section. For example, there's a limited social aspect to the game, which is really bad, as the game requires you to work with your team to take down bosses. That's a legit criticism and the devs have acknowledged this.  Sorry for the little rant, just gonna ignore this review now and go back to playing.",
            "review_score": "1"
        },
        {
            "review_text": "very very fun, but frustratingly rage inducing at the same time... im a glutton for punishment because i cant seem to stop playing eve after 1 simple mistake wrecks hours of work on a shell :P..... would love a daily login bonus or weekly/monthly for UC, for a 2nd storage atleast, other than that, i absolutely love the game and recommend everyone to play",
            "review_score": "1"
        },
        {
            "review_text": "After playing a handful of hours, I'd say this game is pretty fun. Although I'd suggest using a controller rather than keyboard. Although I'd recommend this game, it still has a lot to work on. Things such as:  1) Make a friend system. I'm tired of losing my buddies 2) Make the chest a tad bit bigger. 6 slots isn't enough I find, and I don't feel like paying for extra chests ( a 9 slot is plenty and would be fantastic) 3) Make the tutorial a bit more in-depth. Just tell us what are the currencies, is all I'm asking.   So why would I recommend it? Since the game actually requires you to get good if you wanna advance. Permadeath can be harsh if you have good items, but it's part of the game. Loot is also distributed amongst everyone, so no need to rush in and grab the very first item you see. I barely see any Pay-to-win aspect so far, that's always a +1 in my book.  Great game, permadeath rpg. Love it",
            "review_score": "1"
        },
        {
            "review_text": "Very hard but very fun! Can be a little chaotic and hard to see at times.",
            "review_score": "1"
        },
        {
            "review_text": "I'm actually going 10/10 on this one.   After playing for only about 4 hours, I went out and bought a controller for it, that's how much I loved it. As far as a friends list goes, It would be nice, maybe I'd drop to a 9.5/10. But it's just bure bliss! PLUS I have no friends. So back to a 10/10. Now, back into the game! Cya there!",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good 'im-bored-let-me-play-something-for-2 or 3-hour' type of game. Game need some tweaks like friend/social system, other than that, pretty addicting sidescroll game.",
            "review_score": "1"
        },
        {
            "review_text": "I would highly categorize this as an 'hidden gem' on steam.  100% Recommended",
            "review_score": "1"
        },
        {
            "review_text": "  I love this game. I tried it expecting it to be a sub par platformer, but ended up spending HOURS in it. Lots to do and lots to kill.",
            "review_score": "1"
        },
        {
            "review_text": "A unique experience that is easy to learn and hard to master. It's F2P and isn't pay to win. A good time waster for a week or so.",
            "review_score": "1"
        },
        {
            "review_text": "Please take some time to read this review.   STARBREAK:   A great game that has a bunch of awesomeness. --{}Pros{}-- Great graphics. Great servers/no lag. Lots of people play. Bosses look sweet. Game is challengeing, not outrageously hard. --{}Meh's{}-- 2d. --{}Cons{}-- At the time of this review... i dont see much to put here :D",
            "review_score": "1"
        },
        {
            "review_text": "I have way more hours if you count the time i played the browser version. Anyway, my only issue with the game, no matter how good my computer, is that after a while (could be a day or more, even hours or minutes) of playing, the game starts slowing down. then i have to work my way down the graphics settings or in the case of the browser version, Clear my whole browsing data for it to then in another 20 minutes to degrade in performance. In the steam version i can only lower graphics, i have no clue what to do from there on. Google is not my friend here",
            "review_score": "1"
        },
        {
            "review_text": "This game is difficult, and not in the 'oh my god, Dark Souls so hard' way but in an actual NES design era type game design. Every encounter and enemy in the game scales on the number of people who are with you, so if you are alone encounters are not as strong, but if you're in a big group then you basically need each other. It's not an unusual thing, of course, Phantasy Star Online used such a design to make grouping more rewarding but more difficult as well, and there's nothing wrong with that.  When the player dies, they lose everything they have equipped and are carrying, with no way to recover those items. To change character you also need to become a spark, which requires either EC (in-game currency), or to die. It's very easy to die, and you're basically expected to repeat the first dungeon over and over and over and over until you're either sufficiently leveled up to play as the character you actually want to play; or you basically outlevel the current content you're doing.  The game is a grindfest. As you play you will find minibosses, midbosses and bosses as well as enemies. Only midbosses and bosses are GUARANTEED to drop loot, but you'll definitely get plenty of chests along the way. As a diversion, I would say that the game is definitely a pretty good time sink, you'll keep playing, getting better little by little but also dying a lot.  Now for the negative, the in-game currency is tied to every type of purchase in the game, and there's two ways to acquire currency. Either you keep playing through dungeons -OR- you pay real money. Currency is NOT plentiful in dungeons, so I could see a lot of people opting for the microtransaction method of getting money, which I don't personally feel is worth the money but that's your choice not mine.  I'd give it a 7.5 out of 11, it can be a good time sink, but it sure can get old quick too.",
            "review_score": "1"
        },
        {
            "review_text": "i died to everything   good game",
            "review_score": "1"
        },
        {
            "review_text": "StarBreak is a unique skill-based action platformer MMO where you explore strange sci-fi worlds alongside dozens of other players, kill legions of dangerous aliens and fight epic boss battles.  Man, I wish it was dozens of other players. The game is dead and that's the only problem.",
            "review_score": "1"
        }
    ]
}