{
    "app_id": 420850,
    "name": "Cosmic Leap",
    "release_date": "2016-03-17",
    "developer": [
        "Michael Hall"
    ],
    "publisher": [
        "Michael Hall"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action"
    ],
    "achievements": 18,
    "positive_ratings": 82,
    "negative_ratings": 30,
    "price": 0.79,
    "description": "Time your jumps from planet to planet, avoid the obstacles thrown in your path and blast off to safety with your rocketship!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/420850/header.jpg?t=1502922588",
    "minimum_requirements": "OS: Windows Vista or Later Processor: 1.0 GHz with SSE instruction set support Memory: 1 GB RAM Graphics: DX9 (shader model 2.0) compatible DirectX: Version 9.0c Storage: 200 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I am writing this review after 'only' 50 minutes of playtime. 'Only', because this is a very fast game, where levels should be finished in under 10 seconds sometimes. So 50 minutes is a looong time for playing this game and feels like 5 hours or so.  Whether you are looking for a few minutes of distraction or want to try a speedrun after mastering all levels forth and back, this game is well worth its small price.  Pro: - Each level is more or less easy to win, but hard to nearly impossible to master - I like the school grade measuring system for level success. Makes you want to try it 'only one more time' ;-) - the retro-modern, cathode-ray tube, 8-Bit, pseudo-3D graphics - Support! The game creator/programmer was able to help me with a specific technical issue within hours. Double plus LIKE!  Neutral: - the storyline. Not every game must have one. This one fits into the overall game look and feel, but I would not have missed it if it did not have one.  Cons: - when playing for a while, the music may get a bit monotonous. This is my personal experience, which may not be applicable to other players.  [removed]Cons: - possible issues with screen resolution in full screen mode. Unity does not remember the set screen resolution. This is a Unity platform specific flaw on some systems (like mine, unfortunately) for which the programmer cannot be blamed for. Windowed mode works fine, so this is no real issue. [Edit Mar 24th: solved. The game creator reactivated the Unity config screen which allows to set fullscreen in the correct resolution. Again: double plus LIKE!]",
            "review_score": "1"
        },
        {
            "review_text": "nice little game   hard tho",
            "review_score": "1"
        },
        {
            "review_text": "A fun indie game, not that easy to play if you don't react quick enough.",
            "review_score": "1"
        },
        {
            "review_text": "Boring, got it for 8p and want a refund.",
            "review_score": "-1"
        }
    ]
}