{
    "app_id": 420950,
    "name": "Time Tenshi",
    "release_date": "2015-11-20",
    "developer": [
        "Silver Cow Studio"
    ],
    "publisher": [
        "Silver Cow Studio"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 18,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Anime",
        "Nudity",
        "Mature"
    ],
    "achievements": 0,
    "positive_ratings": 70,
    "negative_ratings": 27,
    "price": 6.99,
    "description": "The Time Window...An incredible invention, developed over decades in secret, empowers humans to make their grandest dream a reality...To travel through time!At a hidden research facility, Rose and Kyo - the Time Tenshi (Time Angels) - voyage into the past in secret under the watchful eye of...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/420950/header.jpg?t=1478084759",
    "minimum_requirements": "OS: Windows XP or above Processor: Pentium 4 or above Memory: 1 GB RAM Graphics: 1280x720 DirectX: Version 10 Storage: 250 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Better than I was expecting.  Some art needs some work while other images look great.  I wish the plot was bigger, though.",
            "review_score": "1"
        },
        {
            "review_text": "I would like to first say that I liked this game. While I'm sure that many people scoff at VN's, particularly these kinds, they're also just looking at the cover for the game and making up their opinions from there.   I would not call this the best Visual Novel I've ever experienced. It is very abbreviated, it's plot feels very condensed and there's only two choices in the game near the very end. However, this VN has a lot of heart and charm to it, the characters are likable, understandable and charming, it has a decent amount of humor and is aware of itself.   When one of the characters, Kyo (The girl with the aqua colored hair) goes out to shop with Kenji (The protagonist) she wears what looks like a black lingerie slip, which is what she usually wears, and I thought to myself, don't tell me you're wearing that outside, and Kenji mimics my thoughts and questions how she can wear it outside as well.  It is not just limited to being aware of itself in humor though, it also tries its best to address certain expected aspects of a game like this. While it doesn't do it in a deconstructive way or analyze it too deeply, it does go out of its way to make it so certain cliches are presented as realistically as it can and tries to address certain qualities of other VN's that people groan at. This doesn't mean it doesn't have its fanservice but it's clearly not supposed to just be about the fanservice, I've seen VN's that are, and I can certainly say that the creators of this game were not going for that.  I recommend this game to people that want to support the creators. This is apparently their first game and I can see that they have potential to stretch out and get better at making VN's and that they do want to tell an interesting story while also having some goofy or fanservicy moments along the way. Most Visual Novels don't come over to America from across the sea and so I would be very happy to see more companies make them in my own country. But they need support to get to the point where we can get more complex stories and different genres. So please, if you want to see more VN's, give this one a shot, it doesn't cost much and its a pretty relaxed ride through the game.",
            "review_score": "1"
        },
        {
            "review_text": "Best visual novel that I have played/read yet, can't wait for the second",
            "review_score": "1"
        },
        {
            "review_text": "About as basic as a smutty visual novel gets. The story is fine for the most part, the serious bits are interesting and keep you intrigued, the silly bits are as ridiculous as you would hope, and the sexy bits do their job fine enough. The art looks fine, if a little limited (specifically the characters state all the time how their breasts grow and shrink dramatically to different extents at different times, but since there's only 2 sizes for each character, both huge, it may as well not be in the story), and the music, while basic, usually suits the mood fine enough, although having more variety for the serious moments would do the game well. The game's only MAJOR flaw is a near complete lack of choice. You are only presented with two choices, both very close to the end of the game, and the one doesn't even do anything beyond slightly alter a few lines of dialogue.   In terms of less severe issues, one is that throughout the entire game, you are constantly praised for having the self control not to try anything with the girls despite the circumstances. The problem is that A. many of the times they praise you for self control you really had no opportunity to do anything if you wanted to, B. every situation was either so rapey you would have to be a sociopath to think what you did wasn't the only right choice, or so forceful on you that the only reason someone would decline in the situation is from genuine lack of desire, and C. the player has no choice in the matter anyway, so you aren't excercising self control, you're just reading text. It just ends up feeling like nonsense every time the characters bring it up.  The other issues come in at the very end, so skip to this paragraph if you care about spoilers. The final part of the game revolves around you having the option to prevent the event that caused you to be involved in the game in the first place, creating a time paradox, and what would happen if a paradox is created. Pretty basic time-travel stuff, but the problem is that rather than your interpherance being what prevents the event, you somehow were always the one who started it, and you go back in time to either cause it or not cause it, which means there's a freaking time paradox anyway! How the developers couldn't see that making it so you go back in time with the option to stop it from happening or letting it continue wasn't the more sensible choice baffles me. If you choose to continue with the status quo, you basically get a non-end where it feels like nothing even happens. If you choose to create the paradox, all the pre-concieved notions of how time travel works (which were flimsy at best to begin with) fall to pieces and next to nothing about the ending makes any sense, teasing that a sequel might explain what the hell just happened. Either way, the ending is less than stellar.  Overall, if you've got a thing for breast enlargement, or are looking for a funny softcore hentai to laugh at or take seriously, you can certainly do worse than this game, but it's nothing to write home about. Buy it if it's your thing, youtube it or ignore it if it isn't.",
            "review_score": "1"
        },
        {
            "review_text": "Ok so im like, I fancy buying a game, maybe a cheap game. Then i saw Time Tenshi 2 on discount, and i thought i dont rly buy Japanese games at all. ill give it a try. so i got 1 &amp; 2 and my god theyre good games.  The artwork is rly cool even though i dont watch anime, and i didnt mind there being boobs every 5 seconds. The soundtrack and the story is ♥♥♥♥ing fantastic and i rly enjoyed playing the game. well more like reading.  10/10 would defiantly play again.   Need the official soundtracks.",
            "review_score": "1"
        },
        {
            "review_text": "Less of a game, more of an interactive comic. With that in mind...  Nice enough story, flows well, something you can play when you really don't want to think while sitting at your PC.",
            "review_score": "1"
        },
        {
            "review_text": "This game was poorly written by a fourteen year old who likes bewbs.",
            "review_score": "-1"
        },
        {
            "review_text": "The game was on sale, so i thought why not try out an anime game. After playing the hole story to be able to review it properly, I just realized that i have wasted my time and will never download another Anime game like that.",
            "review_score": "-1"
        },
        {
            "review_text": "Clicked furiously to get past the dialgoue and to see some GAMEPLAY in this GAME.  I was wrong. I'm quite a newby in those type of games, but if 'visual novel' means, you don't do sh** and only read text block after text block, I very much dislike it.  ",
            "review_score": "-1"
        }
    ]
}