{
    "app_id": 421040,
    "name": "Plantera",
    "release_date": "2016-01-28",
    "developer": [
        "VaragtP"
    ],
    "publisher": [
        "VaragtP"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Casual",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Casual",
        "Clicker",
        "Indie"
    ],
    "achievements": 29,
    "positive_ratings": 3709,
    "negative_ratings": 485,
    "price": 2.09,
    "description": "In Plantera you build your own garden and watch it grow with new plants, bushes, trees and animals. As you play and expand your garden you will attract Helpers, round blue creatures that will help you with your harvesting tasks.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/421040/header.jpg?t=1526972226",
    "minimum_requirements": "OS: Windows XP or higher Storage: 50 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "  I've got a key to review this game, yet this hasn't affected my review in any way.    'Another clicker game?!'",
            "review_score": "1"
        },
        {
            "review_text": "Plantera feels, in many ways, like an iOS port--but that's not neccessarily a bad thing. It's a clicker game, for sure, but it goes a bit deeper than that.  Premise: This is your garden (though I suppose farm is more accurate). You put down crops and the only thing you need to do to take care of them is sit and watch. That's it. You can harvest fruit, vegetables, and various things from your livestock, as well as shoo off wild animals, but that's all option. You could 'play' this game by doing nothing more than plopping down plants and animals when you've got the coin for it, because you have Helpers who do everything else for you. Albeit, slowly. It's very simplistic.  Game play: You can do everything I mentioned above with a click of your mouse. There's no need for your keyboard here.  -You level up as your Helpers (or you) gather from your garden and it's denizens. In the typical iOS game style, you can buy little powerups with in-game coin that extend the amount of time your Helpers work when you're logged out and the coin multiplier for your profits.  -You can also buy little, panting canines that bark at garden invaders and scare them off. These pests will disrupt your animals or steal your crops, but are otherwise harmless. The leveliling up allows you to buy new crops and livestock and, since the catalogue is rather limited, once you unlock everything (There's five options for small plants, bushes, trees, and four for animals) levels add stars to what you already own, therefore making them worth more. -You can also expand your land, allowing for more Helpers, plants, and animals. Your little garden can get very cluttered, very quickly. -You can't see your entire garden on-screen at once after you start expanding. You can click-drag to pan or use the arrow keys.  Graphics: I'm a sucker for cute, cartoony graphics, so this is right up my alley.  Performance: The UI is a little wonky when it comes to selecting plants: they are each on three different planes, one behind the other, and sometimes it's hard to choose something on the first plane. After you start expanding your garden and levelling up, there's a TON of stuff on-screen at all times, but I've never experienced any sort of frame rate issue.  Soundtrack: This is my one complaint. It's the same song looped over and over again. It was charming at first, but it begins to wear on you quite quickly.  Longevity: At about 5 hours in, I'm level 55. Not sure what the level cap is. That being said, there was a patch released today that added 8 more in-game achievements and that's a definite thumbs up for me. I'm glad the devs are still adding on to this game because I enjoy it a lot.  Bottom line: Absolutely adorable. It's a relaxing game that you can play for a few minutes or even hours. It's worth the 2.99 original price tag, but getting it on sale would be even sweeter.",
            "review_score": "1"
        },
        {
            "review_text": "So even though this is a clicker game, it's such a breath of fresh air. It's unique and different from the other clicker games out there which is why I enjoy it so much. It also helps that I love farming style games so being able to grow things and have animals is awesome. If you like clicker games I highly recommend this one. :)",
            "review_score": "1"
        },
        {
            "review_text": "Positives: 1. It's fun to do while you are waiting for stuff (timekilling) 2. Looks funny 3. Not to easy achievements , still hope they will add more 4. love the gardening :D   Negative: 1. not finshed yet ... 2. they should make it harder than it already is",
            "review_score": "1"
        },
        {
            "review_text": "This game takes more effort than I expected and this makes me happy. Also it's gosh darn adorable. Best $3 I ever spent.",
            "review_score": "1"
        },
        {
            "review_text": " ~Key provided by developer/publisher. This does not affect my review.~         Plantera&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Plantera is a fun and colorful clicker game that's different and more interactive than say....Clicker Heroes or AdVenture Capitalist. In the beginning you don't get a lot to work with, you can grow carrots and plant some apple trees and blueberry bushes. As you go along you can unlock more fruits &amp; veggies to plant as you level up. There are also specials you can buy like guard dogs to chase away critters, a clock that lets you earn money for a set time while being offline (although it's more profitable to leave the game running) and a multiplier which increases the worth of everything. Later on you can also expand your property so you can plant more things. It's very simple and there's not much to it yet I found it addictive. I hope the dev has plans to add more in the future.  There's no microtransaction system in place which I find surprising for this type of game. For a casual time waster I'd recommend it for the $3 price tag. Even better if ya can get it on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Love love love this game. It's not only super cute and entertaining but the deveoper is really listening to the suggestions on the forum. I really love that! I got nto the game only this week, but after scrolling through the community page it's really nice to see that things people suggested were put in.   Simple clicker game, but there are a lot of things to collect. The game keeps going when you're offline. There's an autosave feature, so there's no need to worry about saving yourself.   The cows are super super cute  10/10 will keep on clicking &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "  I won this game for free.  I was rather excited since I was curious about this game.   It's honestly pretty addicting. Would recommend for people who like clicker games for sure.",
            "review_score": "1"
        },
        {
            "review_text": "I was given a key for this game so I figured I would give it a shot. At first glance I thought it might be another cookie clicker rip-off but when once I started I realized how absolutely wrong I was. This little game grabbed and held my attention for far longer than I expected and I am honestly excited to get to play more later and see how much I made in the half-day I've been away from the game. I would highly recommend this game even as just a nice little time killer in between various things. One of my friends travels a lot and he plays it on his surface in between flights since you can just jump in and out whenever!  I made a lets play video if anyone is curious!         YouTube™ Video:  Plantera Game play | Punching animals in their cute faces!&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "A nice style and idea for a clicker. Bit Short and it gets a bit crowded on Screen. Would work better as a mobile game.",
            "review_score": "1"
        },
        {
            "review_text": "HOARDERS: Farm Edition",
            "review_score": "1"
        },
        {
            "review_text": "I got this game via KeyMailer, and I LOVE IT!!! It's so cute! (Apart from the pig :P) It's also really fun and addictive, but kinda stressful. My video on it will go up soon, and I reccomend it!",
            "review_score": "1"
        },
        {
            "review_text": "Force small blue creatures into slave-labor and laugh maniaccley as they grumpily do your bidding, now that if they try to rest for even an hour you will be back to 'motivate' them to continue working.",
            "review_score": "1"
        },
        {
            "review_text": "This game is basically like farmvile, any farming game of course, this is ADDICTIVELY fun and I'd recommend you to try it! The price is resonable as some of the aspects aren't in most farming games, you have to take care of pesky birds, foxes and more!",
            "review_score": "1"
        },
        {
            "review_text": "Plantera is a little, but fun semiactive/idle game.  Your job is simple. Build a garden and expand it. You have little creatures that will collect your fruits and vegetables for you. As bigger your garden gets, the more of them you will get. You have a variety of different Vegetables, bushes and trees.  Also you can buy pets like chickens, cows and more that will also give you resources. You can also build Scarecrows and buy dogs that will help you to defend your garden against birds and critters that want to steal your fruits.  There is a Level system. Which has different benefits. From time to time you’ll get more of the “collecting creatures” or your plants will be promoted, so you get more gold from them.  What I really liked about the game is that your garden already got very lively after only 15-20 minutes into the game.  If you’re looking for a little “idle” game. I can absolutely recommend Plantera to you! For the cheap price you can make nothing wrong.  ",
            "review_score": "1"
        },
        {
            "review_text": "well the game is no't so bad :)",
            "review_score": "1"
        },
        {
            "review_text": "Cute clicker-esque farm game. Very simple and cheerful. Thumbs up for making me smile.",
            "review_score": "1"
        },
        {
            "review_text": "This game is so freakin cute and so freakin cheap! I found it extremely playable and it made me smile sooooo much :)  Here's my first gameplay experience of it:         YouTube™ Video:  Plantera gameplay #1 - OMG so cute!!&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "10 reason's you may enjoy this game :)  #1: You can hear chickens fart. #2: Blue man group works for you! #3: Who doesn't like apples? #4: Can smack cute animals with you're mouse. #5: 10,000 of 100,000 clicks, still more to click. #6: Pig's find you treasure! #7: Whack a mole. #8: Chickens can lay golden egg's? #9: You can capture butterflies and work on mothman v2.0 #10: Everything just looks so darn cute! (Umbrella Korp has nothing to do with this!)",
            "review_score": "1"
        },
        {
            "review_text": "I Give It 10/10 nice game",
            "review_score": "1"
        },
        {
            "review_text": "I'm new to this genre, but I have to say this is probably one of the most calming games I have ever gotten my hands on. It's definitely not a game I would have expected to enjoy as much as I did. If you're looking for something that you can sit and play and be happy about, this is a REALLY good choice. If you want the full two (s)cents, you can watch the video:         YouTube™ Video:  Plantera - My Two (S)cents&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Great and cute game. Not short at all, you could spend hours if you want, expecially getting all the achievments if you're a achievmeent hunter.            Lookin at you Level 100.",
            "review_score": "1"
        },
        {
            "review_text": "In my first fifteen minutes of the game, I have seen: - My amazing first step to farming. - Worker who pulls out the carrot, flings it on the floor and walks away. - Major avian invasion. - Chickens that makes a squirt sound as they leave their eggs everywhere without care. - Rabbits hopping around waiting at the carrot fields waiting to harvest  my  carrots. - Foxes that don't sneak up to steal their winnings. - And every bit the cuteness those screenshots promised on store page.  Here, you have your farm, you cultivate crops and bushes and trees and you make willing slaves farm for you. Let animals poop everywhere, and fruits falling in every acre that workers can't always be bothered to walk a short distance over to pick it up for you. Then comes the amazing stack of eggs no one cares about that is as tall as your bushes have always instantly grown. But let's leave the voluntary slaves alone. They aren't paid after all.  It's really a casual clicking game. Not your usual clicker heroes and the similar, since it's not really about battling the hordes of monsters. If you want a clicker game with few bits of strategy, you're probably looking in the wrong place. For the price of this game, it comes with all in-game stuff unlockable and no micro-transactions. But this isn't a game that will keep bringing you back for months. It would probably be short, and quick to complete. I can't say that for sure, since I'm less than half an hour in. Plantera is definitely an option if you're looking for an easy achievement hunt, or for all the adorable graphics here, and perhaps just something relaxing to look at as you unwind your busy day with a casual clicker. It could be anyone's cup of tea, or never.  P.S. I couldn't resist the cuteness.",
            "review_score": "1"
        },
        {
            "review_text": "borks on rabbits: 8/10 borks on foxes: 9/10 borks on wolfs: 10/10  totally recommend this game",
            "review_score": "1"
        },
        {
            "review_text": "Chickens make a fart noise when laying eggs. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Don't look at my hours cus that doesn't matter because i am a beta tester. First off this game is a game to burn time or to just have some fun when you don't got nothing to do. This game has a epic soundtrack. i really love it The gameplay is AWESOME you can be a watcher of your garden which is amazing or be a gatherer and ignore the animals that want to eat your food.  There are 4 animals that want to steal your food.  It's a Rabit A Crow A Fox And a Black Fox (the hardest one) the fox and black fox make your animals (chicken,pigs,cows and sheep) run away from your garden (well not run away from your garden it's more to escape the hungry hunters.) the crow will whatever fruit he desires. i mostly let him steal cus i don't care.  The rabit is always hungry to eat food. same thing has the crow. i would give this game a 10/10 P.S: the workers can do all the job for you and you can be afk while they are collecting your garden.",
            "review_score": "1"
        },
        {
            "review_text": "Hi Im Skill Incarnate and this is a Review of the Indie Game Plantera.  Its a cow clicker style game which is fun, easy to pick up and perfect for kids. Please Note: Game was provided free of charge by the Developer   ========================================­======== Review         YouTube™ Video:  Plantera - Steam Indie Games Review&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "A great time Waster Clicker! Fun and can be played for hours. Great for mobile. Don't look for it to be more than what it is. Definitely worth the cost which is very low.  CHECK OUT MY REVIEW:         YouTube™ Video:  Plantera - Indie Game Spotlight - Ep. 9 - Clicker Farming Cute Casual Simulator - First Look&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "  For 3$ this is an okay Clicker! It could use some more unlocks because after an hour I had already unlocked almost everything. Music is good and the are is very cutsy!           YouTube™ Video:  [Plantera] [1080p][60fps] Armic Analyzes - Clicking for ages!&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "pigs can poop gold AWESOME",
            "review_score": "1"
        },
        {
            "review_text": "Plantera is a cute game where you threat the nature for the purpose of making money, and where you have some blue slaves who work for you.   10/10.",
            "review_score": "1"
        },
        {
            "review_text": "great soundtrack really fun and the best farming simulator ive ever played",
            "review_score": "1"
        },
        {
            "review_text": "  Got this game for free from the Developer very Addicting and fun but it needs to be on Android too it would do better on that market.",
            "review_score": "1"
        },
        {
            "review_text": "THis is a strangly addictive game and i enjoyed it else i would not have played so much",
            "review_score": "1"
        },
        {
            "review_text": "Fun, easy, and the soundtrack is great. just a lazy game to laze the day away.",
            "review_score": "1"
        },
        {
            "review_text": "Bored, tired, sick or feeling Blahhh? No concentration for big games or anythng that takes deep thought?...this can fill your time, without the seeming pointlessness of clicker heroes and stuff like that. certainly worth the small price to add to your low key casual stand by games. Hopefully they'll continue to add more assets. Good little deal. Only downside is i've not seen the key offered anywhere else so I had to buy it from the Steam Store...but hey, it was only 2$ so not like I gawe them any real money..lol Since their scam app crap they recieve no support from me. Save of course these very few little indy games that aren't offered anywhere else.",
            "review_score": "1"
        },
        {
            "review_text": "Great little clicker game",
            "review_score": "1"
        },
        {
            "review_text": "  Was given a copy of #plantera to test out :)  Streamed it live for people as a pre show. It is a relaxing idle/clicker for the most part.  Good news is, there are no micro transactions, buy it, play it to chill and relax to,  Definitly priced right at $3 CND",
            "review_score": "1"
        },
        {
            "review_text": "Really fun cute game.",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME IS GREAT! The leveling system is awesome! the music is great. having no issues (that i have expirenced) is great! i totally recommend this!",
            "review_score": "1"
        },
        {
            "review_text": "i like this game its cool",
            "review_score": "1"
        },
        {
            "review_text": "Possibly the best clicker game out there. The premise of clicker games are simple enough but Plantera mixes the simplicity of clicker games with a bit of strategy. As there is limited amounts of things to keep track of that all get out of hand quite eaisly as there is a limit on how much you can build until you expand and when to expand. Sure expanding gives you more gold but takes you a lot longer to fill your land up with the high tier money makers. Tier 1-2 money makers may overlap but the gap between Tier 1-5 is so huge that you sometimes want to save. My advice is always max out on land and slowely remove the low income tiers. Really fun",
            "review_score": "1"
        },
        {
            "review_text": "I started this game when I was very young... I'm quite old now. I guess... I guess if you were to ask me whether or not I like this game... yes. Yes I like this game very much.  I can't remember a time without this game. It has been so many years...  Yeah you can cheat pretty easily on this game, just set your clock back a month and re-open the game. Instant 100M coins. Great game if you hate yourself and have a weak index finger.",
            "review_score": "1"
        },
        {
            "review_text": "And that Child Services guy told me I wasn't responsible enough to take care of living beings!",
            "review_score": "1"
        },
        {
            "review_text": "BEST GAME EVER 12/10 loved it",
            "review_score": "1"
        },
        {
            "review_text": "A little addictive clicker that sucks you in with money. Make as much as possible on your farm, expand it and slap away those nasty critters.  There is no depth to the game, but then again it is a clicker :P If it's you're cup of tea enjoy, if you want more than left clicking keep well away.  Gameplay video          YouTube™ Video:  Plantera - Click that Piggy&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "'This is a serious addicting game, it's like cocaine!'",
            "review_score": "1"
        },
        {
            "review_text": "Cheap and fun. It also has foxes.",
            "review_score": "1"
        },
        {
            "review_text": "Do you like clicker games ? - No? don't buy it then. It is a clicker game and nothing wild is gonna happen. - Yes ? Then this is game Might be something you like.   Simple and relaxing, theme track is okay. This is a game to pass time, not really for anything big. When on sale I find the price more fitting for what you get.",
            "review_score": "1"
        },
        {
            "review_text": "This game is one of the best clickers I have ever played. It is well designed, has no bugs, updated regularly, and most importantly....   VERY CUTE! I recommend this game ten-fold!",
            "review_score": "1"
        },
        {
            "review_text": "Fun little game for a few minutes of fun. Don't expect too much, but it'll kill a few minutes. Not much to do after you've built up your eggplant, cabbage, and lemon farm.",
            "review_score": "1"
        },
        {
            "review_text": "This is a cute little idle game. There's not an awful lot to engage with, and the gameplay doesn't seem to progress, but I thought it was good for the £2 I paid for it (cute animals will always help in that regard!).",
            "review_score": "1"
        },
        {
            "review_text": "a really fun little pass time",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would spam left click again",
            "review_score": "1"
        },
        {
            "review_text": "Its a fun little game. Below is some gameplay footage          YouTube™ Video:  IPfreely - 'Gameplay' | Plantera&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "So this game is a lot of fun for a short amount of time but still such a good game. But is sort but is okay because its only $3 so it's really worth it. 10/10 would buy it again",
            "review_score": "1"
        },
        {
            "review_text": "This game is great. The game is a great way to spend some time on. The camera is great at controls. Every click feels responsive. Its all-around a great game to play. The game is a calm game. It works really well with the amazing music it holds. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "the game is okay...but there isnt much to do near the end.",
            "review_score": "1"
        },
        {
            "review_text": "  This is a barebones review of this game I got for frew from Keymailer. At the time of this review I have 30 Minutes play time, But I do actually enjoy this game. For only $2.99 it's a nice little game. It's very similar to cookie clicker in the sense that you start with nothing but a little carrot patch and grow to a huge garden. It's a clicker game, so prepare to have your fingers ache. It reminds me of Farmville but you can just leave it open and it'll play itself basically. The sprites are very cute and it has a nice sountrack along with retro graphics that aren't at all hardware demanding.",
            "review_score": "1"
        },
        {
            "review_text": "If you ever found yourself thinking 'I wish there was another game like Insaniquarium - but with a gardening/farming theme!' then this is the game for you.  Belonging in the category Compulsive Clicker, this game boasts hours of intense clicking and achievement hunting.  10/10 will click more.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty Good, got very few hours of it before I unlocked everything... kinda easy to beat, but it was fun while it lasted. Get it and try it, maybe you want to make a HUGE farm or whatever, but don't expect a lot of content :p",
            "review_score": "1"
        },
        {
            "review_text": "This game has taken me away from my family.  11/10",
            "review_score": "1"
        },
        {
            "review_text": "Great for casual gamers who need someting cute and relaxing to focus on at the end of the day.",
            "review_score": "1"
        },
        {
            "review_text": "If Cookie Clicker and a farming sim had a baby and maybe wanted to give it a similar-sounding name to a metal band, then this would be it. Like a lot of other reviews have said Plantera's got nice graphics, cute animals, and good music albeit a bit lacking in long-term gameplay. For some it might be better to get as a way to get a younger relative off your back for a little while if they want to hog your smartphone for some silly/pointless game of theirs.  Beyond that, the only other gripes I have are more of a minor nuisance than anything. Half the time I don't know the bunnies are there since they're not always the easiest to see and my dogs are everywhere else. (Ninja bunnies!) Also most of my animals seem to like bunching up around the same 5-7 trees in the middle of my much-wider garden; I get livestock like herding and want to keep as far away from the foxes and wolves as possible but after a while it starts looking like the animal version of the preview screenshots with the piled-up fruits.",
            "review_score": "1"
        },
        {
            "review_text": "Very cute and well worth the price. For a clicker, it didn't take me long to reach the top level. Even though it was a bit short I still recommend it. The music is a little repetitive, but for somewhat mindless games like clickers it wasn't so bad. :)",
            "review_score": "1"
        },
        {
            "review_text": "This is an idling game, don't expect to do much aside from scaring bunnies, crows, foxes and wolves away from your farm, and harvesting crops. Oh, and getting more money from a guy in armour charging through your farm. (There's lots of clicking involved if you didn't know). I would recommend this to younger or casual gamers who just want to relax and not think too hard. There's honestly not much to do except work your way to getting all the achievements. It's a simple and pleasing game with very cute art and music.",
            "review_score": "1"
        },
        {
            "review_text": "So far so good, been having fun with it since I bought it because of Jewbagel's video (-‿‿-).  Keep up the good work ヽ(￣ω￣(。。 )ゝ",
            "review_score": "1"
        },
        {
            "review_text": "It was fun while it lasted, love the idea would love more.",
            "review_score": "1"
        },
        {
            "review_text": "Visually very appealing. The progression is very linear and not deep at all but it's very pleasant! If you want to play an idle game you might get to the end of, this can be the one!",
            "review_score": "1"
        },
        {
            "review_text": "great game   the bad thing is i never know how many butterfly i already capture.  bad thingk, you just go up by 1 level doing offline",
            "review_score": "1"
        },
        {
            "review_text": "For its cost this game is a brilliant time waster.  When I first baught it and opened it up I was dissapointed by how simplistic it looked and the limited dynamics that the game actually has. That said I can't say anything bad of a game I've racked up this many hours on.   In summary, if you're ok with someything that takes minimal input and playes more like a desktop pet that just needs checking in on every so often, you've found it.",
            "review_score": "1"
        },
        {
            "review_text": "It's a fun Idling game. That's all I gotta say.",
            "review_score": "1"
        },
        {
            "review_text": "What are you?",
            "review_score": "1"
        },
        {
            "review_text": "If Cookie Clicker and a farming sim had a baby and maybe wanted to give it a similar-sounding name to a metal band, then this would be it. Like a lot of other reviews have said Plantera's got nice graphics, cute animals, and good music albeit a bit lacking in long-term gameplay. For some it might be better to get as a way to get a younger relative off your back for a little while if they want to hog your smartphone for some silly/pointless game of theirs.  Beyond that, the only other gripes I have are more of a minor nuisance than anything. Half the time I don't know the bunnies are there since they're not always the easiest to see and my dogs are everywhere else. (Ninja bunnies!) Also most of my animals seem to like bunching up around the same 5-7 trees in the middle of my much-wider garden; I get livestock like herding and want to keep as far away from the foxes and wolves as possible but after a while it starts looking like the animal version of the preview screenshots with the piled-up fruits.",
            "review_score": "1"
        },
        {
            "review_text": "Guide to Plantera   -Things you need- &gt;Plantera &gt;Being able to leave your computer on for a ton of time  1. Plant stuff 2. Click every thing (except the helper people dude things) 3. Have enough to buy the bear-dog and scarecrow 4. Comeback in 24hrs and expand land, buy plants and etc. 5. Back to step 3  Rating: 6.8/10 'why cant I do anything with the water'*  *Only get if you are bored and want an afk/farming game thats decent",
            "review_score": "1"
        },
        {
            "review_text": "Received A Key From KeyMailer Gotta Say The Game IS Great. Not Gonna Right In Depth Review But Gonna Say SImple Yet Addictive and probbably gonna play it a lot more. Its Very Easy To Play it. ",
            "review_score": "1"
        },
        {
            "review_text": "A cute and addictive little clicker game! Not much else to say about it other than that! Definteally worth your small amount of money!",
            "review_score": "1"
        },
        {
            "review_text": "Plantera is a cute game but so far it has little concept. I enjoy playing it for awhile but I eventually loose interest. Even though this game has low concept I still think the price for it is right and it is still an ok game.",
            "review_score": "1"
        },
        {
            "review_text": "Simple little clicker/idle game with cuetsy graphics. Plantera doesn't have a lot of content to offer and is best consumed by casual players. A plus, for some, is easily completable achievements.",
            "review_score": "1"
        },
        {
            "review_text": "Honestly speaking, I only got this game for the easy achievement hunting.  If you want easy achievements go ahead, it's pretty much Farmville but you paid for it and you don't need to visit Edward's ♥♥♥♥ing farm for extra points, yeah Edward you know who you ♥♥♥♥ing are sending me invites for Farmville.",
            "review_score": "1"
        },
        {
            "review_text": "I recomend this game. Chill and funny...  + power ups  + chill game + low price - small play time - just 15-60 fps* - small cursor (sometimes I dont see cursor) - few achievments  * I can play GTA V on ultra graphic 30-60 fps  9/10",
            "review_score": "1"
        },
        {
            "review_text": "Take the best of Stardew Valley, and Cookie Clicker and you have Plantera, where no words exist. Its a clicker game.  Its also adorable but even now I couldn't see myself coming back easily.  Its fun and good for what it is. Make the sheep a plushie and let me buy it. Thanks. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "My 5 year old loves this game. He's not quite old enough to do minecraft on his own or play Stardew Valley without my help, but Plantera is easy for him to fully play. I was quickly bored within 5 minutes of playing though, but it was cheap to purchase. Once you unlock all the plants and animals there isn't much motivation to keep going but he's at level 160 and doesn't care. Guess we'll find out how high the level cap is!",
            "review_score": "1"
        },
        {
            "review_text": "Good, Art &amp; Music kinda cute.",
            "review_score": "1"
        },
        {
            "review_text": "This is 'Click On Vegetables, The Game'. I don't think it's worth buying for its normal price, but if it's on sale i'd say that it's worth picking up, if not but for the cute cows and weird noises the blue guys make.",
            "review_score": "1"
        },
        {
            "review_text": "  This game is awesome so funny when you dont have nothing 2 do! :D",
            "review_score": "1"
        },
        {
            "review_text": "Cool! A cute little clicker farm game. I reccomend it!",
            "review_score": "1"
        },
        {
            "review_text": "Do you like clicker games ? - No? don't buy it then. It is a clicker game and nothing wild is gonna happen. - Yes ? Then this is game Might be something you like.   Simple and relaxing, theme track is okay. This is a game to pass time, not really for anything big. When on sale I find the price more fitting for what you get.",
            "review_score": "1"
        },
        {
            "review_text": "  It's a really cute game but there isn't anything else after you complete the 5 plants per plant type. I wish they added more content but for the price it's ok already :D. It's something to watch when you're bored.",
            "review_score": "1"
        },
        {
            "review_text": "  I must admit, for such a simple premise it does help the time pass in a pleasant manner when all sorts of unpleasant things are going on. It helps to brighten otherwise dark days.",
            "review_score": "1"
        },
        {
            "review_text": "  *click click click* cards cards cards game received from bundle leftover giveaway",
            "review_score": "1"
        },
        {
            "review_text": "Very cute, addictive game from the beginning. Been playing for 3.5hrs straight.  Could use some music variety.",
            "review_score": "1"
        },
        {
            "review_text": "Very casual and extremely cute game",
            "review_score": "1"
        },
        {
            "review_text": "super great farming game. must get if you are into clicker type games",
            "review_score": "1"
        },
        {
            "review_text": "It is day 347, and we are besieged on all sides. The rabbuts keep coming, savage uncontrollable creatures. We tried guard dogs, we tried thumping them on the head like lil bunny foofoo, but it is to no avail. Yesterday I watched one pull 3 carrots out of the ground before one of the dogs scared it away. These are truly dark times, that a longears can run so freely among us.",
            "review_score": "1"
        },
        {
            "review_text": "Plantera its a cute clicker game where you need to build your garden and have a lot of money so you can buy different plants.There are animals which are trying to steal your food so you'll need to scare them away, everytime when you level up you'll get an upgrade for a plant.This game its awesome so check it our + its very cheap. 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is really cute and when I get off of it I like when the little guys still get fruits and vegetables, but you have to pay for it to become longer pick up time (in game money). It's a nice game if you want to feel like a farmer",
            "review_score": "1"
        },
        {
            "review_text": "The game is amazing itself, but it needs more content",
            "review_score": "1"
        },
        {
            "review_text": "This is a cute idle/clicker game where you build a garden/farm. It's fairly soothing and would've been a cool screen saver back in the day when those were more widely used because it's so chill.",
            "review_score": "1"
        },
        {
            "review_text": "I really wish I could give this one a neutral rating or something, because it's certainly not a bad game, it's just not exactly good, either.  I generally enjoy cute clicker games and this one comes with legitimately lovely graphics and music. The production value is very decent for a game of its price, and I had my time of clicking and looking and just generally enjoying the adorable atmosphere.  The real issue is that even for a clicker game, you just don't get anything out of it. There is no sense of progression and no rewards for longterm play. I like seeing numbers go up, but even for a skinner box it feels barebones. No additional mechanics are introduced and no new exploration can happen. Once you've seen the basics, you've seen it all, because there is nothing really beyond basics. And for a non free to play game, that just feels too shallow.  I think the developer is worthy of support and clearly knows how to make a cute, pleasing game, but it just ultimately fails at really being much of a game. Unless this gets some substantial expansion to the gameplay, I can't really recommend it as a purchase. Keep an eye on the developer, but definitely be critical with your purchase. With this game, you're not getting a whole lot even for the low price of admission.",
            "review_score": "-1"
        },
        {
            "review_text": "Plantera is a relaxing game where you place plants, bushes, trees, and animals on a 2D plane to raise money to repeat that process. Game can get repetitive and is relatively short (6-8 hours for 100% of achievements). It's fun for a while, but doesn't offer much variety or longevity.",
            "review_score": "-1"
        },
        {
            "review_text": "I've played a few clicker/idle type games, and this one unfortunately is lacking quite a bit. As other reviews have noted, the game is not free, whereas the majority of my experience has been with free games.  That being said, there are a few I'm actively playing, with elements that keep me interested. Namely, Clicker Heroes and AdVenture Capitalist. Both have events which keep up the variety, and both have long term, difficult to reach (without a lot of play time) goals. This keeps me engaged and coming back for more.  On the other hand, Plantera has very low replayability. The review panel here is telling me I've clocked just under 50 hours. That is 100% actual game time, as I did not leave the game closed for any extended period. Sure, you can do that, and get your earnings when you come back, but there are achievements that can only be obtained while having an active window open. -- And that's part of the problem. With my ~50 hours of play time, I picked up every single achievement. That might be good if you are a completionist, but it was far too easy. There were no goals that I could see taking more than a month to complete (versus the previously mentioned titles, which have achievements that take a very long time to get to), and because of that, there's not much you're going to get for your money here.  Also, in the 'late game' (which is really no different than earlier stages), the building upgrades are all passive, based on your level. So on top of the fact that the game doesn't change much over time, thus making it boring, there is nearly zero strategy to employ with regard to upgrade paths. There are some strategic elements, like how many dogs/scarecrows to use, but I found these had very minimal impact, especially if you were actively clicking all the time.  Now, that's not to say the game is all that bad. The animations are nice/cute, the expandable garden is a nice twist on the genre, and this game rewards active participation more than others. However, for the lack of content/total active play time provided, I would much rather have kept my money, considering the free alternatives available.",
            "review_score": "-1"
        },
        {
            "review_text": "Overall: You get $2 worth of entertainment, at best, and no more. Zero depth.   Pros: Cute graphics, okay music and good/fun progression for the first hour. The minions collect at a decent speed, so clicking around on things is more for your own amusement/impatience, not a grindy necessity.  Cons: After that hour? That's it, nothing new, seriously. I purchased some 'collect while I'm offline' upgrades, went to bed, and when I woke up I had 100x the cash but absolutely nothing to do. The exact same arrangement I set up in the first hour was still 'best' - basically just a even blend of the top 2-3 plants in each category is all you'll ever want/use anyway.",
            "review_score": "-1"
        },
        {
            "review_text": "Cute graphics and fun early gameplay but it is lacking content even for a clicker.",
            "review_score": "-1"
        },
        {
            "review_text": "Mobile Port, I did a review of it with the key they sent me, you can see that here:         YouTube™ Video:  Brutally Honest Fiaura Reviews: Plantera&nbsp;",
            "review_score": "-1"
        },
        {
            "review_text": "Tl;dr Version Closing Statement:  'This game got boring, fast. The limitations on the game set by the dev (or incompetent game design) are just rediculous for an auto game. And therefore I simply can not recommend it.'   The long, everyone is gonna disagree version.   It's a fun, charming, super cheap game and for that it's probably worth the money. And the music is nice. Shame the soundtrack (like 1 song as far as I can tell from playing the game) is $5, and it has more content than the actual game.  But at the end of the day, it's even less of a clicker game, than clicker games.  Examples:  Your idle money caps out when the computer is off- you have an actual max money count, and going over that means you stop gaining anything.  The amount of content is extremely low.  There's almost no need to click outside of speeding up the early game. The rest is just letting it run on your computer in the background. Don't minimize it because it pauses the game. The game runs at half speed when not the active window.  The upgrades are basically pointless. Some to allow you to gain more money when the game is closed (except if you hit the cap none of it matters, and the cap is 100mil offline-money, and upgrades max out at 99mil a click, so you see the issue). There's a multiplier to get more money from each thing globally (click or not) but again, your max money cap is still a thing when the game is closed, AND there's still an in-game cap, so all this does it help you reach it marginally faster. 2x faster exactly. Which, isn't really noticable until you have 200x the money, 250, 300 etc. But it's still not SUPER fast by any means.   This game got boring, fast. The limitations on the game set by the dev (or incompetent game design) are just rediculous for an auto game. And therefore I simply can not recommend it.",
            "review_score": "-1"
        },
        {
            "review_text": "Yes, this is possibly the cutest game I've ever played and I am more than happy for the achievements, but I didn't really find any joy in completing this game. There wasn't very much to it and it played like a mobile app. Plus, the achievements took far longer than I expected to accomplish. It felt more like a chore, but I guess the odd cuteness of the characters gave me the motivation to continue. Overall, I'd say I definitely wouldn't recommend it to any of my more hardcore gaming acquaintances, but maybe my parents would like it?",
            "review_score": "-1"
        },
        {
            "review_text": "Gets boring a bit fast",
            "review_score": "-1"
        },
        {
            "review_text": "It's a cliker game, Glad I bought it on sale.",
            "review_score": "-1"
        },
        {
            "review_text": "Cute design, very easy, you don't have to sit hours and hours on this game like in other farming games. But when you get all achievements it gets boring...",
            "review_score": "-1"
        },
        {
            "review_text": "a very fun game overall. however, i dont believe it is as good as most users say, so i want to bring the percentage to what it should be. i got this game on humble bundle and would never buy this game if it wasnt, but that may just be because i dont like these kinds of games.",
            "review_score": "-1"
        },
        {
            "review_text": "  Plantera, a game that is a lot like 'Cookie Clicker' in the sense that it is more of an AFK game than anything. I got the game for free through keymailer without even requesting a key and honestly thought it was new but once I got home and researched it, I saw it already had a very positive review status and a couple thousand reviews.  Anyways, I played it and there are quite a few issues I have with it.  - The art style is great overall but whenever I go fullscreen on my 1920x1080 monitor it looks upscaled and messy - The price tag, as someone who doesn't really care too much for this type of game I would only pay at most $2 for it. I'm certain though that someone who is more into casual games and being able to quit whenever they want can justify the $3 they're asking - Very lacking settings menu, looks like it should be a phone game. - Repetitive gameplay. As many games like this are, they get extremely boring for me very quickly. I feel like if this was a free game on iPhone or Android it could be a more enjoyable game, even if ads were placed on it to bring in money for the developers.  I would only recommend this game to people that really enjoy casual games or phone games. I'm not into this genre personally and don't really know anyone who is but I'm sure someone out there could enjoy this. What I would recommend though is getting this game onto the app store and placing ads on it, as I feel it would bring in a decent amount of money for a phone game.",
            "review_score": "-1"
        },
        {
            "review_text": "This game looks fun at first but has no progression beyond the first 30 minutes of gameplay. As a clicker, within hours of beginning, it doesn't seem to matter what plants you place or where you do so. Thinking, planning, strategy, even clicking doesn't matter after the game runs for a little while.  Even my children became bored after about half an hour. I let the game run for a while to get the completion of all the achievements.  Totally worth it if you want a quick game completion on your record.",
            "review_score": "-1"
        },
        {
            "review_text": "  SO I gave this game a play and had a few things to say, it was a lot so i put it into one of my review video chats. in short, it has a nice start to a game, but no real meat to keep the player playing for more then maybe a couple hours.           YouTube™ Video:  &nbsp;",
            "review_score": "-1"
        },
        {
            "review_text": "It is just too shallow in its current state for me to recommend spending money on. Yes, I know the game only costs two dollars. That is the cost scale I am grading it on. Building a house, a little spreadsheet telling you how much of each item you have sold, animals you have scared, etc. would add loads more to game content. That is the level of shallow I am talking here. You can find better for free online is essentially what my argument is getting summed up as. Looking forward to seeing some updates. Currently I am just pushing for acheivements because I spent money on it, there's really nothing else to hold me. Update: I would say that I have cleared the game in the state that it is in at the time of this posting. Some things to note from the other side. Your profits will always be capped at 100million per collection, improving your money flow only changes how long it takes to reach that cap. All the acheivements are acheivable much sooner than that end game if you care about the achievements. The achievements for having a total of 100 plants, bushes, etc. is simply to have bought and sold an item at some point. You are capped to 77 bushes, 77 plants, and similar going on. You cannot have 100 cows roaming around.   I have said it before and I will say it again, this game does not deserve your money.",
            "review_score": "-1"
        },
        {
            "review_text": "Plantera is a point and click type of game, no keyboard needed. At times it is difficult to navigate, but a nice little game to play. It goes with you having to plant trees, bushes and plants, as well as animals to get gold. Using the gold to buy more as well as upgrades and expantions to you little 2D farm. Once the fruit is ripe, they drop form the trees and bushes and you click on them to harvest. The plants you have to pull out the ground and then harvest. Animals drop items to pick up as well. You do have the assistance of the little blue workers to help in the matter. You aquire more and more as you level up, as well as with expansions. Your workers farm for you when you are offline if you have bought the upgrades to make them work harder. There are little creatures that hinder your income. Rabbits steal plants, birds steal from bushes and trees, foxes chase chickens, and wolves chase sheep. Every now and then you will find a ladybug that gives good amounts of gold. To counters the critters you can buy dogs and scarecrows. There are also moles and butterflies to give additional gold. Every now and again, a 'hero' will come charging through, on which you rapidly click to get gold per click. The challenge is to scroll and click all with the mouse. Fun game to play, but the later achievements and game play are grindy and dont change much from once everything is unlock in the early level. Not a game I would repeatedly play. It was lots of fun to play, but lose interest quite quickly.",
            "review_score": "-1"
        }
    ]
}