{
    "app_id": 421140,
    "name": "Blades of the Righteous",
    "release_date": "2016-03-07",
    "developer": [
        "Vladimir Slav",
        "Coldwild Games"
    ],
    "publisher": [
        "Vladimir Slav",
        "Coldwild Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Casual",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Casual",
        "Strategy",
        "Indie"
    ],
    "achievements": 20,
    "positive_ratings": 11,
    "negative_ratings": 6,
    "price": 1.99,
    "description": "Defend your kingdom against the dark forces! Micromanage your army, train soldiers and defeat the enemy in turn-based battles.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/421140/header.jpg?t=1469968093",
    "minimum_requirements": "Минимальные: ОС: Windows 7 or later versions Процессор: 1 Ghz or faster processor Оперативная память: 512 MB ОЗУ Видеокарта: video card that supports OpenGL 3.3+ Сеть: Широкополосное подключение к интернету Место на диске: 200 MB Дополнительно: The only supported resolution is 1024x768",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I had the honor of being one of the testers for this game. Not because I'm any good at testing stuff, but because I genuinely enjoyed playing it.  Blades of the Righteous is a turn-based strategy with two main aspects - managing your fantasy kingdom and fighting battles with the vile spawns. As the wise ruler that you are you get to recruit an army, choose individual skills and equipment for each unit and participate in random events that occur on the map - gather resources, deal with merchants, necromancers and other wanderers. And then there are battles - these can get rather challenging as the game progresses and will require careful tactical approach and planning.  The main campaign of the game can be completed in 3-5 hours depending on the chosen difficulty level and your skill. One way to prolong the experience is to delve into side-missions - these are pretty straightforward and there is a repetitive element to them, but as the events of the game and spawning enemies are random, each mission plays out differently.  For me personally the game has a fair amount of replayability - after completing it twice I am still eager to start a new playthrough, try various team setups, develop units in a different way and maybe finally beat it on the hardest difficulty.  The video and audio of the game are simple, but pleasant to eyes and ears. The battle theme is quite cool, and the graphical models for units are awesome. My favorite are the peasants - they just look so well animated.  To sum it up - I have no hesitation recommending this game, especially if you enjoy games like Heroes of Might and Magic or X-Com and are down to play something similar, if a bit more simple in design.",
            "review_score": "1"
        }
    ]
}