{
    "app_id": 421120,
    "name": "Samorost 3",
    "release_date": "2016-03-24",
    "developer": [
        "Amanita Design"
    ],
    "publisher": [
        "Amanita Design"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Puzzle",
        "Point & Click"
    ],
    "achievements": 30,
    "positive_ratings": 1888,
    "negative_ratings": 98,
    "price": 16.99,
    "description": "Samorost 3 is an exploration adventure and puzzle game from the award-winning creators of Machinarium and Botanicula. Travel across space to nine unique worlds teeming with colorful challenges, creatures and surprises to discover, brought to life with beautiful artwork, sound and music.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/421120/header.jpg?t=1527760050",
    "minimum_requirements": "OS: Windows 7, 8, 10 Processor: 2.3 GHz Dual Core Memory: 1 GB RAM Graphics: Intel HD 4000 Storage: 1 GB available space Additional Notes: Mouse recommended",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "If you liked all the other Amanita games you know exactly what you're in for with this one.   It's still beautiful, amazing, and fun.   If you're scoffing at the price, I can promise you it's better than a trip to the theaters to watch batman vs superman.",
            "review_score": "1"
        },
        {
            "review_text": "Oh my God ! This game is literally a DREAM !  Just..  a beautiful.. DREAM !",
            "review_score": "1"
        },
        {
            "review_text": "As a long fan of Amanita design(I own all their games, also some in hard copy), both because Im Slovak and there are not that many game developers around here, and Indie is my preferred style, I would like to say: The wait was worth it.   Pros: +Beautifull digital photography manipulation and art style +Smooth as butter(60 fps always) +can run smoothly even on a potato +Amazing Soundtrack +New dimension of puzzles and interaction(the flute) +different but same to the prequels +has replayability, finishing achievements  Cons: -high price tag(I dont care, i bougth the cosmic edition to support them) -short time spand(Not including achievment hunting) -5 years? really?  Give it half a year, and it will go on a sale for low, or hunt it on humble bundle, it is worth the gameplay.  The Crow approves :D",
            "review_score": "1"
        },
        {
            "review_text": "Samorost is not my favorite product from Amanita design, but I found the previous two games charming and cute, even if not too memorable. So is Samorost 3, and this time it's a bit of a problem.  Their previous major games, 'Machinarium' and 'Botanicula,' have fantastic puzzles, beautiful art, and charming gameplay. Samorost 3 has charm and gorgeous art, but the puzzles are mostly guess-and-test. There are a couple good ones in here, but most of them don't require much thought, and the remaining can't be solved logically, just trial and error.  I had hoped they would make this game their biggest yet, and it might be, but it doesn't feel like it because there aren't enough interesting people to meet, fascinating puzzles to interact with, or unique places to explore compared to Botanicula and Machinarium.  This isn't a bad game. There's so much good in here. The side puzzles are fun, and seeing all the cute things the wildlife does when you poke it is fun, but instead of adding so many of these things, they should have made the main story longer, with more places to visit, more things to do, more people to meet, more steps to take to discover and resolve the story. As is, the story is over much too soon, and it's too easy.  It looks like the team devoted most of their energy to the visuals and didn't think of as many interesting things for the player to do this time.",
            "review_score": "-1"
        },
        {
            "review_text": "If you like unique and tender graphics &amp; sound, charming riddles and infinite cuteness and also just want to have a good time you will love this game.  10/10 Aminata Design did it again",
            "review_score": "1"
        },
        {
            "review_text": "Totally awesome. I love all Amanita's games and this excels in every way. Gorgeous characters, great story, beautiful settings, and it is soooo cute, I laughed and smiled all the way through the game. Can't wait for the next one. Thanks guys.",
            "review_score": "1"
        },
        {
            "review_text": "tl;dr Wow. What a delightful experience. A senses bonanza.   What I saw",
            "review_score": "1"
        },
        {
            "review_text": "awesome game +/- 8 hours",
            "review_score": "1"
        },
        {
            "review_text": "Finally i played this game! was a long wait!   Well designed graphic and animations  each planet and cosmos backgrond shows its unique view with hand colored graphic. animation of creature are vivid and smooth and smooooth! just taking a view of the each scene will melt your mind everything has improved super sightly compared to the former games  (i expect samorost3 will be similar to Botanicula but it much similar to Machinarium)   Cool soundtrack  really impressived by the music of Tomáš Dvořák since the first game, Samorost 1. still the music is awesome maybe the finest. it adds deep dramy atmosphere to all over the game.   whoever played samorost series and got impressed might satisfied with this game. i really look forward to the next work of the Amanita design!",
            "review_score": "1"
        },
        {
            "review_text": "It'd be a misnomer to label Samorost 3 as a puzzle game. Yes, there are puzzles and, at times, they can be quite challenging. But really, the game is about taking in gorgeous alien environments and allowing your natural curiousity propel you through the game.",
            "review_score": "1"
        },
        {
            "review_text": "I have been an enormous fan of Amanita Design for almost ten years now, and I was so excited for this game. In no way has it disappointed, it's a stunning work of art and story-telling, alongside magnificent puzzles that are logical and fair, without being finnicky. I cannot recommend it enough!",
            "review_score": "1"
        },
        {
            "review_text": "Not too sure what drugs they were on when they made this game. Although, the musical mushroom ghosts you come across might give you some indication.",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant art piece, had fun playing it",
            "review_score": "1"
        },
        {
            "review_text": "9/10 I was really looking forward to Samorost 3, as Amanita Design's games never ceased to amaze me. Definitely one of the best point-and-click adventure games I've played. This is more an artistic experience than a traditional puzzle adventure game. The artistic touch put into this is spectacular, the storyline is just fine for 5 hours of gameplay, slightly reminded me of The Neverhood, some of the puzzle mechanics were really similar to it as well, although the puzzles in The Neverhood are definitely not as intuitive as the ones in Samorost 3. Nevertheless, I enjoyed this very much and would definitely recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "A joy to play, beautiful artwork, beautiful music amanita design are truly masters of this genre",
            "review_score": "1"
        },
        {
            "review_text": "Acid trip without the acid.",
            "review_score": "1"
        },
        {
            "review_text": "An absolutley beautiful game. I loved every moment of it!",
            "review_score": "1"
        },
        {
            "review_text": "Amazing! Buy this game! It's a fantastic adventure! A little short, but VERY unique and fun!",
            "review_score": "1"
        },
        {
            "review_text": "This game has amazing artwork. By far one of the prettiest games you can play. The sound design and music is also just as amazing. If you like artsy puzzle games, then this game is for you.",
            "review_score": "1"
        },
        {
            "review_text": "Amanita Design never ceases to amaze me. I love all their previous games so my expectations were very high of Samorost 3 and they did not disappoint. The game has such a beautiful artistic style that you just want to sit back and watch in between solving the brilliantly designed puzzles. The sounds and music are so beautiful! Can't wait to play their next game.",
            "review_score": "1"
        },
        {
            "review_text": "As with all Amanita games, the only major downside of Samorost 3 is its length. You can easily solve it in 4 hours, and there's virtually no replay value in it. But that concludes all cons, and there's a long list of pros to make up for them. The trademark artstyle is beyond beautiful, the atmosphere eerily charming, and the puzzles are in that 'just right' zone of not too obvious, yet not at all frustrating. The story is simple yet has a lot of memorable moments that will make you go 'wow' or 'aaaw'. Another forte of this title is its soundtrack by Tomas Dvorak. Maybe not an instant classic as the music of Machinarium was, but certainly on the same level. All in all it's more like an experience than a game, and most of all: true art. I'd recommend it with all my heart.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great puzzle game to play .......whit friends drunk and wasted not alone. we had some great laughs playing this to the end but the end was to fast to get to. wished the game had been 2-3 times bigger. looking forward to nr 4 :D",
            "review_score": "1"
        },
        {
            "review_text": "  Awesome arwork and soundtrack.  Buy and play.",
            "review_score": "1"
        },
        {
            "review_text": "This gem is full of imagination and optimism. Visuals and sound are gorgeous. Another heartwarming masterpiece of Amanita Design that will make you feel happy.",
            "review_score": "1"
        },
        {
            "review_text": "While i did enjoy Machinarium and Botanicula more for their stronger stories, this still had a very strong mood, and the 'interactive toy' design was better here. Definitely had some moments I really liked and nothing really negative about the experience.",
            "review_score": "1"
        },
        {
            "review_text": "Nice game",
            "review_score": "1"
        },
        {
            "review_text": "While the game is fun to play, and entertaining, I'm really dissapointed in the fact that I have nearly done everything available in 5 hours of game play. Decent graphics, great music, interactive environment, several things to explore, somewhat funny and interesting storyline. Not everything is obvious, but nearly all of the puzzles were easy for me to solve (others may not find them as easy). Unless more is added, I would not reccomend this to a firend.",
            "review_score": "-1"
        },
        {
            "review_text": "Absolutely wonderful so far. Beautiful graphics, entrancing sounds and music, an overall atmosphere of incredible imagination and wonder, all held together with nice and simple gameplay which I'm really enjoying playing, with my kids watching and helping.",
            "review_score": "1"
        },
        {
            "review_text": "Great game! I really love the visuals and sound design, and the music is so great. The puzzles never feel to difficult, but if you do get stuck a neat hint system is there to help you proceed in the game so you should never get stuck for too long. The game is whimsical and set in such a cool world which makes it unforgetable. A must play in my book!",
            "review_score": "1"
        },
        {
            "review_text": "Samorost 3 takes this Adventure game series to new heights in both design and in art. The surrealist approach to this universe is humbling and nostalgic, though new and inspirational. If you like being surprised by art, and like a bit of a challenge in your adventure puzzles, Samarost 3 is the game for you!",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome! Look at all the litte details! So amazing and beautiful &lt;3 And of course the sound effects &amp; the music: I smile everytime I hear it :D I also enjoyed the story and the puzzles. Another great game next to Machinarium, Samarost 1 &amp; 2 and Botanicula.",
            "review_score": "1"
        },
        {
            "review_text": " Mr. Space Gnome And His Magical Flute!",
            "review_score": "1"
        },
        {
            "review_text": "Such a avid fan of Anamita Designs. They make great games and the art is impeccable. I think everyone should play it at least once. LOVE IT!",
            "review_score": "1"
        },
        {
            "review_text": "Nice game with nice artwork. Could be a bit longer maybe, but it is nice with a short game once in a while.",
            "review_score": "1"
        },
        {
            "review_text": "Wonderful. P&amp;c with lots of atmosphere.",
            "review_score": "1"
        },
        {
            "review_text": " Samorost 3  is the third, full-length game by Amanita Design. I believe it’s the longest time they’ve spent on developing a game, and it really shows with the intricately detailed artwork, beautiful soundtrack and clever world design.   Compared with their previous two games, I think Samorost 3 features some of their most beautiful art to date. Seriously, some scenes are absolutely stunning. It cannot be described with words, and has to be experienced by playing the game on a high resolution screen.   Composer and multi-instrumentalist Floex aka Tomáš Dvořák returns to score the soundtrack, and as usual, he doesn’t disappoint. It's much more abstract and lush than his previous work featuring a whole array of meticulously and beautifully arranged melodies. One of the biggest draws to it is how it is actually featured in the game, with several puzzles having some kind of musical focus.   Now, for a kind-of-negative-point. While their games have never about super immersive storytelling, I’ll admit I was a bit lost at the beginning of the game. I knew (vaguely) to keep going, but I wasn’t quite sure where I was going. It just felt like I was chilling out, clicking stuff to see what happens next. It wasn’t really until near the end I learned about the true goal of the game. This didn’t really bother me, because again, Amanita’s games aren’t really played for the story. But it did feel weird. On the other hand, it made me appreciate their semi-open world design. It gives each section of the game it’s own chance to shine and ultimately provided a very relaxing experience.   As a final score, I’d give this a 9.1/10. This is an absolutely fantastic game. The biggest drawback for me I guess was that the spark I felt while playing their earlier games was missing from  Samorost 3 . This may have been due to my sporadic game sessions while playing. Regardless, it’s another home-run for Amanita Design.",
            "review_score": "1"
        },
        {
            "review_text": "Samorost 3 is a wonderful experience. It's one of the best point-and-click games I've played. It features beautiful graphics, excellent music and sound design, and so many likable characters. Get it when you can.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful artwork, brilliant animation, even better sound design and music. I love Amanita.",
            "review_score": "1"
        },
        {
            "review_text": "Wonderful experience. Ingenous and entertaining. Good puzzles and sumptuous music.",
            "review_score": "1"
        }
    ]
}