{
    "app_id": 42120,
    "name": "Lead and Gold: Gangs of the Wild West",
    "release_date": "2010-04-08",
    "developer": [
        "Fatshark"
    ],
    "publisher": [
        "Fatshark"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 16,
    "categories": [
        "Multi-player",
        "Steam Achievements",
        "Partial Controller Support",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Western",
        "Action",
        "Multiplayer"
    ],
    "achievements": 81,
    "positive_ratings": 1471,
    "negative_ratings": 545,
    "price": 7.99,
    "description": "Lead and Gold: Gangs of the Wild West is a third-person shooter that delivers an intense team-based multiplayer experience. Relive the violent era of the Wild West with adrenaline-fueled action and fast-paced gunfights. Engage in gritty battles in beautifully rendered classic Western settings.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/42120/header.jpg?t=1478101067",
    "minimum_requirements": "OS: XP/Vista/Windows 7 Processor: Dual-core processor (Intel Core 2 Duo 2.4 GHz or AMD Athlon X2 5200+ 2.6 GHz) Memory: 1.5 GB RAM Hard Drive: 2.0 GB free space Graphics: DirectX 9.0c/Shader3.0 compatible, VRAM 512 MB (NVIDIA GeForce 7800 series or ATI Radeon X1900) Sound: DirectX 9.0c compatible sound cards DirectX®: DirectX 9.0c",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "A rather enjoyable game that I can't recommend for one major reason: it's dead. There's just about no one online leaving you with nothing to do. Since it's online only that means it would be rather pointless purchasing this game unless if there's a sudden boom in the amount of players for some reason.  If more people decided to play this game I'd recommend it, but in its current state I can't.",
            "review_score": "-1"
        },
        {
            "review_text": "One of the best games ... no more players :(",
            "review_score": "1"
        },
        {
            "review_text": "Yeah, this game is pretty dead.",
            "review_score": "-1"
        },
        {
            "review_text": "Sadly, the game is dead, no one is playing it anymore. Purchase of the title would be ill advised.",
            "review_score": "-1"
        },
        {
            "review_text": "nobody....plays...this...game... there are no servers who have more than 2 guys and there's no singleplayer.... could be a nice game but you just can't play....",
            "review_score": "-1"
        },
        {
            "review_text": "  Great 3rd person shooter to play with people. I just wish it allowed bots in the different game modes. It's a very fun game, see if you can pick it up from Fatshark for free, or buy it, it's only $10 and it's definitely worth it.  Disclaimer: I received this product for free from a giveaway by the developer, Fatshark. This does not affect my review in any way because I was not asked to even review the game. I am giving this a positive review because I personally find it very fun.",
            "review_score": "1"
        },
        {
            "review_text": "Good game. Only problem is that it's hard to find a lobby with players. Even if you find one, it'll probably be hosted from the other side of the globe, which affects the ping, atleast for me.",
            "review_score": "1"
        },
        {
            "review_text": "Game's dead. Don't bother. Was a fun little title while it lasted, though.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game. I hate how people are calling it a bad game when they havent even played it more then 20-30 mins. Too many impatient gamers that dont want to learn how to play a game so they call it a bad game.",
            "review_score": "1"
        },
        {
            "review_text": "It's a shame that a nice game like this has dead servers and none to play with.",
            "review_score": "1"
        },
        {
            "review_text": " Cowboy Time!",
            "review_score": "1"
        },
        {
            "review_text": "This is/was a fantastic game, really enjoyable and fun... until no one played it any more. A real shame. maybe it needs more promoting? maybe it should go FTP like Gotham City Imposters? Who knows... I just want to play it again with a massive group of people again...",
            "review_score": "1"
        },
        {
            "review_text": "its nice game great grafs an mechanics but need more players",
            "review_score": "1"
        },
        {
            "review_text": "sadly its dead.",
            "review_score": "-1"
        },
        {
            "review_text": "I like throwing dynamite. Easily turns into spawn camping if the teams get unbalanced which is likely with 5 a side teams. Is incredibly satisfying when you are doing the spawn camping or generally winning.",
            "review_score": "1"
        },
        {
            "review_text": "lead and gold, lead this people and be 58.3%, 99.9 goldbar - its primary priority of gold and that ♥♥♥♥ gives a name for game which sometimes ♥♥♥♥ too. my recomendation dont buy it, buy only if it will cost 2 dollars or lower",
            "review_score": "1"
        },
        {
            "review_text": "great old west game",
            "review_score": "1"
        },
        {
            "review_text": "Cowboys? ✓ Cool Weapons? ✓ Balanced classes? ✓  Should I buy it? ✓",
            "review_score": "1"
        },
        {
            "review_text": "It's a good game, I recommend it!",
            "review_score": "1"
        },
        {
            "review_text": "this game was so much fun when it got released it is a shame that the community died. It is a better version of fistfull of frags except that one is free and the community isn't dead.  but when i do find a server that has actual people on it is freaking awesome. trowing tnt setting traps etc seriously the community needs to come back.  well i'll be waithing in the saloon if you need me",
            "review_score": "1"
        },
        {
            "review_text": "as far as the game looks, its great. but sadly i really need a refund. when purchasing this game for myself and 2 others i was in the hopes to enjoy it and actually play it. but instead everytime i open this game it tabs back to my desktop and if i try to tab back in all it does is stay black and tab me out. and theres no one i can reach with steam for a refund and i dont have this problem with any other game.",
            "review_score": "-1"
        },
        {
            "review_text": "Good multiplayer game Great Western Best opportunity to feel yourself Wild Bill or Jesse James =D",
            "review_score": "1"
        },
        {
            "review_text": "Unbalanced, laggy and just simply bad game.  When I saw the trailer for this game I was real excited. I bought this game when this was brand new and actually enjoyed it. Then I unfortunately couldn't access the game anymore (it was on my friends account which I shared with him) and just forgot about this game. When I came back in 2014 the game was just bad.  Hackers, griefers and extremely low amount of players. Only 1-3 servers to play in which have the ping around 100-200. The ping is manageable and doesn't bother that much but when it comes to griefing, well, that's nightmarish. Maps are unbalanced and let you pretty much grief in any map and in any spot.  I could actually recommend if they would update this game and maybe do it free to play. It would increase the amount of players with an insane amount.",
            "review_score": "-1"
        },
        {
            "review_text": "A great mp game, Only wish for bigger maps with more players able to play on them at once... would be great to see a reboot/revival !!",
            "review_score": "1"
        },
        {
            "review_text": "Nobody is on. Like everyone said, the game is dead.",
            "review_score": "-1"
        },
        {
            "review_text": "Fantastic game 8/10",
            "review_score": "1"
        },
        {
            "review_text": "It has an interesting theme but many others do the FPS style better. Hard to find a good match the only people still playing seem to be hardened veterans.",
            "review_score": "-1"
        },
        {
            "review_text": "( ͡° ͜ʖ ͡°)",
            "review_score": "1"
        },
        {
            "review_text": "A great concept but not supported enough to flourish (or even get bugs out), shattered horizon like waste of time and money that keeps me from eagerly buying startup online shooters.  Another error in my game hours shown vs actual played.",
            "review_score": "-1"
        },
        {
            "review_text": "wished people played this as it looks so good and plays really well",
            "review_score": "1"
        },
        {
            "review_text": "Good TPS, too bad that there's not enough players.",
            "review_score": "1"
        },
        {
            "review_text": "  You should try this game!  IT'S AWESOME   Nice  graphics,  Good  animations, And it's a lot better if you play it with friends(if you have one). :D",
            "review_score": "1"
        },
        {
            "review_text": ":)",
            "review_score": "1"
        },
        {
            "review_text": "This game has so much potential, i reccomend this game if you want to have some fun with your lan party :)",
            "review_score": "1"
        },
        {
            "review_text": "  Meh, clunky as hell and I got booted from the server for being idle when I was defending. Might give it a another play or two but not going to suggest this unless it's free.",
            "review_score": "-1"
        },
        {
            "review_text": "  While it feels like it should be a fun game from the creators of Warhammer The End Times Vermintide, It suffers the same problems in my book and I cannot recommend it.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a sub=breed of a shooter. Makes me seasick and godthanks I got it as a retail. Its not even worth as gift and to waste on -.-",
            "review_score": "-1"
        },
        {
            "review_text": "Fun game but this game must be free ! because this game is dead !",
            "review_score": "1"
        },
        {
            "review_text": "I loved this game just from the screenshots...but i was drowned my online activity... thare are maybe 5 people online and just 1 server from what i could see there was more than 90000 players in this game what happend...?",
            "review_score": "1"
        },
        {
            "review_text": "1. Its crap....  2. Its crap...  3. Its still crap ",
            "review_score": "-1"
        },
        {
            "review_text": "I can see why this game is dead  because it sucks",
            "review_score": "-1"
        },
        {
            "review_text": "It looks like a cool game but it isn't! I am still waiting after 2 days for my refund... It's the most idiot game i have ever played!",
            "review_score": "-1"
        },
        {
            "review_text": "All I remember is this game was so bad I wouldn't play it. It looks really fun though. hah!",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty cool game, just wish there was more of a community. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Surprisingly fun multiplayer shooter game. Definitely check this one out!",
            "review_score": "1"
        },
        {
            "review_text": "I honestly don't know how this game wasn't extremely succesfull. The game is very well made, from the detailed and beautfiul character models to the core game mechanics. I personally loved this game and am pretty sad to see that it didn't get the success it deserves.",
            "review_score": "1"
        },
        {
            "review_text": "TF2 in the WIld West. Very well balanced and fun gametypes.Runs smoothly and feels great to play. I have a great time playing and you should, too!",
            "review_score": "1"
        },
        {
            "review_text": "If you are looking for a wild west game this is where its at! One of my favorite Westerns that deal with the gangs. You'll love it.",
            "review_score": "1"
        },
        {
            "review_text": "Awsome Western Owmnage PLAY IT IF U FEEL BAD CHEERS U UP BUDDIES!",
            "review_score": "1"
        },
        {
            "review_text": "A great multiplayer 3rd person old west team based shooter",
            "review_score": "1"
        },
        {
            "review_text": "Well, what is there to say about this game?  To be honest it's a great game. It's biggest setback is that it is (please keep reading) dead. However at the moment there a few players who are trying to get this game back on its feet. Even if it's just a small group of 6-10 dedicated players I think it'll be a good start to get this game going again.  For the moment I will recommend this game in hopes of getting more players but if this attempt fails then I will change my review to not recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Class based western shooter. Not bad for a free mp shooter. You can dual wield by the way.",
            "review_score": "1"
        },
        {
            "review_text": "  Great game just died so quick and has a small amount of people ever playing.",
            "review_score": "-1"
        },
        {
            "review_text": "shootin dudes wherin cowboy hats. nuff said",
            "review_score": "1"
        },
        {
            "review_text": "tons of fun. good character classes. WESTERN SHOOTER! community is a bit sparse though.",
            "review_score": "1"
        },
        {
            "review_text": "Great and easy shooter game that set in a Western era. Simple and to the point.",
            "review_score": "1"
        },
        {
            "review_text": "I give Lead and Gold  80%  In a nutshell:  It’s like Team Fortress 2, western style, in third person.  Pros: Verity in characters, enough so to make the game balanced. No one character is overpowered. Variety in levels and missions to make you want to play all of them.  Cons: No one plays… Sadly this game would only be played amongst friends at a LAN party or something. To my knowledge you can’t even play with bots…  Other Notes: They should pull a tf2 with this game. Make it free to play and have an online market. This game would explode with players then. ",
            "review_score": "1"
        },
        {
            "review_text": "I like the game. It can be fun.  However, I found it difficult to get a feel for the game.  The tutorial doesn't really give a new player much of a chance to practices. You have a few minutes to see the controls, but once you finish the control walkthrough, the AI starts getting difficult pretty quickly. In about 5 minutes, it's 3-4 to one almost constantly. There is no real time to get to try out the characters.  Co-op mode, unfortunately, is on only one small map, the tutorial one. I was hoping for more co-op maps.  Once you start to learn the ropes. it can be challenging and enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "WOW this game is way more fun than it looks and i thought it would be. Rewarding teamwork and fun shootouts mix to form a great game.",
            "review_score": "1"
        },
        {
            "review_text": "Great game with poor follow up. I love everthing about this game except for the low community population, scarce server list, and complete lack of character balancing and updating from its creators. To my great dismay this appears to be another game that, while very fun despite its issues, failed to cultivate a respectable following, resulting in very few improvements since its release. I DO recommend this game if they developers show some more love but do not if they abandon it, which seems to be the case at the time of this review.",
            "review_score": "1"
        },
        {
            "review_text": "It's not that bad for a game that cost me only a dollar.",
            "review_score": "1"
        },
        {
            "review_text": "most people havnt even heard of it :/ BUT ITS GREAT! PLAY IT NOA!",
            "review_score": "1"
        },
        {
            "review_text": "I have been put off by the console-game look of this title but recently gave it a shot with the free weekend and price reduction. Even with in-game practice my first online game was rough to say the least. Capture points and stealing bags of gold are the primary gamemodes. Gameplay is centered on your teams' flag which can be picked up by anyone allowing dead players to respawn back at the start or on their flagholder. Dying means the flag drops and remains til either the opposing team touches it sending it back or your team picks it up and carries it onward. The gunplay is very fast and in your face with the exception of the Trapper or patient Deputy. You can run and tumble off 2nd floors not missing a beat which makes for interesting uses for the landscape when the gunplay gets heavy. Very happy I picked this one up and spent a few hours with it. The maps are well done and not too big to the point where you feel out of the action. Skin yer smokewagons and see what happens!",
            "review_score": "1"
        },
        {
            "review_text": "Preliminary review: Glad I only paid $1.50 for it. The controls are a little wonky and I haven't had much fun with it yet, but maybe it'll grow on me.",
            "review_score": "1"
        },
        {
            "review_text": "I &lt;3 this game SO HARD!! ",
            "review_score": "1"
        },
        {
            "review_text": "Bought a bulk-pack of this game when it was on sale recently, and it was a blast for a LAN-party situation. It really is an excellent combination of twitch-shooter and tactical/team play.",
            "review_score": "1"
        },
        {
            "review_text": "I actually like this game quite a bit. Too bad it isn't fee, so the population would still be high. (I joined after it died down). The gameplay is pretty solid and fun, it's easy to pick up and get into. The only real problem I have with the game is that there is no crouch, which in a shooter, is always helpful. Other than that, it looks nice and plays nice.",
            "review_score": "1"
        },
        {
            "review_text": "definately fun to play. little silly and bugged",
            "review_score": "1"
        },
        {
            "review_text": "Great fun in wild west style.",
            "review_score": "1"
        },
        {
            "review_text": "cowboy cod black ops :P",
            "review_score": "1"
        },
        {
            "review_text": "This game is actually pretty fun but no one bought it and its dead.",
            "review_score": "-1"
        },
        {
            "review_text": "Awesome class-based multiplayer game. It's simple, and that's why I enjoy it.",
            "review_score": "1"
        },
        {
            "review_text": "like tf2 but with cowboys",
            "review_score": "1"
        },
        {
            "review_text": "You need to bring back this game. It one of the best games.",
            "review_score": "1"
        },
        {
            "review_text": "This game is so cool 10/10 for graphics  10/10 for gameplay :D this game is the best for Wild West",
            "review_score": "1"
        },
        {
            "review_text": "  This game is awesome if your or not a red dead redemption fan this game is four you.But still this game needs players alot of players",
            "review_score": "1"
        },
        {
            "review_text": "  So I picked this game up for free duriong a promo event like 2 two days ago. I didn't play it until today, but oh my is it fun. If I had only played the demo I would most certainly buy it now!",
            "review_score": "1"
        },
        {
            "review_text": "  I do really like this game, and I think that it has a lot of potential. Unfortunately, its really not much fun because there is almost no playerbase. I often get put into a server with little to no one in it. The developers recently gave away 100k keys and they supposedly were all nabbed up. If you check the steam graph the all-time record for number of people online was 252.   I would recommend this game, because it is a really polished, well-executed game even if it has a few bugs to work out. Its just sad that no one really plays it.   Gameplay: 7/10 Community: 3/10 Overall: 5/10",
            "review_score": "-1"
        },
        {
            "review_text": "The games all like 'install a sound card!'..... WUT?",
            "review_score": "-1"
        }
    ]
}