{
    "app_id": 421600,
    "name": "Ray Gigant",
    "release_date": "2016-08-10",
    "developer": [
        "BANDAI NAMCO Entertainment Inc."
    ],
    "publisher": [
        "Acttil, LLC."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Adventure",
        "Anime"
    ],
    "achievements": 42,
    "positive_ratings": 40,
    "negative_ratings": 31,
    "price": 22.99,
    "description": "Ray Gigantis a unique dungeon crawler RPG which combines dungeon crawling adventure with Japanese visual novel like story telling. Players will first be introduced to the gripping tale of Ichiyawho is a young fighter shrouded in mystery.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/421600/header.jpg?t=1471651391",
    "minimum_requirements": "OS: Windows 7 (32bit, 64bit) Processor: Intel Core i5 1.90 GHz or equivelant Memory: 6 GB RAM Graphics: Direct X 11 compatible graphics card with 1GB of ram or equivelant DirectX: Version 11 Storage: 6 GB available space Sound Card: Realtek High Definition Audio equivalent or better",
    "recommended_requirements": "OS: Windows 8.1, Windows 10 Processor: Intel Core i5 2.80 GHz or equivelant Memory: 8 GB RAM Graphics: NVIDIA GeForce GTX 750/AMD Radeon R7 equivalent or better DirectX: Version 11 Storage: 6 GB available space Sound Card: Realtek High Definition Audio equivalent or better",
    "reviews": [
        {
            "review_text": "I saw many people talking about this before it came out and decided it was worth a shot because I greatly enjoyed Experience's other outing on Steam, Stranger of Sword City. While this game is definitely not as hard, I find that the deeper story more than makes up for it. And as someone who ENJOYS Dungeon Crawlers that are difficult, it is a nice change of pace to have one where every single battle doesn't have me worried I'm going to misclick one thing and have everyone die. The art style is wonderful, and the fact that some new enemies/bosses speak to you is a welcome quirk. I don't speak fluent Japanese but as a fan of anime I know what a good VO sounds like, and this is one. You can HEAR the happiness/anger/frustration/evil/insert appropriate emotion here, and it actually fits with the subtitles. And the semi-4th wall breaking bits always give me a chuckle :-)  Tl;Dr To anyone who enjoys anime rpgs with decent stories, or who enjoyed Stranger of Sword City,or to anyone who enjoys dungeon crawlers but has had the thought of 'gee, it would be nice maybe ONCE to play more than the tutorial in one of these things without feeling like wanting to punch a wall cause of a cheap death', I heartily recommend this dungeon romp. Submit to fate! :-P",
            "review_score": "1"
        },
        {
            "review_text": "When this game first released it piqued my interest, but I don't have a Vita so I forgot about it until now. Picked it up on Steam and I regret it. Yet another victim of poor porting. The fx and music are poor--hell, the music ends before you're finished with Slash Beat Mode: not that you could play that part like a rhythm game in the first place, as the music doesn't sync up with the button presses when it is there. The game crashes pretty frequently as well. The story could end up being solid enough, I suppose, but I can't be asked to finish it.  ----------------------------------------------------------------  Edit: So I finished it. I get really bad buyer's remorse and sunk-cost fallacy. Anyway, the perspective from the other side: still not recommended. Many of the problems, aside from the crashing, remained through the entirety of the game. The story was uninspired and tropey, and what little character development there was was unsurprising, predictable from the moment you met the character. The level design was poor, repetitive, and frustrating at times. The entire game was painfully easy, with an inverse difficulty curve that plagues so many rpgs. I died a total of three times, twice because I got careless in the final dungeon, and once because May is freaking useless. Slash Beat Mode never worked properly, none of the music was engaging or memorable, and I suspect that some of the fx were public domain. None of the comedy landed.   Positives: The aesthetics were lovely; the art style and character design were very good. The kaiju fights were satisfying. That's about it.",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty cool. Easy, but pretty cool.  EDIT: Yes, I know my playtime is small, but I've beaten the game on Vita.",
            "review_score": "1"
        }
    ]
}