{
    "app_id": 421670,
    "name": "CUPID - A free to play Visual Novel",
    "release_date": "2016-03-04",
    "developer": [
        "Fervent"
    ],
    "publisher": [
        "Afterthought Studios"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements"
    ],
    "genres": [
        "Free to Play",
        "Indie",
        "RPG",
        "Simulation"
    ],
    "tags": [
        "Free to Play",
        "Visual Novel",
        "Sexual Content"
    ],
    "achievements": 67,
    "positive_ratings": 865,
    "negative_ratings": 129,
    "price": 0.0,
    "description": "&quot;Love is both poison and cure, both knife and remedy.&quot; Set in 18th Century France, this is a gothic romance tale about loss, revenge and the different faces of love.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/421670/header.jpg?t=1457099874",
    "minimum_requirements": "OS: XP Processor: 1Ghz Memory: 512 MB RAM",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I don't usually look at playing visual novels becasue I usually find them boring.  Oh my Jesus.  This game is creepy, kinky and overall kinda Fu'cked. I love it and it's not what I expected.",
            "review_score": "1"
        },
        {
            "review_text": "A well-written, extremely creepy and compelling story that does a lot of interesting things with the VN genre by making you not, technically, a direct character in the story.  It really, really, really deserves multiple content warnings. Parental abuse, suicide and consent issues are the three big ones.",
            "review_score": "1"
        },
        {
            "review_text": "  My God! This game! I have only done one play through and I am ..... blown away. The story is dark and harsh and I really feel for every character. I wish the choices were nicer but it is not a 'nice' game. This is an amazing story of love and loss and insanity.",
            "review_score": "1"
        },
        {
            "review_text": "This was... Pretty damn good. No words to explain why. Go check it out yourself, I highly recommend it.  YoU ShOuLd LiStEn To YoUr MoThEr, ChIlD. *Demented laughter*",
            "review_score": "1"
        },
        {
            "review_text": "I feel guilty playing this for free when it is so fantastic. The writing is extremely dark, with plenty of unblievable twists and turns. Definitely has become one of my favorite visual novels.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing visual novel (with the craziest achivements)! It is story-rich and pretty, and you cannot overlook it with that price. Some parts of it reminds me of Saya No Uta, which I found a bit nostalgic. I would defiantly recommend!",
            "review_score": "1"
        },
        {
            "review_text": "Great VN. Reasonably deep story with some interesting twists along the way - 5-6 hours to do everything. Downside is that the developers were a little too cute with the decision tree - there are essentially 6-7 key decisions you make along the way that determines which ending you get. However, each decision requires you to make the right choice for several prompts, which no indication of what triggers what. Ultimately, it means that it is tough to figure it all out on your own since the ending you get seems somewhat random, and the usage of a guide is probably necessary.  8/10",
            "review_score": "1"
        },
        {
            "review_text": "I don't usually play visual novels, but this one was very interesting and twisted in its own way. There were parts that I just wanted to close the game because it was just too painful to read,as I played more I realized that there could be better outcomes. Totally worth it.",
            "review_score": "1"
        },
        {
            "review_text": "I read the negative reviews and was scared to download this game but I did it anyway.  I was so surprised at how good this really was. The story kept me interested and I played through it all in one night. Some people were saying that your dialogue choices don't matter until the end of the game, that's not true at all they do. The story keeps you hooked and I found myself wanted to replay it just so I can try and unlock the other endings. Very good game!",
            "review_score": "1"
        },
        {
            "review_text": "Normally not much of a visual novel player/reader, but I quite enjoyed this. Also thanks for the SteamOS/Linux support.",
            "review_score": "1"
        },
        {
            "review_text": "This is definitely not what I was expecting. The story is fantastic and only tells you what you need to know and nothing more. It doesn't shy away from adult themes and is very gripping! Only expected to play for at most an hour, but I got sucked into the story and played much longer in my first sitting.",
            "review_score": "1"
        },
        {
            "review_text": "This is definitely not what I was expecting. The story is fantastic and only tells you what you need to know and nothing more. It doesn't shy away from adult themes and is very gripping! Only expected to play for at most an hour, but I got sucked into the story and played much longer in my first sitting.",
            "review_score": "1"
        },
        {
            "review_text": "WOW.  I cannot believe this game is free.  Seriously.  I went to the dev's website to throw money at them (you can buy their artbook which is basically a big-a$$ PDF file with some artwork and all kinds of other bonuses thrown in. Worth the $3 or w/e it cost. Kinda surprised it's not offered as DLC!)  I wish the sound track was DLC too but maybe the music is not original so they cannot sell it like that... IDK...but I wish I could somehow put the sound track on my phone...  Characters are multi-faceted. Story is full of mystery and intrigue. I like that there are tons of acheivements to obtain. Makes for high replay-ability plus just for the fun of it to see what happens in different routes!!  I haven't even finished my first play through yet and yet I already know I will be playing this over and over.  Much bang for literally zero buck.  A++++++ would get seduced again.  ((Will update at a later date once I have completed.))",
            "review_score": "1"
        },
        {
            "review_text": "So many achievements, so little time.  Bonus: The story is pretty intersting too.",
            "review_score": "1"
        },
        {
            "review_text": "I was really involved in the story, narration, art. My 1st visual novel and i think i will look for more, good job ;-)",
            "review_score": "1"
        },
        {
            "review_text": "Had been interested in the game.  Went to the achievement section and saw the 'Spectral Handjob' and 'Oral Sex From Hell' achievements.  Downloaded the game immediately. Enjoyed it :D  If you love horror and romance, you will love this visual novel. I promise you.   10/10",
            "review_score": "1"
        },
        {
            "review_text": "*SOME SPOILERS*  I'd say it's an okay story. Not amazing, but good enough for me to see all the endings (with the skip option of course). Everyone is saying how dark and morbid it is. It's not that bad. Steam has many FAR darker stories without ANY censors or warning: Danganronpa, Higurashi, etc.  I would say on the scale of gory-ness, it has some but nothing too frightnening. 2-3 images of blood, 2 images of strange creatures, etc.  Storywise: I think overall it's good. Unique enough. No real big surprises though, which is fine. But MAN, there are some real boring sections. Excruciatingly boring parts. Those negative reviews saying it didn't hold their attention/it was boring? They are 100% tellign the truth. Sure, you think 'I wanna solve the mystery; learn more' but that's not enough to drive you to finish. I read alot, and I sometimes have to read stuff just because I wanna finish it. This was an example. The story isn't interesting enough to push yourself through normally. There is mystery but too many boring sections. The endings are actually interesting though and unique enough.  Characters: Eh... they are unique and you can definitely remember them, but hard to really relate to it. They are pretty 'average' in quality.  Art: Okay.  Honestly? It's an okay game in every regard. Nothing horrible, nothing great. It's free, so maybe?  I think it did several things right, it just needs a bit of work here and there. I can't understand what made certain parts boring. The endings were fine, they were good. But the parts before were rough.   I don't know if I'd recommend it. It doesn't grab enough your attention and it isn't dark enough to make it worth that either.  I think if you can finish it ONCE (for one ending): go for all endings. It's okay. Truly, middle of the scale.  No idea what's with the people rating it 10/10. it's not perfect, by no means.",
            "review_score": "-1"
        },
        {
            "review_text": "Very lame, too much dialog and not enough images to match it. Also the skip speed option doesn't seem to do anything.",
            "review_score": "-1"
        },
        {
            "review_text": "Could not hold my interest.",
            "review_score": "-1"
        },
        {
            "review_text": "Started out interesting but then the ending was just friggin weird. Not that the Guy was    a cupid   and in the darkest sense;     The Incest really ruined the whole thing for me.  ",
            "review_score": "-1"
        },
        {
            "review_text": "Great character development. Horrible character devolvement.",
            "review_score": "-1"
        },
        {
            "review_text": "I saw the good rating on this game which is why I even bothered installing at all. Are you guys serious?? ABUSE is not a necessary element in a good entertainment.  I'll be honest, I did not check screenshots and description when I decided to download this game. Had no idea it would be so twisted and retar'ded. I am a supporter of LGBTQ and one myself, also have been raised in an abusive family+environment all my life. but this.. This is a DISGRACE. This shallow game throws abuse, ero, and mental illness(delusions) around just for the sake of being 'different' and 'dark' and people actually buy it!! No the story is not deep simply because there are big tragedies and the 'hot' shít (ero and trendy vamps-like theme) included. If you enjoy this piece of sht, you need to reevaluate your entire life. Mental illnesses and abuse are not materials for entertainment. That aside, the plot itself is very cringeworthy.   Too Fuc'ked Up. Not even fun nor inspiring. Don't waste your time on this.",
            "review_score": "-1"
        },
        {
            "review_text": "What the ♥♥♥♥ did i just play....",
            "review_score": "-1"
        },
        {
            "review_text": "I played this piece of ♥♥♥♥ for 44 minutes and didn't get to see even the slightest of ♥♥♥♥♥, i was expecting to see some good old hentai fun, but Nooooo this game, probably made by some broke art student looking for some ♥♥♥♥♥♥♥ attention , is the complete opposite, it's a damn emotion simulator, if i wanted that i would've just talked with any women in the ♥♥♥♥♥♥♥ planet, i actually regret even wasting any memory on this sorry excuse for a game, in a ratio of ♥♥♥♥♥ to memory its a solid 0:1, So the game is an overall dissapointment.",
            "review_score": "-1"
        },
        {
            "review_text": "I can't believe I'm actually feeling compelled to write a reveiw.  This VN was amazing. I've never found something so unpredictable, so exciting, so spicy in all my gaming and reading history. A++ and keep it up! I'm not sure where to begin. The art, the music, the paths you can take? OH MY.  Listen, if you're not sure whether it's something you'll enjoy, it's free, try it. And if you try it, go all the way through at least once. You won't regret it. The only thing that I think could have been better is that some of the art passed to quickly for me to apreciate it. And that's just an excuse to do those paths over again.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Would send Mother to go an eff herself. -IGN ",
            "review_score": "1"
        },
        {
            "review_text": "I liked trying to find each ending within the game. After finishing it, I can't help but feel sad. It was longer than I expected, but maybe if it was longer in which I was givin a better understanding of all the characters. Oh well, what do I know about visual novels?(Not that I won't learn). I liked this a lot with its classical music choices and adreniline moments.",
            "review_score": "1"
        },
        {
            "review_text": "HOLY CRAP ON A CRACKER.  I just had one play through but oh my goodness, I feel like I can take on a season marathon of GoT with ease now.  Amazing and screwed up, I love it.",
            "review_score": "1"
        },
        {
            "review_text": "I just finished my first playthrough, and all i can say is WOAH. The intrigue began with the very first pages, and the mystery throughout kept me reading untill the end. Mystery, gore, and romance.   10/10 would Guillerme again",
            "review_score": "1"
        },
        {
            "review_text": "A few things to keep in mind before you try this game:  It is a MATURE game, with adult themes and dark moments. The game doesn't hide it from you and is upfront about it, but it's good to point it out anyway.  It is also free, which is good, so the question is mostly if you won't waste your time by trying it out.  It wasn't my cup of tea personally (I like light-hearted stories, humor, silliness, that kind of thing), and I'm not sure if I'll play it through again (only one walkthrough for me, though it does lend itself well to replays), but despite that, I still couldn't stop going through the walkthrough I did. It's rather well written, very intriguing, and mysterious.   If, knowing that it's a dark story, that either appeals to you or is acceptable, then I recommend it. If that does not sound like something you'd be interested in, then don't bother.",
            "review_score": "1"
        },
        {
            "review_text": "It is very exotic mmmmm.....",
            "review_score": "1"
        },
        {
            "review_text": "I actually really liked this little game. It's quite short, and there are only a few characters, but even so I feel like I have managed to gradually understand each of them more and more. The best part however was to see how the game plays with the myth of cupid.   I would really recommend it if you've got some free time!",
            "review_score": "1"
        },
        {
            "review_text": "I'd already played this game (and gotten all the endings!) waaaaay before I got a steam account. The fact that I replayed this game (and got all the endings again) says enough about what I think of it.",
            "review_score": "1"
        },
        {
            "review_text": "It has nice art style but story was a bit boring",
            "review_score": "1"
        },
        {
            "review_text": "I don’t normally write reviews on games, but I felt like I should for such a remarkable VN. CUPID is a deep, psychological horror Visual Novel that tells a story you won’t forget for a long time. It’s something you won’t be able to put stop once you start because it constantly leaves you wanting to know more. And for free no less! PROS: -Free -A good 3 hours for just one playthrough. But a good 6 hours to unlock everything -Extremely interesting and unexpected story -Beautiful art for a free VN -LOTS OF ACHIEVEMENTS -Little to no spelling errors -Soundtrack is amazing -Interesting idea to have you play not as a character but as an influential force. You don’t choose what happens, your words affect the future -YOUR ACTIONS ACTUALLY MATTER -FOUR endings! (with one secret ending) CONS: -The perspective can be a little bit confusing at first -You don’t really get attached to the characters seeing as YOU yourself are not a character If you dislike dark, sexual themes, then this is NOT the VN for you. However, if you like a twisted, psychological horror novel then this is 100% something you’ll enjoy. Overall: 8.5/10 ",
            "review_score": "1"
        },
        {
            "review_text": "An amazing dark fairy tale, it'll make you hooked for hours. :)",
            "review_score": "1"
        },
        {
            "review_text": "This is definitely on the list of best VNs I've ever played. It's worlds better than some games that I've paid $30+ for and I didn't have to spend a dime on it. Almost enough to make a person feel guilty.  Although love is the overall theme, what really sucked me in initially was the suspense and feeling of slow creeping terror. The atmosphere is wonderful -- writing and art are not perfect but almost always great, and what more can you ask from a free game? They work together to do an excellent job of building tone, creating a sense of gradual mounting tension, and really evoking the feeling of a whole world with a few static images.  I got ending 3 the first time through despite doing my very best to make nice decisions, and once I'd finished reading that I felt like I needed a bath, in the best possible way. There they were, this character doing something unequivocably evil, and yet in a certain sense I couldn't even blame them for it. I was sucked in by the perversity and the mystery of it all and immediately had to dive back in for more.  If I were to voice any criticisms, they would mainly be:  1) From the author's notes bonus I gather that the main writer assumes the meaning of the title 'Cupid' would be obvious once you've finished the endings, but I was reading that with four endings under my belt and the idea hadn't even occurred to me in the slightest. I assumed it was supposed to be more of a general reference to love and matchmaking. If this was an idea the team wanted to convey to readers or thought was important, I think they unfortunately did a poor job.  2) The summary blurb for the game in the Steam Store pushes the idea of the player directly stepping into the role of Mother, but this is very misleading. 'Mother' is very much a specific character of her own with a specific personality, goals, etc. that you the player do not get to affect very much. One of my big pet peeves in visual novels and text adventures is when you get presented with 'false choices' where nothing is available on your list of options that's remotely like what you actually want to say. This game had some fairly egregrious examples of that, particularly being forced to be mean to Rosa and then having the game chide me for my bad attitude in one ending even though, given the option, I would never have said any of those mean things at all. This irritating problem could have been avoided by finding some way to include Mother that didn't require her to be the POV character.  Overall however, these are small issues at the end of the day. This game would be well worth your time at $20 or $30, let alone at the price of totally free. Go check it out.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game. I have been looking for a great story game to play and then I found this and I am so happy about how the story is going so far. c:",
            "review_score": "1"
        },
        {
            "review_text": "This game had me in tears by the end of my playthrough.   It's writing is superb and it sets the tone rather well. Playing as the main character makes you feel emotionally bonded to her and when you suddenly start to realise what your choices impact it really hits home. The art is nice for both background and characters and I simply couldn't ask for anything better....Well...  One thing I could say to be improved on is some form of voice....I'd love it if you could hear the voices of the characters chat along with the great soundtrack to which made me cry reading the words.   Overall rating: 9/10",
            "review_score": "1"
        },
        {
            "review_text": "This game was beautiful and amazingly written, and like no other VN's out there. Plus its free to play. I highly recommend playing it. It is worth the time.",
            "review_score": "1"
        },
        {
            "review_text": "Geez how rude can these people be",
            "review_score": "1"
        },
        {
            "review_text": "Dark... not really what I expected. Not sure what I was expecting.. but it was compelling and done well.",
            "review_score": "1"
        },
        {
            "review_text": "I think it was really interesting and suspenseful :)",
            "review_score": "1"
        },
        {
            "review_text": "Let me give you a solid piece of advice before you even open this game for the very first time - savor every moment. Whatever you do, don't rush through this. Finecomb through every little detail of every new CG, linger on the emotions this game evokes in you (which will be many, they will be constant). This goes way beyond a simple VN, this is artwork, it truly is a masterpiece. There are so many different subjects in this game that I would usually shy away from, or condemn outright. Somehow, this game is so beautifully written that it begins to blur your perceptions of right and wrong and makes you push your boundaries of what is morally acceptable. Every character has it's own story to tell, they stand on their own two feet, with so many facets and layers. The art is unique, and fits the story perfectly. The music will carry you away into this fantasy world and more than once I found myself just pausing to listen to it. I cannot sing enough praises about this game, and my only question is, how can this be free?! Easily one of the best VNs I've ever played, in fact one of the best games I've ever played, and I eagerly look forward to future releases by Fervent.   Now download it, play it ASAP, cry that it's over, and donate to the devs.",
            "review_score": "1"
        },
        {
            "review_text": "Where to start withi this game? Its a gorgeous little gem and I would've happily paid to support it. Lovely old felt story of romance and mystery with plenty of dark twists to it. Its a multi choice Visual Novel of dark fantasy where you take on the role of a young girl and as with all games in such a fashion, your choices decide the outcome of the end. The story is short but to explore every ending and possible achievement needs to be played at least 4-5 times over and each story gave me goosebumps. I really think the creator deserves praise for this, especially offering the game as FREE. Definitely one for your collection if you like dark and gothic tales. Definitely one of the best VNs on Steam",
            "review_score": "1"
        },
        {
            "review_text": "Tears and real understanding of people in different situations.  Beautiful visuals and great writing, I hope to read more soon. Best visuall novel I've read in a very long time. Ending 2 burned so good right in my soul.",
            "review_score": "1"
        },
        {
            "review_text": "This game was really fun. I expected a bit more romance, and the story wasn't what I had visualized, but overall was a very pleasing game to play. The soundtrack was lovely, and the words well written. One thing I would like to add would be that my eyes got a bit tired from reading the text - it would be nice if there was at least a text box so some words don't clash with the visuals.  I really liked the idea of not being a character, but still insfluencing the character through the means of 'mother'. I found that really unique and quite fun. It was a great game, and I'm looking forward to seeing future games from this company~",
            "review_score": "1"
        },
        {
            "review_text": "Not normally a fan of visual novels, but this was free, so I decided to check it out. Glad I did. It's delightfully dark. Not really a huge fan of its more supernatural/magical elements, but the psychological aspect is fascinating and really well put together. I noticed a few typos, but nothing huge. The sound design is pretty awesome and the looping of songs/background effects is pretty much on point.   It's not your typical dumb visual novel, so check it out.",
            "review_score": "1"
        },
        {
            "review_text": "The plot and story line of Cupid is really good. The music is great.",
            "review_score": "1"
        },
        {
            "review_text": "The credits are rolling in the background as I type this. What an honor to experience such a moving, beautiful, and timeless novel. CUPID will take you on a wild ride that you won't be able to look away from, no matter how grotesque it gets. The characters are without a doubt the best and most fleshed out OCs i've ever had the pleasure of knowing. Each character is complex with different layers of imperfections and struggles, but in the end you will love each one. The script for this game was astonishing, every person had their own unique characteristics and way of thinking athat made you believe it was written by more than just two people. Thank you for sharing this story, this might be the first visual novel I actually go back on and try a different route. (I'm a very strict believer in 'the path I choose is the ending i deserve, no way out/no other options/no reversing mistakes)  Pros: +Soundtrack constantly changes to fit each scene, none of the songs are repititive or annoying +Characters are unforgetable +A good amount of choices +Tons of achievements +Art is very unique, matches the universe and story  Cons: -There's a lot to do and a lot to collect and you will not get anywhere near 50% completition on your first playthrough. This is a pro for a lot of people but I loathe replaying games, I enjoy leaving that one lasting impression.",
            "review_score": "1"
        },
        {
            "review_text": "The story is strong, especially when played on mature mode. It was good that there were 2 modes because mature mode was graphic in many ways (I would only reconmend this mode for those 18+ and even then it may still be unsuitable). The story is powerful though, and the graphic images further solidify this idea. The art is beautiful, whether it be graphic or not, and is worth replaying to collect all of them. The music that accompanies is also well crafted and fits with the feelings of the story.  Since I think the mature mode is better than the other mode, I would reconmend this game for people who are 18+ and ready for an intense story.  Overall: A  Edit: I've played this several times and each time is worth it. It's short so getting through it should be no problem.",
            "review_score": "1"
        },
        {
            "review_text": "I really loved this visual novel, one of the best I have ever played and it is free! It is insane! With that said, this game is not for all. It is very dark and gore and contains blood scenes and sex related things. But the story is very well made, I loved it so much. After like 9 months after I still think about it every now and then when I roleplay, the story is so good. Give it a try! And for those who are into it, there is a very slight yuri moment in this game.",
            "review_score": "1"
        }
    ]
}