{
    "app_id": 421810,
    "name": "OH! RPG!",
    "release_date": "2015-12-11",
    "developer": [
        "RosePortal Games"
    ],
    "publisher": [
        "Aldorlea Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie",
        "RPG",
        "Strategy"
    ],
    "tags": [
        "RPGMaker",
        "RPG",
        "Indie"
    ],
    "achievements": 8,
    "positive_ratings": 252,
    "negative_ratings": 82,
    "price": 1.99,
    "description": "Heroes always win! But what happens to those who don't? Play as unique and colorful characters as the world comes to an end after our heroes' utter defeat.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/421810/header.jpg?t=1461774366",
    "minimum_requirements": "OS: Windows XP/Vista/Windows 7/8/8.1/10 (32bit/64bit) Processor: 1.6 GHz Memory: 128 MB RAM Graphics: DirectX 9.0 Compatible DirectX: Version 9.0 Storage: 800 MB available space Sound Card: DirectX 9.0 Compatible Sound",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": " Disclaimer:  A key of the game was given to me by the developer himself, but this doesn't mean that it will reviewed in favor of the developer/publisher.    Insight upon playing the game in a single sitting (will add more contents once I complete the whole game):    Gameplay:  The gameplay of it stays true to the nature of JRPGs. The story starts in a creepy manner, wherein heroes fall to the 'Emperor' and gets obliterated (one of them got literally obliterated). Then as the story progresses, it is followed by well-executed humor.   Graphics:  Downright RPGMaker finish on the graphics. Nothing awfully bad, but nothing awfully good either.   Audio:  The BGMs and the SFX fit in each of the events. Pretty much an average finish.   [NOTE!]  As of the time this review was posted, I had a game breaking bug wherein when I launched the game, the menu screen lags terribly with no inputs being accepted by the game, yet the BGM and the confirmation beeps when the game starts are still there. A PC restart did nothing to solve it, but a full reinstall is the only solution that worked for me. I'm also not sure if this scenario is only on my part, since the computer that this was installed is only of entry-level specification.    Verdict:  7/10 as of now. Would be much higher if this bug will be resolved in the future. Though if I would say, that price point of 3$ is definitely worth it.",
            "review_score": "1"
        },
        {
            "review_text": "I'm really enjoying playing this game . Congratulations to the dev.",
            "review_score": "1"
        },
        {
            "review_text": "First of all think this game is great. It needs no grinding as a good story and gives a new perspective.   But really why can't they get a final boss right.  Up to this guy you could beat every boss and enemy fair and sqare even without using your hero call. But nooooo. They had to take the 'let's make a boss that can only be beaten by sheer luck since he has an instakill move you can't really do anything against'.  I tried to beat him like 50 times and he allways pulled out the instakill attack after a while. I even tried looking it up on the internet but all the tips didn't work so I can't get to the ending.  In short great game but freakingly stupid last boss.",
            "review_score": "1"
        },
        {
            "review_text": "The game have a great story, characters and enemies. Really good game.",
            "review_score": "1"
        },
        {
            "review_text": "What can I say about this game that isn’t in the description? Unique twist indeed! The legendary heroes have failed to stop the evil emperor, and now the whole world feels the aftermath of the end of the world. You play in this RPG maker JRPG style game as minor characters, bit players, even monsters, and chickens, playing out your tiny bit of drama in this setting.  I’ve played quite a few RPG maker titles, and OH! RPG! is a shining gem, worth double the price they are asking for it and one that shouldn’t be passed over. The artwork is spot on, scripting is ingenious, and game play that is executed very well. All in all, you know what you’re getting into when you step into the shoes of OH! RPG! Yet, it’s an enjoyable experience for certain.   The ability to replay chapters adds another layer of depth and replayability, and for the price, I would not pass this one over if you’re looking for a JRPG. Note that I received a free copy of this game in exchange for my honest review. However that being said, the day I recieved the free copy, I had almost bought it anyways, and for the price, wouldn't have regretted that purchase at all.   NOTE - I was given a free copy of this game in exchange for an honest and unbiased review.",
            "review_score": "1"
        },
        {
            "review_text": "A breath of fresh air from the recent onslaught of poorly made RPGMaker games from Steam. The combat system is very well designed although I find that the gameplay does get repetitive at times. It is also one of the most beautiful RPGMaker games I have ever seen. You can clearly see that the developer was intending to take full advantage of the MVEngine, becuase there's effects everywhere. Expect lag because of this, though. OH RPG offers a story told in different perspectives and ways which comes together well. If this is on sale, buy it! Its worth it if you like RPG and unqiue, innovative games.",
            "review_score": "1"
        },
        {
            "review_text": "This game really blew my mind away, from its compleing story line to the rich and beautifully created landscapes.. I cant tell you what a refreshing look and feel this game has, its full of heart, its full of adventures.. you have to appreciate all the hard work that was put into this game because it really shows! I honestly just cant get enough, and I LOVE the wolf fluffy... he is my main man throughout my journey... well untill he leaves then Ill be sad :*( . I often dont find enjoyment in many things in life but this game really got me hooked... cant say for the worst ethier :D, Please dont make a mistake in passing up on this wonderfully designed game... its a game that combines all the excitment that only dreams are made of!   Live the life, Live the dream... and become a hero in a land of relentless chaos and destruction.. do have what it takes to save the world, or will you let darkness consume the light forever? Gripping on the edge of your seat fun... really cant say anything bad about it because through my gameplay its been great! my lack of sleep will tell my tale for me, but for now just buy this and stop listening to me rant,... its so freaking good that I almost missed my work :D",
            "review_score": "1"
        },
        {
            "review_text": "A good Rpg Maker for Jrpg lovers.  + Interesting, different battle system. + Cheap + Item upgrade system + Good Boss Battles + New features for replay value  - No lore in game explaining the past (might be a future prologue game) - The music in some battles is off (music must fit the scenes and battle, personal opinion of course) - Game is short in its main story (excluding the replay with new features) - Title selected only for marketing, hate it in books and in games",
            "review_score": "1"
        },
        {
            "review_text": "I really loved a lot about this game, The characters, art, scenarios, and unique story made it stand out from a lot of other rpg maker rpgs. The only thing that bugged me was the 'stage select' nature of the game which made it hard to feel like i was accomplishing something, especially since factors like levels and items don't carry over and that 'stages' can be redone.   I highly recomend it if the 'stage select' feature doesn't bother you like it did for me",
            "review_score": "1"
        },
        {
            "review_text": "This game has very nice pixel graphics, and never neat small adjustments like upgrading healing items and clicking instead of WASD.  Although sometimes framerate is low, and may crash frequent autosaves doesn't make that a problem.  With an unlikely cast of heroes and a low price Oh! RPG! is a game for any RPG Player",
            "review_score": "1"
        },
        {
            "review_text": "Disclaimer: I was provided with an extra pre-release key from a friend. I am posting a review based on my own opinion.  OH! RPG! is a good short RPG game like the classic ones from 90s console games. It's enjoyable short game. The battles are tricky as you have limited recovery items and limited abilities to use. Depending on how well you perform affects the score you receive after the end of the chapter to unlock additional abilities.  It does have some challenging puzzles as you reach midway into the game that took a while to figure out how to solve them. The game doesn't have random battles grind. Overall it's enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "Seems like a fun little RPG. But sadly I cant play for more than 15 mins without it crashing ... :( I will not rate it down cause this is probly a steam issue.  Looking to test some of these games if anyone in need of an Honest Gamer who as played countless hours and looking to play even more video games ~ thx",
            "review_score": "1"
        },
        {
            "review_text": "I cannot get pass the second battle because the game freezes and crashes after the monster is slain. Probably poor programming, or a plugin fault, or both. Please Dev if you do read this can you look into this? Thanks. I will change this review once it is fixed.",
            "review_score": "-1"
        },
        {
            "review_text": "I have a problem. Why can not fight all the characters together? simply can not be determined because when the boss phonyx less life change constantly heal itself. so please do something because this is a great suffering. There is nothing enjoying the game",
            "review_score": "1"
        },
        {
            "review_text": "I like it! If you like rpg, you must play this game!",
            "review_score": "1"
        },
        {
            "review_text": "Great game! It has a beautifull graphic and nice art. The mechanic of this game was great.  OH! Don't forget this is RPG!",
            "review_score": "1"
        },
        {
            "review_text": "There you are. The final boss in the adventure, and the destiny of the realm rests in your ability to vanquish him. But unfortunately you fail and the world is going to get destroyed. Now you have to escape him and make it in time to watch the end of the world with your loved ones.  That´s the starting point of this adventure. You have to help the jer.. heores get back to their homes and loved ones using the help of NPCs, quite different ones depending on the stage you are in. Some of them include a goblin, an old lady or a nun, to name a few.  These stages have a strong strategy component. Your characters start with a predetermined level and have to beat  mostly all enemies during the stage, along with the smart use of the Hero calls during fights, to be able to get a chance to finish the stage boss and get a good rank (if you aren´t playing on easy mode, that is).  Which brings us to the User Ranks. This feature activates at the end of the stage and gives you a certain amount of points depending on difficulty, exp and gold earned. These ranks unlock certain helps and extras that makes the game easier and replayable, like the 'don Miguel' and Mapping Tools, that makes you revisit stages to find secrets that you couldn´t unlock the first time you played those stages.  All in all, a great, funny game that may be not that long (it´s, in words of the developers, 4 hours long), but with a great replay value. By the time i´m writing this review, i´ve clocked 18 hours and i´ve yet to unlock all the little secrets this game has to offer. Very recommended.",
            "review_score": "1"
        },
        {
            "review_text": "This game is too buggy. Half way through the game, healing and mana recovery potions stoped working.",
            "review_score": "-1"
        },
        {
            "review_text": "OH! RPG! is fun, while also having moments of being irratating, not from being bad, but from me having to change my playing habits from hoarding things till later to using them appropriately and sooner. You don't get to keep what you don't use as it is chapter based and you alternate who you play. I especially enjoy the quirk of the story being about what would happen if the heroes failed and how that has panned out for as far as I have gotten.",
            "review_score": "1"
        },
        {
            "review_text": "Goblin General ripped me a new one a thousands of times. 10/10 would play again.",
            "review_score": "1"
        },
        {
            "review_text": "Frame rate never worked properly for me.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is amazing! cured my aids!!            10/10 ~IGN",
            "review_score": "1"
        },
        {
            "review_text": "I just have 4 words for this game: This game is awesome",
            "review_score": "1"
        },
        {
            "review_text": "W-wait, that's it? 7 Hours only. whew.  A bit too modern dialogues for an RPG setting but the premise was a weird 'original' one with the game starting at the climax of the story and then slowling reaching the bitter conclusion. Also don't play with the heroes, which is kinda weird for an RPG, but the ways the fighting system works in each chapter and how different it is made the game pretty entertaining. For its price.",
            "review_score": "1"
        },
        {
            "review_text": "Its good but good but with a few problems (like oneshot in fights and a not perfect upgradesystem for weapons)",
            "review_score": "1"
        }
    ]
}