{
    "app_id": 422100,
    "name": "Heaven Island Life",
    "release_date": "2016-04-21",
    "developer": [
        "Fabio Ferrara"
    ],
    "publisher": [
        "Chubby Pixel"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Indie",
        "Simulation",
        "VR"
    ],
    "achievements": 0,
    "positive_ratings": 362,
    "negative_ratings": 316,
    "price": 0.79,
    "description": "&quot;Heaven Island VIVE&quot; is an experience designed for the HTC Vive in which you'll explore wonderful places. The inspiration for the environments comes from the book &quot;Origins of Architectural Pleasure&quot; in which the welfare is of primary importance. The game requires the HTC Vive device.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/422100/header.jpg?t=1461832308",
    "minimum_requirements": "OS: Windows 7 SP1, Windows 8.1 or later, Windows 10 Processor: CPU: Intel i5-4590, AMD FX 8350 equivalent or better Memory: 4 GB RAM Graphics: Nvidia GeForce GTX 970, AMD Radeon R9 290 equivalent or better Storage: 400 MB available space Additional Notes: Vive ONLY!",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I tried this game twice, once yesterday and again today. Yesterday, the game decided one of my lighthouse stations was a controller. This meant I only had access to one controller, and it wasn't the one that would allow me to teleport, so I was stuck in one place.  Tried it again today, still only had one controller, but at least I could teleport this time. What I found while moving around was quite a disappointment. Items in the world (like buildings and trees) wouldn't appear until I got close to them, within about 10-15 meters.  Furthermore, I could teleport inside of anything; huge rocks, a bridge, that giant Buddha statue, nothing was solid aside from the ground. I teleported inside of things several times since I couldn't even see them from a distance. Also I'm leaving a trail of rocks everywhere I go, because for some reason the controls to teleport are the same as creating a rock where your controller is located. This eventually started to lag the game as well.  All in all, this game is poorly made, and it's certainly not even worth it with 20% off of $0.99. This is something that's only worth getting if it was free, unless the developer put in a lot more work to make it polished.",
            "review_score": "-1"
        },
        {
            "review_text": "Apparently, the only reason anyone is giving this game positive reviews is because you get some steam cards... and then they say uninstall because it's garbage. Stupid reason to give a terrible piece of garbage of a game a good review. Don't waste your money on this. Go buy a soda instead.",
            "review_score": "-1"
        },
        {
            "review_text": "Ok so I got this and the MMO verdion, both for free, and decided to try it. So they are pretty similar, with the diference that aparently one of them has multiplayer option and the other doesn't.  Well when you enter the game already opens with a 3d sandy beach scene, a place that should be nice but...the graphics are not that good. I mean I played quite a lot of games that were much more focused on gameplay than graphics but still had better graphics. And those ranged from RPGs to plataformers (yes I've seen a few plataformers with much better graphics). Also this is not exactly a game: it's more like just a scenery you can walk around in. There is no gameplay at all, you just have this 'relaxing place' and you walk around... Even getting it for free I feel like it was not worth it.",
            "review_score": "-1"
        },
        {
            "review_text": "  no, thanks",
            "review_score": "-1"
        },
        {
            "review_text": "  No, it's a crap.",
            "review_score": "-1"
        },
        {
            "review_text": "  #LittleLycanOnSteam",
            "review_score": "1"
        },
        {
            "review_text": "this game so bad I only open the game and I stat to cry",
            "review_score": "-1"
        },
        {
            "review_text": "nice game , it deserves a try !",
            "review_score": "1"
        },
        {
            "review_text": "free",
            "review_score": "1"
        },
        {
            "review_text": "Better than cod, even if crashes without vr",
            "review_score": "1"
        },
        {
            "review_text": "Charming and relaxing game, I can make friends with all the animals on the island! :)",
            "review_score": "1"
        }
    ]
}