{
    "app_id": 42210,
    "name": "Nancy Drew®: Secrets Can Kill REMASTERED",
    "release_date": "2011-07-25",
    "developer": [
        "HeR Interactive"
    ],
    "publisher": [
        "HeR Interactive"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "Point & Click",
        "Mystery"
    ],
    "achievements": 0,
    "positive_ratings": 48,
    "negative_ratings": 23,
    "price": 5.19,
    "description": "Play the Game that Started the Award-Winning Series!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/42210/header.jpg?t=1489514764",
    "minimum_requirements": "OS: Windows® XP/Vista/7 Processor: 1GHz CPU Memory: 256MB RAM Graphics: 32-bit DirectX 9.0 compatible video card DirectX®: 9.0 or Higher Hard Drive: 1GB hard drive space Sound: 16-bit DirectX compatible sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": " 'Do act mysterious. It always keeps them coming back for more.' - Carolyn Keene   I remember reading Nancy Drew books starting with age 10, alongside classical juvenile mystery series like  The Hardy Boys  which will later encourage me to read  The Knickerbocker Gang  by Thomas Brezina, and eventually actual mystery classics like Arthur Conan Doyle, Agatha Christie, Gaston Leroux, Maurice Leblanc and countless others. But Nancy Drew will always hold a special place for me as the one cheesy, meticulous, smart alec; the lady sleuth who introduced me to the world of detective fictions as a childhood memory that I'm very fond of.  For the unfamiliar, Nancy Drew is a girl sleuth of age 18 who likes to poke her nose in mysteries all around. Here in this particular adventure, she is called in to solve a murder that occurred in a high school. A local detective contacted her to offer an undercover position as a student to gather information within the high school and solve the murder if possible. Already experienced in mysteries of the world, Nancy accepts. She is to snoop around the local high school, interrogate other students and collect clues to shed some light into the brutal affair.   Secrets Can Kill  is the first instalment of Nancy Drew game series developed by Her Interactive in 1998, which is remastered in 2010. Here, we have the remastered version of the original with its ups and downs. The graphics are definitely better - with a heavy uplift on character animation especially - and countless references to other games scattered around. Voice acting in these series has never been great, but considering this is actually the first in the series one should expect the cheesiest possible. My main complaint is that an already short yet enjoyable game has been cut shorter with some dialogues omitted and puzzles skipped as a tradition of 'remastering' old games here too. Still, this wasn't enough to crumble the game down. In its essence, as any and all Nancy Drew games, this one is fun.  This is an old school adventuring game which sincerely doesn't hold hands with the player even with the easier mode. There are clues and references scattered all around, and if you plan to actually solve this thing yourself, - without a walkthrough - you'd better keep a pen and some paper around to do old school detective work yourself. You'll need your notes to solve puzzles and get a meaning out of scattered riddles. None of the puzzles or clues are actually hard, but it takes attention and some memory. On that manner, this game is an enjoyable brain scratcher.  Sadly, 2nd to 6th in the game series have never been remastered, and are quite old to be digitalized, thus they cannot be found in the Steam Store. If you are curious about these earlier games, your best chance of acquiring them seems like being lucky enough to stumble on a retail copy. I'll go fetch myself a decent youtube playthrough to watch them as a worst case scenario, 'cause this underappreciated, charming adventure series do deserve your time. Nothing magnificent or majestic - even a bit lame on the Scooby Doo caliber - but  Nancy Drew: Secrets Can Kill  is an enjoyable pass time for an evening for the mystery lovers who'd appreciate some basic old school challenge.  Please also check out Lady Storyteller's Curator page  here  - follow for regular updates on reviews for other games!",
            "review_score": "1"
        },
        {
            "review_text": "Well... The game itself I kinda liked (meh, definately a weaker game). Hardly any puzzles, not much to snoop in.....However I can not empahsize how SHORT it is. Usually these games take me 7-10 hours WITHOUT hints or a walkthrough so I can play here and there through a week or so. This game took me barely over 3 hours!!! The entire game was centralized around one main idea that kept giving you 'direction'... I could not believe how fast it went even on Senior level. When it got to the end I was thinking, 'you are kidding me right?? It cannot be over this fast!? I haven't even done much of anything!?' Really glad I got it for a discounted price for the amount of game play I got from it. Overall I give the game idea/itself a 6/10. The length of it definately a 3/10.   Of course though if you are one of those people (like me) who just has to play ALL of them, then do what you have to. If you are more of a first timer or are just going to play a few, do not pick this one.",
            "review_score": "1"
        },
        {
            "review_text": "I guess I'm spoiled with the newer games, but this seemed lame.",
            "review_score": "-1"
        },
        {
            "review_text": "Well, this is not a review as the game doesn't load for me in yosemite and I see after reading the forum, that this is a common issue ?! I don't know if I'm doing something wrong, but it would have been nice if that would have been solved before selling the game. ",
            "review_score": "-1"
        },
        {
            "review_text": "I absolutely love this game!! Every Nancy Drew game is amazing!",
            "review_score": "1"
        }
    ]
}