{
    "app_id": 42220,
    "name": "Nancy Drew®: The Captive Curse",
    "release_date": "2011-07-25",
    "developer": [
        "HeR Interactive"
    ],
    "publisher": [
        "HeR Interactive"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "Point & Click",
        "Mystery"
    ],
    "achievements": 0,
    "positive_ratings": 48,
    "negative_ratings": 8,
    "price": 5.19,
    "description": "A terrifying myth comes alive in Germany!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/42220/header.jpg?t=1490217425",
    "minimum_requirements": "OS: Windows® XP/Vista/7 Processor: 1.5 GHZ or greater Pentium 4 or equivalent class CPU  Memory: 512MB of RAM Graphics: 64 MB DirectX 9.0 compatible video card  DirectX®: 9.0 Hard Drive: 2 GB or more hard drive space Sound: 16 bit DirectX compatible sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I am a big fan of the Nancy Drew games, I have played almost half of them. The Captive Curse was good, the only problem I had with it was it had a little too many puzzles. I like puzzles, but not if you have to do one every 2 minutes. Also, it was very long and tiring, with a lot of hopelessly wandering around. Overall I would say a 7/10. Good game!",
            "review_score": "1"
        },
        {
            "review_text": "8/10",
            "review_score": "1"
        },
        {
            "review_text": "I've played almost every Nancy Drew game. This one was extremely average. Some of the characters were fun, but some of the voice acting was very off. The puzzles were okay.  This was one of those games where it's very hard to know what to do next half of the time. In the better Nancy Drew games, the plot flows and you'll have a pretty good idea of what to do next. This was simply not one of the better ones. That being said, I expected it to be much worse than it was. It was decent. The story was fun and like I mentioned earlier, it had some solid characters.  I just bought this games because I didn't have it, and it was the only cheaper one one Steam that I hadn't played. It satisfied my craving but if you're new to Nancy Drew and want one of the better ones, look elsewhere. I'd personally suggest The Curse of Blackmoore Manor, Shadow at Waters Edge, or Ghost of Thorton Hall.",
            "review_score": "1"
        },
        {
            "review_text": "Nancy Drew is back! This case involves history, and delves deep into the background of the characters. Unfortunately, as far as these games go, there is less action because of this. Dialogue is important, but at least you aren't stuck playing games over and over again unless you want to. This case was not my least favorite, but not my favorite.",
            "review_score": "1"
        }
    ]
}