{
    "app_id": 422630,
    "name": "Metaverse Construction Kit",
    "release_date": "2015-12-06",
    "developer": [
        "Metaware"
    ],
    "publisher": [
        "Metaware"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "VR Support",
        "Steam Workshop",
        "Partial Controller Support",
        "Includes level editor"
    ],
    "genres": [
        "Casual",
        "Free to Play",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Free to Play",
        "Sandbox",
        "Building"
    ],
    "achievements": 0,
    "positive_ratings": 158,
    "negative_ratings": 80,
    "price": 0.0,
    "description": "The Metaverse Construction Kit is a virtual environment to construct your own 3D creations. Use the twenty-four structural elements to define your structures and then style your creations with sixty-four material types like organics, metals, minerals, and composites. Then Publish!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/422630/header.jpg?t=1455822340",
    "minimum_requirements": "OS: Windows 7, Windows 8, Windows 10 Processor: Intel Core 2 Duo, AMD Athlon X2, or equal at 2.0 GHz Memory: 2 GB RAM Graphics: DirectX 9.0c-compatible, SM 3.0-compatible, 256MB VRAM DirectX: Version 9.0c Storage: 2 GB available space Sound Card: DirectX 9.0c-compatible, 16-bit Additional Notes: For VR: GTX 680 or better",
    "recommended_requirements": "OS: Windows 8, Windows 10 Processor: QuadCore 2.0 GHz + Memory: 4 GB RAM Graphics: DirectX 9.0c-compatible, SM 3.0-compatible, 512MB VRAM+; NVIDIA GeForce 8800 GTS or better DirectX: Version 11 Network: Broadband Internet connection Storage: 8 GB available space Sound Card: DirectX 9.0c-compatible, 16-bit Additional Notes: For VR: GTX 970 or better",
    "reviews": [
        {
            "review_text": "i'm a teen that is home school and i'm trying to learn animation and 3D modeling and this a great engine to start learning that stuff i love this",
            "review_score": "1"
        },
        {
            "review_text": "After a recent update, I’ve decided to change my mind. Graphics are amazing, best graphics in a sandbox game I’ve ever seen. Lots of different shapes of 'blocks' to use allowing unique designs. Placing blocks is a bit annoying and could use some work. The menu is very easy to navigate. Tons of textures to use, from plastic to obsidian. I’ll give this game 8/10 for being as good as it is in early access.",
            "review_score": "1"
        },
        {
            "review_text": "this was great i liked it its easy to use for the basic to advanced game developer.",
            "review_score": "1"
        },
        {
            "review_text": "I would DEFINETLY recommend thiis game to anyone who likes to build. A bit difficult to control though.",
            "review_score": "1"
        },
        {
            "review_text": "I can see Great possebilities for the game, and this is what I've been looking for, for a looong time!  As for now, it has a lot of bugs and the mechanics are not the greatest.   I've still been playing around a little and had my share of fun!   Exited to see what the develpoers bring to the game.",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant way to be creative and to kill a lot of time",
            "review_score": "1"
        },
        {
            "review_text": "good and bad    good there seems to be a decent ammount of things you can do building wise and material wise   bad .... randomy cant figure out how to turn objects around no matter what i press and the  grid is a bit fuzzy but all the objects are hd   id reccomd this game it just takes a while to get round how to use controlls and stuff",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good game it have pretty good graphics metods of construcction music and the better of all all you can do with youre imagination this make it real i love this game   The only bad thing about it its that if you dont have imagination or expectatives to bouild something youll hate it but i thing no one will i hope that &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "I prefer sketch up way more.",
            "review_score": "-1"
        },
        {
            "review_text": "it is completely pointless to get",
            "review_score": "-1"
        },
        {
            "review_text": "THIS SUCKS THE SENITEVTY IS VERY OFF AND ONLY LITTLE THINGS TO USE. I USE THISE GAME TO WIPE MY ♥♥♥ ALL THE TIME",
            "review_score": "-1"
        },
        {
            "review_text": ":[. Woudn't even work on my computer. -1/10",
            "review_score": "-1"
        }
    ]
}