{
    "app_id": 422650,
    "name": "Megamagic: Wizards of the Neon Age",
    "release_date": "2016-04-20",
    "developer": [
        "BeautiFun Games"
    ],
    "publisher": [
        "BeautiFun Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Co-op",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie",
        "RPG",
        "Strategy"
    ],
    "tags": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "achievements": 41,
    "positive_ratings": 65,
    "negative_ratings": 17,
    "price": 7.19,
    "description": "Prepare to delve into a fascinating world where the forces of technology and magic are embroiled in a vicious struggle! Blurring the lines between the RPG and strategy genres, Megamagic recaptures the unmistakable flavour of the 80s in a game magnified by the incredible music by Mitch Murder.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/422650/header.jpg?t=1464856419",
    "minimum_requirements": "OS: Windows XP/Vista/7/8/10 Processor: Intel Core 2 Duo 2GHz (or similar) Memory: 2 GB RAM Graphics: Intel HD Graphics 4400 DirectX: Version 9.0 Storage: 3 GB available space",
    "recommended_requirements": "OS: Windows 7/8/10 Processor: Inte Core i3 (or similar) Memory: 4 GB RAM Graphics: GeForce GTX 650 (or similar) DirectX: Version 11 Storage: 3 GB available space",
    "reviews": [
        {
            "review_text": "   Want a fun Action RPG with a fun game play that rocks to the vibe of the 1980s? Look no further as Megamagic: Wizards of the Neon Age is what you need.      Game Overview  ",
            "review_score": "1"
        },
        {
            "review_text": "Just finished this game, it was pretty fun? Really, really enjoyed the art, and the story line was good, the dialogue was all really funny at times. It had a really cool game design where as you progress, you learn new spells and some other spells become obsolete, so you're kind of always changing exactly how you play the game. (I noticed some people mentioned this as a bad thing in their reviews, I guess it's just personal preference but I really liked it). Overall, I did like the game, there were definitely a few things that let it down though. There were a few bugs, with really crazy spawn rates in some areas, enemies not attacking, the AI of the grims was a bit out of whack sometimes, and sometimes if you haven't added a certain spell before a fight, it can make the boss almost impossible to beat    (e.g. Hogan &amp; the last boss. I spent like 20 minutes trying to beat Hogan and getting him barely down to half health)    so you might have to reload the game from an earlier point and then do some things all over again. The game also crashed my laptop when I first tried to load it (not sure what that was about).      Also, major spoiler, but i was confused why Fum sacrificed himself to bring back Deimon, when he could have at least sacrificed himself to bring back... everyone that Merklyn had killed? If the magic was supposed to be that strong? Or at least the uncle guy from the beginning too. Something like that. Just thought it was a little weird, not exactly where I would have gone with the plot     BUT, overall, cool game! :^) Definitely would play a sequel if they make one (hoping they do)",
            "review_score": "1"
        },
        {
            "review_text": "Great game, love the scripting and how the story is set up in general. Took a little while to get adjusted to the battle system ur screwed stuck at 2 summons, 3 is where the fun starts. 80s magic and zombies for the win. Got into the Chapter 6 and it starts gliching, plz fix.",
            "review_score": "1"
        },
        {
            "review_text": "The presentation isn't amazing, and it definitely isn't enough to save the game from its huge gameplay flaws.  You deal so little damage with your basic attack that you run out of mana trying to kill anything. Then, you have to wait for your horrible mana regen to kick in. You spend a disproportionate amount of time waiting for your mana regen as you watch your summons slowly auto attack enemies to death. Its a shame that casting spells in a game about casting spells is so incredibly weak.",
            "review_score": "-1"
        }
    ]
}