{
    "app_id": 4230,
    "name": "RACE - The WTCC Game",
    "release_date": "2006-11-24",
    "developer": [
        "SimBin"
    ],
    "publisher": [
        "SimBin"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player"
    ],
    "genres": [
        "Racing"
    ],
    "tags": [
        "Racing",
        "Simulation"
    ],
    "achievements": 0,
    "positive_ratings": 119,
    "negative_ratings": 43,
    "price": 25.99,
    "description": "The Official WTCC Game | RACE is the first ever game to be focused on the hard hitting, intense action of the exciting WTCC championship which is exploding in popularity all over the world. Based on WTCC, one of only three official FIA world championships next to Formula 1 and WRC, RACE features the complete WTCC championship season of...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/4230/header.jpg?t=1478078220",
    "minimum_requirements": "Minimum Microsoft Windows XP Home/Pro, 1.7 GHz Intel Pentium 4 or 100% compatible Processor, 512 MB RAM, 2.5 GB free space, DirectX 9 compatible graphics card with 128 MB memory, DirectX 9 compatible Sound Card, Keyboard and Mouse, DirectX Version 9 Recommended3 GHz Intel Pentium IV or 100% compatible Processor, 1 GB RAM, DirectX 9 compatible graphics card with 256 MB memory, DirectX 9 compatible force feedback steering wheel  Graphic Cards not supported: NVIDIA GeForce 3/4 cards ATI Radeon 8500/9000/9200 Intel Motherboard mounted chipsets",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Pros=good 1)great value. 2)handles well didnt have any problems 4)for an old game it has good graphics  5)game lets you move car off starting like before others but black flags you  Cons=bad 1) it gets jumpy when car reaches max speed (wished it showly went up in speed instead) not enought cars or tracks.Even with DLC 2)not realistic damage cant lose any car parts.",
            "review_score": "1"
        },
        {
            "review_text": "Suprisingly a great game, pretty realistic but changing gears takes a bit of getting used to",
            "review_score": "1"
        },
        {
            "review_text": "I bought this games a long time ago, for the price its okay I don't play it but its defenetley one of the better racing games on the pc :)",
            "review_score": "1"
        },
        {
            "review_text": "I've had this game a while and it is really enjoyable, especially with the Caterham Expansion pack, but there is a problem - since Windows upgraded itself to Windows 10 on my computer Race WTCC just wont start up anymore - the settings dialgue comes up but the game won't run. Oh dear - someone do something for us addicts please!",
            "review_score": "-1"
        },
        {
            "review_text": "Horrible Physics, Horrible Graphics, Horrible Everything. Nothing more needs to be said.",
            "review_score": "-1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        }
    ]
}