{
    "app_id": 423220,
    "name": "T-Kara Puzzles",
    "release_date": "2016-06-01",
    "developer": [
        "Mexond"
    ],
    "publisher": [
        "Mexond"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards",
        "Steam Turn Notifications"
    ],
    "genres": [
        "Casual",
        "Indie"
    ],
    "tags": [
        "Casual",
        "Indie",
        "Puzzle"
    ],
    "achievements": 15,
    "positive_ratings": 20,
    "negative_ratings": 2,
    "price": 3.99,
    "description": "Unique match-4 puzzle game, filled with fun variations and exciting challenges!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/423220/header.jpg?t=1467645455",
    "minimum_requirements": "OS: Windows Vista Processor: 1.7 GHz Dual Core or Greater Memory: 2 GB RAM Graphics: 512 MB DirectX 9.0c compatible graphics card (shader model 2) DirectX: Version 9.0c Storage: 500 MB available space Sound Card: DirectX 9.0c compatible",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "  GENERAL INFO: Game Name: T-Kara Puzzles Developer: Mexond Genre: Puzzle, Indie, Casual Features: Single Player and Online Coop Mode,Achievements,Trading Cards Release Date: 01/06/16  OVERVIEW In T-kara Puzzles we have a unique game,it's a match four. We have various modes like the campaign,score mode and picture puzzle. Campaign is where you find the real challenges and advance into the game's puzzles. Score Mode,like the name says,you are fighting for the best score. and picture puzzle is where you play making pictures,is also hard too. Graphics are simple,but beautiful and enough to run in most pc's. Also the game is really cheap, for his content, that can grant many time of gameplay. ----------------------------------- PROS &amp; CONS  Pros: Funny Indie platformer with a big variety of modes and levels. Polished Graphics. Really Small,and most of the machines can handle it. Extremely addictive,we can use a couple of hours to beat the game. Good Sound Effects.  Cons: - Not at all. -----------------------------------  SUMMARY &amp; FINAL RATING A game for people that like simple and funny casual puzzles games with variety of modes and no boring gameplay.  This review is writed by Gianvelox. Ps: This review is writed originally in 03/06/2016,but because of some problems, it was published today. To the developers, my sincere apologies.",
            "review_score": "1"
        }
    ]
}