{
    "app_id": 423440,
    "name": "Choice of Kung Fu",
    "release_date": "2015-12-11",
    "developer": [
        "Choice of Games"
    ],
    "publisher": [
        "Choice of Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Captions available",
        "Steam Cloud"
    ],
    "genres": [
        "Indie",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Indie",
        "Text-Based"
    ],
    "achievements": 25,
    "positive_ratings": 35,
    "negative_ratings": 2,
    "price": 3.99,
    "description": "Become the world's greatest kung-fu fighter or find true enlightenment in this interactive fantasy novel. What question will you ask the Dragon Sage?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/423440/header.jpg?t=1538621587",
    "minimum_requirements": "OS: Windows 7",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This game is AMAZING! It allows the user to alter the storyline and choose their fate, this is also really good as it gives the audience a chance to choose gender (so the target demographic is bigger doing this and equal).I like this game as it shows stats showing how you're doing this is very good and vital for the game as the choices you make decides on the person you are and if you're really worthy as a monk and a teacher but the question is are you going to choose to be good or bad? ;)",
            "review_score": "1"
        },
        {
            "review_text": "Would highly recomend. Amazing FPS, I believe better than any of the chivalry games. Controls are very smooth and has a great story. I have tried for a whole 7 minutes to get all the achievments but I cant. It's a nice break from easy games like ratsnorp and that barbie game where you rescue puppies. Scream For My IceCream, Tell me all you're dirty dreams. Scream For My IceCream, Show me what's your fantasies. [X2]  Let's Get this party started Drink Til we get ♥♥♥♥♥♥♥♥  She licked me like I'm Ice Cream...  She's melting  What the ♥♥♥♥? You know that we do it rough Move your feet To the beat With this ♥♥♥♥ This song's complete Move your body super sweet Always like an ice cream treat  Got a montser in my pants, And if I ever get the chance, Gonna cram it down your throat, Watch you gasp for air and choke. I'm gonna ♥♥♥♥ all in you're face! I'm gonna wreck this ♥♥♥♥in' place! Pull my hair, Smash the chair, Break the bed, And give me head!  Scream For My IceCream, Tell me all you're dirty dreams. Scream For My IceCream, Show me what's you're fantasies. [X2] Sorry I get a little faggy sometimes. Any way, Pros: -Story -Controls -Blood on The Dance Floor -FPS -♥♥♥♥ Cons: -The game allows you to be ♥♥♥♥ like: Bi, Gay, and people who dont like anyone? -No storm troopers -I have a runny nose ",
            "review_score": "1"
        },
        {
            "review_text": "I decided to purchase this game after I was pleasantly surprised by Choice of Robots. While I find myself enjoying that game more, this was an engrossing story that kept me entertained and caused me to go through the entire story in one sitting. Please note that this is more like a choose your own adventure book just presented in digital form (and with far more options that those books ever provided). It is not even a visual novel, it is simply words on a page and the choices you get to make, with a series of stats behind the scenes that dictate the flow of the story and options available to you as well. If you can find yourself engrossed in a tale like this without pictures to go with it or if you enjoy discover and text adventures like the incredible Analogue: A Hate Story I'm sure that you will enjoy this as well.",
            "review_score": "1"
        }
    ]
}