{
    "app_id": 423650,
    "name": "Summer Fling",
    "release_date": "2016-06-16",
    "developer": [
        "Straywire"
    ],
    "publisher": [
        "Dharker Studio"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Casual",
        "Indie"
    ],
    "tags": [
        "Nudity",
        "Sexual Content",
        "Visual Novel"
    ],
    "achievements": 7,
    "positive_ratings": 50,
    "negative_ratings": 28,
    "price": 7.19,
    "description": "You are entering your summer break before university begins. And what better way to spend a summer break than at the lake with two friends, will the summer become an unforgettable time or will it just fade away. Welcome to your Summer Fling.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/423650/header.jpg?t=1545573451",
    "minimum_requirements": "OS: Windows XP Processor: 1.66 Ghz Memory: 500 MB RAM Graphics: DirectX compatible card Storage: 1 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "WTF!? the official site lists 'Professional Voice-acting', but there is NO voice-acting in the game at all !?",
            "review_score": "-1"
        },
        {
            "review_text": "Buy it, Patch it, Enjoy.  Short, sweet dating sim. If your getting this for the story, just don't. Without the uncensored patch, and wanting to see some H-scenes I don't recommend getting this. It is quite short for a Dharker Studios game, with a lack of characters, but what was there was good. I enjoy Dharker studio games so I knew what I was getting into, and this one was... okay. I don't think this was there best, I expected more from Dharker Studios, but while waiting for there bigger releases later this was fine. I recommend getting it on sale though because it's pretty short.",
            "review_score": "1"
        }
    ]
}