{
    "app_id": 423760,
    "name": "Hit Tank PRO",
    "release_date": "2015-12-02",
    "developer": [
        "Bacq Stellan"
    ],
    "publisher": [
        "OtakuMaker.com"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Casual",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Casual",
        "Action",
        "Indie"
    ],
    "achievements": 0,
    "positive_ratings": 69,
    "negative_ratings": 43,
    "price": 1.99,
    "description": "Hit Tank PRO is an addictive game of fast action that combines Strategy, Action and Challenge.Ready to take on the fight? Complete your mission while fighting cunning enemies in unique environments!.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/423760/header.jpg?t=1484418419",
    "minimum_requirements": "OS: WINDOWS XP / WINDOWS VISTA / WINDOWS 7 / WINDOWS 8 / WINDOWS 10 Memory: 512 Mo MB RAM Storage: 60 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Hit Tank PRO reminds of an old game, whose name I can't remember, where you're a tank pitched against others. You have the same core mechanics here. And thanks to Bechstein, I found the name: Battle City.  You're directing a tank through different levels and your goal is to destroy every enemy present. Some of them are stationary and slow to fire, while others are moving and sending many rockets towards you. You get hit? You're trying the level again with all enemies spawning again. Depending on the difficulty, you will have less lives to do.  8 minutes is short to write a review. However, when you've played some levels, you know already how the game will be. The graphics are correct and the soundtrack is just a jingle and tanks sounds.  The game is itself a nice little one when you want to take a little break. However, my main problem is the menu in the Missions mode. Indeed, while it's great to have included the three different types of moving (arrows, WASD and ZQSD), while it's great to choose for each level your difficulty, some options, your speed or the hit box, the problem is that when you're pointing your cursor on the keys options, speed or hitbox, you can change the options you have set. And when you're think that ZQSD is chosen and that in reality, you have the arrows.... I mean, it would be great that at least, the choice of ZQSD, WASD or arrows is on another menu and not on the one where you're setting your preferences for the level. Also, when you finish a level, instead of advancing to the next one, you're sent back to the menu (which is normal if you want to change the difficulty or anything else) and if you don't click yourself on 'Next', you're going to play the level you've beaten again.  However, the Mode Pro/Challenge is changing that way: you set your configuration, your number of life (Pro), level and difficulty and you'll be passing from a level to another without being sent to the menu.  Because of the menu in Missions, I'm not quite satisfied - it should have a description of each mode - I would have gone directly to the Mode Pro instead of Missions. In itself, it's a good challenging game though. And here's a challenge: if you're on orly, you can write a review of 50 characters instead of copy/pasting official description or reviews from others. If you can't do it but resort to copy/paste what isn't your work, I've been on a rampage to report you. I'm not taking my time to share my experience with others for your greed.",
            "review_score": "1"
        },
        {
            "review_text": "Simple and Fun mini game Is a Mixed style between Battle City and Gorillas, but rapid and well developed You will drop a lot of cannonballs for defeat the enemies. Have a lot of scenarios, modes, levels, and difficulties.  Is the kind of game that let you expend some minutes when you have not a lot of free time for open AAA games! You open it and you will be playing, just this.",
            "review_score": "1"
        },
        {
            "review_text": "This game bring to me memory of an old game for the NES. Battle City , i love that game as a child and Hit Tank Pro is a good game to play if you feel nostalgic. The game is about you moving and shooting with a tank to destroy anothers tank , it has action and strategy but still is easy to play so everybody can enjoy it.",
            "review_score": "1"
        },
        {
            "review_text": "This game has a clunky interface, there's no story, the soundtrack is repetitive but, for what it is, it's actually okay. It could be a flash game, certainly, so I think it's a bit pricey, but if you can get it on sale or at a giveaway such as the one orlygift did a while ago, it's most certainly worth it. Keep in mind, though, that if you're not 'just another casual player', you won't enjoy this at all. There are no extra features such as achievements nor trading cards; it's just a casual game to pass some time on. It works, basically. I'd give it a 2 out of 5. There's a lot of room for improvement, but it's still mildly enjoyable as it is. I'd rather play something else if I had to choose, quite frankly.",
            "review_score": "-1"
        },
        {
            "review_text": "There's some warning about things which I'll get out of the way.  A) movement controls chronically reset (barring the challenge mode which is a series of missions) B) An enemy tank in later levels goes and leaves the screen potentially.  But I would reccomend it as it's a cheap amusing thing to do when you have a few minutes.  I can't say this is must get for the time being.",
            "review_score": "1"
        }
    ]
}