{
    "app_id": 423800,
    "name": "Automata Empire",
    "release_date": "2016-04-08",
    "developer": [
        "Nonadecimal Creative"
    ],
    "publisher": [
        "Nonadecimal Creative"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Online Multi-Player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Indie",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Simulation",
        "Indie"
    ],
    "achievements": 21,
    "positive_ratings": 34,
    "negative_ratings": 14,
    "price": 6.19,
    "description": "Seize power and build an empire of fuzzy cellular automata monsters! Herd hundreds of mindless subjects to smash your rivals' castles and steal their territory in this RTS inspired by Conway's Game of Life.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/423800/header.jpg?t=1547066236",
    "minimum_requirements": "OS: Windows XP SP2 Memory: 2 GB RAM Graphics: 1280x720 or higher DirectX: Version 9.0 Storage: 80 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Easy to learn Quicky game play Great causual game to kill a few minutes here and there with.",
            "review_score": "1"
        },
        {
            "review_text": "Simple and basic once you get your mind wrapped around the logic loops. Most certainly trying to follow the Othello game mindset, 'easy to learn, life time to master' kind of thinking. Initially, I had some misgivings about the game but as I play I begin to really understand the way the game should be played. At least I think I am.  The first thing that you need to know is that taverns don't spawn units. Even after reading how the game worked for some reason I saw taverns as spawning buildings. Although they do facilitate spawning they don't create units. Logic loops are the only form of spawning you can do, which requires at least 5 units. Once you wrap your mind around that, the game makes more sense. The taverns will keep units in close proximity to one another which increases the amount of units you can potentially spawn.  Due to the logic loop system used to create new units, some basic math skills is a must. For the love of God. Find out how to setup a basic logic loop where you're units feed into themselves but have some kind of release valve. If you have too many units in one place they ALL die. Usually a well placed catapult will do as an output.  The game form where the AI plays against itself is BRILLIANT! It lets you focus more on how the AI plays which gives you insight on how to play. What happens when you place a building somewhere, when and where they spawn roads/catapults, etc. Very useful when learning the game for certain.  I know I've only put one hour into the game, but I know I can easily put enough time into this game to warrant the price. Once mulipayer goes live, this game could easily be worth $10 to $15 depending how vibrant and fun the multiplayer scene gets. The current price is worth the entertainment value you can expect from this game, so long as you have some basic math skills.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic concept, both short and strategic, and multiple game modes. Then catapult your troops !  What's not to like ?",
            "review_score": "1"
        }
    ]
}