{
    "app_id": 423880,
    "name": "Carpe Diem",
    "release_date": "2015-11-30",
    "developer": [
        "Moonlit Works"
    ],
    "publisher": [
        "Moonlit Works"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Cloud"
    ],
    "genres": [
        "Casual",
        "Free to Play",
        "Indie"
    ],
    "tags": [
        "Free to Play",
        "Anime",
        "Visual Novel"
    ],
    "achievements": 1,
    "positive_ratings": 6791,
    "negative_ratings": 793,
    "price": 0.0,
    "description": "In this very short kinetic novel, you will play as Jung who's meeting up and hanging out with a girl named Ai. Spend your time wisely.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/423880/header.jpg?t=1556431704",
    "minimum_requirements": "OS: Windows XP SP1 Processor: Pentium 4 1.7 GHz Memory: 128 MB RAM Graphics: Intel integrated chipset Storage: 88 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "My first date ever was with an anime girl.",
            "review_score": "1"
        },
        {
            "review_text": "i will not let her go!",
            "review_score": "1"
        },
        {
            "review_text": "CARPE DIEM VISUAL NOVEL FAST REVIEW (NO SPOILERS)  I liked it. Not heaps, but it was ok.   -The story only went for around 7min's (i'm not the fastest reader, but i wouldn't say i'm a slow reader either, so i'm maybe average??), but i was entertained for those 7min's, &amp; thats what matters. It even surprised me at the end, which is always a bonus. -If you look at the art/ graphics on the store page, you've pretty much seen the art/ graphics for the whole game. I think there were 4-5 different backgrounds, with each background showing the same character, who's only variety was when she'd open &amp; close her mouth during dialogue, as well as the occasional blink. Oh, sorry, i forgot, her cheeks also get red at times. -The music was fine. Mellow piano playing, but for only 7min's, so i didn't get sick of it.  So, the game altogether was ok. Nothing blow-away spectacular, but all in all, a good experience. Maybe if it was longer, i wouldn't have liked it as much.  Also, i haven't mentioned, this VN was the maker's first effort &amp; it's free, so i think you've got to allow for that as well. I'd rather make an average first game than a crappy one, &amp; this isn't crappy (just average).   5/10    ",
            "review_score": "1"
        },
        {
            "review_text": "The developer of Ai knows how to fix crash better than the developers of Batman: Arkham Knight",
            "review_score": "1"
        },
        {
            "review_text": "7.5/10 - This Game is Annoying until the Very End...  The game itself is not great; but once completed you develop a new appreciation for this title. It only took me 11 minutes to complete and I'm slow at reading. There is only 1 ending since this is a 'Kinetic Novel'; and once completed you earn the achievement. Another easy 100% Achievement here!  This game definitely is more than meets the eye. If you like visual novels I'd definitely give this game a try.   It's FREE; so give this a try!     Accidently Reviewed",
            "review_score": "1"
        },
        {
            "review_text": "your waifu is not real :&lt;",
            "review_score": "1"
        },
        {
            "review_text": "I like the intro music. It got that lonely loop feel.",
            "review_score": "1"
        },
        {
            "review_text": "Thanks for the spoiler, Mr.Achievement!  10/10",
            "review_score": "1"
        },
        {
            "review_text": " A Very Short Visual Novel worth your Time",
            "review_score": "1"
        },
        {
            "review_text": "The history is very short but at the same time is so amazing 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Perfect litle game ,just perfect ^_^  Only to bad it is like super short ,10-15 min of game, and the ending is .... No spoilers,chect it for your selfs,but it is interesting.  ",
            "review_score": "1"
        },
        {
            "review_text": "The story is short :C I wanted to see more, this game broke my heart a little &lt;/3 . Still worth playing it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is better than ♥♥♥♥♥, changed my life, I used to be a fat virgin that had nothing to live for. Then i played this game, it filled me with determination, I lost weight, I got a girlfreind, Saved christmas, won the olympics, won the whole superbowl by myself, and I summoned Exodia. 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "the game with the cutest achievement pic pls make an emoticon to buy :)",
            "review_score": "1"
        },
        {
            "review_text": "I can't believe I just got mind♥♥♥♥ed by this game. Holy hell. what am I doing with my life?",
            "review_score": "1"
        },
        {
            "review_text": "In my words it's a very short read nothing really exicting, but getting an 100% achivement rate is nice.  The story is boring ( You go to the Mall,Park or Arcade..and eventually go to all 3 as the story goes on ), But I will upvote this because the ending is where it gets you.  The read is also so short it will take you about a min or two to finish.  The music only has 3 tunes. Start. End. Menu Screen.   *Cough* AI *Cough*",
            "review_score": "1"
        },
        {
            "review_text": "Its a short game, but honestly if it was longer I probably woudn't like it as much. A game to make you feel depressed if you're a coder with no girlfriend &gt;&lt;",
            "review_score": "1"
        },
        {
            "review_text": "BibleThump",
            "review_score": "1"
        },
        {
            "review_text": "The cake is a lie   wait, what? wrong game. ",
            "review_score": "1"
        },
        {
            "review_text": "this is a very good novel, it's short but worth of your time, it's free and it only has one trophy. I'm glad I got to read it.",
            "review_score": "1"
        },
        {
            "review_text": "This is honestly one of the deepest games of 2017. I have never before experienced a game of such depth and emotion until Carpe Diam. It was about 10 minutes in when I realized that I had things to do today, but I was instead staying in my basement playing video games making no real impact in the world. For lunch today I had ramen noodles. The main protagonist, Jung, enjoys rice, and I too enjoy rice. This connection really made me feel immersed in this universe. When I grow up I know for a fact that I will be a better father and husband than my dad ever was because of this story. Unlike Mike. Mike was always there just to be a jerk to me. I hate Mike. Now he lives a sad life without Julia. Because Julia is mine, Mike. She's mine and you can't have her! 4/5",
            "review_score": "1"
        },
        {
            "review_text": "This game is great and teaches us all a lesson. That your Wifu isn't real and reality needs a check, and that I rather be in this world than the world I am in. I need a teleporter into that world, PRONTO!",
            "review_score": "1"
        },
        {
            "review_text": "So, speaking as a fellow dev and Renpy user, I have A LOT to say about this, so I'll try to break it up a bit.  Visuals: They're great. It looked professional and clean. The only complaint I have isn't even really a complaint at all: get some more. Maybe some different poses for Ai or more backgrounds so you can actually be in the different stores. What I would really want is to get to actually see Ai in the dress. However, its still a first game. And one heck of an amazing at that, so I cannot fault you at all.  Story: Dear god, that killed me at the end. All three times. Really well written, no grammar/spelling errors that I saw and really good ending. Really all you can ask.  Overall, this game is amazing and a must-play for everyone pretty much ever. 10/10, would cry over again.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 made me kill my whole family    would do it again...   ~a small loan of a million memes",
            "review_score": "1"
        },
        {
            "review_text": "To me, this is a great game, I had mixed emotions and the end got me so shocked haha. Great game 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Really cute , but too short .",
            "review_score": "1"
        },
        {
            "review_text": "Truly, your waifu is not real.",
            "review_score": "1"
        },
        {
            "review_text": "Short, sweet and left me teary eyed.",
            "review_score": "1"
        },
        {
            "review_text": "The game is crashed after I get achievement, force me to go back to main menu.. pls fix it..",
            "review_score": "1"
        },
        {
            "review_text": "The story is nice and it lasts for about 10 minutes or so,  it is available in many languages and the good thing about it's free... so go ahead and try it  it's free anyway you've got nothing to lose . . . it's definitely worth a try .",
            "review_score": "1"
        },
        {
            "review_text": "Short game with an easy 100% (1 achievement, given at the end of the short novel)",
            "review_score": "1"
        },
        {
            "review_text": "Well uhh...... this is my 1st (and probably last) VN. And well....... Gah, SPOILER ALERT!     Main character is some weeb who's in-love with virtual girl, and uhh...... he doesn't want to face the truth that his ,,girlfriend'' is actually virtual...... what the fu*k?     Also, you can't jump in this game!  9/11",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed everything about this VN. Sad thing is that VN is really short, but it had a really interesting meaning and as first attempt is really good. I recommend to give it a try (even those who dont know anything about VN).",
            "review_score": "1"
        },
        {
            "review_text": "It was so short but but it was all right What am I doing with my life?",
            "review_score": "1"
        },
        {
            "review_text": "Well....that was...relatable... Seriously,the ending surprised me and came out of nowhere,yet makes sense. The achievement kinda made me laugh,then sad...I LIKE IT! Can't wait for the creator to make another novel.",
            "review_score": "1"
        },
        {
            "review_text": "Extremely short game. The ending was really surprising and sad, but it left me wanting more. A continuation would be nice. Props to the art/visuals. Very pretty.",
            "review_score": "1"
        },
        {
            "review_text": "Short but sweet. Nice logo design, by the way.",
            "review_score": "1"
        },
        {
            "review_text": "pretty good.",
            "review_score": "1"
        },
        {
            "review_text": "Ha! Pretty much a humourous parody of visual novel fans. Short but sweet.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing short visual novel!  Right in the feels...   10/10 - 'Almost cried like a little girl'",
            "review_score": "1"
        },
        {
            "review_text": "Carpe Diem is a short (5 minutes) romantic story with one interresting idea at the end. It certainly isn't great but it isn't terrible either.  6/10 Decent romantic story.",
            "review_score": "1"
        },
        {
            "review_text": "Very cute short game that I really enjoyed. This game will be close to my heart for the rest of my life. At my funeral I want this game played infront of everyone.",
            "review_score": "1"
        },
        {
            "review_text": "   What am I doing with my life?",
            "review_score": "1"
        },
        {
            "review_text": "This game really did touch my heart with such a twisting and rivoting story with an ending that could have never been suspected this visual novel really threw me in a tizzy. It makes you ask yourself what you really are doing with your pitiful and insginificant life. Who could have guessed that the character named AI was an actual AI in a computer game. I found myself connecting with her and then became emotionally unstable once I found out the truth. I spiraled into a deprtession turning to alcohol for the support that my beloved AI could not lend me since she was forever sealed away in the virtual world. I love AI and one day I will make her real so we can continue our life together at the mall buying gtx titans, spider keychains and slamming each other over the head due to our excessive tilt from street fighter at the arcade.",
            "review_score": "1"
        },
        {
            "review_text": "made me sad as f*ck. for real. really good though. if you want to hate yourself.",
            "review_score": "1"
        },
        {
            "review_text": "#NotLikeThis",
            "review_score": "1"
        },
        {
            "review_text": "At the beginning, it's kind of suspicious. I can't predict the ending nor I don't even know the story at first. And, BOOM. Feeling Storm. 10/10  GG Dev, GG.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 for autists",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed this game. Even though it was EXTREMELY short and I hoped to see more, it still gave me this warm feeling in my heart. The art style was cute and simple and the characters were life-like.",
            "review_score": "1"
        },
        {
            "review_text": "needs more coding 9.9/10 -- not IGN",
            "review_score": "1"
        },
        {
            "review_text": "It teaches us that our ''Waifus'' ain't real. *sobs* T^T",
            "review_score": "1"
        },
        {
            "review_text": "felt a knife in me 10/10 would feel a knife through my chest",
            "review_score": "1"
        },
        {
            "review_text": "Very realistic that it hurts 10/10 real life simulator",
            "review_score": "1"
        },
        {
            "review_text": "A game that everyone on steam should probably play. Worth the 10 minutes it takes to finish. ggwp",
            "review_score": "1"
        },
        {
            "review_text": "Wow this game is an amzing game! It really made me thnk, 'What am I doing with my life' and 'What do I want to do'? This game asks the gritty reality question a lot of people ignore. I can say I recommend this game to anyone having a hard time in life looking for an answer or simply wants to think for a solid 20 minutes while looking at Ai. I guess the real question is though do you want to go to the Arcade, Mall, or Park? Choosing one of these 3 simple questions could define your life very easily. Are you a nature person, choose the park! Do you like videogames, well take your waifu with you! Do you think waifu will want some new clothes, take her to the mall! I can strongly give this game a 9/11 being that its a real smack to the face to any fat weeaboos who think they are all that and a bag of Funyuns.  Final verdict 9/11  Decerex with love XOXO",
            "review_score": "1"
        },
        {
            "review_text": "i don't want to live anymore ;_;",
            "review_score": "1"
        },
        {
            "review_text": "Had a great time with Ai. It was a shame that our time was over so quickly. What am I doing with my life?",
            "review_score": "1"
        },
        {
            "review_text": "Do not get attached to Ai. Its a trap!",
            "review_score": "1"
        },
        {
            "review_text": "What am I doing with my life?",
            "review_score": "1"
        },
        {
            "review_text": "What am I doing with my life?",
            "review_score": "1"
        },
        {
            "review_text": "I dont know why.... i got sad in the end :(",
            "review_score": "1"
        },
        {
            "review_text": "Saw it coming a mile away.  Good read though.",
            "review_score": "1"
        },
        {
            "review_text": "Cute short VN with a very nice yet kinda sad ending. I hope the developer makes more and wish him the best!",
            "review_score": "1"
        },
        {
            "review_text": "I think words are unnecessary. Just try it, it doesn't take long. :)",
            "review_score": "1"
        },
        {
            "review_text": "About 10 minutes long if you read fast, probably 4 minutes if you skim it.  Worth playing if you feel like a small VN will pass the time.",
            "review_score": "1"
        },
        {
            "review_text": "But seriously tho,what am i doing with my life?",
            "review_score": "1"
        },
        {
            "review_text": "cute story, worth the 20 to 30 mintues it takes to ready depending how fast you read.",
            "review_score": "1"
        },
        {
            "review_text": "10 / 10 for free :D",
            "review_score": "1"
        },
        {
            "review_text": "It's very interesting for a short VN game. Trust me, you won't be disappointed in giving this a try.",
            "review_score": "1"
        },
        {
            "review_text": "A cute, short VN. I would really like to see more of these in the future. keep up the good work developer!  Aww... I can't review it. I need to play at least 5 minutes? 1 minute and i'm already hooked",
            "review_score": "1"
        },
        {
            "review_text": "It was ight.",
            "review_score": "1"
        },
        {
            "review_text": "Weaboo Simulator 2015  Seriously, what did you expect from a VN?",
            "review_score": "1"
        },
        {
            "review_text": "15 minutes of my life i will never get back 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Short and sweet. I loved the banter between the two characters. It felt natural, not super-sweet and mushy like others.",
            "review_score": "1"
        },
        {
            "review_text": "I guess it is free, so you can't complain.  Really short visual novel - maybe 5 minutes if you read fast. Look forward to the next project.",
            "review_score": "1"
        },
        {
            "review_text": "This is just sad :/ idk why am i not enjoying life right now",
            "review_score": "1"
        },
        {
            "review_text": "really like this game.. love all the conversation between jung ani AI.. i hope it can last forever..  10/11 cry in manly tears",
            "review_score": "1"
        },
        {
            "review_text": "Quite nice short story that you could read during quick toilet occupation - worth it price! Also, another 100% cleared game to collection.",
            "review_score": "1"
        },
        {
            "review_text": "Splendid visual novel, great music and storyline!",
            "review_score": "1"
        },
        {
            "review_text": "Nice story ..",
            "review_score": "1"
        },
        {
            "review_text": "What am I doing with my life?",
            "review_score": "1"
        },
        {
            "review_text": "Very, very short, but amazing. You immediately become attached to the characters and then bam...a massive blow to your heart, mind, and everything holy in your life that you once held so dearly. What am I doing with my life...",
            "review_score": "1"
        },
        {
            "review_text": "The creator did a great job telling a short but sweet story. I was not prepared for all these feels.",
            "review_score": "1"
        },
        {
            "review_text": "That. Was. So. Awesome! I very much liked it. It's not that hard to figure out before the ending hits you, but I didn't try to, because I didn't know I needed to, plus the writing is pretty good, so I was immersed into the world pretty quickly. For a short graphic novel and just all in all for a game it's definitely 10/10, maybe 9/10 if you count 'being too short' as a con. My god that ending was unexpected, but cool. Just like the game. I'll be waiting for your future projects, Eyzi.",
            "review_score": "1"
        },
        {
            "review_text": "loved it. hoping to see more of your projects soon",
            "review_score": "1"
        },
        {
            "review_text": "Very interesting novel short like 5 min but interesting thinking about life i looking forward to more project's from this author",
            "review_score": "1"
        },
        {
            "review_text": "Carpe Diem is pretty much exactly as it describes itself. It's a short VN with one non-critical decision and a pretty ok story and conclusion for its length. It won't take you more than 10 or so minutes to give it a look, and considering it's free and you're probably reading this on its store page, why not?  Pros: +Art is pretty good, even if there's not much to see. +Delivers a message you might pay $5+ to see from some other indie game, for free and with less pretension in less time! +Has a pretty fully fleshed out options menu for a 10 minute game. All your VN basics are there including saves and dialog skipping, skip only seen etc. +Multiple language support. +You can buy an extras pack DLC if you want to support the developer. It doesn't contain content locked out from the main game so you won't miss out on anything either. ?Easy perfect game for your steam achievements collection.   Neutral points: =I guessed the twist before I started the game. =The only choice in the game isn't too important since each route can lead to at least one of the other locations you can pick from eventually. You will miss a few scenes if you don't try them all though. =The music isn't great but I also didn't find it annoying. =No voice acting but I'd hardly expect that from a free game and let alone a dev's first VN.  Cons: - There's quite a few grammatical errors, at least in English. I cannot speak for the other languages available.  UPDATE: Eyzi has corrected the mistakes I spotted. -The writing is a little stiff. Would have benefited from some creative writing techniques. It's not all bad though, both Jung and Ai have some character to them. Some.",
            "review_score": "1"
        },
        {
            "review_text": "Carpe Diem is a short, sweet VN with a cute story and an unexpected ending. The story is very, very short, easily read in 5-10 minutes, unless you want to view all the different paths, which all lead to the same ending. It's very enjoyable, and I can't wait to see more of this developer's work. And best of all, it's free! :D",
            "review_score": "1"
        },
        {
            "review_text": "First kind of this game that really have a touching ending  Good job",
            "review_score": "1"
        },
        {
            "review_text": "Super clever story highlighting some key issues of the technological age, with so much potential for the next part! I'm keen to see what becomes of it.",
            "review_score": "1"
        },
        {
            "review_text": "That escalated quickly.",
            "review_score": "1"
        },
        {
            "review_text": "its depresing ",
            "review_score": "1"
        },
        {
            "review_text": "I was hesistant to pick this game up after reading all the reviews. While it is free It is extremely short. However, that is probably it's greatest strength. It's charming and lasts just long enough to be interested in the characters and not bore. Even with the story on the slowest Auto setting I managed to take all three routes within an hour while taking a snack break between each turn. That's right there are only 3 routes, each of which ends the same way. Each playthrough will follow the same general path. The twist at the end tho changed the way I thought about the story during my second and thrid play through.   The story and music were delightful. The only real complaint I have is that there isn't enough art. There are a total of 6 backrounds and you will spend most of that time looking at a slightly changing Ai. There are a few interesting parts to the story that I would have loved to see. For such a short story with such limited content this was a true missed opportunity. All in all I really enjoyed this first attempt and I look forward to how Eyzi, the developer, grows from here.",
            "review_score": "1"
        },
        {
            "review_text": "Realy nice VN , Ai so cute, good story to, recomended",
            "review_score": "1"
        },
        {
            "review_text": "I did not expect the ending to hit me right in the feels",
            "review_score": "1"
        },
        {
            "review_text": "Thank you developer for reminding me the question that pops in to my head everytime when I play this kind of games 'What am I doing with my life?'  69/100 Would ask the same question again",
            "review_score": "1"
        },
        {
            "review_text": "Wh... what? my god, WHOOT A TWHIST!!! I ain't gonna spoil it for ya, but really, holy ♥♥♥♥ play this game. I get the feels man. The story was A+, Great Aime style art, fantastic characters, and a wonderful sound track... Again I say U PLAY GAME YOU HAVE FUN! K? k.",
            "review_score": "1"
        },
        {
            "review_text": "Holy ♥♥♥♥, i can write gf for my self!",
            "review_score": "1"
        },
        {
            "review_text": "These game is pretty boring plus the lame ending made me cringe on how bad the game was. Would watch them go on a date again.",
            "review_score": "-1"
        },
        {
            "review_text": "  That was kinda depressing,anyway i enjoyed it the most. ",
            "review_score": "1"
        },
        {
            "review_text": "It's funny how the title itself represent what the creator tries to tell, the meaning of this VN  Carpe Diem in latin means, seize the day  to live life to the fullest, getting the most out of each individual  day.  That is what this game is all about, to stop living in delusion, being depressed, and stressed, instead to live your life to the fullest.  AI is trying to remind us that by the end of the scene. In japanese Ai, means love. And she represent what  love  is for Jung.  12/10 One of the best visual life novels        [Not so old review]  It's been a while since i read this VN I've been helping with the translation on the early days because i find this VN to be awesome.  It is emotionally touching Only needs 15 minute of gameplay to make me feel lonely and empty for the next 5 hours      :')",
            "review_score": "1"
        },
        {
            "review_text": "For a free game, Carpe Diem offers short and limited enjoyment. The art is decent at best, lacking in limited character sprites (which is to be expected) &amp; CG. For a visual novel, you expect more if you usually pay for the game, but Carpe Diem is a short game which proved rather entertaining for me.",
            "review_score": "1"
        },
        {
            "review_text": "This game is even shorter than the time I last in bed.",
            "review_score": "1"
        },
        {
            "review_text": "good to play for 10 minutes i guess they need to add more story and choices because choosing 1 choice at the start leads to every choice",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed this game and the ending was unexpected, i hope to see more games like this in the future",
            "review_score": "1"
        },
        {
            "review_text": "'What am I doing with my life?'  Seriously that was the first thing I thought in the first few minutes of this game, but the story appeared to be interesting. I really like the ending of the story and I am happy that I have spent some minutes to read the story. I have to admit that at the beginning I just took it because of the achievement, but I hope that many more people will think like me and discover this visual novel.",
            "review_score": "1"
        },
        {
            "review_text": "Super short but it's cute",
            "review_score": "1"
        },
        {
            "review_text": "I've never mashed my enter button this fast. was done in 2 minutes but had to afk alot because you need 5 minutes to write a review.   Easy achievement, would do it again. I bet the story is nice too.  9/10 alot of people.",
            "review_score": "1"
        },
        {
            "review_text": "Hi all,  I liked: It was hilarious to me that the protagonist Jung, did not have a great deal in common with their programmed Ai girl friend, there was friction, sarcasm and antagonism. Which reminds me of the simple truth that opposites attract and yet such differences also cause friction.  Disliked: I simply didn't understand why Jung would question, what he was doing with his life after his Ai girl friend crashed. I had noted that Jung appeared to enjoy her company, despite the considerable limitations of their relationship. Why should his relationship as it was, with some manner of synthetic (software) individual be judged as anyway inferior to any other relationship, real or imagined, synthetic or otherwise? It is evident that many people live their lives in a very lonely fashion, yet PC (Personal Computer) uptake appears to be considerable. Therefore the thought experiment that the game explores, namely human beings developing relationships with Ai software has considerable merit. Many lonely people with access to PCs and such software could develop relationship within the technological constraints of such. I argue then that numerous people's lives could be bettered by the ubiquitous use of such Ai. I suggest that far be it from questioning his own life, Jung, could improve his Ai and eventually with persistence, make a lot of lonely people happier. Maybe even himself. The implied notion that there is a perfect (or even any) partner just waiting for each of us to approach in real life, is naive and I argue, the greatest fantasy associated with this game.   Good gaming, Alter  I suggest that we all enjoy our fantasies, they may be all we have, they may be all we will ever have. I recommend against denouncing them as somehow inferior or unworthy and suggest instead embracing them as part of who we are.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a sweet and somewhat sad VN about dating your fake waifu.  sorry for your loss",
            "review_score": "1"
        },
        {
            "review_text": "First game I got all achievements for... I do love being bullied by the end game screen! I was laughing at the start and started questioning myself half way through...  ending would have been better if my friend in the skype call wasn't raging about it 5 mins before I got there but still deep...  What am I doing with my life?",
            "review_score": "1"
        },
        {
            "review_text": "Carpe Diem is another really short VN out free on Steam. This time around you take a girl on a short date and then discover her true nature towards the end of the VN. Again, really short, and not much to it but Carpe Diem still manages to be better than most of the other free visual novels on Steam as of late.",
            "review_score": "1"
        },
        {
            "review_text": "+lots of content +awesome graphics and sound effects +Excellent level design  all you can expect from AAA game",
            "review_score": "1"
        },
        {
            "review_text": "Yes, it's sad. Yes, it has a twist. But the writing is extremely sub par and I was laughing the entire time at how ridiculous the dialogue was. I only give this a thumbs up because it is free. If this was even ten cents, I would not recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "I don't make reviews very often.",
            "review_score": "1"
        },
        {
            "review_text": "If I didn't spoil the game for myself BY READING REVIEWS ON STEAM, this would have been a really unexpected, powerful message. It's still good, even when I knew what it was about. Quality Public Service Announcement.",
            "review_score": "1"
        },
        {
            "review_text": "What are you doing with your life?",
            "review_score": "1"
        },
        {
            "review_text": "I hate this game for making me question me and my abundance of dating sims.  Strongly recommend to those who too, enjoy dating sims.",
            "review_score": "1"
        },
        {
            "review_text": "I went into the game expecting the girl to die, hense, only having one day with her.  But, then I finished the game  and contiued to lay down on the floor and moan with confusion about my life.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, way too short.",
            "review_score": "1"
        },
        {
            "review_text": "Although I like graphics, the other elements weren't appealing. I would give 'mixed/neutral' review, if possible. The ending is good - it can even explain why on earth all the game is such weird and dull. It's ~650 lines in script.rpy file. That's not too much - that's why it has so many translations.  It's wasted potential in my opinion, but hey, feel free to try yourself and rate!",
            "review_score": "-1"
        },
        {
            "review_text": "Frankly, I really like the concept of Carpe Diem, but even for a free game, it doesn't really seem properly fleshed out to be anything more than an interesting distraction. While the game's ending was spoiled for me b the protagonist's name, I did appreciate the other, less obvious bits of foreshadowing in the game. I feel that with better writing and a bit more to the story, Carpe Diem would've been a VN with a standout short story- as it stands, however, I'm a little disappointed.  That said, this is the developer's first game- I want to see the dev make more!",
            "review_score": "-1"
        },
        {
            "review_text": "gee golly sam eu♥♥♥♥♥♥ song for 10 minutes only 1 dumb choice and a dumb ending",
            "review_score": "-1"
        },
        {
            "review_text": " It left me feeling 'Meh...'",
            "review_score": "-1"
        },
        {
            "review_text": "I feel like all of the positive reviews are trolling...  This game takes under 10 minutes to beat. 1 achievement pops.  It ends right as an interesting plotline may unfold.  Speaking of the plot, it sounds exactly like that movie with Scar Jo as an OS.  Whatever, still getting a thumbs down for wasting my time. Uninstall.",
            "review_score": "-1"
        },
        {
            "review_text": "Having a good time with mai waifu  wasting mai lifu / 10",
            "review_score": "1"
        },
        {
            "review_text": "What a load of crap its stupid!!!",
            "review_score": "-1"
        },
        {
            "review_text": "15 minutes I will never get back.",
            "review_score": "1"
        },
        {
            "review_text": "This Game really... ah i dunno what to say.. the feeling u get when u think all of this was real,and the feeling u get when u think it wasn't and his last question 'What are you doing with your life?' it's simply ... an amazing game  11/10 Expecting another game like this :)",
            "review_score": "1"
        },
        {
            "review_text": "This game made me question my life while playing this at 2:00am, what am i doing with my life?",
            "review_score": "1"
        },
        {
            "review_text": "This game will hit your feels harder than my gf's period ! But it accomplishes what many TRIPLE-A GAMES cant do in just 10 minutes!! 11/10 best Friendzone ever",
            "review_score": "1"
        },
        {
            "review_text": "O-O i fell asleep ^ .........and this is the first time an achivment applyes to me XD",
            "review_score": "1"
        },
        {
            "review_text": "Waste of time. Only one choice in the whole thing.",
            "review_score": "-1"
        },
        {
            "review_text": "That game....  It has dialoge for about 1o minutes... Very slow and annoying... 10/11 would cry again If you are into boring and sad and slow and just overall TERRIBLE games, then THIS IS FOR YOU!!!  &lt;3 ",
            "review_score": "-1"
        },
        {
            "review_text": "I was expecting a good story, but what i got in the end is truly saddening.  8/8 this is true b8",
            "review_score": "1"
        },
        {
            "review_text": "What am I doing with my life?",
            "review_score": "1"
        },
        {
            "review_text": "  made my ♥♥♥♥ hard until i got to the end        0/10",
            "review_score": "-1"
        },
        {
            "review_text": "'What am I doing with my life?' Creating Artificial Intelligence, apparently.",
            "review_score": "1"
        },
        {
            "review_text": "Wow.... I almost thought this might evolve into a deep plot about, human/AI interaction, or the dangers of foregoing Real life, to live a Virtual life.... ♥♥♥♥ You Devs for turing it into a joke. its not bad, and thats the sad part.. that this couldve actually been pretty good, had it bothered.   4/10 would've just eaten nutella instead.",
            "review_score": "-1"
        },
        {
            "review_text": "Day 26 : Still waiting for the patch.",
            "review_score": "1"
        },
        {
            "review_text": "You dont really expect much of these kinds of games but it was really awesome . It took almost 15 mins to finish it but the story is better than most of the games out there and the visuals are good too . You deserve some thumbs up for this ☺",
            "review_score": "1"
        },
        {
            "review_text": "Took me nine minutes to complete. It works. Its free. It made me laugh. If you have nine minutes to spare and like cute anime girls theres no reason to not play it.",
            "review_score": "1"
        },
        {
            "review_text": "fun, short, free vn.",
            "review_score": "1"
        },
        {
            "review_text": "i loved this game  changed me on a personal level  i feel like a changed penguin  my ♥♥♥♥♥ just expanded to the size of the eiffel tower  its like a fountain, the ♥♥♥ wont stop flowing  10/1 best game",
            "review_score": "1"
        },
        {
            "review_text": "It's a very short visual novel with minimal plot. The plot is nearly non-existent. It's rather unsatisfying. The story feels ham-fisted and clumsily composed. I've seen more plot in a first person shooter than this game. The graphics are all right. Nothing spectacular but still decent enough. The music provides decent atmosphere.",
            "review_score": "-1"
        },
        {
            "review_text": "I see what you did there, but It's not working. And if the single point of an ultra short game is not well made... Anyway, thanks for sharing it for free.",
            "review_score": "-1"
        },
        {
            "review_text": "This is the visual novel equivalent of flash fiction. You make small talk with another character, and then there's a minor twist at the end, and that's it. Easily finishable within five minutes. Nothing profound here.  The story would be so much better if it had any depth to it. Why is the main character writing the software he's writing? What kind of connection does he want to have with the girl; what's his interest in her? She seems to want his company; why?  Another suggestion: when the girl says she's going to go try on different clothing, it would be nice to actually show her in different clothing.",
            "review_score": "-1"
        },
        {
            "review_text": "A pretty picture with endless drivel text. Don't do it.",
            "review_score": "-1"
        },
        {
            "review_text": "A flat, uninteresting story, with stereotypical characters. The visuals are decent, but the game seriously lacks in every other way. A decent idea, but just not fleshed out to hold my attention.  If I wanted to go on a shopping trip, I could have just taken my sister and carried her stuff around all day (spoiler...I think?)   The achievement at completion says it all.   ...What AM I doing with my life?  To comment on my playtime: I left the game running while I went to work for a few hours. There's actually no more than 5 minutes worth of game time.",
            "review_score": "-1"
        },
        {
            "review_text": "you get one choice, then click your way through....nothing....you just click, anywhere, and text goes by, and then the end. its not a game so much as a illustrated story you make progress by clicking......",
            "review_score": "-1"
        },
        {
            "review_text": "Oh my word! DO not buy this game for your kids! My son asked for this for his birthday and later I find him in his bedroom having a wank to it! This is horrible take it off the steam store now! I am not happy and will be sueing steam for this HORRIBLE porn they have on their gaming site! NOT HAPPY! I WILL SEE YOU IN COURT!",
            "review_score": "-1"
        },
        {
            "review_text": "Jokes on them, my waifu is real.",
            "review_score": "-1"
        },
        {
            "review_text": "was super short, but ending got me good. not bad for a first piece.",
            "review_score": "1"
        },
        {
            "review_text": "This is totally awesome &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "It's a pretty good shortie, good artwork, excellent dialogue, and the ending got me surprised :O I looked back the title menu and the letters A and I are highlighted...as in Artificial Intelligence...yeah, the achievement even gives you a shots fired XP but still, this is a game that will make you experience love with a girl made by Jung, the protagonist.",
            "review_score": "1"
        },
        {
            "review_text": "when I got achivment I laughed and fell from the chair",
            "review_score": "1"
        },
        {
            "review_text": "Man, what am I doing with my life? That ending made me hurt. feelsbadman",
            "review_score": "1"
        },
        {
            "review_text": "I cried a little",
            "review_score": "1"
        },
        {
            "review_text": "I T S A L L I N Y O U R H E A D *Macintosh Plus starts playing*",
            "review_score": "1"
        },
        {
            "review_text": "this hurt me severely on an emotional level.  it was ok",
            "review_score": "1"
        },
        {
            "review_text": "Moral of the story: Your waifu isn't real",
            "review_score": "1"
        },
        {
            "review_text": "What am i doing with my life... good game we need more",
            "review_score": "1"
        },
        {
            "review_text": "It's very short but that's okay, it's for free after all. I really like the style and Ai is just so cute. Also liked the ending.",
            "review_score": "1"
        },
        {
            "review_text": "I see potential in this game I think there could be a lot done if the developer wanted to continue with the project I have some ideas myself on how this game could be fully ♥♥♥♥♥ed out and I would definitely pay for that experience",
            "review_score": "1"
        },
        {
            "review_text": "Literally ♥♥♥♥ this game. 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "Wow. I don't really know what to say as I don't want to spoil it for anyone. It's very short. Take a few minutes to check this out and make sure to go all the way to the end which takes very little time no matter whatever your early reaction to it is. That's all. Don't miss this.",
            "review_score": "1"
        },
        {
            "review_text": "Extremely brief, but lightly thought-provoking. It's nothing particularly noteworthy, but it's free and what little content is in the game is fairly well done. One playthrough will last you roughly five minutes, after which you will earn the game's sole achievement and be able to uninstall the game.",
            "review_score": "1"
        },
        {
            "review_text": "*chokes on the ending",
            "review_score": "1"
        },
        {
            "review_text": "Great, but sadly short. DLC's (more DLC's) would be a great add to this game.",
            "review_score": "1"
        },
        {
            "review_text": "Compelling concept behind its message: uninvolved execution.   The reason this review is  negative  is a response to the overwhelming praise this product has received. To be clear, the idea alone is worthy of a positive review in a Steam Store flooded with indulgent dating sims, but the only  positive  aspect s  of the product are meerly conceptual. I hope the author revisits this concept, as it is very worthy of further exploration... (...and if you, Eyzi, happen to be reading this, don't let the big red thumbs-down deter you. XO XO XO)  *Spoilers: but come on, her name is 'Ai'...you can guess where this is heading*  I like the message, at least its concept (that is, a big middle figure to those living their unexamined lives in virtual worlds to escape the torture of critical introspection: sad, pathetic, and heartbreaking), but the concept is the only worthwhile 'thing' in this product—and even then, the concept isn't taken to its full potential, as it is bogged down by its unnecessary attachment to traditional narrative elements after the 'twist' occurs, lessening its potential for impact—e.g.  of course  Jung programmed Ai, adding a degree of separation between the player and Jung (ideally Jung would be playing a dating sim, just like the player himself or herself);  of course  the Turing Test is unnecessarilly included because  Pop-Science!  and Hey, I've seen that term!—and, it must be mentioned, the lack of visual and audio diversity, so get used to the same images and music! They're nice at first, but soon become grating like everything else when it lacks variety! The writing could have been a bit darker, with a few more jabs at the proverbial player through Jung, I only counted one (he only eats ready-made food), but granted, I only explored one of the three narrative branches...though they all end the same, so I felt no need to explore the other two.  Oh, I like how its message is sending existential crises through the discussion page. Maybe I'm a sadist but that alone deserves bonus points.",
            "review_score": "-1"
        },
        {
            "review_text": "The real question is- Why did I play this game?",
            "review_score": "1"
        },
        {
            "review_text": "Well... Time to re-evaluate my life. Great game ;c",
            "review_score": "1"
        },
        {
            "review_text": "Must spend a few minutes of your life playing this game! It won't disapoint you@",
            "review_score": "1"
        },
        {
            "review_text": "Short, sweet, and kind of depressing. Not as mindblowing as others might have you think but it's worth checking out if you've got 5-10 minutes to spare.",
            "review_score": "1"
        },
        {
            "review_text": "short but you can learn one thing from this novel... do not waste your time... ",
            "review_score": "1"
        },
        {
            "review_text": "Makes you think a bit... It's short ,but worth your time. I want more of it so it's doing something right!",
            "review_score": "1"
        },
        {
            "review_text": "Well i had to sit down, shed a tear, and rethink what im doing with my life 8/8",
            "review_score": "1"
        },
        {
            "review_text": "As I was cuddling my body pillow of my beautiful waifu I saw this game and decided to get it. LITTLE DID I KNOW THAT THE ENDING WOULD SCREW ME OVER AND BRING A TEAR TO MY EYE WHILE I LOOKED AT MY WAIFU AND ASKED 'WHAT AM I DOING WITH MY LIFE????'",
            "review_score": "1"
        },
        {
            "review_text": "Its alright. Can't really complain about much since it literally took less than 10 minutes to get through. Some people might be moved by it but it didn't really do anything for me.",
            "review_score": "1"
        },
        {
            "review_text": "10/10  What the hell am I doing with my life...?",
            "review_score": "1"
        },
        {
            "review_text": "Was very short and to the point. I wasn't at all impressed with this game. I have played other games with this same style and set up but I felt like it lacked a bit. I did however liked the end twist. I wish it had more after that fact. I did enjoy it and I had gotten it free so it was a quick easy 5 min game to pass the time. I wouldn't have gotten this game if I had to purchase it.",
            "review_score": "-1"
        },
        {
            "review_text": "[+] Fast Visual Novel [+] Kinda sad ending [+] Relaxing Graphics -------------------------------- [-] Short Story  Desc : Well, no spoiler given ! So,, 'What are you doing in your life ?' :3",
            "review_score": "1"
        },
        {
            "review_text": "to short,great ending",
            "review_score": "1"
        },
        {
            "review_text": "How dare you question my life.... *cries internally*",
            "review_score": "1"
        },
        {
            "review_text": "Carpe diem and play the game already...",
            "review_score": "1"
        },
        {
            "review_text": "This game just shot a bullet in my heart. Thanks developer for the simple (but beautiful) message, i hope more stories from Ai comes.",
            "review_score": "1"
        },
        {
            "review_text": "It's 'cute!'   A short story of a relationship that starts out charming, sweet and fun, then ends abruptly.   ",
            "review_score": "1"
        },
        {
            "review_text": "... a slap on my face. 'What am I doing with my life..?'",
            "review_score": "1"
        },
        {
            "review_text": "Short, simple but very Powerful in the minds of some.",
            "review_score": "1"
        },
        {
            "review_text": "Best 10 mins of my life   That ending tho!",
            "review_score": "1"
        },
        {
            "review_text": "Interesting feels and nice ending. Clean and polished.",
            "review_score": "1"
        },
        {
            "review_text": "If you want to feel, play this game! Thanks for adding Bahasa anyway",
            "review_score": "1"
        },
        {
            "review_text": "It just turned on me, something real..",
            "review_score": "1"
        },
        {
            "review_text": "That Steam Achievement 'What are you doing with your life?' really hit me in the feels. This looked like one of those over-rated artsy fartsy games, however after reading some of the comments I gave this game a try (especially since it's free to play) and it really is a kind of game that makes you ask yourself 'what are you doing with your life?'",
            "review_score": "1"
        },
        {
            "review_text": "This is not a game. A few minutes in and we're given three choices that end up almost being the same. The dialogue was actually pretty interesting and charming, but then the ending was just insulting. There's also little to gain from playing it twice.",
            "review_score": "-1"
        },
        {
            "review_text": "Please continue the story. You have something great to build upon.   Ok Im gonna be honest here, It was free and I wanted to try out a entry in the visual novel genre.    ..   I was not dissapointed.   Story 7/10 It is a very simple story as it arcs into one act after another. You are a guy who is dating a girl and throughout the day get to experiance the simple yet cheery atmosphere this girl gives off and+ the love you two have for eachother. (Im gonna end it here because of reasons.) I repeat my statement IT is REALY short but if built correctly this would become a great story. Please continue the story.   Gameplay 8/10 Click. Click. SPACEBAR. In all reality I wasnt expecting much considering I read a few reviews and considering its short story I decided that it wasnt gonna have much for gameplay value.It started out in windowed mode which at 2016 should not even be happening.   Art 6/10 Considering this is their 'first' graphic novel I will give him that the visuals are quite appealing but they are wayy too stagnant. A few times throughout the story there was a lot of the description and nothing that followed through and it let me to a slight dissapointment.   Summary: The story made me reminisce on past loves and struck me at a point of a hard realisation. This is something that books do not get out of me alot. I feel like at the end of this I was reading on something great and I have the massive urge to wanna see the next chapter. I really like this story and would love to see it built upon.   Would I reccomened this game? Yes. but you gotta take it with a grain of salt this isnt for somebody who is expecting 12 hour novel. This is a short 15 minute story with undertones that will grip the reader on a semi deeper level. It teaches you something about humanity and in one way how it works.",
            "review_score": "1"
        },
        {
            "review_text": "A short VN, but it is awesome. It has a sad end, but it gives a good advice..",
            "review_score": "1"
        },
        {
            "review_text": "Heyy, thats pretty good!",
            "review_score": "1"
        },
        {
            "review_text": "how dare this game make me question my life of playing weird dating sims",
            "review_score": "1"
        },
        {
            "review_text": "finished this VN in about 10 minutes its a short vn,but its good enough~  this vn have very little size,soo, why not give it a try? :D worth it.  'what are you doing with your life?'",
            "review_score": "1"
        },
        {
            "review_text": "If you still haven't been spoiled by the reviews, go no further and play it. Carpe Diem is a 15-minute visual novel that is so short and yet so beautiful that is truly worth it.",
            "review_score": "1"
        },
        {
            "review_text": "Okay. 5 Minute game. Felt like a clickfest but then again 5 minutes.  'The dialogues are (imo) really unique and distinctive from other Visual Novel / anime dating-type game.' 'They felt so familiar because I, myself often times have such conversations on a date.' 'Wow this game isn't that bad actually.' *starts smiling towards the firework* ... ... ♥♥♥♥♥♥♥IT DEV - REALLY NOW? go buy another harddrive sucker :vvv (&lt;- meaning I want more, even tho it ♥♥♥♥ed me up)  10/10 - definetly recommend playing, atleast for the free perfect game on your profile ",
            "review_score": "1"
        },
        {
            "review_text": "5-minute visual novel with one of the best/saddest endings a videogame can have. ...   Why are you reading this review? What are YOU doing with YOUR life?   ",
            "review_score": "1"
        },
        {
            "review_text": "Short and free. Worth a try",
            "review_score": "1"
        },
        {
            "review_text": "What?! That's all to the game?",
            "review_score": "1"
        },
        {
            "review_text": "This is very short, but nice, enjoyable and thought-provoking.",
            "review_score": "1"
        },
        {
            "review_text": "Talk about unexpected.",
            "review_score": "1"
        },
        {
            "review_text": "It's 5 minutes long, but it's free. Story pulls you in pretty damn far in 5 minutes, that's for sure! xD  7.4/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is trash",
            "review_score": "-1"
        },
        {
            "review_text": "10/10  Would question what I am doing with my life again.",
            "review_score": "1"
        },
        {
            "review_text": "Well it's very short but nothing can beat free... The message is also very meaningful",
            "review_score": "1"
        },
        {
            "review_text": "( What am i doing with my life?) 10/10",
            "review_score": "1"
        },
        {
            "review_text": "First novel game that I finished on Steam system...I love this romantic dating story. Thanks for bring this to my life.",
            "review_score": "1"
        },
        {
            "review_text": "I think I will kill myself.  See ya.",
            "review_score": "-1"
        },
        {
            "review_text": "Damn it i cant handle the feels",
            "review_score": "1"
        },
        {
            "review_text": "Ok time for Carpe Diem (sounds like carp demon) anyway this game is like not even 3 mins but I really liked the art style and a note to the developer this game could be made into a full scale visual novel by adding more story and maybe characters? If you want to that is, but never the less it was a bit sad and enjoyable at the same time so I can't really reccomend this game to anyone in particular I would rate this 6 salty squids/10  It was six because of the length but good game.",
            "review_score": "1"
        },
        {
            "review_text": "As a   Software Developer   this game hit me so hard in the feels.  If you have like 10 extra minutes in your life play this.",
            "review_score": "1"
        },
        {
            "review_text": "I clicked for the first 75% of the game and only started pressing spacebar after that. In that way, the game is pretty unique...I haven't only pressed 2 buttons to finish a game before.",
            "review_score": "1"
        },
        {
            "review_text": "You better fix your program ASAP, sir, and let us play a little bit longer!",
            "review_score": "1"
        },
        {
            "review_text": "Right in the kokoro.",
            "review_score": "1"
        },
        {
            "review_text": "What am I doing with my life?",
            "review_score": "1"
        },
        {
            "review_text": "10/10 easy 100% achivement in 1 minute (I have to play more than 5 mins to upload this review though)",
            "review_score": "1"
        },
        {
            "review_text": "When i finished the game, I yelled 'What the ♥♥♥♥?'",
            "review_score": "1"
        },
        {
            "review_text": "HAHA! Right in your face!",
            "review_score": "1"
        },
        {
            "review_text": "Extremely short vn. Although has a nice twist at the end, the overall story was very boring, explored an interesting concept though, if it were to be elaborated on with alot of world building (for example set in the future where people coud tap into their computers and interact with the AI inside them and many people are now choosing AI partners instead of a real partner or something like that), it may turn out to be a very good vn.   There's a chance it may have potential although i cannot reccomend it. I understand its the author's first vn and i hope he/she takes all our criticism into account and makes their next game a whole lot better, looking forward to seeing more from you and how you improve in following works :) ",
            "review_score": "-1"
        },
        {
            "review_text": "I got this game for fun. But at the end, realised i have been living a lie. the end was so cliffhanging, so if you delevopers read this, improve on this project ",
            "review_score": "1"
        },
        {
            "review_text": "Do you like wasting a few minutes of your life? If the answer is yes, download this game now and find out what you're doing with your life.   ~Brackz",
            "review_score": "1"
        },
        {
            "review_text": "What have you done to her?!",
            "review_score": "1"
        },
        {
            "review_text": "Savagery That is this game A really cute, even if somewhat simplistic artstyle, will have you think that it's just your average novel, easily predicted and the like Until the end Until you get the only achievement in the game Until it's all over It's only 10 minutes, try it!",
            "review_score": "1"
        },
        {
            "review_text": "Oh, whats this? A free game with and Anime girl, im gonna need some tissues.    Im taking about tears, not ♥♥♥♥♥.      ",
            "review_score": "1"
        },
        {
            "review_text": "This will probably be me in the future.  This is sad.  Really sad.",
            "review_score": "1"
        },
        {
            "review_text": "For those who like anime that make you cry or think, wow, I'm ♥♥♥♥ing worthless, HERE'S SOMETHING TO PUNCH YOU IN THE GUT AND ♥♥♥♥/♥♥♥♥♥♥!",
            "review_score": "1"
        },
        {
            "review_text": "+ music + free  Short :( and very sad ending :(",
            "review_score": "1"
        },
        {
            "review_text": "Not what you'd expect. It's worth your time.  10 minutes = 10/10  Carpe Diem.",
            "review_score": "1"
        },
        {
            "review_text": "I think i new what it was going to be as soon as i saw her name, but i enjoyed this and it made me smile. :)",
            "review_score": "1"
        },
        {
            "review_text": "&gt;Download the game &gt;Start the game &gt;Play the game &gt;Fell in love with the character &gt;Get the end of the game &gt;Cry &gt;5/5",
            "review_score": "1"
        },
        {
            "review_text": "A very quick but very enjoyable viewing and reading experience that will take only minutes of your time. I'm not really a VN guy, but this was excellent. Keep in mind there is brief mild language, but besides that this game is amazing. Beautiful girl, beautiful music, beautiful background and heart-gripping story...what more could you want? Plus, you get a Steam achievement, so that's awesome too.  Score: 9/10",
            "review_score": "1"
        },
        {
            "review_text": "I only played for 7 mintues and it found a way to break my heart",
            "review_score": "1"
        },
        {
            "review_text": "Hehe, short and cute :) not the usual game",
            "review_score": "1"
        },
        {
            "review_text": "This game is the best",
            "review_score": "1"
        },
        {
            "review_text": "It was ok.Not what I expected.Short and sweet though.BUT,I didn't expect the (spoiler alert) whole thing to be a program!I thought it was going to be like Miku or Rin maybe.Anyway I would have to say that this should've been longer to develop the characters.There was no time and I just got bored(I finished the game in 11 min.).Final thought:I more towards the side of not recommending,but if there was a middle inbetween sort of thing then i would've picked it.You have a bright future ahead as a novelist if you go down that path though.",
            "review_score": "-1"
        },
        {
            "review_text": "Not much to say about this one. It is short and has an intersting ending. If you like VNs then it is worth checking out.",
            "review_score": "1"
        },
        {
            "review_text": "What am I doing with my life?",
            "review_score": "1"
        },
        {
            "review_text": "Really short gameplay. Still, it completely blew my mind. 100% recommended.",
            "review_score": "1"
        },
        {
            "review_text": "This is an amazing visual novel I had be staying away from visual novels because I thought all of them were like the sakura novels but this proves me wrong, download and read this novel it is outstanding",
            "review_score": "1"
        },
        {
            "review_text": "She told me to get a life. I took her life. 10/10 would cry for several weeks again.",
            "review_score": "1"
        },
        {
            "review_text": "If you want to shed tears of sadness just after 5 minutes of gameplay, this game is the perfect choice.",
            "review_score": "1"
        },
        {
            "review_text": "At 7 minutes, it was short enough that I didn't have time to hate myself for playing it. After reading the other reviews, I'm not sure why anyone was surprised at the ending.",
            "review_score": "1"
        },
        {
            "review_text": "Achivement get 'What are you doing with your life'.  SHUT UP GAME. DON'T JUDGE ME.     Actual review   A short,sweet and simple VN which I would have looked down on if it costed money but since it's free I'm fine with it.",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed this game. It was short and interesting. Although not too immersive its really enjoyable. I'd recommend to play it at least once.",
            "review_score": "1"
        },
        {
            "review_text": "...seven minutes of happiness. one minute of ♥♥♥♥ing ♥♥♥♥♥♥♥t piece of ♥♥♥♥ what the ♥♥♥♥ ♥♥♥♥ ♥♥♥♥ ♥♥♥♥ why is this so ♥♥♥♥ing sad ♥♥♥♥ me ♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "best game 10\\ai",
            "review_score": "1"
        },
        {
            "review_text": "  the story is well crafted and interesting, dialogue could use some work but other than that its good   my one problem is i dont seem to be able to interact with her like choosing my dialogue and choices that could benefit or hurt the relationship",
            "review_score": "1"
        },
        {
            "review_text": "  I honestly thougth it was a weird game the first time, like PewDiePie weird. But no, it´s kind of revealling, but I feel a bit embarassed with the achievement. Still, is free and take 5 mins. It´s worth checking.",
            "review_score": "1"
        },
        {
            "review_text": "Watching The Imitation Game the night before playing this game made the ending even better.  (DID IT 4 THE ACHEIVEMENT BRAH)",
            "review_score": "1"
        },
        {
            "review_text": "Really... interesting game.I enjoyed playing it, and even a couple months after playing it it still confuses me.",
            "review_score": "1"
        },
        {
            "review_text": "Decent game, just don't read any more reviews because they will spoil.  It's free, i'ts super short (takes about 15 min to finish), and it could potentially spark some thoughts about our fufure. Give it a try.",
            "review_score": "1"
        },
        {
            "review_text": "Sad Story :(((",
            "review_score": "1"
        },
        {
            "review_text": "Pretty simple story. Still decent",
            "review_score": "1"
        },
        {
            "review_text": "A game cute and short A game that tore my dreams to pieces (jk but really tho ;-;)",
            "review_score": "1"
        },
        {
            "review_text": "I love this \\'game\\'! It\\'s the first visual novel I\\'ve played and I loved it from the beginning! I know that I will be playing visual novels a whole lot more now that I\\'ve played this! Ps. I can\\'t wait until Carpe Diem: Rebooted!",
            "review_score": "1"
        },
        {
            "review_text": "its ok",
            "review_score": "1"
        },
        {
            "review_text": "11/10 for a achievement hunter. Took me litterally 2 minutes of tapping space to get the achievement, yet another perfect game :D: ",
            "review_score": "1"
        },
        {
            "review_text": "So good , i am Depressed  ",
            "review_score": "1"
        },
        {
            "review_text": "Incredibly short, but sweet in its own little way. Once you read through it you'll realize it's better for the story to be as short as it is, so don't go in holding that against it; especially since it's free.",
            "review_score": "1"
        },
        {
            "review_text": "It was a nice experience, in my opinion :)",
            "review_score": "1"
        },
        {
            "review_text": "Normally i hate novel games but this was cute and interesting. Don't regret playing ^_^",
            "review_score": "1"
        },
        {
            "review_text": "Although this story was very short, it was also completely free, so I don't think the length is an issue. The storyline overall was well written, but the actual dialogue felt like it progressed a little too quickly with little transition between topics. The ending evoked the appropriate emotions very well.  All in all, if you have the time to make it through this story (it took me five minutes, but I moved very quickly), and enjoy the genre, then I'd definitely recommend this story as you will walk away satisfied for very little investment.",
            "review_score": "1"
        },
        {
            "review_text": "Great story and soundtrack i like it",
            "review_score": "1"
        },
        {
            "review_text": "this made me feel better about my ow life.",
            "review_score": "1"
        },
        {
            "review_text": "The guy is too tard... he's wasting time thinking about the turing's test instead of thinking how to pass the bed test... ah wait, it's just a crappy chat bot, so it's an even simpler situation. He didn't take the medicines again so he became detached from reality again! :D",
            "review_score": "1"
        },
        {
            "review_text": "  Carpe Diem is free Visual Novel. In game we have got occasion to meet a girl named Ai. Our hero seems to be happy in her company. They visit some places together but game have deeper meaning. Game is very short but it's ok. I enjoyet it every minutes. Game is interesting and if you want my advice there you are: Play it &amp; Enjoy It.",
            "review_score": "1"
        },
        {
            "review_text": "  Not sure why I decided to download and play this but I went ahead and did so, as a result I've questioned various things and I'm not sure what to think of what I received from playing this. I would recommend this game to those who spend a major of their time doing nothing productive like myself.",
            "review_score": "1"
        },
        {
            "review_text": "oO.Oo I will marry her! I don't care. I. Don't. Care.   It's fast and cute and sad.   If you want you're heart ripped out... play this game!   *warning* I may say that in various reviews.",
            "review_score": "1"
        },
        {
            "review_text": "Well, it lasted about 10 minutes. And it was worth it. Cruel yet satisfying. Sad yet peaceful. A beautiful VN indeed...",
            "review_score": "1"
        },
        {
            "review_text": "short but existential",
            "review_score": "1"
        },
        {
            "review_text": "A good Visual Novel but as it took me around a half hour to finish it, just don't expect the VN to be worth 'calling home' over and all. But yes, I enjoyed it.",
            "review_score": "1"
        },
        {
            "review_text": "What am I doing with my life?",
            "review_score": "1"
        },
        {
            "review_text": "...",
            "review_score": "1"
        },
        {
            "review_text": "a bit shot but very good",
            "review_score": "1"
        },
        {
            "review_text": "I was completly LOST, When I saw the ENDING, I would like to play the bigger, version of this story ,or maybe you can make a sequal[NO SPOILER]. Anyway I like this story ;)",
            "review_score": "1"
        },
        {
            "review_text": "This is a heart felt game, you must play to understand. Don't look for any spoilers, i've played it at least 4 times (Every other week or so) because of how good it is. Download it and take 20min to just play it, i promise you won't be disappointed in the end",
            "review_score": "1"
        },
        {
            "review_text": "CONFUSING WHAT IS REALLL",
            "review_score": "1"
        },
        {
            "review_text": "the last part totally left me no words...i mean it",
            "review_score": "1"
        }
    ]
}