{
    "app_id": 423950,
    "name": "Deadlight: Director's Cut",
    "release_date": "2016-06-21",
    "developer": [
        "Tequila Works",
        "Abstraction Games"
    ],
    "publisher": [
        "Deep Silver"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 18,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure"
    ],
    "tags": [
        "Action",
        "Adventure",
        "Zombies"
    ],
    "achievements": 32,
    "positive_ratings": 470,
    "negative_ratings": 217,
    "price": 8.99,
    "description": "A zombie outbreak eradicated all hope of returning life back to normal, now only survival lives on. Run, hide and fight your way through the undead as Randall searches for his family in this gorgeous, gritty, destroyed world.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/423950/header.jpg?t=1466666725",
    "minimum_requirements": "OS: Microsoft® Windows 7/8/10 – 64bit Processor: Intel Core 2 Duo 2,4GHz+ or better Memory: 2 GB RAM Graphics: 512MB video card with Shader model 3.0 support DirectX: Version 9.0c Storage: 5 GB available space Sound Card: DirectX 9 compatible sound card Additional Notes: Supports Microsoft® Xbox 360 controller",
    "recommended_requirements": "OS: Microsoft® Windows 7/8/10 – 64bit Processor: Intel Core 2 Duo 2,6GHz+ or better Memory: 2 GB RAM Graphics: Nvidia GeForce GTX 550Ti or better, AMD Radeon HD7750 or better DirectX: Version 9.0c Storage: 5 GB available space Sound Card: DirectX 9 compatible sound card Additional Notes: Supports Microsoft® Xbox 360 controller",
    "reviews": [
        {
            "review_text": "Blood sucking publisher, not even a single dollar discount to the original owner. Shame on you",
            "review_score": "-1"
        },
        {
            "review_text": "So this is a redone version of the original, which despite all the control flaws for PC I found a haunting and dare I say Beautiful Zombie survival game.  Low Points of the new Director's Cut  Price point? Well too high and there's no 'loyalty' for prior owners, so I can see that being a stopping point for a lot of people. Wait for a later sale unless you really need to support this new publisher.  PC Controls are still not the best, and this makes the 'Nightmare mode' nay on impossible to play through to see the alternate ending on that one.  High Points of the new Cut  Still has that haunting and beautiful soundtrack, and the graphics once again can make you just sit back and stare and enjoy. I still find it a step away from the usual 'zombie survival game' out there, as you piece together the story you find you're 'not the hero typically found'.   Do I recommend it? IF you've never played or owned the original, then YES.  However, if you own the original, then unless on serious sale then NO. As despite the improvements and additions to the overall look and gameplay itself not having a 'loyalty' discount like other publishers have done in the past is a real strike to this new one. And that's a shame.",
            "review_score": "1"
        },
        {
            "review_text": "Good, Cheap &amp; Short",
            "review_score": "1"
        },
        {
            "review_text": "Fun game to play if u love Zombies &gt;:D",
            "review_score": "1"
        },
        {
            "review_text": "Great game with a great story, and a rather sad ending.   I've never really been one for side scroller games, and I think this game has swung me over. It's quite amazing to see how much detail they've put into it. The graphics are quite impressive.  I enjoyed all the extra content as well. The artwork, videos, diary, mini games, and the book with all the stuff you found really made the experience complete. I haven't tried the leaderboard game, or replayed the game in hardcore mode, but they are there is that interests you.  The campaign is about 6 or so hours long. Can't really complain considering how much I got it for on special. I wish there was more though!  My only gripe was the occasional hiccup I had with jumping over walls. Sometimes my dude kept on switching sides all the time, when I wanted to jump off. I used an Xbox controller to play through the game, so I'm not sure if that had anything to do with it. This always happened in time critical situations, so there was quite a lot of French spoken, and many do overs.  I don't quite understand all the hate some of the other reviews have, but oh well, to each their own :D I have spent more and gotten way worse.  For me though, this game was worth the buy.",
            "review_score": "1"
        }
    ]
}