{
    "app_id": 424170,
    "name": "The fall of gods",
    "release_date": "2015-12-18",
    "developer": [
        "GeexGames"
    ],
    "publisher": [
        "GeexGames"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie",
        "RPG",
        "Strategy"
    ],
    "tags": [
        "RPG",
        "Adventure",
        "Action"
    ],
    "achievements": 0,
    "positive_ratings": 39,
    "negative_ratings": 9,
    "price": 2.09,
    "description": "Old-school Action-RPG. The Fall of Gods is an indie game humbly inspired by Action-RPG you used to play on 16-bit consoles (zelda, secret of mana, alundra...). It was played by more than 75’000 gamers on PC and Xbox so far.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/424170/header.jpg?t=1461521054",
    "minimum_requirements": "OS: XP,7,8,10 Processor: CPU: 1.6 Ghz Memory: 512 MB RAM Graphics: 256mb Video Memory (managing 1280*762 resolution and shader2.0) DirectX: Version 9.0c Storage: 150 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I originally played this little gem on the xbox360. At the time, I wanted to try a game that reminded me of some of the older games i have tried. This game fit the jondre exactly, and is exactly what i wanted. Due to indie games no longer being uploaded to xbox360, that version will never get a upgrade, so it is lucky that i can get the game again on here. If you played the xbox360 version, i definetly would get again from here. This version is updated and continues the story from the xbox360 version. Although you will need to replay it from the beginning, this version has everything the original xbox360 version has, including secret caves, mini bosses, secret items, and multiple area's. This was one of the 1st indie games i ever downloaded on xbox360, and am happy to support the developer. If you want an action rpg, with ode's to older games found on snes (i won't name games!), then this is the game you want to get your hands on! If a newcomer and you never played the xbox360 version, let me tell you, this one is quite fun. I hope you enjoy it as much as i do! Thanks!",
            "review_score": "1"
        },
        {
            "review_text": "Freakin awesome!!!",
            "review_score": "1"
        },
        {
            "review_text": "I like the secret of mana reference but the attacks feel kinda wonky and the animation is lacking. Movement is also kinda weird. Music is very nice though.",
            "review_score": "-1"
        }
    ]
}