{
    "app_id": 424260,
    "name": "Feelings Adrift",
    "release_date": "2016-02-29",
    "developer": [
        "Dénis Múrias"
    ],
    "publisher": [
        "Dénis Múrias"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Indie"
    ],
    "tags": [
        "Indie",
        "Horror"
    ],
    "achievements": 9,
    "positive_ratings": 42,
    "negative_ratings": 28,
    "price": 4.99,
    "description": "Feelings Adrift is an amusement park with some plays. Each attraction have different environments and different goals. Some more scary than others but always with same intention, make good experience in game with scenes completely frightening.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/424260/header.jpg?t=1478610358",
    "minimum_requirements": "OS: Windows Vista, Windows 7, Windows 8, Windows 10 Processor: Intel Core 2 Duo / AMD Athlon X2 Memory: 2 GB RAM Graphics: NVIDIA 8800 GT / ATI HD 3870 DirectX: Version 10",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "TL;DR  Feelings Adrift is a great game if you're looking for cheap jump scares, but that's honestly all it is.    The visuals are awesome, at least where the level designs are concerned, but everything is uninspired. The gameplay of each attraction is just a watered down version of other horror games and the sound/music used is taken right out of other games and films. The AI is random and unintelligent, seeming to have no line of sight, and only catch you when you're right next to them. The worst thing to me is not the excessive use of jump scares (which is ALL the time), but the ugly enemy designs. They look so cheap and fake that it's hard to be afraid of them. The game has some cool elements and I like the concept, but I really can't recommend it unless you really like bad jump scares.",
            "review_score": "-1"
        },
        {
            "review_text": "Its a poo simulator. Scared the s*** right out of me. I recommend this game if you have cardiac problems.",
            "review_score": "1"
        }
    ]
}