{
    "app_id": 424250,
    "name": "Balrum",
    "release_date": "2016-02-29",
    "developer": [
        "Balcony Team"
    ],
    "publisher": [
        "Balcony Team"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "RPG",
        "Strategy"
    ],
    "tags": [
        "RPG",
        "Adventure",
        "Strategy"
    ],
    "achievements": 42,
    "positive_ratings": 288,
    "negative_ratings": 76,
    "price": 9.99,
    "description": "Balrum is an old-school, hybrid turn-based, open world RPG with deep tactical combat. Explore a huge living fantasy world with dozens of side quests next to an epic main quest. Grow your own crops, build your home, and craft your own custom items.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/424250/header.jpg?t=1541491896",
    "minimum_requirements": "OS: Windows 7, 8, 8.1, 10 Processor: Single Core 1.6Ghz Memory: 1 GB RAM Graphics: ATI Radeon X1650 / NVIDIA GeForce 8200 / Intel GMA 950, or equivalent Storage: 1 GB available space Sound Card: OpenAL Compatible Sound Card Additional Notes: OpenGL 1.4 compatible",
    "recommended_requirements": "OS: Windows 7, 8, 8.1, 10 Processor: Single Core 2.4Ghz Memory: 2 GB RAM Graphics: ATI Radeon HD 4650 / GeForce 8600 GT / Intel HD 3000, or equivalent Storage: 1 GB available space Sound Card: OpenAL Compatible Sound Card Additional Notes: OpenGL 3.0 compatible",
    "reviews": [
        {
            "review_text": "So far so good. Great production value for a small team and small file size. Nice rpg elements and survival aspects. RPG elements allow for initial character creation of Fighter, Mage, or Archer. The game starts you off with a pet wolf that is of some help in the begining. The controls for the game are intuitive. It's realtime/turn based. Move around the world in real time, when you are not moving time is standing still. The system is similar to the Echelon RPG games, but the animations and graphics are a step up compared to that series. Survival aspects consist of hunger, health, and thirst. The game has a variety of crafting and cooking options for the survival aspect, also hunting, gathering, and alchemy. There are a variety of tools you have to have to perform various jobs, and these are auto selected when you go about performing a job, such as mining or chopping wood. Artwork and music are top notch and you are able to zoom in and out in the game's isometric perspective. Overall I feel that this game is a great value, lots of content and gameplay options for the price.",
            "review_score": "1"
        },
        {
            "review_text": "To my opinion the survival RPG of the year. Yes, you need to eat, drink and sleep but it adds to the reality of the game. The developers added an option to slow the need for drink/eat even further so it'll be 'playable' for everyone. You can play the game the way you like. Go for the dungeons or like me... spend 16 hours into learning the basics and restarting a few times. Make a steady food supply, train your skills, buy the best armor from the money I made from mining and next I am going to make my own house and farm.   The map(s) are HUGE if you like exploring. There are herbs to gather, stones to mine, trees to cut, apples to pick and so much more. I only explored about 10% of the first map now and I heard there are 4 or 5 of these huge maps through the story.   The game looks awesome in detail within the 2D isometric perspective and offers hours upon hours of gameplay.  GAME OF THE YEAR!",
            "review_score": "1"
        },
        {
            "review_text": "Decent isometric open world survival RPG with turn based combat, quite big world to explore and lot of secrets scattered about. It offers crafting, farming, cooking, alchemy and base building as side activities that you can do between questing, exploring and fighting.  Combat is somewhat clunky and can get bit tedious but it's also often avoidable and, as most of experience is gained from quests, you wont be penalised much for doing so. Monsters do not respawn if so areas that you clear stay clear.  The story is nothing to write home about and the developers not being native english speakers shows in the writing. Changing/improving some of the features could definately improve the gaming experience (like how skill books and stat granting pedestals work). Still all in all enjoyable experience despite it's flaws.",
            "review_score": "1"
        },
        {
            "review_text": "The major issue of Balrum is that it's not designed to be fun. I would say, only the crafting/farming might do that trick for some people; but the thing with farming is that it can become very much a boulder and force you to constanty take care of your plants/animals. That's why I personnally stoped caring about those and just crafted the only needed items: Bread and Bow to get infinite resources and focus on the main reason I play the game: the rpg side.  But before jumping to storyline/quests design, I was also quite bored with the combat mechanics and archetypes. There are 3 archetypes: Bowman, Magic caster and Warrior. All of them utter boring. All you want is to use your 3 dps skills, and then use your stuns to refresh dps skills cooldown and sometimes heal yourself with what you got. It is very static and quite not tactic, it's simply time consuming. That's probably the game biggest flaw imo, there is no fun in creating your character when you understand the ropes, character evolution is utter boring and combat mechanics utter boring.  Then comes the quests, which are not bad, nothing particulary superb, but quite decent.  With the good idea that some of them can be solved in hidden ways. Story line is also pretty enchanting, but very linear as you have only one way to progress in the story: the way you are told.   All in all, although its charms (which are there), the game is b.o.r.i.n.g.",
            "review_score": "-1"
        },
        {
            "review_text": "A true indie gem. The freedom this game gives you is overwhelming and that's what's so good about it! A little rough around the edges but worth the asking price! I'm going to sink in a lot of hours into this!  Pros: +Interesting non generic quests +Excellent exploration +Lots of abilities +Unique crafting systems +Soundtrack  Cons: -Walking could be faster (fine with speed potions) -Steep learning curve",
            "review_score": "1"
        },
        {
            "review_text": "Looking at the game for the first time on steam it was interesting, it promised a lot; Farming, crafting, making your OWN items (look, symbol, name and reagents), building, combat, story, quests, side quests, pets, magic, archery, alchemy, the list goes on forever. This being started on kickstarter and developed by two guys i was leery to trust the quality and polish of the game, however ive had nothing but great experiences with all the mechanics of the game. It all works and it does just work it works really well with an incredible polish. ive spent all my hours in the game in the starting zone so far besides creating my own home exactly how i want it with crops and livestock. The starting area is great theres tons of little quests and they arent the typical RPG quests theyre realistic to the time and living within a fantasy village. so far ive been nothing but impresses and i hope the rest of the game is as polished and inviting as the beginning. The only thing i would like to see in the game is fishing, your house is made right beside a lake, however the lake doesnt have much purpose other than rehydration and decoration so it would be nice to see even a simple fishing mechanic implemented as an alternative source of food.",
            "review_score": "1"
        },
        {
            "review_text": "Nice game remind me of Ultima series. Had a lot of fun playing it especially when I could design my own house and a backyard with plants in it to harvest. Crafting system is quite nice had a lot of nice features. You can cook, make your own recipes, brew potions at alchemy bench, make your own armor or weapons, mine and smelt minerals etc. There are some bugs in dialogs though. The story is nice and there is quite a lot of reading what is expected from a rpg game. I miss out fishing in ponds for extra food so there is no fishing in the game. When you sell off your things in a shop a merchant will eventually run out of money and he won't have more the next day you visit him. Same goes with buying things from him he won't refresh stock the next day so economy in this game is useless. Killing all the animals like deer in the forest will permanently erase the population of deer. Next day you'll visit the forest it will be empty and boring. There is no re-spawn in this game. It's quite sad and game breaking. I thought I could hunt for deer, skin them, make leather armor and sell it to a merchant and make a living out of it. Forget it won't last. Picking all the plants and mushrooms in the forest is also one time only. I remember in Ultima VI and VII there were always new things in the forest to hunt or pickup the next day. So no re-spawn :( It would be nice to own a mine in this game :) or at least there should be an option to melt down your old sword and make an iron ingot. You can forge a sword out of iron but you can't melt it down at a smelter :) and they said that this game has a deep crafting system :) I think that if you can put things together you can break them down and use them to built something new. When you brew potions at a alchemy bench you can hear a bubbling sound but when you make swords on an anvil or cook diner there is no sound at all. Character creation is simple you can't choose gender and you can't name your hero everyone is calling you BOY!. There is no race like Black or Asian only Caucasian white to choose from and you can't change your appearance like hair and stuff. This will sound silly but there are no hanging tick-tock clocks in houses :) the only way you can tell time is by pressing ' I' for inventory. This game is a simulation of life of some sort. It would be nice if there were seasons in this game. So in winter a character should be wearing some warm clothes etc. There is a lot of things to do in order to make this game sooo much greater and much more enjoyable. I hope they will make all of these thing in a dlc or in some upcoming patches.   Anyway beside my ranting this game is fun to play and I will recommend it to all the fans of old-school rpg's :) Cheers  ",
            "review_score": "1"
        },
        {
            "review_text": "This game has a lot of potential that it fails to live up to. Once you get out of the intro village, the gameplay gets stale very quickly.  You can build a cool house, but there's no point to doing so other than to satisfy your own buildernerd desires. Combat is awful. The quests are terrible and the character development is not very fun, either.  Play Avernum if you want to play an RPG with a good, oldschool feeling.",
            "review_score": "-1"
        },
        {
            "review_text": "Wanted to love it, on paper there's a lot to like here, but after giving it an earnest try, it's a pretty underwhelming experience. Robust survival and crafting systems paired with open world RPG, which together don't add up to as much as you'd suspect, because neither of them work very well. You're better off getting a very good open world RPG (of which there are many) or a good survival sim.   My biggest issue is that the game does a bad job of integrating the two. Currently in Chapter 2 I have 23k gold and want for nothing. Piles of loot (most of it dull, all basically straight stat increases) thrown at you that ends up as nothing more than vendor fodder to further pad your pockets. The only way food plays into the game is maintaining the well-fed buff so I can recover quickly between fights. Farming is merely busy work. With your piles of gold, you could just as easily buy enough food to last you the entire game. So you don't really need to bother with these various farming systems, just get a big sword and kill things.   Quests are fairly generic, and poorly written, with tasks like get me ten of these, go kill this thing, talk to this guy. They make an attempt to give you choices in how to complete them, but rarely are they compelling.   A lot of dungeons are either a one room gimmick or a few corridors, and never anything more than that. And after a point, all of these dungeons are filled with items far weaker than what you have. Open world design is always liable to suffer from this issue, but it certainly doesn't help. I would recommend the designers more carefully consider where they place items, or at least not place them so liberally. I was excited when I found a well-made Scimitar, then I found three more, and then only became irritated because I had run out of bag space due to all the other 'fat loot' I had amassed.  Doesn't help that the writing is bad enough to pull you out of the experience, and I usually don't give much thought to a game's story. But here you could skip all of the dialogue and probably improve your experience with the game, that's how poor it is.  I was into the crafting, but even that is pretty limited, and with all the gold you'll amass it quickly becomes non-essential or nothing more than a distraction. You can make your own weapons/armor, but at best it'll be marginally better than what you could find, so the satisfaction is limited.   I will say that the combat is satisfying. I like that enemies pose a significant challenge and require you use your skills wisely. Others might disagree. At times it does become a bit of a chore when you just want to get from point A to point B. Chain chugging Speed Potions to avoid fights is not uncommon.   If you love the idea of it and still are curious, I'd definitely wait for a sale.",
            "review_score": "-1"
        },
        {
            "review_text": "Played it for 6 hours stright as soon as i got it, havent played it once since then. Due to the fact that the damn ♥♥♥♥ing game wont open. I click play, be it on steam or through the shortcut and it opens to the loading screen then shuts down. Havent been able to play it after the first time. Ive re-downloaded it several times and it does nothing. been about a week now and it still wont open..... Edit: found out the game wont load if u dont have speakers or headphones plugged in. not exactly a big deal but kinda annoying",
            "review_score": "-1"
        },
        {
            "review_text": "This game reminds me a lot of isometric RPGs from the mid-90s. So for people that want that retro feel, stop reading now, and go buy it. Gone? Ok, now I'll explain why this game is not so good. The UI is straight out of an isometric RPG from the mid-90s. It is very crude for a game where you need to use it over and over again. Example: farming is a complicated mess of right clicks, left clicks, contextual menus, character positioning, and inventory selecting. Really? You have multiple quick skill bars, just like WOW, but no way to bind crafting and harvesting skills to it. A major part of the game is crafting and harvesting you can't just ignore that..... Ok, so why care about the UI? Because a bad UI zaps the fun out a game. It makes doing simple tasks boring and labor intensive. Want to improve it Mr. Developer? Figure out what the character can do and simplify the commands to get to that end result. It's that or implement macros. Other than that. well the sound could use normalizing. Some sounds are deafing and others are a whisper. I like the retro graphics and the story is interesting.",
            "review_score": "1"
        },
        {
            "review_text": "Look, I realize survival games are all the rage these days with the younger crowd, so it's not surprising to see this game have so many positive reviews. I however thought it would be more of a roleplaying game, but the first task you're given is to go gather a bunch of resources, survival-game style. Not only that, but I couldn't stand the control style (like Ultima or Eschalon) and everything from the graphics to the interface to the loot seemed a ripoff of Eschalon.   Some people may enjoy this, I HATED it.",
            "review_score": "-1"
        },
        {
            "review_text": "Very nice crafting/survival/rpg!",
            "review_score": "1"
        },
        {
            "review_text": "Bought it after the new update, no more hunger/thirst issue. Or at least the values go down at a realistic rate (initiate difficulty, lower hunger/thirst on) I have to eat/drink about 2-3 times a day.  Otherwise very good game !",
            "review_score": "1"
        },
        {
            "review_text": "The game is made in a retro top down isometric style and when I first started it I was pretty stoked. It seemed to have a really extensive world of options and items filled with NPCs and story. After a few minutes though I started to become concerned. The dialogue was pitifully shallow and poorly written worse it was boring. I then realized that my options in the game were severely handicapped by the limitation of what I could do because the skills required to do them are filtered through a learning system that limits you to only a few points per level (5) and you only have 8 levels in the game. Each skill has 4 levels and each level has multiple areas of focus to learn. You might be thinking 'oh so you just have to be smart about where you spend your points.' Nope you'd be wrong. Now believe me when I say I enjoy dark souls as much as anyone else but I'd also say Dark Souls on some level was fair and made sense. More importantly dark souls was enjoyable because you continued to learn and get better at what you did through failure. Balrum seems to be a game for people who enjoy failing because... well because they just seem to enjoy failing. There really isn't anything to be gained from your failure because you can't become better. The primary source of leveling is through quest completion as combat gives you almost zilch in the way of experience (like 48 xp is the most you will get and the levels cost thousands of points) You could literally kill every single creature on the map and have maybe a thousand experience or so but find a ring for a guard and you'll get 500 experience. Doesn't matter anyway because you are arbitrarily level capped. Because everything and I do mean everything in this game is painfully hard to the point of being enjoyable. If you could actually utilize the skill without being stuck with the learning point system the game would probably be much more enjoyable. I think the reason they choice this was to cover for the lack of content in the game and extend the game life. This becomes pretty obvious from the start when you can't run outside of combat and are forced to move about with the shuffle of a dead zombie. Doesn't really matter though because despite being provided with a map no one in the game seems to know who or where anyone else in the game is located even though according to the story they've all been stuck in this forest together for generations. Like I said it doesn't really make a lot of sense and trying to get anything out of them about what is going on is like something akin to fortune telling by a blind and mute palm reader. So in essence you have a game with pretty poor and unrewarding combat which wants to focus on the story which is pretty nonexistent. If this looks good to you go buy Avernum escape from the pit its an older game that does pretty much everything better.",
            "review_score": "-1"
        },
        {
            "review_text": "Balrum is an amazing game with amazing characters. Interesting quests, balanced character progress and a very particularly elaborated world. It’s a bit addictive but this is the real measurement for a successful game. Great job guys!",
            "review_score": "1"
        },
        {
            "review_text": "This is waaaaay Better than Divinity and Avadon Series...NO BS,( (I would like to See Instance Dungeons too,with a mini boss,random drops and repeatable....) And More Map (Areas,And Open World Content )...  (3 Hours Gameplay So Far)  ",
            "review_score": "1"
        },
        {
            "review_text": "The game has a lot going for it, but a lot of what should be fun sometimes feels more like work.",
            "review_score": "-1"
        }
    ]
}