{
    "app_id": 424640,
    "name": "Karaski: What Goes Up...",
    "release_date": "2016-03-02",
    "developer": [
        "Unbound Creations"
    ],
    "publisher": [
        "Plug In Digital"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "achievements": 46,
    "positive_ratings": 41,
    "negative_ratings": 6,
    "price": 8.99,
    "description": "The Glorious Commonwealth’s first Airship has been sabotaged! Uncover what the passengers are hiding and write the grisly conclusion. Open-ended who-done-it mystery where others may suspect YOU if you're not careful! Dziękujemy!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/424640/header.jpg?t=1507678460",
    "minimum_requirements": "OS: Windows 7 Processor: Intel Duo 2Ghz+ Memory: 1 GB RAM Graphics: DirectX 9 Compatible card DirectX: Version 9.0c Storage: 750 MB available space",
    "recommended_requirements": "OS: Windows 7 Processor: Intel i5 Memory: 2 GB RAM Graphics: Geforce GTX 670 or newer DirectX: Version 9.0c Storage: 750 MB available space",
    "reviews": [
        {
            "review_text": "'We'll meet again some sunny day...'  I was given a copy of this game to review and even though it is admittedly not my preferred game type I found enough charm and cleverness to recommend it positively.  The game was lent an air of pulpy respectability by the themes being presented by the suspects even as they boozed and smoked and gossiped. Each represented a core belief system; faith in technology, business, religion, and nationalism albeit to different degrees and even sometimes with a bitterness at the core.I applaud the creator's efforts at making a believable background and that each of the main characters is largely more than the sum of their parts.  The gameplay and aesthetics remind me of The Ship:In both games stealth plays a large role although with Karaski you are utilizing it much differently and are not meant to kill or be killed. Bribery,lockpicks, and even slippers which somehow smother your footsteps enough to render you completely silent are your tools to solve the mystery of who sabotaged the A.A. Karaski.At first it seems exciting to have to listen to the footsteps of stewards and guards in order to avoid detection, but there are many ways to mitigate any effects of being caught and eventually I got lazy and stopped caring.  The writing shows elements of wit and humor, but it never really feels tense or dramatic and at times those 'big ideas' feel shoehorned in to the plot.   The game boasts of replayability and perhaps there is truth to that but I doubt I will be playing it again any time soon. It must be said that the current asking price is too high for what the game gives you, in the end.  6.5/10, recommended to fans of casual point-n-click adventure titles.",
            "review_score": "1"
        },
        {
            "review_text": "Take to the skies in this whodunit mystery. You will take on the role of a passenger on this one of a kind airship, but something has gone wrong. The airship has been sabotage, but who has done it. Was it you? Will you be able to uncover who did it? Will you be caught snooping around and have everyone expect you of doing this heinous act?  In Karaski: What Goes Up... this is exactly what you'll be doing. You will be playing through the game with your main mission being to get to the bottom of the mystery of the sabotage, but there are other quests that you can take on to perhaps pry information from other passengers. In this game you will have the chance to bribe guards to look the other way, entice passengers with the promise of alcohol, and of course gain tools that will allow you access to different areas of the ship.  I'm going to be honest when I first picked up this game I didn't really get into it. I was really just running around the airship aimlessly while getting frustrated, but when I tried again from scratch and really tried to sink my teeth in I found a game where I didn't know what was going to happen next. There is definitely the need for stealth in this game, and early on I got caught ALOT. Thankfully as I played more and more of the game I was able to develop strategies of how to move around the different sections nearly undetected.  This game was a lot of fun, and there were plenty of clues that you had to be on the look out for to help solidify your case against the evildoer. There were quite a few repeat clues scattered on the ship as well, but something tells me that these locations are just the places where random items are placed so that you can experience a unique playthrough each time you play. That's right folks the person who did it in one playthrough might not actually be the the person who did it, if you were to play it again.   Graphically there was definitely a good art style going on, however sometimes it did come off as cookie cutter in certain areas where the same assets were used over and over again. Not surprisingly it was mostly the NPC guards that were all the same, the boxes/trunks around the ship, the different bedrooms, etc. Sure there is going to be duplication of areas and items in real life, but I just feel like there should have been a little more for a personal effect in the different people's rooms.   One of the things I always hope to see is voice acting in the game, unfortunately this game does not have that component, and there are sections that have pretty lengthy conversation pieces that after a while you just want skip through and hope that they weren't too important. However that's usually when there's something key in finding out who did it.  This game might not be for everyone, there's definitely some rough spots to the game, and as I just stated there is A LOT of text to read at certain parts of the game, but I did enjoy playing the game, and I think many people out there would enjoy it as well. This game gets an 8.0 out of 10.",
            "review_score": "1"
        }
    ]
}