{
    "app_id": 425150,
    "name": "Assassins vs Pirates",
    "release_date": "2016-05-10",
    "developer": [
        "DEADBIT"
    ],
    "publisher": [
        "DEADBIT"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Multi-player",
        "Online Multi-Player",
        "Co-op",
        "Online Co-op",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Action",
        "Casual",
        "Indie"
    ],
    "achievements": 20,
    "positive_ratings": 65,
    "negative_ratings": 18,
    "price": 5.59,
    "description": "Swordplay and freerun through the internet and on a couch against your friends in a team brawl. Throw bombs, use smokescreens and climb your way to the enemy base. Choose your side as a Pirate or an Assassin and feed the Artifact with souls of your enemies.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/425150/header.jpg?t=1480208961",
    "minimum_requirements": "OS: Windows 7 Processor: Intel 2.2 GHz Dual-Core Memory: 2 GB RAM Graphics: Pixel Shader 2.0 Network: Broadband Internet connection Storage: 1 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Awesome!  Pros: - very dynamic, - interesting game modes, - very pleasant graphics, - fun maps, - changing maps! - music.  Cons: - Couple of little bugs, not annoying - Few maps (hope it will change in future updates)",
            "review_score": "1"
        },
        {
            "review_text": "  Unfortunately I can't recommend this game.  Got it for free and saw the good reviews so decided to try it. It has some nice graphics and music, but nobody plays it and the controls are too much weird for me! I believe this game is  'dead' . So don't waste your time and money.  Pros:  -Graphics - Music  Cons:  -Controls -No player base(inactive) ",
            "review_score": "-1"
        },
        {
            "review_text": "  Great brawler! If you want chill and have fun this game is great for this!",
            "review_score": "1"
        },
        {
            "review_text": "Waste of money. Few maps, game play feels the same every time. Good art, but sadly bad game play. Even though I bought it on sale, still too much money for a game like this. I would pay a dollar tops.",
            "review_score": "-1"
        }
    ]
}