{
    "app_id": 425220,
    "name": "One Piece Burning Blood",
    "release_date": "2016-09-01",
    "developer": [
        "Spike Chunsoft Co., Ltd."
    ],
    "publisher": [
        "BANDAI NAMCO Entertainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Cloud",
        "Steam Leaderboards",
        "Steam Turn Notifications"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Anime",
        "Action",
        "Fighting"
    ],
    "achievements": 50,
    "positive_ratings": 1504,
    "negative_ratings": 496,
    "price": 39.99,
    "description": "The game that all One Piece fans have been waiting for. One Piece Burning Blood is a dynamic and colourful new fighting game featuring the world’s most famous pirate: Monkey D. Luffy.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/425220/header.jpg?t=1553263956",
    "minimum_requirements": "OS: Windows 7 64-bit Processor: Intel Core i3-4170 @ 3.70GHz Memory: 4 GB RAM Graphics: NVIDIA@ GeForce@ GTX 460 or better DirectX: Version 11 Network: Broadband Internet connection Storage: 15 GB available space Sound Card: DirectX compatible soundcard or onboard chipset",
    "recommended_requirements": "OS: Windows 7 64-bit Processor: Intel Core i5-4690K @3.50GHz Memory: 8 GB RAM Graphics: NVIDIA@ GeForce@ GTX 960 DirectX: Version 11 Network: Broadband Internet connection Storage: 20 GB available space Sound Card: DirectX compatible soundcard or onboard chipset",
    "reviews": [
        {
            "review_text": " One Piece Burning Blood didn't have the easiest road coming to Steam.  And neither were the fans of the series having the easiest time dealing with  the game getting ported onto PC and STEAM.",
            "review_score": "1"
        },
        {
            "review_text": "first i'm fan of One Piece and i was waiting excited for this game to releasing it..  Pros: + Very good Graphics + Great gameplay and Characters + You can challenge yourself at Wanted List + Also can get the Titles and Emblems + All character have very differently all with different abilities + Superb sounds and cutscenes  Cons: - 30 FPS Lock  if you are fan of  'One Piece'  i would recommend this to you. and i would say thanks very much for add arabic language, we appreciate it :)  9/10",
            "review_score": "1"
        },
        {
            "review_text": "After playing the whole story mode and done 62 matches online just to get chopper title at 30 wins, Worth it! learning curve is so tough, is like dragon ball xeno. without flying but with haki and many Logia-fruit users.",
            "review_score": "1"
        },
        {
            "review_text": "there are many combos and the animations are great,besides PvP there are also challenges that you can take on playing against the computer.However,i dont think its worth 60sgd,just wait for a sale and get a discount.I got it for 25sgd",
            "review_score": "1"
        },
        {
            "review_text": "A great One Piece game that looks gorgerous, but because of so many flaws and unfair mechanics I believe this is a game for really dedicated One Piece fans like me.  Games where developers are too incompetent to program a decent AI usually ships with AI system that cheats to scale the difficulty. In this game, the game introduces 'levels' that controls your attack and defense multiplier. It is only valid on the extremely short and uninteresting (even for One Piece fans) singleplayer. The singleplayer only deals the Paramount War on different perspectives. No other arcs are covered at all.  This is probably the first fighting game that blatantly puts you on a terrible disadvantage.  The AI has far better attack and defense multipliers so you would take his 20% of max HP for landing about 8 ~ 10 successful combos whereas if you get hit by one of his attacks it will easily take 75% of your HP. It's one of those games where the developers aren't competent enough to come up with a decent AI so they had to cheat the numbers to make the game seem at least difficult.  The balance here is a joke and a lot of mechanics such as Flash Counters and Unity Assists make this a casual fighting game at best.  If you're looking for a balanced/fair fighting game, do not buy this game. If you're a huge One Piece fan, but has no friends/families to play locally, do not buy this game. If you're a huge One Piece fan and have friends/families around to play locally, buy this game. You will love it. Despite the flawed designs and unfair mechanics, I had a blast only because I had people to play with.",
            "review_score": "-1"
        },
        {
            "review_text": "Bandai has once again proven that it can do worse. The year is 2016 and they're still locking the fps to the engine? Let me explain a little something that might actually be an insight for some: -Consumers give money to a developer who doesn't give a ♥♥♥♥ about the quality of the game(port) and profits off famous manga/anime titles. -Money goes to the wrong hands and these ♥♥♥♥♥♥ companies continue releasing ♥♥♥♥♥♥ games. -Good companies die off and all we're left with is ♥♥♥♥♥♥ devs.  Some time in the future: -Potentially good company appears on the surface of ♥♥♥♥♥♥ games and ports. -Bandai announces new game. -Good-company game is overshadowed by ♥♥♥♥♥♥ ports with high advertisement budgets -Good company dies out And this is what I call the cycle of bad consumerism and how we actually contribute/ed to what the gaming industry's shape.  Spend your money wisely,  please.",
            "review_score": "-1"
        },
        {
            "review_text": "BEST ONE PIECE GAME EVER!!!   ",
            "review_score": "1"
        },
        {
            "review_text": "  The game is very good, I liked the graphics and gameplay at the highest level.",
            "review_score": "1"
        },
        {
            "review_text": "Game resolution stuck at 720p cannot change!!",
            "review_score": "-1"
        },
        {
            "review_text": "Best of the best.. One Piece is my all time favorite/",
            "review_score": "1"
        },
        {
            "review_text": "this game is amazing  i'm having a really good time playing it  note : i'm playing the game on windows 10 and it works without problems like fps drop, crashing,ect  and the controlers are hard but if you manage to get the hang of it you will be fine",
            "review_score": "1"
        },
        {
            "review_text": "Dem pretty good game it dosent make much sense if you haven't read the manga or watched the anime but its pretty good all the same. recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Just giving this a thumbs up for now, it's good , the online is good, it's not that laggy but you just need to find people if you have a bad time finding. Will write a better review later",
            "review_score": "1"
        },
        {
            "review_text": "  do u think add all donquixote family dellinger trabol pica diamante and more ? i want to play with them",
            "review_score": "1"
        },
        {
            "review_text": "Well that was, in a word.  Bad.  I waited all that time for a choppy mess that somehow has gameplay even more basic and janky than even the worst games in the Ultimate Ninja Storm games the system was based on.  I'm disappointed really, bored and disappointed.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is reaaaall good.  But the Problem here is, no one plays it on PC. If you have an PS4, buy it there.",
            "review_score": "-1"
        },
        {
            "review_text": "  why i can't play with Controller in the game",
            "review_score": "1"
        },
        {
            "review_text": "i think the game is boring , but i still like it . that's all !!",
            "review_score": "1"
        },
        {
            "review_text": "  its very disappointing game",
            "review_score": "-1"
        },
        {
            "review_text": "someone!! help me out!! having trouble w/ One Piece Burning Blood just bought it yesterday but i can't play it due to the game crashing during Loading after i go to the Paramount War  how to fix the problem!? help me T^T",
            "review_score": "1"
        },
        {
            "review_text": "I'll update this as I play more and more, but so far so good!  All characters feel distinctly different despite following the same basic attack structure (short range, long range, etc.), and they are all VERY faithful to their anime/manga counterparts. Also impressed with the music which, even if it isn't straight from the anime, it is very clearly themed after it and sounds more One Piece-like than in other games such as, say, Pirate Warriors 3 (where the music was sort of bland and didn't really connect with the series it was trying to emulate).  Gameplay is both basic and complex at the same time. If I had to compare it to anything, I'd say imagine a slightly deeper fighting system than in something like Smash Bros. with three character teams with teammate swapping ala Marvel vs Capcom, while also having the 3D freedom of fighting games such as Cardinal Syn, Destrega, Dissidia, Ehrgeiz or various Naruto fighting games (the one I played the most was Naruto: Gekitō Ninja Taisen! 3 which it has some similarities to in terms of freedom of movement).  The story mode is kind of ho-hum since it is just the Marineford arc copied verbatim. I found myself skipping the cutscenes because it pretty much plays out just like the anime does frame by frame. Not a bad thing if you want to relive it, but I'd prefer to watch the anime if I want to see the arc fully reenacted. It's still a decently enjoyable mode, but it would've been way cooler if the story mode focused on climactic fights from various arcs throughout the entire series thus far and allowed us to play as everyone on the roster at least for one fight each.  Overall, probably not a game for anyone who doesn't follow/like One Piece since the game really seems to rely on having at least some knowledge of the One Piece world (I could just imagine some people I know turning to me and asking what both Haki and/or Logia means and me trying to explain it to them like they're idiots). However, if you are a fan of fighting games and One Piece, you should get some fun out of this. Don't expect the depth of Street Fighter or Tekken because it's not that kind of fighting game, but there's still a decent amount of meat on these bones. Enjoy it before Luffy picks them clean.",
            "review_score": "1"
        },
        {
            "review_text": "There is a lot of characters ,, I will say it's best one piece game",
            "review_score": "1"
        },
        {
            "review_text": "Cool 1",
            "review_score": "1"
        }
    ]
}