{
    "app_id": 425210,
    "name": "Shadwen",
    "release_date": "2016-05-17",
    "developer": [
        "Frozenbyte"
    ],
    "publisher": [
        "Frozenbyte"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Workshop",
        "Includes level editor"
    ],
    "genres": [
        "Action",
        "Adventure"
    ],
    "tags": [
        "Stealth",
        "Action",
        "Female Protagonist"
    ],
    "achievements": 48,
    "positive_ratings": 587,
    "negative_ratings": 179,
    "price": 12.99,
    "description": "Shadwen is a 3rd person stealth-action game where the only rule is to remain unseen. Stay hidden - or the ruthless guards will kill you on sight!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/425210/header.jpg?t=1547125239",
    "minimum_requirements": "OS: (64 bit / 32 bit *) Windows 10 / 8 / 7 / Vista Processor: Intel Core i3/i5/i7 1.8 GHz CPU dual-core. AMD 2.0 GHz dual-core. Memory: 4 GB RAM Graphics: NVIDIA GeForce 260 / Radeon HD 4000 Series / Intel HD Graphics 4000 DirectX: Version 10 Storage: 6 GB available space Additional Notes: * Highest graphics detail levels are only available in 64 bit OS",
    "recommended_requirements": "OS: (64 bit / 32 bit *) Windows 10 / 8 / 7 / Vista Processor: Intel quad-core 2.0 GHz or dual-core 2.6 GHz Memory: 8 GB RAM Graphics: NVIDIA GeForce GTX 560 2GB / Radeon HD 6850 2GB DirectX: Version 10 Storage: 6 GB available space Additional Notes: * Highest graphics detail levels are only available in 64 bit OS",
    "reviews": [
        {
            "review_text": "Shadwen has completely rocked the stealth genre for me, with some very new ideas. Even if all those ideas aren't totally polished, there is a very strong foundation here and it's definitely worth picking up.  Stealth games are one genre that I have wanted to love so much, but I felt tended to be quite restricted to 'the experts'. When you do find one you can play, it's often because it feels like it's been made 'forgiving' for you, like allowing Sam Fisher to storm the gates with a silenced shotgun (Or, silenced Tranquilizer Machine Gun if you're playing pacifist). Guards may find you, but give them a few minutes and they'll forget you - and in spite of a story that says 'They can never know we were here', you will get spotted and hide many times. The concept feels like it could be so much fun, but only if you're a grandmaster of it; if you're the 47 silent assassin type who knows the guard patrols before even hitting New Game.  Shadwen could be called 'forgiving', but I prefer to think of it as being much more forgiving of experimentation. Reflexes are in no demand at all because time only moves when you move (SUPER. HOT.) Hiding in the correct alley or using the right tool the moment a guard turns a corner becomes a *choice*, not a required instantaneous response. Taking reflexes out of that equation turns out to provide many, many more options.  Execution is also a major flub of stealth games. Everyone has had a moment where they crept up behind a guard in a game, hit the attack button, and missed, resulting in the entire base going on alert. Worse, the next thing that happens is either you run and hide, extending a part of the game you don't enjoy, or you instantly go to Reload Checkpoint, using the game's of-course-achingly-slow loading times. Shadwen has a physics engine that is part of the core mechanics - so it certainly doesn't give precise results to rectify that type of fumble. But, it does let you rewind time at any point; which initially feels like a complete cheat, but essentially imitates little more than the quicksave-bog many old PC gamers have already trod through. And, it allows the designers to safely try out a number of scenarios.  - You can never be caught. Instead of any kind of ALERT phase, guards simply instantly kill you with a crossbow (showing 'Rewind to continue' onscreen, like Braid). - Physics items are a big part of distractions and even special kills in the game. Even if you happened to push one off a ledge at a bad time, you can try again right away. - Single use items can be experimented with freely, rather than worrying about accidentally wasting one. - As a nice aside, if you interrupted a guard's unique conversation by kicking a dog, you can rewind to hear him speak.  Plenty of times in other games I've only figured out the right time to use the right item in the right spot *after* the moment has passed. This happens in Shadwen too, until I realize I can just go back to that moment.  The topic of Lily, the girl you escort, will likely come up as the only thing more horrific in games than 'escort mission' is 'stealth escort mission'. In reality, Lily is little more than the result of a game design session where it turned out that with merely an hour's practice, players could use the game's Grappling hook to fly through the level at mach 2. Lily cannot actually be caught by guards - but she will only move when they're not looking or dead, meaning even if Shadwen herself has many movement options, you still need to work out a safe ground path to the objective.  On the topic of killing, Shadwen also makes pacifistic runs pretty difficult, and it feels more rewarding. There is no 'knock unconscious for an hour' button, only the ability to briefly distract guards in various ways. There may be a later difference in ending for never killing anyone, but that's not the reason I'm trying it. Shadwen simplifies stealth enough that it actually becomes fun, rather than a slog, to challenge yourself in a way that you'd prefer.  A few small negatives I will note, firstly (although it's a pretty common negative that's never made a game much worse for me) is pretty dumb AI. Hearing the desperately-varied 'I heard a noise' line gets tiresome, and seeing guards confused by the rogue hiding behind a twig-sized bush is kind of silly. In addition, most of the storyline is told through concept art cutscenes, which are not stellar but serve their purpose. These are little bits of polish that might have been nice to see rounded off, but they don't affect the package - especially for its price, Shadwen has much uniqueness in the stealth genre to offer.",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game with basically no knowledge of what it was, loaded it up, and immediately saw that everything looked frozen when I moved. 'Wow, this game is awful,' I thought. Then I figured out that that was the mechanic - similar to SuperHot, the world only moves when you do. This is incredibly handy as the game progresses, and indeed is almost essential at some points to make some of the cool grappling hook maneuvers and synced kills (if you go that route).  Some random thoughts on the game:  - The AI is not great, but passable for a Stealth game; not great, laughably terrible at dealing with certain things, easy enough to game once you understand the patterns... but just complex enough to be a bit of a challenge rather than just a time waster. - The grappling hook is a ton of fun. The physics around it gets pretty silly at times, but this is a fun adventure game, so that's not really a negative. - There's a morality system. And like most morality systems, as far as I can tell it doesn't really matter much. At least this one has the benefit of being unique in that you're not really concerned about whether or not you kill, so much as whether or not you let the little girl see you doing it. - The graphics are great, I really like the atmosphere in this game. - The guard conversations occasionally made me feel bad about killing them. :)  Overall, despite a few rough spots this game is quite a bit of fun. If you find dumb AI frustrating then you might not get as much out of it, but if you're okay with that then I'd say it's worth at least grabbing and farting around the first level. The modding system looks like it could potentially extend the value of the game further too.   Money well spent!",
            "review_score": "1"
        },
        {
            "review_text": "I love stealth games. I love having the option to finish the game in total stealth or to kill everything I see. I love the rewind time mechanic instead of having to reload every few minutes. It helps you stay in the game. I love the lily mechanic which in a very natural way forces you to solve some navigation problems every level in clever ways.   Quite frankly this is close to the perfect game to appeal to my particular tastes. Halfway through I was already hoping for this to become a franchise with many sequels.",
            "review_score": "1"
        },
        {
            "review_text": "This deserves to fill a spot in my Stealth game collection alongside Dishonored and Styx - although a simpler and shorter game, it is fun. I love a violent sweep of the area, picking off enemies one by one, and this game delivers that well.  Things got a lot easier once I realised I could do an aerial kill, and could assign a keybinding to turn off the 'pause time' feature. My best bit so far is a long swing on my grapple, jumping off the end and diving into an aerial kill of a guard in a tricky to reach spot.  To be honest if you are playing the violent way you can forget about the little girl, she just catches up to open gates. I imagine you have to take more care over her if you are playing non-violent.  [Update] I started a non-lethal playthrough, much harder and more annoying. Then I realised you could get the non-lethal ending despite killing if you hid dead bodies from the girl. Now this would be easy if the girl went to the waypoints you set and stayed there... but she had an unhelpful habit of running straight into my murder scenes.   In the end I went back to ignoring her and went for a stylish lethal playthrough. One thing I learnt on my 2nd play is that while enemies can normally only be knifed from behind, if you do a tiny bunny-hop it turns into an aerial kill and you can knife them in the face - great when you're taking on multiple opponents on the ground.  So I had lots of fun on 2 playthroughs, and even got the hang of traps the 2nd time (You're traps restock between missions, so have fun with them!)  [Update 2] The physics works really well in this game. Rather than just having a few obvious set-pieces, the world is full of physics objects which you can use as cover, distractions or even weapons. So now my 2nd favorite moment is attaching a mine to the front of a cart and rolling it into a group of guards, and my third favorite is pushing a crate of a high ledge to kill a couple of guards then diving down myself to finish of a third with an aerial kill.  [Update 3] After several more lethal playthroughs I decided to try for the non-lethal and silent achievements again. It does feel like a different game doing this - each area has a very different gameplay in non-lethal play. Interestingly areas that are hard in lethal can be easy in non-lethal and visa-versa so playing both ways does give you good value.  On the whole I prefer lethal, because the enemies are easier to predict and you can slowly thin out the guards. Non-lethal requires a bit more patience and luck especially in areas with lots of guards. I found myself orchestrating the guards from up high, tapping 'T' to direct the girl until she finally managed to run through the viewcones. By the end I got the hang of the way the girl moves, and it is consistent hopping between cover when the guards aren't looking, and backpedalling to earlier cover if spotted.",
            "review_score": "1"
        },
        {
            "review_text": "The game is awesome. I love mechanics and the story. I like it that you need to try harder to stay in good terms with the girl, cause you need to avoid her seeing how you kill guards, so mostly you need to just disctract them and sometimes its quite challenging.  Small tip - follow the girl as she starts moving, most of the time she knows when the right time is =)",
            "review_score": "1"
        },
        {
            "review_text": "I'm going to recommend this game, but it's right on the border. The gameplay is fun... for a short while. You start out with an actual storyline, but then it just disappears, while you work your way through very repetitive scenarios. The guard AI is very, very stupid, and predictable. A lot of the maps feel like they're just filler content.   But it'll be fun for a couple of hours.",
            "review_score": "1"
        },
        {
            "review_text": "I really like this game, though it did make me rage a few times. The art style is beautiful, but the levels are a little repetitive, and the grappling mechanic is a somewhat clunky at first. If you're a hardcore stealth gamer, this game is probably too easy for you. Maybe medium-low on the difficulty scale.  Overall, I feel it was worth playing, regardless of it's flaws. What game doesn't have a few of those? Very likely I'll play it a couple more times to 100% the achievements.  ",
            "review_score": "1"
        },
        {
            "review_text": "Such a pity. I really wanted to like this game, but it was giving me a headache after a half hour. Time stops when you stop, which seems like a great mechanic, until you find yourself stopping often to reposition the camera. Then it's just a nuisance. The controls also seem to be fixed, at least for the controller. I was having a hard time positioning my fingers to keep time moving while trying to rotate the camera and move. Then there was this odd issue where my characters kept crouching even though I hadn't pressed the crouch button. I like a good stealth game but the time mechanic is not for me.",
            "review_score": "-1"
        },
        {
            "review_text": "Interesting take on the stealth genre. Gameplay is a lot like Supahot, where time only moves when you do. At any moment you can reverse time to undo your actions, seemingly limitlessly. The majority of the game is using your grapeling hook to swing, climb and move boxes in an attempt to distract guards so that a little girl named Lily can navigate from hiding place to to hiding place. You can also kill the guards by dropping things on them, luring them into traps, or assasinating them, but if the body is spotted by another guard then you lose and have to reverse time to choose again. There is no story explanation for why this time control is present, you're just meant to take it in stride.  The game also features a moral compass. If Lily sees you kill someone or encounters a body you didn't hide, that negatively affects her opinion of you, which is reflected in the dialog between levels. It does not appear to affect the story at all, however, and the final cut scene is determined by if you choose to kill the king in a Yes/No question. The story itself is told by listening to the guards as you move through the game. A corrupt and possibly mad king is driving his kingdom to doom, burning the forests and the crops out of fear of 'dark spirits', a phrase uttered so frequently in the game that you'll get sick of it. Despite how little story there was, the characters of Shadwen and Lily felt very fleshed out and I felt attached to them. I want to know what happens to them both after the end of the game, and I want to know more about Shadwen's backstory and how she became a rogue.  In terms of content the game is probably reasonable for its $17 price. It took me about 9 hours to play through without letting Lily see me kill anyone and I feel like I got my moneys worth. However, the game really could have used some more interesting mechanics in the later levels to break up the repetition. Some levels have movable parts of the terrain, but they don't contribute anything to getting through the level and seem to be there just for flair. The most mechanical thing one does in the service of completing a level is to use the hook to pull a locking bar out of a door.  The game features 9 deployable traps which you unlock by finding schematics in chests, and then constructing the traps from parts also found in chests. However, the traps are not reusable and supplies to remake them are very limited, so the traps end up falling into the 'Too Awesome To Use' trope. Every time I used one I ended up reversing time and finding a different way to accomplish the same thing. The traps also become completely useless if you're aiming for not killing anyone.  Voice acting was pretty good, but not very diverse. There are perhaps three Guard voices, and the same lines get used over and over again as the guards react to things moving in their environment. This becomes comical eventually, as the guards react to things moving right in front of them with 'Did you hear something?' The game also suffers from a lot of animation problems, such as the player character going rigid while being whipped around on their rope, or all the guards walking like they have to use the bathroom, and several times I managed to get objects (including Lily herself) stuck in the terrain. This was very frustrating at one point where I lost portion of my progress because a tipped over cart in the previous area suddenly sprung out of the terrain and killed a guard, raising an alarm.  In spite of these flaws, I enjoyed the game quite a bit",
            "review_score": "1"
        },
        {
            "review_text": "game's kinda fun. painfully ♥♥♥♥ing easy. the rewind mechanic means that nothing is a threat, ever. within the first five minutes the game turns into 'abuse the ♥♥♥♥♥♥ AI to win'. and the crafting system is ♥♥♥♥ing stupid, not like you'd ever want to use it anyway because everything you can craft is ♥♥♥♥ing boring and useless.",
            "review_score": "-1"
        },
        {
            "review_text": "A fantastic game for the killer in all of us.  While many complain about the Escort Quest portion of this game -the whole game- I never once found it intrusive. Despite guards seeing my waif counterpart, not once did I lose because of this, and all she really acts as is a key you need to get to the end of each mini-sandbox style stage.  That being said I also was a merciless psychopath, killing any, and all guards, in my path -which is a viable way to play- so perhaps my wanton slaughter had something to do with it.  The mechanics are some of the best I've seen in a stealth game, time only moves when you do, and besides that the best way to describe gameplay would be, imagine Spider-Gwen gave up her life as a superhero and instead decided to become an Assassin.  I highly recommend this game to anyone who even remotely enjoys stealth/assassination games.",
            "review_score": "1"
        },
        {
            "review_text": "A stop-time mixture between a sneaking game and a puzzle game. It's quite fun but becomes a bit repetative after a while, great value for the low price on the other hand.",
            "review_score": "1"
        },
        {
            "review_text": "It's a really fun and interesting game. Kind of short, but make sure to give it a try, you won't regret it.",
            "review_score": "1"
        },
        {
            "review_text": "This game ... is great.  Thoughtfully designed ... and lovingly made.",
            "review_score": "1"
        },
        {
            "review_text": "Great sneaking game, interesting dialogs with plenty of achievements to make it work a few play throughs.  The 'Auto-paused' and the 'rewind' makes this game a laid back relaxed puzzle game in an assassin/stealth environment; combined with the protect the child from seeing death while back stabbing the guards is a nice story twist.  I really enjoyed playing this game and would highly recommend it if you like sneaking around. Remove the cone of lights for added challenge!",
            "review_score": "1"
        },
        {
            "review_text": "Get it on sale. It lacks a lot of depth but even then it's enjoyable, simple straight forward stealth game. I wish they made it a bit more difficult but eitherway it's a good pickup when on sale. With a bit more polishing and refinement on level design/depth this game could've been much greater.",
            "review_score": "1"
        },
        {
            "review_text": "Shadwen is a stealth game in which you sneak past or stealth-kill guards while on an assassination mission, all while escorting a little girl with you for really no good reason. She's all 'Ima follow you, gurl! You can't stop me!' and my assassin chick is all 'Okaaay, but do what I say,' when she  could  have simply replied 'Um yeah, I have a grappling hook that'll let me cross town in seconds while you have stubby little girl legs and can get your butt kicked by the city watch. You do what you want, but you'll never see me again. Now eat these friggin' apples and go away.'   Pros  + Time freezes when you don't press a button, so grapple-swinging from thingy to thingy is pretty fantastic and even managable for players lacking actual skill (i.e. makes it more of a mental practice for the player than a physical one).  + You can use the environment such as rolling big, wooden barrels or breaking wooden crates to distract guards.  + You can hold R to rewind time if you die or get spotted or whatever! It's great and far more time-saving than checkpoints and loading.  + Graphics, music and sound are decent enough.   Cons  - The whole game is an escort mission. Almost everyone on the planet dislikes those. They're like water levels and sewer levels; generally unenjoyable.  - You are warned that the story is impacted if you kill with the little girl around...and she's always around. So I'm playing as an assassin and can't kill anyone in the game if I want the rainbow happy fun times ending. We all know the ending where you do the mean thing is almost always crap compared to the kindness ending.  - You can't even do non-lethal takedowns! I'm stuck doing distractions and putting myself at far more risk than knocking guards out and hiding their unconscious bodies. It works in Deus Ex, so it should work here. I should be able to club guys over the head.  - Waiting on the little girl's derpy AI to catch up can get you killed. There are doors you have to stand beside and pull a switch with Lily simultaneously. If a guard is patrolling or returning from looking into a distraction and Lily is caught on the game's environment/geometry, then she won't pull the lever and you get caught, and it's not even your fault.  - Uninteresting World-Building/Historical Setting. If this is in our world, the game doesn't make the history interesting or meaningful. If it's in a fantasy or similar world, it doesn't do anything to make that world intriguing from what I witnessed. Although I didn't play very long, the game needs to hook players in and make them want to see more of its world in this sort of game. Deus Ex, Dishonored, Thief (the old ones)...all of these series make cool places you want to explore and learn more about. I didn't care about this game's world because it didn't try to make me care.",
            "review_score": "-1"
        },
        {
            "review_text": "You know how everyone was let down by Trine 3 and it's 2.5D based gameplay? Now imagine playing Zoya with her grappling hook in 3D, it's a frustrating mess.. Another waste of money on a 'stealth' game or so they said, cause I can't really understand lately how people tag these games, based on what? It's a turn based strategy more like Ronin but in 3D, which means it isn't a stealth game. Whelp seems like I'm gonna replay Dishonored again or something",
            "review_score": "-1"
        },
        {
            "review_text": "Nice graphics and original gameplay. Recommended!",
            "review_score": "1"
        },
        {
            "review_text": "Do not buy this game. It's unbelivably broken and ugly, and nothing about the gameplay is interesting enough to justify everything you have to deal with. I've had guards notice me when they shouldn't, not notice me when they should, and have been accused of killing a guard when I distracted him and snuck by. I've also had several hard crashes. All this in, as you can see, less than an hour of playing the game. Not worth your money or your time.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't like the 'time stops when you stop' part.",
            "review_score": "-1"
        },
        {
            "review_text": "I love this game! The ability to choose how you want to beat each level, the whole time stopping thing, listening to the story unfold between levels, listening to guards talk to one another, just an amazing game. I would reccomend looking up all of the other endings once you finish though, the story is deeper then it appears. I love everything about this game, totally hoping for a sequel.",
            "review_score": "1"
        },
        {
            "review_text": "Graphics - just okay. Story - Its okay for what littler there is in the loading screens. Gameplay - I went the don't kill anyone route and it was very easy to just pull a few barrels and sneak past. still the stealth in the game is okay although rather repetitive  The girl makes no sense to me. You're an assassin who saved a girl one time and then take her through all these levels for what reason just a hinderence.  I enjoyed completing the game but i finished it in 6.5 hours. if its an average game i usually like to give it £1 per hour whereas this price tag is £12.99. there is no real replayability there is custom mods and levels but the base story got repetitive so i doubt ill be playing it again. if its on sale for less than £7 give it a go.",
            "review_score": "-1"
        }
    ]
}