{
    "app_id": 426000,
    "name": "HunieCam Studio",
    "release_date": "2016-04-04",
    "developer": [
        "HuniePot"
    ],
    "publisher": [
        "HuniePot"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 18,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Mature",
        "Nudity",
        "Sexual Content"
    ],
    "achievements": 16,
    "positive_ratings": 3214,
    "negative_ratings": 645,
    "price": 4.99,
    "description": "In HunieCam Studio players take control of a sleazy cam girl operation. Rake in stacks of filthy internet money and attract as many disgusting fans as you can in this fast paced, click happy and thoroughly perverted take on the business tycoon / management sim genre!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/426000/header.jpg?t=1461512901",
    "minimum_requirements": "OS: Windows XP (SP2)+ Processor: 1.2 GHz Memory: 2 GB RAM Graphics: DirectX® 9 Compatible Graphics Card DirectX: Version 9.0a Storage: 1 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "perfect for breaks from conquering europe",
            "review_score": "1"
        },
        {
            "review_text": "Picked Tiffany to start with because she's my favorite from Huniepop. 'Rented' her out at a sleazy motel just once. She caught an uncurable STD which basically left her broken and worthless :( Kept her around to run errands for the other girls, feeling bad for her the entire time.  She never let go of her cheerful attitude.  10/10, what an emotional rollercoaster.",
            "review_score": "1"
        },
        {
            "review_text": "What you first have to understand is that this game is in no way a sequel to HuniePop. It takes place in the same universe, seemingly two years after the events of HuniePop but the similarities end there. HunieCam Studio is a clicker/time management/sim type while calling it a 'clicker' game doesn't really do it justice. You manage a cam studio corporation where your goal is to get as many fans as you can using different girls and fetishes.  Pros:   -Great interface  -Easy to play once you figure out the learning curve  -Obtainable achievements   -Pleasant soundtrack  -Great voice actors (though you don't hear much of them)  -Many different STD's and effects brought to the girls from them  -Many more fetishes that I didn't really think about until this game (so thank you for that)  -Challenging gameplay  -'Rock Hard Mode' where you can up the difficulty if you find it too easy towards the end (thank you)  Cons:   -I found myself to be a bit bored the last couple playthroughs, just trying to get enough tokens for the last achievements, watching YouTube while I just clicked and moved girls around  -After you've obtained all the achievements that's really it for the game. Unless you want to beat your score, there's not much reason to go back to it   All in all, I really enjoyed this game. It was thoroughly entertaining and I'm not sure if I'm proud to say that this is one of two games I've gotten all the achievements on. 9/10 hope to see more from these devs.",
            "review_score": "1"
        },
        {
            "review_text": "what am i doing with my life",
            "review_score": "1"
        },
        {
            "review_text": "Played the game. Discovered cake farting. 10/10 changed my life.",
            "review_score": "1"
        },
        {
            "review_text": "Keeping Audrey on coke 24/7 for maximum work efficiency, Tiffany as a dedicated booze &amp; ciggie supplier, and Nikki servicing customers 'privately' in the motel.  Love it.",
            "review_score": "1"
        },
        {
            "review_text": "I had my doubts about this title, but it actually happened to turn into a rather decent experience. First thing's first - this is a time management game. Second, best you will see are drawn girls with decent attribues. There is no nudity, The developer decided to take a step back from Huniepop and actually make a rewarding game that would please more people, and not a moaning simulator, as you desperately try to destroy rows and rows of random icons in an attempt to make a drawn girl come and see a few naughty pics. Apart from that, you will need to click. A lot. Thank god, not as much as you would need to do in clicker heroes. And no, you do not need a clicker program :)  But then again, you have 21 game days to get a diamond trophy. This is challenging.  So, let's take a look at the GOOD:  1. Very colorful with a very pleasant sountrack. 2. The pictures of the girls never go over the top. There is no nudity, and I find this good, for I prefer real life nudity... Enough said. 3. The gameplay is engaging. You learn how to do stuff, and unless you got really disheartened and looked for guides, this game offers easily 15+ hours of enjoyment, which is almost 4 times its purchase price on this summer sale. 4. Allowing the game to teach you, and let you concoct new strategies and set them in motion is a great feeling. 5. The charge up to the coveted diamond prick trophy really feels good, especially if you do it yourself, like I did, and learned from your mistakes - like I did. 6. Strategy wins you the game - which is a rare thing to say about clicker games. 7. A normal game takes about 1 to 1.5 hours, provided you don't lose it. Same if you go for diamond (as gold is like halfway trophy here). 8. Seeing your strategies win is a great feeling. 9. Relatively easy to get achievements if you play well, which is always good. 10. Accepting this game for what it is: a casual game - really helps. 11. If you get a good setup going, you could have a diamond trophy worth of fans way ahead of the end date, and SAVE yourself lots of clicks and thus, HEALTH (your own I mean). 12. In essencence, you get to have your own chaturb... I mean cam studio. It feels good :)   And now, the BAD:  1. Do you, dear sir or madam know how does it feel to have a game (or gaming if you will) shoulder? Or, better yet, do you know how it feels to have a gamer's wrist? Like that one that feels sore after all those hours of clicking? If you don't, well, this game might teach you. If you play many games in succession, Huniecam can be quite adverse to your health. I for one, was happy that I played it on a laptop + mouse - this way I got to remedy my sore right (or left) shoulder by using my other hand. A Laptop's touchpad would do wonders for your health this time. Or, maybe taking a break and doing something productive :) 2. The game is actually quite hard unless you cheat and read up. It will take you a few tries to do well. On my first go, I thought I was doing realy well - 8 girls, money, good upgrades - only to grab a bronze di... I mean trophy. Yay... 3. People who don't like clicking like crazy might be turned off - for good reasons...  Conclusion:  I would srongly suggest to accept this game for what it is: a casual clicker with deep strategy and underlying eye candy theme. Once you do, the frustration will wither, and you will be able to think more clearly and experience the game for what it is. I quite like Huniecam. It is a great game inbetween sessions, one that makes you go for... no, not gold, it is diamond. I really enjoyed getting all the achievements, and for the money I paid, the game quadrupled them in gameplay hours. I call this a good buy :) And you, have time to grab it till the sale ends, or wait for another one. Or grab it at full price and resist the urge to look for guides - cause if you read up, you will be done with all achievements and trophies in roughly 5 hours, while in my opinion it would take thrice that to master the game and wil it all. Do not deny yourself the pleasure of discovery. It feels good!",
            "review_score": "1"
        },
        {
            "review_text": "*i treat my girls with respect. no special private one on one sessions without protection and coke for my lovely ladies.",
            "review_score": "1"
        },
        {
            "review_text": "You will enjoy this game if you: 1) Enjoy games with strategy and time management elements 2) Enjoy collecting achievements and other game-related collectibles 3) Like the art style 4) Don't mind Kyu's abrasive dialogue 5) Don't get bored easily  After watching a few YouTubers that I follow play the game, I decided to pick it up because it looked cute and I enjoy games with strategy and time managements elements. Took two runs to really get the hang of, which I appreciate, because if I had gotten that dope ♥♥♥ Diamond ♥♥♥♥ after just one run, that would've been very disappointing. If you're the kind of gamer who's addicted to collecting all of a game's trading cards, achievements, and other community rewards, this game has a lot of replay value. I've been playing this game all day and, as one of those types of gamers, I have absolutely no regrets spending a few dollars ($15) to pick up the trading cards in the market to complete the badge.  I've also enjoyed going through and grabbing as many achievements as I can each run and unlocking outfits and hairstyles in the wardrobe. Recruiting and using the girl you just customized with the tokens you got from your last run is a nice feeling.  The game is a little challenging at first, but pretty easy once you get the hang of it (as long as your girls synergize well with their accessories and fetishes). It does get very repetitive, though. The music is the same two tracks for day and nighttime and the background isn't very engaging (besides the mandatory dragging girls on buildings). The longer I sat down to play, the longer it seemed to take. I recommend taking breaks to grab something to eat or stretch, because playing this game for a long period of time actually makes you feel like you're managing a bunch of cam girls, and it is taxing. Oddly enough, though, after playing this game literally all day, I feel a bit of attachment to the girls I've had the most success with, and, even if they're not very good, I still feel the need to use them and make them the best little cam girl they can possibly be (Kyanna is best girl).  Overall, I've enjoyed playing HunieCam, and after I've collected all the achievements, outfits, and hairstyles, I'll be setting my sights on HuniePop. The game is worth it's price tag, and if they update it in the furture with more girls, background music, achievements, etc., I'll definitely come back to it.",
            "review_score": "1"
        },
        {
            "review_text": "I have seen the face god and it was weeping.",
            "review_score": "1"
        },
        {
            "review_text": "HunieCam Studio is a time management game that will have you juggling the activities of the various girls you employ in your cam studio. The primary goal is to meet their needs and put them to work in order to grow your company fan base.   Replay value comes from trying to improve upon your previous performance. I personally found this to be a good format. The short length of each play through allowed me to work on my score without investing obscene amounts of time. While the core of the game remains the same each playthrough you can pick different girls and target different fetishes.  There is no nudity however the game has the same style of humour as HuniePop. The same kind typical in a newgrounds game. It is definitely not somethingI would recommend for children or those who are offended by cheap sexual humour.   HunieCam Studio comes trading cards, achievements and has no paygates or microtransactions. It is not the masterpiece HuniePop was but all points considered, and given the asking price is actually quite small, I’m not disappointed with this purchase.",
            "review_score": "1"
        },
        {
            "review_text": "Made Aiko drink box wine and gave Audrey syphilis.  11/10 GOTY",
            "review_score": "1"
        },
        {
            "review_text": "Despite the art and gameplay changes from Huniepop, HunieCam Studio is a decent game. If you're looking for something to pleasure yourself to, try something else. But if you like clicker games, this is probably the best one I've played.   Pros: -Familiar characters from Huniepop -Lots of stuff to manage -Replay value with tricky to get achievements and unlockable wardrobe/hair options -Sense of humor from Huniepop carries over -Easy to figure out the basics  Cons: -Can take a while to figure out the most efficient tasks for your girls to be doing, can be easy to run low on resources if you don't know what you're doing -Fans of the art style of the previous game will be disappointed -Lack of nudity (but really, the art style isn't well suited to nudity)  I really think this is a worthwhile purchase, especially if you enjoyed Huniepop.",
            "review_score": "1"
        },
        {
            "review_text": "It's okay as a management game, but too shallow and too easy. I finished my first playthrough with over 3x the fans required to get the top trophy. The unlockables would be much more rewarding if there was adult content, but eh, this is steam.",
            "review_score": "1"
        },
        {
            "review_text": "now i can feel like i'm successful and it's all thanks to the tiddy",
            "review_score": "1"
        },
        {
            "review_text": "Coochie-Crusher, amirite!?",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun game, it's both a clicker and sort of a business sim game. The first two-three girls will determine who your primary consumers will be, along with whatever fetish devices you decide to have them use (I didn't even know cake farting was an actual thing). After that, you have to juggle employees between training, free promotional pics, resupplying, and working, as well as upgrading your business and buying ads on websites. I'd recommend only using the escort service if you really need upgrades and/or are in the deep red. However, if you keep your head on and plan your moves ahead, you won't need to worry if you dip into a little debt, since you'll pay it off in an hour or two (in-game time, of course).   Only complaints I have right now is that:     I don't favor the art style they did for this game over HuniePop (opinions)     The only goal in the game is to get as many fans as possible. Not even 'Achieve this much revenue'. Some of the achievements sort of address this, such as 'Get to Bronze without using any accessories'. 'Complete the game without falling below a certain amount of this thing', etc., but I digress. I thought the game would've been more challenging, if it had more mandatory goals.     It won't even take you two hours to beat the game. At the time of making this review, I've logged 3.5 hours, according to Steam, and I've beaten the game two times already. If I had to compare it to something, it'd be like 'Wow, this movie about [your favorite game/book] is fantastic, they got decent actors and stuck to the source as much as they could. Too bad it was only 20 minutes long'. My example may be a little unfair, but I think you get the gist, it's a nice but short game. Real short.     Not a lot of replay value. This point is the embodiment of the previous two points. Sure, you can unlock clothes and hairstyle for the girls, but, as you can see in the screenie link, I didn't get  ♥♥♥♥  for the first run, but I did get the golden weenie on the second try. I got enough points from both runs that I could max out three-four girls. If I keep getting just gold, I imagine I could unlock everything within a short amount of time. And that's if you're the type of person that gives a damn about cosmetics. Speaking of which, that's the only thing that you can unlock. The game has nice little loading screens here and there of the girls doing cam-girl things, but there's no gallery like in Huniepop. If they had that, I'd have been okay with replaying the same thing again and again for it. Maybe even some development art, I'm a real sucker for that. Anything besides just having clothes/hair to strive for.   That said, despite everything negative that I've said about the game, I feel like I'm getting my money's worth. I would very much like to see the developers add more content to the game in the future, either for free, or for a nominal fee. Preferably the first few/all of them for free, the game is a little barebones, even for the price of getting a fast food meal.  It's a great time waster, and I'd recommend picking it up, either on sale or for regular price .    I will reiterate though, I got the Gold ♥♥♥♥ on my second try, after getting my feet wet with the first. So either the game is easy, or   I am the cam, I am the one who faps  .   Not really, it'd have been more impressive, albeit sadder, if I got Platinum or even Diamond.        ",
            "review_score": "1"
        },
        {
            "review_text": "Addictive clicking game that strangely keeps me hooked by the promise of diamond ♥♥♥♥ trophy",
            "review_score": "1"
        },
        {
            "review_text": "Please help me. I can't stop.   HunieCam Studio is a fun game, sure it seem's boring after the first 2 hours but it seems challenging at the same time, trying to beat your own high score, collect all the outfits for the girls, get over 100K fans. The game provides a ton of re-play value that some people just ignore entirely.   It's not HuniePop. HunieCam Studio is a game of its own. It brings back characters from HuniePop like Nikki, Tiffany, Jessie, ect. But adds a ton of new girls. In total HunieCam has 18 girls and it provides a bunch of oprotunites to play with. Like having an entire all MILF Harem or no girls that smoke but drink constantly Harem. It is a fun game. The art style is cute, the voice actors are great and the game mechanics are easy to understand. So I'd recomend HunieCam Studio to fans of HuniePop but are into slower paced games like tycoon games. 8.5/10 &lt;3 I love this game.",
            "review_score": "1"
        },
        {
            "review_text": "People here are saying there isn't a lot of content but I disagree. The mechanics are deep and the game itself is quite challenging. Similar to HuniePop the mechanics can get repetative but the humour and your own drive to complete the achievments are the big driving factor for playing this game. 100% this game can be a real challenge if you don't really focus. Some of the achievements are simply grindable and others are truly challenging and interesting. This game is not for someone who doesn't think of achievements as part of a game.  Overall, the game is worth $7.00USD IF you want to get all the achievements and appreciate some of the more lewd humour the game has to offer. If you liked HuniePop for anything but the lewd pics, you'll probably find some value in playing HunieCam Studo.",
            "review_score": "1"
        },
        {
            "review_text": "If I had to give HunieCam Studio a /10 ending (5/10 being average) I would give it an 7.5/10.  I'll list most of the things I found good and bad about the game down below. I will try to not compare it to Huniepop too much as ratings should be not biased at all, but I will mention Huniepop a bit.   Pros:  Fast paced: This is something that Huniepop didn't have unless you count the sex scenes.   Good art: The art-style is heavily compared to be worse than Huniepop, but I think that the art style is great none-the-less.  Smart gamelplay: You can't just randomly choose girls and assign them to wherever you want and even expect to get the bronze ♥♥♥♥ trophy in this game. You get to think fast, and when you need a break, just open up a menu!  Great privacy: By minimizing out of the game, or opening another tab, the audio mutes, and the game pauses. Perfect for if you don't want a family member, friend, etc. knowing what your playing... You sick perv.  Goals: There are plenty of goals for the game such as unlocking all of the outfits/hairstyles, achievements, the ♥♥♥♥ trophies, and much more. There is a lot for you to do giving it replayability.  Voice acting: The voice acting for the game is superb, giving the game a sort of depth. You could totally imagine each character having this voice if you met them in real life.   Cons:  Unfinished: I feel like some of this game is uncompleted and needs to be finished. It can just feel... hollow.  Pictures: I know this sounds like such a pervy thing but it's not that big of a deal. I feel like it might have been nice to have more collectable pictures in the game. There are 18 in this game, and almost 50 in Huniepop. The pictures are one thing that can just bring you back to the game for one reason or another...  Difficulty: Look at guides and even an announcement by the devs shows that people usually get the Diamond trophy on their 2nd to 3rd playthrough, maybe 4 or 5 playthroughs if they aren't the best at these types of games. They are already working on this though as they have released a 'rock hard mode' which is tougher.  Stale: After a few times replaying the game, with the same girls, same buildings, same everything, it just gets kind of stale. I think they should have some way of rotating in one or two new girls and/or buildings in each playthrough, which are randomly chosen.   Overall, I found this game worth buying. It is compared to being just as good as or objectively worse than other clicker games, but I found this much more enjoyable than a good amount of these other clicker games. If you don't play many clicker games, this is a great game to get you in to the genre.   Good luck on that diamond trophy!",
            "review_score": "1"
        },
        {
            "review_text": "I wish you could see more t*itties and a*ss but its fun",
            "review_score": "1"
        },
        {
            "review_text": "First off i like this game but its boring at stages i wish it felt like i got something out of it but i jest dont. (i recommend this casue i dont hate it it is worth 7$ its jest boring somewhat)",
            "review_score": "1"
        },
        {
            "review_text": "always wanted to manage hoes 10",
            "review_score": "1"
        },
        {
            "review_text": "Honestly? I'm actually a lot fonder of the newer art style. I think it adds a more western approach and I really enjoy it. I like it a lot better than I like the original Huniepop.  Onwards:  Yes, this game is bad. But damn, did you play the first at all? This one is 1000% less vulgar and less ♥♥♥♥ed up. I love me some clickers too. I think a lot of people don't enjoy the game because they expected something too similar with the first. I think once you get past it being a 'sequel' then it makes it much more enjoyable. If you don't like clickers, this game probably isn't for you and you're better off sticking with the first game.  I do think there can be improvements; but I think as a small, clicker game it's one of my favourites. I also enjoy the time limit you get as I am a very competition based individual and I really like competing against my past scores. I understand why some don't like it; reviews will always be biased of course.  That being said: I wish we got more time with the girls a la Huniepop. I actually enjoyed getting to know the characters but again, I get that the game's not about story and is 100% a pervert's game. I still ♥♥♥♥ing love it. Haha.   Audrey, Kyu and Nikki are my girls from the first one and to see them back in makes me really giddy. I don't give a ♥♥♥♥ how annoying Kyu is I love her ♥♥♥. Lilian's my current fave though; goth brats got me good because I too am a goth brat.  Anyways, yes, it's worth the 6 bucks imo. You'll probably catch me playing THIS ONE in class since it's not as vulgar as the first. Still love it. I'll probably play this until I unlock all the outfits and achievements, simply because that's me. If you want something fun and quick and easy and kind of mind numbing (which is why I played Huniepop; to calm down during stressful situations), definitely recommend it. If you want something with more a story, then stick with the original.",
            "review_score": "1"
        },
        {
            "review_text": "Most complaints I've heard so far have to do with the gameplay and the art style. neither of which bother me, honestly. After the success of Hunniepop, I can't blame them for wanting to try something totally different. Maybe take a stab at other genres using this universe of characters. And I think that's a really cool idea.   and I honestly think this was fun to play. It's an enjoyable, casual little game that I can see myself coming back to if I ever feel like lazing through an evening. I guess there are better clicker/management games out there, but I'm not big on playing them. The Hunniepot devs sense of humor is what brought me to this, same as their last game. Regardless of the adult content.   So in the end, it's simple. You know what you're looking at. You know what kind of game it is. Does it look fun to you? Go for it. If not? Then don't buy it. It's that simple. Personally, I just feel like these guys are worth supporting so they can invest in bigger, future projects.",
            "review_score": "1"
        },
        {
            "review_text": "Coming in from HuniePop, the game's new art style is a bit jarring. It has more of a 'mobile' look, though that may be intentional.  The gameplay, however, is great. The clock keeps ticking, and you have to budget your time between training girls, having them work, and making sure you have enough cash on hand to keep everyone paid while still getting upgrades. It feels a bit short (21 day time limit), but has replayability which makes up for it.  Overall, good game, and I'd recommend picking up it. At $7 base price, you more than get your money's worth.",
            "review_score": "1"
        },
        {
            "review_text": "its a sim game with some fairly good humor. tbh its not as good as huniepop but its not bad",
            "review_score": "1"
        },
        {
            "review_text": "Like Roller Coaster Tycoon only instead of building Roller Coasters you ♥♥♥♥♥ out a load of ♥♥♥♥♥s 10/10 would ♥♥♥♥♥ again",
            "review_score": "1"
        },
        {
            "review_text": "cool but no nudity",
            "review_score": "1"
        },
        {
            "review_text": "And thats how cam girls are made",
            "review_score": "1"
        },
        {
            "review_text": "-Game takes less than two hours to beat (there's literally a timer on it). After that, you just get asked if you wanna do exactly same thing from scratch and beat your own record. So much goes for replayability. Ofcourse, after first playthrough, you'll maybe have some ideas how you can do business better. But as long as spamming leftclicks is not your favourite thing in life, you'll probably give it a second thought.   -Game lacks layers. HuniePop used to suddenly introduce you to new characters, some of which not only had very unique flavors, but some also asked questions from different hemisphere than the others. In HunieCam Studio, you would expect at least a new town with slightly different set of rules, after a first playthrough, so you'd have to adapt. But no, you're just being asked to do exactly same thing (the clicking) again.   -Not to mention, learning about the characters was already the thing that made HuniePop great. I mean, they threw the winning formula out of the window, which is the worst part about whole transition. You have to deal with (seemingly) lifeless $luts, which may be a fitting outlook when your goal in life is to become a godfather of cyber-PIMPing. But in a game like this, it's probably not worth it to sacrifice tons of satisfaction for a bit of realism.   -Game still has some good in it: pretty decent amount of content, fine learning curve, nice amount of hyperbolization and humor.   Some people will think this game is good, probably if they like min-maxing or setting records, or if they're just in love with LMB. Other will think this game is terrible, cause they won't like spamming clicks for diks. I think it's alright, considering the cost was only 2$ in my location.   I still will put a thumbs up on the game. Not because it wasn't a big letdown after HuniePop (it was), and not even because the game is fine in vacuum (although it is IMO). The main reason why I write this review is because I like authors and want them to get back on track and release another bang on game, so I can buy it and play it. Please, go back to drawing board and make a game which contains lots of RELATIONSHIPS with GIRLS and SEXUALITY.",
            "review_score": "1"
        },
        {
            "review_text": "So this is a game...  For me to run through the first part of the game it took me 1.7 hours.  It's a cute tycoon game that is probably worth the $7. You'll have fun and laugh, but it will get repetitive pretty quick. This game would probably be more suited as an iOS or Andrroid game.  You'll basically be sitting in your seat for an hour clicking on your screen mindlessly not even knowing what the end goal is. In the end you can continue building in your town or you can start a new game and try to beat your score.  In the end I would give it a 7/10",
            "review_score": "1"
        },
        {
            "review_text": "Fairly fun game. may offend some people and i wouldnt reccomend playing it at work but it was a good two days of fun. There is no nudity, but its still adult themed. Was worth playing to 100% simply cause some of the challenges are fun... reminds me a LOT of an adult version of a lemonaide stand game i used to play back on dos.",
            "review_score": "1"
        },
        {
            "review_text": "Everyone claiming to be 'so disappointed' because this game 'is nowhere near as good as Huniepop' and that it 'lacks depth and gets boring quickly' needs to stop and seriously think about those statements. Huniepop was little more than one of a thousand Bejeweled clones out there. The main difference is that it was wrapped in anime graphics with a really crappy dating sim and a sad excuse of a story (seriously there are p0rno's with better plots). Seriously, every single day played out the same. Track down chick. Give presents. Go on date. Repeat x3 and sometimes you'd be rewarded with partial pixel nudity. But it was the same thing. Every day. And it was boring. I enjoyed it, don't get me wrong, but after I had gotten a few days into I just wanted it to be over with. I kept going because I wanted to 'catch 'em all' so to speak. But don't kid yourselves. The girls weren't some amazingly deep creations that were so awesome I wanted to get to know them better. They were basically cardboard stereotypes with a thin excuse of a personality.   All that said. I enjoyed the game. Because it didn't try to be anything other than what it was. And after I got all the girls and finished the game I felt a deep sense of accomplishment. I was happy with it. But I haven't picked it up since.   I bought Huniecam Studio roughly 5 hours ago and have played through it twice already. I was getting ready to do a third run when I decided to swing by and leave a review.   This game might be boring to some people, but not to me. There's a hint of time management and a dash of tycoon game...in the end it is neither of those thing. It lacks the urgency of time management if you're not swimming in cash by the end of the game then you're doing something wrong.   It's not about either of those things. The game is all about increasing your fans and cash has no bearing on that. Just like Huniepop, it's all about finding the right combos and matching things up correctly in a specific amount of time. This time, however, the combos are much less obvious than different colored icons flashing on the screen.   This isn't a deeply innovative or life changing game and I wasn't expecting it to be. Instead it just is. It's enjoyable and it's best approached without trying to compare it to Huniepop. They're completely different games and Huniepop pales in comparison.   ",
            "review_score": "1"
        },
        {
            "review_text": "Once you get the hang of it, it is really fun. It gives the player a chance to improve because you cannot get everything done the fisrt time around and everything in there is possible to achieve. It's not Huniepop but that's good. Nobody wants to see tha same story and game all over again without the possibility of having something else to play too.",
            "review_score": "1"
        },
        {
            "review_text": "Ever been playing Skyrim and then all of the sudden you have the urge to be a pervert and be able to game at the same time? Well sweet mother Teresa's ♥♥♥♥ now you can!  HunieCam Studio is the latest hit from the people that brought you HuniePop, and it's taking sexy fictional girls to the next level!  With HunieCam Studio you can be the legal pimp of (whatever city you want it to be bby) by running your own webcam services. Hire all kinds of women to flaunt their packages on the internet for money, including your favorite women from HuniePop! Hone your skills in legalized prostitution to stride for the greatest award in all of gaming, the Diamond ♥♥♥♥ trophy!  Pros: -Sexy AF -A challenging game to keep you entertained -♥♥♥♥ -More ♥♥♥♥  Cons: -Not enough ♥♥♥♥  So go ahead and hit that 'purchase for myself' button, or even buy it and gift it to your friends so you can talk about how much dough your women are raking in during 1st hour of junior year.",
            "review_score": "1"
        },
        {
            "review_text": "A silly clicker with a funny narrator, just a bit of cheeky fun, and the developers are very cool, definitely worth it for 6:29.",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoy this game. Huniepop is definitely better, but this game is still rather interesting. I definitely enjoyed my time with it, going for the Diamond Trophy soon",
            "review_score": "1"
        },
        {
            "review_text": "If you're expecting huniepop 2.0, save your money and don't get this  For what it is, it's not bad. It's a simple time management clicker game, but with a limit of 21 days to reach certain goals. At first it seemed hard, but once you understand the strategy/method to get diamond with each run it becomes insanely easy. Each run is about 2 hours. If it's on sale, or you like these kinds of games, go for it. I wish there was more incentive to keep playing once you get the wardrobe, or even any incentive to keep playing on files past the 21 day range.",
            "review_score": "1"
        },
        {
            "review_text": "Well worth the price of admission. Simple, fun game, it even comes with a harder difficulty setting. If you ever wanted to know what it is like to live the life of the guy in 'Hot Girls Wanted' this is your ticket. Enjoy, and to all you naysayers, relax a buit, don't take things so seriously. Have a good laugh.",
            "review_score": "1"
        },
        {
            "review_text": "i really enjoyed this game. very fun and irreverant with enough depth of play to make it well worth the investment. good soundtrack and voice acting, nice art style, interesting play.",
            "review_score": "1"
        },
        {
            "review_text": "So I'll just put this out here.  This game is shameless fun.   Is 5$  It provided me with at least a good four hours of enjoyment.  It's not ashamed to be politically uncorrect in this day of politically correctness.  It shamelessly basks in its own political correctness  There are a few complaints though. 1. it's impossible to earn all the outfits of the girls in one playthrough, I get it's designed for multiple, but the reality is i’d rather have an opportunity to earn all in one playthrough. Similarly the mechanic of unlocking them isn't my favourite, I wish there just was a ‘clothing store’ in game that would unlock the outfits. 2. the 'escort' functionality isn't worth the gamble. The mechanic isn't fun as the % of getting something is way too high. once you get something it takes days of meds (that you have to get from the adult store, randomly) before the girl is fully healthy again. in my opinion the disease mechanic isn't worth the hassle, and shouldn't be in the game. I like the escort mechanic idea, but it should be balance a different way. Perhaps only granting 1/xth the money for the shorter duration.  3. Some other balance issues, mainly gaining fans, early game pictures are important, but after getting one or two paid advertisements, it becomes pointless to raise that stat, boosting other items becomes a priority.    To sum up though, If you like short silly games that shamelessly flaunt what they are. That aren't afraid of ♥♥♥♥♥♥♥ off SJW's, that's genuinely fun to play for short bursts and has a few unique concepts. That unapologetically plays on stereotypes and entertains you along the way. This game is for you. ",
            "review_score": "1"
        },
        {
            "review_text": "It was a nice experience for the price i guess.",
            "review_score": "1"
        },
        {
            "review_text": "Update as of April 7th 2016: The criticism I have of the game seems to be somewhat addressed. The developer introduced a 'Rock Hard Mode' that is unlocked after you get the Gold Trophy(which as I recall is 25k Fans). I already uninstalled the game so I have yet to test out the new difficulty mode to provide more information, but if/when I pick the game up again, I will update this review further.  Loving this game, can be a bit too easy though. I've been going after the achievements recently and even while I'm going for things like the achievement to get the Bronze Statue without using Accessories, I'm still able to get the Diamond Statue(second highest statue for having 50k fans). On my second playthrough, I got 165k fans which is 65k above the highest statue. Something that could really do wonders for this game is some kind of leaderboard as well as a 'Hard Mode' of some kind.  I was somewhat shocked at how short each playthrough is since you'll be done a playthrough after a couple hours or so. However, there is some replayability in that after you finish a playthrough, you get Wardrobe Tokens that are used to unlock hairstyles and outfits that can be changed for each girl for her to have in future playthroughs. You can then go do another playthrough with a different playstyle. Use different girls, different fetishes, different accessories, and overall micromanage your girls and investments differently.  Its one of the best clickers I've ever played.",
            "review_score": "1"
        },
        {
            "review_text": "I don't know what dev thinking. This is really worst they better do some kinda puzzle with ero theme like first Hunie Pop. Something like Hunie Tetris sound better than this ♥♥♥♥in game. omg y u do dis  But... it fullfill my sin i would recommend it anyway :V",
            "review_score": "1"
        },
        {
            "review_text": "A M A Z I N G M A Z I N G  Dont listen to all the mad kids on the community, its really cute and fast clicky action. theres a bit of depth and strategy that goes along with it too~ sorry you cant rub your chub to this game boys.  Anyways, It took me about 18 hours to 100% this game for steam cheevos. It was fun and worth the munnies.  Sorry fam~",
            "review_score": "1"
        },
        {
            "review_text": "A beat the clock Managment game with a ecchi vibe! This game can be played almost anywhere! Your home not a problem, your work(dont worry your boss already plays), on the bus(people will give you stern looks of great approval! You can even play it in church(or where ever) the voice acting and the music will go hand with what ever you are doing! Play it during class even!   a good game to get on sale! a solid 6/10",
            "review_score": "1"
        },
        {
            "review_text": "Doing the same thing over and over again sates my autistic needs. Good game, 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "I got to live my life long dream of becoming a unlicensed pornographer, guided by a magical fairy.",
            "review_score": "1"
        },
        {
            "review_text": "HunieCam Studio is, a game where you frantically try to keep your cam company afloat while slowly descending into madness, this has nothing to do with huniepop besides the fact that the same company made it and most characters are able to be employed in your cam business. My finger hurts after clicking so much to get the money and dragging girls out to cam shows and photoshoots, and to ♥♥♥♥ing relaxing at spas every ♥♥♥♥♥♥♥ minute, I'm losing so much money, every night I go into debt, and can't get any upgrades. Running a cam business is hard. This game is hard. 7/10 pretty good game if you want to slowly descend into madness.",
            "review_score": "1"
        },
        {
            "review_text": "Story/Characters - There is next to no story in this game. The only story to speak of is that you are employed by who I assume to be Kyu to manage her camgirl opperation. That is it and as for characters well..they all have little bios you can read about them and they all have appealing designs but aside from the occasional lines they speak when you interact with them there is little to no characterization which I was honestly fine with when it came to the original Hunniepop girls because I already got to know them before but I could honestly care less about most of the new girls. At the end of the day though this isn't the kind of game you play for character or story, I mean did anyone play Diner Dash for the story?  Visuals/Sound - Okay I know I am in the minority here but I actually don't mind and even enjoy the art direction. True I would have preffered the visuals of Huniepop but considering this is a spinoff and not a sequel I am okay with them experimenting when it comes to the art and honestly I think it looks pretty good. Its more cartoony and less anime looking sure (though the anime-esque qualities are there) but its bright, colorful, and fun to look at. It's not quite as 'sexy' as the last game either but that wasn't the main reason I liked Huniepop anyway, not to mention the developer clearly states that the erotic qualities of this game were meant purely for comedy purposes and not for fap material (unlike the last game which was kind of a combination of the two).  As for the music it is a bit repetitive but it still has the same fun and poppy sound as the last game, it serves its purpose. The sound effects are all really appealing and aid in making the game more fun. The voice acting much like the first game isn't AAA quality but the cast all clearly has talent and do a pretty good job.  Gameplay -  This game is essentially like those old sim management games (again like Diner Dash) mixed with those clicker style games you find on mobile all the time. Yeah it isn't very deep and the replay value is limited to unlockable outfits and highscores but that is honestly what I was expecting out of this games and you know what? I had fun, yeah it won't be something I will be playing months from now but it is fun to pick up and play here and there and can honestly be pretty addictive. As far as these kinds of games though I think this deserves to stand among the best of them (for one NOTHING is locked behind a wait or pay model like a ton of newer games of this type).   Verdict -  The biggest difference between this game and the first one for me is that the first game was a 'don't judge a book by its cover' scenario. On the surface it just looks like a nother ecchi visual novel game with candy crush thrown into the mix and in its basics yeah thats what it was but the visual novel aspect stood out with its fun characters and humorous approach to its erotic aspects not to mention one of the most addictive and surprisingly deep bejeweled style puzzle mechanics out there. This game however is something that I honestly feel like you'll know immediately wether or not you'll enjoy it. If you like this style of game and don't mind the art change then you'll probably like this game, if not then you likely won't. This game aside from some similarities with the humor and some returning characters is NOTHING like the first game so don't assume that becuase you liked the first game that you will like this one they are two different beasts and deserved to be critiqued as such and not constantly compared.   I give Huniecam Studios a pretty good 7/10 ",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun. It's not HuniePop and it's not trying to be. Those who are complaining didn't read or chose to ignore the  Courtesy Warning  at the start of the game description.  Regarding the gameplay, it's a simulator, tycoon style game AND a clicker. Clicking is optional, and I mean it. Mechanics are simple and very easy to get used to. There's not much depth regarding what can be done, but there's a decent variety of ways of achieving the final goal. Game is played in sessions of 21 in-game days. After that, your score is computed, you are awarded tokens to unlock outfits and hairstyles and you can either start a new session or freeplay the current one. Last trophy is something. By the way, I missed the speed up setting.  Regarding the artstyle, it's cute. It's not as explicit as in HuniePop (there again, this has been warned beforehand), but it's provocative. I'd say it fits the purpose well. If you compare this and HuniePop, you might find the art strange at first, but there again, it's someting else entirely. Keep that in mind and you'll be able to appreciate the toonish characters and conclude hat the more 'serious' style from HuniePop simply doesn't fit the atmosphere here.  Dialogue is surely superficial and could be improved. Sure the game sessions is relatively short to contains extensive voice acting, but it's something you'll be playing again and again. So it does sound repetitive very fast. Maybe not at first, but soon enough.    TL;DR - 8/10 Could be more polished and offer speed up settings. Delivers what's promised and is worth a try at this price tag. Overall a funny and casual experience. You might enjoy it more than you expect :) ",
            "review_score": "1"
        },
        {
            "review_text": "Look this game ain't huniepop. Let's get that ♥♥♥♥ out of the way, IF YOU'RE LOOKING FOR A MATCH 4 WITH HOT ANIME GIRLS MAKING QUIRKY JOKES CONSTANTLY, THIS IS NOT IT.  Also the voice of jesse from original huniepop did not return. I'm sorry.  This however is a pretty decent clicker game, the end goal is to amass a ♥♥♥♥ ton of fans. You send your girls around to various areas and hold down mouse or click faster than that to speed ♥♥♥♥ up and collect things. Then you have to get a bunch of fetish enthusiasts which will be able to be advertised even more to for more dosh. More dosh = upgrades = more dosh.  And I may be in the minority here but honestly, I kinda dig the art style. Mind you i've ja- appreciated worse but it's a neat direction. (I think the heart eyes really sort of make it special, hell i don't know.) But honestly for 6 bucks it's a pretty decent game if you're looking to support the devs and whatnot it'll give you a few hours of fun.   Truth be told i'm not entirely sure why people are shocked this isn't huniepop, this ♥♥♥♥ has been in development for like a bloody year and they've been showing off this ♥♥♥♥ quite heavily. If you're suprised apparently you've been living under a rock: but I disgress.  Tl:Dr - It ain't huniepop 2 but it's a neat little clicker game that i'd say is worth it if you got some time to fill or just want to support the folks down at huniepot.  ",
            "review_score": "1"
        },
        {
            "review_text": "Great style, humor, and quality. Plus you get to be the King of Smut. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Not even looking at the ♥♥♥♥, ♥♥♥, coke, weed and fart fetish (what the ♥♥♥♥), this is a solid click simulation management game.",
            "review_score": "1"
        },
        {
            "review_text": "  ''Cake Farting Fetish'',actually looked it up its a legit thing",
            "review_score": "1"
        },
        {
            "review_text": "  yes huniepop is back",
            "review_score": "1"
        },
        {
            "review_text": "Lola caught aids 10/10 would fap a friend i mean.....",
            "review_score": "1"
        },
        {
            "review_text": "Chubby Asian Furrys Anal squirting, 5/7",
            "review_score": "1"
        },
        {
            "review_text": "Another charming, funny and super addictive game from the makers of Hunie Pop.   I love that they took the risk of not making a sequel to their previous title and mixed up the art style. Really excited to see what's next from these creators!",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥♥♥s aren't good enough this game but still has them",
            "review_score": "1"
        },
        {
            "review_text": "11/10",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Really entertaining game  Endless fun  'Nice' visuals",
            "review_score": "1"
        },
        {
            "review_text": "mom get the lube",
            "review_score": "1"
        },
        {
            "review_text": "played missed 1.270k fans for plat throphy. almost committed suicide. great game 9/6",
            "review_score": "1"
        },
        {
            "review_text": "Really awesome, just can't stop playing it.",
            "review_score": "1"
        },
        {
            "review_text": "I play this game in my bathrobe.",
            "review_score": "1"
        },
        {
            "review_text": "Really awesome, just can't stop playing it.",
            "review_score": "1"
        },
        {
            "review_text": "I can't believe I'm addicted to this game. Send help.",
            "review_score": "1"
        },
        {
            "review_text": "This game is not like Huniepop, but thats ok! Unlike the other game this one requires alot of focus and some brains to get the best score before your days are up. In my opinion, trying to get as many fans is challenging but in a good way, this game really wants you to try! Sadly you do not get the wonderful pictures as you did in Huniepop but on the bright side, you still get to interact with the classic girls you know and more! There are so many different girls that you can choose from and in the end you can collect wardrobe points to give the girls different outfits. The only thing that bothers me about this game is that to my ears, the girls' voices are slightly more pitched. Other than that, I personally give this game a 7 out of 10!",
            "review_score": "1"
        },
        {
            "review_text": "I would recomend this to all the weebs",
            "review_score": "1"
        },
        {
            "review_text": "It's shameless fun.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of these games that seem simplistic on the outside, but if you dig deeper, it will dig back.",
            "review_score": "1"
        },
        {
            "review_text": "a clicking simulator game becomes much more difficult when you have to click with your left hand",
            "review_score": "1"
        },
        {
            "review_text": "Its alot more addictive than the first one. The art style is also alot better, and the voice acting is great. After 100% the first on my partners computer I HAD to get this one so I can have the trophys. BOY IS THIS ONE HARDER! I REALLY REALLY REALLY DONT LIKE THAT YOU HAVE TO GET 100K BULLSH*T FOLLOWERS IN 21 DAYS ITS ALMOST IMPOSSIBLE! I HATE HATE HATE IT!!!!  But I love being a sleezy cam girl / escort operator I kinda wish it was that easy... Also wish the girls knew I too was a lady especially the fairy b*tch......  8/10",
            "review_score": "1"
        },
        {
            "review_text": "Gave all the girls STDs. Just like real life.",
            "review_score": "1"
        },
        {
            "review_text": "Have you wanted to jerk off but your parents blocked all the naughty sites? Well, HuniePot released a new game for steam called 'Jerk Your Little Ding-Dong On Steam. You Can Masturbate On Steam Now' It is 2016 and we gamers needed a new way to jerk off, a safer way. So Indroducting HunieCam Studio.",
            "review_score": "1"
        },
        {
            "review_text": "My life have been destroyed again, but i like ♥♥♥♥ so BUY THIS GOD DAM GAME FOR GODS SAKE",
            "review_score": "1"
        },
        {
            "review_text": "buy it, do one playthrough, refund",
            "review_score": "1"
        },
        {
            "review_text": "My girlfriend loved this game where I didn't enjoy it much. She got me all the achievements.",
            "review_score": "1"
        },
        {
            "review_text": "why not",
            "review_score": "1"
        },
        {
            "review_text": "pretty good fun to play alone in the dark with headphones   Courtesy Warning: The sexual themes in this game are mostly for fun/humor and don't make for particularly great fapping material.",
            "review_score": "1"
        },
        {
            "review_text": "funny, simple, management game. Wish more devs would make funny versions of games.",
            "review_score": "1"
        },
        {
            "review_text": "best anime sexual game i rate 9/11",
            "review_score": "1"
        },
        {
            "review_text": "No one will believe me I didn't play for the lewd aspect just as I believe everyone else does. Heh.",
            "review_score": "1"
        },
        {
            "review_text": "VVh0re Manager 2016. Play once, play no more.",
            "review_score": "1"
        },
        {
            "review_text": "Great game!",
            "review_score": "1"
        },
        {
            "review_text": "All the thumbs down reviews are the people who are butthurt for not getting to see any boobies",
            "review_score": "1"
        },
        {
            "review_text": "It's been only 5 minutes in the game and started to already fap to one of my cam girls making me waste time and losing payroll making Kyu get ♥♥♥♥♥♥ off ---------------------------------------------------------------------------------------------- *UPDATE*  After playing over 10 hours, I've never been more interested in cam girls and sites until playing this game.   69 Lillians out of 10",
            "review_score": "1"
        },
        {
            "review_text": "If you enjoyed the writing from their previous game, then you will enjoy this one. The game play overall is pretty solid and enjoyable although it was shorter for me their HuniePop (but it seems that there are unlockables and is fairly replayable). It is a pretty neat game.",
            "review_score": "1"
        },
        {
            "review_text": "Is good game.Fun little game with girls and stuff.You should probably not play this in front of your friends, but then again if you buy this game you probably had none to begin with.For a game thats supposed to be easy I'm too stupid to get a high score, but thats besides the point.Sarah is best girl, give her ♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "I don't know why I love this game so much! I've been a huge lover of Huniepop, and this isn't Huniepop at all. That being said, This gave is essentially a glorified Clicker. Despite this and what other people will say, it IS still a game, however. There are goals with win &amp; lose conditions like a real game. Even still, it will skinner box the hell out of you. This is the first game in a LONG time that has driven me to get all of the achievements before i quit.  + Unnecessarily addicting + The graphics are pretty for their style + Easy to learn, difficult to master + Lots of options for fetish combinations + The huniepop girls come back = No nudity. period. This isnt necessarily a bad thing when you look at the art style, but a lot of people picked it up thinking it would be as saucey as Huniepop was. The closest thing you get is lingerie costumes and some risqué stills.  - The hunipop girls come back... as cam girls ;-; - The new girls' voices are SO F$@#ing ANNOYING! - No real reason to use prostitution service because money isnt super important late game and the STD risk is too high. - No replayability after the achievements are won.  5/10 It's cheap and quick. It's worthy the play if you like clicker-style games and you want to support the devs while they continue making their next full title.",
            "review_score": "1"
        },
        {
            "review_text": "sleazy as advertised, surprisingly difficult, very addictive. much like real sex work it is a lot of money in and a lot of money out and you'll probably be at least a bit in the red most days. lol",
            "review_score": "1"
        },
        {
            "review_text": "Its so addicting, trying to get all the achievements.. gotta get them all and all the outfitss ;D",
            "review_score": "1"
        },
        {
            "review_text": "This was: -funnier than the last -not as pervy (surprising) -A prequel (also surprising) -short (like my sex life)   10/10 glad to see I did not cause audrey's coke addiction  10/10 Kyu is still as funny as last time 8/10 There is a weeabo character 6/10 Did not catch an STD 2/10 No fap images",
            "review_score": "1"
        },
        {
            "review_text": "HunieCam is pleasant 'clicker' and management game where you direct a bunch of cam girls in their sleazy endeavours.  Each girls has talents, appeals to certain 'fetishes', has some vices ('alcohol' and cigarettes) and you have to make them do cam shows to get money from their fanbase. The main concepts are easy to grasp, but the game gains in complexity progressively making it harder and harder to micro-manage the actions of your girls accurately. The vices and the stress levels of the girls will make it harder and harder to get things done in a timely fashion if you don't pay attention. As you might expect, balancing the actions of the girls with their cost and the desires of their fans will not get easier as their numbers increase... and with the escort service introduced later in the game you even have to watch out for STD's.  I did enjoy the fact that the vices of each girl can evolve, not only based on the objects you can give them, but also based on their actions. Overall, I kinda disliked the whole 'clicker' aspect. I would have much rather liked something with only straight sim management.   The music is nothing to write home about, unlike the bombastic music that was used on the first reveal trailer (and that incidentally motivated me to keep an eye out for this game). It's okay but won't motivate me to ask for the OST separately.  I noticed that a lot of people didn't like the art style, even back when the game was first announced. I'm one of the people who actually enjoyed it more than what was done on HuniePop. If anything, it's pretty tame compared to what we saw in the first trailer.  All in all I'd say it's a decent game that may be a bit too expensive for its own good.",
            "review_score": "1"
        },
        {
            "review_text": "Even though I've only played this game for 6 hours, I enjoy this game. It's fun and quirky. Yes. This is a cam girl game and there will be people who don't like the game simply for that reason, but if you can seperate your personal/political ideals and play this game as if it were a game, I think many would thoroughly enjoy it. Myself included. I look forward to playing more in the future and hope for DLC to come out.",
            "review_score": "1"
        },
        {
            "review_text": "Cute game, Pretty addictive.",
            "review_score": "1"
        },
        {
            "review_text": "Don't mistake it for a clicker.  It's actually a pretty nicely put together time and score based managment game. The game is also even less porny then HuniePop.",
            "review_score": "1"
        },
        {
            "review_text": "Its addicting and all BUT WHERE'S MY NUDES!!!!!!!!!!!!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "a very intense micromanagement game thats great for its price. glad to see it has all of the recuring cast and some new girls to boot! hopefully there are some extra unlockables as well??",
            "review_score": "1"
        },
        {
            "review_text": "i like this game a lot from the artstyle to the management to the simple story. Its like a adult themed version of game dev tycoon and its just great but i feel that it could have more fetishs and maybe just a little bit more stuff in general as for the price and game it self i say its worth it but if your not sure wait till its on a big sale or something ether way worth a buy unless it was ten bucks or more",
            "review_score": "1"
        },
        {
            "review_text": "Good points: - Brings back memories with the Wet game, one of the first Lula titles with micromanagement and setting as you the pimp. - Conception is addictive as hell. - Rock hard mode is true to it's name.  Bad points: - The new character design. - The classification of some items are not right. To achieve the badge of not using any accessories counts the shopping basket as that. If we consider the conception and the definition of accessories in this situation, it's clear that accessories = s*x toys, and a shopping basket isn't one. - Could use a wider range of accessories and fetishes. - Some of the STD's drawbacks are pure nonsense. (If your girl got AIDS, it's like saying 'she's literally dead'. Even for photo shooting, or fetching cigs and booze.)",
            "review_score": "1"
        },
        {
            "review_text": "Unlike the first game there is no nudity, but hey you were warned in the description. The game is solid and from what I can tell very well playtested, the 21 day soft cap is very well plased. Unfortunatly there is no point going past it execept for role playing.   I feel that the diamond trophy is a bit easy to reach at 100k in the later playthroughts but reaching a good high score is still a challenge, got 200k but have a feeling you could try and get 250-300k. Feel it is a bit luck based if you want to go alot past 100k thought.   Overall a good strategy game with a fun and interesting theme.",
            "review_score": "1"
        },
        {
            "review_text": "Good points: - Brings back memories with the Wet game, one of the first Lula titles with micromanagement and setting as you the pimp. - Conception is addictive as hell. - Rock hard mode is true to it's name.  Bad points: - The new character design. - The classification of some items are not right. To achieve the badge of not using any accessories counts the shopping basket as that. If we consider the conception and the definition of accessories in this situation, it's clear that accessories = s*x toys, and a shopping basket isn't one. - Could use a wider range of accessories and fetishes. - Some of the STD's drawbacks are pure nonsense. (If your girl got AIDS, it's like saying 'she's literally dead'. Even for photo shooting, or fetching cigs and booze.)",
            "review_score": "1"
        },
        {
            "review_text": "Instead of dating (and hooking up with) gorgeous 2-D waifus in HuniePop, try    HunieCam Studio    HuniePimp... the Pimping Simulator game!",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely love this game, I would love more as it is so addictive :) i would definitely recomend to people :)",
            "review_score": "1"
        },
        {
            "review_text": "Addictive yet enjoyable, it's almost competetive in the aspect of trying to beat your personal best. It becomes easy to win diamond after a point but trying to beat your top score or your friends does't stop the playing. &gt;325000 and still climbing",
            "review_score": "1"
        },
        {
            "review_text": "Nice little game, take 1.5 hour to complete. Not really sure of the replay value as once you get the mechanism, it is not so thrilling to do over and over again. A but more depth, more actions or random events would have been nice, but at 6 bucks can't really complain. If you are looking for a quick and easy to get into game, this is a good one",
            "review_score": "1"
        },
        {
            "review_text": "Great Game! I couldn't say anything bad about this. Very addicting to win achievements and rack up as much cash as possible.",
            "review_score": "1"
        },
        {
            "review_text": "I only play this game in 15 minute sessions ;)",
            "review_score": "1"
        },
        {
            "review_text": "If your expecting HuniePop 2 yoou'll be disapointed, if your expecting a casual clicker game you'll probably have fun.",
            "review_score": "1"
        },
        {
            "review_text": "Almost made me want to start my own CamStudio.  It was an addicting game.. for the time being, only took me roughly 2 days I believe to get all achievements...  HuniePop took me way longer. I like the girls in these games tho; Nikki being my favorite.  If you liked HuniePop, just get this one too. The girls you used to date are now working under you as Camgirls, just don\\'t let them work in the Sleezy hotel... They don\\'t deserve to end up like that. :3 Also keep your hands away from that pie-farting!",
            "review_score": "1"
        },
        {
            "review_text": "I need to be stopped. This game is so great and addictive, but I think it has lots of potential. Packs with dudes is one. But even without that, this game is rewarding with such a cute, colorful art style and strategically addictive gameplay. Surprisingly difficult.",
            "review_score": "1"
        },
        {
            "review_text": "A fun clicker that is pretty humourous. Not too much to the game but the puzzles are a bit difficult (It's a bejeweled type) and again, makes me laugh at times.",
            "review_score": "1"
        },
        {
            "review_text": "I'm not really one for clickers, but since this was from the same people that made Huniepop, I decided to give it a try. Besides, the price point was pretty cheap.  Pros  +Easy to learn, tough to master. +Actually kinda fun. +Unlike its free to play counterparts, everything is given upfront with no fee. +Kinda humorous. +Pretty strategic.  Cons  -Not as fun as Huniepop. -Really short. -Art isn't that good. -Not much replayability.  If you're a fan of clickers, I definitely recommend getting this. If you're just a fan of Huniepop, it's best to wait for a sale, as it lacks the same quirky charm as that game (and no sex scenes for those hoping for more :P). ",
            "review_score": "1"
        },
        {
            "review_text": "A stone cold grove of a game that will get any playa up an keep their pimp hand strong - A Pimp Named Slickback",
            "review_score": "1"
        },
        {
            "review_text": "I absolutely adored the first huniepop game, and had high hopes for this game as well. Though it is not at all a sequel to the first game and more of a spin-off, it is addicting nonetheless. It's fun and entertaining. I love how the old girls are included as well as the new ones. My personal favorite is Lillian, but that's just because I laugh everytime she says 'Ugh, ♥♥♥♥ my life.' It has little to no dialouge and no devolpment through out the game play, but I'd still recommend it to anyone who thinks it would be fun.",
            "review_score": "1"
        },
        {
            "review_text": "Do not get me wrong the message you get from this game it a pretty bad one. I just spent almost 4 hours playing this game to get the 'Bronze ♥♥♥♥' trophy, and I did so because I pimped out girls and had them on cocaine to cut down thier time on the job. THIS IS NOT A GOOD MESSAGE.  However....  I am proud of my ♥♥♥♥ trophy I worked so hard for it, we are all adults here (or should be), if this is not your thing then DO NOT BUY THE GAME. If you hated Huniepop, what makes you think you will like this one?  Anyway, back to reviewing.  This game is externely addictive, and makes you say things you never thought you would say before. I am having a blast and the only reason I stopped was to write this review. I loved Huniepop, and I adored the characters that were in it. Yes, the animation is different but it did not stop me from loving this game, PLUS it has the original characters in it as well with new ones. Bonus!  I was hesitant to buy this game, but I cracked after watching Jackcepticeye play it. It is a lot of fun, and I forsee more time on it.",
            "review_score": "1"
        },
        {
            "review_text": "Played for 5 hours and it's looking good.  Pro of this game is that it is much different then the first I do like the whole business tycoon aspect of the game it makes it fun.  Con of this game is if you bought it for a sextual nature like the first you will be disappointed.",
            "review_score": "1"
        },
        {
            "review_text": "I really wanted to like this game. I was very excited and was just excited for a new hunipop like creation  All the girls appeared and some new but that was it. I understand the game isn't hunipop and the devs didn't want it to be. As a clicker its good thumbs up for that but after 1 playthrough I have no interest the start a second unlike hunipop which I 100%   So a good clicker for a playthrough or 2 but this isnt what the fans wanted or hoped for I recommend but I cant say I enjoy it at all bring on hunipop2",
            "review_score": "1"
        },
        {
            "review_text": "Not as in-depth as HuniePop, but still a good time. There are some balancing issues (v1.0.2) which railroad your decisions, though.  This might be better as a mobile game given its simplicity, but it's still suitable as a desktop game.",
            "review_score": "1"
        },
        {
            "review_text": "Jessie! We have to cam!  I liked it at least. It's probably one of the better clicker games out there, in that it's a clicker game you actually have to PLAY to get a high score, not just close the game and let it run in the background while you play something else. I think the time limit does the genre a great service, and makes it an effective time management simulator rather than a 'sit on a chair and watch the numbers grow' simulator.  It's a clicker game that is well...actually a GAME.",
            "review_score": "1"
        },
        {
            "review_text": "A funny, self-aware business tycoon. Easy to pick up and play.",
            "review_score": "1"
        },
        {
            "review_text": "well... for the price... its meh~ aim of the game mostly to get the full collection of outfit, hairstyles and ♥♥♥♥♥... yup!",
            "review_score": "1"
        },
        {
            "review_text": "All the things that the negative reviews complain about are things that the devs said point-blank they were gonna do. Yes the game is short, yes it's shallow, no it's not as good as HuniePop was. And they told us that 2 months ago. And it's precisely because of this honesty that I decided to support these guys and pay for this game, even though after 3 hours of playing I've seen all I needed to see and will never pick it up again.  Don't think of it as buying the game, think of it as donating €6 to support the team, and getting this as a stupid freebie in return. It's a better deal than most Kickstarter campaigns.",
            "review_score": "1"
        },
        {
            "review_text": "Great game for the family. Grab all your siblings, gather around the computer for a family friendly game about love and friendship.   (experiences may vary, I cannot be held accountable for your family being dissapointed in you/throwing you out of the house for sexual harrasment)",
            "review_score": "1"
        },
        {
            "review_text": "HunieCam Studio is the Dark Souls of clicker games.  11/10 IGN   Okay realtalk: This is a clicker game and honestly the most well-designed one you can find on steam. That having been said, it's still a clicker game. Unlike most, there is a challenge by way of budget and deadline. Figuring the game's mechanics out and how to best make use of them is a fun puzzle. However, once you have, the game quickly loses replay value as there is a pretty solid formula to high-scoring.   The toon art is high-quality, if the style is a bit jarring. The UI is sleek and easy to interact with though is too reminiscent of facebook or mobile games for some to be comfortable seeing it in a paid PC product. The voice acting is, as in Hunie Pop, top-tier.  If you're a fan of HuniePop's setting or characters, you won't find much elaboration on them here. The character's personalities have been condensed to a single sentence blurb description and a few simple voice quips. HuniePop's brilliant humor is present all-throughout what little there is, though. The new characters seem like a lot of fun and I hope to see them again in future Huniepot games, hopefully fleshed out a bit more.  On the whole, my reception to this game is very mixed. I wish I I could give a neutral or 'maybe' rating. If you come in expecting too much, you'll definitely be disappointed, but I had a fairly good couple hours with it. But as I saidm once you master the game the replay value drops off. I may still play this again if I have nothing better to do for an hour or two. (It really does feel like it belongs on mobile, in that regard.)  tl;dr A fairly deep clicker game that presents a fun puzzle to solve once, but only once. Would not pay full price for but would get on sale in a heartbeat.  ",
            "review_score": "1"
        },
        {
            "review_text": "This is a really solid business sim with some well thought-out effects to keep balanced. The theme is well applied to the genre.  My one real complaint is that it's too easy to buy and keep fans that you aren't satisfying (i.e. fans that want Latina but never employing a Latina character). I think the game would be a lot more challenging and interesting if you lost fans that were bored with your content.  That said, I had a lot of fun with this game for the last few days and defintely got my $7 worth of entertainment from it. 8/10, would recommend to people that like watching status bars fill up and making money :D",
            "review_score": "1"
        },
        {
            "review_text": "I've blown 6 bucks on worse things. Don't expect anything incredible though.",
            "review_score": "1"
        },
        {
            "review_text": "It's very different from HuniePop, so I wouldn't exactly say you should get it for brand loyalty. It's just a quirky clicker. It didn't really fit my screen right, which was kind of annoying. I did really enjoy the game. It didn't take too long to get all the achievements. It's very fast paced. You basically just have 3 game weeks. I would've enjoyed a longer mode with a higher goal, but I suppose that's so it isn't a huge time sink.",
            "review_score": "1"
        },
        {
            "review_text": "If you're into time-management and click-click-clicking your way to success, this game is just about perfect! I have a dark sense of humour that really helps me enjoy the less, er... ideal situations. ;-)",
            "review_score": "1"
        },
        {
            "review_text": "HunieCam is a game I would recommend for more of past time game, a game that you can easily play, anywhere, anytime, just as long as kids are not around. I love the chibi art style, making it safer to play around others without them really knowing what you're doing. This game is rather more of an adult themed tycoon, and it bothers me that people are giving it bad reveiws for the fact that it is not as 'Lewd' as the other game. It still touches on adult themed topics, and it still has lovable characters that any person can relate too depending on your taste in girls. This game was not meant to be really story driven, it was meant to be fun, and a game to just continue on the lovable characters, and the lovable adult themes, not just the sex. All in one, you should really buy the game, and experience it yourself, and see how easily you actually get sucked in, stop comparing it to the other game, and just enjoy the creative idea it is.",
            "review_score": "1"
        },
        {
            "review_text": "Cute game, Pretty addictive.",
            "review_score": "1"
        },
        {
            "review_text": "Inspired me to create my own business.",
            "review_score": "1"
        },
        {
            "review_text": "This is a 'time management game'. I'll give it a 6/9.",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this only if you want to play a time / resource management clicker. Its an alright game probably better if you get it for less than 5 dollars. Ill only give it a thumbs up because I got my enjoyment and I know it will rub off on some idiot who gets triggered by these games.",
            "review_score": "1"
        },
        {
            "review_text": "Wish there was more to the game, like other trophies besides ones just for fans (like for money, or other criteria). I hope there are other expansions like the gym or fast food places to vary the weight of the characters to suite the fans. Maybe even additions like a plastic surgeon and a tattoo parlor. idk the game feels too small for me, and plays like an app game",
            "review_score": "1"
        },
        {
            "review_text": "A nice little management game. Dont expect too much from this mobile game, but if you liked HuniePop, you will like this one as well!  The narrator is nicer than in HuniePop.",
            "review_score": "1"
        },
        {
            "review_text": "Loved Huniepop wanted to love this dident at first then fell in love with it",
            "review_score": "1"
        },
        {
            "review_text": "A nice little time killer. No nudity like Huniepop (patched version), unfortunately. Each game lasts for a nice amount of time, so starting a new game isn't tedious. I recommend getting this game on sale since it's pretty casual gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "My mom had to talk to me after I screamed 'You ♥♥♥♥ing syphilis ridden ♥♥♥♥♥' 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is ridiculous but in the best ways. The game itself is simple enough and mundane, and damn addictive. All the things you'd expect out of a clicker game with the hilarious notes of perv thrown in keeping it entertaining. NGL it was pretty fun screaming, 'FINALLY MY ♥♥♥♥♥ GOT HEPATITIS' when I was grinding for achivements.  If you like silly games to waste time with then this game might be for you.  Obvious like everyone else already said, there's no real nudity and it's not a game to get off to. It's just a fun clicker game with adult themes and humor.",
            "review_score": "1"
        },
        {
            "review_text": "pretty fun game, it is like any other resource managment game ive played, just super pervy and sexualised! It is fun unlocking outfits, trying to get diferent fans, and trying to beat your score. Worth the price!",
            "review_score": "1"
        },
        {
            "review_text": "Like clicking for unceremoniously long amounts of time in rapid succession? Buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "Who needs to be a disappointment when you can fingerblast until you get some 'dope ♥♥♥ dick trophies'?",
            "review_score": "1"
        },
        {
            "review_text": "Came for ♥♥♥♥ and stayed for good gameplay",
            "review_score": "1"
        },
        {
            "review_text": "This game is so addicting I can't help but return to it every now and then. Still fun to play and the RNG challenges my strategy every once in awhile so that it never really bores me. Great game.",
            "review_score": "1"
        },
        {
            "review_text": "worth kappa, actually not a bad time killer",
            "review_score": "1"
        },
        {
            "review_text": "It's just like when i cam, except now i actually make money",
            "review_score": "1"
        },
        {
            "review_text": "Wrist Crunching, Finger Tip Numbing, Forehead Slapping, Quick Fix Machine!  Fun for the evening time. A Game can be finished in less than an hour, so be ready to play a few. Easy enough to be casual. Enough eye candy to be intriguing.   Fun Stuff!",
            "review_score": "1"
        },
        {
            "review_text": "Well, the game is what it pretty much promised from the beginning: A facebook-like time sinking tycoon. It plays well. It has great mechanics. What it lacks... is kinda everything else.  The game is about 2 hours long, give or take. There's zero replay value, unless you want to unlock everything like the achievements. If you don't want achievements, all you get is different hairstyles and clothing that do nothing.  The new girls are really cute, I admit it. But they have no personality aside from flavor text and a few voiced lines. I really wish they got more. Speaking of characters... the special girls from the main game are missing. Sad times, considering Celeste is my favourite.  The game's humor is... questionable. Yeah, we're all getting a laugh out of cake farting. But there's incredibly offensive stuff in it as well. Then again, we all expected that. Just putting that warning here for anyone who doesn't know. But aside from the cake farting, nothing is funny so don't come in expecting Huniepop's humor.  It's a fun time sink, and I'm going to 100% it. But it's not worth $7. It's worth $5 at max, though if I had known it was like this I would have only paid $3 or so if I could choose my own price. Hopefully Huniepot either adds more or lowers the price. Then I'll come back and change my review.",
            "review_score": "-1"
        },
        {
            "review_text": "Please note, this review is intended for people coming from Huniepop  Art: good: The art is decent for DeviantArt level of work and the girls look cute or sleazy or however they need to look. bad: This has been a big controversy since the first piece of art was released and everyone saw the new direction of the art style. Regardless of the behind the scenes drama, it was a step in the wrong direction. Either way, the art is meaningless to the core of the game as the only time you really see any of it is when you acidentally click on the girl's icon instead of dragging  Music: good: it's pretty well produced like most games of this genre. bad: it's repetitive and gets boring since you're only really looking at one screen the entire time. I muted it my first hour in.  Writing: good: there's some writing in there bad: if you're coming from huniepop, you're expecting each character to have some development or depth and understand their story a little bit. in this game, there is no development or understanding of the character unless you look at the girl's bio. you (as the main character) have very little interaction with anyone other than tutorials and the ending which basically goes, 'THANKS FOR PLAYING!'. I am not joking when I say there is no dialogue (other than tutorials) and the sound clip of when a girl is ready or is assigned for a task ('Okay, I'm ready!')  Story: good: the girls have bios bad: THERE IS NO STORY BESIDES THAT, PERIOD. okay, so you are in charge of a ring of cam girls. now what? oh, that's it? oh, she got the clap. how does she feel about this? oh, she won't cam because she's embarassed. damn. I'm all about making up a story in your head as you go along (see Sunless Sea) but there's no substance to do this here.  Gameplay: good: this is actually one of the best clicker games I've ever played. there is a lot to keep you going and quite a bit of management and skill to balancing time, money, resources, etc... A+ bad: this is the tricky part. the game aspect of this I had no problem with but coming out of huniepop, I had thought I was walking into great comedy mixed with good gameplay. you could have made this game about anything and had it more of an entertaining experience. this is the key: this is the followup to a game that was more known for it's edgy/sexy humor than it's fun puzzles. as great as the clicker style gameplay was, I was finished with the game altogether once I easily obtained the needed fans to get the highest trophy (this took me 2 attempts.. no joke). also, the fact that it basically went, 'YOU WIN! THANKS FOR PLAYING! YOU CAN CONTINUE FOR FUN IF YOU WANT,' made me want to do nothing more than turn the game off.   Replay: good: you can unlock alternate clothes and hair for the characters you barely see and most of them are well designed. bad: there is no replay once you beat the game. it encourages you to basically ♥♥♥♥ off.  Overall: I was genuinely excited for this game at the initial announcement and discussed it with a few of my friends who also liked the game. Once the details came out little by little, I became skeptical but positive. Once the game releases and I saw reviews, I got excited again until I got home and played it. Seriously Huniepot, you forgot the most important parts of what made Huniepop so great. In all honesty, the art, even though I was on the fence about it, is good... it's just not what most people were thinking they were walking into.... but how could you forget the comedy and edge that made the first game so good? Seriously, you could have just re-released the first game with new art and a different story with the same core and people would have been happy.  Good alternative to this game: If you want a good time management game with great story, check out Sunrider Academy. It's not known for comedy but the story is solid and funny at times while the core gameplay is quite challenging. It's on Steam and it's worth every penny.",
            "review_score": "-1"
        },
        {
            "review_text": "When I first played this game, I had a complete blast, I was recommending it to all my friends, but once I beat my game and found that I couldn't do anything more. I felt a little robbed.  I spent $7 on a game that lasted 2 hours, with little to no replayability. With the original Huniepop I felt as though the game brought a challenge, in addition to having tens of hours worth of gameplay.   Some people dislike the art style, where I think that it is fine, isn't as nice as the older game in my opinion, but it is decent. And to be honest beyond that, I don't mind this game being a clicker, I really enjoy the gameplay, but the issue is that it is short.  TL;DR Good gameplay, but only 2 hours worth of story, not worth the money.  5/10",
            "review_score": "-1"
        },
        {
            "review_text": "To short, repetitive gameplay, you can finish the game under 2 hours. Plays more like a free facebook game and has just as much content.",
            "review_score": "-1"
        },
        {
            "review_text": "One of the most boring and tedious games I've ever played. The humor is barely there and there's maybe 30 lines of voice acting if even that and that's the sole redeeming quality of the game- Kyu still gets a chuckle. The management strategy is as deep as puddle. The replayability is fairly low since you'll do the most optimal strategy every time (which I figured out in 15 minutes and so could you.) The whole experience left me wanting my time back.",
            "review_score": "-1"
        },
        {
            "review_text": "Definitely different than HuniePop; unfortunately, a lot shallower and less interesting. The bejeweled-esque and relatively deep gameplay from the last game from this developer has been replaced with a resource-management game that rewards basic min-max logic. Two playthroughs and you've both got the basic strategy and probably nabbed all but the highest ranking in the game. Although the price tag isn't bad for the amount of content, the only real distinguisting feature it's got going for it is the racy content, and even that's mostly separate from the game experience itself (you can unlock cartoon-y cheesecake shots, one per girl, after earning coins from playthroughs). Only pick up if you're a real fan of the genre or want to support the developer -- it just doesn't stand out in its genre.",
            "review_score": "-1"
        },
        {
            "review_text": "It hurts a lot to give this a thumbs down. I'm a die hard fan of the original huniepop with over 40 hours of game play and I'm still planning on replaying it more.  To be honest when this was announced I was not thrilled. Obviously I was hoping for a Huniepop 2, WHICH IS KNOW THIS IS NOT IT.  Now before I go into it, I KNOW THIS WAS NOT MADE AS A SEQUAL OR ADVERTISED AS ONE. I'M REVIEWING THIS BASED ON THIS AND MY EXPIRENCE WITH CLICKER GAMES.  FOR THE LAST TIME I KNOW THIS IS NOT OR NEVER WAS GOING TO BE HUNIEPOP2  I'M REVIEWING THIS GAME BASED ON THIS GAME  A really short, fairly boring clicker game in which clicking is just holding down the mouse button.  The appeal of this game flew right out the window when the trailer came out, because of the art style, they don't look similar at all. My sweet waifu Audrey is cute but it's not her, not to mention the only thing she says is 'Can I be done yet?' And after the 60th time it's not endiring anymore.  I played through 5 times to unlock every achievments and even that was short lived. There are so little achievments and I was dreading having to restart each time. Now that I have every single one, even the little desire I had to play this game is gone completly. I will probably never play this ever again and uninstall it.   Also don't let my play time fool you, I probably have only about 5 or 6 actual hours of game play to complete it (I left it on in the background and forgot about it because it got THAT boring)  The fact that you get the 'special photos' of the girls in the loading screen is bad enough but theres nothing in the game to keep me going, now new levels, areas, like take some tips from diner dash which I've been playing for 10 years and still love to this day.  I'm so unsatisfied and unfufiled in this game. It's a huge let down.  Only thing is Sarah is my new waifu, holy ♥♥♥♥ I love her. She's the only reason I played this game for 6 miserable hours. ♥♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "Liked the game but I don't think it deserves a rec from me.  Way less content than what I had in mind and comparing to the 1st game. One girl one pic and that is it? Come on! Not any kind of nudity or you know what.  But I would say I had fun with the game. Although it is only 21 days, no endless mode at least as of now. Which is a bit weird....  I would say this game is rushed if I didn't know how long it took to come out...... I would say this seems like a 3-6 months game with a very small team... Where are all the money you earned from the 1st game.... U gotta spent them to make them.....     I still fapped.Please don't judge....     I would hope this game gets more update to flesh out the content and it would be a good game.Cheap DLC would work too if enough content.",
            "review_score": "-1"
        },
        {
            "review_text": "HunieCam Studio: an extremely short, simple game with zero challenge, substance, or depth. Once you've played it for about 15-20 minutes, you'll have experienced everthing the game has to offer. People have been comparing it to a clicker game, but HCS lacks the hamster wheel progression chase of those games. The gameplay consists of you dragging girls' faces onto buildings until you hit the arbitrary 21 day deadline. At which point you're awarded a trophy and some costume tokens, and then you start over. That's it. You can keep going beyond the deadline if you really want to, but there's nothing to earn or unlock once you pass it.  I don't know if the devs plan on adding content to the game (seems unlikely), but in its current state HunieCam Studio is a waste of both time and money. There are demos with more to offer than this game has. There are better clicker games, and there are damn sure better sim/management games out there. Do yourself a favor: leave this page and go play one of those.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a very simple clicker game that you can really only play once or twice through. There is no 'ascending' feature that other clicker games have, so there is almost no strategy, no mathematics. The idea is actually interesting, and could have been expanded upon to make a good game, but instead they went cheap and quick without understanding what people enjoy about the genre.   It's also super misogynistic. I don't usually buy into that ♥♥♥♥♥♥♥t, but sending one of the girls to go get ♥♥♥♥ed by some rich guy and having her say 'Do i really have a choice?' is a little on the nose. This could have been an empowering game, but instead it's a game about controlling women in the sex trade, which is honestly a little gross.   Don't bother with this game. There's less to do here than most mobile games.",
            "review_score": "-1"
        },
        {
            "review_text": "I write this review a bit disappointed. I played and liked the first game. It had a lot of character and was really addicting and have much more interaction going on with it. While it felt like a mobile game as well as this game does, it at least was still a great game. This however, is just boring.",
            "review_score": "-1"
        },
        {
            "review_text": "I tried out this game, doesn't have the same easily playability as the company's predecessor. Also the biggest problem is that there is no easy way to contact HuniePot if there is a problem, it feels they don't care about their users. At least the price tag for the game isn't terrible.",
            "review_score": "-1"
        },
        {
            "review_text": "Figured I'd give it a shot. Was told to 'finger blast' a building by an insulting tutorial.   If this was a newgrounds upload it would probably be blammed for being worthless.",
            "review_score": "-1"
        },
        {
            "review_text": "Repeative, boring, bad mechanics.",
            "review_score": "-1"
        },
        {
            "review_text": "I buy this game cuz I'm a little pervert. Rly borinng. If you fail, like me, you have to just repeat, the story is too short and it's after all that stuff rly boring. I'm disappointed. :( ",
            "review_score": "-1"
        },
        {
            "review_text": "'Hey guys, I GOT A GREAT IDEA!' 'What's that?' 'Let's replace our amazing artstyle we did with Huniepop, and do a Chibi artstyle on a Cookie clicker Knockoff!' 'Err... We can't draw H-rated content with Chi-' 'It's fine! Let's just not have any H-rated content, which was one of the most satisfying things in Huniepop after having to play those great Dating minigames!' 'Oh my god... This is... This is... Brilliant!'  Thus, HunieCam, the cookie clicker knockoff flash game was born. Except you have to pay for it. Oh yeah, just so your wondering, there is no H-rated content in this. If your looking for any of THAT, go buy Huniepop. If you already own it, just wait and pray the developers go back to their original artstyle in the future.  If your wondering if the Gameplay is good.... Eh, if you like Cookie Clicker, you should just stick to Cookie clicker. This game was VERY dissapointing, and got repetitive within 10 minutes. I would avoid. I mean seriously, though I've never played it, Sakura Clicker most likely has more interesting content then THIS game, and it is FREE.",
            "review_score": "-1"
        },
        {
            "review_text": "Alright game, but really doesn't feel unique nor well polished. Wouldn't buy then if I knew what I do know, but again, it's not terrible.",
            "review_score": "-1"
        },
        {
            "review_text": "Worst CLICKER game i have ever seen...  DO NOT buy this if you thought you where gonna manage webcam girl.",
            "review_score": "-1"
        },
        {
            "review_text": "Do yourself a favor... don't. As a semi-fan of the first game I think this is a crummy knock-off for a bit of quick cash (almost as fast as a playthrough of this game).   However, if I were judging this on it's own I still could/would/should not reccomend it. If you have extra money that is laying around doing nothing, go ahead and buy this game. Otherwise, keep it secret and keep it safe.  Pros: -Interesting take on clicker games -Fun, cute, cartoony art style  Cons: -Characters are not likable -Voice acting isn't great -Irritating tutorial -Tries too hard to be funny, but almost always misses the mark -Short... you can seriously beat the game in maybe 2 hours if you ♥♥♥♥ around  Don't get me wrong, It isn't a horrible game, but it's just not worth $7 when there are many other games similar to it of a much higher caliber.",
            "review_score": "-1"
        },
        {
            "review_text": "Literally just a hectic cookie clicker with girls (no nudity etc).",
            "review_score": "-1"
        },
        {
            "review_text": "This is not at all like Huniepop.  The game is shallow, and mainly focuses on management of the girls and their activities with no interaction between them and the player.  And I don't really like the art style for some reason.  ",
            "review_score": "-1"
        },
        {
            "review_text": "Each game is around an hour and a half long, everytime you beat the game you have to start over again (or you could just continue playing a file for fun). But when you finish a game they give you wardrobe token you can then use to buy outfits or hair styles for your girls.  It's a time management game, It's not really worth 7$ seeing as how theres less than 2 hours of game play (unless you just love replaying the game over and over again from the start unlocking outfits for your cam girls).",
            "review_score": "-1"
        },
        {
            "review_text": "It is funny and enjoyable for the first time playing through. You manage a bunch of camwh.. girls who later give 'special shows' to STD riddled Rich viewers.  Like HuniePop you get pretty often insulted for playing the game and that's it... yes. After this you replay the whole thing again, same in same out. You can now go for achievements or just for the perfect score. But it pretty much stays the same.   When I bought the game I hoped for some 'Starting at the bottom, now we're here'-story. But it's more like keeping the business for some demented tutor girl, who has no time doing things but keeps around all the time anyway.  TL;DR: THERE IS LITERALLY NO REPLAY VALUE WHATSOEVER.",
            "review_score": "-1"
        },
        {
            "review_text": "There was a tag for nudity and I like the art....so i bought it.....but theres no nudity it seems....or even a 'gallery mode' ....just Adult content and Language making about as bad as a rated R movie.....with no nudity.  This is the kind of game you play on your cell phone.....I kinda feel like I was suckered into buying this because I'm a dirty pervert, but hey....you live and learn. lol    Totally would buy a game again, because it slightly caught my interest and contained the 'nudity' tag. (just for the record there's more sexual content in grand Theft Auto V than this)",
            "review_score": "-1"
        },
        {
            "review_text": "huniepop are so much more fun and better then this. this game is just nothing in compare too it. im very disapointed",
            "review_score": "-1"
        },
        {
            "review_text": "i have been buy this game n will to play but game not responding when i click play, pls resolve this",
            "review_score": "-1"
        },
        {
            "review_text": "The artwork for this game is complete trash, it's the sort of garb you see on someones first Tumblr submission, then you have the gameplay which is incredibly boring.. go buy any Mobile Phone game and you can probably get a better experience.  The voice acting in the game is incredibly awful, even worse than Hunipop. (which was semi-enjoyable)  Don't waste your time/money on this steaming pile of garbo.",
            "review_score": "-1"
        },
        {
            "review_text": "This game can be described as farmville with a stress element or, alternatively, a slightly advanced cookie clicker.   Whilst I did not expect a mechanical sequel to HuniePop, which by all means is an astoundingly good game, I had hoped that the themes and personalities of that game would resound through Hunie Cam Studios. That is the outlook with which I played this game, and it is sadly where I find the game most lacking. Whilst the outspoken and highly recognizable cast of the first game is present (at least for the most part, judging by a first play through), they are reduced to simple statistics in a much greater sense.   The cast only expresses itself through grunts or short sentances to mark completion of a task, refusal to act, and so on; there is no direct interaction whatsoever. Meanwhile the new characters, with only a few exceptions, appear lackluster or just plain absurdly designed. (The haywire design of Zoey springs to mind.) Kyu herself is present, but only to give you a basic rundown of the mechanics, and comment on your performance upon completion. In short, the characters of HuniePop are present in name only, and the cast in generall brings little of interest to the table.   Mechanically, this is a timed resource management game, where collecting earned resources has been made tedious just to push another few linear upgrade trees on the player. Ultimately, the threat of bancrupcy is faint, and only emergent if you push yourself for a highscore. To my knowledge, it would be fully possible to 'comlete' the game with an unleveled starting character, just bouncing back and forth between three buildings. Mechanically there is little to no replay value; the difference between the starting characters you will be offered is typically miniscule. In its predecessor, this was counteracted by the surprisingly well developed (albeit stereotypical) characters. With that aspect lacking, Hunie Cam Studios offers basically no reason to replay the game, beyond visual unlocks what you won't pay any attention to, or achievments.   This is not a game for me personable, and I'm leaning more towards going back to HuniePop, but if you're interested in getting the game, let me leave you with a tip:  Don't overstock your characters on items; a character can only equip three items and, to my knowledge, these lock in. Having a free slot for consumables (cocaine and condoms especially) can be very usefull.",
            "review_score": "-1"
        },
        {
            "review_text": "This is just another clicker, building on the 'Fame' of Hunie Pop. Nothing like the I guess Original",
            "review_score": "-1"
        },
        {
            "review_text": "0/10 not enough ♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "Hey Maa, look at me now! I run my own business........  ,,, ,,  Definitely a fun management based game, with some qt ladies in the adult industry. Filled with previous babes from HuniePop and other new babes too!  I mean, if you like management games and babes then yeah why not?",
            "review_score": "-1"
        },
        {
            "review_text": "If you have played Huniepop it is overall just a better game. Huniecamstudio is not a bad game at all but the truth is that it is not worth the money. The ideas are unoriginal the execution is decent but nothing above average and there is no real reason to play this game more than once. Hunipop was great a big spin on a boring gener I had really hoped they could do the same with this. They didn't 5/10",
            "review_score": "-1"
        },
        {
            "review_text": "Might be for some people, but the game play is too tedious for me, reminds me of a mobile phone game but not on my phone. Artstyle's cute, but not a game breaker. If you like management or oldstyle flash games, maybe for you.",
            "review_score": "-1"
        },
        {
            "review_text": "It gets boring and repetitive after 30 minutes. Check it out if you're curious like I was, but you'll return it soon after like I did.",
            "review_score": "-1"
        },
        {
            "review_text": "LIttle of managing, mostly just repetitive clickin...",
            "review_score": "-1"
        },
        {
            "review_text": "I waited until I had all of the achievements before I wrote this, so that I would be officially done with it. I played Huniepop 100%, voted on the strawpoll for this game involving the art direction, listened to the 4 hour long youtube stream. I followed this game from announcement to release, which is probably more attention than I should have given a softcore management sim.  Couple thing I like, the game is fun. Simple and short. The game will keep you occupied for about an hour per playthrough and you can practically sleep through most of the game with the right investments.  Couple things I don't like, the massive waste of potential. I mean massive. I have nothing but respect and admiration for Huniepot, but I think this game could have been fantastic. Because of this respect I'm not just going to say that the game is terrible and there are better clickers, but I'm going to offer some criticism. If say they added the option to switch over to the anime artstyle, I think the fans that didn't paly would play the game no problem. I also think they should add a nudity patch. The concept of a camgirl game without nudity is a bad call. It's like zoo tycoon without seeing the animals in their virtual splendor. I understand the developer said 'It was more for humor this time around' but it's not all that funny. It's just some things I'd like to see. I'm still not going to vote that I don't recomend it, but that's tough love. And I do love Huniepot.   tl;dr- Could be better.",
            "review_score": "-1"
        },
        {
            "review_text": "If you've read other reviews you might see a recurring theme. This is a clicker game, probably more suited to being a smartphone app. The basic premise of the game is to get as many fans as you can within a 21 day period. To get fans you either set your girls up in the photobooth, or buy ads for certain 'tastes.' Girls will get more money per cam session if they have a higher amount of fans that fit which 'tastes' they fall under. If you put a girl with the teen, and tattoo traits in the photobooth you will receive fans for those traits, which means those fans will boost the amount of money other girls make, that have those same traits. You hire girls on a rate according to their style level, and their comfortability doing naughty things on camera. Higher style means more fans per photoshoot, more comfortability behind the cam means more money per cam session. You can raise those levels, and consequently how much you'll pay them per hour, by having them spend time in the respective areas. While the goal is to get as many fans as possible, you have to do so while paying the girls you choose to hire, managing any addictions/habits (smoking/drinking) they have, and de-stressing them. If a girl is a smoker, or drinks just occasionally you have to keep a supply of cigarettes and alcohol. If that runs out the girls that smoke and/or drink will use more of their energy to do tasks. Girls that drink and/or smoke take less energy to do tasks while you have cigarettes and alcohol available, compared to girls that don't drink and smoke.   The Clicker Part explained: When your girl(s) are done with a photoshoot it leaves fans to be collected there. You have to click per each fan, or click and hold to collect those fans. You can use money to auto-collect every X amount of minutes, raise the amount of fans you collect each time you click/click-hold, and for other things as well. When your girl(s) are done with a cam session, money is left at that area which you must also collect if you want it to be useable. When your girl(s) finish spending time leveling up their style, those experience points are left at that area for you to collect if you want those experience points to actually go to that girl. When you send one of your girls to buy smokes, or alcohol, can you guess who has to click/click-hold to collect it? It's you. You may say 'Well, it's a clicker game, it's only reasonable that you are expected to click on things.' Sure, okay, but I forgot to explain one thing. In this clicker game you can speed up the process it takes for a girl to do something if you click/click-hold on the area they are working in. That's the way these things work usually. Oh...but you can't speed up stuff if there is still stuff to collect in that area.  I can almost bare with all of that, but the few reasons why I can't really recommend this game are mostly because as others have mentioned; there really isn't any depth to the game, it's very short, and currently there's no point in playing beyond the 21 days.",
            "review_score": "-1"
        }
    ]
}