{
    "app_id": 426290,
    "name": "The Away Team: Lost Exodus",
    "release_date": "2016-07-22",
    "developer": [
        "Underflow Studios"
    ],
    "publisher": [
        "Crackshell"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Captions available",
        "Steam Workshop",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Choose Your Own Adventure"
    ],
    "achievements": 21,
    "positive_ratings": 52,
    "negative_ratings": 14,
    "price": 5.8,
    "description": "In this interactive sci-fi adventure novel, you are the AI pilot of Earth's last interstellar ship, tasked with finding a home for your crew—the last remnants of humanity. Your choices will determine their fate, and your own.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/426290/header.jpg?t=1545096579",
    "minimum_requirements": "Requires a 64-bit processor and operating system OS: Windows 7 or higher 32bit Processor: 1 ghz Memory: 2 GB RAM Graphics: Shader 1.1 support DirectX: Version 9.0 Storage: 1 GB available space Sound Card: Our sound guy would be sad if you don't have one but you technically could play without one... You monster",
    "recommended_requirements": "Requires a 64-bit processor and operating system OS: Windows  7 or higher 64 bit Processor: 2 ghz Memory: 4 GB RAM Graphics: Shader 2.0 Supprt DirectX: Version 10 Storage: 2 GB available space Sound Card: Soundbooster 540 5 terabit sound chip.",
    "reviews": [
        {
            "review_text": "  The year is 2127. Earth has been destroyed, made uninhabitable by war, climate change and famine. You play as the AI on a ship containing the last known humans in the universe. Can you keep them alive as you search for a new home?  The Away Team is superbly written interactive fiction, a modern day ‘Choose Your Own Adventure’ set in space. There are survival elements too, in that you have to scavenge planets for food fuel; otherwise you’ll end up starving, or stranded in space forever.  The graphics are basic, but for what’s essentially a sci-fi novel, they fit well enough. The music is atmospheric and calming, the sort of thing you can have a good afternoon nap to (I’m so rock and roll, I know).  There’s a lot of reading in this game, as it features huge swathes of text. Not surprising, given the genre, but if reading’s not your thing, this game probably won’t be either. I thoroughly enjoyed it though, pootling around from planet to planet, frequently panicking, running out of food and fuel and sending my crew out on dangerous missions to replenish our stocks (where they died, more often than not).  One criticism I do have, however, is that when you make a choice that leads to the death of a crew member, the graphics show you instantly that they’re dead, despite the fact you won’t have reached that far in the text yet. It does spoil the surprise somewhat.  There was one particularly enjoyable segment featuring a mad robot who forces you to re-enact a blisteringly confusing Shakespearean play. The AI’s response? ‘Ah, I was wondering when we’d meet our first insane robot.’ Let’s face it, everyone loves a good space play.  There’s replayability here, not just because of the standard ‘search on the left’ or ‘search on the right’ mechanic, but also because you select your crew at the start of the game. Each crew member has their own back story and different traits, making some more suitable for roles or missions than others; and when you’re in a sticky situation, they can react differently based on their own strengths and weaknesses. It’s a neat addition.  Games like this succeed (or fail) on their story and writing, and The Away Team doesn’t disappoint in that regard. The writing is intelligent and witty, and the story is intriguing. It’s just a shame my entire crew were incinerated in an explosion.  If it sounds like it’s your sort of thing, then it probably is, and you should check this one out.  This review was written on behalf of Team Tom Reviews - for more reviews and news, check out the  website here  [teamtomreviews.co.uk] ",
            "review_score": "1"
        }
    ]
}