{
    "app_id": 426790,
    "name": "Grow Up",
    "release_date": "2016-08-16",
    "developer": [
        "Reflections, a Ubisoft Studio"
    ],
    "publisher": [
        "Ubisoft"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Open World",
        "Casual"
    ],
    "achievements": 18,
    "positive_ratings": 941,
    "negative_ratings": 118,
    "price": 8.59,
    "description": "Leaping from mind-boggling heights, bouncing off Champolines, soaring inches from floating islands, BUD can do it all - that look of mild terror, that’s his daredevil face. Help the adorable little robot collect MOM’s scattered ship parts and return them to the moon.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/426790/header.jpg?t=1471334692",
    "minimum_requirements": "OS: Windows 7 SP1 or Windows 8.1 or Windows 10(64bit versions) Processor: Intel i3 550 @ 3.2 GHz or AMD Phenom II X4 955 @ 3.2 GHz Memory: 4 GB RAM Graphics: nVidia GeForce 460GTv2 or AMD Radeon HD5770(1024MB VRAM) DirectX: Version 11 Storage: 1 GB available space Sound Card: DirectX Compatible Sound Card with latest drivers Additional Notes: Best played with a gamepad.",
    "recommended_requirements": "OS: Windows 7 SP1 or Windows 8.1 or Windows 10(64bit versions) Processor: Intel Core i3 2105 @ 3.1 GHz or AMD FX 4100 @ 3.6 GHz, or better Memory: 8 GB RAM Graphics: nVidia GeForce GTX 660(2048 MB VRAM)or AMD Radeon HD 7870(2048 MB VRAM)or better DirectX: Version 11 Storage: 1 GB available space Sound Card: DirectX Compatible Sound Card with latest drivers Additional Notes: Best played with a gamepad",
    "reviews": [
        {
            "review_text": " TLDR:  Grow Up  is an okay game on its own, but it strays from the simplicity and straightforwardness of the original  Grow Home  and as a result mostly fails to recapture the magic of the original.",
            "review_score": "1"
        },
        {
            "review_text": "Perfect sequel to Grow Home",
            "review_score": "1"
        },
        {
            "review_text": "Get glider ability and 40 gems as soon as you can.  Then you can enjoy  Infinite Power Glider Simulator .",
            "review_score": "1"
        },
        {
            "review_text": "Grow Up is everything that I wanted in a sequel to Grow Home.  The positives: + More collectibles + Challenges + More costumes + Huge world to explore with multiple biomes, new plants, and animals + Mobility options are built into BUD instead of being plant based (i.e. Glider and Air Break instead of Flower and Leaf) + Additional character in POD, who can help you find things on the map  The negative: - BUD can be difficult to handle in challenges as you have to be more precise with his movements during a limited amount of time  Other than the one negative, Ubisoft Reflections has made a perfect sequel to the first game and they should be very proud of their work! ",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed Grow Home but replaying it after playing Grow Up the new features and updates are obvious. Grow Home is so much more aggravating than Grow Up. I'd say you should definely check out this series but there is no need to play the first game. Just skip Grow Home. On the other hand I'd recommend you all to check out Grow Up. It's bigger, better gameplay, more collectibles, and still has the Grow Home feel but on a bigger scale.",
            "review_score": "1"
        },
        {
            "review_text": "This is the first game I bought on my new PC. I must say that it's absolutely amazing. First of all: The artstyle is unbelievable! It's just a wonderful happy time in general! Just buy it! It's definetly worth the small price!",
            "review_score": "1"
        },
        {
            "review_text": "Remember Grow Home? Yeah, its this game but literally 3x the content. great game",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, just as fun as Grow Home but with so much more to explore and with access to more gadgets.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful game. The visuals, sounds, and animations are stunning. Very gentle and fun gameplay.  I like that the play area is much larger than in the previous episode.  The mid- and late-game abilities are fun, but kind of break the challenge of platforming. I wish their use was more constrained.",
            "review_score": "1"
        },
        {
            "review_text": "A great game for all ages. If you enjoy open worlds with collectibles and unlockables than this game is for you. The art style is cute and the game is relaxing to play. Its almost therapeutic. This is something you could sit and enjoy with your kids, with your spouse, with a friend, or just by yourself. Plus, for ten dollars its a steal.",
            "review_score": "1"
        },
        {
            "review_text": "This is probably one of my favorite games, as it is very entertaining and is good as a stand alone game. My problem is the inability to alter the controls in any way. If you can pilot the Glider and the Starplant with inverted w/s, I would recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a very fun and addicting 3d platformer with challenges, explording and more! This was super fun to play as i really enjoyed Grow Home. I recommend the game to anyone who is a gamer.  Positives about the game...  - You can do whatever you want, build a tower out of mushrooms, no one is gonna stop you! Fly to the moon you say? Well do that, as I said NO ONE IS STOPING YOU :D  - You can collect crystals, floraforms, budssuits. It's simply awesome.  - You can interact with objects such as, stones, floraforms, and more.  - It's a fun 3d platformer with a little challenge built into it.   Sorry the gaame also has negatives :( Negatives...  - Game lags even if you have a good computer, especially when falling.  - Sometimes floraform seeds dont grow even when touchng ground/water. And yes I know certain floraforms grow on certain grounds.  - This is a minor one. Sometimes you drown to quickly.  - Sometimes it can be hard to find the challenges just because they dont have a radar. I know you can use the sattelite thing to find them. It was just really hard to find the last one for me. Maybe next game you can choose what to radar?  Ok thats it, hope you enjoyed my thoughts about the game. Also don't think I dislike the game because I don't i loved it... Also developers if you see this review please take note of it, use the notes that I gave you.",
            "review_score": "1"
        },
        {
            "review_text": "Grow Up is the most fun i think i've ever had in a game. If you like games in which you explore and collect things, this is the game for you.   PLEASE NOTE: The Steam version of this game does NOT require UPlay.",
            "review_score": "1"
        },
        {
            "review_text": "Get it, it's worth the dollhairs.",
            "review_score": "1"
        },
        {
            "review_text": "I thought I had my fill from the first game, but this one right away gives you way more mobility, and a lot more to do. Definitely feels like a worth sequel.",
            "review_score": "1"
        },
        {
            "review_text": "At least as good - if not better - than the first game",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic Game. Really Charming. Good to play while binging a series on another screen or listening to a podcast.  8/10",
            "review_score": "1"
        },
        {
            "review_text": "I loved the first game and I'm starting to love this one just as much. It is easily worth the ten dollars, with new costumes for B.U.D. that actually have abilitys, a much bigger map to explore, other new mechanics like the glider and special challenges. The whole game seems lovingly made and you can tell people put their hearts in it.",
            "review_score": "1"
        },
        {
            "review_text": "What a beautiful world they have created. Wow. I'm a fan and want more.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely beautiful game! I love it so much, the creatures are so cute and hilarious and the physics of the game are fun to an extent until the controls get to be weird, laggy, and somewhat glitchy which is the games only downfall. But opposed to that, the game is amazing. The sound effects are great, the colors compliment each other wonderfully, the world is beautiful, and the soundtrack is absolutely spectacularly. Definitely a must have game if your into casual games like these that give you beautiful worlds to explore.",
            "review_score": "1"
        },
        {
            "review_text": "Perfect, top quality sequel. It's seldom said, but the sequel improves upon all the aspects of the previous game while still preserving the gameplay of the previous game.  To put it bluntly, Grow Up is an exploration game where you wander around a big planet (that actually works like a planet, surprisingly) and collect stuff. Sounds pretty basic, but the fun is in the journey, not the destination. Getting around the planet, exploring and collecting new items and abilities is the core of the game, and it's ♥♥♥♥ing 👌👌 goood sh!t. 👌👌   The character you play as is procedurally animated, so that you wibble around the place like a ragdoll except with the control of an animated character. You can climb around the place using a pretty fun system. Your left and right mouse buttons control your left and right hands. Hold them down, and that hand will grab. You can mix that together to climb up ANY surface in the game, at all.  The graphics are pretty simplistic (although the game still runs like ♥♥♥♥ apparently) although the lighting really kicks it up a notch.  Feast your eyes  [i.imgur.com]   The game is pretty short. I went and 100%'d it in about two days.  Soundtrack's good. There's a load of post-game stuff, and an annoying robot that keeps telling you to do ♥♥♥♥ you've already done.  All in all, it's miles better than Grow Home and feels really ♥♥♥♥in' comfy.",
            "review_score": "1"
        },
        {
            "review_text": "Very glitchy, looks good, fun, makes you rage sometimes, but over its pretty good for the price.",
            "review_score": "1"
        },
        {
            "review_text": "Note to every other game developer : THIS IS HOW YOU MAKE A SEQUAL  Grow Up is the perfect continuation of B.U.D.'s adventures. The first game being short and sweet, this game is now absolutly massive and is filled to the brim with challenges and collectables. The game also imporves features from the first game as well. You can now store powers and switch between them as they can be used and infinite number of times.   But if you're looking for a game that's actually good...STOP WHAT YOU'RE DOING AND BUY THIS AMAZING PIECE OF ART!",
            "review_score": "1"
        },
        {
            "review_text": "Best chilled game i've ever played.",
            "review_score": "1"
        },
        {
            "review_text": "The great game if you liked the previous game, and I have not had one crash.",
            "review_score": "1"
        },
        {
            "review_text": "If you like the first one I feel this is just as good with a bigger world and better movement.",
            "review_score": "1"
        },
        {
            "review_text": "Why don't you own this already?",
            "review_score": "1"
        },
        {
            "review_text": "5/10 - Beautiful. - Fun. - Not challenging enough. - Story line is too simple.  Would recommend for people who like to explore and have some fun along the way. Would not recommend for hardcore gamers who want a challenge.",
            "review_score": "1"
        },
        {
            "review_text": "It's like Grow Home but more so, which is great, because I loved Grow Home.",
            "review_score": "1"
        },
        {
            "review_text": "It builds upon the strengths of the first and remedies the shortcomings as well.",
            "review_score": "1"
        },
        {
            "review_text": "Very taxing on video card and cpu. not sure why. Love the game though. Runs 60fps on my desktop, max 45fps on laptop with nvidea 860m",
            "review_score": "1"
        },
        {
            "review_text": "I had good memories of Grow Home so picked this up without thinking. I was slightly disappointed in all honesty. It only took a few hours to scale most the peaks, grow all the extra phallic plants, and collect all the pieces to complete MOM. A quick browse of the achievements I didn't get (only got a few!) didn't make me want to play any longer. A nice reminder of the old game - but not much more than that.",
            "review_score": "-1"
        },
        {
            "review_text": "Let me start off by saying that I HATE LEAVING A NEGATIVE REVIEW FOR THIS GAME! That being said, I know the people who in charge are reading this, PLEASE optimize it...I really don't know how the people who are saying their PC is high end and can't run it above 20 fps are being downvoted, it is probably trolls hired by the publishers. You can only dream about playing this game on the minimum specs and the reccomended specs wont do you any better. TLDR: If you dont got a good video card and 12+gb of ram don't bother buying it AT THE MOMENT. Inb4 20% of people found this comment helpful. Really don't know how these reviews get downvoted.",
            "review_score": "-1"
        },
        {
            "review_text": "  Very good for a singleplayer.",
            "review_score": "1"
        },
        {
            "review_text": "its seems like a good game and it's story line is cool but its working ♥♥♥♥ on my computer icant even use the jetpack without it crushing.",
            "review_score": "-1"
        },
        {
            "review_text": "It's very strange...  Like, I wanted to enjoy this game like everyone else but in the end, I couldn't. The controls are really wonky. The jumping in the game is just strange and honestly, the entire time I felt like I was playing a free game because of how unfinished and unrefined it seemed.",
            "review_score": "-1"
        },
        {
            "review_text": "Arkham knight level of bad optimization. Like, how the hell can you screw up this badly? Loved the first game, but this is horrible.",
            "review_score": "-1"
        },
        {
            "review_text": "ITS STUPID IT WONT START I EVEN UNINSTALLED AND REINSTALLED IT IT WONT WORK  AND IF YOU KNOW WHY TELL ME PLS Update:ITS WORKING",
            "review_score": "1"
        },
        {
            "review_text": "Pretty much the only game that can make me feel like a kid again, having fun just climbing your way through the levels. Recommended. (This review is sh*t i know)",
            "review_score": "1"
        },
        {
            "review_text": "Its like a second, bigger level for Grow Home. Exactly what you'd want out of a sequel.",
            "review_score": "1"
        },
        {
            "review_text": "ITS STUPID IT WONT START I EVEN UNINSTALLED AND REINSTALLED IT IT WONT WORK  AND IF YOU KNOW WHY TELL ME PLS Update:ITS WORKING",
            "review_score": "1"
        },
        {
            "review_text": "So far I absolutely love it. Serene and freeing. New abilities takes away the stress of falling without taking away the thrill and joy of movement.  Also it is enormous compared to its predecessor. For $9.99 (or was it £?) this game is a steal. ",
            "review_score": "1"
        },
        {
            "review_text": "Relaxing, different and a challenging game to master.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game. 100% worth the 10 dollars it takes to buy the full game, as it is a through and through fantastic experience.  the controls are a bit unwieldy, but it adds to the experience. overall, the game is beautifully designed, relaxing to play, and fun to explore. grow up, along with Grow home, are definately in my list of the top games i've played of all time.  you will enjoy this game if you like physics based games, exploration games, zen games, and it's a safe bet if you're looking for something different to play, too.",
            "review_score": "1"
        },
        {
            "review_text": "If you liked Grow Home, you'll love this one. It's essentially the same, but way bigger, with more abilities, more exploration, more starplants, more everything. It's also super cute and pretty much guaranteed to brighten your mood. Great price, too, for what it's offering (in my personal opinion).",
            "review_score": "1"
        },
        {
            "review_text": "A stunning beautiful sequel to a brilliant game. It's everything you could want in a sequel to the first game, Grow Home.   10+ Hours if you want to go and collect everything. It's really just a wonderful, brilliant game that I strongly recommend if you want to just relax, and take a fun little journey for a bit.",
            "review_score": "1"
        },
        {
            "review_text": "A stunning beautiful sequel to a brilliant game. It's everything you could want in a sequel to the first game, Grow Home.   10+ Hours if you want to go and collect everything. It's really just a wonderful, brilliant game that I strongly recommend if you want to just relax, and take a fun little journey for a bit.",
            "review_score": "1"
        },
        {
            "review_text": "Its quite fun actually. No crashing issue from me. Played smoothly.",
            "review_score": "1"
        },
        {
            "review_text": "This game is fantastic. Simple, easy to play, relaxing fun that can be played at your own pace. Actual collectibles and unlockables that don't cost money. Defiantly worth the 10$",
            "review_score": "1"
        },
        {
            "review_text": "This game is stupidly good. That is all...",
            "review_score": "1"
        },
        {
            "review_text": "This is a better game than the already excellent Grow Home but its still very short, the main goal can be achieved in about 4 hours without working too hard. From other reviews I had thought this was a much larger game, not just a little bigger.  Its not as reliant on the carpal tunnel inducing climbing mechanic as Grow Home, you quickly get better modes of movement and that is very welcome. But you do get overpowered very fast and really don't need to make use of the cool plants or your ability to grow those plants.  Where it falls down is the POD challenges which are not necessary and until you have all your powerups many are impossilbe. They also feel like tacked on typical platformer crap, got bored of them after doing 5 and stopped. Also once you build the ship there isn't any reason to keep exploring except to get more crystals, but you are already powered up and the goal is done so that is just tedious.  The necessary parts of the game are a lot of fun and feel very unique, its a shame they tacked on the tedious bits just to make the game feel bigger or longer when they should have just made the main quest longer.  Still a lot of fun for 5 bucks at sale time.",
            "review_score": "1"
        },
        {
            "review_text": "Fun, but not as good as the first one.",
            "review_score": "1"
        },
        {
            "review_text": "I have only played this for about a half hour, but so far this game is awesome. I played the first one for about 8 hours on my old laptop that could barley run it, but i loved it. Now my pc has evolved and this game runs awesome on it. This is one of those games that you shouldn't pass by.",
            "review_score": "1"
        }
    ]
}