{
    "app_id": 427250,
    "name": "8-Bit Armies",
    "release_date": "2016-04-22",
    "developer": [
        "Petroglyph"
    ],
    "publisher": [
        "Petroglyph"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Online Multi-Player",
        "Local Multi-Player",
        "Co-op",
        "Online Co-op",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Workshop",
        "Steam Cloud",
        "Includes level editor"
    ],
    "genres": [
        "Indie",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "RTS",
        "Pixel Graphics"
    ],
    "achievements": 29,
    "positive_ratings": 1370,
    "negative_ratings": 335,
    "price": 10.99,
    "description": "8-Bit Armies is a retro Real-Time Strategy game. With a colorful, blocky voxel art style, 8-Bit Armies is Petroglyph's most fast-paced, friendly, and accessible RTS game to date. Featuring a campaign of 25 single-player missions, 12 co-op missions, multiplayer and skirmish modes.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/427250/header.jpg?t=1553281185",
    "minimum_requirements": "OS: Windows Vista SP2 Processor: 2.6 GHz Dual Core Processor Memory: 4 GB RAM Graphics: Nvidia Geforce GTS 250 or ATI Radeon HD 3870 DirectX: Version 11 Storage: 2 GB available space",
    "recommended_requirements": "OS: Windows 7 Processor: 2.6 GHz+ Quad Core Processor Memory: 6 GB RAM Graphics: Nvidia GeForce 550 Ti or AMD Radeon HD 6800 Series DirectX: Version 11 Storage: 2 GB available space",
    "reviews": [
        {
            "review_text": " Basically a reskinned vanilla Command &amp; Conquer at its finest",
            "review_score": "1"
        },
        {
            "review_text": "Video Review:           YouTube™ Video:  8-Bit Armies - PC Review&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": " A very straightforward, very pleasant battle strategy game",
            "review_score": "1"
        },
        {
            "review_text": "Advance Wars meets Command and Conquer.  It's Simple, it's spammy and it doesn't try to be anything else. There's a fair amount of content for the price too. Decent sized campaign, coop missions, a fair number of maps for skirmish and multiplayer. Only one faction at the moment (more to come in the future) with only a basic set of units (possibly naval units in the future too) but with gameplay as quick and simple as this (games are usually only around 10 minutes long), you'll rarely feel like there's something missing.  ",
            "review_score": "1"
        },
        {
            "review_text": "Great game, reminds me of the classics of the RTS genre. 100% recommend, worth the price.",
            "review_score": "1"
        },
        {
            "review_text": "If you are a fan of CnC stop reading these reviews and just buy the game already.",
            "review_score": "1"
        },
        {
            "review_text": "Got all my money stolen from an army of Supply Trucks. I then got nuked.  11/10 Best North Korea Simulator",
            "review_score": "1"
        },
        {
            "review_text": "Lets get one thing strait, if your reading this then i'm assuming your on the edge of buying this game. Let me start with a big fat YES! This game is so fun to play and I have enjoyed every second of it. My one consern was that it is a strategy game and I play FPS's, However I found this game to be very easy to learn for people who don't usualy play strategy based games. Another notable feature is the AI. The bots are actually very smart and I found that playing against them is just as fun and difficult as playing the multiplayer. All in all, this game is One of my favorite games despite it being against my normal game flow and I highly recommend it for anyone who is looking for a cheap entertaining game that they can play alone or with friends.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun, I'll be playing this for hours.  Harvesters are C&amp;C Style no braking for anything. (Army of infantry's nightmare)  Addition after more time playing. TLDR: Don't think the AI is another bland RTS bot, it will bring you to your knees thinking so. --------------------------------------- So I was playing one of the beginning campaign missions serving Lord Gaben as usual, and something peculiar happened. The AI had been assaulting one position in intervals when suddenly it had stopped doing so for quite some time. I noticed a scout to the west of my flank; thinking to myself I have a troops stationed there for defense I'll be fine, but was I ever so wrong.  A minute later the three AI's on the map launched two massive tank blitzkriegs on my frontlines on both fronts. Using a mix of rocket infantry and tanks they swarmed my defenses nearly bringing me to my knees. I had a reserve of troops in preparation for an attack but ended up losing half defending this attack. Both myself and the AI's were exhausted for resources by the time the battle had ended in my favor.",
            "review_score": "1"
        },
        {
            "review_text": "I only just happened upon this game today and bought it after seeing the Petroglyph logo on the trailer. I wasn't too disappointed, either. It has all the core elements of a C&amp;C RTS and really brings me back to playing Red Alert or Empire at War about a decade back.  Wish the multiplayer wasn't ♥♥♥♥ed, though.  e; fixed within hours of posting. Cheers, Petroglyph.",
            "review_score": "1"
        },
        {
            "review_text": "Kain is at it again!  If you were like me and was starting to get sick of not being able to run over infantry in new RTS games. Just wanted to blow ♥♥♥♥ up without limits. Then this is for you.",
            "review_score": "1"
        },
        {
            "review_text": "Kain is at it again!  If you were like me and was starting to get sick of not being able to run over infantry in new RTS games. Just wanted to blow ♥♥♥♥ up without limits. Then this is for you.",
            "review_score": "1"
        },
        {
            "review_text": "I rarely write reviews but this game just impressed me too much not to write a recommendation.  As many already mentioned, it's a nostalgic nod to the good old Command &amp; Conquer games (Petroglyph is founded by Westwood veterans after all). When I heard 'Welcome back, commander' in the main menu, it almost made me shed tears of nostalgic joy.  Graphics: The graphics are simple and beautiful (or beautifully simple?). I also like how much of the environment can be destroyed. Great use of colors, I prefer that rather than a palette of dark and grey colors.  Gameplay/units: The units are distinct and not too many and personally suits me well. I've been a big fan of RTS games for a long time but I generally I don't like too much micro-managing of units. The units in this game have their strengths and weaknesses as in most RTS games, but as said in the tutorial - if you're not sure how to manage your army, just build in large numbers - which is a tactic I love in e.g. Supreme Commander. Thus 8-Bit Armies has a (IMO) perfect balance of micro-managing and mass-spawning units, similarly to C&amp;C Generals.  Music: Frank Klepacki, 'nuff said.  Pros: + Cheap price + Classic 90's RTS feeling + Simple yet engaging + Fast campaign missions (if you want to)  Cons: - Only one faction at the time (which honestly doesn't bother me). Also they already have plans to add more factions, so this won't be a problem soon enough - I honestly can't think of anything else right now...   Overall: To put it simply - this game is like the original Command &amp; Conquer but with modern functionality (skirmish, co-op, etc), great classic graphics and great classic Klepacki music. If you're a fan of classic RTS games, this one is a must buy (especially at this price). If you're a fan of modern RTS games which are neither too deep or focused on heavy micro-managing, this should be a good purchase too. If fancy 3D graphics and micro-managing every single unit is what you want, you may want to think twice before buying this game. But you'd miss out if you'd not!  10/10 Would cry tears of nostalgia every day   ",
            "review_score": "1"
        },
        {
            "review_text": "EDIT - with the addition of an entirely new faction that plays completely differently from their initial launch faction I cannot recommend this game enough. The developers have taken on a ton of feedback and have done a fantastic job creating a very good classic RTS game with a really awesome style.   If you are an RTS fan or a Command and Conquer fan this game is a must have.   8-Bit Armies is AMAZING!",
            "review_score": "1"
        },
        {
            "review_text": "Very nice old-school RTS. I barely played any RTS games for over a decade, but was all into RTS back in my school days (Dune2, C&amp;C, Red Alert, SC1). And surprisingly found myself really enjoying this little game. With C&amp;C-line mechanics, simple yet beautiful art style, and classic RTS vibe I would recommend this game to anyone who likes RTS or liked in the past like me and want to have a bit of nostalgic fun.",
            "review_score": "1"
        },
        {
            "review_text": "Wow!! I haven't enjoyed an RTS game like this in a long, long time.  The gameplay has been fantastic and the soundtrack is superb.   Well done, Petroglyph! I am NOT disappointed!",
            "review_score": "1"
        },
        {
            "review_text": "A nice retro style RTS game! Great work!",
            "review_score": "1"
        },
        {
            "review_text": "No unit cap and simple gameplay make this game fantastic if you like C&amp;C this is a strategy for you",
            "review_score": "1"
        },
        {
            "review_text": "Command and Conquer meets Leggo. It's a nice lovechild. This game is very simplistic and fun. Definetly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Despite what people say about the game, it comes down to if YOU enjoyed the old classic rts games (i.e Command and Conquer). If you did, then this game will be a blast to the past for you. Its very enjoyable and has a high skill cap for mastering the mechanics of the game. Basically, its easy to pick up on, hard to master. If you're not a fan, nor have never played older rts games, I'd still reccomend this game as the matches are very quick and full of action. The only complaint I have about the game is the player base. It needs to GROW, because as of now, its pretty hard to find a game.",
            "review_score": "1"
        },
        {
            "review_text": "A fast-paced RTS in a voxel world. Love it!!",
            "review_score": "1"
        },
        {
            "review_text": "Great game for the price, looking forward to more updates.",
            "review_score": "1"
        },
        {
            "review_text": "Plays like the original C&amp;C games from 1995, but with a very different look that is nice in its own way.",
            "review_score": "1"
        },
        {
            "review_text": "Worth it",
            "review_score": "1"
        },
        {
            "review_text": "stop looking for negative comments and get this game, really acsessable and simple, for a first timer like me it got me really into RTS base building games. great game, community is great and loyal aswell. single player is challenging and fun!!",
            "review_score": "1"
        },
        {
            "review_text": "stop looking for negative comments and get this game, really acsessable and simple, for a first timer like me it got me really into RTS base building games. great game, community is great and loyal aswell. single player is challenging and fun!!",
            "review_score": "1"
        },
        {
            "review_text": "This is a really great RTS game. It is simple, has easy to understand controls, can run on a toaster, and is just really fun to play.",
            "review_score": "1"
        },
        {
            "review_text": "Want to experience the olden days of Red Alert 2 and Command &amp; Conquer Generals? You've come to the right place.  So this is really a simple RTS at it's core. It doesn't force the player to learn convoluted techtrees and units hard counters. What it does it does really well instead.  What you get is a campaignmode that unlocks starting bonuses and techs as you progress through the missions. Once you've unlocked a bunch you can go back to that mission you had problems with and take it on with new units and more developed starting base.  Co-op is 10 missions that seems to need some balancing and polish. Hopefully there will be more.  On top of that you got the expected skirmish and multiplayer modes.  The negative bits does really come down to polish. A bit of misses in the interface, Some lacking feedback of what's happening. Stuff that made me think I was playing a game in early access. For example airlifting units with engineers selected is just a hassle since the engies want to repair the transport instead. The middlemouse 'mapgrap' can't be inverted so for me it is just annoying. Nuke impacts should show on minimap until it has happened. It is a bit to quick now. No build queue, but that one I am guessing is intentional. Overall some more polish needed on unit interactions. Right now you can hold C to make them travel in grouped formation. Nice, right? Well except it should be a toggle so you can use attackmove with it. Things like that is what irritates me. I hope it all gets polished out though.  Biggest negative so far is slowdowns/lag. I only played a bit of co-op with a friend and we both noticed it(wasn't hard).  Is it worth it? If you like RTS games that is easy to learn but still have good room for skill. Definitely. If you like building lots of units and slowly creep over the map and just be mean to AI's. yup this is a game for you.  TL:DR  Needs more polish but it is good, could be great.",
            "review_score": "1"
        },
        {
            "review_text": "Throwback to the classic CNC games and digging it. This seems to be in some state of early access with a new faction coming soon.  Regardless, it's an awesome classic RTS",
            "review_score": "1"
        },
        {
            "review_text": "Really great game. A little blocky and clucky at times but brings back what made C&amp;C my biggest addiction. I think Westwood would be proud. Petroglyph what ever you do dont get bought by EA",
            "review_score": "1"
        },
        {
            "review_text": "Great Game! It is seen to be heavily influenced by the Red Alert franchise and even though it is, it can literally be seen as a cheaper version of it. It has amazing Style to it and is all around a great game to get on with friends from two different houses or even a LAN party!",
            "review_score": "1"
        },
        {
            "review_text": "cool game, needs to be a twitch category",
            "review_score": "1"
        },
        {
            "review_text": "Great game really enjoying it hope new updates come soon and more people need to play hope this game blows up",
            "review_score": "1"
        },
        {
            "review_text": "OK, so I would have like a sprite based RTS more, but you cannot deny how fun the gameplay is.  As a old school C&amp;C diehard fan, this is like candy. All I've wanted from an RTS since Red Alert 2 is more of the feel those classic games provided, and its taken this long to get us there.  8-Bit Armies is as basic as it gets right now, but its FUN. My first 8 player FFA online made me feel like I was 15 again, skirting responsibilities to stay up later to play.  It is shallow however, but there are shades of greatness here. If Petroglyph keeps adding to this, it could be a great treat for RTS fans like myself who have been looking for the glory days of C&amp;C.  Great job Petroglyph! I'll be telling my friends to pick this up!",
            "review_score": "1"
        },
        {
            "review_text": "Can a game be both fun and boring? Yes. Extremely simplistic gameplay with no depth of strategy.",
            "review_score": "1"
        },
        {
            "review_text": "Quick Review:  Really fun game, amazing campaign with good replayability (You are actually rewarded for retrying missions to get all the stars and then gain bonuses for future missions)  Multiplayer works well, little frustrating with the AI as harvesters take the longest routes unless you force them to change and the enemy rushes you really hard at the start of every game, if these were tweaked it'd be great.  Otherwise, its definately worth getting, great game with even more potential",
            "review_score": "1"
        },
        {
            "review_text": "was good game, lowkey tho only returned because no one be playing online Might buy when it more populer if it gets populer .hmu tho if you would play with me and i might get again overall tho good game",
            "review_score": "1"
        },
        {
            "review_text": "What a blast from the past....A simplified RTS with roots in Classic C&amp;C and Tiberian Sun. I will admit that i am a big fan in part because I worked at Westwood Associates/Studios in the early 90's and know the guys who founded Petroglyph and support them. They still do what I gave up doing years ago and still regret it in many ways. If you are a classic C&amp;C fan, $15 is a small price for Big fun. Just buy it if you liked C&amp;C and are still into the RTS Genre.   Pro's Graphic style is simple and cool Feels like a simplified C&amp;C to me No MicroManagment Speed Simple rules Always being patched and improved. Lately they have been coming weekly. Oh the hords of units I can build. Price  Negatives AI could use some improvement   Now go play",
            "review_score": "1"
        },
        {
            "review_text": "Looking forward to playing my new game,   *Gets in game* *Builds 5 units* *a bot with 30 helicopters ♥♥♥♥ me 30 seconds in*  10/10 would get ♥♥♥♥♥ by heli's again",
            "review_score": "1"
        },
        {
            "review_text": "Liked C&amp;C before EA ruined it? Buy this: It's very good, and with time it will be great if Petroglyph follows through.  Mechanically, this is a slimmed down C&amp;C for 2016. It's made by original Westwood Studio devs, it's filled with references (Cain and Seth are there, and the first playable faction is called the 'Renegades'), and Frank Klepacki is the genius behind the soundtrack. It's C&amp;C.  Shortcomings? Petroglyph want the game to be accessible, so complexity at launch has been sacrificed. The game is easy to understand and get into, but there's not the same depth of strategy as in past C&amp;C titles or StarCraft - yet (I hope this changes as new factions are released and the game matures). There's also still that, imo, annoying building placement proximity 'limit', and no convenient way to expand deeper into maps as no additional HQs can be built.  I'm excited to see what Petroglyph is able to do.",
            "review_score": "1"
        },
        {
            "review_text": "Great game really enjoying it hope new updates come soon and more people need to play hope this game blows up",
            "review_score": "1"
        },
        {
            "review_text": "Are you kidding me?   10/10 Of course, the replayability alone is worth a lot.  I have not tried the multiplayer yet, I am two missions from finishing the compaign.  Take my money and give me that soundtrack too :)  Read the rest of the reviews, they explain pretty much anything. nothing to add but my support :)",
            "review_score": "1"
        },
        {
            "review_text": "its very good game whit alot of replayebility and i recomend it to all the game have unique feature that can play whit other 8 bit games i like it alot :D",
            "review_score": "1"
        },
        {
            "review_text": "Great game. It aims to be a fast paced RTS and i feel it achieves this well.   The Developers are still actively working on this game and adding more to their 8-Bit universe with their 8 Bit Hordes expansion. They are trying to create a universe where dragons can fight against tanks and even more. The devs are also active in the community and happily discuss feedback for the game.  With the pricing they have for 8 Bit Hordes for 8BA owners it shows they care about their playerbase.",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome, especially if you never used to like Strategy games, this game will change that.",
            "review_score": "1"
        },
        {
            "review_text": "I was buliding a army and the BOT stole my Oil and killed me 10/10",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ing great game,needs some more troops and buildings. Definetly recommended if your looking for an rts filler!!! Check this game out",
            "review_score": "1"
        },
        {
            "review_text": "a realy fun rts that reminds about the old C&amp;C games. awesome artstyle and great soundtrack",
            "review_score": "1"
        },
        {
            "review_text": "I love this game! Simple graphics, loads of fun, and the rage after your friends kill you.   Question: Are you going to add more things to the game?",
            "review_score": "1"
        },
        {
            "review_text": "it won't let me play i try to load it and says make sure steam is runing and your logged in i'm really confused someone please help",
            "review_score": "1"
        },
        {
            "review_text": "HONEST SHORT REVIEW:   First off, the concept is not bad. I like its CAC style system. Graphics are ok. On its release, the game has a few issues such as the bad campaign, the spammy ai, the defective units and multiplayer issues.  Thing is that the units aren't that good. I felt that they were weak. The main infantry, is a machine gunner. It doesn't really work that way. Rocket men are just so weak that you need to spawn a blob of them to take out 2 jeeps. 'Blobbing' is the only way to win (Blobbing is creating an army that is so big that it can be seen from the radar btw).  Don't worry, if you bought this game, don't uninstall and refund. The community should be able to help this game be stable as it is in its first days of release.   Do i recommend it? Yes but if the game is stable enough. Game is i guess, fairly priced.   6/10  'Hey, at least its better than a pay 2 win game'",
            "review_score": "1"
        },
        {
            "review_text": "Reporting...reinforcements have arrived....new construction options! This definitely brings back memories of the golden age of RTS games.",
            "review_score": "1"
        },
        {
            "review_text": "  Got gifted this by a mate about a week ago, and please hear me out if. We've had a few games, and we're pretty much eternally grateful for the update stopping the AIs rushing at the start. The aim of this game seems to be to provide players with a quick, simple match which can be over in a few minutes. I haven't checked out the singleplayer yet, but from what I can tell from the multiplayer, there's not really much content. Each game is over in about half an hour, longer if you're evenly matched with your opponents or frustratingly short if you're outclassed. Different map sizes help extend game time, but overall each match is pretty short. Which is ok, on its own. Match length doesn't affect the quality of most games, take League of Legends for example (As toxic as the community is, the game itself isn't too bad, but back to my point). The match length isn't the problem. It's the lack of context, and content. Every game is extremely linear. Refinery, barracks, motor pool, lab, radar, air control, nukes, spam units. That's all you can do as a player, and all other players can do as well. There's no variety of units, and every match feels almost the same as the last. Longer games become a match of exhaustion, when all involved players have used all the money they have and can get, and they're sick of carrying on. Don't get me wrong, I have four hours on this game, and it's only been out a couple of weeks, so I've only played a few games, but I've already started to notice this problem with content in games. Adding colour-specific weaponry and units might help add some variety to the games, and prevent this repetivity, but I get that the game is supposed to be simple for everyone to play. If the gameplay doesn't want to be touched, maybe add a levelling system outside the game that can add minor bonuses, like Shellshock Live. It might not prevent each game from being repetitive, but the progression would make each game feel worthwhile. This is by NO means, a bad game. Hell, if it adds enough content to flesh it out, then it'd be amazing. This game could be one of my favourites, with just a few more months of development, but for now I'm just going to wait, I think. Well done on making something nice, clean, and good to look at though. We've encountered barely any bugs, too. So, good job, and keep it up :D",
            "review_score": "1"
        },
        {
            "review_text": "Me and my friends love to play this. We always have fun. The only thing that I would say this game is lacking on it the option to rotate buildings. Its soooo annoying. Other then that this game is a must have for potatoe pc rts game lovers!  Need to finish and add better AI though.  At the moment the AI is extremely rushy. If you dont make a base within 1 minute any AI will rush you can kill you. There way too fast. I understand this for hard and insane. But normal should not be this fast to take you out.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best games I have had on steam. The moment I saw the trailer I realized that this is what I had been waiting for. An 8-bit voxel game with simple graphics and great opportunities for strategic thinking in both attack and defense. The AI is great and makes interesting gameplay, especially with more than 2 players. The multiplayer is great and I love the element of teamwork in having 2v2 or 3v3 games. 10/10 this game is very fun.",
            "review_score": "1"
        },
        {
            "review_text": "8-bit armies is a challenging, traditional RTS that successfully captured my grizzled attention- I have been playing video games for 3 decades. I have only played campaign or skirmish.  Positives: +Art style +General fun factor (the little animation touches). +Harvesters have enough armor to make them self-sufficient. +Most campaign challenges are fun and offer replayability. +Sense of accomplishment as you start with a larger and larger prebuilt base. +Music is memorable. +Simulated micromanaging AI (except for nukes, see negative).  Negatives: -Rocket Turrets too powerful (splash damage). -Can't dodge/evade rockets from rocket turrets = makes reconnaissance suck. -Having troops exit APCs is more difficult than it needs to be. -Look at the completion rate of the Steam achievements. This game gets DIFFICULT. -Simulated micromanaging AI for nukes is too perfect. They evade in perfect circle around blast. -Ally AI in campaign acts incredibly stupid. -Patches to balance the PvP usually affect the campaign missions negatively.",
            "review_score": "1"
        },
        {
            "review_text": "It's like a 'best of command &amp; conquer', but new, so it actually runs on new machines, multiplayer works again... It's just beautiful.  Buy it.",
            "review_score": "1"
        },
        {
            "review_text": "A fun throwback to old-school Command and Conquer, this game has an amusing aesthetic and solid, old-school gameplay.  However, the minimal content is a problem. The campaign is a barebones set of glorified deathmatch levels, and the game started out with only a single faction, and even now only has two.   I recommend it, but wait until it's on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, another campaign mode would be great",
            "review_score": "1"
        },
        {
            "review_text": "Love this game! Brings back the old C&amp;C feeling. The fact that this was made by old Westwood employees instantly sold me on this game. I knew it would be great.",
            "review_score": "1"
        },
        {
            "review_text": "Simple, but good RTS game. Great for people who haven't played strategy games before.  8/10 would spam helicopters again",
            "review_score": "1"
        },
        {
            "review_text": "really good game",
            "review_score": "1"
        },
        {
            "review_text": "Immensely fun game. Playing with friend enhances the experience. Shoddy servers, when making large armies small lag spikes start appearing or worse.  Overall rating 6/10",
            "review_score": "1"
        },
        {
            "review_text": "A surprisingly enjoyable 'Brick' version of Command and Conquer.         YouTube™ Video:  8-Bit Armies Gameplay and Review!&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "8-bit Armies (and hordes) is awesome, only played a few hours thus far but really excited, already feel like I've gotten my money out of it! Very excited for the release of 8-bit Invaders and look forward to playing with friends online over the holidays! Awesome map making tool and community thus far! (was able to throw together a map pretty quickly so I can relive the glory days of my favorite RTS maps!).",
            "review_score": "1"
        },
        {
            "review_text": "I love the game, clean and simple UI, good slection of maps plus community maps and a pumping soundtrack.  Awesome :)",
            "review_score": "1"
        },
        {
            "review_text": "Very Fun, Played for hours with friends! Would recommend!",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game, ive found very little to complain about. The one thing i dont enjoy is the imbalance between this and hordes, the two hordes factions are much stronger than the twoi armies factions. Beyond that this is a game of making rationl decisions to benifit the team or yourself. Overall 8/10",
            "review_score": "1"
        },
        {
            "review_text": "If u want to play ALL co-op and campain u need to pay extra............  The game is fun, there is no auto match systeem.. I need to search for your match.  Not much peeps playing.  they treid it..but no..   There are not coming water units..the most funny of all. Likes Generals.. No water units........ Just a game perfect for water units but no..  I can keep on talking like this, but its a cheap fun game. Worth buying? No.. not atm  More ppl stil need to play it. There promotion is bad. But need to say they dont sit stil and keep on working for the game.",
            "review_score": "1"
        },
        {
            "review_text": "Great game to get into. Very easy to learn. Hopefully they keep expanding the game for free.",
            "review_score": "1"
        },
        {
            "review_text": "I'm not big into RTS games, but I've always enjoyed them. The only ones I've ever really played were Age of Empires, C&amp;C: Red Alert and Total Annihilation. This is a pretty fun game that is easy to jump into to that doesn't take a lot of time to play. To get the grasp of it, I just did two 20 minute plays with AI on easy and kicked butt. If you're looking to test out the genre as a first time player, jumping back into the RTS genre for the first time in a long time, or like to play RTS games from time to time - I recommend. If you're looking for something a bit more indepth, I would look elsewhere. Great job Petroglyph!",
            "review_score": "1"
        },
        {
            "review_text": "Great game overall! Reminds me of the classic RTS games (like command and conquer) but very simple and accessible. Games last 15-20 minutes on average and are very fast paced. They have two factions, with a plan for 4 more! Map editor as well, and the custom maps keeps growing. I play skrimish exclusively, but multiplayer looks amazing. Highly recommended!",
            "review_score": "1"
        },
        {
            "review_text": "Brings Tiberium Wars back to life in pixels :D  (The AI difficulties do need to be nerfed, and then it would be excellent.)",
            "review_score": "1"
        },
        {
            "review_text": "This game does not need to be told how awesome it is, get out of the reviews and buy this aready.",
            "review_score": "1"
        },
        {
            "review_text": "If you are a newcomer to RTS games, or you are a fan of oldschool RTS games (C&amp;C in particular)- this is a no-brainer. It is fast, friendly to learn, easy to pick-up has cool graphics, and a soundtrack made by Frank Klepacki- what more can you ask for? What's awesome that you can play 8-bit armies against 8-bit hordes, the idea is awesome because the 8-bit armies has a rafinery and power based economy like in Westwood RTS games and the hordes have a farm and worker economy like in Blizzard's RTS games, so you fight one style against the other. Love that concept. It is a bit basic- I can give that, but the base of the 90'ies RTS are there and are just as fun- maybe even a bit more because this one feels faster paced. Maybee I would wish there were more units, but the ones that are there get the job done. And the campain is bare bones. But other than that I'm having a good time with this one, because C&amp;C is my favourite game series of all time and this one fills the gap EA made by murdering it.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, amazing fun having a huge army Recking everything it comes into contact with. Just hoping you add more badges as I want a helicopter or tank one on my steam profile.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a great throw back to an age when command and conquer games were at it's prime. At this pricepoint, it is well worth the money. However being a veteran from the C&amp;c world, I do have some bugbears. Clicking on units only result in a shrill 8bit sound. While i understand why, due to cost or whatever, I do miss the confirmation from soldiers or tanks and their voice acting in the days of olde. It's a small problem, nothing mods can't fix eventually.   I would wholeheartedly recommend this game to anyone who miss the whole command and conquer style of gameplay. It is a good game while we wait for a true blue command and conquer game to one day may come.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome old school RTS in a fun camo!",
            "review_score": "1"
        },
        {
            "review_text": "Good game that's fun to play with friends. It can get a little repetitive, but it's a pretty solid RTS for the price.",
            "review_score": "1"
        },
        {
            "review_text": "Feel incredibly cheated by the fact that 8 bit armies is basically three factions with something like 10 units. This would have been fine if more factions and replay value was added, but what you see now is probably what you're going to get. All of the other factions are being added in the form of basically DLC, which is going to end up costing you around £30 for just the factions. Campaigns cost extra, because of course they do.  Basically, if you really want to pick up a RTS for cheap, get something like dawn of war. It's a hell of a lot more value for money, and I have a feeling 8 bit is only going to get more watered down and more expensive.",
            "review_score": "-1"
        },
        {
            "review_text": "TL;DR: Buy only if you  really  crave a C&amp;C-like RTS   Pretty okay C&amp;C clone, but sadly the single player's really shallow and at times boring. Because of that, I can't recommend 8-Bit Armies.   The campaign(s) are essentially one skirmish map after another, i.e. no special campagin maps, just the skirmish/mp maps. No real story, just copy&amp;paste paragraphs alá 'Good job defeating {enemy_commander_A}! Your next objective is defeating {enemy_commander_B} and his {next_mission_gimmick}!' Mission variety seems low, so far I encountered:    Destroy specific enemy building(s)    Defend your base for x minutes    Defend ally for x minutes    Gather x amount ressources in y minutes  Every mission has 2 bonus objectives (one is some kind of restriction (e.g. don't build infantry) and the other always a speed challenge (finish all objectives within 10 minutes). Objectives unlock new technologies, starting units and buildings (i.e. you start with more stuff, that you don't have to build).  I played one co-op mission so far and while they seem to follow the mission layouts described above they're pretty challenging (especially if you try to go for secondary objectives). The enemy AI seems to be more aggressive than in the single player.  Haven't touched the other modes so I can't say anything about those.  The controls are pretty good (mostly anyways, unloading several transport helis is pretty finicky without keyboard shortcuts). The game seems to be almost bug free and runs pretty nice.",
            "review_score": "-1"
        },
        {
            "review_text": "First off id like to say the game is fun, and looks really cool However for some EXTREMELY annoying reasons i have to downvote AI/Balancing When playing againts AI and especially on co op the AI seem to have it out for you, and usually start with FAR more than you will ever get, typically ill have like a few troops and they have tanks and stuff like that. Which makes it very hard and very unfair towards the player. Me and a friend did co op and within 2 minutes i got nuked and had all the teams hit me. The balancing for AI (keep in mind i tried it on the easiest and still got my ♥♥♥ handed to me) needs a major overhaul The balance in terms of troops is insane A tank ONE TANK can run over an entire army of troops. and helicopters are op as all hell Also when they start with multiple tanks and i start with little to nothing (and on some maps you dont even GET tanks) the AI is stacked against you hard Explosives only damage structures really, bullets only damage troops. I mean they do damage others but they are mainly made for that, which further adds to the frustration. If a soldier with a rocket launcher cant kill a gunman that makes no sense but whatever  Overall the AI and balance is trash and i advise you do not get this  Also check my screenshots and see how many troops the AI gets compared to us, keep in mind the game lasted like under 5 minutes. The AI basically started with 100 troops. I started with like 10 maybe. When 100 troops per AI, and all 6 or so AI attack you at once, you dont stand a damn chance",
            "review_score": "-1"
        },
        {
            "review_text": "Great game, love command and conquer-like games. Only problem i'm seeing is how the AI in multiplayer and co-op multiplayer absolutely destroy you in the beginning. It is set on the lowest difficulty(beginner) and my friends and i still had trouble winning. It just seems super difficult. Plus the harvesters to collect your oil are super dumb. other than that, everything else seems ok. Fix those things and i'll be happy.",
            "review_score": "-1"
        },
        {
            "review_text": "A bit TOO simplistic. All the maps look, feel and mostly play the same although they're superficially different. Despite what you may have heard this does NOT capture the old CNC feel of the older games. I'd avoid this one unless it was deeply on sale (&lt;$5).",
            "review_score": "-1"
        },
        {
            "review_text": "Very nice aesthetic and a nostalgic core engine...  However Helicopters are so OP it ruins the entire game.  The single player campaign maps are all repurposed multiplayer maps, which also feels cheap and unpolished.  Overall: technically fun game with some control and play balance issues cutting into that fun more than I could tolerate. I was really dissappointed by this because it clearly has the potential to be so much more.",
            "review_score": "-1"
        },
        {
            "review_text": "Is a great game i rate it 9/10, BUT IT CRASHES MID GAME EVERY TIME",
            "review_score": "-1"
        },
        {
            "review_text": "Terrible you can only expand by building buildings at your border. The Resource system is absolutly disgusting and the units are unbalanced crap",
            "review_score": "-1"
        },
        {
            "review_text": "While I loved CC and Red Alert, this game feels like it's made for the current generation of gamers (10-12 years old).  And voxels ? Since Minecraft, most of the kids play minecraft or terraria which this game is great for them. I felt really excited since Red Alert 2 was one of my greatest childhood memories, countless of lan battles and more. 8bit Armies resembles of CC/Red Alert just by the base building and actual gameplay. 'Same same, but different, but still the same'.  You may say that I haven't played enough, I know when a game is NOT FOR ME, it may be the one for you, but for me is not.",
            "review_score": "-1"
        },
        {
            "review_text": "Bought the game thinking it'd have a decent amount of people playing multiplayer? after all the game is from 2016!  Login, go to play MP - NO GAMES... wtf?  Look on redit - same thing, nothing.. Welp instant uninstall and hope i get a refund.",
            "review_score": "-1"
        },
        {
            "review_text": "A semi-fun distraction that lasted about 1 hour of gameplay. Uninstalled after that. As a big time RTS p[layer and former C&amp;C fan, this brought me zero nastolgia. I wouldnt bother getting this.",
            "review_score": "-1"
        },
        {
            "review_text": "crashes to many times",
            "review_score": "-1"
        },
        {
            "review_text": "  the most basic mm0",
            "review_score": "-1"
        },
        {
            "review_text": "This game was a definite interest to me as a old C@C player, but the simplicity of this game isn't neccesarily a good thing. Anyone can learn a more complex strategy game if they simply put in the time. Multiplayer is a fun and tense experience, if you find any matches. If you enjoy playing against AI, like me, then you'll more than likely be dissapointed.  I feel like the AI is very shallow and thoughtless. Hard AI whips up a base and has enemies on you before you as a human player can so much as build your first turret or have your vehicles out. Its more about overwhelming numbers for the AI, whilst building the most scatter-brained base defenses. If you try some smart tactics like sneak in from the back, most often you'll see the ai units aimlessly standing around. They'll only move to defend their base if you get too close. AI, like with all C&amp;C games, will almost always take the same generic path through a map. This allows countering even Insane level AI by setting up a heavy defence at their expected route.  One of the skirmishes i played was assasinate. The AI superunits simply acted as glorified infantry taking on an assault on its own. With its underpowered rifle, it would only makes sense they'd try to keep it safe, not the first line of defense. Needless to say, i wiped the AI without ever seeing their base, and to top it off, an ally of mine decides to nuke the area of a recently defeated AI base.  Really I want to love this game but the single player aspect is all i really care for, and the AI is just not smart. If the AI gets some improvements, this would be a much better game for offline play. I would love to see AI behaviors, such as turtles or steamrollers found in C&amp;C Generals. A emphasis on exploiting player weaknesses or openings aside from brute unit steamrolling would make offline play much better.  If you don't get the game, i would definetely recommend the soundtracks. Frank Klepacki has made an astonishingly beautiful set of tracks for this game, as he has for all of the original Westwood developed C&amp;C titles.",
            "review_score": "-1"
        }
    ]
}