{
    "app_id": 427480,
    "name": "FritzChess 15",
    "release_date": "2016-02-22",
    "developer": [
        "ChessBase GmbH"
    ],
    "publisher": [
        "ChessBase GmbH"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Chess"
    ],
    "achievements": 0,
    "positive_ratings": 26,
    "negative_ratings": 21,
    "price": 27.79,
    "description": "What does the modern chess player need? A sparring partner, a trainer, an up-to-date database and access to an online chess server! Fritz, probably the world’s most popular chess program (think back to FRITZ’s unforgettable victories against Kasparov, Kramnik &amp; Co) offers just that for beginners and tournament players alike: it plays...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/427480/header.jpg?t=1456131657",
    "minimum_requirements": "OS: Windows XP (Service Pack 3) Processor: Pentium III 1 GHz Memory: 2 GB RAM Graphics: Graphic Card with 256 MB RAM DirectX: Version 9.0c Network: Broadband Internet connection Storage: 1 GB available space Additional Notes: Windows Media Player 9",
    "recommended_requirements": "OS: Windows 10 or 8.1 Processor: Intel i5 (Quadcore) Memory: 4 GB RAM Graphics: Graphic Card with 512 MB RAM DirectX: Version 10 Network: Broadband Internet connection Storage: 1 GB available space Sound Card: DirectX10 compatible sound card Additional Notes: Windows Media Player 11",
    "reviews": [
        {
            "review_text": "Great best chess sofware ever.  But still no mac version from chessbase :(  And here on steam it not say if is 32 bit or 64 bit is , I need 64 bit , still not know which version it is of fritz 15 engine.  And steange there is no update button in fritz 15 gui. does steam users get no updates of the program ??",
            "review_score": "1"
        },
        {
            "review_text": "I paid on the nose for this chess program with great expectations only to be let down. The chess engine is great as you would expect but the GUI is buggy at best; it constantly stalls and flickers; it is definitely not worth the money they ask for it. The overall feel of this program is that it is still in the Beta stage of development (after 15 versions?) They do not offer a 64bit download! I circumvented this problem by downloading a pirate copy and entering my product key from steam to make it a legal copy. Now I can run both 32 and 64 bit versions on my computer.",
            "review_score": "-1"
        }
    ]
}