{
    "app_id": 427930,
    "name": "Army of Tentacles: (Not) A Cthulhu Dating Sim",
    "release_date": "2016-02-15",
    "developer": [
        "Stegalosaurus Game Development"
    ],
    "publisher": [
        "Stegalosaurus Game Development"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Captions available"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Indie",
        "Adventure"
    ],
    "achievements": 69,
    "positive_ratings": 38,
    "negative_ratings": 27,
    "price": 3.99,
    "description": "At long last, the works of H.P. Lovecraft meet the medium of RPG in a spectacle of light and sound befitting an old western. Only this is set in New England. Meet interesting people! See astounding wonders! Enslave humanity! Go on one date side quest in a game subtitled a dating simulator!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/427930/header.jpg?t=1553635650",
    "minimum_requirements": "OS: Windows XP Processor: Intel Celeron CPU 1000M 1.80GHz Memory: 2 GB RAM DirectX: Version 10 Storage: 2 GB available space",
    "recommended_requirements": "OS: Windows 10 Processor: Intel Celeron CPU 1000M 1.80GHz Memory: 2 GB RAM DirectX: Version 10 Storage: 2 GB available space",
    "reviews": [
        {
            "review_text": "Short (took me 99 minutes from start to finish, rest of the time is just waiting on card drops). Fun visual novel; making fun of itself throughout...not drop on the floor funny, but made me smile at times. RPG elements are there, although I don't really know if they do much of anything. 'Fights' occur throughout, which are basically puzzles related conversation replies; most fairly simple once you know what the correct trend is in each fight. You can die during these battles and be sent to the Game Over screen; so you may want to save periodically so as not to have to backtrack too far. A fun diversion for what it is. I wouldn't play it again but would pick up DLC if it was a new story (or continuing story). For Achievement seekers, I would think you could at least double the play time as there does seem like there were more areas to explore before the game forced the ending sequence.",
            "review_score": "1"
        },
        {
            "review_text": "Game tried to 'religion me.'",
            "review_score": "1"
        },
        {
            "review_text": "Army of Tentacles: (Not) A Cthulhu Dating Sim is a game that I recommend because: - it is a method to banish boredom - it has an acceptable price - it is indie &amp; casual - it has adventure - it has trading cards  Enjoy!",
            "review_score": "1"
        },
        {
            "review_text": "Ten minutes in and the complete disconnection between the background and foreground art, the absolute lack of any real notible interactivity, and the frankly horrendous clash between everything else being voice acted except the protagonist.  For a game that is desperately attempting to be practically 'lol I am so random', it hardly merits consideration let alone the fact that someone purchased this for me for FIVE DOLLARS USD.  A fast food cheeseburger is a more satisfying experience. Tastes better too, and is cheaper on average.",
            "review_score": "-1"
        }
    ]
}