{
    "app_id": 427980,
    "name": "Aozora Meikyuu",
    "release_date": "2016-01-27",
    "developer": [
        "Yume Creations"
    ],
    "publisher": [
        "Yume Creations"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 18,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Nudity",
        "Anime",
        "Visual Novel"
    ],
    "achievements": 1,
    "positive_ratings": 386,
    "negative_ratings": 96,
    "price": 3.99,
    "description": "Aozora Meikyuu is a short Romance Visual Novel with focus on a cute girl.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/427980/header.jpg?t=1519463911",
    "minimum_requirements": "OS: Windows XP or later Processor: 1GHz Memory: 1 GB RAM",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Who needs real life 3D women who will hurt and betray you when you can find comfort in the smile of a gentle 2D virtual love? That was Aoi’s point of view until Sora came into his life.  Aozora Meikyuu  is a visual novel that  tells the story of Aoi and Sora’s meeting and path to romance . This unlikely pair have to figure out how to co-exist as Sora tries to bring out the kinder side of Aoi. A tale of human emotions, sexual desires and personal growth,  Aozora Meikyuu  will take readers on an interesting journey with lovely artwork to bring everything to life.  Aoi is a normal high school student until his love confession to a classmate goes wrong and he drops out after the rejection. Years later he is now a, hikikomori, shut-in who spends most of his time watching anime and playing video games, especially visual novels. One day on his way home from the store a beautiful young woman with cotton candy-hued hair literally falls from the sky on top of him, naked. The lovely Sora then proceeds to force herself onto Aoi’s life, moving into his home and becoming his housemate. Despite Aoi not wanting to deal with her  he can’t help but grow closer and closer to the mysterious girl , the game following their relationship until the shocking end.  I can’t really go much more into detail about the story without spoiling anything, however it did take a bit of an unexpected turn. During most of the game Sora doesn’t talk about herself at all nor does she give much reason for being so attracted to Aoi. He treats her pretty badly for the first half of the game, you can even kick her out of the house and not let her stay but that will end the game prematurely. There is also another girl after his affection, Misaki, however she seems very shoehorned in and it’s also odd that she wants anything to do with the protagonist.  Aoi is a shut-in who would rather look at anime girls than real ones , he’s rude and rather depressing. He only becomes more likeable after falling in love with Sora. The second half of the game is mainly about their relationship, sex life and him coming to terms with where his life is at the moment. Misaki, despite being another romantic option, only shows up twice and only has two ending; a good and a bad one. She also has no CG pictures which is a shame.  All of the CG is of Sora, and it’s well done. She is drawn to be very busty and sexy and the artwork ranges from cute to downright sexual. There is no nudity in the game, save for one picture so everything is pretty tame.  There are sex scenes in the game  but they mainly consist of kissing and then fade to black moments. I don’t mind this but for the amount of times sex does happen it makes the lack of CG for the scenes very apparently. The music is nice, there isn’t a huge amount of variety however. There were a few times where the music seemed to be a bit creepy but nothing of the sort was actually happening which created unnecessary suspense.   Aozora Meikyuu  is a simple game, it won’t take that long to finish one play-through and the other endings are easy to get after that. The story itself has a few dull moments, unfortunately having to do with a lot of the day-to-day interactions between Sora and Aoi. When the plot takes twists and turns, they’re very interesting and well written but overall the game hoovers in neutral territory with not much happening. However, it’s a good read with lots of choices to make and the choices are a timed which is a nice feature for this genre of game.  There is plenty of humor in the game , especially at the irony of it being a visual novel about a shut-in who plays visual novels. The price is very reasonable for the game’s length and there are also trading cards to collect, if you don’t mind a bit of naughty humor I would recommend this game wholeheartedly.     For more recommendations and reviews on our favorite up and coming quality games follow  Lot's O Giveaway's  group curations  here !",
            "review_score": "1"
        },
        {
            "review_text": "It may have been a short visual novel but it's worth the price since it's a joyful read (I don't put a price on quantity, I put a price on quality and this is a read I really enjoyed). There were a couple grammatical errors but it wasn't much of a problem. I replayed it a couple times and really enjoyed finding the happiest ending possible! Great artwork and a very interesting plot twist at the end!   I recommend this short visual novel if you're looking for something nice and simple :)",
            "review_score": "1"
        },
        {
            "review_text": "I would start by saying that the plot is almost non-existent in this game, but I know story isn't the main reason why people buy it. It has nice graphic and quite good music, which is neat. It also has terrible protagonist, that isn't shy, nor anti-social, but just whiny and annoying, no sense whatsoever, no depth and no substance. If you like games, where you can look at some anime boobs and not much else, suit yourself. Otherwise, pass on this one.",
            "review_score": "-1"
        },
        {
            "review_text": " My playtime is because of letting it idle while at work for the remaining card drops. Actual playtime is around an hour with a little more to take alternate paths.   I enjoyed this short visual novel. A naked girl falling from the sky was a bid odd, but the ending cleared that up. The rest of the beginning seemed a bit typical, and I started to get annoyed at Aoi and wanted to punch him for being such a weirdo. As the story progressed, I was really intrigued with what was going on. I wanted to know why they both acted the way they did. The ending was a complete surprise. I was both happy and sad for the guy.  I'm not sure if I would've paid $4.99 for it, but I got it as part of the 'Anime Angels' bundle on IndieGala.   I really recommend giving this game a go if you can get it on sale.  ---   For more...    My Reviews   ||  My casual gaming...     Group   |   Curator Page  ",
            "review_score": "1"
        },
        {
            "review_text": " NO NUDITY HERE   Basically, Aozora Meikyuu is a short visual novel, made for newcomers in this genre and people who don't want to have to read lots of texts and complexes plots. The game has only few choices, and those will determine if you get a good or bad ending with girl A or B. For now, I only finished one route, and according to STEAM, it toke me 0,8 hour to end it.   About the plot and story, is better if you don't care much for it. It's the classic MC who live alone with 2D waifus that find a nude girl with a shady past and let her into his house. Then, in some point, an old crush will came back and say that love him and just rejected him before because of... what? Anyway, this it. Simple. Also, characters don't develop to much (MC will turn itself in a ♥♥♥♥ machine, if matters).  I enjoyed the art, but I must admit that it's not a artistic masterpiece or somewhat close to it. Is plain good, so as the soundtrack. And if you're searching for nudity, this game is not the right for you, even if the devs released a patch for remove the censure of one scene.  So, this is it. My points:  - Simple, good for people looking for a plain simple visual novel. - Good art and soundtrack. - Forgettable characters and story - Good price point, perfect if you got in a sale.   NOTE:  7/10",
            "review_score": "1"
        },
        {
            "review_text": "I haven't played very many VN's, but i really enjoyed this one. You hear about sterotypes of otakus who replay/save state their games to see every ending to a VN? yeah that was me. I didn't expect to do anything like that for this game, i only got it for the easy achievement. Honestly though, this was a very good story albiet the cringey weeaboo moments.   I just really wished it was a happily ever after ending. I mean it was for the good ending, but like...with everyone alive and human.  ",
            "review_score": "1"
        },
        {
            "review_text": "A short but sweet lovestory.  - There are really a bunch of decissions to make  - There are also a lot of CGs in the game  - Sora is soo adorable  - I like the background music pretty much  - The good ending satisfied me  In my case, I´m totally satisfied with this game. I´ve never thought of it, that you will get here so many CGs and decissions in a 5€ VN",
            "review_score": "1"
        },
        {
            "review_text": "  First time i look at this Visual Novels, I was like, This would like and another visuals novel that available on steam. The reason i played this game was to recevie some trading cards. It was totally ♥♥♥♥♥♥♥t. In the first scenes, If you choose to call police or do nothing to decide Sora stay or not, She will leave and it's the end of the game. Neither Choose Not to follow Sora when at you met Misaki at the park, both of you will die. Or Choose Misaki when Sora and Aoi have a fight, the game end too. But if you stay with her at the end, she will tell you that you would die soon. After the their last 'time' she leave. Aoi went find her and met some accidents, but he not dead yet. Untils Sora stab him at his own house. She said the only way to continue their happy at some gate . . . I almost cry at at that end. =w= But in another way, this game have a really nice soundtrack, and when i play them at my coffe shop, My customer really like it a lot. and it have some really nice animation, but still, why the development do the censored ;;v;; (┛◉Д◉)┛彡┻━┻ even at her pant. And it's really short, and don't have enough content with it's prize (Even when i got it from a bundle that i bought for my customer and got it for free &lt;3 :v or really like it) for who bought this game through steam.",
            "review_score": "1"
        },
        {
            "review_text": "I don't want to be a hater but this game isn't worth the price it's sold for, I've read many FTP VN and they had an even better quality than this, i'm not saying that every FTP should be as bad, it's just that I would rather donate to other FTP who are more serious about their job. The story and the exploration of all the routes are fast to browse. Disappointing in the end.  Pros: (TBH took me a while to find one) Cute Female Character (even when yandere)  Cons:  Obnoxius male protagonist Short... reeeeeeeally short. Straight foward story The quality doesn't match the price Boobs? Nope, it's censured xd betta stop here ^^   2/10 - Two because you gotta admit Sora is cute.",
            "review_score": "-1"
        },
        {
            "review_text": "Quite short , but got it from a bundle so the price doesnt matter to me It look like some anime movie when a girl felt from the sky then u pick her up, live with her and become her boy friend. Have some decision u can make but i think it not really affect to the ending. Not really hate the game, but it not good too, i still rate up because i like art type!",
            "review_score": "1"
        },
        {
            "review_text": "What in the living ♥♥♥.   This guy can sex for ♥♥♥♥ing years even while dead.   I'm also times for my choices? Jesus I didn't know the world would end if I couldn't decide whether to look at ♥♥♥ or not. This game has more endings than a galaxy that just suffered a hypernova.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Annoying beta MC. But the Sora girl is cute.",
            "review_score": "1"
        },
        {
            "review_text": "This trust proves Girls can be money snatching ♥♥♥♥♥es ",
            "review_score": "-1"
        },
        {
            "review_text": "Disclaimer: I idled in this game for the cards, actual playtime was one hour for me (incl. getting the different endings) It's an acceptable VN without much interaction, the characters seem caricatured to me. You play the role of an otaku who doesn't leave the house and then a random girl falls from the sky. Don't expect a very deep story, but I bet that you're not here for that anyways. I got it in a bundle, if you want to buy it on sale, but expect nothing innovative or a game you will shed tears over. A pretty decent game and I have to give it credit for Linux support. Buy on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Yo so straight up you're not gonna get a Welcome to the NHK level intense narrative or cliche breaking bonanza from this game. And that's aight. it's a standard male romance fanatsy at a cheap price in which you intially scorn your musume b/c plot until you inevitably bed her. If you've been drinking too much of Hiyao Miyazaki's kool aid and can't handle dem overused tropes then this ain't for you. But this game genuninely struck a cord in my colesterol filled arteries. The romance felt sweet and enjoyable. Sometimes ya need to take a step back from the cynicism and just enjoy the simpler daikimakuras of life. For what it's worth it's a good deal with an ending that was kinda suprising. This game is like a good snack. You're gonna enjoy it, it's quick to finish, but you aint gonna write home to momma bout it. But hey thats alright. If you got some spare cash and wanna nice, quick little romance whynaut neglect dem starving children in africa and pick this up? You might feel just a tiny fraction embiggened emotionally as a result",
            "review_score": "1"
        },
        {
            "review_text": "Got the girl arrested. Moved on with my life.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game",
            "review_score": "1"
        },
        {
            "review_text": "Lost Pause, i hope you'll play this !",
            "review_score": "1"
        },
        {
            "review_text": "It's a fun little VN with short semi-coherent story. There's only two main characters (including the protagonist), and one side character that appears in a couple of scenes. Best part of the game are fun little gag scenes throughout the story line.  On the H-side, there's an uncesored patch that really only shows in a couple of scenes (there are boobs now), and that's that. There's no love scenes besides of the short 'and then we did it' kind.  Still, it flows fast and doesn't bore the reader from start to finish.",
            "review_score": "1"
        },
        {
            "review_text": "It was a pleasant VN, decent graphics and sound. Interesting story and ending.",
            "review_score": "1"
        },
        {
            "review_text": "The story line is too simple, there are not much people appeared, even this is a visual novel. Thus I skip the story at some point during playing this game. I'v only satisfied for the achievement which can be obtained when you start the game directly and since there are only one achiemenent, it makes achieve the game 100% very easily. From this reason, I may recommend you to get achievement, trading cards but not the story.",
            "review_score": "1"
        },
        {
            "review_text": "storys coll and all text and dialogue a bit cringy form time to time but overall i liked it    allthough if anyone could mybe help me on this: what happens the first time you go with your old school crush? i mean the game just ends on an ominous note no explanation just you recognise the cafe and you cant 'save' yourself or her  ...wtf?  that left me a bit dumbfounded .... but the 'good?' ending or complete ending is a nice mind♥♥♥♥ to the whole story",
            "review_score": "1"
        }
    ]
}