{
    "app_id": 428190,
    "name": "MadOut Open City",
    "release_date": "2016-03-29",
    "developer": [
        "MadOut Games"
    ],
    "publisher": [
        "MadOut Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Shared/Split Screen",
        "Full controller support"
    ],
    "genres": [
        "Action",
        "Indie",
        "Racing",
        "Simulation",
        "Sports"
    ],
    "tags": [
        "Racing",
        "Action",
        "Open World"
    ],
    "achievements": 0,
    "positive_ratings": 102,
    "negative_ratings": 153,
    "price": 5.59,
    "description": "Madout Open City is a combat race in open city. Destroy opponents. Feel the dynamic chases and fighting battles. Enjoy the good physics of cars.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/428190/header.jpg?t=1488717619",
    "minimum_requirements": "OS: Windows XP, Vista, 7, 8, 10 Processor: Intel® Pentium Dual Core 1.5GHz or equivalent Memory: 1 MB RAM Graphics: NVIDIA GeForce 8800 GT or equivalent DirectX: Version 9.0 Storage: 800 MB available space Additional Notes: OpenGL version 1.2",
    "recommended_requirements": "OS: Windows XP, Vista, 7, 8, 10 Processor: Intel® Core 2 Duo 2.5GHz or equivalent Graphics: NVIDIA GeForce GTX 470 or equivalent DirectX: Version 11 Storage: 800 MB available space Additional Notes: OpenGL version 3.3",
    "reviews": [
        {
            "review_text": "Started the game , Got killed by a flying car   ♥♥♥♥ physics 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This Game Is broken The split Screen IS not working   hope You Fix it :D",
            "review_score": "1"
        },
        {
            "review_text": "This game is trash, please don't get it. Worst game I've ever played",
            "review_score": "-1"
        },
        {
            "review_text": "One of the worst games i have ever bought utterly dreadful runs poor and not that much fun runs worse than just cause 3.",
            "review_score": "-1"
        },
        {
            "review_text": "It isn't finished I think it would be better if the world was bigger, didn't have to pay to reset my car, be able to upgrade my car, go into buildings, and multiplayer. The grafics are ok. With more updating it could be better but for now don't spent your money on it until later updates. Oh and for all those people who think the physics are bad (they are), i'm pretty sure they are supposed to be bad and weird.",
            "review_score": "-1"
        },
        {
            "review_text": "ITS HORRIBLE I WANT MY MONEY BACK SO BAD",
            "review_score": "-1"
        }
    ]
}