{
    "app_id": 428220,
    "name": "TurnOn",
    "release_date": "2016-06-01",
    "developer": [
        "Brainy Studio LLC"
    ],
    "publisher": [
        "Brainy Studio LLC"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Captions available",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Casual"
    ],
    "achievements": 82,
    "positive_ratings": 272,
    "negative_ratings": 55,
    "price": 10.99,
    "description": "&quot;TurnOn&quot; tells the spellbinding tale of a brave alien creature and its striking journey through blackout world, in an incredibly colorful and detailed platformer without platforms.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/428220/header.jpg?t=1477500774",
    "minimum_requirements": "OS: Windows 7 or newer Processor: Intel Core 2 Duo E4500 @ 2.2GHz or AMD Athlon 64 X2 5600+ @ 2.8 GHz Memory: 4 GB RAM Graphics: GeForce 240 GT or Radeon HD 6570  DirectX: Version 9.0c Storage: 4 GB available space Additional Notes: Xbox 360 gamepad are supported",
    "recommended_requirements": "OS: Windows 7 or newer Processor: Intel Core 2 Quad Q9550 @ 2.8 GHz or AMD Phenom II X4 955 @ 3.2 GHz Memory: 4 GB RAM Graphics: GeForce GTX 650 Ti or Radeon HD 7790  DirectX: Version 9.0c Storage: 4 GB available space Additional Notes: Xbox 360 gamepad are supported",
    "reviews": [
        {
            "review_text": "TurnOn is a side-scrolling platformer game where you get a chance take control of one alien, who is a little electric ball.  The story is simple, the town fall to the dark, nowhere is an electric, your goal goes to the town and back a light back! The whole story telling completed without any words, just with visual effects, is unusual but looks good.  The game levels contain two type of games, one is a “runner”, where a little creature moving alone, your goal don’t fall down and collect a little electric. Second game type is a “platformer”, there your main goal is moving at lines and bring an electric in all thing what need it. At some places game need some thinking from you, but mostly here need only your skills. If you fall down, you will start a current level from last checkpoint, but all what you collected till this time stay at you. Also at some levels you will find something like “boss” fights.  The game graphic world completed nice, every is well animated, colorful.  The game soundtracks is beautiful and relaxing.   So my verdict   +nice graphic +challenging +nice story telling +great music +steam achievements and trading cards +many supported languages   -the “runner” levels sometimes a bit frustrating   If you like this kind of games or screech something relaxing, this game is for you. This game have a great music, nice graphics and storytelling. This game is for all ages but a child’s especially should like it.",
            "review_score": "1"
        },
        {
            "review_text": "  🌟  KDB  Review  | English |  By far the most beautiful and enjoyable platform game I ever played in years.   Gameplay",
            "review_score": "1"
        },
        {
            "review_text": "  This game has some 'obviously not made for PC' issues, like the 'Press A to Continue' on menus, and an extremely mobile-friendly feel, but if you're someone who likes hyper casual relaxing games then this will be perfect. Otherwise, like me, you'll get pretty bored since you can play the entire game with one hand and there isn't much in the way of difficulty to speak of, but the environments and artstyle are well done and it's fun to look at. It's also generous with the achievements if you're into that sort of thing.",
            "review_score": "1"
        },
        {
            "review_text": "Overall, I enjoyed this game a lot. The music was really nice (I hope they'll put out a soundtrack for purchase) and the concept was fun. Some jumps did not work quite like I expected them to, and your character's sprite can be very obviously 2D at times but I enjoyed the look and feel of the game. The exploration levels were definitely my favorites, though since I played the first 2/3 of the game three months ago I can't pick the best one.  The forced scrolling levels are frustrating as there seems to be one checkpoint in those at best, far into the level, and if you die due to too many hits (instead of just falling off the course) you go all the way back to the start instead of the checkpoint. I always seemed to die just when the music was really kicking in... Also, the second-to-last level is really luck-based to finish. Hop around like mad and hope!  I played on a 360 controller and that worked well, not sure how their other schemes work out. If you aren't sure about the two gameplay styles (and the forced scrolling sections seem more frequent the further you get in the game) watch the second video (the one in the middle), it shows both kind of levels and gives a good idea of how it feels.  $15 may be a bit high, but I caught it on sale. Also, there are occasional bugs (I hit one on the Ferris Wheel level) where a level just won't complete. Luckily (?) restarting the level worked out. I still think it was a fun game, but you should know that it's not perfect.",
            "review_score": "1"
        },
        {
            "review_text": "  Turn On is a unique, fun platformer. The music is great and the game isn't very hard but some stages can be difficult to 100%.",
            "review_score": "1"
        },
        {
            "review_text": "The game and the Storyline with some puzzles is aswesome! Nice jump and Run with awesome Soundtrack!",
            "review_score": "1"
        },
        {
            "review_text": "I really want to like this game. The exploring is really fun. But during the timed levels there just are not enough save points. I'm not good at precision platforming. I've been on this level for about an hour, and I can't take it any more. I want more save points and the ability to get more lives.",
            "review_score": "-1"
        }
    ]
}