{
    "app_id": 428540,
    "name": "Fragments of Him",
    "release_date": "2016-05-03",
    "developer": [
        "Sassybot"
    ],
    "publisher": [
        "Sassybot"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Casual",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Casual",
        "Visual Novel"
    ],
    "achievements": 0,
    "positive_ratings": 62,
    "negative_ratings": 16,
    "price": 6.99,
    "description": "An emotional and immersive game about a man named Will and the people close to him. Experience his life through a story about love, memories and hope.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/428540/header.jpg?t=1478658741",
    "minimum_requirements": "OS: Windows 7 Processor: Intel Core i3 2.10 GHz or AMD equivalent Memory: 6 GB RAM Graphics: NVIDIA GeForce 560 or better DirectX: Version 11 Storage: 12 GB available space Sound Card: Definitely!",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I want to thank the developer for giving me a key to experience this story and game and to share it on my channel.  I played this game for a livestream on my Youtube channel. If you understand watching my play will be a HUGE SPOILER for you, you can search it up under my same name on Youtube, Zaxtor99. It came in at just about 2.5 hours with my playthough of it and I added plenty of commentary and what I thought as the story developed.  There isn't a lot of other games exactly like this one, and I did enjoy it as it really did a good job of developing the main characters and showing different points of view. The voice acting is really well done, the graphics are nice, and the music masterfully fits the moods in the story of the game.  I can certainly see how this game could break any person who has dealt with the loss of loved ones into a mess grasping for endless tissues. While it doesn't spend a ton of time with ech character, the time it does spend is masterfully done and makes you empathize with them all.  Pricewise, I feel that this game is somewhat overpriced, especially comparing it to other games like Life Is Strang which gives the player a story about five times the length and many, many more choices over five episodes for the same price. However, it is still certainly less expensive then taking the family to the movies, and it tells a somewhat predictable but never-the-less well crafted story.  I recommend it to anyone who enjoys a casual paced visual story where you don't make many choices but rather get to experience a good story about true love, sacrifice, and loss of those we love the most.   Two thumbs up to the game... but a little disappointment in a game that I honestly believe 'should' be about half the current price of $19.99 USD.. ($10-$12 would be a much more fair price tag IMO) In the end however, it's the story that this game tells that is where the value is, and to many, I'm sure the price tag is a small price to pay for the emotions it will stir.   I want to say 'thanks' again to the developers for offering me the key and allowing me to experience this well done visual novel.",
            "review_score": "1"
        },
        {
            "review_text": "  I really enjoy good 'walking simulators' and Fragments of Him delivers. Don't expect much 'gameplay', it's a interactive story, not a action game. Think of it as of movie. A movie in which You are a part of, but only as a ghost following the characters. The storyline is very solid, but starts a little slow. Nevertheless, the issues are important - love, family, life, meaning, coping with loss. It resonates with everyone and gets really touching, especially in the end. You definitly can shed a few tears.   My one problem with Fragments of Him is... it's nothing new to the genre. Also - the story is 100% linear, you won't feel a need to play it again. It takes You around 2h to finish the whole game, so maybe wait on sale if you're not really sure about it.   It's a perfect game for a rainy sunday, when You just have 2h to spare. A cup of coffea. You can play it with one finger, resting on laptops touchpad. And you won't regret that 2 hours, but it's also nothing that will shake your world.  I would call it a 7/10.    Disclaimer: Fragments of Him is a story cointaing homosexual elements - I'm aware that some people can't relate to it or find it not amusing. Take note of it, main protagonist can be acknowledged as a bisexual male. If it's not ok with You - don't say no one warned You :)  ",
            "review_score": "1"
        },
        {
            "review_text": "  Pros: Great story! Nice art style Good controls Good voice acting  Cons: Barely has gameplay No replay value  -Now even though it may have very little gameplay for what it is it does have a great story and for that reason alone i recommend it but you may want to wait for a price drop.  Quick look!:         YouTube™ Video:  Quick look! - Fragments of Him [1080p/60fps]&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "A captivating experience, a pleasure to look at and a story well told. Something games can be but haven't really been yet.   Your non-gamer girlfriend might appreciate it. Even your mom might.",
            "review_score": "1"
        },
        {
            "review_text": "This game hit me right in the feels. Absolutely worth every penny. The graphics are wonderful, the characters are well-rounded, and the storyline will make you cry in happiness, desperation, and heart break. 10/10 would cry again.",
            "review_score": "1"
        },
        {
            "review_text": "Click on the turkey to recieve your next piece of dialogue, please.  Now click on the chair. No, not that chair, the other one. We'll get to that chair soon enough.  A hidden object narrative dispenser, where the hidden objects glow until you click on them. Then more words are said.   It could have been a moving experience, but the repetitive, pointless interaction makes the player a mere spectator to the characters' story.",
            "review_score": "-1"
        }
    ]
}