{
    "app_id": 429060,
    "name": "Zombie Wars: Invasion",
    "release_date": "2016-01-14",
    "developer": [
        "DNZY Games"
    ],
    "publisher": [
        "DNZY Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Casual",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Indie",
        "Casual"
    ],
    "achievements": 13,
    "positive_ratings": 47,
    "negative_ratings": 39,
    "price": 1.99,
    "description": "If you like tower defense games , this game is for you ! A game is classic addictive tower defense / defense TD, style game and a lot of features. You can build towers, you can use abilities(bombs and soldiers) and you can use hero !",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/429060/header.jpg?t=1452765722",
    "minimum_requirements": "OS: Windows XP Service Pack 3 Processor: Dual Core CPU Memory: 1 GB RAM Graphics: OpenGL 3.0 compliant with 512MB of video RAM. Storage: 210 MB available space",
    "recommended_requirements": "OS: Windows XP Service Pack 3 Processor: Dual Core CPU Memory: 2 GB RAM Graphics: OpenGL 3.0 compliant with 1.0GB of video RAM. Storage: 210 MB available space",
    "reviews": [
        {
            "review_text": "A tower defence game made by Dnzy Games who are still working on their website at the moment. They have made two games thus far and this seems to be their first to pc.  I’m not much a tower defence gamer as this is the second one I’ve ever played, the first being '300 dwarves', but there was much more on offer here than that one.  The objective is simple, your job is to stop a number of cartoon zombie waves from making their way to the exit point by strategically placing various defence towers around the grid and upgrade them as necessary. Certain towers are powerful against certain zombies and on the flip side some zombies are quite invincible against certain towers. While some are easy to work out, some levels are quite hard and will take some trial and error to work out a strategy.  For instance Cannon towers are powerful against flying zombies, but useless against everything else. Electric towers are great against poisonous spiders. Freezing towers slows everything coming through and doubling that tower with a flame tower can really chew through the health points of your enemies. Sniper towers are great against mummy waves etc.  There are 20 levels all up, with two difficulty levels normal/hard, both requiring you to get through them. The first 5 levels can be blitzed with a simple 2 tower combo, but from level 6 onwards things start to get much harder requiring a whole assortment of defence. The hard difficulty while it contains exactly the same amount of waves as the normal, it changes by giving you less money to work with and on some levels it tries to ban you from using some towers at all, usually the towers you need the most.  The assortment of enemies start from your normal zombies, flying zombies, poisonous spiders that kill soldiers quickly, mummies with a tank of health, some zombies that regenerate health, some zombies that explode into smaller versions of itself, zombies that can heal other zombies, zombies that seem to have super speed and just rush past everything and one or two more types as well.  A lot of the time your tower defences will not be enough against the onslaught, so the developers have given a few more things at your disposal to help you. You have a transportable soldier with limited health, a small collection of landmines which can placed as a booby trap and a small bomb which can be dropped from the air and helps take out a small amount of enemies. All these tools replenish on a timer. You also have three more weapons, but these cost money and do not replenish once used. Dynamite, a freeze bomb, and a satellite laser. The most helpful is the dynamite and I would often spam the last level for money so that I could buy heaps of dynamite, this way I could go for a three star rating on each level.  There are a few complaints by other gamers regarding its difficulty especially in regards to levels that have a large amount of mummies in them as they are very difficult to attend to due to their outrageous amount of hp. However there seems to be a few bugs with this game which I was able to use to my advantage and I’ll share them with you now.  1) Before actually starting a level, since the landmines replenish on a timer, you can actually lay a whole map full of landmines before you even begin. 2) As stated before some levels dictate certain towers can’t be used. There is a way around this. Spend your money that you’re allocated at the start so that your bank is lower than the price of the tower you really want. For instance a Fire tower is 120 gold coins, so you want to make sure your bank is under that. Then click on any vacant spot and click on the fire tower option. As your other towers begin to make money by killing zombies eventually you will have 120 gold coins and because you already have that option ticked with your mouse icon it will now allow you to put that tower on the spot chosen even in a level that dictates you can’t have that tower. If you want two of those towers just repeat the above trick. 3) Spam the last level on the normal difficulty, you will get 480 gold coins. Buy dynamite!  There is little to no story with this game other than you simply have to stop the waves from getting through and there is no proper ending to this game either. There are quite a few achievements but they all seem pretty lack lustre and I would much preferred if the achievements got a gamer to try various things. For example... 'Win a level with only 1 tower' 'Win the first 5 levels with only 2 towers' 'Use sniper towers only on a level' 'Have 1,000 gold coins at the end of a level'  But alas the only achievements are get level 5 on this tower, get three stars on all levels, complete all levels etc. which let’s face it most people are going to do all those things anyway. Still if you’re after something different and you like tower defence games, I can actually highly recommend this one, it should at least keep you entertained for quite a few hours.   ",
            "review_score": "1"
        },
        {
            "review_text": "What an amazingly simple game that generate a ton of entertainment. I spent like 15 hours playing this game and I would do it again, and probably will. The game has a simple concept. Don't let the zombies hit your base and kill you. As the game progresses the zombies get progressively harder. Some of them are suceptible to different type of attacks while also being resistant to various other attacks. Very cool concept and very replayable. The ONLY thing I dislike with this game and it's not only with this game, it's with most indie games released these days, is that it has a 3-Star scoring system after every level. Other than that it's a perfect gem. I would definitely recommend this game to anyone willing to spend a couple bucks for a great time!",
            "review_score": "1"
        }
    ]
}