{
    "app_id": 42920,
    "name": "The Kings' Crusade",
    "release_date": "2010-10-08",
    "developer": [
        "NeoCoreGames"
    ],
    "publisher": [
        "Paradox Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Medieval"
    ],
    "achievements": 0,
    "positive_ratings": 41,
    "negative_ratings": 72,
    "price": 7.99,
    "description": "The crowned heads of Europe launch a military campaign to conquer the Holy Land. The time has come to assemble your armies and take back the land!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/42920/header.jpg?t=1447353607",
    "minimum_requirements": "OS: Windows XP SP2/Vista/Windows 7Processor: AMD64 3500+ or Pentium IV 3.2 GhzMemory: 1 GB RAM (XP)/ 1.5 GB RAM (Vista/7)Hard Disk Space: 8 GBVideo Card: Nvidia 6600 (256Mb) / ATI Radeon X700 (256Mb)Sound: DirectX 9-compliant sound cardDirect&reg;: 9.0c or higherAdditional: Nvidia (AGEIA) PhysXMultiplayer: Steamworks system",
    "recommended_requirements": "OS: Windows XP SP2/Vista/Windows 7Processor: AMD X2 5000+ or Intel Core2 Duo 6420Memory: 1.5GB RAMHard Disk Space: 8 GBVideo Card: Nvidia 8800 GT (512Mb) AMD/ATI HD3870 (512Mb)Sound: DirectX 9-compliant sound cardDirect&reg;: 9.0c or higherAdditional: Nvidia (AGEIA) PhysXMultiplayer: Steamworks system",
    "reviews": [
        {
            "review_text": "If you enjoyed King Arthur (also a Paradox Game) then you will want to own and play King's Crusade. It's essentially the same game mechanics with a few new improvements. The same depth of detail is present as with King Arthur, the graphics are beautiful, the sound and music is top-notch and the history virtually drips off the screen. The King's Crusade is a must buy for fans of King Arthur, and I highly recommend it to all strategy fans.",
            "review_score": "1"
        },
        {
            "review_text": "This really is a great game, but like most of the complaints, I get a runtime error after the first game.",
            "review_score": "-1"
        },
        {
            "review_text": "Horrible game with lots of bugs DONT EVEN THINK OF BUYING IT !!!!! I REPEAT DONT BUY IT!!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "You can learn from this game about history so that's why I recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Not good, one of the main reasons I made a Steam account and I'm dissapointed, it seems like every steam game I own on disc stinks.",
            "review_score": "-1"
        },
        {
            "review_text": "OK IF YOU LIKE THEASE TYPE OF GAMES,GOOD.",
            "review_score": "1"
        },
        {
            "review_text": "ENGLISH&amp;TURKISH REVIEW (Turkish review is in the comments)  Great concept, multiple regional units for both sides, strong medieval atmosphere. Makes you feel like Saladin or a crusader if you are on the wrong side of things... But it does not really matter, because you can not get past first battle of either scenario. It just crashes. This game crashes more than the Bandicoot himself...  All jokes aside, this game and Paradox in general is the real JOKE! Why? All they seem to care about is the DLC'n now. Where is that great Paradox these days? Yeah games are still solid but not fixing a well-known bug that makes playing the game impossible, is unacceptible. I am still a devoted fan of Paradox games and i buy every one of then (on sale though but does it really matter?). But this one really pisses me of, because as much as it seems like a bad imitation of Medieval Total War, it does have a unique character as a game. For a hardcore paradox and strategy fan, this game could have been a no-brainer.  I am very dissappointed that i have to downgrade this great concept and not have fun out of it. If they somehow decide to solve this problem, i'd be glad to buy this back and liberate the holy lands!",
            "review_score": "-1"
        }
    ]
}