{
    "app_id": 429300,
    "name": "Sepia Tears",
    "release_date": "2016-01-08",
    "developer": [
        "Scarlet String Studios"
    ],
    "publisher": [
        "Scarlet String Studios"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements"
    ],
    "genres": [
        "Casual",
        "Free to Play",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Free to Play",
        "Visual Novel",
        "Anime"
    ],
    "achievements": 11,
    "positive_ratings": 713,
    "negative_ratings": 85,
    "price": 0.0,
    "description": "A visual novel about a memory that a boy named Mark tries very hard to forget, and a girl named Myra who unearths it.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/429300/header.jpg?t=1544233981",
    "minimum_requirements": "OS: Windows XP Processor: 1.2 GHz Pentium 4 Memory: 1 GB RAM Graphics: 800 x 600 DirectX: Version 10 Storage: 500 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "A lovely story with an interesting twist (won’t be saying more so as not to spoil it ~_^ ). I fully recommend it to everyone who likes VNs, especially since this gem is free.",
            "review_score": "1"
        },
        {
            "review_text": "Don't let the little amount of hours confuse i've beaten this game when it was first up on desura and played it a bit of its phone port (or maybe thats where it came from the start idk)  this has to my favourite visual novels and i hope bringing it to steam has given the devs some kind of motavation (cause they went very unactive on desure with some of them haven't come online for almost a year since that game was released on the 24th of december 2013.  i like the fact that this game has gotten steam achivements which gives me more insentive to delete all of my saves and restart the game, trading cards would also be nice i'd love to see what kind of emotes and backround i could get (along with braging that this is the best game ever) but i'll hold my breath as to not be disapponted.  i'm very supirsed that this game didn't cost money, even though this game is free on desure and the google play store (not sure about IOS) this game has the quality to have a price 1.99$,5.99$,10.99$ or whatever other price it has.  One more thing that kind of throws me off is that on desure the game was devloped and published by Team Neet and on steam its devolped and published by Scarlet String Studios this could be the devs changing there names or someone else just throwing the game up on steam(which is a low thing to do)  But to end this review off on a high note of your a fan of visual novels and you'd like to play a game thats not just a panty shot fest like the sakura games and you want a deep compeling story i would pick this game up.",
            "review_score": "1"
        },
        {
            "review_text": "First of all, this game is free, so the question is whether the time spent is worth it. To fully explore the content took me about 2.5 hours, and that was definitely worth it for me.  + Attractive art - While the artwork is not the highest quality, it does its job well + Solid story - I found myself sympathizing with the characters and fairly invested in figuring out what was going on + Good writing (mostly) - The stream of consciousness was easy to follow and conversations flowed naturally (or didn't flow naturally as the story required!) + Pleasant music + Easy achievements (if you are into that)  - Redundancy - Some conversations are repetitive and I found myself starting to just skim a bit in some sections. - Ending - While I personally enjoyed the ending, some might find the endings unsatisfactory for a VN. I don't really want to say more for spoiler purposes.  Overall I enjoyed my time with Sepia Tears. The more you enjoy VNs and anime the more you'll like this game.",
            "review_score": "1"
        },
        {
            "review_text": "i got into visual novels/kinetic novels a few months ago and this was one of the many games which completely shattered my heart and soul. i love this genre. these kind of games are life changing.   yup. this game should be played. definitely. &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Decent story, yet it gets boring at some point... Background music is very basic.. Easy achivements .. You need to make a save at   DAY 6    Before going to the Park with Lillian... So you can get both achievements (CONFESS / DON'T CONFESS) without the need of going for another gameplay.  7/10",
            "review_score": "1"
        },
        {
            "review_text": "The story is absolutely beautiful and the music fits every moment I highly recommend playing this. Days 1 6 and 7 are honestly the most memorable and touching. As many have said before prepare to ride the feels train",
            "review_score": "1"
        },
        {
            "review_text": "  A very underrated game that has certainly broadened my view on love and life.  I thoroughly enjoyed my playthrough and would recommend everyone to try this.  Stop hesistating and install this free game right now!",
            "review_score": "1"
        },
        {
            "review_text": "Playing this VN made me feel what the protagonist was feeling: The joy of love, the pain of rejection and the fear of experiencing it all over again.   Enough of my nonexistant lovelife, time for my review  I'll get to the point, this VN is lovely. Story-wise I love it, it could have been longer though. But nonetheless it was really good. It was so good that I was able to feel and somehow relive the events of the game based on some points of my life. The art was nice for me, although at some points it seemed off. The music was lovely, it really helped in setting the mood of the game. The characters were great, for some reason I could relate to their emotions and struggles, the pain they felt deep inside. I really felt as if I was them at some point.  All in all, I really enjoyed this VN.  You should pick it up too *it's free!* And if you do pick it up, may I suggest that you buckle up since you will be on the feel's trip",
            "review_score": "1"
        },
        {
            "review_text": "  I as really suprised, didn't expect all the development. Touchy in all the little aspects and'll surely transmit you a lot of warmth.  Well written, I really enjoyed.",
            "review_score": "1"
        },
        {
            "review_text": "Sepia tears is just an awesome VN it might lack some logic lack some deep revealing points might be hard to keep up with the flow of thoughts and the alternate between jokes and serious drama talks yet you can barely keep up with it and that’s too great point in it .... it just lets you feel challenging ...... and it takes some damn believe in what u chose and .... it just has romance logic with some real touching words and sentences ..... just awesome for me even if it lacks the voice actors, the BGMs at some points are great ... that's all … now to some serious review: One has to put in mind that this is a FREE VN which means you never compare it with some masterpieces that are about 40 or 70 dollars. Character designs are good to some point they do have some small details yet they still feel like kind of old, the backgrounds in the game are some pictures that were made to look like cartoon or anime like still there are some good looking ones in them too. Let’s talk about the story …. It might feel boring at some points but they will be fast you will never feel like oh god I’m out of this, there are some truly great words and whole sentences filled with some logic or like a good talk about what almost every teenager felt in is life or in some relationship he went through or thought of going throw it. Now to something really made me write this review … it’s the that this VN makes you feel about choosing what to do it tells you that if you truly know what happened and did search for the clues in the characters’ speeches AND most importantly that you do believe in those things … they are the pride of a VN reader the things that should always have trust in … I’m touched by this thing …… REMEMBER IT’S A FREE VN NOT A PAID ONE.  ONE last thing .... don't mind looking at the achivements they don't spoil the game but you don't have to hunt them before you finish the VN ~_^ ",
            "review_score": "1"
        },
        {
            "review_text": "No revelations in dramaturgy are waiting for you here, but the game still has as much time of gameplay as any in the Call of Duty series, and touches you no less in an emotional way. The comparison might seem odd, but isn't there a point in it?  Art and music, that seem a bit too simple and plain at the beginning of the game, by the time you beat it cling to your heart, and you find them nice.  Overall, the game, while quite simple, is definitely worth your time.",
            "review_score": "1"
        },
        {
            "review_text": "dunno what to say, i just loved it. and everyone may loved it too.  well, a girl jump out from school's rooftop. how's come?.",
            "review_score": "1"
        },
        {
            "review_text": "if you want it to end good, remember: always stand up, never fall  good visual novel 8/10",
            "review_score": "1"
        },
        {
            "review_text": "About 5 minutes in the game, and there's a Code Geass reference and a Fate/Stay Night reference. 8/8 IGN M8.",
            "review_score": "1"
        },
        {
            "review_text": "This game is very good! I completed within a decent amount of time.  I enjoyed the characters, it made me go from laughs to almost choking up on tears! A very deep and sometimes emotional game at parts (that is if you are a kind of in-tune with emotions kind of person)   I really think this was a fantastic story. It also had me feeling like the main character was at some parts too. Shakey hands, to laughing. I'd give this game a good 10/10 there wasnt a single thing about the game that I didn't enjoy or like, and it gave me a good time while playing throughout it. Great game to those who helped create/develop it! Wonderful!",
            "review_score": "1"
        },
        {
            "review_text": "Sepia Tears is a absolutely great Visual Novel, with plenty of heart melting sweet moments aswell as emotionally hard hitting ones.  Very hard to not recommend this VN especially when it is free.  Seriously, just play it.",
            "review_score": "1"
        },
        {
            "review_text": "5 easy achievments and a wonderful story,just go and get it!",
            "review_score": "1"
        },
        {
            "review_text": "Good story",
            "review_score": "1"
        },
        {
            "review_text": "Sepia Tears is a F2P Visual Novel which has a rather romantic plot structure to it. The story is perhaps one of the best I have seen in while, at most times remaining cryptic and mysterious until the final part of the game came around. Now not giving much away about the ending but I personally found it very satisfying and the build up really made you emotionally invested in the protagonist so it made the ending that much more impacful. The game takes around 4-5 hours to complete depending on how fast you read and what choices you make. Now I have only played through this once and got the good ending, but I am assuming there are some other (worse?) ones (When I play a VN that is heavy in the feels, I tend not to even look up nor play the bad endings). Overall this game has a solid story, a solid soundtrack, and solid artwork, A must play for any visual novel fan, and hey its free (which is actually rather suprising for a game this refined).  Verdict: 7.5/10  Now please excuse me as I take heat from all the people on my friends list calling me a weaboo for playing anything that remotely contains anime.",
            "review_score": "1"
        },
        {
            "review_text": "Sepia Tears is a Slice of life/romance visual novel by Scarlet String Studios This visual novel have choices which the player could make and depending on your choices it will change the outcome of the story.  Note - This is not a positive review it is a neutral review but the positives outweighs the negative hence a positive review.  - Many reference to anime, visual novels can be found in there for example Rin from Fate franchise, 撲殺天使ドクロちゃん [Bokusatsu Tenshi Dokuro-chan], doramon found in lukas room, G-senjou no Maou, Pokemon [fainting cry], higurashi when they cry and Umineko. I am sure there are more but I provably have missed a few of them out   The story",
            "review_score": "1"
        },
        {
            "review_text": "I didn't realize that this was a story mode type of game so I didn't personally enjoy it. I only played for a half hour and it was all story. I'msure others who are looking for something like this would enjoy it, however I myself did not.",
            "review_score": "-1"
        },
        {
            "review_text": " Mixed feelings...",
            "review_score": "-1"
        },
        {
            "review_text": "100% achievements in 6 minutes. Thanks.",
            "review_score": "1"
        },
        {
            "review_text": "This game took way too long to grind the achievements",
            "review_score": "-1"
        },
        {
            "review_text": "Crap anime game for little girls. Can't believe grown adult males are playing this and like this weeaboo crap.  This is why real males are a dying breed and soon we'll live in a world full of feminazi and man-childs who watch ponies and read cutsie VN.. God what the hell.  This kind of games are a cancer for steam.  Finished it for the easy achievements.",
            "review_score": "-1"
        },
        {
            "review_text": "Too much....",
            "review_score": "-1"
        },
        {
            "review_text": "I'm not crying.........they're nervous sweats, not tears",
            "review_score": "1"
        },
        {
            "review_text": "More like Spacebar Tears.",
            "review_score": "1"
        },
        {
            "review_text": "i love this VN so much, since we all know this game was free xD. Btw this VN the one of most favorite game to play",
            "review_score": "1"
        },
        {
            "review_text": "Nc VN GGWP to the developer from me Draw Style 8.5/10 Story 10/10 Backsound/music 8/10 (( The quality of the record i think it's creepy ya know )) Well Not every vn Nc when the art are good , well good art Bad story it's more like a tea without Sugars you know looks tasty but when u drink it it's like @#$%^ you know hehe well something make me love this vn is... IT'S ♥♥♥♥ING FREEE LOOOOL ",
            "review_score": "1"
        },
        {
            "review_text": "The twist is real, definitely recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Yeah, the story is long... Like... Very long ! (some people, for reading everything, spent 9 hours) BUT, well, you will feal the moments that are importants, and the ones which are not, easily. And if you do that, well, in 2,5 hours you will be good (for all achievements, that are so easy, just have to save, and not even necessary because the skip option after finishing this game is terribly efficient).  To sum up, I like this game. The 2 endings, the 'windows' Myra, the meeting between Myra and Rin, the diary, and Lilian. Well, really, I like this game. And for free, why don't give it a try ?",
            "review_score": "1"
        },
        {
            "review_text": "Look, i'm not a professional when it comes to rating games, but this game, man... It's like a emotional bomb, i cried, i smiled, i felt sad, i felt happy, all the emotions you could imagine... If i had to rate this game, i'd rate it 10/1 straight, all the characters, the mood, it's all on point, i would totally play this game 100 times more.",
            "review_score": "1"
        },
        {
            "review_text": "As far as free visual novels go, this was actually some quality stuff. I mean clichés aside (you being a regular dude, weird girl showing up, the works) the twist in the end and the way the story was told at times really made it worth it.   I'd play it if you a passing interest in the genre at all.",
            "review_score": "1"
        },
        {
            "review_text": "I read this story on Android during some flights. It doesn't take long to blast through and I found it entertaining. Some characters will come off as cliche but there is almost always a chilling twist that makes them more fleshed out. The jokes are over the top and quite a few will come out of nowhere. The art is charming and colorful, if simple, and the soundtrack fits the scenes. Key moments boast with much appreciated details.  Slight SPOILERS about the genre and subject matter at hand: This VN is a dash of psychological horror, dealing with how assumptions may seem safe but not necessarily be in line with our world, and most terrifying of all,    rejection   . The characters reach catharsis by    facing their fears and embracing to be honest and sticking to being honest.     The VN's spirit is a bit on the naive side, but it's something you'll want to forgive it with a hug.  Give it a shot!",
            "review_score": "1"
        },
        {
            "review_text": "Pros:  - Beautiful artwork  - Feels  - Great story  - Relatable characters  - Free to play - Great soundtrack  - You can skip diolgues quickly to see what happens when you pick another option (something most visual novels lack)  - Very cute game   Cons:  - Feels  - I didn't really understand why all the characters made it out to be some ominous big mystery when really it was just something basic but its nothing too bad I guess - Can't go after the male character (That would've been fun)   Overall: I give it 10/10 because even with my personal cons, its still very enjoyable and they dont really ruin the game in the least. It's free to play why would I complain?",
            "review_score": "1"
        },
        {
            "review_text": "Well, i'm glad that i played this and read every word of the story. It's worth it, trust me!",
            "review_score": "1"
        },
        {
            "review_text": "This is a visual novel romance. good story and nice background music i'm sure you'll like it :)",
            "review_score": "1"
        },
        {
            "review_text": "So, basically completed the game.  And I must say, for a free visual novel this was actually pretty good. Sure, not a masterpiece, or that original (because of certain cliche characters, scenarios, etc.), but it has a very interesting appeal to it.   Basically this is a story about romance, not weird aliens, or time travel, or ghosts - just a simple storybook romance with a twist (which you probably will see coming). Its refreshing, if I could say so myself.  I'd recommend playing it, it is not that long, and if you read fast - even shorter. The story really is what keeps you going and clicking for more. Initially I just wanted to get the achievments and kill time, but got attached to a certain character, in whose ending I was not disappointed one bit.  All in all, kudos to the developers.",
            "review_score": "1"
        },
        {
            "review_text": "After playing on the first thirty minutes I knew I was going to give this game a Thumps up.  The novel is very light and the story itself is good, and comes with it the idea that it is a free game.  The least I can do is give it what it deserve for making me spend a heartwarming four hours of fun :)  Thank you Scarlet String Studios.",
            "review_score": "1"
        },
        {
            "review_text": "Easy to follow and read. Artwork's great, story's average but I still like it. Definitely worth the read!  I especially love the visual novel references!",
            "review_score": "1"
        },
        {
            "review_text": "Not bad, I guess",
            "review_score": "1"
        },
        {
            "review_text": "make a number 2",
            "review_score": "1"
        },
        {
            "review_text": "Was a really good visual novel. art felt weird at the start but u get attached to it later. the humor was good and relaxing. the music really fits the mood for each scene. and overall the story, the buildup, the place was all very enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "I was thinking too much  Well played",
            "review_score": "1"
        },
        {
            "review_text": "As an avid watcher of Anime myself, I love games based upon the looks of Anime. I haven't played many visual novels, but seeing how people were talking about this game in the Steam reviews sparked my interest. I gave it a look and completed it 100% and I have to say this was a real roller-coaster ride. If you've never played/not played much visual novels this is a great place to start. I won't say too much but the story involves a character who is scarred from an event that happened in his life. He tries to forget what happened and continues to live his life till cruel fate catches up to him and reminds him you can't forget everything. That is the base of the whole plot, the rest you can find out yourself. And a little bit of warning, don't read too much on this game. You'll probably get spoiled by a jerk who finds it funny to ruin a beautfiul game that was made by someone who put their soul into making it, just a heads up... The characters have character. the artwork is downright charming (And gorgeous), the music is fantastic, and this game will make you feel emotions you never knew you could feel. Overall, I definitely recommend this game. And it has sparked my new-found love for visual novels.      RogueTom gives this game a     9/10",
            "review_score": "1"
        },
        {
            "review_text": "MORE SEPIA TEARS PLZ! ",
            "review_score": "1"
        },
        {
            "review_text": "By far one of my favorites, something about its simplicirty combined with its meaning. Also, Myra really evokes a certain emotion, something between the lines of safety, comfort, and love. Her stalker-ish ways make you feel like she is always watching you (for better or worse), hey methods and witty comments really give a sense of comfort and friendliness, like you want to be around her, like she's an old friend. Rin is very creatively made to be a reflection in ways to Mark, and both Lucas and Lillian help give Mark (You) a better perspective of what's happening, and help altogether bring the story together. Also the whole thing takes place in a week, so, that's convenient.",
            "review_score": "1"
        },
        {
            "review_text": "Very Heart Warming",
            "review_score": "1"
        },
        {
            "review_text": "  It's fine.  It's free.   Art ranges from actually very good with nice camera pans and zooms, to lazy or even terrible.  The story is very lacklustre; the sister could have been cut from the entire story with no problem, and saved on the length of the story. The set-up ends up being around 90% of the story, with only a final 10% pay-off.  It desperately needs an editor, and a commitment to making the art as good as it can be (and in some scenes, it is).  It is, however, free.",
            "review_score": "1"
        },
        {
            "review_text": "Simple but nice dialogue and all",
            "review_score": "1"
        }
    ]
}