{
    "app_id": 429490,
    "name": "Resilience Wave Survival",
    "release_date": "2015-12-23",
    "developer": [
        "Jimbob Games"
    ],
    "publisher": [
        "Jimbob Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Adventure"
    ],
    "achievements": 81,
    "positive_ratings": 103,
    "negative_ratings": 60,
    "price": 7.19,
    "description": "Resilience: Wave Survival is a physics based endless wave survival shooter. Explore to Search for Weapons and Ammo to help Defeat the Enemies, better find food and water too if you want to Survive for longer, but Beware of the Tripods stalking the lands.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/429490/header.jpg?t=1546553048",
    "minimum_requirements": "Requires a 64-bit processor and operating system OS: Windows 7 64bit Processor: Dual Core Memory: 4 GB RAM Graphics: SM5.0 (DX11) 2GB DirectX: Version 11 Storage: 10 GB available space",
    "recommended_requirements": "Requires a 64-bit processor and operating system OS: Windows 10 64bit Processor: Quad Core Memory: 16 GB RAM Graphics: SM5.0 (DX11) 3GB DirectX: Version 11 Storage: 10 GB available space",
    "reviews": [
        {
            "review_text": " It's creepy and AI is bad, but there is something about this game and with a determined developer it may be a good wave survival title. I would give a neutral review, but there is no such a option so let it be a slightly positive review because I believe the AI can be fixed. The game is quite new and updates are still coming out. Environment and weapons looks pretty good and music is just terrifying.",
            "review_score": "1"
        },
        {
            "review_text": "So before purchasing this game, like most games you read the reviews. It was mostly positive with warnings of the game being buggy, not complete. The usuals for a very new alpha game.   However, what people havn't emphised enough is the potential that this game has! A base building, open world, wave survival is just what gamers want.   Throw in a little multiplayer here and there and your looking at a very good foundation to begin a masterpiece!  Its obvious that the developer keeps in touch with his gamers, releasing regular contect ect.   The game is obviously so far away from even discussing a completion date, but I bought this game in the hope that this developer will continue his work and really make somthing of this.   Seriously, good luck.",
            "review_score": "1"
        },
        {
            "review_text": "For only 3.99, the game has a lot of promise and can turn out really freaking cool. I have to put my settings on low to run it because I don't have a great pc, but it can really turn into something great. It's also a really detailed map and I can only assume they will add on to it as its blocked off, but still a decent size map. The game is also being updated daily, meaning a few patches a day.",
            "review_score": "1"
        },
        {
            "review_text": "I just want to update my review from negative to positive because I believe that the review I gave originally was unfair. I gave a review after only playing one mode of the game, that being sandbox, now I have spent a little longer playing and now want to say that this game has really great potential. If the developer spends some time fixing things and listening to the players on what they want to see it could be one of the top games of the genre. Im gonna list the good and the bad for game.  Pros: + Nice graphics (I was playing on max)  + Nice assortment of weapons  + Large amount of enemys including boss enemies  + Different game modes to play  + Great concept  + Developer is very active and responds to comments and updates the game on a regular basis  Now the bad Cons: - Ui can be annoying at times  - Not enough time between rounds  - Sandbox mode is hard to figure out (For me it is, others may not have this issue)  - Animations are mediocre   - Weapon models need working on  - Driving the buggy allows you to see under the map  - Bugs as all Early access games experiance  - Price has increased and really should not have yet  - Dont have leaderboards that I know of.  These issues are really nothing groundbreaking and can be fixed with no problem. I really had alot of fun with the small amount of time I spent playing. My hrs on the game are more than listed. I would say I have around about 5-6 hrs. Also its a good game for the price but its went from 3.99 to 5.99. Thats about a third of the original price. I think its too soon for the increase but I dont know his situation so I may be wrong.",
            "review_score": "1"
        },
        {
            "review_text": "this is a great game and i higly recommend it.......however there is no multiplayer and that would complete the game for me.",
            "review_score": "1"
        },
        {
            "review_text": "i bought this game around when it first came out and it was ok not it changed a LOT and in a good way  only thing i find missing is multiplayer",
            "review_score": "1"
        },
        {
            "review_text": "This game is actually very good despite some bad reviews. It has a lot of minor things that need to be fixed, such as getting into some areas like houses because the entities are a bit funky. The weapon models need to flow a bit better and look a bit less...I don't know, robotic? The reload animations and just the models themselves need some touching up on, same goes for the cheesy enemy models. That is not to say they aren't terrifying when all of a sudden, BAM! They're right behind you. They're...creepy in the crude way they look and move, and it would also be nice to have an audio queue to let you know they're there, but it still has a nice bit of horror by just 'footsteps' being heard to warn you...eugh....  So, all in all, it's a good game! I enjoy playing it! It just needs quite a bit of polishing, and maybe a few more facets too, and it'll be spectacular! I recommend it to people who enjoy a good FPS or wave shooter or survival/horror game. I hope there are future updates to keep this game going and getting better!",
            "review_score": "1"
        },
        {
            "review_text": "got potentional but for some reason no matter how many times i tell it what to do through the input section it will not let my xbox controller or mouse look up down left and right its a shame because this could be good",
            "review_score": "-1"
        },
        {
            "review_text": "No Multiplayer even though one of the tags said that this game was Multiplayer.",
            "review_score": "-1"
        },
        {
            "review_text": "Awesome I like the style of this game , I would like to see more of this kinda zombie action multiplayer",
            "review_score": "1"
        }
    ]
}