{
    "app_id": 429610,
    "name": "The Emerald Maiden: Symphony of Dreams",
    "release_date": "2016-02-18",
    "developer": [
        "GOGII Games"
    ],
    "publisher": [
        "Artifex Mundi"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Casual"
    ],
    "tags": [
        "Adventure",
        "Hidden Object",
        "Casual"
    ],
    "achievements": 13,
    "positive_ratings": 208,
    "negative_ratings": 43,
    "price": 6.99,
    "description": "Save your family from an ominous undersea facility!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/429610/header.jpg?t=1530539003",
    "minimum_requirements": "OS: Windows XP, Windows Vista, Windows 7, Windows 8, Windows 10 Processor: 1.5 GHz Memory: 512 MB RAM DirectX: Version 9.0 Storage: 1 GB available space",
    "recommended_requirements": "OS: Windows XP, Windows Vista, Windows 7, Windows 8, Windows 10 Processor: 2 GHz Memory: 1 GB RAM DirectX: Version 9.0 Storage: 1 GB available space",
    "reviews": [
        {
            "review_text": " Short version: 88%",
            "review_score": "1"
        },
        {
            "review_text": "-Short Review-  + Pros:  *Undersea Setting (Great for ocean lovers or Bioshock fans!)  *Balanced HOG Elements &amp; Puzzles (You don't need to worry about the game being saturated in Hidden Object scenes, there's plenty of exploration, story-telling, and puzzles to be had, too!)   - Cons:  *Short Gameplay (The main story took about three hours to finish, the bonus side story added an additional half-hour)  *The Side Quest Ending (It felt rushed, and shoe-horned in. It also ends on a cliffhanger, it's not entirely satisfying)  *Price ($10 seems decent for a HOG, but that's a lot for a game this short - buy it on sale!)  + . + . + . + .  I've enjoyed a lot of the games Artifex Mundi has developed and published, they offer up beautiful, lush backgrounds, relaxing gameplay coupled with music - and each game is a unique experience.  This game lives up to the reputation, aesthetic-wise, but it was a bit disappointing towards the end.  You play as a young woman, who was abandoned at an orphanage at a young age; 25 years later you receive a mysterious invitation to an underwater theater and enjoy all its wonders.  Hoping to find answers about your parents, you board a small drop ship and sink to the ocean floor.  And you soon find yourself trapped in this luxurious tourist attraction, with an unknown phantom lurking in the halls. As if that wasn't enough, you come across strange creatures, gadgets, and even a machine that can shape people's dreams!  The premise is interesting enough, and the gameplay is enjoyable. If you're a fan of Artifex Mundi, you'll probably enjoy this title as well.  The only complaint I have is that it is significantly shorter than most of their games and a $10 price seems like too much.  It's a definite buy, however, you might want to wait for it to go on sale if you're tight on cash.",
            "review_score": "1"
        },
        {
            "review_text": "really enjoying this game",
            "review_score": "1"
        },
        {
            "review_text": "It's an okay game, but Artifex Mundi have published better ones. Some translations in the Hidden Object Scenes are off.  5/10",
            "review_score": "1"
        },
        {
            "review_text": "Well, probably it is not much worse than the other titles distributed by Artifex Mundi, but the additional chapter has a completely idiotic story, and the game as a whole ONCE AGAIN preys on Bioshock. And you do not get the soundtrack this time - too bad as it contains several nice tunes. Polish language version has some major errors, for instance translating 'compass' as 'kompas' (the devidce indocating north) instead of 'cyrkiel' (the device for drawing circles). Being some of a veteran of hidden object games, I could only recommend this title at a major discount.",
            "review_score": "-1"
        },
        {
            "review_text": "Quite a short game but its fun and interesting!",
            "review_score": "1"
        }
    ]
}