{
    "app_id": 429690,
    "name": "Astro Duel",
    "release_date": "2016-02-22",
    "developer": [
        "Rusty Moyher"
    ],
    "publisher": [
        "Wild Rooster"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Local Multi-Player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Stats"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "4 Player Local"
    ],
    "achievements": 14,
    "positive_ratings": 39,
    "negative_ratings": 3,
    "price": 5.79,
    "description": "Astro Duel is a competitive local multiplayer party game. Rounds are quick and death is sudden. Blast your friends using asteroid-style ships. Run over their helpless bodies for good measure.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/429690/header.jpg?t=1525366976",
    "minimum_requirements": "OS: Windows XP, service pack 3 Memory: 1 GB RAM Storage: 120 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Fantastic game with local multiplayer focus, and some solid single player options for if you have no friends. The controls are tight on both keyboard and on game pad (I've only used wired connections for xbox one controllers for gamepad support initially, and it works great). Multiplayer is a complete blast, and is a good way to ruin friendships in a more skill based game than mario party 5000. It runs really well on the surface pro 3, so you can also take it to a (soon to be former) friend's house and humiliate them with your amazing piloting skills. In all seriousness though, it controls super tightly, and causes players to make decisions about ammo conservation, whether or not to rush to a powerup or try to snipe somebody trying to grab one. The game performs great on my surface, and works very well with my minidisplay to hdmi adaptor on my tv. If you have a liking of local vs games like street fighter or tower fall, and enjoy asteroids, or one of those two options separately, this is the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "Simple and therefore easy to get into. I played it on portable devices tens of hours and that alone has been a blast! And that was free of charge! This is 5 euros with more levels, more powerups better controls so there was little to no consideration when I bought it. Only con is no online multiplayer but its not the way this is meant to be enjoyed:)",
            "review_score": "1"
        }
    ]
}