{
    "app_id": 429680,
    "name": "Spellweaver",
    "release_date": "2016-02-01",
    "developer": [
        "Dream Reactor"
    ],
    "publisher": [
        "Dream Reactor"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "MMO",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Free to Play",
        "Indie",
        "Massively Multiplayer",
        "Strategy"
    ],
    "tags": [
        "Card Game",
        "Free to Play",
        "Strategy"
    ],
    "achievements": 20,
    "positive_ratings": 905,
    "negative_ratings": 321,
    "price": 0.0,
    "description": "Spellweaver is a free-to-play digital card game true to the classics of the genre, adding in several unique features for a new and fresh gameplay experience. With a focus of strategic depth and variety, it offers endless hours of fun in casual or AI matches, ranked play, drafts, and tournaments!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/429680/header.jpg?t=1491850127",
    "minimum_requirements": "OS: Windows XP or later Memory: 1 GB RAM Graphics: Any 256MB DirectX 9.0c compatible video card DirectX: Version 9.0c Storage: 500 MB available space",
    "recommended_requirements": "OS: Windows 7 or later Memory: 2 GB RAM Graphics: 512MB DirectX 9.0c compatible video card Additional Notes: 1080p or higher display resolution is recommended",
    "reviews": [
        {
            "review_text": "I've played this game since closed beta (not on steam) and it's my favourite digital CCG so far. Definitely worth a try for every fan of card games.   Pros :   large variety in terms of deck building (the 6 colours can be freely combined)   the speed, and front and support row systems shake up traditional CCG combat a bit   generous quest system   unlimited deck slots (no Blizzard, more than 9 doesn't confuse us)   has a mechanic to mitigate resource screw/flood   tournament and spectator mode   leaderboards, which show the exact ranking of every player playing ranked   beautiful artwork (at least imo)    Neutral    it takes a few hours to unlock features like crafting or Trials (similar to HS arena)   very little RNG (no BS but also no great highlight reel material)    Cons :   fairly steep learning curve   single player campaigns not yet implemented   options menu is really lacking    some minor bugs here and there  -------------------------------------------------------------------  read on for more in depth information : The  combat system  functions similar to MtG, but with a few twists. You can directly target your opponents creatures with attacks. However each creature has a speed stat, ranging from 1 to 4, in addition to health and attack. A creature can only ever attack or block a creature with the same or lower speed. A higher speed means more flexibility in combat but comes at the price of lower stats or higher cost. Creatures can move freely between a front and support line (except when they have previously attacked this turn). While a creature is protected from attacks in the support line, it also can't attack or block itsself, which makes it the perfect place for small creatures with key effects. An exception to this are flying creatures, which can attack as well as block while in the support line.  This game is  really generous . You don't have to spend a dime and you can still build a competitive deck in about a week with semi-casual play. As you play you automatically unlock new starter decks and the corresponding faction's quest zones. From unlocking all zones alone you get multiple rares (second highest rarity) and one epic (highest rarity) of every faction. Every 8 hours a variety of quests spawn in one faction zone from which you can choose one. Rewards range from small amounts of gold, a few common or uncommon cards or small packs (4 cards) to 12 pack boxes, rare and epic cards (no duplicates) or premium currency. There's also the academy, which gives you a really good quest once every 3 days. In the draft mode Trials, which you can enter for a fee, you break even after 3 wins (50% win rate) and at the max of 10 wins you get rewards, which are worth more than 7 times the entry fee (including 5 packs).  For those who want to spend a few bucks there are custom card backs or premium packs, which have higher chances for epics and will not give you cards you already have 4 of (max number which can be included in a deck). ",
            "review_score": "1"
        },
        {
            "review_text": "Overall very happy with this game. It's an ambitious project that I think will be very attractive if they get around to implmenting the MMO Conquest mode (this isn't yet funded but is on their dev roadmap). The design and balance is well thoughtout, massively superior to most CCGs out there. I think I'd argue it has all the nuance of MtG. Over time I expect the themed expansions will add huge flexibility.  Pros: + Well designed combat mechanics + Broad range of early playstyles across the factions + Cool heroes who add unique flavor and flexibility to decks + The artwork and music are solid + AI scales well between modes  Mixed: +/- You buy cards, some people will hate that. It isn't pay to win, you can craft every card in the game but that does require more time playing than some might want to spend +/- I think balance between factions is good overall but needs some maturity +/- Lore. It's not a must have but I think adding some flavor to get you more excited about your faction/cards would be cool  Cons: - The game doesn't have any real social aspect or interactions unless you want to run IRC in a separate window. I'm fine with this so far but I might find it grows boring unless they're adding new content frequently enouogh - Stability, this one is HUGE I don't know if these Dev's just lack experience building large redudant systems but drops and outages are frequent (and I'm playing on a dedicated 1 gig up/1 gig down link. Just improving their design would go a LONG way towards making this game a winner.",
            "review_score": "1"
        },
        {
            "review_text": "Good alternative of Hearthstone on a Steam.",
            "review_score": "1"
        },
        {
            "review_text": "Spellweaver take the best of other TCG and combine it into a whole different experience. It brilliantly took the best of it, combine it and modified it so became it own uniqueness. The most I loved from it is :  1. Shrine systems. There is 2 resource that count as mana, one is the level that is like MTG mana system. The other is Mana Crystal that is like Hearthstone one. There is Divine offering that let you shuffle one card in your hand for a chance to look top 5 of your library and took 1 shrine card.  2. Combat systems. With the involvement of speed, there is a 3rd stat for creature you need to look for. Lower speed creature cannot attack or block higher speed one. While in MTG, combat favor the defender and in Hearthstone combat favor the attacker. Spellweaver I think hit the sweet spot here.  Just try it and you know this is a good TCG.",
            "review_score": "1"
        },
        {
            "review_text": "Spellweaver is a fun card game, and at least in my opinion when compared to many other free to play card games on Steam stands a cut above the rest. In spellweaver it doesn't come down to just who can get more cards on the field like many other free to play card games. Most cards have usefull game changing abilities, and the way cards work together heavily influence gameplay. The downside ot this is with so many variables, it is possible to scre3w yourself over in a single turn just as much as it is to turn the game in your favor! Spellweaver itself seems well made from a gameplay perspective, even if I often see or experience issues with the servers. I would recommend card fans try it.",
            "review_score": "1"
        },
        {
            "review_text": "Despite what it may say in steam, I've dumped hundreds of hours into Spellweaver and I must say, I have played dozens of card games both physical and digital, by in large Spellweaver is the best.   Developers that interact regularly with the community as well as listen to the community A community free of trolls, hate, and personal attacks Rewards that actually reward you for playing without imposing a meaningless 'Cap' on a day's gold, making it very viable to finish an entire collection without dumping piles of cash into the game.   Built in mechanics that fix pretty much every 'Issue' one could have with other card games, this game takes everything good about Magic the Gathering, Hearthstone, and a handful of other games and tosses away the bad.   I absolutely cannot recommend this game enough, it is by in large the best Card game on Steam and I urge you to download it and give it a try!",
            "review_score": "1"
        },
        {
            "review_text": "Pleasantly surprised by this game. Really like the art of most cards. Core system is good with some new features like creature speed. UI is simple, intuitive and working. It also has PvE challenges which is a plus in my book. The biggest con for me is small number of cards, but this game is still young, so pretty sure it will grow eventually.  So overal good job, devs.",
            "review_score": "1"
        },
        {
            "review_text": "This is a really fun game. It has alot of similarities to mtg. Still not as complex, but it is also not as old. There are mainly two issues I have with the game, which are related to the implementation. Firstly, there are no Key bindings at all. I really hope they add some in the future. And some of the actions are unnessesarily slowed down. You can't fast-klick multiple times for an action and the animations often get in the way of the game-flow.",
            "review_score": "1"
        },
        {
            "review_text": "As someone who enjoys Totalbiscuit and the Co-optional Podcast, I cannot help but wonder if the decision to release the game today is in any way related to the fact that TB mentioned trying and enjoying it in this week's podcast - which went up on YouTube yesterday. Makes perfect sense to me. When else are you essentially going to get a free, fairly extensive explanation and endorsement on a show with that many viewers. Then again, it may be total coincidence, if such a thing existed. Illuminati.  By the way, as someone new to CCG, I enjoy the game. Not too complex, though there are still some things that happen for reasons I can't explain. Like I said, I have no background in this genre. Anyway, I'm having fun. Especially now that the connection issues appear to have been straightened out.",
            "review_score": "1"
        },
        {
            "review_text": "As a former professional card game player, Spellweaver is by far the best and most challenging CCG/TCG out there I've tried. I see it as an improved version of the world class MTG.  Gameplay is very good and strategically deep, with a large variety of mechanics to play around with. The hero cards add depth to deck-building and having 6 'colors/factions' opens many possibilities. The learning curve is a bit high for complete beginners who have never played this kind of games before, but the Devs are improving the new player experience with better tutorials and aid for the beginning players. Above all, I must sincerely congratulate the Spellweaver Team. They are active and responsive all the time, listen to the community, admit openly when they have failed or gone wrong, patch when needed, and very generous! Kudos! I have never seen such commitment from any other game, in over 20 years of gaming... With a larger player base, Spellweaver will become a long lasting gem in the world of card games.",
            "review_score": "1"
        },
        {
            "review_text": "Magic the Gathering players will love this.  Plus the 'speed' thing is new and innovative in my opinion",
            "review_score": "1"
        },
        {
            "review_text": "A great cardgame for lovers of CCGs, very similair to Magic The Gathering but takes elements from games like Hearthstone. Decently priced packages so far too!",
            "review_score": "1"
        },
        {
            "review_text": "The game for me is in a middle ground between Heartstone and MTG.  It has more depth than HS, with mechanics like  Speed  (indicates which creatures can attack which, and block) and you do not only have  Mana , but also an  Order  level, so you must balance when to use a  Shrine  (land-like from MTG) for Mana/Order in a way that allows your strategy to flow.  It depends a little less in 'resources rng' than MTG with a mechanic that allows you to discard a card from your hand for the chance of looking at the top 5 cards of your deck for a Shrine. This adds a forgiving mechanic in case the player is having bad luck and not drawing any Shrines, while also adding another layer of strategy to the game by making you think if it's worth waiting one more turn for the chance of getting a Shrine, or discarding that  Spell  which is part of your combo so you can block the enemy  Creature  next turn.  The other mechanic that I think is worth to say here is that the battlefield has two parts to it, a front-line and a back-line, some creatures start on the front and can attack and defend, but  Support  and  Flying  creatures start on the back-row and, in the case of Support, cannot attack or defend (they usually have some special ability) and, in the case of Flying, they can't be targetted, but can attack and defend as if they were front-liners. Creatures can be moved between both lines.  Basics pros and cons (for me) are:   Pros:     Great free to play model where you can unlock decks just by leveling up (which is pretty quick at the start, every 5 levels), and you can also buy decks with  Gold  (in-game currency that you get after each match). There is a giveaway right now where you can get 100k for free from MMOBomb (each deck costs about 40k);    Packs are also cheap to get with Gold;    There are daily quests that give you cards, packs, Gold;    If you don't find a match in a certain amount of time you can enable an option that allows you to play against AI;    Game has enough different mechanics to standout from the crowd;    Cards seems balanced;    You can mix cards from different  Aspects  into your deck;    Simple and easy to use deck building tool with all the filters you'll probably need right now;    Cons:     The tutorial is lacking and does not explain the game mechanics very well, if you are a total newbie to card games you will probably get confused;    There aren't many cards  yet ;    Some starter decks are way more useful than others (unmodified);    In short:  Fair business model, many mechanics, less dependent on rng.",
            "review_score": "1"
        },
        {
            "review_text": "If you like card games like HS, MTG, and E.T.C I recommend trying this game. I enjoyed few games which I had so far it looks like it’s not a pay to win game. You can buy a currency in the game which will allow you to get new cards faster, but like In hearthstone it looks like it’s not totally necessary because you get gold for playing games, doing quests, reaching goals etc. And you can craft cards.  It’s amazing that a team of only 5 people could make such a good game, and esthetics of the game are nice as well.  There are only 2 things which I didn’t like. I think developers should reduce time of the turn. And give people penalties for taking too long. Because in some games which I was playing I had people who were afking, and playing really really (Super) slowly. And that’s annoying and I think many people might get bored of that. Of Couse that depends on luck you can play 100+ games where people will respect other player and not go for a few minutes to wash dishes or do something like that.  And the other problem was resolution options my desktop resolution is 1920x 1080, but game was runnig on 1280x800. And I couldn't change it. Overall: It’s a nice game and i can see a potential. I hope that more card games like this come out.",
            "review_score": "1"
        },
        {
            "review_text": "I played this A LOT in the open beta and couldn't get enough! So much effort has went into this game and the developers are always making improvements and fixing bugs. Can't wait to get some free time to get back into Spellweaver again.   -Beautiful art -Unique twists -Great Community -Fantastic overall!!",
            "review_score": "1"
        },
        {
            "review_text": "Best digital card game I've played, and 100x better (and more fun) than Hearthstone. Little to no RNG, more interesting mechanics, and instant spells make this game hella fun. It's also not too P2W as there aren't THAT many cards out yet, and the starter decks are all pretty good. Try it!",
            "review_score": "1"
        },
        {
            "review_text": "Sixteen hours in, and I think I have a pretty good grasp of this game.  As a note, I never got around to really playing MTG, and Hearthstone was too boring for me. That said, I really like Spellweaver. There are issues with it, which I'll point out, but the game is still great.     Should You Play This?      Yes.   Even if you don't like card games, Spellweaver is a good thing to at least try out, seeing as it both free and is a good blend of the best aspects of other card games.     The Basics    Spellweaver is, as some people have stated, a mix of other traditional card games. Unlike a lot of other games, there is a unique 'speed' aspect to each creature. What this does, is determine if a certain monster can attack another one, or block another. This might not seem like a lot, but it goes a long way for both making the game special, and adding tactics to the game.  Besides the speed though, the game doesn't   really   add in anything too new, which means it'll generally be the same type of card game that people have played before, which isn't a bad or good thing on it's own.  On the subject of good and bad things, what   is   the good and bad of the game?     The Good     TL:DR - The game has six factions, each with their own playstyle and pros and cons, and different builds. The cards for each deck are also easy to come by, by either the easily gained gold, or the easily finished missions. Finally, the game looks nice, and runs pretty smoothly.   The game has six factions ( Order, Nature, Wisdom for the 'good' side, and Rage, Dominion, and Corruption making up the 'evil' side ), each with their own specific shrines ( basically, items that allow you to gain more mana for playing spells and creatures, draw cards, and increase your certain 'level', which is used to use certain spells or summon higher leveled creatures ). The different factions also come with their own strengths and weaknesses, which allows a player to figure out what their current deck is good at, and what it's bad at.   Still on the subject of decks, getting new cards for a deck isn't that hard. The marketplace has cheap 'packs' you can use gold for (or crystals, but those are gained strictly through real money or possibly from getting lucky through the ingame quests), or you can get cards through some of the various missions that the game has for you to do.  Another positive thing that the game has, is the matchmaking system. It's rather quick in the current state, and has pretty much everything you need to really get into the game.  Along with the matchmaking system, the game's interface is smooth, and looks rather pleasing, so if anything you can rest assured that it doesn't look like crap.   Now, we go onto the negative.    The Bad    TL:DR - The game has a learning curve. It's not huge, but it can take a while to really understand everything about the game, and even then you'll come across somethings you're not used to. The game suffers from some of the most experienced players being matched up with newer players from time to time, which means people are put at an obvious disadvantage. Finally, the game can crash from time to time, and the servers don't like reconnecting you all the time.  While there are a lot of good things with the game, it still suffers from some bad stuff.   The main issue people may have with the game, is the learning curve. There   is   a learning curve with the game, but it isn't enough that it should turn you away from the game. At the start, you'll find it rather strange, with the different spells, creatures, shrines, and all of the effects and such. Once you start to figure out the combat and card aspects, the game gets easier, but for a while, you may be confused.  This game suffers from really experienced players getting lumped in with newer players. This isn't as bad as it (supposedly) was before, but there still are times when you'll come across a player that has quite obviously played a lot of matches. There really is no sugarcoating this one. It sucks, and it may or may not happen to you.  This final complaint may actually be on my end, but I'm not sure. The servers seem to be a bit iffy, and you might find yourself crashing from time to time. It's not a big deal, but it gets kinda annoying.    The Conclusion    Some people may still believe that Spellweaver isn't a game for them, but in reality you really don't know until you try it, and with the price being at zero dollars, you have nothing to lose by trying it out.",
            "review_score": "1"
        },
        {
            "review_text": "Sorry for my English;) The game is gorgeous. The gameplay is quiet similar to the MTG, aesthetics are nice and calm. The main advantage relatively to other digital TCG is a much more generous system of rewards. Here you get three daily quests, you can stack up to six, and do them simultaneously. In addition, every three days, game provides additional epic quest with higher awards. During the game against bots and against the people awarded gold and experience. Moreover, the defeat on Ladder and Friendly award only twice in less than a victory. This greatly helps to relax and not be tied to the outcome of the match, and just playing for pleasure. As a result, the collection grows very quickly. If we talk about the prices, they are about six times lower than in HS and games with a similar pricing policy.",
            "review_score": "1"
        },
        {
            "review_text": "A more complex, less RNG feeling version of the online CCG's, compared to the popular Hearthstone, that is easily to get into since its forgiving reward system, but still doesnt have the feeling of unlocking everything in the first hour. As an FNM-level magic player, i definitely recomment it over any other f2p ccg games i have seen on steam. It borrows just the right things from both Hearthstone and MTG, and its unique mechanics like the energy system and speed system are actually easy to figure out, and fun to use. Currently, it still suffers from various bugs (although the creators are eager to fix them), but like all similar games, if it wants to survive on the long run, it requires content updates, both which Magic: Duels and Hearthstone offer, which can be a big dealbreaker.",
            "review_score": "1"
        },
        {
            "review_text": "Surprisingly fun; it's MTG with an interesting twist. Lots of rewards and unlocks without having to pay actual cash.",
            "review_score": "1"
        },
        {
            "review_text": "Haven't played the game for long, so i will probably update this review when i get some hours into it. One thing can be said though and that is this: Even if you don't end up liking the game, the in game music would almost make it worth it anyway!",
            "review_score": "1"
        },
        {
            "review_text": "Great game I was a bit worried since it was a card game, since I have played and wasted time on hearthstone(Worst card game I have played) But when I got in, this game had alot of elemnts of Magic, which I have played alot and so I knew what was doing quick, but had heros powers as well, this is just a wonderful game.",
            "review_score": "1"
        },
        {
            "review_text": "I spent a good amount of time playing magic the gathering in my younger years  (4-5 years) and graduated into the online cardgame of hearthstone (2years). I have to say that once i got through the tutorials and began to understand the mechanics to the game, I found that feeling I got when I first played magic the gathering, complete and utter satisfaction. Through Spellweavers Fun, competetive and creative environment that it gives, i have discovered a new home to reside my competitive nature and artistic urge to build beautiful and destructive decks to slay my enemies :D",
            "review_score": "1"
        },
        {
            "review_text": "One of the most fun card games i have played. Everyone should try it!",
            "review_score": "1"
        },
        {
            "review_text": "Good game , easy to learn and play. Too few cards but is understandable because it just launched.   Bad things : too many patches , 'the server will shut down cause of patch', 'you will get kicked because we will launch a patch' , 'you cant log in because the game gets a new patch', 'maintainance cause of patch' :))) Any way patches are good and will stop soon I HOPE",
            "review_score": "1"
        },
        {
            "review_text": "I have played for years magic the gathering and hearthstone with tournaments etc but they were missing stuff.Spellweaver comes to complete those things and it's a very good combination of both.As someone said in here magic and hearthstone made a bady.I really like this game and enjoy it .You earn levels, gold, packs by playing without needed to pay for something though you can if you want. Any simple good non paid deck can win an expensive one and that's very positive and balanced.Also it has realt nice story artwork and sinlge player games/quests.Gratz to the developers for this great title.",
            "review_score": "1"
        },
        {
            "review_text": "Seems like this game have a really big potential, however it is clearly in an Early Access stage, loads of bugs and server issues, be warned. I think iI read somewhere its a MGT rip-off... well must agree a bit, there is a lot of MTG here. But so there is a lot of other card games, and one of biggest issues of MTG for me -Lands (none at all or too many) is so well fixed here!! You can always exchange 1 of your cards in hand for next 5 cards from deck, if one of them is a mana card You can swap it!! Genious! :) Not that many cards out yet is a bit of a bummer, but hell sure it is satisfying playing each colored nation.  I am definitely watching where this game is going!!",
            "review_score": "1"
        },
        {
            "review_text": "A little more complex than Hearthstone......I like it.",
            "review_score": "1"
        },
        {
            "review_text": "This game takes the core concepts of Magic: the Gathering and adds some interesting changes, namely by adding creature speed ratings and changing the core resource gain mechanic to help you cycle through your deck faster. It works out really well. Also, the item store aspect is not pushed on the player - much of what is there can be bought through in-game earned currency. If you want to spend money, there are useful ways to do that, but it is not required.  Overall, I'm very happy with Spellweaver and look forward to playing it much more.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing. It has the perfect formula for FTP and the gameplay is beautifully balanced and well designed. Try it. Now.",
            "review_score": "1"
        },
        {
            "review_text": "It's fun and interesting, they could polish some things but the gameplay is really good! PS: Please put offline play in the game! It's annoying getting disconnected from the game when you are playing against AI",
            "review_score": "1"
        },
        {
            "review_text": "I like it! I love card games like these! I'm long time Magic: The Gathering player, If you know how to play Magic, learning he basics of Spellweaver should be a breeze!",
            "review_score": "1"
        },
        {
            "review_text": "Ever since Hearthstone came out of beta, I've been thinking - all right, this is great fun, but can I have something more strategic, please? A game that is less about playing the optimal hand every turn and more about making tactical decisions that matter?  Spellweaver might just be that game.  There have been many entries in the digital deckbuilding game scene over the past few years, but somehow most of them have managed to take a step in the wrong direction, be it an unreasonable business model, unbalanced gameplay, bad developer support or simply lackluster production values. Spellweaver, however, is attempting to tick all the right boxes and is doing a good job so far. It will look immediately familiar to everyone who has played a dueling card game, but has enough unique twists to the classic formula to grab their attention. The rules are easy to comprehend, but there are many strategic layers to be found and a lot of room for experimentation. It's also still very fresh, so new players shouldn't have any trouble amassing a decent collection of cards. The business model is pretty generous in that regard. So if you want to get in on the ground floor, now is the time. Apart from that, the game has some exciting deckbuilding possibilities. The are six different card factions and, unlike Hearthstone, Spellweaver supports multi-faction decks. The game is currently at the stage where it's really exciting to see where it goes with future card releases. If it manages to develop an interesting and reasonably dynamic meta, this game could really shine among other competitors. The overall presentation is great as well - nothing spectacular, but nicely polished and professional-looking. If there's one complaint I have, it's that the animations can feel too slow and 'floaty', which needlessly drags down the pace of an otherwise intense tactical affair.  Also, in-game communication is a bit strange: there's a fully functional chat window on the overworld map, but once you're in a match, all means of communication are gone. No chat window, no emotes, nothing. I fully support the idea of minimizing verbal abuse in competitive games, but this doesn't solve the problem and most of the time just feels limiting. But those are minor issues, of course - nothing that should keep you from giving Spellweaver a try.  TL;DR: If you're looking for a quality ccg that's not too convoluted, not too shallow and sports a good business model, this could be it.",
            "review_score": "1"
        },
        {
            "review_text": "I like this game for it brings a whole new element to the traditional combat scene , the speed of your troops , which opens up a whole new spectrum of tactics to be used   As a magic the gathering player I'd recommend this game as it stands now , for the cards are fairly well balanced , the game runs smooth , bugs rarely happen and Instead of only five basic elements , there are now six !  This game has also come up with a smart lil gizmo to make it fairer to the player doest get to start on turn one of the game , they get an emblem which grants them one mana upon sacrificing said emblem , the emblem can also be sacrificed on any given time the player controlling it desires and cannot be removed from the game by the other player , thus giving the player starting second a temporary edge , although this balances out nicely once the emblem has been used , for the starting player will have more mana production that the player starting second  All in all , I enjoy this game and I am certain that the strategy enthousiasts among us would do so too  If you have any questions bout the game , feel free to either leave a comment on my steampage or add me (dont worry , I dont bite ... much )",
            "review_score": "1"
        },
        {
            "review_text": "Finally a game that have a chance competing with the other TCG's like hearthstone and magic",
            "review_score": "1"
        },
        {
            "review_text": "yugioh with better artwork  artwork/10",
            "review_score": "1"
        },
        {
            "review_text": "Experience with similar games=  Magic the Gathering = paper version, various duels of the planeswalkers, MTGO Yu-Gi-Oh! = paper version, DEV PRO (unofficial online version.) Culdcept Saga (XBOX 360 Game)  This is a great card game. Has potential for a lot of depth, but needs more cards. Very close to MTG. It's free to play and you can play enough games where you aren't forced to buy boosters. This game has solved many of MTGs mana problems with the shrine system and the ability to trade a card from your hand once a turn to look for mana at the top of your deck. The game also has a hero with a special ability that can be activated, imagine MTG Vanguard if it had been implemented better. Creatures also have different speeds which adds a bit of strategy when attacking and blocking.",
            "review_score": "1"
        },
        {
            "review_text": "Without a doubt ,one of the top 3 CCG on Steam.Great mechanics and awesome artwork.",
            "review_score": "1"
        },
        {
            "review_text": "Spellweaver Review –  TLDR:  I do not recommend this game as the paywall is very high. I think the very high paywall deters new players from staying. As a new player you can expect about a 60-80% loss rate on friendly/ranked games if you aren’t willing to spend $100+ USD.   Positives: Combat system much like MTG with a few modifications. – 8/10 Artwork has a nice fantasy quality. – 8/10 A resource system with low amounts of RNG problems. – 7/10  Negatives: Free-To-Play versus Pay-To-Win – The model has a very high paywall resulting in a huge power gap. – 2/10 Card balance seems good if you have the full deck but there are just not enough decent substitutes. – 2/10 Card creation and exchange is designed to consume additional card value. – 3/10  New Player Essentials: Every 5 character levels you will unlock a starter deck for free up until level 20. Unlike MTG/Hearthstone creatures attacking creatures can only be blocked singly.  Balance: At the time of this review I have played up to level 16. I have used two of the three new player Swiss draft tickets (32 payers). I placed 2nd and 3rd in those Swiss constructed with 4-1 records. Losses were from someone who had spent real money (2nd) and RNG mana problems (3rd). These new player Swiss rounds really let you see what the game should feel like for new players where you are taking 1 to three started decks and around 10 packs and seeing what you can cobble together. If you have played a lot of draft Hearthstone or MTG it felt like that.  Pay Wall: Once you start playing anything against the AI there is a huge difference. There are currently 24 epic/ 6 heroic cards which you can have up to 4 in a deck. There are 18 heroic heroes (6 from starter decks.). Epic Cards cost 150 color specific shrines. Heroic cards cost 200 color specific shrines. 12600 + 4800 + 2400 = 19800 shrines. Not every card is needed for top decks but it is useful when looking at that in comparison to the average shrines per pack.  There are 10 cards in the standard pack. Shrine disenchant value you is 20% of the creation value. Normal packs have a 7 common/2 uncommon/1 rare distribution with an epic occasionally taking the place of a common. The disenchant value of 1 pack is about 22 shrines. To craft a play set of all the epics/heroes/heroics you need to open approximately 900 packs. If the epic chance is 5% per pack you are looking at 600 packs.  600 packs will set you back about $895 USD. At this point you will be on equal footing.  Pay Wall versus Play Value:  Since the paywall is so high I felt completely outmatched in the “friendly games”. I was consistently getting matched against opponents whose decks are essentially 50% rare/epic. The power level and necessity of some cards versus creation costs makes for rough going. This type of matching says to me that there isn’t enough new players joining as MMR should be low enough that I face those opponents.   I had a better win percentage in ranked games versus normal games because the MMR keeps those with newer collections from facing opponents with a full set of cards.",
            "review_score": "-1"
        },
        {
            "review_text": "The best and most generous free to play TCG out there. A game that takes the best from Magic: The Gathering and Hearthstone, fixing their flaws and adding its own innovative ideas. PSA: There's a free 100k Gold key on some MMO website. Google it. It's legit.",
            "review_score": "1"
        },
        {
            "review_text": "Even though I've played Spellweaver for quite a short amount of time thus far, I have enjoyed it a lot! Definitely give it a try.  Also it's sure to appeal to Magic The Gathering-players, such as myself.",
            "review_score": "1"
        },
        {
            "review_text": "Simply put, this card game takes a lot of the aspects of card games that are simply infuriating and tosses them straight out the window while maintaining all of the things that make card games fun. For those of you looking for a methodical, and strategic card game then this is certainly a game you should try.  For those of you who would like to read on, here are some specific examples.  Annoying things that are gone:  - Card collection is much easier than other games, such as Hearthstone, say, because there are quests that give you cards of a certain rarity that you don't already have! Furthermore, if you are willing to spend money on the game you can also get 'premium packs' which, assuming you haven't collected all cards of a particular rarity, give you only cards you havent received already.  - If you get screwed over by not getting a resource card you need, once per turn you can shuffle one card into your deck in exchange for a resource card off of the top 5 cards in your deck. The other 4 cards you didn't select are shuffled back into your deck  - No more arbitrary class restriction!! Classes only exist in the sense that you have to invest your resources into one of six aspects in order to play their cards in addition to their mana cost.  - Turn timers in this game work similar to professional chess games. You have a timer that is only ticking when it is your turn, and you can sit and take 5 minutes to take your turn if you really want to. For those of you concerned about people intentionally taking too much time, there is a warning that pops up on the screen if you take too long and will skip your turn if you don't answer the prompt. Furthermore, the community in this game is usually pretty good about taking only the time that they need to finish their turns.   Generally good things:  - Very easy to learn, but very difficult to master. You can win the game by healing yourself, killing your opponent, or through exceptional cards that win the game for you based on specific conditions. Furthermore, the addition of a support line, blocking, and exhaustion lead to interesting strategic choices.  - Good community that is generally respectful! Very few BM finishes.  - The addition of heroes: For those of you who play Hearthstone there are classes that have hero powers. As an interesting twist in spellweaver, you can use any hero that you want to with any other set of cards; however, in order to use their hero power you have to have the adequete amount of resources. These effects range from the somewhat insignificant to the incredibly powerful in the correct decks. Furthermore, you can empower your hero to gain an addition al 2 powers that have equally powerful effects.",
            "review_score": "1"
        },
        {
            "review_text": "Great game!",
            "review_score": "1"
        },
        {
            "review_text": "the best tcg in the market hands down. all tcg aspire to be like magic the gathering but this is the only one that i can say it surpasses it in depth and creativity.",
            "review_score": "1"
        },
        {
            "review_text": "This game is surprisingly good and addictive. Very good combat system, Mix of MtG and Hearthstone but better than both in this aspect. Speed factor and support line adds a lot of depth. You can use instant efect cards during you opponents turn in selected moments. Complexity is in between these two games. Better artwork than hearthstone. But relatively small company is behind it and it is new, so somewhat less polished than Hearthstone. Currently there is a limited card pool but first expansion is coming next month. Also there is a trial mode just like arena in Hearthstone. I definitely suggest trying it especially when it is young and very generous about the golds, packs etc.",
            "review_score": "1"
        },
        {
            "review_text": "Very polished and pretty complex gameplay, I prefer it over Hex and Magic Duels",
            "review_score": "1"
        },
        {
            "review_text": "note: review after 15h played feels like magic in the 21st century!    pro: interesting mechanics, good graphics, fast progression,  arena mode, tournaments (with cash prizes!)  con: server stability, small cardbase (although they are adding new cards already)",
            "review_score": "1"
        },
        {
            "review_text": "What I wish Hearthstone had become.",
            "review_score": "1"
        },
        {
            "review_text": "I really like this game. Like a stupid amount. I just wish they would release more cards so players have more to choose from than just the basic set released with the game.",
            "review_score": "1"
        },
        {
            "review_text": "OK, so this is my first time playing a CTG online (I'm an old school MtG player from 10+ years ago) and Spellweaver was the easiest to pick up and jump right into. If you are thinking of trying this or a CTG in general, go for it! It's free, content in beginning of the game is good and you don't have to pay a penny if you don't want to. Try it out if curious, you have nothing to lose but time...",
            "review_score": "1"
        },
        {
            "review_text": "  This game is quite the mix of Heartstone, Hex, and Magic, adding it's own tweaks here and there. I think the game is fun however tedious. If you decide to spend your entire summer playing this game, go ahead and download. Only a few weeks? Download and have some fun. Just want to try? Try to find more videos and information before you download, because as with most CGs, it's a hefty time sink to truly enjoy the game.",
            "review_score": "1"
        },
        {
            "review_text": "Not recommended.   You cannot choose your starter deck. You can cannot play the 'single player' quests without unlocking the other starter decks which you pay for in $$$.  Quick play does not match you against someone with your skill level. In two hours of playing, I have not met a beginner. Take note, I define a 'beginner' as someone who has the same deck as I do since (as stated above) you have no choice in starter decks. No conversion of ingame gold (earned currency) to crystal (premium currency bought with $$$)   Would have been a great game. Plays similarly to MTG",
            "review_score": "-1"
        },
        {
            "review_text": "For the most part this is a stolen design concept game, From a TCG back in 2003, It seems to be a habit to try and revive old TGCs from the past and just doodle a new picture on the card and give it a new name, This wouldn't be so bad a thing if a little effort had been put in to BALANCE the game, Maybe this is a coincidence?. However, I have to say I cannot recommend this game while there are so many stupid bugs and laughable decks as standard, The game ( like most ) has been filtered to ensure you will need to spend real money to have ANY chance of success against other players. Especially with the regular release of new cards    Many of us had high hopes for this game, But its just another one to treat as a train journey entertainment game. I will however recommend it for that at least.",
            "review_score": "1"
        },
        {
            "review_text": "A great pay to win game. if you want a relaxing game try something else.",
            "review_score": "1"
        },
        {
            "review_text": "Here's about the best thing to say about the game. The devs really, really, really tried to do something different in TCG's. Unfortunately, they failed horribly. Why? Read on.  1. The biggest culprit is the speed system. Unlike every other game on the planet, your cards can't attack every other card. There are 4 speeds in the game, and each speed can attack their speed rating or lower, never ever higher though. The devs list this as a plus because they counter-balance it by making the heavy hitters slow while the fast units won't do that much damage. Here's the problem. They do a lot of damage, and they're cheaper than the heavy hitters. You also have the usual pump spells to make them do a lot more. So, you're going to gravitate towards the decks that have a bunch of them (Nature, Order, and Vampire/Purple).  2. 'But if I survive and get my big creatures down, I'll still win.' WRONG! Here's where the speed system really, really falls apart. Say I have 2 4/4 units that are speed 1, and you have 4 speed 2 units. My 2 4/4's can only attack your hero. This means I get to gang up on your unit and kill it once you attack, or I can just put one unit to chump block it. 'Well, I'll just wait and block your squishy units and dominate the field.' Nope. You can't block any of my units because they're faster. Wait, it gets worse.  3. Okay, I'll just play speed 2 units (what most of the units are btw). Then it comes down to who gets to buff their creatures first AND attacks first. See, if the units are the same speed, the attacker dominates. Why? Well, they get to pick which creature they attack, and unless you have a unit with a higher speed than the attacking unit, you can't switch defenders EVEN IF THEY'RE THE SAME SPEED. So, say you've buffed your units and can eliminate the opponent's units next turn. Ha! You're a turn too late. They attack your guys in the only way you lose everyone instead of wiping them all out. So, you get to watch your troops get slaughtered and can do nothing. Frustrated yet?  4. The Trial system is exactly as horrible as the Arena system in Hearthstone was. You get all the lousy rares/epics to choose from while your three opponents (same 3 loss system) have as close to a constructed deck as possible. Yep, it is just so much fun to see your deck that took 10-15 minutes to build and cost 17.500 gold or a ticket get waxed in 8 turns. Plus, you're required to play 2 colors, and you're randomly assigned them. With a few colors just being way worse than others, you could be screwed from the start, or face someone that got two of the best colors. Ugh.  5. The rarity system needs work. There are just some rares that will never hit the board. Why? They cost too freaking much. One of the best things the devs did is make it that every single time you play a 'land' for mana, you draw a card. If you play it for a crystal though, you don't draw a card. That means you want to play only 2 crystals max. Great, let's look at the rares. Oh look, 3 crystals, 3, 3, FOUR, 3, 3, 3, etc. Granted, some of the 3's are very good, but there are only a few colors that have card draw seperate from just playing mana. That also tips some of the decks from good to great and mediocre to bad. If the rares cost like 8 mana and 2 crystals, that would be infinitely better than 5 mana and 3 crystals.  6. This is something that you'd think would be a positive, but it is going to end the game. You don't need to ever spend money on the game. It is truly F2P. The AI in the PvE part are just horrible to the point that you'll win with even the lousy colors. Play on hard, and you get 500 or so gold per fight. Combine that with the free daily quests you get to choose between, and you could get a 10-card pack per day easily without ever facing a human. And you really don't want to.  7. Why? Well, because the beta players will wipe the floor with you. They have all the cards and know the game inside and out. There isn't a huge player base meaning you're more likely to run into them. And if you are starting with one of the lousy colors, you'll get really wiped fast. Certain decks can hold their own if you luck into the right good rares.  8. The card base is way too small right now. You'll have 3-4 of every non-rare/epic by the time you reach level 10. Again, no reason to ever spend money. The game itself gives you almost every rare from just completing the 3 starter quests per color.  Again, they tried very hard to bring something new to TCG's, but it just didn't work. With it really being F2P, I can't imagine they will have enough capital to keep the servers running for long. They were already having server issues that they had to fix. If you want a TCG that either has no challenge or brutal difficulty that you don't have to spend any money on, this game is for you until the servers go down from no one spending any money. Otherwise, find a different game.  Note: This is someone that beta tested Hearthstone and played MTG for over a decade building all my own decks. I wouldn't call myself an expert at TCG's, but I'm not a novice.",
            "review_score": "-1"
        },
        {
            "review_text": "Art: 5/5 Music: 1/5 Engine: 4/5 Battleground: 1/5 Servers: 2/5  Pay 2 Win?: NO Pay 2 Play?: NO Community its ok?: NO Devs?: ULTRA NO Achievements Level? Medium,and you need time to earn it(achievements hunters stay away from this game) Fun game?: YES Can you collect all cards without pay?: YES Can you REKT opponents with highest level? YES Strategy or luck?: 70% luck/30% strategy ",
            "review_score": "-1"
        },
        {
            "review_text": "Locked 30 FPS. No real trading, must buy packs from game or craft (similar to Heartstone). No PvE to speak of except a few boss batles of high difficulty. Gameplay is not very intuitive and the tutorial does not let you play as you wish even if your move would be better and end the match faster. The UI could really use some redesign. The hero portraits take too much space and so do the cards at the bottom, meanwhile the board is too small or we are zoomed too far. A small plus for the moving animation of the board though.  Interesting take on the mana curve, but it seems to heavily favor aggro decks. Not a big fan of the general pricing on packs, although they seem to give gold more generoulsy than Hex or Hearthstone thorugh 'trials', but once that's done...  Overall, I think this game is vastly inferior to Hex: Shards of Fate and Hearthstone, but better than the rest of offically launched TCG/CCG. As Faeria and Duelyst release officially soon, Spellweaver will end up way behind in 5th position in my book.  If I could vote 'mixed', I would, but alas I can only choose yay or nay and it's clearly much closer to nay.",
            "review_score": "-1"
        },
        {
            "review_text": "Realy good game or to be precise: 'disconnect from server' simulator. More stability can be found in plutonium.",
            "review_score": "-1"
        },
        {
            "review_text": "I was expecting a cheap MTG clone and i got a cheap MTG clone. ",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ this game. I go face, no damge found they nerf my fire class ♥♥♥♥ my life unnistal now! ",
            "review_score": "-1"
        },
        {
            "review_text": "The game for the most part is good. The grinding is not bad and the daily quest are not bad, but the greats reason why i would never recommend this game is the server instability, I have lost multiply games because the server drops during my draft or ranked game. As a causual game it is good, but if you would want a serious game you should look some were else.",
            "review_score": "-1"
        },
        {
            "review_text": "Tried game.  Picked nature. Opened like 10 packs. All nature cards were like 2attack 2HP creatures. Not a single 3attack 3HP creature.  Couple matches vs AI.  AI spews 3/3 3/5 4/5 and then 1/1 that turned into 7/7.. GG wp, buy more packs :)  /uninstall. Maybe i picked wrong class but 10 packs should give me plenty of stuff not, nothing..",
            "review_score": "-1"
        },
        {
            "review_text": "same card copy game we seen so many of.. cash try so nothing worthwhile (nice resources system though)",
            "review_score": "-1"
        },
        {
            "review_text": "This game is horrible, the speed mechanic is the worst I have EVER seen in any TCG EVER, I highy do NOT reccomend this game, STAY AWAY!",
            "review_score": "-1"
        },
        {
            "review_text": "Currently this game is so unstable it is unplayable. It crashes left and right and you DC from matches left and right and can't even pick up where you left off. This game was pushed into release to the masses it should be able to be played",
            "review_score": "-1"
        },
        {
            "review_text": "Hearthstone is still better you can craft a good deck pretty easy, on this game you will take a week or two since it really encourages people to subscribe and to buy packs.  From one of the reviewers: '“Spellweaver: Hearthstone &amp; Magic: the Gathering had a baby!”  NoxiousGLHF '  More like p2w from hearthstone meet's magic but weird rules, as far i have played when your opponent use a spell on your minion you cant even use your minion ability and that's pretty bad if you compare with magic.  So this is just another money grab card game it may be fun for some people but i really dint liked some mechanics and i will just keep playing hearthstone or magic.",
            "review_score": "-1"
        },
        {
            "review_text": "Decent gameplay, it is really possible to play for free without problem, just make sure you level up to unlock the different decks and do the quests. Once you have done that new ones will pop every day or so for each factions and will allow you to gain gold or packs for free on a regular basis. I barely paid anything and I have all leaders and about half of the max amount of epic you can get.",
            "review_score": "1"
        }
    ]
}