{
    "app_id": 429620,
    "name": "Dungeon Rushers: Crawler RPG",
    "release_date": "2016-09-06",
    "developer": [
        "Goblinz Studio"
    ],
    "publisher": [
        "Goblinz Studio",
        "WhisperGames"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Online Multi-Player",
        "Cross-Platform Multiplayer",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Workshop",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards",
        "Includes level editor"
    ],
    "genres": [
        "Indie",
        "RPG",
        "Strategy"
    ],
    "tags": [
        "RPG",
        "Dungeon Crawler",
        "Strategy"
    ],
    "achievements": 25,
    "positive_ratings": 609,
    "negative_ratings": 252,
    "price": 10.99,
    "description": "A Heroic-Parody tactical RPG combining dungeon crawler’s gameplay and turn-based fights. Dive in an off-beat universe, manage your team and craft mighty gear to equip them! Build your own dungeon by hiding traps and monsters in your galleries, then challenge other players to clean it!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/429620/header.jpg?t=1552896263",
    "minimum_requirements": "OS: Windows Vista Processor: 1,3 GHz CPU Memory: 1 GB RAM Graphics: NVIDIA GT 440 or AMD Radeon HD 5550 w/ 512 MB DirectX: Version 9.0c Storage: 1 GB available space",
    "recommended_requirements": "OS: Microsoft® Windows® 7 Processor: Dual-core 2Ghz CPU Memory: 2 GB RAM Graphics: DirectX® 10 compliant graphics card DirectX: Version 9.0c Storage: 1 GB available space",
    "reviews": [
        {
            "review_text": "tl;dr: one of the least fun games I've bought in the past year  What is the game like?   It's a grindy smartphone game. You follow a fixed path from dungeon level to dungeon level, stomping the monsters and finding the treasure chest in each one. There is a challenge for each dungeon along the lines of, 'Do it without losing anyone, drinking healing potions, or triggering a trap.' If you win the challenge, you can play it again on 'heroic' level. It has some bugs and runs slowly.  But the graphics are hand-drawn and jaw-dropping, right?  It is 'old school' which here means 'bad graphics.' It uses tile-based maps and a JRPG combat field.  So... deep character creation? Customization?   Sorry, nope. You pick up heroes in dungeons along the fixed game path. You can add stat points to them when they level up. You can't even change their name or icon. Later you have more than 5 guys, but you can only bring 5 at a time, so that means there's some tactical gameplay somewhere.  But I'm sure the combat makes Divinity: Original Sin look simple, because it's deep and strategic, right?  Not especially. It's turn-based JRPG combat where each piece moves once, using one of three skills that are pre-set for the character. You can find similar ones on free online games on the internet.  But there's crafting and loot -- so that's awesome, right?   Well... no. You get a set of about 12 items per region that you can buy or craft. They are fixed items, with no modifications or options. By the middle part of that section you'll have all the best items the region can offer, and then you just wait to finish enough dungeons to get to the next part of the map where you get 12 more items.  Is it funny? Because they say it's funny. And 'off-beat.'  Oh lord no. It's like listening to seven-year-old boys. 'Are you a really a vampire? But you walk in the sunlight with us!' 'Oh,' little-girl giggle, 'I wear sunscreen! Really it's wrinkle cream, so I don't get older!' 'Let's hit our bard because he's annoying!'   So is there anything good about this game?   I kept hoping it would get better, but it didn't. It would be a decent tablet game for $1.99 if you needed something to kill time on an airplane. Maybe. I got bored. I'm not sure why so many people seem to like it.",
            "review_score": "-1"
        },
        {
            "review_text": "A game where you need to plan your every move in a dungeon.   Although it becomes a bit repetitive after around level 4. Maybe reduce the XP growth a bit. Grinding around level 5 now. :(  And maybe customize the characters skills..  I like the dungeon mode of this one but the characters are very shallow.  But I still recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "pros: -the game has a sweet artstyle -it has an interesting movenment mechanic -alot of the dialogue i've come across is humorous -the game runs on sprites,wich could mean that a feature to create custom characters with custom sprites could be added in the future -you quickly figure out who of the enemies you need to take down first (crossbow skellies &gt;.&gt;) -character abilities suit most of the characters -the music is pretty good in some levels.   cons: -leveling is unbearably slow,it feels alot like padding (even early in the game),it took me 3 real life hours to get 3 characters to level 3. -you quickly feel underpowered to take on the dungeon up ahead. -some character designs are very uninspired,thorgimli's design goes without mentioning. -as i mentioned earlier,character abilities suit them,such as melinda's early attack,this suits the idea of her being a vampire and being fast BUT it doesnt suit her ability to heal after finishing an enemy and it also sort of conflicts with her tiny healthpool,she oftenly got herself killed before being able to heal herself. -the music feels lacking at first,but it quickly takes a u-turn and becomes good. -every character has only 3 abilities,wich makes the player grow tired of new characters. -the repeated joke of everyone hating the character 'pod' is unfunny and honestly the two characters that seem to hate him the most (mellinda and thorgrim) go with him the best,very quickly i felt bad for pod,and got kind of annoyed with mellinda('s dialogue writer)  things that could make the game alot better (and actualy worth the price) : -allowing players to creat custom sprites and turn them into playable characters,npc's for dungeons and more -allowing players to create custom storylines using custom sprites -allowing players to assemble teams with playable characters,and let the player switch between teams whenever -speed up the leveling   i still love this game and recommend it,but the cons are severe and it realy makes me have to say,get it when its on discount,it still has a lot of flaws.  4/10",
            "review_score": "1"
        },
        {
            "review_text": "It feels a bit grindy at times, but the variety of characters makes the game less repetitive, which is a good point!  Good game.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting to begin with but rapidly realize incredibly linear and progression controlled. Heroes level up tediously slowly an little point in learning most skills. Compounded by the fact that the level challanges are largely centered around on not using certain ones as well.   Crafting again is heavily controlled and only able to craft tier 2 items once in tier 2 area and so on, heavily limiting any value to repeating earlier areas to gain strength. Could at least do with a way of combining lower level ingredients into higher ones.   Multiplayer elements seem under thought out. Wait until patched or heavily discounted in sale.",
            "review_score": "-1"
        },
        {
            "review_text": "If you enjoy Darkest Dungeon, I would recommend this game.  I really like how you can craft your own weapons/armor/amulets etc. using loot &amp; items you find whilst in the dungeons with the Blacksmith, or just buy the items with gold from the available Shop. Bonus challenges for each dungeon keep it interesting. A nice little sandbox type area in the Workshop where you design your own dungeons for other people to play. Multiplayer in the Arena to challenge others.  Overall a fun experience.",
            "review_score": "1"
        },
        {
            "review_text": "I don't like the game. Not enough actions.",
            "review_score": "-1"
        },
        {
            "review_text": "    This game was reviewed using a code sent by the developer/publisher but this will   NOT   effect my opinion/review on this game",
            "review_score": "1"
        },
        {
            "review_text": "Neat story and game",
            "review_score": "1"
        }
    ]
}