{
    "app_id": 42980,
    "name": "Victoria I Complete",
    "release_date": "2010-08-20",
    "developer": [
        "Paradox Development Studio"
    ],
    "publisher": [
        "Paradox Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Multi-player"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Grand Strategy",
        "Real-Time with Pause"
    ],
    "achievements": 0,
    "positive_ratings": 88,
    "negative_ratings": 41,
    "price": 7.99,
    "description": "Carefully guide your nation from the era of absolute monarchies in the early 19th century, through expansion, colonization and social upheaval, to emerge as one of the great world powers by the dawn of the 20th century in Victoria Complete.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/42980/header.jpg?t=1447353440",
    "minimum_requirements": "OS: Windows 98SE / 2000 / XP (Does not support Vista / Windows 7 / ME)Processor: Pentium III 450 MHzMemory: 128 Mb RAMHard Disk Space: 600 MB Free Hard Drive SpaceVideo Card: 4 Mb Video Card DirectX CompatibleSound Card: DirectX® compatibleCD ROM: DirectX 9 or higherController support: 3-button mouse, keyboard and speakersSpecial multiplayer requirements: Internet Connection for multiplayer",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Victoria, I played this game (have an old disc) for many hours back when I didn't have a good gaming PC, but when I had a ♥♥♥♥♥♥ PC. This game taught me how to enjoy classical music, real classical music, not modern classical music.  This game also taught me that you have to forge Germany out blood and sweat and then forge the world into the Germans by blood and sweat.  This game is a classic Paradox game and is a great game to play.  Great game.  Very great.",
            "review_score": "1"
        },
        {
            "review_text": "The only game I played for years and years. (pre-Steam) Get past the steep learning curve and the world is your oyster.",
            "review_score": "1"
        },
        {
            "review_text": "Accidentally caused a riot because I clicked a popup by mistake.",
            "review_score": "1"
        },
        {
            "review_text": "No reason to get this game beyond wanting a complete set of something. If you enjoy games like this, get Victoria 2. Some of the worst aspects of Victoria 1 are fixed in that game, and it is similar enough that you will not gain much by playing Victoria 1. Personally I bought it because I enjoy Victoria 2 so much I wanted to see #1 and compare it. I have no regrets.",
            "review_score": "-1"
        },
        {
            "review_text": "Whose eyes are those eyes?",
            "review_score": "1"
        },
        {
            "review_text": "Not a very fun, interactive game. If you want a good game based on the 19th Century, get Victoria's Successor: Victoria II",
            "review_score": "-1"
        }
    ]
}