{
    "app_id": 4300,
    "name": "RoboBlitz",
    "release_date": "2006-11-07",
    "developer": [
        "Naked Sky Entertainment"
    ],
    "publisher": [
        "Naked Sky Entertainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Partial Controller Support",
        "Includes level editor"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Puzzle"
    ],
    "achievements": 0,
    "positive_ratings": 43,
    "negative_ratings": 14,
    "price": 5.99,
    "description": "RoboBlitz&trade; is a humorous, physics-based action game full of inventive gizmos, weapons, characters, and environments. Players take on the role of Blitz, a multi-talented robot who must activate an aging Space Cannon to save his world from a band of maladjusted space pirates.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/4300/header.jpg?t=1447350932",
    "minimum_requirements": "This game is built on the Unreal&reg; Engine 3. While installing RoboBlitz, you may be prompted to download and install the latest video drivers.  Microsoft&reg; Windows&reg; XP SP2, Intel&reg; Pentium&reg; 4 2.0GHz or AMD Athlon&trade; XP 2000+, 512 MB RAM, 400MB Hard Disk Space, nVidia&reg; Geforce&reg; 6600 or ATI Radeon&reg; X800 Video Card with 256 MB RAM, DirectX Version 9.0c Recommended: Microsoft&reg; Windows&reg; XP SP2, Intel&reg; Pentium&reg; Extreme Edition 3.2GHz or AMD Athlon&trade; 64 X2 3800+, 1 GB RAM, 400MB Hard Disk Space, nVidia&reg; Geforce&reg; 7800 or ATI Radeon&reg; X1800 Video Card with 256 MB RAM, DirectX Version: 9.0c Supported Video Cards: ATIRadeon&reg; X1950 XTXRadeon&reg; X1900 seriesRadeon&reg; X1800 seriesRadeon&reg; X1600 seriesRadeon&reg; X1300 seriesRadeon&reg; X850 seriesRadeon&reg; X800 seriesMobility&trade; Radeon&reg; X800 XT seriesMobility&trade; Radeon&reg; X1800 XT seriesMobility&trade; Radeon&reg; X1800 seriesMobility&trade; Radeon&reg; X1600 seriesMobility&trade; Radeon&reg; X1300 seriesMobility&trade; Radeon&reg; X800 series NVidiaGeForce 6600 seriesGeForce 6800 seriesGeForce 7600 seriesGeForce 7800 seriesGeForce 7900 seriesGeForce 7950 seriesGeForce Go 7400 seriesGeForce Go 7800 seriesGeForce Go 7900 series",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I just bought this game only to write a review on Steam. I finished it years ago and I still remember how fun, addicting and joyful experience it was. A game full of humor, action, and puzzle solving. If there only were achievements... I would have got 'em all for sure! I remember I cried when I finished it. Just don't remember was that because of fun or drama... You know what, I gonna replay this gem title once again just to find that out. Ten stars.",
            "review_score": "1"
        },
        {
            "review_text": "TLDR: DO NOT GET THIS GAME ON PC. GET IT ON THE Xbox360 INSTEAD BECAUSE THE PC PORT ISN'T POSSIBLE TO FINISH BECAUSE OF THE BOSS FIGHTS THAT DON'T WORK.  This was the first game I'd ever bought on XBLA as a kid, and it's still one of my all-time favs. As soon as I saw it on Steam I knew I had to get it, and I was VERY dissapointed with the PC port.  Here's the good things about the PC port.  -Make your own levels  -Play the game with headphones (And be amazed by the fantastic soundtrack)  -Turn up the graphics to the max which makes the game look better than on the Xbox360  -Play the game with a MUCH higher framerate so the controls feel much tighter and more responsive  But, then there's all the problems with the PC port. (These problems are not on the XBLA edition which I recommend you get instead)  -Dashing doesn't work quite right.  -Buggy boss fights. Here's some examples of them:  One boss got stuck and I had to nudge him out in order for him to get to where he needed to go in order for the final stage of the fight to start.  Another boss isn't even possible to finish (And therefor making the game impossible to finish) You're supposed to get it to charge at you and smash into the gears you're standing above, but it doesn't charge, it just slowly hovers towards you instead, meaning that it doesn't get the impact on the gears needed to finish that stage of the boss fight.  The rest of the bosses are just as frustratingly buggy making the boss fights completely unplayable.  0/5 - Impossible to finish. Get it on XBLA for the Xbox360 instead",
            "review_score": "-1"
        },
        {
            "review_text": "HAHA IS THIS A JOKE !?",
            "review_score": "1"
        },
        {
            "review_text": "RoboBlitz started off with a lot of potential. Labeled a puzzle/action game, I expected to fall madly in love with it. With a Metascore of 80? Even better! I booted up the game with enthused anticipation and found myself thoroughly enjoying the first thirty minutes... and then it all went to hell.  The entire plot involves you, as a robot, trying to repair a cannon on your spacecraft so that you may exterminate an evil extraterrestrial entity. There are six components to acquire, each of them preceded by two 'puzzles' and a boss fight.  First and foremost, the puzzles in this game should hardly be considered puzzles. All you're tasked with is moving objects from point A to point B. The difficulty comes from the terrible physics and frustrating controls. For a game that relies plenty on object manipulation, these flaws are a huge deal breaker.  Of the many games I've played, this is one of the few I just can't bring myself to recommend unless you want to test your patience.  Grade: C-",
            "review_score": "1"
        }
    ]
}