{
    "app_id": 430960,
    "name": "Lucy -The Eternity She Wished For-",
    "release_date": "2016-02-28",
    "developer": [
        "Modern Visual Arts Laboratory",
        "SEO INSEOK"
    ],
    "publisher": [
        "Modern Visual Arts Laboratory"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Casual",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Visual Novel",
        "Anime",
        "Dating Sim"
    ],
    "achievements": 0,
    "positive_ratings": 5341,
    "negative_ratings": 238,
    "price": 6.99,
    "description": "If there was a robot that could laugh, cry and smile. ...Does it have a soul?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/430960/header.jpg?t=1539564278",
    "minimum_requirements": "OS: Microsoft Windows 2000/XP(SP3)/Vista Processor: Intel Pentium 4 1.5Ghz/AMD Athlon 1800 Memory: 128 MB RAM DirectX: Version 9.0c Storage: 1 GB available space Additional Notes: Microsoft .Net Framework",
    "recommended_requirements": "OS: Microsoft Windows 7/8/10 Processor: Intel Pentium 4 2.0Ghz/AMD Athlon 2400 Memory: 256 MB RAM DirectX: Version 9.0c Storage: 1 GB available space Additional Notes: Microsoft .Net Framework",
    "reviews": [
        {
            "review_text": "Never has any piece of media made me experience so many emotions in such a short span of time. I went from mildly interested, to completely invested in virtually no time since the writing in this VN was so spectacular.  Then, once Lucy had her claws in me, the feels trip didn't stop. I flew between the emotions of happiness, anger, and sadness faster than I even knew I could.  Then, when I finally achieved the true ending, I couldn't have been more satisfied.   And just as a side note, I will never forgive that prick of a father. The whole time I was playing through 'Reunion' I was hoping for the old ♥♥♥♥er to fall and break a hip or something. XD  10/10 would sob in the most unnatractive way possible again",
            "review_score": "1"
        },
        {
            "review_text": "Masterpiece. What other word can I use to describe it? This game makes us question what fundamentally makes us human, what makes us alive. We can reduce a human being to being a simple chunk of autonomus flesh if we wanted to. We can reduce everything down to particle physics. But sometimes, it's hard to believe such simple things can create something so complex such as emotions. If we were able to replicate emotions on a machine, then will it be a machine pretending to have emotions? Or a machine capable of having emotions? To believe that machines are capable of having emotions is like denying that humans are a special existence.   Lucy -The Eternity She Wished For- is a very well made visual novel. The art is pretty. (The sprites show a range of emotions to represent what they are feeling.) The music is very good and the Japanese voice acting is also amazing.   If anyone has ever watched an anime called Chobits, I think you will find some similarities between the two.   If you like visual novels, anime etc, you would most likely love this. And when you play this game, expect an emotional ride.",
            "review_score": "1"
        },
        {
            "review_text": "First game to make me cry... 11/10",
            "review_score": "1"
        },
        {
            "review_text": "Bought this Visual Novel not knowing what to expect but let me tell you all who reads this review: It is simply amazing. The story is both intriguing yet very engaging and they are moments where this visual novel makes you feel emotions. I played through this and I encountered a great fluidity with how the story progressed. I would rate this 10/10 and would definitely recommend this to anyone looking for a visual novel to play or to anyone looking to get into visual novels.",
            "review_score": "1"
        },
        {
            "review_text": "Very touching and compelling story with interesting parallels to our world. the story telling is special in the way that you experience the story and parts and ends are filled in or revealed as you progress  11/10 My mom walked into my room seeing my crying. She thought it was because I've been unemployed for a year, jokes on you ♥♥♥♥♥ cause I'm never going back to work and an anime robot girl broke my heart,",
            "review_score": "1"
        },
        {
            "review_text": "Short visual novel but it's a good game, if you want feels, go right ahead, if you didn't get any feels, another game should do then.",
            "review_score": "1"
        },
        {
            "review_text": " 'In a world full of Androids... It may be humans who become obsolete'",
            "review_score": "1"
        },
        {
            "review_text": "Best Visual Novel Game 2016.  Better than To the Moon.  Thums up.",
            "review_score": "1"
        },
        {
            "review_text": "// I finished the game from Playism, so ignore my playtime, it was just so I could post this review.  I loved the game. It was an amazing experience. It begs the thought provoking question: 'Where do androids end and humans begin?'  Although I have some gripes with it, like some characters not being explored, and the lack of an auto function, it's very enjoyable as a whole, and I hope to see more novels from MVizLab soon.",
            "review_score": "1"
        },
        {
            "review_text": "Blade Runner meets Clannad. The writing isn't anything to write home about at start, and the viewpoint character seems like a total unlikeable ♥♥♥♥♥♥, but give it time. It gets better when the story progresses and the ending is simply amazing. I hope a lot of people will buy this game and give it the chance it deserves, it was truly one of the most pleasant surprises of the last few years.",
            "review_score": "1"
        },
        {
            "review_text": "*It's sad, say it's sad* because it is sort of a spoiler but being sad it's what make this game interesting.  Absolutely recommend this. This was my first South Korean VN purchase and I really enjoyed it. Will certainly buy more from this developer in the future.",
            "review_score": "1"
        },
        {
            "review_text": "Emotionally rich story, amazing artwork, beautiful music. I was unprepared for all the feelings I'd endure during the game. If you enjoy characters who are loyal, cheerful, silly and accepts you no matter what, then take the time to know Lucy. I've cried tears of happiness and heartbreak. Rating this game 22/10 stars.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful.   I haven't played a Visual Novel in a bit of a long time, I picked this up in the sale on a whim, and I am glad I did.  The story is something special, that will stick with you, long after you finish it, it handles the story and theme very maturely. No, it isn't the first VN or general media to tackle this topic, but this does it very well.  There is a full Korean and Japanese audio voices, with English subtitles.  Translation wise, I can't say much, I do not speak Korean or Japanese, But I understood all of the subtitles and everything made sense.  I cannot recommend this game enough, and highly suggest you pick it up, I will certainly be re-visting this VN time and time again.  Beautiful.",
            "review_score": "1"
        },
        {
            "review_text": "First of all, I must say the visual novels are not the kind game for everyone. In some aspects, they could be described as not being a game at all. I get that for some these may not be their cup of tea.  But for those who like a story in it self, and for it self, and have the patience to read (or listen) every word, of every text, in order to fully grasp the depth and the meaning of a story... visual novels can be very rewarding.  I think that the reason why you pay for games. ultimately, is to have some kind of rewarding feeling for playing them. Be it for being entertaining, for being challenging, for making you happy or for making you sad, it's that rewarding feeling that makes it a good game.  For me, this one was rewarding. So for me, this one was a good game.",
            "review_score": "1"
        },
        {
            "review_text": "Bring Tissues.",
            "review_score": "1"
        },
        {
            "review_text": "Oh boy, I have to admit, this visual novel is really under rated, not much people have bought this visual novel, although the reviews were nice, it wasn't what this one's worth... To be honest I'm surprised that it turned out to be such a detailed and refined visual novel, at the start I expected a normal robot and human romance story where the end would be sad, either the robot breaks down or it dies in an accident... In fact, it was the robot that chose it's own end, if you're a man of seeking a sense of sadness to make yourself cry to relieve stress, this is the perfect visual novel.  Here's why I like this visual novel and anything it can improve on :  Enjoyables : -The translation was perfect, it perfectly showed the emotions of Lucy and it was definitely unexpected out of this visual novel. -Korean vocals recorded by Emily was definitely superior, she had put great effort into mimicing a robot's way of speech, but it wasn't the normal type of robotic speech, although the words were robotic and formal, it was human, you could hear the hesitation when scolded by the master, it's plain and enlightened mood, a really fantastic vocalist! -Although there were only 6 main characters that's actually relevant to the main story (you, lucy, father, mother that doesn't care about 'you', your friend baek and the young engineer that repaired lucy), they were all designed in details, their art was nice, definitely, but what's of more is that their way of speech really reflects the reality of the future society in the story, although they loved and enjoyed robots and andriods, they did not forget the difference between human and machines, which made 'you''s love towards lucy look sinister but charming. -Music was definitely out-standing, matching the moods properly and bringing the tone of sadness with a sense of calm peace. -[SPOILER ALERT]The story ended with a sad end with lucy being burned down by father, but there's actually a 'true end' towards this where lucy is repaired, even if the story script was set that lucy was 'beyond repair', the MC actually spent the next 15 years of his life researching and learning about andriods, so that he could repair lucy and one day, lucy actually remembered the lost part of her memory card, despite the impossible. ^-The end was actually the most enjoyable part, although the twisted end was a scene where you should let your tears fall, it doesn't only bring sadness via sadness, the happy end after the sad end was quite a suprise and you'd cry even harder after knowing that this end was possible ( remember to watch the extra story scenes! ).  Things this game should improve on : (well I can't really complain about this game, it's truly a master piece and don't expect erotic scenes, it's plain romance and comedy with a twist of sadness, but very very well detailed.)  -Could've made some special events, instead of making daily school life changes as the story. -There was literally no mentioning about the life with his past mother, whether he forgot about it or the story didn't mention about it, I hope there would've been more hints about his deceased mother. -Was a dissapointment that the vocals weren't in japanese, but korean vocal is rather pleasing with emily's sweet tone :d -Wastes a bit of time doing scene changes when you could've just skipped the animation, aka. unnessecary scenery changing animations &gt;:C  That's all I can think of &gt;.&lt; I'm sorry for my inexperience in writing these but I'm writing what I truly think, I hope this helps you into deciding whether you should buy this game or not, it's a game that's definitely worth your money and time, it's longer than the normal visual novels you expect, although it's one of those sad end visual novels, those who are under reality stress, please use this as a relief of pressure, crying or knowing something sad would definitely help you express your emotions better! Lucy - The Eternity She Wished For is definitely worth your money even at full price, although I would highly suggest you to buy it during sales, it would be best to buy it full priced and show support to the creators :D Enjoy and have a nice day!",
            "review_score": "1"
        },
        {
            "review_text": "take an irrepressibly optimistic android, fill a story with her kindness, and add a change of heart  and you have this visual novel......  she is so sweet, kind, caring, but also irrepressibly optimistic even when the situation is burning with flaring tempers......  if you give her your heart............you'll lose your heart by the end (it's like chobits, plastic memories, and a dash or two of 'your lie in april' put together)  'Please support me, in this moment........I'm about to lose heart!'  'If you think pictures are not important.......wait until.......they are all you have left!'  20/10 SO BEAUTIFUL....... october 12 is the HAPPIEST and SADDEST day.......",
            "review_score": "1"
        },
        {
            "review_text": "Lovely game.",
            "review_score": "1"
        },
        {
            "review_text": "Ok so here I am doing this, first of all when you read Lucy you need to read it from a psycological perspective   Lucy is great, you should give it a try, even read the title THE ETERNITY SHE WISHED FOR bring some water to my eyes, be calm Xelam, be calm.  the music dosen´t really help, is so good that moves you.  I read many VN in my life but belive me, Lucy is one of the best    You need to see Lucy as the Human, in a society that turns humans into robots, we can see our avatar, saying thats not the logical way, or this is not logical, our character is only a machine with flesh, Lucy on the contrary, she see the world with a human perspective, she can enjoy a sunseth even on a poor street when the father and your character arguee, Lucy is the only who see the true path, many people complain about the character adtitude, because its feels unnatural, I see Lucy as a critic to modern society where we are turning more and more like robots  .    ",
            "review_score": "1"
        },
        {
            "review_text": "Be ready for dem feels, making you feel both overjoyed and heartbroken. Fantastic game!",
            "review_score": "1"
        },
        {
            "review_text": "I couldn't tell if I was in Japan, Korea, or somewhere else. Whatever the case this is an amazing game.  Don't just experience it, learn a thing or two from it. And (optionally) cry a little.",
            "review_score": "1"
        },
        {
            "review_text": "There were three phases of me playing this game: 1. Yea, a story about a counflicted guy and his robot, it's nice. 2. The ending almost got me crying, nice try game, but you won't defeat my manliness! 3. EVEN A MAN CAN CRY OK?!?!?! *sob sob* *for sceptics, this game really gets better at the end-the END type of end, be patient*",
            "review_score": "1"
        },
        {
            "review_text": "What an lovely heart-filled visual novel! I hate to admit this but, this story about a soulless object actually make me cry and think about my whole existence. PLEASE DONT JUDGE this beautiful artwork. You might hate this game becuase of the ending or characters. but I promise you that IT will play out at the end!~THANK YOU FOR THIS GAME",
            "review_score": "1"
        },
        {
            "review_text": "I would this is the most amzaming visual novel i have ever seen.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best visual novels that i ever played...... I can't explain how it feels when you finish this game, everyone who like visual novels should play     10/10",
            "review_score": "1"
        },
        {
            "review_text": "Should I buy this game? Yes, it is. Personally, I have experienced the same feeling as when passing, for example Kanon. But the ending is not very clear. Strong are moving dates. My rating 49/35",
            "review_score": "1"
        },
        {
            "review_text": "Should I buy this game? Yes, it is. Personally, I have experienced the same feeling as when passing, for example Kanon. But the ending is not very clear. Strong are moving dates. My rating 49/35",
            "review_score": "1"
        },
        {
            "review_text": "creyed",
            "review_score": "1"
        },
        {
            "review_text": "It was a cute game, nice drawings, and had diffrent paths. I only have two prolblems with this game, 1. You don't get many options and options hardly come up. 2. There is to much talking and less playing.   Other than that the charecters are great, it has a rich story, and it has cute and sad parts. If I was to put a scale on this game it would probably be 3/10 negative 7/10 great.  I recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "Not serious review: The Railroad would be proud.  Serious review: It has its pros and cons, but being somewhat cheap, I don't mind the purchase. I haven't played much, and will update this review as I progress in the story, hopefully spoiler free. So far, the visuals are great, the SFX are good, and they change the background quite a bit for a visual novel. My only irk is that the MC is really frusturating. This might change though. I think it is worth a buy.  10/10 would sentient robot again.",
            "review_score": "1"
        },
        {
            "review_text": "The art is pretty and the story is beautiful and emotional. Would love to see more visual novels from the developers because i thoroughly enjoyed this one.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "A short, but well-made touching VN. Nice 3 hrs of reading.",
            "review_score": "1"
        },
        {
            "review_text": "Good Graphics. So far I like the story. Surprisingly I prefer Japanese voice compare to the korean ones. It sounds cuter :3",
            "review_score": "1"
        },
        {
            "review_text": "The writing is just far too horrible for a VN. Unfortunantly this great medium has a reputation of poor writing and this is no exception. Specifically in regards to the protagonist. There is far too much exposition in the protagonist telling the audience how he is feeling when the events depicted are enough to allow the audience to discern that. There is no subtlty. The writer seems hell bent on violating the rule of 'show, don't tell.'   A shame since the idea of the story is fine and the character of Lucy is interesting enough. Though she's very much a slave character, which puts a bad taste in my mouth.   Also no english dub.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a picture book that outlines some of humanities flaws. I understand that a little is lost intranslation, but it's clear the authers are intellegent. The interaction points don't seem to change the plot, but are well done as is the art.   I'm a huge fan of the old style 'choose your own adventure' books and I like subtitles because they help me learn other launguages. I'd LOVE to see full adventures done in this style, The bigger and the more choices and greater the differnces they make on the story the better the re-read-ability / listen.  So over all I'm pleased with the idea, but dissapionted with the story. I'd like to work with the devs on projects like this. With a few minor changes this format could redo all the classic novels for all age groops, and mabe we could try to make them end the way we (the reader's) want :) (or better yet twist our decisions to get us to see the errors in our ways).   Lots of potential, a change of pace, but i think they missed the mark on this one.... But keep trying !!!",
            "review_score": "-1"
        }
    ]
}