{
    "app_id": 431330,
    "name": "Dungeons Are Random",
    "release_date": "2016-01-05",
    "developer": [
        "PIXELBUG"
    ],
    "publisher": [
        "PIXELBUG"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Indie",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Action",
        "Indie"
    ],
    "achievements": 0,
    "positive_ratings": 11,
    "negative_ratings": 15,
    "price": 1.59,
    "description": "Dungeons are Random is a fast-paced roguelike game, where everything is meant to be generated as randomly as possible, while still being enjoyable as a game. It's a mix of a roguelike and an action-rpg game: you improve your hero by running around and fighting monsters, while venturing endless, randomly generated...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/431330/header.jpg?t=1457076025",
    "minimum_requirements": "OS: Windows 7 Processor: 1.6 Ghz Memory: 2 GB RAM Graphics: 256MB DirectX: Version 9.0 Storage: 200 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Disclaimer: I helped translating the game and got a copy for my efforts.  The game is a fun little time waster where you think you know how to handle the enemies till you get bored and stop paying attention...and then you get eaten by a frog...I'm not kidding, this is my favorite way to die in this game, I was about to change my gear because I thought I cleared the room and picked up some loot...always look for moving shadows, that's my advice for you! ;-)  There have been multiple updates to the game since release which added nice effects and new enemy behavior. Boss fights are fun but sometimes a bit too easy, but the difficulty increases with every dungeon you finish.  Duo to the recommendation of a high-score mechanic by many on Greenlight, including me, the developer implemented such a feature which gives the achievement hunters in us a reason to go on.  There are some really cool features in the game, like when there is a bonfire, you can shoot your arrows through the fire and it becomes a burning arrow which does additional damage to enemies. Also, enemies don't hit you by touching, they rather all have an attack animation which must clip with your character to hurt you.  There are a few issues with the inventory system and the enemy AI gets stuck from time to time, but for a low budget title from a new developer, it is a lot of fun, especially when you got friends to compare score with!  Over all, this game might be a bit behind of what it could have been, and you see potential in every corner, but I believe it's worth to pick up for the price to support the developer, this might be his first Steam entry, but it shows that there might be coming better games by him in the future!",
            "review_score": "1"
        },
        {
            "review_text": "I thought it was a good game and when i started playing it I knew it wasn't",
            "review_score": "-1"
        }
    ]
}