{
    "app_id": 431560,
    "name": "Hard Room",
    "release_date": "2016-01-21",
    "developer": [
        "Evgeny Shcherbakov",
        "Denis Ovsyannikov"
    ],
    "publisher": [
        "Atriagames"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "Platformer"
    ],
    "achievements": 11,
    "positive_ratings": 275,
    "negative_ratings": 120,
    "price": 1.99,
    "description": "You are an artificial self-developing intelligence programmed by unknown scientist for the show &quot;Hard Room&quot;. Glorify your creator and prove that you are the best.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/431560/header.jpg?t=1495590501",
    "minimum_requirements": "OS: Windows XP and newer Processor: 2.0+ GHz Memory: 512 MB RAM Graphics: Integrated Graphics Storage: 50 MB available space Sound Card: Integrated Audio",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This game is ♥♥♥♥♥♥♥t. Controls like crap, no 1080p support, no serious menu... go and play some super meat boy, it is better...",
            "review_score": "-1"
        },
        {
            "review_text": " One-room 2D jump and run with frustrating (controller) control mechanism.   Character has to be moved from left to right and right to left to push a button. Each press of a button creates new platforms, enemies, traps etc. in the middle, making the path between the buttons more difficult. Very hard, as the same path, becomming more and more difficult has to be 'jumped-and-runed' again and again.  Frustrating control. I use XBox controller. Menu is only usable with mouse, exit only possible via ESC key. Inconvenient, when sitting on the couch and the keyboard is miles away. Most problematic is the partly non-responsive control mechanism; pressing the jump button quite often reacts with a delay. In addition the movement is too fast without giving the feel and actual control. Note: Other very hard games, like Meatboy for me do provide a much better control, being a no brainer, where the levels themselves make it hard.   Verdict:  Innovative, good game mechanism. Non-responsive (controller) control did not make it fun for me.    ",
            "review_score": "1"
        },
        {
            "review_text": "frustation,,,,,",
            "review_score": "1"
        },
        {
            "review_text": "Hard Room nice",
            "review_score": "1"
        },
        {
            "review_text": "This room makes everything hard...if you catch my drift.",
            "review_score": "1"
        },
        {
            "review_text": "Game seems to have potential but I'm unable to change the hotkeys for moving as I'm using an azerty keyboard. This makes it do difficult to navigate through the levels. Latest update has been 5 months ago :(",
            "review_score": "-1"
        },
        {
            "review_text": "Game about bad steering. Seriously, that's the only difficulty in this game.",
            "review_score": "-1"
        }
    ]
}