{
    "app_id": 431850,
    "name": "Projector Face",
    "release_date": "2016-06-01",
    "developer": [
        "Fluik Entertainment Inc"
    ],
    "publisher": [
        "Fluik Entertainment Inc"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Casual"
    ],
    "achievements": 5,
    "positive_ratings": 53,
    "negative_ratings": 11,
    "price": 3.99,
    "description": "Projector Face is a point and click adventure game following the peculiar actions of a voiceless protagonist trying desperately to communicate. Solve puzzles and help Projector Face befriend the local kids while doing what he does best: playing movies on whatever surface he can find.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/431850/header.jpg?t=1464905393",
    "minimum_requirements": "OS: Windows 2000 or higher Processor: Pentium or higher Memory: 64 MB RAM Graphics: Supports all DirectX-compatible sound and video cards DirectX: Version 5.2 Sound Card: Supports all DirectX-compatible sound and video cards",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "An atmospheric little point and click adventure with an original protagonist to say the least. Like most adventure games of this type it is devilishly tricky.   Feels like a (silent) David Lynch movie crossed with Fallout, minus the ultraviolence. It has an innocent charm, but a sinister undercurrent, so I'm not yet sure if I should let my kids play it.",
            "review_score": "1"
        },
        {
            "review_text": "VERY SHORT game. It should only be a couple of bucks at the most. Even at $5.00, it was a bit overpriced for how short the game is. It was kinda cool. The story was unique.I had to think on a few of the puzzles. If $5 isn't too much for you, so ahead and get it. Otherwise, get it if it goes on sale for 99 cents or something. I just wish they had made a few more movie clips you had to find, etc. Oh well. ",
            "review_score": "-1"
        },
        {
            "review_text": "  Great White North Studios  Projector face so far is a nice break from multi play and fps types of games.   The game itself is like a silent movie and you have to figure stuff out using that big brain of yours to make your way through the different scenes.  The main character art and environments are well done along with overal theme. This one is safe for the kids!  Enjoy the Brain Teezers!!",
            "review_score": "1"
        },
        {
            "review_text": "Interesting Point and Click puzzle game about a projector that comes to life. Quirky storytelling and intuitive puzzles made this an enjoyable game, though it is rather short. I hope that the creator of this game will make more games or a sequel to flesh out this interesting narrative.",
            "review_score": "1"
        }
    ]
}