{
    "app_id": 431840,
    "name": "3DRPG",
    "release_date": "2016-01-12",
    "developer": [
        "Doomster Entertainment"
    ],
    "publisher": [
        "Doomster Entertainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Adventure",
        "Indie"
    ],
    "achievements": 30,
    "positive_ratings": 84,
    "negative_ratings": 61,
    "price": 3.99,
    "description": "3DRPG is a voxelized old-school RPG where you explore a Randomly Generated world filled with random dungeons, towns and people! Every character in the game is recruitable. Hunt for prey or go fishing for food. Search for treasure in dungeons and fight monsters on the way!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/431840/header.jpg?t=1514668446",
    "minimum_requirements": "OS: 7 Processor: AMD A10-7300 Memory: 8 GB RAM Graphics: Radeon R6 DirectX: Version 9.0 Storage: 500 MB available space",
    "recommended_requirements": "OS: 7 Processor: Intel Core i7 Memory: 8 GB RAM Graphics: GeForce GTX 275 DirectX: Version 9.0 Storage: 500 MB available space",
    "reviews": [
        {
            "review_text": "This game is and will be a hit or miss for most people.  The reason I state this is because this game pays tribute to 3D Dot Heroes. If you like that game, or games that you're dropped into a world and you have to figure stuff on your own then this is the game for you. But! If you're the type of person that needs a tutorial, unfortunately there isn't one. I will STRESS this point, THIS GAME WAS MADE IN MIND TO BE PLAYED WITH A CONTROLLER! I have only played it with a controller and it runs smoothly.  I must admit 3DRPG is growing on me, I only have 4 hours put on it but I can tell that the Dev put a lot of work into this project. I am also enjoying all the easter eggs I'm coming across. I also love that the timing system is reminiscent of Legend of Dragoon.  Thanks Doom &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "A great RPG game in my book, it may not look it but it is very fun, and difficult at times, highly recomend.",
            "review_score": "1"
        },
        {
            "review_text": "Its a very interesting game. The graphics are awesome. Must Buy !!",
            "review_score": "1"
        },
        {
            "review_text": "I don't review games very often, but I have played a quite a few, and I feel as if the current reviewers are not giving the game enough of a chance, so lets begin shall we? Lets talk about the controls.   Control Scheme:  From the moment you start up the game, it is configured to be used by controllers, this is an easy fix, just use the arrow keys to navigate down to options, and set it to keyboard and mouse. Something to note is that you don't have to really use the mouse at all, and it tends to be a bit awkward if you do. When you first load into the game itself, after the intro cinematic and character creation screen, you start out above a town, and if you look at the bottom of your screen you will see the default controls.  (It's important to note that these controls can be rebound as by default they may be awkward for some)  By default, Space is set to confirm, with B bound to Cancel, Esc to Escape, C to menu, X to submenu and so on. I've played about thirty minutes so far, and I have had no issues with the menus or interfaces minus a bit of awkwardness before rebinding.  Gameplay:  As said in the paragraph before, you load into the game, a cutscene plays, and you design your character. After chosing a main objective, (The thing you'll be working towards throughout the game) the game puts you above a village in a sort of top down view which lets you plan your moves. I'm going to call this for simplicities sake the Map. On the map you can do a few things, the first of which is moving. You're able to move up, down, left, or right, each time consuming two food, (You start off with 10 if I remember correctly) At first, you start above a village, which you can choose to enter. Upon entering said village it puts you in a third person view, and you're able to move around the village freely. (Unfortunatly you can't use the mouse to reposition the camera and instead have to use Q and E to move it left and right, and while this is a bit awkward, and the animation for moving the camera is sometimes jerky, you get used to it pretty fast) In villages you can either choose to buy things like armor, weapons, or potions, or you can choose to recruit someone to your party. At the start you are limited to having two people (including yourself) in a party at one time. (I think this number increases as you level) Other than that, there is nothing much else to do in villages.   Combat:  The combat system is a pretty standard JRPG setup other than one thing, which is a quicktime event upon attacking, if you time it perfectly, you score a critical hit, if you hit it a bit off time you get a standard/weak attack. While it is a bit unforgiving and difficult to score criticals, I think it should be.   Crafting:  There is also crafting, in which you can create weapons, armor, and potions from things that you collect around varying instances. Pretty run of the mill.  Food and Treasure hunting:  When you get too low on food you'll find yourself in a situation where you have to go out and scavenge for it. When you select the option to hunt for food you get put into an instance that has things such as chickens, rabbits, berries, and tomoatoes around. You can switch between a bow, a fishing rod, and a third option that simply lets you observe things around you in first person. This is something I dislike, as hunting for food can get tedious, but that is just out of my lazyness as it is easy to get a lot of food in a relatively short amount of time. Treasure hunting puts you in another instance that puts you in whatever biome you are over, like Food hunting, but instead of spawning chickens and berries, its spawns monsters, and treasure chests. The treasure chests are thrown randomly through the map and can be hard to find, and the monsters tend to chase you which makes it all the more difficult.  Overall I think that this game has some work that needs to be done on it, but it isnt outright broken, and will give you at least a few hours of fun if you're willing to get over/rebind the controls. As I play more, and time progresses, I will update this review as it is not complete, nor have I played enough to fully review it.",
            "review_score": "1"
        },
        {
            "review_text": "What starts of as an endearing cute styled RPG turns into a nightmare exercise in frustration due to poor design, poor controls, and a boring repetitive world.  This game feels like Early Access and should have been released as Early Access. Right from the start you get a feel for the poor controls, the boring unresponsive combat and repetitive gameplay.         3DRPG - 3 minutes of frustrating Gameplay, Controls and Bugs.&nbsp;",
            "review_score": "-1"
        },
        {
            "review_text": "The motion blur is so annoying and the keyboard controls dont work very well.",
            "review_score": "-1"
        }
    ]
}