{
    "app_id": 43190,
    "name": "The Haunted: Hells Reach",
    "release_date": "2011-10-24",
    "developer": [
        "KTX Software"
    ],
    "publisher": [
        "Signo & Arte"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Steam Achievements",
        "Partial Controller Support",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Co-op"
    ],
    "achievements": 28,
    "positive_ratings": 507,
    "negative_ratings": 81,
    "price": 5.99,
    "description": "Winner of 2010′s Make Something Unreal contest, The Haunted: Hells Reach is a fast-paced horror game where your goal is to liberate cursed places and survive the assault of Hell.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/43190/header.jpg?t=1447354670",
    "minimum_requirements": "OS: Windows XP, Windows Vista or Windows 7 Processor: Intel Pentium Core 2 Duo 2.4 GHz or AMD Athlon X2 2.8GHz Memory: 2 GB RAM Graphics: Shader Model 3.0 graphics card with 256MB of memory (NVIDIA GeForce 7900GS, ATI Radeon 2000 series or higher) DirectX®: 9 Hard Drive: 4GB of free hard drive space Sound: DirectX compatible sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This game is a hidden gem and a masterpiece, it's probably the most underrated game ever. This game still has a lot of potential and i wish that something can be done to revive it and increase the popularity and amount of players.",
            "review_score": "1"
        },
        {
            "review_text": "It is a shame that there was so much hate for this game, because in my opinion it is beyond great. It's very simple, but insanely fun. You versus the demons of hell; a great combination. You and three others must tackle down the enemies wave by wave until you reach the depths of hell and fight a boss. It is a great challenge and an awesome time. My favorite aspect about this game is how awesome each melee strike and attack is. You have a surprisingly large amount of melee attacks and each will cause you to be showered in a pool of blood and limbs. But beyond that are the upgraded versions of your starting pistol, SMG, and shotgun. Oh, and the knife as well. Each new upgrade gets crazier, more powerful, and enhances the gore. And there is also a nice variety in maps, too. Each one feels different and will require a different setup plan. AS for bugs, well, I have not encountered any bugs. It runs really smoothly for me as well. To me it's pretty polished. It also looks beautiful. At its full price it is steep, seeing as how many don't play this game anymore, but if it's on sale I would highly recommend getting it.",
            "review_score": "1"
        },
        {
            "review_text": "Personally, I find this so much more fun than Killing Floor 2. Though the game is old, it still has decent graphics (Unreal Engine 3) and just has a good feel to the movement/guns. It reminds me a little of Serious Sam meets Killing Floor. I have not tried the Vs mode yet, but am enjoying the 'horde' mode. I like the fact that it is not just an endless horde mode (though it appears you can choose that if you like), but instead as a small form of progression to give you something to strive for.  At the current sale price ($2.24) it seems like an easy decision.",
            "review_score": "1"
        },
        {
            "review_text": "Wow. I'm glad I found this game. It's a steal at the sale price.  It's just no ♥♥♥♥♥♥♥t, shoot demons and take no prisoners.  There are multiple game modes. And lots of melee combos. You can upgrade your weapons also. Grab this while it's on sale it's amazing for the price. I think it's worth it at full price too, but I'm really happy with this purchase.",
            "review_score": "1"
        },
        {
            "review_text": "This is the best game you will ever find on steam. This is the epitome of all computer games. This game has a great esport scene and might one day make it to television for its turnbased thriller gameplay. 10/10 the perfect game.",
            "review_score": "1"
        },
        {
            "review_text": "Stylish, Powerful, Fantastic, Speedy, Horror action game!! Very fun and nice graphic. Of course 4 players CO-OP.  정말 스타일리쉬하고 강력하고 화려하면서 스피디한 호러액션게임! 레포데 다음으로 마음에 드는 협동 게임입니다. 제가 방송하는데 다른 분들도 레포데 다음으로 맘에 든다더군요",
            "review_score": "1"
        },
        {
            "review_text": "pretty cool game,  and with friends probably a lot of more fun than playing solo,  even tho Solo is fine too if you love slaughtering the evil :'D",
            "review_score": "1"
        },
        {
            "review_text": "it's back baby!",
            "review_score": "1"
        },
        {
            "review_text": "This game is very underrated and lot of FUN! for less than 2 dollars is a Steal. there are several map very well made, with lot of ladder, roof,cathedral,mines,temple,hiddemspecial weapons, and killing demons in a fun way you increase a bar wich when is complete let enemy drop an upgrade item wich can be used to improve and evolve both melee,pistol,rifle and shotguninto more powerful weapon of the respective class....and trsut me u will need Cuz enemies spawn is very hard and aggressive, lot of enemies type and if u die ,you sould will be set into a stone and your teammate can destroy it and revivew you..but demons can get your soul stone nd run all over the map:)) same as heal stone wich appears on the map and there is another type of cristal wich if you aren't fast enough to destoy it,it will caouse stormlocust and other bad things on the map!!! anbd when u pass 4 waves on the map u will face the Big demon boss wich is a pain in the ♥♥♥ to kill:)) do you a favoru and buy this game for this little price. u don't regret.",
            "review_score": "1"
        },
        {
            "review_text": "Hell, but way more fun.",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome ",
            "review_score": "1"
        },
        {
            "review_text": "This game reminds me a little of Killing Floor, but in 3rd person.. it uses the unreal engine so it runs flawlessly. Hells Reach was released a couple years ago as a mod for unreal engine, this however includes more weapons, levels, etc. fun game if you like shooting zombies and demons while running around to scavenge for ammo and supplies.",
            "review_score": "1"
        },
        {
            "review_text": "This is the single best arena shooter and best zombie shooter (fps) I have played to date. Beats all of the competition by a mile.  Great looks, great feel (gun play, running, even enemy hits are not as annoying as in other games). Gives you options, weapon upgrades, additional unupgradeable weapons. Quite a few maps each with some special mechanic.  Sadly I came to the party late and it's not that easy to find people to play with.",
            "review_score": "1"
        },
        {
            "review_text": "Killing Floor meets Resident Evil Mercenaries mode  Super fun horde killing 3rd Person Shooter.",
            "review_score": "1"
        },
        {
            "review_text": "Unless there has been a recent resurgence in interest, this game is deader than dead.",
            "review_score": "-1"
        },
        {
            "review_text": "uhh you can roll in this game",
            "review_score": "1"
        },
        {
            "review_text": "Saw this game on a sale, asked a mate if it was good. He said 'Yes mate go for it, I play it myself'. Lets just say, we are not friends anymore.",
            "review_score": "-1"
        },
        {
            "review_text": "Not bad zombie co-op survival, but multiplayer is allmost dead and solo isnt so fun so 6/10.",
            "review_score": "1"
        },
        {
            "review_text": "good game but i don´t know how to eliminate the endboss although i shooted lots of at him. Didn´t saw a 'hellth bar' ... and the endboss was only staying in the background!",
            "review_score": "1"
        },
        {
            "review_text": "Despite the low rating this game got, I think its a very fun shooter to play with friends. Plain and simple its a no brain shooter. My only complaint is that there arent enough levels in coop. Besides that i would recommend this game to people that want a good mindles shooter to play with their friends.",
            "review_score": "1"
        },
        {
            "review_text": "Stupidly entertaining and thank God for it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is ♥♥♥♥ing HARD but really FUN!",
            "review_score": "1"
        },
        {
            "review_text": "It's a fun 3rd person shooter, it's getting on quite a bit though. It can be played single player but that's not particularly fun and it can get really hard.  So it's best to play with friends as the online community playing this game is almost none existant. Luckily you can easily play with your friends with the click of a few buttons, host a game, have them join and you'll be having mindless fun killing all the hellish enemies that attack you and try making the best score possible.  I had a blast playing this with friends so I recommend you try it too, find a few friends with this game and play it with them. I'd give it a 7/10 easily. I'd give it higher if the online community existed, but it's gone now.",
            "review_score": "1"
        },
        {
            "review_text": "Epicness at the summum ",
            "review_score": "1"
        },
        {
            "review_text": "For people who enjoyed a good time playing UT3, you will enjoy this game  it's actualy quite good and it does for a good time spender... 8D",
            "review_score": "1"
        },
        {
            "review_text": "10/10 game for playing with friends in online or split-screen with many guns/maps/modes...",
            "review_score": "1"
        },
        {
            "review_text": "a great stress reliever for the murderous",
            "review_score": "1"
        },
        {
            "review_text": "awful game wish i had never spent 20 bucks for this game!",
            "review_score": "1"
        }
    ]
}