{
    "app_id": 432010,
    "name": "World's Dawn",
    "release_date": "2016-01-25",
    "developer": [
        "Wayward Prophet"
    ],
    "publisher": [
        "Wayward Prophet"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Casual",
        "Indie",
        "RPG",
        "Simulation"
    ],
    "tags": [
        "RPG",
        "Indie",
        "Simulation"
    ],
    "achievements": 30,
    "positive_ratings": 431,
    "negative_ratings": 97,
    "price": 6.99,
    "description": "Bring life back to a sleepy seaside village by building friendships, finding love, harvesting crops, tending livestock, competing in festivals, fishing, mining, discovering magical secrets and more!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/432010/header.jpg?t=1472586301",
    "minimum_requirements": "OS: Windows XP, Vista, 7, 8, 10 Processor: 2.0 GHz equivalent Memory: 512 MB RAM Storage: 90 MB available space Additional Notes: Runs at 544x416",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Most people are going to be raving about Stardew Valley rather than this - but I'd just like to say that this game is a worthy competitor to that game. There's less focus on farming, and more on being a villager in a small town - and that's okay. It sets it apart from Stardew Valley and Harvest Moon while still remaining a 'sister game' to them. The dev is really cool - he remains active on the forums, he even put out a personal fix for me when I reported a bug. He wants to continue adding more content to the game, and will more likely do that if there are more sales. I'll say this - if you've finished Stardew Valley and want to try something similar, totally check out World's Dawn.",
            "review_score": "1"
        },
        {
            "review_text": "A harvest moon exact clone.  Originally i bought this game on a sale because i did not have enoough money to buy Stardew Valley.  This is, in fact, a harvest moon clone. They did not change anything at all..it has everything a harvest moon has, marriage, plantign veggies, forest spirits, and hidden areas..  I do recommend this game if you did like harvest moon style games. I strongly also recommend this game:    ",
            "review_score": "1"
        },
        {
            "review_text": "I am someone who wanted to play Harvest Moon, but never did. As a result, I can't compare the two games like everyone else is doing. But! This game is absolutely adorable.   I spent -all- day in it on release day (and plan to do it again today!) and the only thing I have to complain about is the day speed. No, there is no 'limit'. I just feel that 40 seconds in real life for an ingame hour is a bit fast - I feel like it takes half the day to get to town. (I'm also the type of person that downloaded NRAAS Relativity for The Sims just to slow it down a bit, haha.) ++EDIT: Having played through a couple of seasons now, and owning my horse, the ingame time is fine :) ++  But all in all: - The music is nice and doesn't get repetitive on the ears. - The writing is pretty well written. - I am really enjoying all the different characters and their personalities. - Male and Female romance options, for both genders. - Farming / Mining / Fishing / Markets / Festivals! - Yes. This is an RPG Maker game. Want to cry about it? There's a corner over there. *points*. - Worth the money? Yes!  I tend not to run everywhere, so the sprinting-losing-stamina sound doesn't affect me like others. But apparently it has now been changed in an update! :)",
            "review_score": "1"
        },
        {
            "review_text": "If you're in it to get rich quick and do nothing but farm crops, this is probably not the game for you. If you like having the time to go and talk to villagers, figure out the secret of the Feral Shades, mine, fish, forage and socialise without worrying that you need to spend 80% of your day planting and watering your crops, then this is the game for you. The controls are a little clunky, but it doesn't make it any less playable. Plus it hits the right balance between not explaining everything and letting your figure out things on your own.  All in all, 9/10, would buy again.",
            "review_score": "1"
        },
        {
            "review_text": "I am a huge fan of the Harvest Moon and Rune Factory series and I have found great enjoyment from this game. The marriage candidates each have their own background story and all of the festivals in the game have some tie to the main story line in someway shape or form. The controls are easy to learn and it is not difficult to earn money, raise crops, or live stock. Overall, great game!",
            "review_score": "1"
        },
        {
            "review_text": "After playing this game for a couple hours over the course of a few days, I can safely say that this is a fun game. I've been a long time fan of the Harvest Moon series and have longed for a HM game for PC. Not only does this game satisfy that want, it exceeded my expectations for it. This game has charm and whimsy, making it a wonderful game to spend a few hours playing at the end of a long game. The controls can take a moment to get used to, but they're pretty intuitive for someone familiar with HM games. But perhaps my favorite thing in the game is the fact that it asks you at the very beginning of the game whether you'd like to romance men, women, or both- regardless of the player character.   This game is a lot of fun, and I am very much looking forward to mining, fishing, raising animals, and farming my way through this game. I highly recommend this game to anyone who's a fan of HM.",
            "review_score": "1"
        },
        {
            "review_text": "Great game! Relaxing, atmospheric... The farming and mining tasks are simple, but the social interactions can be quite complex. There's a lot to figure out--the game drops you little tips once in a while but definitely does not hold your hand.  Kudos to the developer--very receptive to feedback and quick to act upon it. The community had an issue with energy draining too quickly while running and the developer has already fixed it.  World's Dawn is more of a easy-going life sim than a farm sim, so there is virtually no conflict or antagonist, though the goals and quests do have rewarding outcomes and truly allow you to complete them at your own pace.  Even if you've never played a Harvest Moon game, pick this up and give it a shot! Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Think this is a good game so far. Wish the time didn't go as fast during the day. Makes me feel like I don't get a lot done haha. I like that more farmland was added and that some characters need to be unlcoked. Adds a nice challenge to the game. I do wish that a few more marriage candidates were available, I always wonder why Indigo isn't an option. A few more festivals could be cool too! Overall though worth the money!",
            "review_score": "1"
        },
        {
            "review_text": "I've played quite a few hours of this game and I don't think I'll stop playing anytime soon. I got this game in a sale and I would say it's well worth the price I paid. Very similar to Harvest Moon with a bit more focus on being a townsperson. It's a very cute and relaxing game, so if that's something you like, I'd say you'd love this game.",
            "review_score": "1"
        },
        {
            "review_text": "I must admit, I wasn't expecting the game to be this good! There is so much to do right from the begining of the game and the game is so calming. This game is great for people who want to just sit bback and chill for a while. The soundtrack is really good too. I would recommend this game to anybody who wants a relaxing game that's worth every penny.",
            "review_score": "1"
        },
        {
            "review_text": "This game is absolutely delightful...what a fun way to pass some time!",
            "review_score": "1"
        },
        {
            "review_text": "Need some tuning and debugging, and game sometimes freeze after talking to Madison in the Clinic. Nevertheless, I like this game anyway!",
            "review_score": "1"
        },
        {
            "review_text": "really relaxing and heartwarming game to play. super cute.",
            "review_score": "1"
        },
        {
            "review_text": "I highly recommend this game.  I am fairly new to Steam and am happy to have found this Harvest Moon inspired game on the PC. It is a very charming and relaxing game, and gives me a nice peaceful place to go and play for a while.  The writing is excellent and I find it amusing conversing and getting to know all the personalities of the different characters in the village. To me, that is the fun part. Not to mention the cool artwork too.  Reading through some of the other reviews/discussions, I see that the dev has stayed very engaged and interested in what the players are saying. I think that is awesome and am happy to support a small game studio like this. Now I know that lots of people are playing Stardew Valley. I want to echo other reviewers who say that these games complement each other. SV has a ton of great play time, and seems to be heavy on the mechanics of farming/mining/fishing etc., while World's Dawn is strong on the character development and storytelling.  I like both games and will be playing both of them for a long time to come.",
            "review_score": "1"
        },
        {
            "review_text": "So far the game is very enjoable. If you are looking for a relaxing game to play this is the one. You are not overwhelmed with various tasks to do in the game. There are some bugs and some minor patches being done but besides that its worth the money to play it. Very similar to the Harvest Moon game play.",
            "review_score": "1"
        },
        {
            "review_text": "I just love this game, although I hope they add more content, such as meat recipes (which was very evident from HM), able to have children, game continuity with children (like in HM: ToT and HM:AP). But aside from that, it does a really great job as a game inspired by Harvest Moon :))",
            "review_score": "1"
        },
        {
            "review_text": "I really have enjoyed this game, its alot of fun and has all little things I find charming about these types of games. I hope there will be more added, I really enjoy its been so much fun.",
            "review_score": "1"
        },
        {
            "review_text": "Accidentally called my horse before going into a building. I was a horse inside the building. As a horse I asked for part-time work. Worked the day behind a counter as a horse. 10/10 would horse again.",
            "review_score": "1"
        },
        {
            "review_text": "Look I'm not going to split hairs here by comparing this game to StarDew or anything similar.  World's Dawn is essentially like any farm genre, restore the homestead, marry your sweetheart and save the town. GG.  The only difference probably is lockball which in my opinion was one of two saving graces for this game besides the love and romance story. Look if ya want a beatable game in less than a week get it for anything save that and all the I AM A HORSE jokes possible. Also the random ye olde english speaking slimes... yeah... I don't even know man. 5.5/10",
            "review_score": "1"
        },
        {
            "review_text": "A really good Harvest Moon type game that suffers from some RPG Maker limitations. If you liked FOTMT on the GBA, you are going to love this!  Also I have roughly 15 hours in the game, but it was played in offline mode, so it didn't track.",
            "review_score": "1"
        },
        {
            "review_text": "A nice farming game like HM but a bit simpler and easier to play. The Lockball part bummed me at the starting of the game LOL! Also, there's some part when the NPC walks towards a spot and you enter into another area and go back the NPC will spawn back at where they originaly were. Overall, its a very nice game and I enjoyed it very much since I'm a fan of HM.",
            "review_score": "1"
        },
        {
            "review_text": "I don't normally *cough*ever*cough* write reviews, but this game is worth it, so bear with me on this. As a long-time player, I did receive a free copy, but this has no bearing on the review.  World's Dawn is a wonderful game with a lot of charm. Anyone to ever play a Harvest Moon game has a good idea of what the game is like, but World's Dawn is better in one of the most important aspects – character. The socialization aspect of the game has been far and away my favorite part - meeting and getting to know all the other characters is just so satisfying! Normally in an HM game I'll make friends with a couple people and whoever I decide to marry I'll boost as quickly as possible and kind of ignore the rest unless I happen to run across them a lot. World's Dawn makes you want to go out of your way to talk to people! It's a real choice between, say, fishing all day and running around town talking to people. And the art is so gorgeous! That's not to say the rest of the game is lackluster – quite the opposite! Fishing is a fun little minigame, mining is a great way to while away an evening, and I make sure to water my crops every morning!  In closing, I would like to give a round of applause to Wayward Prophet, who spent around five long years on this masterpiece, who has fixed bug after bug, made change after tweak, to make this game the gem it is today.",
            "review_score": "1"
        },
        {
            "review_text": "BACK-TO-NATURE this game is remind me about Harvest moon .. really .. it has the same plot ahaha this game must be called 'Harvest Moon : Back to Nature RPG'  when you first time came.. you would be showing by a story .. then you will be introduced by some story. then you do the story as well. (there are story inside story) the different between the real one is you can fond money with do an part-time job so that will make easy money to farm. what i gonna say is 'EASY FARM EASY LIFE'. this game more easy than the real one.  (+)Nice Story, Enjoying, Nice Townfolks (-)Stuck Achievement... (erm.. that's my problem) : (  Overall  8.0",
            "review_score": "1"
        },
        {
            "review_text": "This game's biggest flaw is its engine.  Now, I'll admit that it's pretty impressive how the designer has stretched and twisted the RPGMaker engine to do things it was never meant to do, but at the end of the day it remains a poor fit for the genre - in the same way that it's impressive if you manage to nail a board to a wall with a wrench, but ultimately you would have done a better job if you'd just gone out and bought a hammer.  For example, you expect a grind with this genre of game, but the grind becomes near-unbearable when you have to run through RPG-like menus to do the simplest of tasks like giving gifts or planting seeds. The whole experience just becomes tedious. Likewise, you're given some home customization options, but because of the engine these are arbitrary and limited - if you get a lamp and a potted plant, you have to choose which one you want in your home, and they can only be in one spot in particular.  The story is a bit saccharine, which is also expected from the genre, but it's a touch overdone here.  Maybe it's not very fair to compare this to Stardew Valley, but the comparison is impossible to avoid, and SV is easily the superior game - mostly due to it having a game engine purpose-built for the task. Get this only if you've already played Stardew Valley and really need another game to scratch the Harvest Moon-clone itch.",
            "review_score": "-1"
        },
        {
            "review_text": "honestly this game has potential i would love to play more but the controls are so.... like really wtf where you thinking making the controls like that ..'haha im going to make the arrow keys the movement and not WASD then make the mouse useless and use a bunch of other awkward keys' seriously fix that ♥♥♥♥ second why is options under f1.... was it that hard to make a menu button for options? im only nitpicking on that because the f1 for options does not work...   ill change review when you make normal controls and fix the options problem  another update and the options are still not fixed...",
            "review_score": "-1"
        },
        {
            "review_text": "There was a random video from a youtuber with this game and I thought 'well, this looks cute'. I like Harvest Moon and I'm playing Story of Seasons right now... so I bought it. Before this I played Stardew Valley and did not like it. I've read the good reviews here and thought... 'that could be something for me'.  The first thing is... I really like the style and how the characters look like. BUT we all know that this isn't what makes a game well done. It begins with the character creation.. I think you don't have enough things to create your character because you're just able to change the hair. When the game started I had no idea what to do or where to find anything. I talked to everyone. The conversations are well done...the rest not so much.  My orientation is horrible and I had no idea where shops were and how things are done. There's nothing like a tutorial. You could say it's random to get information if you talk to someone.  I also know there are maps but running to them sucks. I spend in game hours to find anything. Then my joy passed away and I decided to quit. I tried some other day but had the same problem. Maybe I gave up too soon but if a game isn't able to suck me in when first played then it's not worth another try.  I'm sorry to say this but... it's just not worth the money :/ It should cost less than it costs right now in my opinion.",
            "review_score": "-1"
        },
        {
            "review_text": "Bad Harvest Moon ripoff with annyoing mechanics, questionable art, and not enough to keep you wanting to continue. Full 2 hour stream:          YouTube™ Video:  Two Hour Tuesday: World's Dawn&nbsp;",
            "review_score": "-1"
        },
        {
            "review_text": "Because you guys didn't get the point of my review i have changed it a little bit, maybe its more clear now:  MY OPINION, NOT YOURS(!): This game is so friggin' boring. The first 'mission' is to find all 26 villagers and that takes forever, hoping that after that it would get better but it wasn't. Besides that the mechanics are very basic like a flash game, looking weird. You can say that this game isn't for me, that could be true but doesn't change my opinion. Really had to go for a refund. 11 euro's is way to expensive for me, for this game.",
            "review_score": "-1"
        }
    ]
}