{
    "app_id": 432100,
    "name": "Negligee",
    "release_date": "2016-10-19",
    "developer": [
        "Dharker Studio"
    ],
    "publisher": [
        "Dharker Studio"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Sexual Content",
        "Nudity",
        "Mature"
    ],
    "achievements": 17,
    "positive_ratings": 472,
    "negative_ratings": 117,
    "price": 10.29,
    "description": "A story of love and lingerie as you are thrust into the role as manager of the shop 'Negligee' alongside three beautiful women.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/432100/header.jpg?t=1537286342",
    "minimum_requirements": "OS: Windows XP Processor: 1.66 Ghz Memory: 1 GB RAM Graphics: DirectX compatible card Storage: 600 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "The idea behind this game is fantastic. Run a lingerie shop, look to hire girls, why didn't we think of this before?  Unfortunately, the game is pretty tame in the visuals department (even with adult patch), with very few events, and the story is really, really lacking. Most of the story is listening to your main character (female) prattle on about how tough it is to run a store, day after day, and you just keep clicking through those internal thoughts.  There was huge potential here but it missed the mark. After finishing the game in about an hour, getting the 'good' Jasmine end, I have to say I saw very little of ANY of the girls, including Jasmine. It doesn't inspire me go for another playthrough.",
            "review_score": "-1"
        },
        {
            "review_text": "Another short and kinky yuri (girl x girl) visual novel by Dharker Studio. The art style is quite lovely, and the story is interesting for this kind of game. The only thing that bothered me was the lack of expression of Hanna’s (the MC) avatar. She’s always smiling, despite of what she’s saying. They drew different clothes for her sprite, but they didn’t made other facial expressions for her. That’s mostly a pet peeve of mine tho.   The characters were okay. I liked Jasmine, she’s a cutie pie. It’s a short story, but it was fun to read. I’d like to play a sequel if possible!  6/10, get only on a sale since the full price is way too expensive for such little content.",
            "review_score": "1"
        },
        {
            "review_text": "  Luckily it's a novel that can be handled with only one hand. I liked it a lot.",
            "review_score": "1"
        },
        {
            "review_text": "( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°).",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful game. Very enjoyable, well-written and easy on the eyes. I think the price is reasonable too, there's a lot of nice extra content and there is replay value to get all that content and the different endings. 9/10  I had only one qualm and it's not with the game itself but the absurd censorship put in place by Steam (or legislated, idk) that forces one to dig to get the uncensored version. I found the uncensored content, it's worth it, but it should come through Steam with the purchase.  If you like beautiful lingerie and/or what's beneath I would recommend this game to you!",
            "review_score": "1"
        },
        {
            "review_text": "Nice Game 10/10 would buy again",
            "review_score": "1"
        },
        {
            "review_text": "( ͡° ͜ʖ ͡°)",
            "review_score": "1"
        },
        {
            "review_text": "relatively short. great art and most of the girls aren't ♥♥♥♥♥♥♥s.",
            "review_score": "1"
        },
        {
            "review_text": "Cool and sexy, I love the game it's a good story and the girls are totally cute, the only thing i missed in the game was animations and voices to make the game more lovely it's a very good game afterall. I love the sounds and artworks and i wish that we can buy the dakimakuras because they look all very cute and hot! I want them all *-*",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed this game very much",
            "review_score": "1"
        },
        {
            "review_text": "For what I paid for it, I got a great deal of enjoyment out of this adventure.  I rather enjoyed the direction, the references, the comedy, the humor, the art, the music...  It all comes together rather well, but I might just be speaking as someone who just enjoys corny games like this. I mean, I played HuniePop as well with it's great music, amazing character design, fun and interesting take on a well-known game type...  I can put both HuniePop and Negligee in the same category. I feel like these kinds of games shouldn't be taken serious, but are definetly worth the experience for what unique twist they bring to the table.  Dharker Studio,   Thank you very much for the experience. This was an absolute joy to play through, and I definetly can't wait to see more of this in the near future.~  Also, Charlotte is the best girl in this game.",
            "review_score": "1"
        },
        {
            "review_text": "I nominated this game for the 'I'm not crying, theres something in my eye' award. You figure out why.",
            "review_score": "1"
        },
        {
            "review_text": "Despite the screenshots showing some illusion of gameplay, I have yet to see any. Other than the average choice every 100 clicks with most visual novels.",
            "review_score": "-1"
        },
        {
            "review_text": "Honestly one of the worst games I have ever played, I expected there to be alot more content and more to the game other then just clicking constantly or bashing the space bar.   great if you like dull boring conversation but given you knock out a story start to finish in 5 - 10 mins honestly its hard to find a reason to do it again.   You can play similar games that are much better on your browers as this feels more like a poorly thrown together powerpoint presentation. Most definately not worth buying now or ever and I strongly recommend no wasting the money.",
            "review_score": "-1"
        },
        {
            "review_text": "-no management , just a silly anime story book that i felt dirty after playing",
            "review_score": "-1"
        }
    ]
}