{
    "app_id": 432240,
    "name": "UnderDread",
    "release_date": "2016-03-01",
    "developer": [
        "Bigzur Games"
    ],
    "publisher": [
        "Bigzur Games"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Horror"
    ],
    "achievements": 0,
    "positive_ratings": 53,
    "negative_ratings": 28,
    "price": 3.99,
    "description": "A first-person horror adventure game that will take you on a journey through an ancient castle and that lies beneath. Dangers and forgotten horrors await in the dark...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/432240/header.jpg?t=1456840855",
    "minimum_requirements": "OS: Windows XP SP2+, Windows 7,8, Mac OS X Processor: Core with SSE2 Memory: 2 GB RAM Graphics: Videocard with Shader model 2.0 DirectX: Version 9.0c Storage: 3 GB available space Sound Card: Stereo audiocard",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This game was provided to me by the developer. When I first read about it I was super excited, boy was I disappointed.  Now, let's not get this confused; this game has a TON of potential. The atmosphere and setting are on point. I am not a big jump scare person, not that I don't like them, they just do almost nothing for me. If a game is to get under my skin, it's going to do it with sound. This game has that nailed. The random heavy breathing, the eerie talking, all the subtle sounds are incredible and unnerving. So well done.  Where the game fell flat for me was in the gameplay itself. Moving was often sluggish feeling, almost laggy. My computer can run a lot of games at the highest of graphical settings so there was no reason for this. When I sprinted the game felt fine, but the walking was just .... I don't know, muddy? Also, there were challenges that I had no idea why I was even doing them. They were just there, so I started doing them.. without any direction from the game or any feedback that I was doing exactly what I needed to. These things need to be sorted out.  Now.... let's talk about the main procrastinator. The 'monster'. Interesting design, though not frightening at all. Is he supposed to be as unintelligent as he is? I mean, he is 3 feet over my cover, I can see all of him and he can't see me? And why does he make that noise? It's not scary, it's nearly gratingly annoying.  Like I said, this game has a ton of potential and I'd love to revisit it if these things are ironed out. As it stands right now, I simply have no interest. I hope this gets the fixes it needs.",
            "review_score": "-1"
        },
        {
            "review_text": "First silly question: Is this a cheap Amnesia: The Dark Descent knock-off? Yes. I'm also told that it's a port of a mobile game, renamed for Steam because it originally had the word 'Slenderman' in the title (why is anyone's guess, as there's not a Slender in sight). Next silly question: Is it anywhere near as GOOD as Amnesia: The Dark Descent? No. Of course not, you preposterous excuse for a human being. The good news, however, is that it's not as bad as it could have been, given what I've just stated. Alas, this ain't exactly the second coming of Frictional...    Something which this game does a mostly decent job of emulating is Amnesia's ATMOSPHERE. The visuals are nice enough, all things considered, and the sound is pretty effective apart from the occasional jarring moment of abruptness, when a ghoulie departs the area you're in with all the subtle smoothness of someone pressing the stop button on an old cassette walkman. There's also some - emphasis on SOME - reasonably half-decent puzzles to be found in the game's three to five hour playing time, and the story is...well, alright, even if the ending brings new meaning and depth to the word 'unsatisfying' ('To be continued'...yeah, right, sure...we'll all hold our collective breaths for that one).     So what does the game do not-quite-so-well? Well, for a 'stealth horror' game, the actual stealth mechanics are kinda dodgy to say the least. Many is the time that I crouched in a corner, with my lantern off, assuming that the ghostie chasing me surely couldn't see me behind this pillar and...nope. He found me. See, the early part of the game, at least, works off pre-designated hiding places, clearly indicated to you by a closed eye symbol which appears on-screen, and you just have to trust the logic of said hiding places...even when they seem way more out in the open than other places which would appear, to the logical mind at least, to be more sure-fire safe-spots. The second half of the game raises the bar of stupidity some more by removing the closed eye symbol altogether, and replacing it with some incomprehensible gobbledygook written on a scroll about hiding in a particular area of the tunnels or some-such...a message which I clearly had little chance of making heads or tails of, given that the only language I'm currently fluent in is English. (Google Translate really does need to be taken off the internet altogether, as it evidently does more harm than good.)    Then there's the completely illogical back-tracking. Oh yes, you're gonna love the back-tracking. Remember the holy water you forgot to pick up in that area way, way back...the area which you've already combed from top-to-bottom five times already? Nah, me neither. But there it was, just like the ritual knives I couldn't pick up the first time, and so on and so forth. I guess it's a 'realistic' change from the usual video game antics in which you pick up almost everything in sight, somehow just KNOWING you're gonna need it later on. So in the interests of grittiness, Underdread makes you wait for a journal entry telling you to go look for said object...before promptly saving you the hassle of spending another ten minutes searching areas you've already been by letting you PRESS A TIP BUTTON which generates a magical blue light which leads you straight to the object in question. What was that I was just saying about realism? Oh well. They tried, I guess. And it did save them the bother of having to, y'know, make more maps than was absolutely necessary to pad the game out to a vaguely reasonable length.     Oh, and to add to the aggravation of the ceaseless back-tracking, they of course had to put a 'stamina meter' in to ensure that you can only sprint for so long before you have to walk for a while. You can, on the other hand, sprint while CROUCHING, so maybe some of you may consider that something of a novelty and/or consolation. Me, I just thought it was kinda silly, and could only imagine how unintentionally creepy my character must look WADDLING along at that speed...    Look, it's not entirely 'bad' - certainly better than many independent horror games recently released to Steam which DON'T even have the excuse of being mobile ports - and does manage to be moderately spooky, even if the relentless presence of certain on-rails enemies becomes highly repetitive and predictable after a while. But it's mostly okay, and I'm happy to recommend it to anyone who's played The Dark Descent to death, and is desperate for a game that's ostensibly similar without being even a fraction as good. To anyone else, seriously: What the ♥♥♥♥ is wrong with you people?! Amnesia: The Dark Descent. Buy it now. And everything else in the Frictional catalogue, for that matter. And Outlast, while we're at it. And Alien: Isolation. And Among the Sleep. In short, there's a veritable ♥♥♥♥-TONNE of 'stealth horror' games out there which you should play before you bother with this one. Go play those instead, and I don't want to see you back on this wretched excuse for a Store page until you've bought and played all the games I just mentioned.    What's that you say? You HAVE played them all? At least FIVE TIMES EACH?! Oh, alright then...buy the ♥♥♥♥ing thing. We horror game addicts are nothing if not BEGGARS, let's be honest here...   Verdict: 6.5/10.",
            "review_score": "1"
        },
        {
            "review_text": "Have only played for an hour so far.My only concern is that the game only saves at the end of a section.I was killed near the end of one and had to do the whole section again.Save games would have been nice.",
            "review_score": "1"
        }
    ]
}