{
    "app_id": 432370,
    "name": "Sethian",
    "release_date": "2016-11-09",
    "developer": [
        "Duang! Games, LLC"
    ],
    "publisher": [
        "Duang! Games, LLC"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Indie"
    ],
    "tags": [
        "Indie",
        "Puzzle",
        "Sci-fi"
    ],
    "achievements": 0,
    "positive_ratings": 49,
    "negative_ratings": 6,
    "price": 3.99,
    "description": "Sethian is a sci-fi puzzle game in which you master a fictitious language. The only surviving speaker is an ancient computer. Does it hold the answers behind the disappearance of the Sethianese people?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/432370/header.jpg?t=1478711120",
    "minimum_requirements": "OS: Windows XP or later Processor: 2.0 GHz Memory: 1 GB RAM Graphics: 128 MB Storage: 210 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "It's such a weirdly satisfying game. There's a sense of achievement when you've grasped the language enough to compose a sentence without effort, and a kind of thrill when it gives you a new response to puzzle through. More so when you can actually start understanding the responses on your own.",
            "review_score": "1"
        },
        {
            "review_text": "I kickstarted Sethian. And don't regret it one bit. You will struggle with language, where each step and half understanding will feel like an achievement. And it will. There is a sweet point where it feels that the journal provides too much (and some deus ex machina definitions) then too little. But hints are there in your journal making the whole consistent.  I found myself thinking/building sethian sentences mixing English and Japanese. People interested in languages and linguistics will love this outlandish out-of-the-box game. The game interface, as you can see, is minimalist, enabling you to focus on interacting with the Sethian computer. The atmosphere is... unique. Beautiful music. The story that you will unveil (or not, depending on your persistance and insight) is a nice sci-fi story. Sweet and sour, to me.  I really wish I could have learned more about Sethian, their philosophies and all those nice words that I found no use for (except immersion) in my playthroughs (and two endings). My regrets go to quantity (I just want more content) and a few bugs (getting hammered out as I wrote).",
            "review_score": "1"
        },
        {
            "review_text": "This is the most unique thing I've played in a long time. You're at an alien computer, and are learning a language as you interact with it. Almost like a language based metroidvania.   I think it falls short of the initial concept (You can probably complete it in about 3 hours even if you're bad at games.), but it was a really enjoyable 3 hours, where i really felt like I was decyphering an alien language. Never got frustrating because there was always the guide to fall back on if you got stuck.  Awesome job dev, please make more weird ♥♥♥♥ in the future.",
            "review_score": "1"
        }
    ]
}