{
    "app_id": 432330,
    "name": "Rytmik Lite Chiptune Synthesizer",
    "release_date": "2016-01-26",
    "developer": [
        "CINEMAX, s.r.o."
    ],
    "publisher": [
        "CINEMAX, s.r.o."
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Steam Achievements"
    ],
    "genres": [
        "Audio Production"
    ],
    "tags": [
        "Audio Production",
        "Indie"
    ],
    "achievements": 11,
    "positive_ratings": 44,
    "negative_ratings": 19,
    "price": 4.79,
    "description": "Rytmik Lite Chiptune Synthesizer is an ultimate tool for chiptunes and oldschool gaming music creation allowing you not only to play with wavetable synthesizer but also to create music clips or whole songs.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/432330/header.jpg?t=1531911793",
    "minimum_requirements": "OS: Windows Vista/7/8/10 Processor: Single Core 1.6 GHz Memory: 1024 MB RAM Graphics: 3D graphics card supporting DirectX with 64 MB of memory Storage: 100 MB available space Sound Card: A compatible sound card",
    "recommended_requirements": "OS: Windows Vista/7/8/10 Processor: Dual Core 2.0 GHz Memory: 2048 MB RAM Graphics: 3D graphics card supporting DirectX with 64 MB of memory Storage: 100 MB available space Sound Card: A compatible sound card",
    "reviews": [
        {
            "review_text": "With just 59 minutes of my time, I have made some interesting music that I would actually listen to compared to modern music now-a-days, I love this software, it truly is interesting and worth a look at.  +You can make whole music tracks with this software. +Upgrade to premium isn't required to produce awesome content. +Tons of free loops to try out. +Easy to save. +Easy to learn. +Easy to dance to.  -Is there anything wrong with the software for people new to music production? No. ",
            "review_score": "1"
        },
        {
            "review_text": "Originally didn't really like Rytmik Ultimate, but started playing around with it for a while, I mean I spent like hours and hours, still it needs a little work, like more than 5 tracks I think is the limit? It's made for Ipad also so it has to be a little dumbed down but for easy music production besides like FLstudio, this one is cheap as heck and pretty great for what it is!\\  don't like how exporting takes the same time as the song length however.",
            "review_score": "1"
        },
        {
            "review_text": "Can someone post a video that accurately explains how the hell to use this? Please? I feel stupid, this isn't a review, its a plea for help.",
            "review_score": "-1"
        }
    ]
}