{
    "app_id": 432470,
    "name": "Magdalena",
    "release_date": "2016-02-22",
    "developer": [
        "MagdalenaTeam"
    ],
    "publisher": [
        "MagdalenaTeam"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Historical"
    ],
    "achievements": 0,
    "positive_ratings": 102,
    "negative_ratings": 137,
    "price": 1.99,
    "description": "The mind dissolves in the surrounding darkness like pain dissolves in wine. Remains of memories crumble and rapidly leak like sand through fingers. And only one name stuck in the throat filled with fear. Magdalena... Minutes feel like days while waiting for something to happen.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/432470/header.jpg?t=1523248401",
    "minimum_requirements": "OS: Windows 7 Processor: Intel Core 2 Duo 2 ghz Memory: 2 GB RAM Graphics: Nvidia GT 730, minimum 1280x720 resolution DirectX: Version 9.0 Storage: 4 GB available space Additional Notes: Minimum system requirements guarantee a steady 30 frames per second in HD resolution",
    "recommended_requirements": "OS: Windows 10 Processor: Intel Core i5 2300 or better Memory: 4 GB RAM Graphics: Nvidia Gtx 780Ti, Amd radeon r9 290x DirectX: Version 11 Storage: 4 GB available space",
    "reviews": [
        {
            "review_text": "This is pretty attractive little game if you look the graphics, but needs to be polished in some details. Before you start playing I recommend to disable SSR setting, otherwise you may experience some troubles with light and textures. Also, when the game starts you get a black screen which is actually night, but you might think this some freeze or bug, just need to turn around and see the light",
            "review_score": "1"
        },
        {
            "review_text": "Will not load past the 'New game' screen.",
            "review_score": "-1"
        },
        {
            "review_text": "Game crashed and forced my computer to restart. Fockn piece of crap. And besides that it just .. makes no sense.. I can walk around in my flat too I don`t need this 'game' for that.",
            "review_score": "-1"
        },
        {
            "review_text": "EDIT:  Ok, nothing changes after half a year and as I see a lot of people have the same problem. Looks like developers don't give a damn about their game what is so sad. Steam should remove that game from their shop. These developers are just taking money from buyers don't mind if they have any issues with this 'masterpiece'. Don't waste your money.  ___________________________________   OK, I'm done. I have no experience of a plot, graphic or anything else that game provided. Why? I can't play. When I'm trying the following issues may appear:  - black screen of death - unable to click anything - unable to close the game (only thing I can do is hard reset) - experience crashing of resolution and then I'm unable to even shut down the laptop  Oh, before someone starts to be curious - my laptop is new and shiny with Windows 10 operating system. Sadly I can't make a complaint because I waited too long in hope that something will change. Such a pity.  If something will change (hopefully for better), maybe before another patch, I will edit this.",
            "review_score": "-1"
        },
        {
            "review_text": "This game should have more content used into doing the game and the story  also the game creators should make a little better graffics   and i can't play it on my pc that have every thing good and great",
            "review_score": "-1"
        },
        {
            "review_text": "Played about 2 hours. Very good optimization and performance. Totally playable on macbook 12' with it's core m cpu. Great graphics and overall atmosphere. Also the music and ambience are pretty well made. For this price, it's a good game.",
            "review_score": "1"
        }
    ]
}