{
    "app_id": 432990,
    "name": "Green Game: TimeSwapper",
    "release_date": "2016-04-04",
    "developer": [
        "iFun4all S.A."
    ],
    "publisher": [
        "iFun4all S.A."
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "Platformer"
    ],
    "achievements": 15,
    "positive_ratings": 42,
    "negative_ratings": 4,
    "price": 1.99,
    "description": "It’s a challenging 2D arcade game where you are a master of time. Set it to past, present or future to control various mechanisms, and make sure that a mechanical bird will safely reach the end of the level. Prepare to die a lot – you will be sliced, squashed and crushed.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/432990/header.jpg?t=1534750620",
    "minimum_requirements": "OS: Windows 7/8/10 Processor: Intel Core Duo 2 Ghz Memory: 2 GB RAM Graphics: Pixel Shader 2.0 DirectX: Version 9.0c Storage: 400 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "  Note: This game was reviewed with a code provided by the developer.  Green game: TimeSwapper is a sequel to the Red Game which I have not played, but would like to try out in the future.  In the Green Game you control a mechanic world and time itself where you guide a bird from one cage to another.  As you control time itself the layout of the level changes. You can rot things to create ways for you to go through, turn on or off steam valves that blow you into the way you want to go through and go through portals.   The art style is outstanding, every time you shift time stuff in the background changes and it's just awesome to look at.  The gameplay is pretty simple, you guide the bird through the stages by turning on steam valves to blow him in the right direction, this can be achieved by using either the mouse controls or the keyboard, but I highly suggest using the keyboard as the mouse controls are kind of unresponsive.  The soundtrack at first is quite decent, but the it gets tiresome to listen to, so I suggest muting the game and adding your own music.  The game also has one major flaw and that's that a lot of the later levels are more trial and error than anything, being that most levels are massive it makes things tough to navigate and more or less a pain in the ♥♥♥ to reach the ending of the level.  The game consists of 50 levels and for the most part everything is pretty easy, there are a few really hard levels, but the challenge comes from collecting three blobs hidden in each level and sometimes it's hard to collect them.  The game lasted me 2 hours to finish, but if you will try to find all three blobs in each level might take some time and might get frustrating.  Overall, I suggest getting the game on a sale cause it's a pretty great puzzle game, not too challenging, but never too easy. If you like these types of games Green Game: Timeswapper is definitely for you.  Pros: + Amazing Art + Interesting Gameplay mechanics  + Level Design   Cons: - Too many Trial and Error levels  - Forgettable soundtrack - Broken mouse controls   Final Rating:  7/10",
            "review_score": "1"
        },
        {
            "review_text": "What I think about this game.  Green Game: TimeSwapper Review:         YouTube™ Video:  &nbsp;",
            "review_score": "-1"
        }
    ]
}