{
    "app_id": 433110,
    "name": "Zipple World",
    "release_date": "2016-01-19",
    "developer": [
        "Alternative Dreams"
    ],
    "publisher": [
        "Strategy First"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Indie"
    ],
    "tags": [
        "Indie"
    ],
    "achievements": 41,
    "positive_ratings": 16,
    "negative_ratings": 11,
    "price": 3.99,
    "description": "This is the story of Zipple, a frog warrior who must collect the objects scattered in his world of mazes and then bring them into the homes of her village.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/433110/header.jpg?t=1489416164",
    "minimum_requirements": "OS: Windows XP/Vista/7 Processor: Intel Pentium 1.6 GHz or equivalent Memory: 1 GB RAM Graphics: 3D graphics card DirectX 9.0c compatible DirectX: Version 9.0c Storage: 100 MB available space Sound Card: Any Windows compatible sound device",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This... can't be happening...  I'm being totally serious, this thing is borderline unplayable, but holy crap, it cannot have be done unless on purpose. Absolutely nothing works right.  The first 5 seconds of this is already a nightmare, Zipple doesn't control like any good platformers, but instead plays like the mythical ♥♥♥♥♥♥ 3D Platformers with tank controls, like Bubsy 3D. However, it's even worse here, he turns at the speed of sound, with no way to change the sensitivity, so there is absolutely no way to put any finesse into the job, it's literally based on luck if you manage to point him in the right direction. It feels as though the smooth gameplay in the trailer is some sort of twisted joke to make me feel like an idiot for not figuring out the magic formula.  The objective of the thing is to bring some useless crap back to a house, as if it wanted to become a collectathon, and with the controls, good freaking luck. To defend yourself from the forever respawning enemies, Zipple can shoot an incredible amount of electric balls, but is rendered useless due to the poor aiming. You can at least become invincible by running and turning like a tornado, which is fun for the briefest of moments. Lastly, there are rocks that periodically fall on your head (????) that MAY kill the enemies [citation needed], but they might actually be trying to put an end to Zipple's futile voyage through the randomly, yet similar, generated levels for eternity.  Button mapping is broken as hell, you wouldn't know what does what until you test it out ingame; it has 3 firing buttons when Fire 3 seems completely useless, it even has two 'Submit' buttons (which is also Pause), despite actually doing the same thing, and while mapping my vertical axis, it somehow got inverted. The game forgets my resolution, so it goes 13600x7200 accross my two screens.  I would also add that the overall aesthetics, although fitting for the gameplay, isn't even something I would've done in my first semester in college; a cartoonish theme for the levels, while the characters seems to come out of some hardcore 17+ fantasy game. The decorations also disappears when you get close to them, as if Carlo D'Apostoli didn't understand how 'Level of detail' works.  Again, it just all fits together that this was all a big joke, so I'm the idiot of this story. Truly a work of art.",
            "review_score": "-1"
        },
        {
            "review_text": "Luckily it was only 74 cents. WORST GAME I HAVE EVER PLAYED!!!!!!!! Do not even bother contributing to the failure that made this. People like him/them make me sick to my stomach. I mean I create ♥♥♥♥ daily, but you don't see me trying to sell it. Carlo D'Apostoli remember this name and never support it. He deserves nothing but shame and a cardboard box. Buy it and see for yourself, but remember you are part of the problem if you read this and buy it.",
            "review_score": "-1"
        }
    ]
}