{
    "app_id": 433480,
    "name": "Rayon Riddles - Rise of the Goblin King",
    "release_date": "2016-11-11",
    "developer": [
        "Lost The Game Studios"
    ],
    "publisher": [
        "bitComposer Interactive GmbH"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Strategy"
    ],
    "tags": [
        "Adventure",
        "Strategy",
        "Singleplayer"
    ],
    "achievements": 29,
    "positive_ratings": 11,
    "negative_ratings": 0,
    "price": 8.99,
    "description": "The Goblins have been displaced and enslaved. It's up to you to help them flee from the Orcs and return to their homeland. Solve puzzles and escape Orcs, Trolls and other creatures on an exciting and funny journey full of surprises.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/433480/header.jpg?t=1478933877",
    "minimum_requirements": "Requires a 64-bit processor and operating system OS: Windows 7 64-bit or later Processor: Quad-core Intel or AMD processor, 2.5 GHz or faster Memory: 4 GB RAM Graphics: NVIDIA GeForce 470 GTX or AMD Radeon 6870 HD series card or higher DirectX: Version 11 Storage: 2 GB available space",
    "recommended_requirements": "Requires a 64-bit processor and operating system",
    "reviews": [
        {
            "review_text": "  Rayon Riddles – Rise of the Goblin King: ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~   Not much fun to be a Goblin these days! Yes I know, it is a big statement. Well, step into our shoes for a second . . . we have been kicked out from our homeland by you despicable humans. Then we’re chased by Dwarfs through mines, and to top it all, suppressed into slavery by these ugly Orcs. Oh, this is really uncouth of you! Yes, we are both green creatures, but we’re small and cute and they’re just ugly! In any case, we need you to help “The Tech” to escape his imprisonment so he can help to free our great Goblin King from his tiny Jail. The Goblin King will rise again!  Rayon Riddles – Rise of the Goblins King is an adventure/puzzle game where you control up to three different goblins to clear each level. The first level is more or less a tutorial to give you the feel of the game and show you how the craft system works. In a nutshell, you have to find blueprints within the level which will show you which item you will need to create a specific object. When you have these items, head up to a workbench to craft that piece.   The puzzles in Rayon Riddles – Rise of the Goblin are not very obvious, which is good but can also be a bit frustrating; more than once I was looking all around a level to figure out how to clear a stage. In that regards, make sure to fully explore the each map to discover blueprints. If you don’t find them, you won’t be able to move on, and that’s where the frustration can creep in. Another point - you will die a fair bit in this game and your blue soul will fly back to a goblin crate in the sky and will literally be dropped back to the level. Plenty of humour in this title, which will give you a few laughs here and there.   The first couple of levels are fairly simple but from there onwards the difficulty will increase dramatically. There are plenty of objects to interact with, but depending on which goblin you control, you might not be able to use specific ones. For example, the Tech is the only one who can craft items, but he is not strong enough to lift substantial articles the likes of huge rocks or barrels; this is the speciality of the heavy goblin. However, neither of them can fit in small places like the tiny goblin can. Depending on the level and which goblins you have at your disposal, it can be a bit tricky. Nonetheless, you will have to make sure the Goblin King can move throughout the level freely to win the stage.   You do have enemies to avoid but realistically this game is all about solving the puzzle to overcome obstacles.  Graphically it looks very good and has plenty of humour. Control-wise, you can use the gamepad or the mouse and keyboard. You might find it difficult from time to time to drop an item on the workbench to craft. If you are not on a specific spot, your goblin might drop the article behind the table which can be a bit annoying. Also, I think this game should have a hint button to help you figuring out the puzzles if you get stuck for a while.  Positives: ~~~~~~~   - Good graphics - Good humour - 9 levels to clear - Good, challenging puzzles - Achievements  Negatives: ~~~~~~~~   - Controls could have been better (especially at the workbench) - A hint button would have been nice - No trading cards  Rayon Riddles – Rise of the Goblin King is challenging, full of humour and fun to play.  7/10  Key provided by developer/publisher for review purposes. Any opinions expressed are entirely my own!    EPIC “THE CPT FROGGY” REVIEWS UP NOW ON ZEEPOND, THE HOME OF THE ALMIGHTY FROG!   [www.zeepond.com]     FOLLOW THE CPT FROGGY CURATOR PAGE HERE  ",
            "review_score": "1"
        }
    ]
}