{
    "app_id": 433670,
    "name": "Professional Farmer 2017",
    "release_date": "2016-03-23",
    "developer": [
        "VIS-Games"
    ],
    "publisher": [
        "United Independent Entertainment GmbH"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support"
    ],
    "genres": [
        "Simulation"
    ],
    "tags": [
        "Simulation"
    ],
    "achievements": 30,
    "positive_ratings": 63,
    "negative_ratings": 116,
    "price": 10.99,
    "description": "Get ready for the rural lifestyle! This game is set on your own farm! Enjoy the life of a farmer with all its amazing tasks and challenges! Drive your original vehicles, cultivate your fields, take care of your animals and market your produce! Different seasons and weather conditions guarantee realistic game fun.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/433670/header.jpg?t=1517298569",
    "minimum_requirements": "OS: Windows Vista, 7, 8, 10 Processor: Intel Core 2 Duo Dualcore, AMD X2 Dualcore with 3.0 GHz Memory: 4 GB RAM Graphics: NVIDIA GeForce GTX 280, AMD Radeon HD 4870 DirectX: Version 9.0c Storage: 5 GB available space Sound Card: DirectX Soundcard",
    "recommended_requirements": "OS: Windows 8, 10, 64-bit Processor: Intel i-series Quadcore, AMD FX-series Quadcore with 3.4 GHz Memory: 8 GB RAM Graphics: NVIDIA GeForce GTX 760, AMD Radeon HD R9 270X DirectX: Version 11 Storage: 5 GB available space Sound Card: DirectX Soundcard",
    "reviews": [
        {
            "review_text": "I don't want to waste a lot of time reviewing this turd, but here goes.  I'd call myself a veteran of Farming Sim Games. I've had several YouTube series on Giants Software's Farming Simulator 2013 and 15 series, as well as Professional Farmer 2014 and Farm Expert 2015.  Professional Farmer 2017 feels like it should be a predecessor to Professional Farmer 2014 and feels like it should have come out in 2008, not 2016. Honestly, how can you make a farming game that is actually worse than Professional Farmer 2014?? I mean, come on? I slightly enjoyed Pro Farmer 2014, but 2017 is an embarassment.  I'm going to play a bit longer, but right now I can't see a light at the end of the tunnel which will make this game likable.  If you are expecting an experience equal to or better than Farming Simulator 2013 or Farming Simulator 15 but from a different company, THIS GAME IS NOT IT!  As a YouTuber and as your friend, I DO NOT RECOMMEND THIS GAME IN ANY WAY AT THIS TIME!  Spend your money on something better.",
            "review_score": "-1"
        },
        {
            "review_text": "The truth is in the game, farming is one of the most expensive occupations a man can persue and the game reflects that wonderfully. Think you have 2 million and the world is yours? Think again, that's a new tractor, combine and header witha new cart thrown in. Maybe a piece of land to add to your growing farming empire. Some of the hirees, are bums, they leave strips all over the field, miss seeding sections, leave strips unplanted. But as the saying goes, it's hard to get good help. You get what you pay for.   The best features about this game for me was the atmosphere and the machinary. The day/night system, the weather, and the environment captured me immediately. On one side of a map theres a lighthouse and every time i was working the fields at night Id a the powerful light circleing around. Id also enjoy something as small as a plane flying over the farm just because it made the game feel real. On the other hand the variety of machines are amazing to use as they were completely new to me and since their sounds were so real. As you progress through the game you also get to purchaase numerous machines all of which have their own speacial use.  All in all, the game is fiarly decent, brought me hours of fun and enjoyment. Took me back when I grew up on the farm and drove tractors and harvesters just like these. I guess that's why my view on the physics of the game is a bit demanding. I have driven this equipment, I know what it does and what it is capable of, and was expecting this game to reflect that. It does not, not even close. I was fully looking forward to watching these diesel demons start grunting and pouring out the black coal. They don't grunt, it's actually more like a soft whimper. ",
            "review_score": "1"
        },
        {
            "review_text": "This game very very fun, I love playing games like this because they are relaxing, and very enjoyable with no goal. Controls are responsive, vehicles don't feel jerky. Game looks pretty good, and runs pretty good on old hardware. I'm most likely going to log a bunch more hours on this game. Started a dope farm and I'm making tons of cash now.  Professional Farmer 2017, is awesome if you like open world simulator games where you farm your life away. This is your game. I might have just over 3 hours in it but I'm going to be logging so much more time into this game because its very fun.  It also looks like they fixed the bugs others have reported on, and at least it has been working fine for me.",
            "review_score": "1"
        },
        {
            "review_text": "Professional Farmer 2017 it's a really nice simulator, I've spended 8+ hour of gameplay to test the game in order to write this review. After starting the game and entering the game, we are immediately immersed in the life of the farmer. The farmer work is realistic, thanks to immersivity that the game offers with its possibilities. You can see immediately that the game is extremely free. You have an initial budget to buy everything that you can need. They will be available from the start different veichle and tools (well explained in the tutorial), and you should buy at least one of the 20 terrenti purchased to start growing. You can purchase all you need in the nearby town, like seed and fertilizers, absolutely necessary for your first planting. After a few hours of play you can make your completely independent farm, and start earning your first money.   Pros    Relaxing   Tractor personalization   Multilanguage   Good Keyboard and Controller support   Great and complete tutorial, in a few minutes you will know all you need    The game is absolutely recommended to all who like the genre ",
            "review_score": "1"
        },
        {
            "review_text": "worst game ever too laggie fps is way low",
            "review_score": "-1"
        },
        {
            "review_text": "  very nice game here massive improvements. i have plenty of hrs working on my farm growing my crops to make more money to buy the best machines to make even more money. the graphics are amazing and with the addition of the tree cutting and tree plantation it gives so much more to do in the game if you fancy a change from your crops :-) lets see what they come with in the new farming sim soon. a cert 9/10 game :-)",
            "review_score": "1"
        },
        {
            "review_text": "I always liked the farming games: I find them very amazing, and I think they are a good way to have fun.  I tried Professional Farmer 2017; at first I was very skeptical, but I had to reverse and change my opinion.  The game have a beautiful graphics; as soon as I finished the tutorial, and become familiar with the controls, I immediately started to enjoy myself!  The game appears very realistic: it perfectly reproduces the country life, in fact we could find animals, drive tractors, and more.  I suggest to buy it; you will not regret it!",
            "review_score": "1"
        },
        {
            "review_text": "Own other farm games IE: FS2013 etc. so far this is the most user friendly.Easy to nvigate compared to others.No mods yet,a drawback,but one I can live with.Plus it can be gotten for around $5 on gamegate.",
            "review_score": "1"
        }
    ]
}