{
    "app_id": 433700,
    "name": "Carpe Lucem - Seize The Light VR",
    "release_date": "2016-04-05",
    "developer": [
        "Hammer Labs"
    ],
    "publisher": [
        "Application Systems Heidelberg"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Full controller support",
        "Steam Workshop",
        "Includes level editor"
    ],
    "genres": [
        "Casual",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Casual",
        "Indie",
        "Strategy"
    ],
    "achievements": 0,
    "positive_ratings": 40,
    "negative_ratings": 5,
    "price": 10.99,
    "description": "Carpe Lucem challenges and entertains players by transferring classical 2D puzzles into the virtual space. It creates a whole new way of interacting and playing mind teasing puzzle games and it made nobody sick in hundreds of demos at trade shows. VR equipment such as HTC Vive or Oculus required.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/433700/header.jpg?t=1515610211",
    "minimum_requirements": "OS: Windows 7 Processor: Intel i5-4590 equivalent or greater Memory: 4 GB RAM Graphics: NVIDIA GTX 970 / AMD 290 DirectX: Version 11 Storage: 600 MB available space Additional Notes: Virtual Reality only",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Wow! This game stands out from all of the many new VR titles. It is a relaxing, beautiful 3D puzzle game with nice NewAge music, which is only possible in VR. A good sense of space, a lot of fun tinkering and imagination are needed to run through all the lovingly created levels. Now I know why this game is nominated for German Computer Game Award ;-)  Highly recommended.  --------------------------------- German version:  Wow! Dieses Spiel hebt sich von all den vielen neuen VR-Titeln besonders ab. Wirklich mal was anderes. Es ist ein entspannendes, wunderschönes 3D Knobelspiel mit beruhigender NewAge-Musik, wie es so eigentlich nur mit VR Spaß macht und funktioniert. Ein gutes Raumgefühl, viel Spaß am Tüfteln und Phantasie sind gefragt, um all die liebevoll erstellten Level durchzuspielen. Dieses Spiel ist nicht umsonst für den Deutschen Computerspielpreis nominiert worden. Ich weiß jetzt warum ;-)  Sehr empfehlenswert, sollte in keiner Sammlung fehlen! Und bei den paar Euronen macht man da eh absolut keinen Fehler.",
            "review_score": "1"
        },
        {
            "review_text": "The XBOX controller doesnt work with Oculus for me and others. Look at forum. The dev doesn't respond to problems much. Still can't play and horrible support.",
            "review_score": "-1"
        },
        {
            "review_text": "Lovely puzzle game and designed with intention for VR. A good example of a game that works well BECAUSE of VR.",
            "review_score": "1"
        }
    ]
}