{
    "app_id": 433920,
    "name": "Aveyond 4: Shadow of the Mist",
    "release_date": "2016-02-01",
    "developer": [
        "Amaranth Games, LLC"
    ],
    "publisher": [
        "Degica"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Adventure",
        "Indie"
    ],
    "achievements": 0,
    "positive_ratings": 116,
    "negative_ratings": 5,
    "price": 10.99,
    "description": "Boyle Wolfbane wanted to rule the world. He failed. Miserably. Forced into retirement early, Boyle now spends his days arguing with haunted trees and scaring off the occasional knight. At least he still has Fang, his loyal storm wolf. Things could be worse. He could have been born a hero.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/433920/header.jpg?t=1498547882",
    "minimum_requirements": "OS: Windows XP or later Memory: 256 MB RAM Storage: 377 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I am an Aveyond fan . . . . This is a new twist of the Aveyond games with a new Darkthrope. Even if he is 'evil' and cursed to marry a witch - he is a very likable character. You have a great quest to complete and a new group of heros - along with a few favorites from previous games. Of course you can have a marriage at the end . . . . if you get enough attaction points. I personally loved the game and will play more than once.",
            "review_score": "1"
        },
        {
            "review_text": "I love the Aveyond series having started playing with the original game in the series Ahriman's prophecy about 10 years ago and have to say was super excited to see that Aveyond 4 was due out. I was not disappointed the high quality graphics, storyline and quirky characters lived up to my expectation. The option to choose the degree of difficulty and the added hidden goodies all add up to make a great game. Even though this is part of a series, Aveyond 4 is fine to play individually with a self-contained story, with some comments back to previous games but these don’t affect the story.  I originally bought this through the developer’s website and got a free steam key so am in the process of restarting and completing the game (maybe on the hard difficulty). I would definitely recommend this game and the others in the series as a fantastic diversion from everyday bordem :)",
            "review_score": "1"
        },
        {
            "review_text": "I have played all the Aveyond games and have loved them all. They have hours of play and are well written and fun. They are also clean and I have no qualms about my children watching or playing them. This latest game is just as good as all the others. I wasn't sure about it at first as it is a little different platform and the main characters are retired villains, but I have loved it. It has quite a bit of humor and it is fun to watch the characters try to remain villains while they are being heroes and saving the world. I look forward to more games by this developer. They are among my most favorite games.",
            "review_score": "1"
        },
        {
            "review_text": "I've loved playing games in the Aveyond series since 2007 I've played them tons, and I definitely recommend them as a classic rpg game with many features and secrets hidden throughout.  Although this game is just new on steam, I owned it previously and received a code for steam. My current save is 8 hours, and I've loved everything in it so far.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game.. I got a free code from Amaranthia Games. As I own all the games of this series I will enjoy for a long time. keep up the work",
            "review_score": "1"
        },
        {
            "review_text": "This game is AWESOME. I got a free key but I purchases it through Amaranth Games. This game is so much fun. There are many Aveyonds and have been a fan for years. The stories are always awesome and always challenging. Need to think to win this game. I loved it loved it loved it!!!!",
            "review_score": "1"
        },
        {
            "review_text": "I have enjoyed playing this game and I hope others will try it, because it is fun and addictive to play.",
            "review_score": "1"
        },
        {
            "review_text": "Aveyond 4: Shadow of the Mist is in the family of the Aveyond games and one of the best games I have ever played. It is challanging, eventful, and keeps you wanting to keep playing and advancing in the game itself. I have played all the Aveyond games and could not wait for them to come out with another. It was so very worth waiting for. The creators of this game are very talented and very helpful if you get stuck. If you play any game let this be one of them you will not regreat it. It is not a short game, so you will be playing for quite awhile and it has a selection for what level you want to play in. The story is good along with the characters.",
            "review_score": "1"
        },
        {
            "review_text": "I have always liked Aveyond RPGs. This one was no exception. I actually played most of this from another source before it became available on Steam where I was issued a free steam key and finished the game. If you haven't played the other Aveyond Games that preceed this one, then you really should play them in order or you lose most of the story and there will be spoilers. These games are just fun, light and quick. They have good characters, enough puzzles to make some areas challenging, and you can control some of the outcomes based on your decisions. This particular game I realized after the fact that I needed to do some side-quests first that would've made my gaming much easier as far as money drops (Robin's Store and Sid's Riddles). I also learned that I missed some side-quests with dolls by not answering certain questions 'correctly'. Yet, that is part of the fun of the game. You can play it again focusing on different characters in your party and following different side-quests while following the main quest. I really liked this game and always look forward to the next Aveyond release.",
            "review_score": "1"
        },
        {
            "review_text": "THIS MAY CONTAIN SPOILERS!!!  For my review, I'd give it 4/5 (but totally recommand it!). Mainly because I kinda didn't like the art. It really could have been better.   The music on the other hand was (and I quote Sid!) grandiose! Music (for me) is the most important thing in a video game lacking voice over. aveyond 4 blew my mind with its music. My favorite tracks were the ones playing in Ulrock, Delamere and Halaina.   The story was really fun; I enjoyed every bit of it. And I loved how every party member had their own little endings and the consequences of the sidequest we played too!  My favorites were Myst and Hi'beru. Really loved it when Myst angered Boyle. And how Hi'beru always came to rescue when dreams were involved.. and that ending with the gladiator? Priceless!!!  I had Ingrid paired with Phye in my game just because I didn't like her with Boyle. Call me silly, but I think he and Myst have much more chemistry :P  Besides, Ingrid deserves a strong man and Phye was prefect.  Hinting that Boyle has some connections with the Pendragons was interested. I'd love to see this idea being expand on in the future. It really sets the bases for a new game *wink wink*    Regarding the curse; my theory is that Boyle did break it. Remember that moment when he was like 'Fang is my true love'? this is a type of unconditional love. Because as far as I know, love extends beyond romance type. So, I think Ingrid knows that too but didn't tell Boyle else her plan will fail. Anyone else thinking the same thing?     A side note; mentioning the suggested subtitles for the game which was posted originally on Facebook dring the ending scene actually made me scream because I was one of the peeps who suggested a subtitle for Aveyond and my submission was considered (albeit for a book about Boyle but anyway)! It made me really, really,really,really,REALLY HAPPY to see it in-game. Thanks so much Aveyond Dev team!      Oh and since I also got the strategy guide, I'd like to point out that it's not as helpful as I expected. I found myself surfing the forums more than reading the guide.   For example, it only mentioned that Myst can get a bear amulet but doesn't mention how to get it and from where. Also that part about Rowen's sword singing skill was not written. I accidentally stumbled upon a topic on the forum discussing it.  However, it came handy when I was looking for the goodie caves before solving Sid's puzzle.  Finally; I'd like to metin that I got this game when it was first released in December from aveyond Kingdom sit, and as soon as the game was released on Steam, I got a free Steam key, so, I would like to thank Amanda and the team for this. Many other developers forget about the loyal fans as soon as the game is greenlit on Steam *cough* Bethesda *cough* :)   I look forward to playing more games from you!",
            "review_score": "1"
        },
        {
            "review_text": "Just finished this game today and I have to say, it was a work of art. Loved every minute of this game and I will be going back and tracking down anything else to do with Aveyond. If you enjoy older RPGs like Breath of Fire you will love this game.",
            "review_score": "1"
        }
    ]
}