{
    "app_id": 433950,
    "name": "Bit Blaster XL",
    "release_date": "2016-01-22",
    "developer": [
        "Nickervision Studios"
    ],
    "publisher": [
        "Nickervision Studios"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "Casual"
    ],
    "achievements": 17,
    "positive_ratings": 5221,
    "negative_ratings": 145,
    "price": 0.79,
    "description": "A throwback to the classic quarter eating arcade games of the 80's. Bit Blaster XL is a retro styled, addictive, and fast paced arcade shoot 'em up! (shmup).",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/433950/header.jpg?t=1552783642",
    "minimum_requirements": "OS: Windows 7 Processor: Dual Core + Memory: 2 GB RAM Graphics: 512MB + Storage: 500 MB available space Additional Notes: Is your computer older than ten years? You should probably get a new computer before you consider more games.",
    "recommended_requirements": "OS: Windows 10 (why not recommend the newest?) Processor: Got four cores? Great! Bit Blaster XL will run smooth on most things, but especially on four cores. Memory: 8 GB RAM Graphics: Something within the last five years would be nice and gorgeous, better is always better. Storage: 501 MB available space Sound Card: I made a bunch of these bit blaster xl sound effects by making stupid noises with my mouth into a pretty low rent consumer microphone, so I recommend not having a sound card, or you may realize this. Additional Notes: When you do things right, people won't be sure you've done anything at all.",
    "reviews": [
        {
            "review_text": "This game costs nothing, yet it still manages to be amazingly crafted and really well done. Amazing 8bit visuals Really good soundtrack (where's the DLC to buy the soundtrack? I NEED IT) I really like it, and I can't wait for the developer to make more games.",
            "review_score": "1"
        },
        {
            "review_text": "really fun game for the price, recommend if you have any money left over from the sale",
            "review_score": "1"
        },
        {
            "review_text": "yeah a bit embarrassed i paid so little for this.",
            "review_score": "1"
        },
        {
            "review_text": "Sweet game! Love the ship selection upgrades for progression too! Great graphics and gameplay definitely recommend!",
            "review_score": "1"
        },
        {
            "review_text": "Full Disclosure: I was given a copy of this game to review  Okay, have some free time and want a little time waster? This is that kind of game. It's not bad, it's actually pretty enjoyable. It would feel right at home on iOS/android and should definitly be ported to those platforms as I think it would fair better there than on here. However it is enjoyable and has some pretty good music to go along with it.",
            "review_score": "1"
        },
        {
            "review_text": "I do not have much experience with games from the 80's and 90's, but i do like the appeal of them and thought this game would be great to play in those moments when i need to waste 5-10 minutes. I played this game with a Xbox 360 controller.  First thoughts: 'Hmmm, don't really care for the constant shooting, but i guess that is the theme of the 80's and i can't complain. The controls feel a little wonky too (the ship moves the same amount with the joystick barely pushed in one direction and fully pushed in one direction). But hey, it was $0.89 so i can't complain too much.'  After playing for 10 minutes: 'Well, the leader boards seem fun and the scores aren't completely out of reach. Maybe just one or two more rounds.'  Then, i found myself just wanting to play another round and try and get a higher spot on the leader boards. I really just couldn't put the game down.   Final opinion: I think the game could use some adjustments to the controls. But it is extremely addicting and very fun to play when just relaxing or you just want to waste 5 minutes.  For the price of $0.89, i give the game an 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Best pixel shooter i ever seen! Power ups, speed bost, and insane ai make this game amazing, p.s. must get",
            "review_score": "1"
        },
        {
            "review_text": "A simple and fun game to play and spend your time with. If you are looking for a getaway game this is probably your game and with $1 price tag its a steal!  Well things that i don't really like (based on the time that i write this review) are  - There's no pause menu. (It'll be added soon-ish though) - The screen will be a giant cluster♥♥♥♥ of mess when you reach 8k or more score. By then good luck on spotting your own ship on the screen full of explosion and things - The Bounce Gun(?) rate of fire is ridiculously high, just about 10-20secs after you get the power-up you'll ran out of ammo instantly.  Well i think that's my short review of this game, but since it's only a day from release i'll be looking on this game again soon after it's matured a little bit. :D",
            "review_score": "1"
        },
        {
            "review_text": "This is a great little game! It definitely is one that has me saying, 'Just one more round!' I think that this would be a good one to pull up on the tv with a bunch of friends around, taking turns with friends. It reminds me of some of the older arcade games with some updated 'level up' features, like unlocking new ships.",
            "review_score": "1"
        }
    ]
}