{
    "app_id": 433910,
    "name": "Neon Drive",
    "release_date": "2016-05-12",
    "developer": [
        "Fraoula"
    ],
    "publisher": [
        "Fraoula"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "1980s",
        "Great Soundtrack",
        "Retro"
    ],
    "achievements": 16,
    "positive_ratings": 1149,
    "negative_ratings": 241,
    "price": 6.99,
    "description": "Neon Drive is a slick retro-futuristic, '80s inspired arcade game that will make your brain melt. You've been warned.From beautiful cityscapes and ocean roads to exploding enemy spaceships, Neon Drive has it all.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/433910/header.jpg?t=1504195817",
    "minimum_requirements": "最低: OS: Windows XP プロセッサー: Intel Core 2 Duo メモリー: 2 GB RAM グラフィック: DX9 capable (256MB) DirectX: Version 9.0c ストレージ: 450 MB 利用可能",
    "recommended_requirements": "推奨: OS: Windows 7 プロセッサー: Intel Core 2 Quad メモリー: 4 GB RAM グラフィック: GeForce GTX 570 ストレージ: 450 MB 利用可能",
    "reviews": [
        {
            "review_text": "More of a warning then a negative review: game may be unplayable for people with motion sickness.  Outside of this, game pretty stylish, hard and good.",
            "review_score": "-1"
        },
        {
            "review_text": "i'm not one to write reviews too often, but after playing this, it has almost forced me to do so.  where to even start? the premise of the game is extremely obvious from the vids etc, but the reality is that it will suck you in, being a classic console guy, this feels like the perfect modern example of games of that era, checkpoints are minimal, forcing you to comtinually restart the stage, but load times are super quick so there's next to no turn around time. just brilliant repetitive beauty...  levels are immensly difficult, even from the beginning, but gaining that extra 1% distance through the level is incredibly rewarding, and keeps you coming back time and time again...  my partner and i found ourselfs taking turns trying to beat each other and get further than one another, and it was one of the best nights i've had in a long time...  5/7 would most definitely buy over and over again... currently contemplating buying a handful of copies to just gift to friends, because everyone NEEDS to play this...",
            "review_score": "1"
        },
        {
            "review_text": "Great game to pass the time, nicely themed to the 80's style. I bought this game for $6.49 - Although I think, for my liking, the game should not be priced this highly, I do actually consider the game worth buying. Just not for that price.",
            "review_score": "1"
        },
        {
            "review_text": "Not sure, why this game got very positive reviews. It's a nice little pet project, but not a feature complete game. It has 7 (SEVEN) levels, which you can play in 3 difficulties (normal, hard, insane) and an endless mode. The harder difficulties only increase the speed at which the game is played. Since you basically need to learn the courses at times instead of just trying to react, this isn't very problemat. It took me 0.8 hours to beat the game on normal and the first level on hard and insane, so even if I wanted to beat the other 6 levels (some of which are just real ♥♥♥♥♥♥♥s), I'd reckon this would take another 2-3 hours tops (in which my brain would melt).  The basic principle is even good. It's a fun game, colourful, great soundtrack, good looking even. And each level has a very different style to play to it (be it top down view, flying, fifth element style or Star Wars style descent trhough traffic). All very cool, but just not enough for 10 bucks. I got it for 2.50, so I'm kinda ok with it, but full price is a big no no imho. There's also the issue of collision detection. Sometimes the game registers a hit, though you didn't hit anything, or at least it feels that way and at least once I squarely hit something and clipped right through it...get it for a deep discount, have a bit of fun, then play something with more substance.",
            "review_score": "-1"
        },
        {
            "review_text": "I found this game really hard but I got used to it as I kept playing. I personally am in love with 80s style art and graphics so that hooked me on the game. I would recommend!",
            "review_score": "1"
        },
        {
            "review_text": "2buttons. Difficult. Thrilling. Great game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is super rad.",
            "review_score": "1"
        },
        {
            "review_text": "Quite a challenging game but it's one in which you'll get the most value out of if you stick with it. The objective is to reach the end of the stage by dodging obstacles while listening to synthwave in the background. Simple in concept but difficult when you actually sit down and play it. It tests your hand eye coordination so much that it may be frustrating for some. Recommended if you are into the 80's and feel like throwing a keyboard across the room.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic visuals, catchy music, and i love that it keeps me coming back for more. Don't listen to kiddos that say this game is too hard; just get gud :)",
            "review_score": "1"
        },
        {
            "review_text": "An awesome game, but christ it's hard!",
            "review_score": "1"
        },
        {
            "review_text": "this is my aesthetic  the second part of level 5 is complete bs tho",
            "review_score": "1"
        },
        {
            "review_text": "JUST BUY IT! Best Game 10/10 would bang!",
            "review_score": "1"
        },
        {
            "review_text": "Update: most of the control issues I describe below seem to be being caused by V-Sync, if you feel the game plays like I describe below; I urge you to disable V-Sync, I'm getting smooth 120+ FPS regardless of quality &amp; effects settings with responsive controls now that it's off &amp; it is a much better experience. Level 7 is still crazy hard though.  I love Synthwave music &amp; I love this art style. I also like a lot of twitch control lane-switching games. However, the controls are such a letdown in this game, it's a big part of why this is so hard; the car feels too unresponsive that if you make any mistake that you can't correct it at all, you can't change lanes quick enough which takes out all the close calls that make lane-switching games fun. The controls lack that tightness that makes these things great &amp; it is such a disappointing thing because it looks beatiful, it sounds great &amp; some of the obstacle design is really great (level 7 with it's Klax design is inspired &amp; incredibly difficult). I also don't feel that the music does sync up at all with the obstacles despite what the Store Page says.  Tighter controls would make this the total package for me, pretty much everything else is fine. Although I don't really consider a website link &amp; a Facebook link to be Extras, but that seems to be a thing with mobile games in general, so whatever; the Wallpapers are nice though.",
            "review_score": "1"
        },
        {
            "review_text": "Looks really good and I really love the whole synthwave thing, but the content that is there is repetative and boring. I love casual games and I love rythem games, I saw the negative reviews and thought, 'it can't be all that bad' but I really say dont waste youre money, or wait for it to go on sale at least. I had a few techincal issues too so I can't really say the game runs well, but it's not like it's a mess or anything.  TL;DR Love synthwave, hate this game.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is awesome, it is basically a remember the pattern and in sync with music game. It may take 50 attempts to pass a level or 10 depending on how you get with fast reactions.  THere are 7 levels each with 3 difficulties and I am on 6 now, even the normal is a challenge, it can be frustrating but it is nice to finally reach 100%",
            "review_score": "1"
        },
        {
            "review_text": "Neon Drive is a sensational throwback to the 1980s culture cast upon a rhythm-based driving game.  You pilot one of various cars through seven levels, each with three unlockable difficulties. The soundtrack is the strongest part of the experience, featuring dizzying melodies and perfectly voiced harmonies, along with thumping bass.  First I will say that Neon Drive is arguably the most difficult game I have ever played, even at is easiest level. While I won't compare it to the obvious like Dark Souls, this is very much a game that requires concentration and strategy to play and succeed.   Prepare to fail a lot. If you are okay with restarting the same sequence over and over and over and over until you succeed, then this game will not fail you.   Neon Drive is rewarding in that the entire experience offers variety, the right amount of challenge, and a satisfying play session each time. After beating a level on 'normal' it unlocks 'hard' and 'insane' difficulties, which are stupid fun and a true test of hand/eye coordination.  The level design is strong, with cyberpunk backdrops, neon vistas, and more 1980s pop culture references than you could shake your fist at. This game plays similar to Wipeout or Audiosurf and has many similarities to other rhythm games while uniquely defining its own identity.  My only gripes about the game are that it lacks true content. Neon Drive started its life as a mobile game and was ported over to the PC with improvements in graphics and gameplay, as well as adding controller support. If the game had more levels, I feel as though it would justify its current full-price cost of $10USD. However, I purchase it on sale and I would still recommend it. In the future, I would hope that the developers realize the potential of this game and award the fanbase with more levels or modes.  I won't give chew anybody's ears off about this game but I can strongly recommend it for fans of the 1980s, the 'aesthetic' movement, or for people who enjoy challenging rhythm games. Neon Drive is a very well-made title.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "What a fantastic game! Super cool graphics and smooth gameplay with great soundtrack. Im a bladerunner fan so that level is awesome. worth it alone",
            "review_score": "1"
        },
        {
            "review_text": "Like a Rhythm game based, 80s themed drug enduced dream. The visuals are gorgious for the style they're aiming for (even having an added VHS effect in training mode) but it will also kick your butt even on the first level if you get lazy. Little to no hand holding here folks, just dodging like a pro if you want to see all those crazy 80s style visuals.",
            "review_score": "1"
        },
        {
            "review_text": "It has an amazing soundtrack and looks gorgeous even on a lower graphics preset. The game truly captures the '80s feel. It's a shame I suck so much at this sort of game...",
            "review_score": "1"
        }
    ]
}