{
    "app_id": 434050,
    "name": "Duke Nukem 3D: 20th Anniversary World Tour",
    "release_date": "2016-10-11",
    "developer": [
        "Nerve Software, Gearbox Software, LLC"
    ],
    "publisher": [
        "Gearbox Publishing"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 18,
    "categories": [
        "Single-player",
        "Online Multi-Player",
        "Online Co-op",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Workshop",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Adventure"
    ],
    "tags": [
        "Action",
        "FPS",
        "Gore"
    ],
    "achievements": 27,
    "positive_ratings": 806,
    "negative_ratings": 177,
    "price": 14.99,
    "description": "Frag like it’s 1996 – this time with even more asses to kick! Join the world’s greatest action hero in Duke Nukem 3D: 20th Anniversary World Tour as he saves Earth once again, kicking alien ass and saving babes across the globe along the way.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/434050/header.jpg?t=1518545464",
    "minimum_requirements": "OS: Windows 7/8/8.1/10 x64 Processor: Intel Pentium Dual Core E2220 (2*2400) or equivalentAMD Athlon(tm) 64 X2 5000+ (2*2600) or equivalent Memory: 2048 MB RAM Graphics: GeForce 8600 GT (512 MB) or equivalentRadeon HD 4670 (512 MB) or equivalent DirectX: Version 11 Storage: 1200 MB available space",
    "recommended_requirements": "OS: Windows 7/8/8.1/10 x64 Processor: Intel Core i3-530 (2*2930) or equivalentAMD Phenom x4 9850 (4*2500) or equivalent Memory: 2048 MB RAM Graphics: GeForce GT 610 (1024 MB) or equivalentRadeon HD 6850 (1024 MB) or equivalent DirectX: Version 11 Storage: 1200 MB available space",
    "reviews": [
        {
            "review_text": "Having already owned 5 different copies of this game it was inevitable I get this version too. In it's current state though I find it hard to recommend this particular version of Duke 3d.   There are certainly good things about this particular release. The new levels are well done, the new music is very fitting, and the new 'incinerator' ended up being a more fun weapon than I thought. The carry over of the Xbox versions rewind system is certainly a plus. The new renderer, while not as pretty as eduke's polymer, is pretty well optimized so performance is better than polymer in most cases. While the new voice clips seem out of place, there is a legacy voice option. Dev commentary is a nice feature though it is sparse in some areas and overly abundant in others.    This release has numerous flaws however that I find both weird and unforgivable. First off someone at gearbox did an absolutely horrendous job converting all the sound files to .ogg and everything sounds very muffled because of it. There appears to be no way to turn off auto aim which becomes more of a hindrance when you have played duke 3d as much as I. Finally and perhaps the most frustrating to me is they added some weird mouse smoothing effect that makes mouselook perform wonky with no option to remove it. In its current state I just can't recommend this version of Duke 3d for the price they ask.",
            "review_score": "-1"
        },
        {
            "review_text": "Missing: more video options such as texture filtering, FOV. 3D Sprites (Shadow Warrior like voxels for items). Episodes from expansion packs are not included. New levels aren't that great. Was hoping for more of Amsterdam. Why isn't it snowing in Russia? Where's the Vegas level? New voiceovers aren't all that impressive either and still very repetative. Sound and music quality still sucks. Although the renderer is a vast improvement, it doesn't justify the price. Can't recommend it for this price. Still need Brutal Duke Nukem!!!",
            "review_score": "-1"
        },
        {
            "review_text": "I don't really know what I expected...  Gone are the days of real passion projects, why bother when the nostalgia sell is such a pathetically easy one?  I was hanging out for this game ever since it was announced - Duke 3D is my favourite game from its era by a mile, and an officially liscenced modernization was like christmas and my birthday all at once! I was so excited to see how professional games designers were going to improve upon it.  tl;dr - there are numerous free mods online that do a MUCH better job.  Long story - I feel utterly and totally betrayed. In terms of the modernization - the gameplay is horrendous and the graphics are the dictionary definition of half-♥♥♥♥♥.  + St Jon came back to do some high def voices! - He sounds like he's doing them all in one take so he can go downstars and spend his ten dollar royalty check on a sandwich - The voices are high def, but all the other sounds are just... unforgivably bad. like I honestly want to know how and why they sound worse than the original games did. It's like they found the lowest fidelity sound card they could and re-recorded the game sounds through a tape recorder up against the computer speaker.  The new content? I mean... I kind of expected them to recycle old assets for 'nostalgia', but this level design is something an amateur modder could crap out in a fortnight. I swear I am not being hyperbolic.  +the humor of the new levels is about on par with the humor from the original games. Whether this is a good point or not depends on the person you ask. -The new enemies are not fun and not well designed. scrunched up sprites of existing monsters with incredibly annoying attacks. -The first new level has an OJ Simpson trial reference, no doubt recycled from the original game. I think that says more than enough about the degree of effort put into this. -There is forced mouse acceleration. No way to turn it off. Seriously.  I've been putting hours upon hours into brutal doom as of late, in preparation for this game. This was a doom mod made by a single dude that makes the original DOOM games look and play phoenominally - wonderful new textures and effects, new weapons and gameplay elements. Brutal DOOM is a free mod. World tour cost me twenty dollars and has the same level of passion and aptitude for the real game as a small dog does with a set of copic markers. The fact that AAA games developers are still getting away with this is painful to me.  I was skeptical when I heard 3D realms were coming back for this project. No doubt millions of dollars in the hole after having to settle finances with the investors for Duke Nukem Forever, I imagined their experience would outweigh their indescribable laziness. I was wrong.  I was so very, very wrong.  I write this so you don't make the same mistake I did. No doubt there is another me out there, another 24 year old manchild whos eyes are cloudy with nostalgic tears, holding your wallets up in the air and praying for gearbox to bring back all the memories from before your 9-5 office job sterilized your once blissful existence.  They wont. They can't. It's a lie. Run. Run so very far away, there is nothing for you here.",
            "review_score": "-1"
        },
        {
            "review_text": "Initial review:  Crashy as hell multiplayer GFX certainly are better remembered than experienced.",
            "review_score": "-1"
        },
        {
            "review_text": "For the love of god, please allow me to remap console (~)... Us old school dukers use that for quick kick man!  I can't change what i've been using for 20 years! haha! PLEASEEEEEEEE!  ARGH I can't map the same key twice? COME ON MAN, DON'T BREAK THE ALREADY BROKEN ♥♥♥♥, that's what made the game great! Noone uses a medkit button, that ♥♥♥♥ is mapped to other keys!  - spritian",
            "review_score": "-1"
        },
        {
            "review_text": "  It's Duke Nukem with better graphics, gameplay and more maps.  No reason not to get it if you like old FPS games.",
            "review_score": "1"
        },
        {
            "review_text": "10 Dukes/ 10 space ♥♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "Keep in mind, I have only been playing these games for the FIRST time back in November of 2016, when I began playing Doom, so for those who actually been playing games such as Doom and Duke Nukem, please understand that I have a different mindset then others full of nostalgia, for like I said before, I never played them before 2016, so keep that in mind.  Anyways, after that reminder, here is a review of Duke Nukem 3D: 20th Anniversary World Tour.  I will put this review in 3 catagorys;  The Price  The Gamplay  and the Community.  So after that, let's began      The Price",
            "review_score": "1"
        },
        {
            "review_text": "I bought Duke on PC 20 years ago! O_O i've had every version since, i disliked Forever. This is a great flashback to a more innocent &amp; innovative time in gaming. Having lots of fun. Making a let's play on youtube! If anything i invest my 20 bux in the hopes of an OPEN WORLD DUKE GAME! i give this a 8/10, what i dislike is the controller adaption. i sometimes slide after i stop, its very sensitive! i may need a new controller!  i'd like to see a LEVEL EDITOR set up like SIMS so it would be easy to set up walls, monsters &amp; weapons/items in a easy grid set up so anyone can make levels! that's it Nukem Nation!",
            "review_score": "1"
        },
        {
            "review_text": "One trillion megatons of fun. Timeless. Happy anniversary bro.   I almost forgot to mention that Alien New Order episode is solid and challenging, except final boss, he is pathetic.   If you like going places and having fun, join the World Tour :-)",
            "review_score": "1"
        },
        {
            "review_text": "Why so Serious Sam?",
            "review_score": "1"
        },
        {
            "review_text": "This game, is a game .. it was relased 20 years ago, it was good. it smells like a game, it plays like a game, some may even argue that this is a game.",
            "review_score": "1"
        },
        {
            "review_text": "The new levels are fun, and well built. The graphical updates make the game playable, but it's obviously a dated product.   Classic Duke action, total worth $20.00.  Come get some.",
            "review_score": "1"
        },
        {
            "review_text": "I still remember back in 1996 where I spent countless hours playing the original Duke Nukem 3D and how much I absolutely loved the game. This game brings back some long forgotten nostalgia and I'm loving every minute of it. I'm currently working through all the episodes and looking forward to seeing the new content!",
            "review_score": "1"
        },
        {
            "review_text": "Dukenukem 3D is well balanced and it is a class all of it's own.",
            "review_score": "1"
        },
        {
            "review_text": "Is it perfect? No.  Yet, if you're a die hard Duke fan or if you've never played the original, you will surely love this one.  The sound is a bit off, the voice sound is ok but all the other noises sound kinda muffled.   The new episode is really cool. I love what they added to the game, yet it fits with the rest. My favorite levels have to be the one in Amsterdam for the fun side it has and the Egyptian one because of the insanely cool level design in it. I will surely replay it. I do own megaton edition and this one and I don't regret buying this edition.  My pros: - New episode with 8 fun filled levels - New enemy - New weapon - More John St John - Commentary that is cool even if not present in every level. - The same spirit we all loved back in 1996  My cons: - The sound that is kinda muffled - Always seem too short when you're having fun - Not a fan of the main menu screen, liked more when it played gameplay videos - New 3D graphics sometimes make the game lag, not always thought, played twice perfectly and once with bad lag, all on the same PC.  For those still on the fence, wait for the sale, but yes for me, the new episode is worth getting that version.",
            "review_score": "1"
        },
        {
            "review_text": "Pros: - The new campaing is awesome! Good to see brand new official content for a 20 years old game. - Cool new Duke talk and re-recorded old ones - The new lighting effects are cool and bring a new atmosphere - Developer commentary  Cons: - Salty price for 'just' a new campaing and new engine - Missing the Megaton Edition campaings (Licensing problems maybe?) - The sound effects for pistol and explosions are AWFUL. I hope this get fixed. - Developer commentary is way to sparse  ",
            "review_score": "1"
        },
        {
            "review_text": "This review isn't helpful.",
            "review_score": "1"
        },
        {
            "review_text": "I don't understand all the negative reviews I am reading here, the description was pretty clear as to what this was. It is a small upgrade to the engine and a new set of levels to the original game. I have been having a blast remembering where all of the secrets were that I haven't had to use for 20 years since I played this game before. All of the speed runs that I used to do still work so I think that the ammo is in the same place, for sure the levels are the same and the sounds seem to me just like the ones that were in the game before. If you are looking for somethng that rivals the new Doom from ID then this is not what your looking for. If you are looking for an updated Duke that will run well on new hardware but looks pretty much like the original game you have come to the right place. I have been having a blast shotgunning down memory lane, 'come get some'.",
            "review_score": "1"
        },
        {
            "review_text": "It's worth playing if you want better botmatch support and a Flamethrower :)",
            "review_score": "1"
        },
        {
            "review_text": "It's Duke Nukem 3D. +1   That is enough to write a positive review on. The new engine is definately better and the devoloper commentary is very interesting and making it worthwhile to play it AGAIN. Although, who doesnt play this game from start to finish every month atleast 5 times?  The new voices from John st Jon are not as good as the Legacy Duke voice, but atleast the option is there, so can't fault the game for it too much. It's a nice effort, but it failed.  The red crosses on the medkits have been replaced with medication pills, if this causes sand in your va-yay-yay it's definately something to worry about.",
            "review_score": "1"
        },
        {
            "review_text": "1996 again.   Nice to be able to play this again.  Need old computer for the original but this is just as sweet.",
            "review_score": "1"
        },
        {
            "review_text": "Nice game!",
            "review_score": "1"
        },
        {
            "review_text": "OK, its good! Now I know it wasnt the game it self that caused the connection errors in multiplayer mode.",
            "review_score": "1"
        }
    ]
}