{
    "app_id": 434130,
    "name": "Witch and Hero(魔女と勇者)",
    "release_date": "2016-04-21",
    "developer": [
        "FK Digital",
        "Flyhigh Works"
    ],
    "publisher": [
        "Flyhigh Works",
        "CIRCLE Entertainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Captions available",
        "Steam Workshop",
        "Partial Controller Support",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Action"
    ],
    "achievements": 15,
    "positive_ratings": 35,
    "negative_ratings": 3,
    "price": 3.99,
    "description": "Witch &amp; Hero is an 8-bit style action game. You play as a hero accompanied by a witch taking on the evil Medusa, whom has destroyed many villages and towns with the monsters that stand before her. Medusa turned the witch into stone, so she is no longer able to move.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/434130/header.jpg?t=1463232685",
    "minimum_requirements": "OS: Windows 7 or above Processor: Pentium(R) Dual-Core CPU E6500 @ 2.93GHz (2 CPUs) Memory: 2 GB RAM Graphics: ATI Radeon HD 4670 or above DirectX: Version 9.0 Storage: 100 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "-------------------------------- FINAL IMPRESSION OF THE GAME --------------------------------  Before we get started, I should mention that this used to be a first impression review of the game after I bought it and played through the original version on the Nintendo 3DS. Some comments in the comment section may not add up to things written here, now that I actually finished playing through the steam port.  With that said, Let us begin and keep this short because english isn't my native language and the grammar mistakes become more apparent if I keep going on any longer. This is my final impression after playing through this on the regular difficulty.  Like I said before, this game originally came out on Nintendo's handheld the 3DS and was followed by a sequel a couple of months after. This game is an action-rpg that puts high emphasis on a tower-defense-, arcade-like feeling and stage progression. It was a nice little game that worked they way it was intended to be, but didn't really stood out and was good for short sessions... on a handheld!  --------------------------------  POSITIVES:  + Colorful 8-bit graphic for characters + Minor changes in graphics and animation + Instead of two screens you get one with everything + The use of both sticks for each character instead of the shoulder buttons + Controlling two characters works fine and isn't confusing for hands and eyes + Arcade-like RPG with stage progression + Time attack and survival mode after playing through the game once + A game for short sessions in between + Easy to get into + The cheat codes from the 3DS still work on this version  NEGATIVES:  - The use of 8-bit character sprites doesn't fit in some parts with the 16-bit backgrounds of the stages - Stage backgrounds really look like they came straight out of RPG-Maker - Minor changes in graphics and animation, which doesn't amount to anything - You can control two characters, but you don't have to. Just set the witch on wind magic and you don't have to aim at all and got one hand free for other stuff - The final and only true boss battle has become insultingly easy after a certain change in the port - Despite the arcade-like nature of the game, you will get bored after a short while - No reward in playing through the game and that 'unlockable function' was not worth it - Time attack and survival mode should feel like rewards, but they don't... - The 'cheat codes' unless they added new ones, are actually the friggin' difficult settings of the game - It gets really repetitive after a while, but that was a also a problem of the handheld version - The (to me) useless update for the screen size to be changed through Alt+Enter, despite the fact that the size could already be changed through pressing F1 on the keyboard. Unfortunaly the instructions for this are almost completely obscured by the english title on the title screen and only become visible after changing the language to either japanese or chinese! Seriously, WHY!? - Barebones option menu that only allows you to change either language or which stick should be used for either of the two characters - The game sound cannot be changed from within the game itself  --------------------------------  OVERALL:  Well, that final impression turned out to be mor negative than my initial first impression of the steam port. And yet it still gets the thumbs up from me. Why? Because I still enjoyed the game for what it was even though some flaws became more apparent on the bigger screen. The game really works as a nice little distraction for a few minutes and just like on the 3DS, everything works the way it was intended to be. It's just a shame that the game feels like it has less to offer on the big screen than on two tiny ones.  If you already own the original and the sequel on 3DS, then there is no reason to buy the steam port. Those who don't own any of the two games, should really consider if there isn't any better alternative to this.",
            "review_score": "1"
        }
    ]
}