{
    "app_id": 434260,
    "name": "My Name is Mayo",
    "release_date": "2016-02-15",
    "developer": [
        "Green Lava Studios"
    ],
    "publisher": [
        "Green Lava Studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Leaderboards"
    ],
    "genres": [
        "Casual",
        "Simulation"
    ],
    "tags": [
        "Memes",
        "Casual",
        "Clicker"
    ],
    "achievements": 50,
    "positive_ratings": 1809,
    "negative_ratings": 397,
    "price": 0.79,
    "description": "This is a clicking adventure that simulates the real-life tapping of a Mayo Jar! You will unveil its story and (maybe) you will learn from it!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/434260/header.jpg?t=1455545122",
    "minimum_requirements": "最低: OS: XP, Vista, 7, 8, 9 or even 10 プロセッサー: An OK one メモリー: 512 MB RAM グラフィック: Anything that can run solitaire. ネットワーク: ブロードバンドインターネット接続 ストレージ: 20 MB 利用可能 サウンドカード: Whatevs",
    "recommended_requirements": "推奨: OS: 11? プロセッサー: The Best one メモリー: 1024 GB RAM グラフィック: Seriously, anything that can run solitaire. ネットワーク: ブロードバンドインターネット接続 ストレージ: 100000 GB 利用可能 サウンドカード: Whatevs is better 追記事項: *Mayonnaise overconsumption may be hazardous to your health*",
    "reviews": [
        {
            "review_text": "My Name is Mayo is a simple clicker game. Sit and click on a mayo jar for an hour or two to unlock acheivements.   The 'story mode' is activated by clicking on the jar while a prior achievement is selected, which changes the appearance of the jar. Some of the thresholds for achievements are very high, but it is extremely easy to max them out in a short period of time.  In the end, My Name is Mayo is nothing more than 'filler' in your Steam library. Finish it once and never turn back. However, for only $0.99, the game is not too terrible a deal. I got it on sale for $0.49. This is pocket change, people. Nothing worth getting fired up about. In fact, sell off some of your inventory and you'll be able to purchase games like this in no time.",
            "review_score": "1"
        },
        {
            "review_text": "It's a simple game. There's not much too it. You just click on a jar of mayo 10,000 times and keep changing the selected acheivement to progress. Only one song repeated forever. Should probably be free.   Easy 100% achievement game, has cards, I did not hate it.",
            "review_score": "1"
        },
        {
            "review_text": "Sure I recommend this. Give yourself finger strain injuries and 50 achievements in less than an hour! What's not to like?",
            "review_score": "1"
        },
        {
            "review_text": "I lean back, tickle my jar and realize I don't know myself anymore...  If you were ever searching for a deeper insight into the life choices, philosophy, love life and dress sense of mayonaise, search no more! ^U^",
            "review_score": "1"
        },
        {
            "review_text": "Get a bunch of achievements and a game completion for $.59. That's about all its worth. Stories are kinda funny too.",
            "review_score": "1"
        },
        {
            "review_text": "My Name is Mayo is a game about clicking a mayonnaise jar until you've successfully destroyed the left mouse button. If you're an achievement hunter this game is for you, same thing for the trading cards-idlers out there. ",
            "review_score": "1"
        },
        {
            "review_text": "The Clickable Lives of Mayonnaise.",
            "review_score": "1"
        },
        {
            "review_text": "A very fun casual game. Unbelievable how much you can get for 99 ct. The artwork, the little details and just design are very well made!",
            "review_score": "1"
        },
        {
            "review_text": "This game is a joke. The punchline? Those who have been giving it negative reviews.  It's an amusing distraction that, by its' very existence, is a commentary on the inanity of clicker games and achievement hunting. There are also little 'story modes' as you progress your clicks that are quite worth the time.   The description makes it clear what this game is all about. So for people to come on here complaining that it's not really a game, that it's a waste of time....you've just added to the layers of this creation, and I thank you for it.",
            "review_score": "1"
        },
        {
            "review_text": "0.59EURO to click on a jar of Mayo 10.000 times... So worth it :)",
            "review_score": "1"
        },
        {
            "review_text": "My mouse won't stand much longer after play this game.",
            "review_score": "1"
        },
        {
            "review_text": "I give it a solid catsup/mayo                   its alright",
            "review_score": "1"
        },
        {
            "review_text": "This game is a godsend. A masterpiece amongst the drivel that populates the gaming scene that is produced by giant mega greed corporations such as EA and Ubisoft. It brings to the table a story as strong as the Witcher 3, a tale of love as sad as Shakespeare's finest and tactical gameplay among the likes of CIV 5 and action like that of Counter Strike.   I could not be more pleased with what has been given to me, and how riveted I was for the time it took me to play and complete this expansive world following the tale of solidarity this jar of mayonnaise follows. This should be immortalized in the halls of the Louvre for how revolutionary it is.   I give this game a solid 10/10  I ♥♥♥♥in love mayo",
            "review_score": "1"
        },
        {
            "review_text": "10/10 my wife walked in on me playiong and killed hersolef ",
            "review_score": "1"
        },
        {
            "review_text": "I payed 65 cents to molest mayonnaise.  #Better than ♥♥♥♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "Very simple and fun clicking game. Story is done through the achievments which you can select through a menu. I had to alt-enter the game to put it in window mode since alt-tab would seem to crash it. That also fixed my second monitor from flickering.  Overall a creative and fun game.  **POTENTIAL SPOILERS** I also believe the story revolves around you trying to get a mayo jar open. While you are trying to open it you are remembering when you had to try and get previous mayo jars open throughout your life. You also start to remember other difficult condiments like ketchup. After a long struggle, you are finally able to open it however.          YouTube™ Video:  Mayoin'&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Best 30 minutes of my life",
            "review_score": "1"
        },
        {
            "review_text": "Best game, A+, 10/10 5 stars",
            "review_score": "1"
        },
        {
            "review_text": "I really feel like I shoudn't have paid money for this...",
            "review_score": "1"
        },
        {
            "review_text": "The cute little stories for clicking were enjoyable and made me laugh a couple times. I'd say it wasn't a bad purchase.",
            "review_score": "1"
        },
        {
            "review_text": "some how i cant stop playing",
            "review_score": "1"
        },
        {
            "review_text": "Playthrough:         YouTube™ Video:  Video Game Shenanigans! [My Name Is Mayo]&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "First word that comes to mind is . . . sadistic. Then . . . where is my steam cards? But yeah all you do is click click click away like some dork because you want to see what happens next which isn't much but . . . that's the point isn't it? An amusing game to buy for your friends who are like me when it's on sale. Must see what happens . . . why am I still clicking?",
            "review_score": "1"
        },
        {
            "review_text": "A time waster. It's good if you're looking for an easy self-clicking-speed test. (lol) I would recommend it to those who play for achievements and some cards. :)   The ending is a bit cheesy. 'Open yourself to others like you have opened this jar of mayo'  Can't open yourself to others with 10,000 clicks. lol",
            "review_score": "1"
        },
        {
            "review_text": "The best game ever !! so funny and nice,",
            "review_score": "1"
        },
        {
            "review_text": "5.9/10 - If you didn't know... Clicking 10,000 times takes about an hour!  I didn't know what to expect with this game; it's my kind of dumb though! This is basically just a fun clicking competition between friends. I love seeing the number of clicks from my friends; I'm currently sitting #2 with 12,200 clicks and will surpass them all. Maybe…  This is one of the easiest games to complete with 100% achievements. Worth the $0.99 if you are searching for those; otherwise only play if you are into clicking competitions.   Worth $0.59-0.99 for achievements and a wrist workout!     Accidently Reviewed",
            "review_score": "1"
        },
        {
            "review_text": "Lets just say 26 mins of my life staring into blackspace was spent on this game =) #worth",
            "review_score": "1"
        },
        {
            "review_text": "Well... I dont know what I can say about this Mayo. It taught me how to love, how to live, and how to click. Without this Jar of sophisticated mayo I dont think I would have graduated from high school. Thank you Mayo.",
            "review_score": "1"
        },
        {
            "review_text": "Open yourself like you opened this jar of mayo  -Ghandi",
            "review_score": "1"
        },
        {
            "review_text": "Best way to kill your Gaming Mouse and it is cheap!",
            "review_score": "1"
        },
        {
            "review_text": "I'm sorry nan, this jar is too tough for me to open for you.",
            "review_score": "1"
        },
        {
            "review_text": "Would recommend this game to anyone looking for free achievements. 10,000 click and you get all of the achievements, I also got a good laugh along the way.",
            "review_score": "1"
        },
        {
            "review_text": "What to say about this game:  I bought it for a laugh and after a long process on tapping my mouse and cramping my hand and fingers and seeing the antics of this random jar of Mayo I realised that this was not reality but a hallutionation caused by boredom.  5* 10/10 and all that and a bag of chips! Great clicker / Time waster.",
            "review_score": "1"
        },
        {
            "review_text": "This game dude, not only is thuis masterpiece about god damn Mayonaise it even has a better love story than twilight the connection between the player and this jar of mayo is inseperable and imortal. The story is amazing full of plot twists and ups and downs oh my its making me sweat just thinking about it, what im saying is you should get Michael Bay over here and interview this classy Mayo jar for a new film 'The Fault In Our Mayo' story about a dying girl who finds love in the arms of a young handsome Mayo jar filled with yummy Mayo (No sexual reference). belive me it will get all the awards.   Thank Me Later!!!!  P.S Buy This Game it will warm your heart and soul (if you belive in souls)",
            "review_score": "1"
        },
        {
            "review_text": "So many butthurt people over a cheap ♥♥♥ game, don't listen to them, this game is more interesting than their lives",
            "review_score": "1"
        },
        {
            "review_text": "This is the best game i have ever owned. It gives me this feeling of euphoria i have never experienced on this magnitude. With every click it just grows stronger. Even when i have to drag myself on, when it's over i feel so satisfied. It's almost as if someone is loving me through this game. Everyone needs to play this.         play the mayo, feel the mayo, conform to the mayo.   ",
            "review_score": "1"
        },
        {
            "review_text": "If you like cheesey jokes and clicking for achives it's a fun hour, I recomend playing with some one to take turns clicking. Kids can come in handy. Keep your expectaions low and you will love it :)",
            "review_score": "1"
        },
        {
            "review_text": "Rob what the ♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "It cost 50p. Clicked for half an hour. Got 100% achievements.",
            "review_score": "1"
        },
        {
            "review_text": "This game helped me reach a whole new level of procrastination tonight, instead of doing uni work I've got all 50 achievements and over 10k clicks.  I'm going to fail my second year of uni.  10/10 would recommend",
            "review_score": "1"
        },
        {
            "review_text": "I'm vegan and find this offensive!",
            "review_score": "1"
        },
        {
            "review_text": "'Open yourself to others...  Just like you opened this Jar of Mayo!'  Definitely a funny game, unless you already have carpal tunnel syndrome. And if you don't have it, you will get it by playing this game 'til the end (10.000 klicks).  Have fun! :D",
            "review_score": "1"
        },
        {
            "review_text": "this game features an exhilerating story, profoundly groundbreaking gameplay, and next gen graphics. it features everything one could want in a game and so much more. i cannot describe how depratley you need this game, i urge you, please enrich your living experience with this absolute masterpeice",
            "review_score": "1"
        },
        {
            "review_text": "short,easy,funny takes maybe 1 hour to get all 50 achievements if thats what your in to worth the 50c i got it for i guess thats 1c per achievement",
            "review_score": "1"
        },
        {
            "review_text": "Pros: - An okay way to test your auto-clicker  Cons: - Everything else  Thanks for the 100% in 26 minutes, Mayo.",
            "review_score": "1"
        },
        {
            "review_text": "I paid $0.60 to spend the past 30 minutes of my life clicking a jar of mayonnaise 5,000 times. 10/10 what am I doing with my life?",
            "review_score": "1"
        },
        {
            "review_text": "Click Mayo.  Get achievements.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "&gt;be me &gt;browsing steam for games &gt;buy a game called my name is mayo &gt;I play it &gt;one hour later &gt;I get all the achievments &gt;then I realise that my life is a lie &gt;I quit the game &gt;I drive to a local supermarket  &gt;I go to the condiment area &gt;take off clothes &gt;shout I AM THE MAYO &gt;go into fetal position &gt;get tazed by a feminist who thinks I'm a sicko who want to ♥♥♥♥ her &gt;another person calls the police &gt;ten minutes later police arrive  &gt;get arrested &gt;I'm still in jail",
            "review_score": "1"
        },
        {
            "review_text": "This game is SO intense in graphics no-one can get 60 fps on it  Clicked bikini Mayo  69/21 Wold Mayo again",
            "review_score": "1"
        },
        {
            "review_text": "I have nothing bad to say about this, but I also don't have much good to say. The humor in the game is alright if you care enough to pay attention to it, It has very easy achievements and cards, so you should pick it up on sale if you care about those things.  The gameplay is incredibly short for a clicker, you beat it after 10,000 clicks, and there isn't any reason to play after that unless you missed some of the 'story' achievements.",
            "review_score": "1"
        },
        {
            "review_text": "Shut up, and take my money.",
            "review_score": "1"
        },
        {
            "review_text": "Do you have nothing to do with your life and don't need any difficulty whatsoever? Then this is the game for you! My IQ dropped by 50 playing this game, but it was totally worth it",
            "review_score": "1"
        },
        {
            "review_text": "So i just beat this game and man was it amazing, i have never seen such great graphics in a game like this, the story is amazing and will leave you lost for words, I very much recomend this game.  10/10 IGN",
            "review_score": "1"
        },
        {
            "review_text": "11/10 better than CoD   and now it's time for reallife...",
            "review_score": "1"
        },
        {
            "review_text": "i got RSI and brain   defet   defects from this game",
            "review_score": "1"
        },
        {
            "review_text": "This game broke my mouse and it was worth it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is too cheap. The cats and dogs make this a 1 euro game :)",
            "review_score": "1"
        },
        {
            "review_text": "was so touched by this game...best 59 cents i've ever spent on anything. It's not another cookie clicker knock-off, it combines real clicking skill with multiple story lines that each pack a powerfull message to those that have the willpower to complete them.  a 100% must play  rated 6.66/6.66 9/10 doctors reccomend, the last one was clicking",
            "review_score": "1"
        },
        {
            "review_text": "50 cents for Steam cards and 50 easy achievements for tapping a jar of mayo.   Why the ♥♥♥♥ not.",
            "review_score": "1"
        },
        {
            "review_text": "Easy 100% achievements totally worth it.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 IGN Would Click Again",
            "review_score": "1"
        },
        {
            "review_text": "Got 50/50 achievements in 20 minutes. Also got my self some carpal tunnel. 50 achievements and carpal tunnel for 65 cents?   6/12000 would recommend",
            "review_score": "1"
        },
        {
            "review_text": "The best game about Mayo on steam. Easy achievements and trading cards to boot. Great character developement but I'd like to see more RPG elements added to the sequel. 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "I knew mayonnaise was an instrument.",
            "review_score": "1"
        },
        {
            "review_text": "The fastest perfect game I have ever achieved!  No walkthrough needed!  Rich story! Great music!  ...  What am I doing with my life? :D",
            "review_score": "1"
        },
        {
            "review_text": "As a child, I grew up not liking mayonaise. Tonight, I ate a burger with mayo on it. Also, tonight a good friend bought me this game as a gag. I have been playing nonstop, and it is worth every penny of that $0.59 discount, plus some. Clicking non-stop is the definition of fun in my opinion. I will likely develop RSI or some hand disorder, but I am sure I will die happy.  This game may lack superb graphics, but it is more competitive than any FPS shooter on the market.  Pros: nearly endless  Cons: also nearly endless  overall: If you have a dollar that you found at a gas station, or simply just want to pull a prank on a friend, I highly recommend this dank *** 'game'. It is my favorite title in my entire library.  Bless the souls of this game's creators.",
            "review_score": "1"
        },
        {
            "review_text": "what am i doing with my life?",
            "review_score": "1"
        },
        {
            "review_text": "My mom always told me that pressing the Mayo jar was bad. This game gives me the chance too follow my darkest desire.",
            "review_score": "1"
        },
        {
            "review_text": "Was so excited I didn't read the description at all. I thought this was a Sakura Clicker DLC!! Either way able to play with one hand and there's bikini achievements!",
            "review_score": "1"
        },
        {
            "review_text": "This game is exelent, it suits my needs, and is a perfect video game!",
            "review_score": "1"
        },
        {
            "review_text": "I don't recall ever playing a game that made me question my sexuality toward mayonnaise jars.",
            "review_score": "1"
        },
        {
            "review_text": "My finger wouldn't stop clicking for 1 hour. How awful..",
            "review_score": "1"
        },
        {
            "review_text": "This game may not have the most advanced mechanics (or any mechanics). But what is does have is a sense for puns, a reasonable pricetag and great capacity to give you carpal tunnel syndrome (unless you want to play it hard core without auto clickers).  12/10 - IGN",
            "review_score": "1"
        },
        {
            "review_text": "My Name is Mayo is a simple clicker game that can be addictive. It is a short game with really no purpose besides 'learning the true meaning of mayo'. Here are some of my pros and cons on the game.  My Pros: Fun to idle/play around with the stories while you are tapping Mayo  You can get all the achievements easily (got like 50% of them within 7 minutes) Different 'costumes/gamemodes' that are achievable after playing each story  My Cons: The Price (It is $1. Luckily I got it for 40 cents in a sale)  Personally I like the game because I like simple indie/clicker games. If you don't like short games, you should DEFINITELY not get this game, especially for the price. Overall, it is a good game, especially if you like getting an easy 100% game. ",
            "review_score": "1"
        },
        {
            "review_text": "Basically cookie clicker, yet better and amazing.   I'd give this game 10/10 Mayos",
            "review_score": "1"
        },
        {
            "review_text": "I'd say I got my money's worth out of this, solid story telling, enough gameplay to call this a game.  Honestly I enjoyed this far more than I was expecting to",
            "review_score": "1"
        },
        {
            "review_text": "Easily the weirdest thing I spent over an hour playing.  Pointless and mind numbing but it keeps a person busy. Some of those jars I hesitated to touch... now I feel dirty. Still worth what I paid for it.",
            "review_score": "1"
        },
        {
            "review_text": "I laughed, I cried, I made sandwiches. It is a short game and correctly priced.",
            "review_score": "1"
        },
        {
            "review_text": "i got the first 13 achivements in 6 mins ",
            "review_score": "1"
        },
        {
            "review_text": "Yo, baby.",
            "review_score": "1"
        },
        {
            "review_text": "All you do is click the mayo can.......Why is this game not free. I recommend it becasue you get mad achievments until you hit 700 clicks. then it dies. Dont know if the game really has a plot or not. But Im sure this game can run on any pc, phone, or in real life. Find a Jar of Mayo World and start clicking. HA.",
            "review_score": "1"
        },
        {
            "review_text": "Was fun killed a decent 37 mins while i was waiting for a better game to download the story (ha who read that) was alright (i think) it was like a couple of sentences, the game is basically a time waster i u wanna kill about half an hour pick it up an enjoy plus its good for u achievement hunters out there",
            "review_score": "1"
        },
        {
            "review_text": "WARNING: Heavy dose of memes",
            "review_score": "1"
        },
        {
            "review_text": "great game",
            "review_score": "1"
        },
        {
            "review_text": "What i'm doing with my life.",
            "review_score": "1"
        },
        {
            "review_text": "'open yourself to others... Just like you opened this jar of mayo' would get told a life lesson again 10/10",
            "review_score": "1"
        },
        {
            "review_text": "great game",
            "review_score": "1"
        },
        {
            "review_text": "Most compelling story of 2016.",
            "review_score": "1"
        },
        {
            "review_text": "Even though the game is a simple as opening a jar of mayo (hehe) the game's hidden story is worth the 10,000 the hits",
            "review_score": "1"
        },
        {
            "review_text": "Clicked on a jar of mayo 10000 times and got 50 achievements as a reward +wasted a total of 1.63 €. 10/10 would not play again.",
            "review_score": "1"
        },
        {
            "review_text": "I can't feel my right hand. But this game is awesome, i finished it in half an hour. but all together its funny and quite fun.",
            "review_score": "1"
        },
        {
            "review_text": "In this game I learnd meaning of life",
            "review_score": "1"
        },
        {
            "review_text": "⁧ ⁨",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would smash my spacebar again",
            "review_score": "1"
        },
        {
            "review_text": "Welcome to the retro world of My Name is Mayo, an obscure title that lives up to its name. An entertaining and hilarious, never-ending causal clicking game that will give you a craving for mayonnaise and aching finger workout that will make you come back for more clicking goodness! It’s a brilliant timewaster, a blast of fun, and a relaxing activity after long day of staring at the computer screen at work.  Plus checkout at all those achievements, you’ll be “Yee Gods, look at all the Achievements”! Each achievement tells a wild and (at times) a bizarre story about a Mayo Jar. From Random Facts about life to a banana, a censored mayo jar, and so on. You will be laughing your brains out from pure enjoyment of such a silly and joyful game!  I highly recommended it to anybody who loves causal games, comedy, or mayonnaise.  This game deserves 10/10 delicious jars of Mayo!  ",
            "review_score": "1"
        },
        {
            "review_text": "30 minutes and got all the achievements, 5/5",
            "review_score": "1"
        },
        {
            "review_text": "Hello! I forgot to write a review for this marvelous game!  I sat at my desk for an hour clicking and clicking and clicking until I beat the game. It's my biggest life achievement, really. I recommend this game completely and totally, It's pretty much the peak in all gaming, new and old.",
            "review_score": "1"
        },
        {
            "review_text": "This is the most profound clicker I've ever played.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "A simple, aesthetic clicker with short stories hidden in the achievements. I genuinely enjoyed clicking a jar of mayonnaise 10,000 times.",
            "review_score": "1"
        },
        {
            "review_text": "Spent 99 cents. Wasted 30 minutes of life. Clicked 10,000 times. Unlocked 50 achievements. MAYONNASSIUM!! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This could be the best money I have ever spent. Sexy Catsup Mayo, that's all I got to say.",
            "review_score": "1"
        },
        {
            "review_text": "This could be the best money I have ever spent. Sexy Catsup Mayo, that's all I got to say.",
            "review_score": "1"
        },
        {
            "review_text": "You've already played this game by clicking on this review, actually by clicking on anything at all.",
            "review_score": "-1"
        },
        {
            "review_text": "Why does this exist?",
            "review_score": "-1"
        },
        {
            "review_text": " INGREDIENTS: Water, Rapeseed Oil (25%), Spirit Vinegar, Glucose Syrup, Modified Maze Starch, Pasteurised Salted Free Range Egg Yolk (3.7%), Dijon Mustard, Potassium Metabisulphite, Acidity Regulator [Citiric Acid], Sugar, Salt, Acidity Regulator [Tartaric Acid], Stabilisers [Xantham Gum, Guar Gum] Preservative [Potassium Sorbate]  Suitable for vegetarians, no artificial colours, flavours or hydrogenated fat.   Instructions for anyone looking to save the 47p. Locate Kitchen, locate Mayonaisse, locate bedroom, locate significant others underwear drawer, obtain bra / thong / briefs. Dress up jar of mayo in underwear, prod repeatedly with your finger until sore. Don't get caught or your relationship will never be the same,  @devs where's the sodding patch for the Magnum Opus that was Faenix Rage that we've been waiting on for the past year, too busy making games about jars of Mayonaisse eh, eh, eh?",
            "review_score": "-1"
        },
        {
            "review_text": "My Thoughts on 'My Name is Mayo'  PROS - I caught a couple of achievements before I got a refund - My current poopy mouse's right button is broken, further incentivising me to invest in a new one.  CONS - I don't think I need to explain  On a more serious note, the positive reviews make me worried about Steam's future.",
            "review_score": "-1"
        },
        {
            "review_text": "For those who want 50 achievements and a free perfect game in a disproportionate amount of time, buy this on sale. Well I guess they do refunds and this is nowhere near 2 hours... But I won't, because I'm not even going to bother trying to hide why I own this.  If you don't care about that, just don't waste your time and money. You could get mayo packets for free from fast food joints, and those have much more to offer.  To be fair, it is a bit humorous to see mayonaise with whipped cream nipples.",
            "review_score": "-1"
        },
        {
            "review_text": "Valve dosent care what they sale as long as Gaben gets his $$$$",
            "review_score": "-1"
        },
        {
            "review_text": "I got a headache from the sound of the mayo and my mouse and my space bar consantly making noise.",
            "review_score": "-1"
        },
        {
            "review_text": "Obvious joke game, all you do is click a jar of mayo.",
            "review_score": "-1"
        },
        {
            "review_text": "I don't get it.  I click and a story was kind of told. Kind of. But not really.   50 achievements for 0.59$ though",
            "review_score": "-1"
        },
        {
            "review_text": "This is the most stupid game I ever played. But its good to try and get a game up to have 100% achievements unlocked. So I give it 4/10.",
            "review_score": "-1"
        },
        {
            "review_text": "I got this game as a gift... why couldn't someone just buy me a real jar of mayo? Then I could tap that until it opens. :)",
            "review_score": "-1"
        },
        {
            "review_text": "game to easy lol just click and click",
            "review_score": "-1"
        },
        {
            "review_text": "-Not the clicker you want-  I play a lot of clickers/idlers, usually for free. This mh 'game' is about clicking 10000 times to get 50 achievements basically and game's finished - nothing left to do.  Use an auto-clicker if you must. UI registers about 10 clicks per second it seems. Better yet save yourself the money and do something useful instead. This is as dumb as its name.",
            "review_score": "-1"
        },
        {
            "review_text": "This seems like a satire of a clicker game, like if The Colbert Report had focused on ponzi schemes in video games instead of politics. But by being satire this itself seems a bit of an underhanded way to get a buck off of consumers while providing a product that, although you may be in on the joke, is still crap. You click 10,000 times and some jokes of mild hilarity pass--not terribly funny after the first 2-3 and there are around 50. After said 10k clicks and selecting a few things from an achievement menu you've unlocked 50 achievements and a perfect game. If you want 50 more achievements and a perfect game in under 30 minutes for the price of $1, sure I get that; however, that is the only reason to purchase this game.",
            "review_score": "-1"
        },
        {
            "review_text": "  One of those games, when you have clicked 5000x on mayo bottle and then you realized: 'What the F@#k am I doing right now? Is there a purpose in living ?'",
            "review_score": "-1"
        },
        {
            "review_text": " 2/10  - Barely worth it, even on sale. Sorry!  You get an hour - at max - out of your dollar spend, which is good, but it comes with a lot of but's...  1st... ,but  it has no replayability at all. Once you're done there's no point in coming back.  2nd... ,but  it fails at being humorous, although it trys to be. Maybe it's just not my sense of humor, but this game barely manages to be funny in any way.  3rd... ,but  there is barely any gameplay. You just click about 15k times, and thats it - you beat the game. No upgrades, no stages, kinda no progression. No depth at at all. Its just very flat...   4th... ,but  it's kind of worth it, in case you're in for the achievments. Well it's a quick and easy 100%-game to add to your stats and the achievments are actually the interesting part of the game, since they are the only thing well designed in that game.   Overall  i can't recommend this game to anyone, who's not looking for an addition to their achievment stats. It just isn't a game at all. Its a demo at max.",
            "review_score": "-1"
        },
        {
            "review_text": "rated M for mayo",
            "review_score": "-1"
        },
        {
            "review_text": "I did not want to break my mouse, if you love clicking stuff for very little reward play this.",
            "review_score": "-1"
        },
        {
            "review_text": "It's like if you took cookie clicker, and then removed all the good elements from it.",
            "review_score": "-1"
        },
        {
            "review_text": "Not enough Mayo",
            "review_score": "-1"
        },
        {
            "review_text": "The first 100 clicks gave me some giggles, then the game became unfunny later on. I seriously don't know why i have to spend money for clicking a mayonnaise. Oh well, i just did this for a 100% achievement.",
            "review_score": "-1"
        },
        {
            "review_text": "Well.. You get to click on a Mayo Jar But you also get to... jk, you only click on a mayo jar Achievements are crazy easy to get and i beat the game in an hour  Rating 1/10 Would recommend to anyone who likes clicking things or somebody who likes to see easy achievements pile up in a matter of minutes",
            "review_score": "-1"
        },
        {
            "review_text": "Left click on a jar of mayo. Left click on a jar of mayo. Left click on a jar of mayo. Left click on a jar of mayo. Left click on a jar of mayo. Left click on a jar of mayo. Left click on a jar of mayo. Left click on a jar of mayo. Left click on a jar of mayo. Left click on a jar of mayo. Left click on a jar of mayo. Left click on a jar of mayo. Left click on a jar of mayo. Left click on a jar of mayo. Left click on a jar of mayo. Left click on a jar of mayo. Left click on a jar of mayo. Left click on a jar of mayo. Left click on a jar of mayo. Left click on a jar of mayo. Left click on a jar of mayo. Left click on a jar of mayo. Left click on a jar of mayo. Left click on a jar of mayo. Left click on a jar of mayo. Left click on a jar of mayo. Left click on a jar of mayo. Left click on a jar of mayo. Left click on a jar of mayo. Left click on a jar of mayo. Left click on a jar of mayo. Left click on a jar of mayo. Left click on a jar of mayo. Left click on a jar of mayo. Left click on a jar of mayo. Left click on a jar of mayo. Left click on a jar of mayo. Left click on a jar of mayo. Left click on a jar of mayo. Left click on a jar of mayo. Left click on a jar of mayo. Left click on a jar of mayo. Left click on a jar of mayo. Left click on a jar of mayo. Left click on a jar of mayo.       Left click on a jar of mayo.",
            "review_score": "-1"
        },
        {
            "review_text": "Go play AdVenture Capitalist or cookie clicker instead, those games at least have a point to them, unlike this literal piece of ♥♥♥♥. Oh and they are also free",
            "review_score": "-1"
        }
    ]
}