{
    "app_id": 434370,
    "name": "Buried: An Interactive Story",
    "release_date": "2016-01-22",
    "developer": [
        "Bromoco Games"
    ],
    "publisher": [
        "Bromoco Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Text-Based"
    ],
    "achievements": 0,
    "positive_ratings": 115,
    "negative_ratings": 5,
    "price": 1.99,
    "description": "Buried is a playable, interactive story told through stunning photos, a haunting soundscape, and gripping text. You play the role of Roger Hastings, a logger working the forests with his crew. When he awakens to find his friends missing and no memory of what's happened, he begins searching, uncovering something that should have stayed...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/434370/header.jpg?t=1453498005",
    "minimum_requirements": "OS: Windows XP Service Pack 2 Processor: 2.0 GHz Memory: 2 GB RAM Graphics: DX9 (shader model 2.0) capabilities DirectX: Version 9.0c Storage: 472 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This is a very simply made game: static image backgrounds, text and music. No amazing 3D graphics, dazzling explosions or killer AI enemies... What is amazing is the terrific, immersive story you are drawn into.  The tale begins with you waking up after some kind of accident in the woods. You try to find out what has happened and are gradually drawn into lethal mystery. All the elements are top-notch. Great characters. Creepy environments. Discoveries that are both baffling and horrific. And threats that are chilling and relentless.  During the story, you regularly make decisons that will affect the narrative. You may find yourself crushed by a choice which leads to an awful death. I found there were sufficent decisions to be made to keep you deeply involved without detracting from the game's biggest strength, which is the storytelling.  The writing is gripping from start to end. For me, it felt like being trapped in a truly sinister Stephen King story - it was that good.  Negatives? Other than a few typos near the end of the story (which didn't spoil the game), none at all.  Playtime: 3-4 hours.  Overall: 10/10. I'd love to play another game like this from the same production team!",
            "review_score": "1"
        },
        {
            "review_text": "I describe this as a Poor man's version of a telltale game  Serious revieuw;   I am still short into the game, but let me tell you, wow. It has been a while i was so evolved with the story of a game. The text is easy and good to follow, choises are clear and all have they'r results on what will happen. If you liked Telltale games then you will adore this. It is heavilly inspired by it and 1 thing that shows it is that at each chapter you get a little menu that shows how many % of what players made what choise. *random example* 36% of the players desided not to inspect ______ body.  To give you a idea.  Do i recomend it? Yes. Totally. If you like atmospheric games and reading. Totally go for it!   1 thing i have to confess is that they made the mistake of not making it feel YOU are there, dont get me wrong but they let you play as a 41 year old guy that owns a wood chopping company, if they gave the idea that it was you standing there and you could fill in names of friends then it truly is a masterpiece.  Maybe just me but non the less it's great. i love it so far",
            "review_score": "1"
        },
        {
            "review_text": "Great if you like reading reading and then some reading! Myself i like to play games. Would i reccomend this? No id rather watch my close family been mauled to death by a pair of bengal tigers whilst listening to tom jones greatest hits. Hope that helps :(",
            "review_score": "-1"
        }
    ]
}