{
    "app_id": 434480,
    "name": "Mathoria: It All Adds Up",
    "release_date": "2016-03-30",
    "developer": [
        "Senshi.Labs"
    ],
    "publisher": [
        "Senshi.Labs"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Casual",
        "Free to Play",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Free to Play",
        "Indie",
        "RPG"
    ],
    "achievements": 0,
    "positive_ratings": 41,
    "negative_ratings": 35,
    "price": 0.0,
    "description": "A free educational math RPG that caters to children. Helps in practicing basic addition skills through drills while adventuring in the land of Mathoria. Also aims to target educators and gamer parents alike, so that Mathoria can become a bonding tool between them and the children they care for.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/434480/header.jpg?t=1459385508",
    "minimum_requirements": "OS: Windows 7 Processor: Intel Core i3 Memory: 4 GB RAM Storage: 50 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "It's a good time for maths: games about them keep appearing on Steam. After  Pythagoria  and  Zeus vs Monsters  (links lead to my reviews), here's Mathoria: It All Adds Up, developed by a student team, with a teacher as supervisor, who happened to be also a little publisher in Philippines.  Mathoria: It Alls Adds Up is telling the story of a young teen, happening to be The Chosen One, whose mom is abducted by goons. It's up to him to save her, by visiting the island, by defeating obstacles and by helping others. His skills maths will be useful, especially his addition knowledge.  The game is simple: you lead a character thanks to the arrows or ZQSD/WASD (forget the mouse), you speak to other persones who will ask you to answer a problem, like 'My brother ate 20 apples yesterday, I ate 35 today, how many apples in total have we eaten?'. The answer field consists in 4 cases for each number (the first one is for the thousand, the second one for the hundred, the third for the dizain, the last one for an unity - for the answer of the problem above, it should look like 0055).  You have also some fights to handle: you have the choice between a simple attack (with adapted calculs, generally, the easiest you can find during a battle) and powers (with calculs that are more complicated to answer like 465+354). The equation is shown on your screen, you have a timer (ranging from 5 seconds to 30 depending of the difficulty). Hit 'Enter' so that the answer field is appearing, write the answer and hit 'Enter' again. If your answer is right, the damage will be inflicted to your enemy, if it's not, it's you that will loose health.  Like in a RPG, you can use potions to double the damage, speed up the process of using again your powers or heal yourself. However, it's not the only items in the game: you can also put a set of clothes that can improve or decrease your HP or your damage. It means that you have to be careful for answers as a set can inflict 60 damages but leave you with 10 HP only. A single wrong answer and you're dead - though in the game, dying isn't accepted: goons are putting themselves on the side when defeated, much still alive.  You have three difficulties: I've played the Easy one, as I didn't want to be confronted to harder calculs, even if in the end, I was because of the powers.  There are several problems that can be improved if there is any sequel.  For me, the most important is probably the one that will never be taken in account: the game is in English, which means that any non-English speaker kid can't answer the problems unless an adult can translate. However, as the game is only about addition, you know that you need to add this number to this other one. But still, for sequels, if there is a mix of calculs with substraction or multiplication or division, there will be a problem.  The second one is related to the fact that I've explained the controls above: you don't have really any tutorial in real time: you have to read what is explained (again in English), if you don't miss the characters that will tell it (for the fight, it's included naturally, not for the problems). You're speaking to kids, it's way more useful to show them in real time than rely on the fact that they've understood the mechanics just like that.  The third problem is that it's short. In more or less 1h30, I was already at the end. Not that I don't complain, because for kids, it's not too short. However, it would have been much better to have a little more of exploring. However, given the end, it seems clear that the idea of a sequel was in their heads and that substraction could be the next focus.  The fourth problem is the difficulty: an easy difficulty for me means calculs like 1+9, 10+10 but not 345+114. For any young kid that can't handle these, they can't use the powers and are just stuck to use simple attacks, which means that some of the enemies will take long to defeat. The developers should revise the difficulty at least to stick more to it.  I don't mind the fact that the game was made with RPG Maker - a blog post explains the beginning of the conception where Unity wasn't easy to handle for Mathoria. But it's not a bad move as the game can still attract children.  Mathoria isn't as bad as the reviews seemed to say. Many of the players missed the full point of the game, which is drilling in mental calcul and only saw the fact that they didn't get a RPG. Anyway, while Mathoria isn't perhaps the best educationnal game out there, it's still a nice try. It's free, so, your wallet will not be hurt by this one. It's worth a try.",
            "review_score": "1"
        },
        {
            "review_text": "OH MY GOD! THIS GAME HAS ALL THE THINGS I LOVED AS A KID!! The Math is Superb The music is nostalgic The level design is ingenius and challenging The only one thing this game lacks is a volume controll but if your as tech-savy as I am you'd just edit the volume in sound options.  The story is so compelling so heartwarming, and the twist at the end :O  9/10 would add again (get it xD)",
            "review_score": "1"
        },
        {
            "review_text": "Superb title. I can't wait for Mathoria 2: The Difference Between Us, Mathoria 3: Force Multipliers, and Mathoria 4: Divide and Conquer.         Oh, did you want an actual review? I don't recommend this title because there are no enemy animations, you have to hit confirm when a question pops up before time runs out, there's no timer for inputting the answer, and the first enemy took 20 hits to finish, which was 15 more than I had patience for. It didn't feel like a game, it felt like a math quiz, down to getting a single point for each correct answer. There was no element of strategy, tactics, or luck. No quitting, no escape, no fun.",
            "review_score": "-1"
        },
        {
            "review_text": "i loved it!!! ITS AMAZING its pretty short though but everything else is amazing the graphics and the fighting and everything its really cool!!!! i HIGHLY RECOMMEND THIS GAME",
            "review_score": "1"
        },
        {
            "review_text": "Not that bad actually. It's a very short game, so if you need to kill time play this game.",
            "review_score": "1"
        }
    ]
}