{
    "app_id": 434430,
    "name": "Abbot's Book Demo",
    "release_date": "2016-04-04",
    "developer": [
        "The Abbot's Book, LLC"
    ],
    "publisher": [
        "Blackthorn Media, LLC"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "VR Support"
    ],
    "genres": [
        "Adventure",
        "Free to Play",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Adventure",
        "Free to Play",
        "RPG"
    ],
    "achievements": 0,
    "positive_ratings": 155,
    "negative_ratings": 18,
    "price": 0.0,
    "description": "A trailer for the 8-episode narrative VR The Abbot's Book.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/434430/header.jpg?t=1478550281",
    "minimum_requirements": "OS: Windows 7 Processor: i7 Memory: 8 GB RAM Graphics: nVidia 970, AMD rx480",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "A chilling glimpse into the upcoming eight-part Abbot's Book. I loved the eerie atmosphere and attention to detail. Although the demo is very short, I spent longer just admiring the environment as I explored the dark ruins by the light of a torch. Spooky, with a brooding gothic tone. I can't wait to see more!  ",
            "review_score": "1"
        },
        {
            "review_text": "Spooky and the priest that follows you around has this lifelike quality where I found myself wanting to talk to him. VR is still new and I look forward to better graphics in games like this. As it stands, very atmospheric.",
            "review_score": "1"
        },
        {
            "review_text": "+ Architecture looks dark / scary / realistic + NPCs look weird / strange / disturbing + / - Very constricting navigation system + / - Not very interactive, except look around / listen to dialog - Player talks, with simple dialog choices - Story seems bland / unintersting - No hand models (just Vive controllers)  It's a short demo, but one that makes me want a bigger play area. Inside the catacombs, I tried my hardest to walk through every bit. The experience of having a torch in hand and walking in a dark gothic setting is awesome. I prefer a silent protaganist though. Having someone talk for me, expecailly in VR, disconnects me from the moment.",
            "review_score": "1"
        },
        {
            "review_text": "wow, awesome atmosphere. The design of the catacombs is freakin epic. LOVE IT",
            "review_score": "1"
        },
        {
            "review_text": "Very promising VR experience !",
            "review_score": "1"
        },
        {
            "review_text": "  Wow the part when you enter an open cave is amazing, the cave is absolutely massive!",
            "review_score": "1"
        },
        {
            "review_text": "Could be cool. The plot is compeling, the voice acting good, and the layout/design of the play area are varied.  Not sure if this genre is for me.",
            "review_score": "1"
        },
        {
            "review_text": "Nice atmospheric demo. You decend into a cave with a torch in your hand. Really good graphics and effects. Some little suprises.  Looking forward for more of this.",
            "review_score": "1"
        },
        {
            "review_text": "Superb dark atmosphere and graphics. An interesting look-at-defined-spots movement mechanic, took me a bit to get used to in comparison to the free-teleporters like Vanishing Realms, but then works ok with this type of game. Also, no jump scares so far for me, which is a plus. You may nope out once zombie Gollum heads for you though...",
            "review_score": "1"
        },
        {
            "review_text": "This has potential. I'm undecided at the moment as to whether I'll purchase.",
            "review_score": "1"
        }
    ]
}