{
    "app_id": 434490,
    "name": "Otem's Defiance",
    "release_date": "2016-04-25",
    "developer": [
        "HyperBerry Games"
    ],
    "publisher": [
        "HyperBerry Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Captions available",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "Story Rich"
    ],
    "achievements": 36,
    "positive_ratings": 28,
    "negative_ratings": 0,
    "price": 4.99,
    "description": "You play as Otem, a child who has been chosen as a sacrifice to the gods of his tribe. As they materialize in the center of the ring-shaped arena, you must dodge their attacks and fight back to survive the ritual and uncover the secrets of this gruesome tradition lead by the mysterious Shaman.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/434490/header.jpg?t=1465872623",
    "minimum_requirements": "OS: Windows 7 32 bit Processor: Intel i5  or similar Memory: 2 GB RAM Graphics: Intel HD Graphics 4000 or similar DirectX: Version 10 Network: Broadband Internet connection Storage: 4 GB available space Sound Card: Integrated Sound Card Additional Notes: If using Nvidia Graphics card, make sure to set it as the default option to run this app",
    "recommended_requirements": "OS: Windows 10 64 bit Processor: Intel i7 or similar Memory: 8 GB RAM Graphics: NVIDIA GeForce GTX 970 or similar DirectX: Version 12 Network: Broadband Internet connection Storage: 5 GB available space Sound Card: Integrated Sound Card Additional Notes: If using Nvidia Graphics card, make sure to set it as the default option to run this app",
    "reviews": [
        {
            "review_text": "  I got it as a gift from my friend and I love it! The controls are spot on and the graphics are very colorful. One minor thing I found as a con is that the tutorial texts vanish a bit too fast and had to restart it to see what it was saying.",
            "review_score": "1"
        },
        {
            "review_text": "This game is really hard!!",
            "review_score": "1"
        }
    ]
}