{
    "app_id": 434650,
    "name": "Lost Castle",
    "release_date": "2016-08-31",
    "developer": [
        "Hunter Studio"
    ],
    "publisher": [
        "Another Indie"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Co-op",
        "Online Co-op",
        "Local Co-op",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Action",
        "Adventure",
        "Multiplayer"
    ],
    "achievements": 81,
    "positive_ratings": 11930,
    "negative_ratings": 1392,
    "price": 6.99,
    "description": "Lost Castle is an action RPG beat'em up with roguelike elements and randomized dungeons for up to four players!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/434650/header.jpg?t=1544092834",
    "minimum_requirements": "OS: Windows xp/7/8/10 Processor: 1.6 Ghz Memory: 2 GB RAM Graphics: GeForce 8800 or Radeon® HD4800 series, 512 MB of memory Storage: 600 MB available space Sound Card: Any",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "EARLY ACCESS REVIEW: This is a great game for early access! There is a dragon gun, many random dungeons, banana peels that save lives, and much more. I haven't finished the game yet or even scratched it. Pros: Easy to run. (And i have a really ♥♥♥♥ computer) Great roguelike elements. A ♥♥♥♥ ton of weapons and items. Unique potions and armor.  Cons: Made for console. Very hard controls for pc, recommend changing them. There is no multiplayer yet, but there will be soon (i hope)*there is local co-op. Lots of spelling mistakes, but understandable since english isn't their first language. A random glitch that changes your language to chinese [restart game and it is fixed]  Overall i say this game is a 9/10 Yes... I may have cried when i didn't make it past the first room. I only cried a little bit... Just a few buckets of tears... Maybe a ocean... I flooded the world.... It doesnt matter! BUY THE GAME! -------------------------------------------------------------------------------------------------- RELEASED GAME REVIEW: -Lost Castle is an amazing dungeon crawler/roguelike game. -I've been playing this game since early access and its been an amazing experience. -I am on my third run of the game, and the lore is pr333ty gud, you will have to buy and play the game to find out. I see a lot of Dark Souls references, intended or not, its pretty cool. -The enemies can be tricky and random, and the bosses can be hard depending on what you have. -The final boss on the second playthrough made me cry. I BEAT ITS FIRST STAGE, THEN ITS SECOND STAGE, AND I ♥♥♥♥ING HAD NO FOOD FOR THE BOSSES THIRD STAGE. i die den i cry but eventually i rekt that b0ss. -I need about 10 more achievements to 100% the game, comment if you 100 percented the game. -The game is really enjoyable, i play for the achievements and for 100% completion some of the time, but mostly for fun. -I gives this game a 9.5 out of 10. I definitely recommend it to anyone looking for a sick dungeon crawler/roguelike game. Nominated for the Game within a game award.",
            "review_score": "1"
        },
        {
            "review_text": "Game's alright. Theres a lot of stuff ot unlock but the combat is kind of boring. Overall its an alright game. Just dont expect an amazing game.   Some people compare it to rogue legacy or castle crashers. Terrible comparison. Castle crashers you leveled up toward a goal. This game you dont even level up. Same with rogue legacy. The combat in that game was at least entertaining. This is slow as f. Dont waste your money",
            "review_score": "-1"
        },
        {
            "review_text": "Bought because it looked like a castle crashers, 16bit Zelda type game. I was very happy that I bought this. Whilst it's not as adventurist as Zelda, I do think it's better than castle crashers. It offers multiple replay oppertunities and with the developer still adding material I couldn't be happier. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Awful combat mechanics. Everything feels sluggish and clunky, and you can move in X and Y directions but only attack in X. Waste of a few bucks",
            "review_score": "-1"
        },
        {
            "review_text": "The multiplayer is very buggy. I had to restart the game several times in order to get past the first three screens. The gameplay is very generic and unfun. Roguelikes always involve a degree of skill but this game is just overall bad. I would not recommend this to anyone looking for a Co-Op playthrough the likes of Rampage Knights, it is a much better game.",
            "review_score": "-1"
        },
        {
            "review_text": "I came across a land shark, what else do you want?",
            "review_score": "1"
        },
        {
            "review_text": "82%",
            "review_score": "1"
        },
        {
            "review_text": "It wasn't so great, not the type of game i'd be playing for more than an hour. Personally i don't like the animation style, the art style is really good, though. The soundtrack is average. But it just isn't the game for me.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game, my girlfriend and I played early access for hours. Tho we actually liked the old music better haha It would be totally awesome to have an option to choose between the two :)",
            "review_score": "1"
        },
        {
            "review_text": "Literally one of the hardest games i have ever played. i honestly want to beat my head in my desk evrytime i die. that being said i feel the only time you can go relatively far with are the weapons that have a ranged attack. fun game but needs work. i only recommend this game if you want to stress yourself out.",
            "review_score": "-1"
        },
        {
            "review_text": "don't get down by people saying the game sluggish at times or its hard to control  I play this game with keyboard, and this game is pure mechanical and tactic, you cannot just hack and slash the enemies, you need to keep moving, each weapon types offer different moveset and i will rank it from easiest to hardest to master:  1. musket 2. bow 3. staff 4. spear 5. sword and shield 6. broadsword 7. dual blades  the game PUNISH you for attacking at random you NEED to know the attack pattern of enemies but once you have their pattern its more easier to beat the game  you like castlevania? buy it you like metroid with less platforming? buy it you like old dungeon crawler game like chocobo dungeon, tower of druaga, azure dreams, etc? buy it  prepare your reflex though",
            "review_score": "1"
        },
        {
            "review_text": "a highly simple yet super addictive game. Highly recommend this game for retro game lovers",
            "review_score": "1"
        },
        {
            "review_text": "Think Castle Crashers + Rogue Legacy/Spelunky.  There's a few different weapon types, and several different options within the types. I got lucky on my 5th life and had life regen (with each kill) and additional armor (mithril gun) before too long, which enabled me to go far.  It's fun, and I am satisfied with my purchase.",
            "review_score": "1"
        },
        {
            "review_text": "I liked this game a lot. It might be repetitive, but the incentive of spending your souls and getting new weapons was enough to keep me going. Each weapon has different skills and it´s fun to test them all. Money well spent!",
            "review_score": "1"
        },
        {
            "review_text": "Freaking awsomely difficult! The graphics aren't 'all that', but the gameplay is phenomenal! You Start, you Fight, you Die, you choose your Upgrades, you Start, you Fight, you Die again. Totally hooked!  I just wish it still had the original Early Access Soundtrack. It was awesome! For anyone wondering what the difference was. Watch the 3rd Video on the Store Page.",
            "review_score": "1"
        },
        {
            "review_text": "In case anyone occasionally reads this ... I was not a man of reviewing unitl sitting in a train having nothing to do this moment. The idea of Why not give reviews to all my games suddenly came to my mind and Bang! This is it.  Nice piece for killing time in my gf's outdated Macbook air XD Wish for more cute girl characters to join with the warriors!",
            "review_score": "1"
        },
        {
            "review_text": "Mix equal parts Castle Crashers and Rogue Legacy. Chill and serve.",
            "review_score": "1"
        },
        {
            "review_text": "It has monsters that look like male genetalia, and they squirt at you.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "I barely recommend this game. It's got great gameplay, but the random weapon and character selection, as well as the difficulty to actually get started, and the lack of ability for skipping the beginning cutscene really brings down the value for me. I hate when I spawn with a giant sword, and pretty much have to go die before I can progress.",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "Honestly I didn't think this game looked all that good judging by the gameplay videos, I thought it looked like a slow flash game. I decided to buy it though and try it for myself, and I was pleseantly surprised. All the animations work so well, the graphics are very vibrant and colerful and good to look at, and the art design is really well done. The responsive controls and unique weapon animations make it feel really good to play.  Gameplay wise, there's endless fun to be had with the huge variety of weapons and unlocks, and the fact that things are random every time keep each run fresh and interesting. Unlike a lot of other rouge-lite games I didn't find myself getting bored with it that quickly. This is one of those games I always have fun going back to no matter how many times.  There's a lot of reviews that talk about how good the multiplayer is, but I've only ever played solo and have had quite a bit of fun so far, so don't let not having anyone to play it with stop you from trying this out.  Overall this is highly recommended if you're a fan of rouge-like style games.",
            "review_score": "1"
        },
        {
            "review_text": "Be WARNED  This game is a clone of Rogue Legacy, it's the same premise, You start with a random character with a random weapon, you go in to the dungeons, pick up gear and weapons from chests you get every time you clear a room and off some merchs that appear randomly. You get souls randomly from regular mobs you kill and from bosses, you use these souls to upgrade your character permanently and to unlock the Blacksmith (which gives you up to 4 weapons to choose from from the get go), a Thief (that gives you up to 4 chest to loot from) and a Pharmacist (he gives you radom potion).  So the game's mechanic is just like Rogue Legacy, you go in, clean as many rooms as possible to collect XP and souls, you die, and repeat.  Problem here is, the game is God damn EASY, I finished it on my firts run with useless items lol... I mean I'm going straight to the cons and pros.   +Good cartoony graphics +A good amount of items to unlock each time you defeat a boss.  -Too easy -Levels looks the same -Only 5 Stages -Lack of monster variety (it is supposed to have 68 different mobs, all I see in 5 hours of play was the same 3 types of Goblins, 2 types of spiders, 3 types of skeletons, a dog, a hog and 3 types of demons) -Supposedly you get to fight up to 21 different bosses yet after 5 hours I've only fought the same, a Goblin Chariot, a Slime, a Dinosaur, a Spider (the dumbest boss cause it does nothing), a Cyclops and the Final boss. -BGM... forgetable af. -Sound effects are too generic -Weapons feel the same, so far the Muskets fire animation is the same, Staves animations are the same but different colors, same with swords and daggers and bows -Companions, most of them are too damn broken -So far I found 2 staves that make this game freaking easy to win (A healing staff and a staff that gives the 'BLACK HOLE' special attack, this attack will attrack any enemy to it's center and deal damage, EVEN BOSSES! LMAO! -Mob density per room is a joke (you get up to 10-15ish enemies tops, yet they are no challnege at all) -Did I said TOO EASY?  All in all, this game was a total DISSAPOINTMENT, I tried to refund the game but I got denied cause of the 5 hours. I mean this type of games can't be debunked in just 2 hours, I kept playing in hopes the difficulty to be adjusted accordingly to my upgrades but it won't. The game is damn easy as it is, now that you have pretty much your char fully upgraded, you clean the rooms in no time.  I could keep up with the negatives, but I don't feel like it. All I know is that I really feel ripped off.  P.S. There is a HUGE EXPLOIT, an EASY AF way to get INFINITE SOULS, that is when you fight the Cyclops, that boss is ♥♥♥♥♥♥♥♥ af. All he does is running from side to side spawning little cyclops, these cyclops are easy to kill and they die from the big rocks the cyclops drop from stomping the ground. So the exploit consist of you running around killing the little cyclops and collecting souls. I maxed my upgrade tree thanks to this ♥♥♥♥♥♥♥♥ exploit GG devs, GG.",
            "review_score": "-1"
        },
        {
            "review_text": "The game itself is perfectly balanced, not taking itself too seriously yet providing challenging battles and entertaining cutscenes.",
            "review_score": "1"
        }
    ]
}