{
    "app_id": 434740,
    "name": "Lichtspeer",
    "release_date": "2016-09-27",
    "developer": [
        "Lichthund"
    ],
    "publisher": [
        "Lichthund"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "Adventure"
    ],
    "achievements": 20,
    "positive_ratings": 92,
    "negative_ratings": 19,
    "price": 6.99,
    "description": "LICHTSPEER is an unforgiving fast-paced lightspear-throwing simulator set in an ancient germanic future. Get ready to feel that beloved 80’s arcade rush in this brutal, stylish and psychedelic adventure. Embrace the future, eat Strudel, play LICHTSPEER.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/434740/header.jpg?t=1498286522",
    "minimum_requirements": "OS: Windows XP 32 bit Processor: Intel Core™ 2 Duo 2.0+ GHz Memory: 2 GB RAM Graphics: DirectX 9+ Compatible DirectX: Version 9.0 Storage: 450 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This game brings back old memories of an old arcade gaming with with a modern twist! It's very challenging at first but onve you get used to it - you want to keep going and get through new levels. Ze-German twist is also very funny! Defnitely recommended!! For this price - it's a steal. Go and have a strutzel.",
            "review_score": "1"
        },
        {
            "review_text": "Omy God i love this game Ok so ive been playing the normal mode campain for a few hours and i cant describe hopw amazing this game is Id say if you wanted a description of the game watch a video so i would rather say what i like and dislike about the game.  Pro's: The art is amazing,Perfect level of difficulty,Creative Bosses,great mechanics,Alot of content (quite a few levels)  Cons: I would realy like an infinity mode or like waves mode for this cause it is the perfect game for it,When you hit an enemy the camera shakes a bit much  thats all the bad things i can think of but other wise Truely amazing game",
            "review_score": "1"
        },
        {
            "review_text": "I cried. Not because it was sad, but because of the fish.  ♥♥♥♥ you fish.",
            "review_score": "1"
        },
        {
            "review_text": "Nice, but not worth the money. It would have been OK for 3-4 Euros. Ever visited 'Jayisgames', there you find lots of free Indie and flash games as well as recommendations for non-free games. Over the years I played dozens of pretty funny and nice flash games with a pretty similiar gaming concept as 'Lichtspeer'; killing Zombies, destroying Castles etc. Lichtspeer has interesting grafics, the humour is great etc. But the gameplay is (of course) very repetive and nothing special or innovative at all. It's a game you play here and then for some minutes. I've bought it and I won't ask for a refund, because it was pretty obvious, what I would get. I only expected to have more fun!  The game just speeds up the enemies, who are pretty similiar most of the time, and that's what changes from level to level. You, standing there, expecting hordes of enemies that are getting faster. There would have been much room for many, many little gags and ideas that wasn't used. So you have the graphics that blow you away, but only for a second. Apart from that you have no innovation at all.",
            "review_score": "-1"
        }
    ]
}