{
    "app_id": 434820,
    "name": "Brushwood Buddies",
    "release_date": "2016-02-17",
    "developer": [
        "Steven Colling"
    ],
    "publisher": [
        "Steven Colling"
    ],
    "platforms": [
        "windows",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Casual",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Casual",
        "Puzzle"
    ],
    "achievements": 13,
    "positive_ratings": 51,
    "negative_ratings": 13,
    "price": 2.09,
    "description": "In Brushwood Buddies, an unusual puzzle game, adorable creatures will enlist your help to craft various items as they journey through forests, grasslands, and villages! Discover tons of recipes, and find clever ways to manage inventory space and resources while keeping your buddies happy.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/434820/header.jpg?t=1528131778",
    "minimum_requirements": "OS: Windows Vista or better Processor: Dual Core CPU Memory: 1 GB RAM Graphics: 128 MB Video Memory, Shader Model 2.0+ DirectX: Version 9.0c Storage: 200 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Another elemental mixure/crafting puzzle game.. quite fun and interesting yet very difficult.  A friend told me developer's email to request this beta test key...  So far i have played for 4 hours... solved a few levels but quickly getting stuck on the even one of the earlly level. There no guide out yet and this game is quite unexpectedly challanging... Maybe be i will replay once there is a recipe guide out...  From the challage mode i can tell there 5 item mix to create some of the items.  130+ different items to use.. 5 buddies to collect.. many challage u can try to compete with other online steam users...  Very simple and basic sound/music effect for this game. Cartoonish graphics that doesn't look like it too much effect...  My only problem with the game is the elments mix sometime on't quite make sense.. why is the saw come for X + X? Logically it doesn't always make sense...  Anyhow... would be a fun game to play with your yonge kids and I can only recommend puzzle lover that tolerate basic graphics for this game.  Recommend for 7/10..",
            "review_score": "1"
        }
    ]
}