{
    "app_id": 435030,
    "name": "Lost Lands: Mahjong",
    "release_date": "2016-03-14",
    "developer": [
        "FIVE-BN GAMES"
    ],
    "publisher": [
        "FIVE-BN GAMES"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Free to Play"
    ],
    "tags": [
        "Free to Play",
        "Adventure",
        "Casual"
    ],
    "achievements": 46,
    "positive_ratings": 3769,
    "negative_ratings": 309,
    "price": 0.0,
    "description": "Solve many tile sets, quests and adventures to get your prizes and collections. Help the elves to survive on the lost island.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/435030/header.jpg?t=1505905114",
    "minimum_requirements": "OS: XP/Vista/7/8/10 Processor: 1.6 GHz Memory: 512 MB RAM Storage: 250 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Sweet little game if you want to flatline your mind.",
            "review_score": "1"
        },
        {
            "review_text": "The game is ok, but it's a little annoying to wait your energy bar fills up. Anyway, I recommend this game to anyone who enjoys playing mahjong and wants to have a good time.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great MaH Jong game &amp; if Mah Jong isn't your thing you can play this game other ways. It's an adventure but never gets boring. I give this game at least 5 Stars.",
            "review_score": "1"
        },
        {
            "review_text": "I Love The Game So Much Yeah I Do Thank",
            "review_score": "1"
        },
        {
            "review_text": "Its just a fun adventure game of Majong",
            "review_score": "1"
        },
        {
            "review_text": "I really do enjoy the game. and the game is not only set up for young people but for older people alike!!!",
            "review_score": "1"
        },
        {
            "review_text": "it is a good game",
            "review_score": "1"
        },
        {
            "review_text": "I really like this game it is a good mind relaxer , and it helps me wind down after work. I would most likely recomend this game to my friends.",
            "review_score": "1"
        },
        {
            "review_text": "It is a typical Facebook like game that gives you about 30 mins to an hour of playing time and then you have to wait for your energy to refill slowly over a few hours. Otherwise you have to buy energy or items for a buck or two.  It's a fun tile matching game that encourages the player progress with various quests to find different items. It looks very nice and has a nice soundtrack. I was actually looking for a real Mahjong game, but the mindless tile matching sucks you in.  It does get annoying when you just randomly get a board that has no way to complete it and you have to start over. There are many different tile setups and you are timed with better awards if you do it fast enough.  It is free so what is there to lose but your life?",
            "review_score": "1"
        },
        {
            "review_text": "it good for what the game is clearly suppose to be",
            "review_score": "1"
        },
        {
            "review_text": "I would like if you had an option to play mahjong game without the energy but with no progresion, like practise.",
            "review_score": "1"
        },
        {
            "review_text": "Nice game.",
            "review_score": "1"
        },
        {
            "review_text": "I like that the blocks are easy to find. The edge pieces are lit up, so it takes the guess work out of whether a piece can be used. The chect puzzle are fun. I find the game strangely addicting. I get on a couple of times a day to play when my energy has refilled.   Needing specific items to access some of the levels is frustrating, but I realize that it adds complexity to the game.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun to play. Started slow but once learn some things it is very entertaining and hard to stop playing",
            "review_score": "1"
        },
        {
            "review_text": "Fun game but hard to play without spending some money",
            "review_score": "1"
        },
        {
            "review_text": "pay if you want to play for a while if you're really casual though and don't play a lot sure",
            "review_score": "1"
        },
        {
            "review_text": "I'm a stress monkey so all this waiting is taking it's toll on me, but great fun.",
            "review_score": "1"
        },
        {
            "review_text": "Simple easy to follow challenges to the age old Mahjong.",
            "review_score": "1"
        },
        {
            "review_text": "Not Bad",
            "review_score": "1"
        },
        {
            "review_text": "great game to loose a few hours to",
            "review_score": "1"
        },
        {
            "review_text": "Lots of fun ",
            "review_score": "1"
        },
        {
            "review_text": "I love Majong puzzles, and solving quests in-game. They're easy and relaxing, love the background music. I play this at least once a day (for the daily prize thing and waiting on energy to regenerate to do a new level, which surprisingly doesn't take as long as I thought it would)  I'd like to get my mo to play this, however; she won't download Steam.. But there are tons of game from Pop-cap Games that she would like (for example: Insaniquarium), and I bet she would like this one too.  ",
            "review_score": "1"
        },
        {
            "review_text": "I love the game. A couple of problems though: 1. Where are the seeds?! And how do I get them without paying for them? 2. I hate having to play a timed mahjong game. It takes some of the fun out of it. 3. It takes forever to complete some achievements which makes me not want to play.",
            "review_score": "1"
        },
        {
            "review_text": "I find the game interesting. A combo of mahjomg and RTS. Fun.",
            "review_score": "1"
        },
        {
            "review_text": "A long long way to complete it!",
            "review_score": "1"
        },
        {
            "review_text": "I really like the game so far. It needs a bigger energy bar but aside from that the story is fun and the game is fast paced.",
            "review_score": "1"
        },
        {
            "review_text": "I give this game a 10 star rating. It is the best game I have ever played. ",
            "review_score": "1"
        },
        {
            "review_text": "a good game plenty to do and not hard at all to play .",
            "review_score": "1"
        },
        {
            "review_text": "A good experience over all, though I wish you could play without the timer.",
            "review_score": "1"
        },
        {
            "review_text": "  Enjoyable past time, giving me a good break from my other games.",
            "review_score": "1"
        },
        {
            "review_text": "I like this game!!!",
            "review_score": "1"
        },
        {
            "review_text": "I like that the blocks are easy to find. The edge pieces are lit up, so it takes the guess work out of whether a piece can be used. The chect puzzle are fun. I find the game strangely addicting. I get on a couple of times a day to play when my energy has refilled.   Needing specific items to access some of the levels is frustrating, but I realize that it adds complexity to the game.",
            "review_score": "1"
        },
        {
            "review_text": "I previously gave this a thumbs up review. After all its something to kill some time till you run out of stamina. But... Don't get attached to your levels and progress. I logged in one day and POOF starting over back on level 1 like it was the first time I launched the game!",
            "review_score": "1"
        },
        {
            "review_text": "It's fun and time passing !",
            "review_score": "1"
        },
        {
            "review_text": "love the game. the graphics are awsome. great mix of story with the relaxation of mahjong.",
            "review_score": "1"
        },
        {
            "review_text": "I like the game. It is a very interesting twist from the standard way of playing.",
            "review_score": "1"
        },
        {
            "review_text": "A relaxing game !",
            "review_score": "1"
        },
        {
            "review_text": "as solitaire mahjong goes this one is pretty good, as a puzzle rpg it's better than most",
            "review_score": "1"
        },
        {
            "review_text": "Love this game",
            "review_score": "1"
        },
        {
            "review_text": "Pretty nice game to waste a bit of time.",
            "review_score": "1"
        },
        {
            "review_text": "Highly addictive",
            "review_score": "1"
        },
        {
            "review_text": "it is good for a free game",
            "review_score": "1"
        },
        {
            "review_text": "its not to bad",
            "review_score": "1"
        },
        {
            "review_text": "I like the game, it is entertaining. I however would like to play for longer but with limited engery I can only play for about 35-40 min at a time. Boooo! But the story lines are cute and entertaining and I enjoy match games.",
            "review_score": "1"
        },
        {
            "review_text": "The music is nice and relaxing, fun game to play to kill a little time.",
            "review_score": "1"
        },
        {
            "review_text": "Its got a little bit of a learning curve to the map area but it keeps it fun and always has you doing something :3",
            "review_score": "1"
        },
        {
            "review_text": "I had been looking for a good majong game that is not the old fashioned one. An i have found that in this game. I love the fact that you have a story line incorporated into the game. It makes it a lot funner to play an keeps my interest. So for a rating from 1-10. 10 being the top rating. I give this game a 10. I have very much enjoyed playing and will continue to play till i have beaten this game. Thank you for your wonderful service.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game,great for a free one",
            "review_score": "1"
        },
        {
            "review_text": "I like the mixof Mahjong and gaming",
            "review_score": "1"
        },
        {
            "review_text": "If you like Mahjong and like the kind of games that facebook provides (building civilisations whilst playing a game) then you'll love this!  Although it carries the same disappointment as the facebook games, that damn energy meter goes down too fast :)",
            "review_score": "1"
        },
        {
            "review_text": "If you enjoy mahjong, this game adds an interesting storyline to playing the game.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting game, energy replenishment is a bit too slow.",
            "review_score": "1"
        },
        {
            "review_text": "I like Majong.  Yeah, that's about it.",
            "review_score": "1"
        },
        {
            "review_text": "addictive ",
            "review_score": "1"
        },
        {
            "review_text": "Simple easy to follow challenges to the age old Mahjong.",
            "review_score": "1"
        },
        {
            "review_text": "i like this game very much it is well made and the storyline is alot of fun.",
            "review_score": "1"
        },
        {
            "review_text": "good game, clears the mind which is what i like",
            "review_score": "1"
        },
        {
            "review_text": "A very nice game to play. I like the layout and the quests you can do if you want. I really recommend it to others.",
            "review_score": "1"
        },
        {
            "review_text": "Nice game",
            "review_score": "1"
        },
        {
            "review_text": "  iT ISN'T THE EASIEST GAME TO FOLLOW--SOME THINGS ARE UNCLEAR",
            "review_score": "1"
        },
        {
            "review_text": "I wish it was not all timed, Would rather relax and play the game at a slower pace. Just want to play the game and not be stressed to get it done. I have enough stress.",
            "review_score": "1"
        },
        {
            "review_text": "This game is rather good for a simple matching game. It's nice and casual. I do wish there wasn't a limit with the whole energy thing. Because then when I run out, I have to wait a good lone while till I can play some more if I don't get stuff to replenish it. But I'd say it's all right from what I've played so far.",
            "review_score": "1"
        },
        {
            "review_text": "A great game for those enjoy Mahjong. Being given a timelimit really challenges one to get better a lot faster. The concept of requiring energy that builds over time is something that I've always disliked, but it's a good stall so people don't fly through the story. Has a few grinding elements that I enjoy. All in all a great puzzle game to challenge the mind.",
            "review_score": "1"
        },
        {
            "review_text": "Love the soundtrack!",
            "review_score": "1"
        },
        {
            "review_text": "Love Mahjong in general, the story adds something different to it which keeps me intrested",
            "review_score": "1"
        },
        {
            "review_text": "This is a great, casual game that will keep you engaged. The rules are easy to learn, yet the puzzles get harder so you aren't bored. I would reccomend this game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun, and has a lot of nice perks to it, very addicting!",
            "review_score": "1"
        },
        {
            "review_text": "I'm already a fan oh mahjong, interesting take on it",
            "review_score": "1"
        },
        {
            "review_text": "This is fun and addicting.",
            "review_score": "1"
        },
        {
            "review_text": "I like that there is a story line to it that keeps you interested in playing mahjong. Not crazy about the energy limit but its the way most games are now.",
            "review_score": "1"
        },
        {
            "review_text": "I'm a stress monkey so all this waiting is taking it's toll on me, but great fun.",
            "review_score": "1"
        },
        {
            "review_text": "Majhong. very slowwhen receiving rewards/bonus",
            "review_score": "1"
        },
        {
            "review_text": "Would recommand.",
            "review_score": "1"
        },
        {
            "review_text": "great game.",
            "review_score": "1"
        },
        {
            "review_text": "Nice to have a goal from MahJong besides clearing the board.",
            "review_score": "1"
        },
        {
            "review_text": "A fun addicting game that will get you going just to see what happendes next.",
            "review_score": "1"
        },
        {
            "review_text": "Classic and fun",
            "review_score": "1"
        },
        {
            "review_text": "I wish it was not all timed, Would rather relax and play the game at a slower pace. Just want to play the game and not be stressed to get it done. I have enough stress.",
            "review_score": "1"
        },
        {
            "review_text": "Rating this game is a quest. XD it's pretty interesting though. nice art &amp; music/sounds. pretty good story",
            "review_score": "1"
        },
        {
            "review_text": "I am enjoying the game, my only gripe would be paying to open the chests and the time limit to solve the puzzle, if there was a compromise like pay to open the chest and no time limit or not to pay but have a time lmit that would be more fairer. I would recommend the game though",
            "review_score": "1"
        },
        {
            "review_text": "This game is cool",
            "review_score": "1"
        },
        {
            "review_text": "The graphics, music and variety of mahjong puzzles you have. I emjoy it so much i forget what time it is.",
            "review_score": "1"
        },
        {
            "review_text": "It's Mahjong but on crack and it's great. The only downfall is the wait to play and the possible pay to play.",
            "review_score": "1"
        },
        {
            "review_text": "It's OK.",
            "review_score": "1"
        },
        {
            "review_text": "Very good game to kill time... It's reminiscent of mobile puzzle games, so it's not for everyone. However this is a fun game!",
            "review_score": "1"
        },
        {
            "review_text": "Nice storyline, excellent art and relaxing.",
            "review_score": "1"
        },
        {
            "review_text": "fun game, wish it wouldn't be time dependent on games",
            "review_score": "1"
        },
        {
            "review_text": "i love this game it keeps my mind going and keeps me from being bored and has quests and a whole bunch of various boards, i would highly recommend this game to any mahjong lover like me.",
            "review_score": "1"
        },
        {
            "review_text": "Still better than Assasin's Creed. Like that's saying much.",
            "review_score": "1"
        },
        {
            "review_text": "Lovely storyline and really nice graphics",
            "review_score": "1"
        },
        {
            "review_text": "good for early on ",
            "review_score": "1"
        },
        {
            "review_text": "great game",
            "review_score": "1"
        },
        {
            "review_text": "From what I've played so far, it's a decent game. It's great to kill some time. The only problem I have is that you have to wait for your energy to recharge. You can only play a few games before having to wait for your energy. Besides from that, I recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing what they have done to simple Mahjong. Thoroughly enjoying the ga,e",
            "review_score": "1"
        },
        {
            "review_text": "I am enjoying the game, my only gripe would be paying to open the chests and the time limit to solve the puzzle, if there was a compromise like pay to open the chest and no time limit or not to pay but have a time lmit that would be more fairer. I would recommend the game though",
            "review_score": "1"
        },
        {
            "review_text": "If you love mahjong, you'll love this. More challenging than you might think!",
            "review_score": "1"
        },
        {
            "review_text": "i realy like this game its pretty fun to play and i realy like the story line",
            "review_score": "1"
        },
        {
            "review_text": "It's really a nice game and i love it, and i don't like Mahjongs games that i found all this years in the internet!!",
            "review_score": "1"
        },
        {
            "review_text": "  makes fun to play only thing i dislike is that you play it with a timer, everything else is fun",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "Fun casual game even with the energy regen.",
            "review_score": "1"
        },
        {
            "review_text": "Majong with a storyline and goals, I don't run out of life very quickly which helps",
            "review_score": "1"
        },
        {
            "review_text": "really good mahjong game. Waiting for an update",
            "review_score": "1"
        },
        {
            "review_text": "This would be fine if it was just mahjong, but it isn't, for some reason they added all the aspects of a shoddy facebook game.  Also I think they ripped off the soundtrack from The Talos Principle",
            "review_score": "-1"
        },
        {
            "review_text": "wHat do u think? ♥♥♥♥ing energy system for play....",
            "review_score": "-1"
        },
        {
            "review_text": "The scenario (locations, quests, etc.) has some meaning in the 'Lost Lands A Hidden Object Adventure'. In the Mahjong version, however, it does not. In fact, it's just irritating. The same applies for the helping tools. They are much less meaningful here.  I like mahjong ... but not timed. Especially if one needs to calculate which stones to remove if there are 3 available, so that you won't stuck at the end.  And not to forget about the most annoying energy system, along with the fact that it's a pay-to-win 'free' game. (You have to pay to overcome the artificially created cumbersome 'features'.)",
            "review_score": "-1"
        },
        {
            "review_text": "Good play variety, but this game was clearly designed as a free to play app game.",
            "review_score": "-1"
        },
        {
            "review_text": "Mahjong...basically you match lots and lots of tiles.",
            "review_score": "-1"
        },
        {
            "review_text": "Game is kind of awful in the sense that they attempt to limit the experience. I have to wait hours to play further at a time and it's rather annoying. Fun if you have ~15 minutes to kill, but if you want to play further it's not happening.   The quests are disjointed and collections can be an awful nightmare.",
            "review_score": "-1"
        },
        {
            "review_text": "The game truly starts out fun, but moments later without warning, it is literally unplayable. What I mean is it is too hard or the timer is too fast. A decent game would not be made that way. This game is again, 'A pay to win game.' That means it SUCKS!!!!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "It is very boring and there are too many tiles to get three starts even early in the game. It is not very innovative nor really fun to play, mostly frustrating. This came cannot be recommended even as an app on a phone, let alone a PC game.",
            "review_score": "-1"
        },
        {
            "review_text": "  Another typical Mahjong tile matching game.",
            "review_score": "-1"
        },
        {
            "review_text": "Energy system ? Seriously ? I like mahjong and love collecting stuff in games so i thought i'd like this game but this energy system is just dumb. Nice art style though.",
            "review_score": "-1"
        },
        {
            "review_text": "Microtransactions: the Mahjonging",
            "review_score": "-1"
        }
    ]
}