{
    "app_id": 435070,
    "name": "Elansar",
    "release_date": "2016-01-11",
    "developer": [
        "OrionSoft"
    ],
    "publisher": [
        "OrionSoft"
    ],
    "platforms": [
        "windows",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "Point & Click"
    ],
    "achievements": 0,
    "positive_ratings": 7,
    "negative_ratings": 10,
    "price": 2.09,
    "description": "Elansar is a small myst like &quot;point &amp; click&quot; adventure game Explore an island and solve puzzles. Will you uncover the Island's mystery ?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/435070/header.jpg?t=1508093023",
    "minimum_requirements": "OS: XP or 7",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I liked this game, because I knew what I was expecting. It said a 'small myst like 'point and click' adventure game. I wasn't disappointed. It is indeed a short game, good for playing on a lunch break, and it is indeed myst like, though with the addition of an inventory and some comments from the protagonist when you try to do things. All in all, don't expect a massive, endlessly polished AAA title, because that's not what this game is. If however you expect a small myst like poit and click adventure, you won't be disappointed. I would recommend this game only for adventure game lovers though. The lack of action, explosions and monsters may be disappointing otherwise.",
            "review_score": "1"
        },
        {
            "review_text": "Wholly crap. How bad could this game ACTUALLY get? Coming off of Journey Down I was prepared for a game to be a bit less than that, but wow. This game is just unplayable! Can't get a menu, can't get out, changed my resolution. I had shut my whole computer off just to get out of this craphole. The 80's called, they don't want their games back. Myst is OVER. Move on.",
            "review_score": "-1"
        }
    ]
}