{
    "app_id": 43500,
    "name": "M.U.D. TV",
    "release_date": "2010-04-19",
    "developer": [
        "Realmforge Studios"
    ],
    "publisher": [
        "Kalypso Media Digital"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Simulation",
        "Strategy",
        "Management"
    ],
    "achievements": 0,
    "positive_ratings": 70,
    "negative_ratings": 85,
    "price": 7.99,
    "description": "Always wanted to see if you can hack the day-to-day life of a TV producer? Here's your chance! MUD TV is your ticket to the weird wild world of television. Once you take control of your own station it's up to you to determine the line-up, hire actors and directors, produce your own shows, series and movies and to grab those lucrative...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/43500/header.jpg?t=1542980487",
    "minimum_requirements": "OS: Windows XP SP2/Vista/7 Processor: 2 GHz Memory: 1 GB RAM Hard Drive: 2 GB of free space Graphics: 128 MB, DirectX? 9.0c-compatible (Shader Model 3.0 support",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "It may not sound it... But 'M.U.D TV' is a very fun tv broadcasting simulator! You can broadcast ads, shows, make shows, make your studio, check your stats, mess up other tv shows (kinda XD) and theres an npc called nuck chorris! 7/10",
            "review_score": "1"
        },
        {
            "review_text": "Would rather buy winrar",
            "review_score": "-1"
        },
        {
            "review_text": "I really dont understand why people have problems with crashes and stuff.. this game works great, it feels great, and it plays great. The concept is well executed and if you think like buying it then go ahead! dont listen to the negative reviews.",
            "review_score": "1"
        },
        {
            "review_text": "Rarely ever works. Even after getting a new desktop, it doesn't want to launch or crashes. Then once you're in the game, tutorial doesn't make sense.",
            "review_score": "-1"
        },
        {
            "review_text": "No support, No active updates. But the most important issue is thta the game won't start anymore and no one is answering my requests.  Good potential, pathetic execution and support team!",
            "review_score": "-1"
        },
        {
            "review_text": "I didn't suffer from any crashes. I enjoyed the game, but it can get quite difficult to manage 2 TV channels (Once you activate the upgrade) The graphics are okay, the menu/controls are somewhat difficult at stages, but it has a high fun-factor for me.",
            "review_score": "1"
        },
        {
            "review_text": "You run a TV studio, bout all i can say not a great game but not bad, not bad at all.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game for the first 5-7 hours, after that it is very repetitive.  It has a very steep learning curve. Lack of differant things to do.  Overall, would not recomend for the price, if its on sale then it might be worth it.",
            "review_score": "-1"
        },
        {
            "review_text": "would be a nice game if it wouldn't crash continously after day 8-14. Please visit kalypso-forums, you'll see nearly nobody ever was able to play more than 14 in-game-days. its nearly fraudy to publish a product which doesn't work at all...",
            "review_score": "-1"
        },
        {
            "review_text": "I now understand why this game was only 8 quid.",
            "review_score": "-1"
        }
    ]
}