{
    "app_id": 435480,
    "name": "Trials of the Blood Dragon",
    "release_date": "2016-06-13",
    "developer": [
        "Redlynx",
        "Ubisoft Kiev"
    ],
    "publisher": [
        "Ubisoft"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Racing"
    ],
    "tags": [
        "Racing",
        "Retro",
        "Platformer"
    ],
    "achievements": 20,
    "positive_ratings": 96,
    "negative_ratings": 50,
    "price": 12.49,
    "description": "The year is 2019. Roxanne and Slayter, the offspring of the legendary Rex Power Colt, are going to Vietnam War 4 to save freedom, and save the world.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/435480/header.jpg?t=1507630460",
    "minimum_requirements": "OS: Windows 7 SP1 or Windows 8.1 or Windows 10(64bit versions) Processor: Intel i3 550 @ 3.2 GHz or AMD Athlon II X4 620 @ 2.6 GHz Memory: 4 GB RAM Graphics: nVidia GeForce GTX460 or AMD Radeon HD5770 (1024MB VRAM with Shader Model 5.0) Storage: 15 GB available space",
    "recommended_requirements": "OS: Windows 7 SP1 or Windows 8.1 or Windows 10(64bit versions) Processor: Intel Core i5 2400s @ 2.5 GHz or AMD Phenom II X4 955 @ 3.2 GHz Memory: 6 GB RAM Graphics: nVidia GeForce GTX 560Ti or AMD Radeon HD7850 or better (2GB VRAM or more, with Shader Model 5.0) Storage: 15 GB available space",
    "reviews": [
        {
            "review_text": "PROS: - A lot of variety in gameplay - Interesting level designs and changes - Story has its funny moments - Great Set Pieces  CONS: - Short as all hell - Pretty easy compared to other Trails games - Voice acting is BAAAAAAD  I was kind of surprised to see this pop up on steam, I honestly thought it was one of those ♥♥♥♥♥♥ rip-offs that slide in through greenlight. Turns out this is all legit and once you actually start playing the game that becomes pretty obvious. The production values for the levels are way ahead of any of the previous Trials games. With most of them featuring at least one flashy set piece.  Of course the downside of that is that you end up paying more attention to the background and crash a hell of alot. In fact one of the biggest problems with the game is the fact that it mixes so many playstyles in together. In a single level you can go from driving a Tank to a motor bike to a Jetpack. Which is cool but does mean that you are not likely to get anything approaching a good time the first time through a lot of levels as you wrestle with the widely different handling of each mode.   One of the other downsides to the more polished and flashy levels is the length of the game. Even with a bunch of deaths I still beat the game in about two hours. Obviously I will go back and try to ace the levels which should double the time but compared to the length of Trials Fusion this is depressingly short.   Along with that the game never reaches the challenge of Fusion. You never really have to be that precise with your controls and it's only in the last level that you start to face more advanced challenges.  Having said all of that there is still a bunch of stuff I have yet to do in the game outside of the story missions. There are five secret keys to find each with a clue to where it is along with rewards for acing levels.   For £11.99GBP I think it is a tight little package. If you go in expecting something on the scale of Fusion then you are going to be disappointed but by the same token there are no levels in dull static warehouses to grind through. I like Fusion but it was pretty padded in some areas and this game doesn’t do that. Choosing to cut out all of the fat to give you pure spectacle.  ",
            "review_score": "1"
        },
        {
            "review_text": "This game should be judged as a Standalone DLC to Trials Fusion.  Gameplay wise it is basically a collection of Skill Games from Trials Fusion, with a couple of normal 'bike' tracks.  First playthrough of the game for most people would probably be about 3-4 hours.  This game, as with all other trials, has leaderboards, and that is where the replay value comes in if you are a competitive person. Look to my 'total time played' to see how much value I personally have gotten out of the game.  Keep in mind that because this should be considered a standalone DLC, There is no multiplayer or user created tracks. That part of the game is still on Trials Fusion. This was done on purpose as stated by developers in order to not uneccessarily split the community across 2 different Track Centrals. So if you want multiplayer or custom maps, then you should buy and play trials fusion. If you want a collection of skill games with a storyline, then buy this.  Just to make my point as clear as possible. For any of you that played Halo 3 and Halo 3: ODST. This game is Halo 3: ODST. AKA, New campaign, but if you want to play multiplayer, you are still playing Halo 3 (Trials Fusion).",
            "review_score": "1"
        },
        {
            "review_text": "If you liked blood dragons stupid plot and you've thought about getting into trials games, this is a great game to start with. Rushing through the story doesnt take more than a few hours and someone might not like the 2d shooter aspect it has on some levels. Other than that I liked it alot and had some good laughs.  Recommend it :)",
            "review_score": "1"
        },
        {
            "review_text": "Interesting. I am an average Trials player and it took me about 3 hours to finish it. So many will certainly finish it in under 3 hours. I would say wait for a sale.   I like that there was a story you played through, which was for the most part funny and entertaining. The music and art style was top notch and I enjoyed the shoutouts to Hotline Miami. The environments were very good and I wish they would encorporate much of it in the editor for Fusion. Also, the BMX bike was a blast from the past if you played BIke or Die.  However, the shooting was not enjoyable to me nor was the jet pack sections. I found both, but especially the jetpack, to be very difficult to control and rather tedious.   Overall pretty solid but not great.",
            "review_score": "1"
        },
        {
            "review_text": "I broke my hand while playing this game, but i'm good now would rate it 11/10 ~Olof",
            "review_score": "1"
        },
        {
            "review_text": "I must say I have very mixed feelings about this game after playing through the story. I bought it because I liked Fary Cry 3: Blood Dragon. The story in this game is entertaining and the soundtrack is great. The A E S T H E T I C S are on point but man the controls are just awful. I enjoyed the voice acting, and I think the game is very pretty, for what kind of game it is. However if you aren't usually a fan of the sidescrolling biker games, prepare to be frustrated. And ultimately.. While I really enjoyed the story.. For this price, I wouldn't really recomend this game to others unless you REALLY like this genre.",
            "review_score": "-1"
        },
        {
            "review_text": "Main issue is screen tearing with Vsync off and it will lock it to 30 (well 60, but it struggles to stay there) on a 4790k and 970. Will update if tyhey patch it to improve performance as the story is alright and gameplay, while infuriating, is fun.",
            "review_score": "-1"
        },
        {
            "review_text": "        YouTube™ Video:  Gander @ - Trials Blood Dragon&nbsp;",
            "review_score": "-1"
        }
    ]
}