{
    "app_id": 435790,
    "name": "10 Second Ninja X",
    "release_date": "2016-07-19",
    "developer": [
        "Four Circle Interactive"
    ],
    "publisher": [
        "Curve Digital"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Platformer"
    ],
    "achievements": 12,
    "positive_ratings": 135,
    "negative_ratings": 17,
    "price": 7.99,
    "description": "10 SECOND NINJA X is a hardcore sidescroller. You're a ninja, there are robots, you've got ten seconds to destroy them all. Get three star ratings, climb leaderboards, discover secrets and stop Captain Greatbeard.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/435790/header.jpg?t=1485769736",
    "minimum_requirements": "OS: Windows XP/7/8/8.1/10 x32 and x64 Processor: Intel Core2 Duo E6320 or equivalent / AMD Athlon 64 X2 5000+(2*2.6 GHz) or equivalent Memory: 2048 MB RAM Graphics: GeForce GT 440 (1024 MB) or equivalent / Radeon HD 6450 (512 MB) or equivalent / Iris Pro Graphics 5200 (1792 MB) DirectX: Version 10 Network: Broadband Internet connection Storage: 350 MB available space",
    "recommended_requirements": "OS: Windows XP/7/8/8.1/10 x32 and x64 Processor: Intel Core2 Duo E7300 or equivalent / AMD Athlon 64 X2 6000+ (2*3 GHz) or equivalent Memory: 2048 MB RAM Graphics: GeForce GT 440 (1024 MB) or equivalent / Radeon HD 6670 (1024 MB) or equivalent / Iris Pro Graphics 5500 (1792 MB) DirectX: Version 10 Network: Broadband Internet connection Storage: 350 MB available space",
    "reviews": [
        {
            "review_text": "I played 70 hours of The other game, Ten Second Ninja, and loved it. This game improves many things and adds 60 more awesome levels. Competing for stars and leaderboard spots is really fun. All 40 levels from Ten Second Ninja are in the game and with fixed bugs. The game looks much better, and plays much better. Some bugs here and there but overall no crashes. There is also just a lot more content in the game with story and improvements to the marathon mode, leaderboards, and mechanics. Each new 'world' adds a cool, fun mechanic. If you liked Ten Second Ninja you will love this game. You also get a 40% discount if you own Ten Second Ninja. Shout out to Dan the developer, 9/10, would recommend to a friend.",
            "review_score": "1"
        },
        {
            "review_text": "X times better than the first one. Intense finger action if you crave the need for speed and puzzle action.",
            "review_score": "1"
        },
        {
            "review_text": "  This games o.k , also is very frustrating trying to close the game as it takes like 20 seconds to finally quit",
            "review_score": "1"
        },
        {
            "review_text": "  Hello everyone! I was given a free key for Youtube (Not my linked Youtube Account on my profile, it's a different Youtube account) and I have to say, I do enjoy the game and will be recording it soon.    The game is a really fun and raging experience. And the art style is amazing. But, I might have to complain about the price. 10 dollars for this? Wow. But it's a really fun and enjoyable experience.  TL;DR I think it's a very fun game with great art-work and worth buying on sale. Though if you are a Youtuber or a Live-streamer, request a key, you'll probably get this game for free...trust me.",
            "review_score": "1"
        },
        {
            "review_text": "Super awesome, funny, cute, fast and challenging jump n' run action!",
            "review_score": "1"
        }
    ]
}