{
    "app_id": 436160,
    "name": "The Panic Room",
    "release_date": "2016-04-27",
    "developer": [
        "NIKITA ONLINE"
    ],
    "publisher": [
        "NIKITA ONLINE"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Free to Play"
    ],
    "tags": [
        "Free to Play",
        "Hidden Object",
        "Puzzle"
    ],
    "achievements": 0,
    "positive_ratings": 164,
    "negative_ratings": 142,
    "price": 0.0,
    "description": "The Panic Room offers an exciting hidden object experience.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/436160/header.jpg?t=1522250217",
    "minimum_requirements": "Additional Notes: Flash Player 19",
    "recommended_requirements": "Additional Notes: Flash Player 19",
    "reviews": [
        {
            "review_text": " 'The Panic Room offers an exciting hidden object experience.'    Um, no.",
            "review_score": "-1"
        },
        {
            "review_text": "I really enjoy the game but only thing I did not like was the health system",
            "review_score": "1"
        },
        {
            "review_text": "Started this game and it was fun at first until you need to buy stuff (which I will not since now the game sucks). Impossible to move forward unless you have friends to trade with for puzzle pieces. I true waste of time",
            "review_score": "-1"
        },
        {
            "review_text": "Free to play game that takes it to the next level. I like the style of the game. It is well made and keeps you engaged for hours. Better than a lot of Hidden Item games.",
            "review_score": "1"
        },
        {
            "review_text": "In this game you play a man who is forced by Brendan Fraser to find items needed to open the entrance to the Center of the Earth. Little does Brendan know, he's actually sequencing a code for opening the door to The Rock's Scorpion mummy tomb. Even though he's getting negative Steam Reviews, he continues to hound players and force them to do his menial tasks. He even forces a 30 year old version of Jenny Weasely to help, most likely kidnapping her from Harry. The Cowboys from Brokeback Mountain even make an appearance. One of them is poisoned and you save him by picking up firewood and violins for Brendan. If only G.I. Joe: The Rise of Cobra and Pawn Shop Chronicles were good movies... If only he could still guest star on King of the Hill and Fairly Odd Parents... Maybe, just maybe, it wouldn't have come to this.  I recommend this game to people who want Brendan Fraser's weeny in their butt.  I do not recommend it for people who didn't like the Mummy because it's pretty much the same thing except you don't actually see The Scorpion Mummy Rock it's just implied.",
            "review_score": "-1"
        },
        {
            "review_text": "very boring",
            "review_score": "-1"
        },
        {
            "review_text": "-the loading time and connection are very bad, you see waiting screen most of the time. -window mode for widescreen is not scaled properly -game is frequently updated but never been better",
            "review_score": "-1"
        },
        {
            "review_text": "Hot garbage. I can't wait to build a wall around this game. Trust me-I'm a very good builder.",
            "review_score": "-1"
        },
        {
            "review_text": "   You have to pay to continue through the rooms!!! :( It had a great start.    If you have a ton of money on steam then this is a great hidden object game     otherwise DON'T get it",
            "review_score": "-1"
        }
    ]
}