{
    "app_id": 436490,
    "name": "Firebird - La Peri",
    "release_date": "2016-08-19",
    "developer": [
        "Innerspace VR"
    ],
    "publisher": [
        "Innerspace VR"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "VR Support"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "VR"
    ],
    "achievements": 8,
    "positive_ratings": 161,
    "negative_ratings": 35,
    "price": 3.19,
    "description": "Enter a realm of enchantment with &quot;FIREBIRD - La Péri&quot;, and play the role of Iskender, a prince seeking the &quot;flower of immortality&quot;. You will appear on the stage, visit the ethereal world of La Péri, and witness a magical and poetic encounter as one of the characters...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/436490/header.jpg?t=1510935744",
    "minimum_requirements": "OS: Windows 7, 8, 8.1, 10 Processor: Intel i5-4590, equivalent or higher Memory: 8 GB RAM Graphics: NVIDIA GTX 970 / AMD Radeon R9 290 DirectX: Version 11 Storage: 3 GB available space",
    "recommended_requirements": "OS: Windows 7, 8, 8.1, 10 Processor: Intel i5-4590, equivalent or higher Memory: 8 GB RAM Graphics: NVIDIA GTX 980 / AMD Radeon R9 390 DirectX: Version 11 Storage: 3 GB available space",
    "reviews": [
        {
            "review_text": "This kind of thing is why I got the VIVE. Very professional and a delight to experience. More like this please!",
            "review_score": "1"
        },
        {
            "review_text": "Short (12min) experience, but the length of an experience doesn't always equal what you get out of it. In this case the sense of presence of the dancer in the final scene is overwhelming and cannot be ignored. One of the few offerings at this time (late 2016) to convey such feelings. I enjoyed that part immensly and look forward to any future offerings, hopefully longer, with the same sense of presence baked into the product.",
            "review_score": "1"
        },
        {
            "review_text": "Very impressive. I hate conventional theater/movies/concerts where I have to be glued to a chair to take in a stage performance; here, you are in the middle of the action, and with simple interactions, dictate the pace and are involved in the story. Beautiful, compelling, and a hint of what the future will soon bring. Plenty of games out there, now there's room for art as well...",
            "review_score": "1"
        },
        {
            "review_text": "Very well made. Feels like a profesional VR experience from start to finish (about 10-15 min). It is not a game, but not 100% passive. 10/10 Worth it if you want to demo your vive to friends and family. If you have no friends or family maybe you need this anyway.",
            "review_score": "1"
        },
        {
            "review_text": "That was really neat. Short VR experience type thing rather than a game but that was much more exciting than I expected.",
            "review_score": "1"
        },
        {
            "review_text": "The short: good game. A very well polished, lightly interactive and narrated VR Fantasia. I hope to see more of this sort of thing in the future!  The long: Being someone who does not 'get' dance at all, I was not expecting to be blown away by this one. However, I knew I liked the music, and it looked really nice (with some aesthetic similarities to Superhot, Tron Legacy, and Journey's wall art, at least), so I gave it a try.  Turns out this game is really well polished, from various visual aspects to the music and music transitions to the narration (English, anyway; I haven't listened to the others) to the general presentation -- classy stuff. The only real hitch was that some achievements didn't come through my first time playing, but I don't give a hoot about those. What they hint at, however, is that there are a few secret things and non-obvious interactions which make it more than just the 'look/click-to-continue VR movie' I was expecting it to be. The narration even gracefully allows for several deviations from what I assume is the standard story, which makes me kind of curious if real-life performances normally respond to audiences in similar fashion. For those interested in VR spaces, the movement of the stage pieces and the fades between that 'reality' and the story world's is really cool and worth watching several times, in my opinion. There's at least one giant clip that you might see if you're looking for things like that, but that's the only worldly blemish I remember. Oh, and the pit is not fully modeled and doesn't have an orchestra in it, but it's there, even though I had to stick my head through a wall to see it. :)",
            "review_score": "1"
        },
        {
            "review_text": "This is a gorgeous little interactive video, the way the dancer sivels around you and her movement feels so real and beautiful, This is probably what I'll show anyone who asks what the vive has to offer, loved it, and well worth the price!",
            "review_score": "1"
        },
        {
            "review_text": "This is a really good idea. I'd love to experience a VR dance where I dance with motion-captured actors and we both leave trails of light in space. I hope that the developers do that for their next program.  The actual experience of La Peri hints at that in the last few minutes.   The rest of it is unskippable cut-scenes of words appearing on a book and three really boring 'catch the flower' minigames. This would actually have been better if they had cut everything except the final dance. Especially because some players will feel sick by the time they finally reach the payoff.",
            "review_score": "1"
        },
        {
            "review_text": "This is certainly a short experience however it's also one of the better ways to show off what VR has to offer for those uninitiated to virtual reality. To some, nothing more than a short demo but to others such as myself, very much full blown ART. This award-winning experience provides an excellent feeling of presence while managing to make you feel for the character before you. For those who understand that it's perfectly ok to put a price tag for 'just' 15 minutes of entertainment, when it's something made with heart/soul and polished to the extreme.  Highly recommended",
            "review_score": "1"
        }
    ]
}