{
    "app_id": 436870,
    "name": "Tank Brawl",
    "release_date": "2016-04-20",
    "developer": [
        "Phung Games"
    ],
    "publisher": [
        "Phung Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Co-op",
        "Local Co-op",
        "Shared/Split Screen",
        "Full controller support",
        "Steam Workshop",
        "Steam Leaderboards",
        "Includes level editor"
    ],
    "genres": [
        "Action",
        "Casual",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Action",
        "Casual",
        "RPG"
    ],
    "achievements": 0,
    "positive_ratings": 22,
    "negative_ratings": 11,
    "price": 3.99,
    "description": "The perfect game to play local co-op with your friends and partners with classic top-down game play and simple yet dynamic controls. It come with eye-candy 3D graphic modernization of the classic Battle City with tons of added features to give it more depth and visual appeal. Now with Level Editor!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/436870/header.jpg?t=1504715890",
    "minimum_requirements": "OS: Windows XP SP3 Processor: 2.0+ GHz processor Memory: 2 GB RAM Graphics: A graphics card with shader model 3.0 support and 512 MB Memory DirectX: Version 9.0 Storage: 1 GB available space",
    "recommended_requirements": "OS: Windows 7 64-bit Processor: 2.0+ GHz multi-core processor Memory: 4 GB RAM Graphics: NVIDIA 8000 series or higher graphics card DirectX: Version 11 Storage: 1 GB available space",
    "reviews": [
        {
            "review_text": "With or without the nostalgia factor this is simply cool.  Unreal Engine based, includes 23 different levels as well as bosses and 5 different overall area designs.  Comes with a point based upgrade-your-tank system, which slightly forces you sometimes to do a respec.   Power-ups will become more powerful and their drop rate increases the further you progress.  Once you've finished the game you will be able to continue in something that is much similar to a new game plus mode. I have no idea how often this could be repeated, seen people on level 60+.   Go get if you're into local co-op, I think this is were Tank Brawl really shines.  What would I wish for: 4-player local co-op and a larger variety of weapons.  The developers promised that they will add a level editor once they have reached 3.000 sold copies, so go tell your mums.  BTW: I am not paid to write this, actually I am just wasting precious spare time...",
            "review_score": "1"
        },
        {
            "review_text": "Cute little game but.. thats it. Played a little with the tanks and uninstalled it.",
            "review_score": "-1"
        }
    ]
}