{
    "app_id": 436940,
    "name": "Quar: Battle for Gate 18",
    "release_date": "2016-04-04",
    "developer": [
        "Steel Wool Studios"
    ],
    "publisher": [
        "HTC"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "VR Support"
    ],
    "genres": [
        "Action",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Action",
        "VR"
    ],
    "achievements": 9,
    "positive_ratings": 49,
    "negative_ratings": 7,
    "price": 9.99,
    "description": "Quar: Battle for Gate 18 is a turn-based strategic VR game set in the grimsical world of Alwyd. The Quar are cute alien ant-eaters. Don't mistake cute for gentle. They use their WW1 level technology to wage war across the face of their world.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/436940/header.jpg?t=1473711550",
    "minimum_requirements": "OS: Windows 8 Processor: Intel i5-4590 or greater / AMD FX 8350 or greater Memory: 4 GB RAM Graphics: NVIDIA GeForce GTX 970 / AMD R9 390 DirectX: Version 11 Storage: 4 GB available space",
    "recommended_requirements": "Memory: 8 GB RAM Graphics: NVIDIA GeForce GTX 980 / AMD R9 390X DirectX: Version 11 Storage: 4 GB available space",
    "reviews": [
        {
            "review_text": "Turn based strategy game that looks great in VR. So far, of the few games I have played in VR this is the best full game.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun, one of the first vr strategies, can be played room scale, standing, seated in a standing space.",
            "review_score": "1"
        },
        {
            "review_text": "Turn based strategy in VR works!  This is one of the best VR games currently available - controls and gameplay work smoothly, great cartoony graphics. Room scale/standing turn based strategy might sound strange but I love to walk over the battle field and zoom in to my troops. Tried playing it from a swivel chair - works as well if you're tired.",
            "review_score": "1"
        },
        {
            "review_text": "a bit slow paced, but fairly fun turn based strategy made more interesting by the VR platform. Controls take some getting used to as it's not immediately obvoius what button sequence you have to press to proceed through the turns",
            "review_score": "1"
        },
        {
            "review_text": "The Store page doesn't do a great job representing this game, but it really is a gem. It reminded me of playing Warhammer and other table top games as a kid. It is spiritually pretty similar to a VR table top version of Civ 5's combat.  The game has way more content then most other VR games out right now, somewhere around 7-10 hours. Also the gameplay is turn based which is refreshing compared to most other VR titles right now whish seem to be wave based or Arcade, both of which feel frantic.  The Art design is a little different, but ultimately works. The fact that it is structured around exagerated WWI concepts helps I think.  The game desperately needs a skirmish mode though, if they added the ability to jump into a randomized battle/map this would be a heavy weight title.",
            "review_score": "1"
        }
    ]
}