{
    "app_id": 437570,
    "name": "GoNNER",
    "release_date": "2016-10-12",
    "developer": [
        "Art in Heart"
    ],
    "publisher": [
        "Raw Fury"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Leaderboards"
    ],
    "genres": [
        "Indie"
    ],
    "tags": [
        "Indie",
        "Platformer",
        "Shooter"
    ],
    "achievements": 19,
    "positive_ratings": 729,
    "negative_ratings": 122,
    "price": 6.99,
    "description": "GoNNER is a tough as hell procedurally-generated 2D platformer with roguelike elements, following the largely misunderstood and altruistic Ikk on a journey to cheer up his only friend in this world - a giant landbound whale named Sally - by searching for just the right trinket in the deep and dark places nearby.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/437570/header.jpg?t=1547484042",
    "minimum_requirements": "最低配備: 作業系統: Windows Vista 處理器: Dual Core 記憶體: 2 GB 記憶體 DirectX: 版本：10 儲存空間: 1 GB 可用空間",
    "recommended_requirements": "建議配備: 作業系統: Windows 10 處理器: Quad Core 記憶體: 4 GB 記憶體 DirectX: 版本：12 儲存空間: 1 GB 可用空間 備註: Controller recommended",
    "reviews": [
        {
            "review_text": "favorite game at the moment!",
            "review_score": "1"
        },
        {
            "review_text": "Best game I have played high yet.",
            "review_score": "1"
        },
        {
            "review_text": "This other worldly work of interactive art creates a living breathing realm like the one hidden in the back of your mind.  The minimal design and abstract audio feed you a healthy dose of sparkle and shine. The secrets of the universe seem attainable within the games confines.  Having only scraped the surface It is already casting its spellbinding charm.  The adventure looks deep... I'm going in.  Art in Heart; the Basquiat of video games. because reasons",
            "review_score": "1"
        },
        {
            "review_text": "Took a risk buying this without any prior knowledge but it was well worth it. The sound design really stands out, from the chatter of the floor forming underneath you to the sound of picking up ammo. It also complements the great soundtrack and visuals that get increasingly hectic as you build a bigger combo. The gameplay is great because it depends on skill instead of luck unlike many other rogue-like games.  Overall it is a great 2D platformer, shooter, combo maker game.  Would recommend a buy.",
            "review_score": "1"
        },
        {
            "review_text": "Pixel art at its finest. The perfect game for an in some way relaxing and nontheless very demanding experience.   What I love about this game: the grafics, the music, you have to explore the game for yourself, there is no one that tells you the meaning of the different elements you can collect and use or the story or who you are etc, you have to find your own strategy to survive. This game is giving minimalism a very good name again. The symbols used, get you thinking, the game has its own language. You have to jump, shoot, react, fight your way from screen to screen. That seems to be all about the gameplay; but unlike other games that try to hide their linear gameplay behind tons of useless gimmicks, this one makes the most of the essence of playing.  And here I don't find it frustrating in any way that I die a lot: really: a lot!",
            "review_score": "1"
        },
        {
            "review_text": "Pretty game and hardcore Rogue-like.  Don't lose your head!",
            "review_score": "1"
        },
        {
            "review_text": "Very good Linux port, highly recommended !",
            "review_score": "1"
        },
        {
            "review_text": "Great Indie game. Unique graphics, smooth gameplay, absolutely fun to play!",
            "review_score": "1"
        },
        {
            "review_text": "GoNNER is a criminally underrated Roguelike with a gorgeous psychedelic aesthetic and engaging gameplay. Similarly to the Bit.Trip games, GoNNER's music and visuals become more complex and vivid as your combo goes up. This system does a great job of keeping the music interesting, and really adds to the frenzied excitement of trying to hold onto a combo.   More importantly, GoNNER is just really ♥♥♥♥ing fun. I love the satisfaction of bulldozing through cute monsters in caves and islands, trying to perfectly skirt the line between combo-destroying slowness and reckless speed.  Even though I almost always wait for sales, I wholeheartedly recommend this bizarro game at full price.",
            "review_score": "1"
        },
        {
            "review_text": "Bought this game while I was loaded a few nights ago because it looked like my moniter was melting. Finally got a few minutes to give it a play and it's pretty fun. Cool graphics and music. Characters and story look alright. Other than the awkward controls for interacting/shooting/reloading it's a pretty awesome. Will play more when I have the time.",
            "review_score": "1"
        },
        {
            "review_text": "Cutest rogue game on the market, great feel, atmosphere and environment. Devs are always updating. Has tons of potential! 10/10 tbh",
            "review_score": "1"
        },
        {
            "review_text": "Very very fun and addicting game, totally recomended!",
            "review_score": "1"
        },
        {
            "review_text": "Really fun gameplay if you are into rouge -likes! Love the look and sound of this game!",
            "review_score": "1"
        },
        {
            "review_text": "this game i supper addicting to play. it has smooth controls, fun characters, catchy sound effects, neat colors, and simple story. this game is difficult. you only have one life (sorta) to beat the whole game, don't worry, it's doable, but you need to keep trying. it has a good payoff. also the daily challenges are fun for those who beat the regular campaine, or want to change it up from time to time.",
            "review_score": "1"
        },
        {
            "review_text": "Great style and atmosphere. I just wish my controller would work. The same controller works in any other controller supported Steam game and I have a hard time playing this with the keyboard. Better controller support and options to remap keys would be fantastic!",
            "review_score": "1"
        },
        {
            "review_text": "This is a wonderfully hard game, with a lovely art style and a few mechanics that makes this a refreshing game to play. Though, currently on mac, it tends to crash while starting quite often, making it hard to actually get to playing the game. Hopefully it will be fixed in the future. Though this wont keep me from recommending this game.",
            "review_score": "1"
        },
        {
            "review_text": "It's a decently fun game, but lacks a lot of depth. The build variety is not very good. The shotgun is the only gun worth using.   The art-style is nice but the color choices are poor. The 3rd level hurts my eyes to look at.   Also, the ending stalled when I beat the game, so no achievement. Not feeling up to going through it again.",
            "review_score": "-1"
        }
    ]
}