{
    "app_id": 438030,
    "name": "Dead6hot",
    "release_date": "2016-02-01",
    "developer": [
        "Chuck Productions"
    ],
    "publisher": [
        "New Reality Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Shared/Split Screen",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Casual"
    ],
    "tags": [
        "Action",
        "Casual",
        "2D"
    ],
    "achievements": 0,
    "positive_ratings": 201,
    "negative_ratings": 246,
    "price": 0.79,
    "description": "Fast-paced shooting in a frantic atmosphere! Pick-up-and-play, like the good old days! Local multiplayer!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/438030/header.jpg?t=1454448826",
    "minimum_requirements": "OS: Windows 7 Processor: 1 Ghz Memory: 1 GB RAM Graphics: 1GB Graphics Storage: 100 MB available space Sound Card: Stereo Sound",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Simple but multiplayer is fun, also the game has trading cards, good for the price :)",
            "review_score": "1"
        },
        {
            "review_text": "I like this game has fun gameplay and 2 game modes but let me list some things that would make the game better  1.Less health, it takes a long time to kill people so maybe make the health bar smaller or have a 3 or 4 hit system  2.Better AI, The AI is not very good its ok 3.Online multiplayer, You know just match making   NOTE i like this game but including some of these features would make the game better . Also is like super crate box but this game has verses",
            "review_score": "1"
        },
        {
            "review_text": "What to say,this is a great tribute to super crate box,but with local multiplayer!    Gameplay",
            "review_score": "1"
        },
        {
            "review_text": "not bad, simple",
            "review_score": "1"
        },
        {
            "review_text": "Play for 5 minutes and get bored",
            "review_score": "-1"
        },
        {
            "review_text": "If you liked 'super crate box' you won't like this one.  Super crate box was fun, this is just worse than thrash..   On the bright side, I got it on discount, got the trading cards and made a few cents profit, it is like I got payed to play the game, but the pay wasn't that good either.",
            "review_score": "-1"
        },
        {
            "review_text": "It's simple, but maybe too simple. It feels empty and objectiveless, and does not have replayability.  The menu is ok. Highlighted text color should be changed to make it easier to read. Controls should be informed on the first time playing, as they are non-conventional. The AI is bad. The enemies just walk around and die. Sometimes when you touch a monster you end up being thrown on the wall and back, and die instantly, as you can't flee. Maybe there should be an immunity time after a hit.",
            "review_score": "-1"
        },
        {
            "review_text": "don't  i review a lot of bad games. This one is especially bad.  First of all, the game doesn't tell you how to play. It took me a while to figure out that O was grenade and L was to shoot. Second of all you're gonna wanna turn that gun around and just shoot yourself. dw, it wont kill you becaus it takes a million bullets to kill anything in this game.   i don't really have much to say about this title. it's really hard to tell what's going on, there's like 4 guns in total, the shotgun is absolute garbage, sometimes you spawn inside the map, it's just.. not fun. You're probably supposed to play this in multiplayer. Maybe that is sorta fun. I can't really attest to that. Singleplayer however is the most lackluster thing I've ever experienced. You just shoot at these little eye balls and slime things (which youc ant even tell if youre actually hurting) until you run out of your three lives. And then the game exits to the main menu.  The one thing I sorta liked about the game was the one song in it. Makes me think of cave story. Except this song gets old pretty quick.   just... just pass on this one. Pretend there are no trading cards in it and just look elsewhere.",
            "review_score": "-1"
        },
        {
            "review_text": ".",
            "review_score": "-1"
        },
        {
            "review_text": "i thought it was good but its not .. i lost 83 cents worth of cs go skins thank you very much",
            "review_score": "-1"
        },
        {
            "review_text": "Missing Exe? Rename .exe to Deadshot122115. Why you would even bother playing except for cards?",
            "review_score": "-1"
        }
    ]
}