{
    "app_id": 438270,
    "name": "Learn Japanese To Survive! Hiragana Battle",
    "release_date": "2016-02-16",
    "developer": [
        "Sleepy Duck"
    ],
    "publisher": [
        "Sleepy Duck"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Education",
        "RPG",
        "Indie"
    ],
    "achievements": 0,
    "positive_ratings": 1189,
    "negative_ratings": 88,
    "price": 4.99,
    "description": "The ideal introductory course to the Japanese language! Learn how to read and write Japanese characters (Hiragana) at a steady pace. A full-blown RPG specifically designed to keep you engaged. By playing along, you’re going to be introduced to the Japanese language like never before!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/438270/header.jpg?t=1550361525",
    "minimum_requirements": "OS: Windows 7/8/8.1/10 (32bit/64bit) Processor: Intel Core2 Duo or better Memory: 2 GB RAM Graphics: DirectX 9/OpenGL 4.1 capable GPU DirectX: Version 9.0 Storage: 2 GB available space Additional Notes: 1280 x 720 or higher display",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I would also rate this game a perfect 5 out of 7. I played for about an hour and I've already learned a couple dozen characters, as well as some words. It's a legit RPG, so you don't just feel like you're doing lessons. The repetitive FF-style battles are a great way to drill everything into memory. I hope other games like this come out for other languages.",
            "review_score": "1"
        },
        {
            "review_text": "Just started but I'm enjoying this. the writing is good, it's cute without being sappy, and most importantly the teaching is well paced. I did find the pronouciation sound bites to be a little brief and not as clear but it's good enough. Also, the animated hiragana and the hiragana font confused me a bit. I assume the animated one is the 'correct' one while the font is just for readability's sake. I'm also impressed with what Sleepy Duck has done with the RPG Maker engine. Really good job pulling it all together! So far, definitely worth the money spent.",
            "review_score": "1"
        },
        {
            "review_text": "I am what most people would lable as an  Otaku  or  Weeaboo  I like watching anime (not as frequent honestly), reading manga and playing Japanese games (Ok, these 2? More than I'd like to admit) So I really want to learn how to read Japanese so I can access these things more easily, and then this game appeared  This game is about 3 friends, Claire the leader, Leon the idiot and Eric the... generic sidekick(?) trying to save their home after an evil wizard, Noburo terrorizes with his  Hiragana  Warriors... (Still with me here?  (￣、￣ ) ) They hire a Japanese scholar, Misaki to teach them  Hiragana  so that they can destroy Noburo's  Hiragana  Warriors and defeat the Noburo himself once and for all   What I like:",
            "review_score": "1"
        },
        {
            "review_text": "Seems fun and usefull for the basics.  I like how there is no exit button in the title screen...",
            "review_score": "1"
        },
        {
            "review_text": "I've played for only about an hour so far and have learned 15 Hiragana letters so far. The story is cute, and the repetitive teaching style is effective for me. Looking forward to 'playing' more.",
            "review_score": "1"
        },
        {
            "review_text": "Ever wanted to learn Japanese and not go through boring classes for it? Well, this game doesn't fully replace a class, but it works just about as well, if not better.  Hiragana Battle is an indie RPG made to teach you the first part of Japanese: Hiragana, one of three character sets in Japanese. The game itself is your simple turn-based RPG with a leveling system and the plot isn't terribly rich, but it's entertaining enough to spend hours learning Japanese with.  In Hiragana Battle, you will learn all 46 characters of the Hiragana character set (and its dakuten and handakuten variants) and a bunch of words from yes/no to household items and a few simple phrases, along with their Romanized (Romaji) variants to make it easier to understand the pronounciation as an English speaker. The Hiragana character set is surprisingly easy to get a hold of, taking about 14 hours of gameplay to learn, however I still find myself going back through and still having to look at my notes (which I very much recommend you do, especially on paper and pencil), so the memorization definitely takes time. My best suggestion is to do a single or two chapters a day, then grind out for a good couple days until you don't need your notes to defeat all the enemies, and then move on. I made the mistake of going through and just jumping to my notes when I found myself stumped.  The game gave plentiful information to understand how the Hiragana set is written and pronounced, and gave many examples of words and a few phrases, but it didn't feel satisfying enough  because it just wasn't enough i must learn all the japanese and become the most weeb  because the game gives very minimal examples for conversation pieces, but it's permissible since its purpose is more-or-less get you hooked and researching afterwards.  tl;dr: I give it an 8.5 out of 10; It's a very great way to get into the Japanese Language and learn a bit of it, but it doesn't have enough content to fully replace what a class/your own research would do. I very excitedly await the release of Katakana War, and hopefully a sequel after that for Kanji. It and Hiragana Battle will be worth the $6.99 each. I almost wish I didn't get it on a Summer Sale Price so I could pay full-price for this.  ありか゛とうこ゛さ゛います!  (Now to invest in a mini-keyboard with a Japanese character set. Copy-pasting off Wikipedia won't last me forever.)",
            "review_score": "1"
        },
        {
            "review_text": "Excellent! Managed to learn all hiragana characters within 10 hrs. The extra grammar and vocab lessons are a plus as well albeit being basic ones. Definitely would recommend this game to anyone interested in learning the Japanese language!",
            "review_score": "1"
        },
        {
            "review_text": "Learning is hard, and this game goes a LONG way in making learning fun and approachable. Huge thank you to the developer for encouraging me. Still they could do better.  The fight sequences (where most of the reinforcement of learning takes place) are frustratingly slow. There are just too many keystrokes involved for preloading a character's attack, and by the time I finished all of the characters I've forgotten what I had set them to. So no immediate punishment for bad choices and learning is not very efficient. Also there's too much wandering around to get to the next battle. This is an okay introduction, but it is not designed with optimizing learning in mind - which is a shame because it would only take a few tweaks to the gameplay to make it much better. Bigger enemy armies, and a snappier UI with fewer answers to choose from would help.  Also in the battle phases there could have been reinforcement of the phonetics associated with the symbols, maybe as a symbol died. So the game is mostly learning the shapes of all the Hiragana characters, but I don't feel like I'm getting hardly any practice with the sounds these characters make. And because the order of the vowel sounds don't match the familiar 'a, e, i, o, u' (instead it's 'a, i, u, e, o') I find myself trying to rearrange the learning process in my notebook to have any hope of remembering the characters.   The game is relatively modable, and changing the shapes of backgrounds and characters might make it even easier for beginners like me to learn quickly.",
            "review_score": "1"
        },
        {
            "review_text": "This game prepares you to dip your foot in the water of learning japanese. Most things can be spelled with Hiragana, however Katakana and Kanji are used in a lot of spellings. If you play this game it will help you with learning japanese because you know how to sound things out and write them in Hiragana. Most things are spelled by how they sound.  Side quests show you new words, and also teach you about japan. Also the game is pretty fun without the learning aspect.",
            "review_score": "1"
        },
        {
            "review_text": "This a cute little game to learn basic Hiragana. Honestly it's much more time efficient to just learn them through flashcards. But if you actually enjoy the game, it would be good for reinforcement. I would really like a Kanji version of this game. That would be so much more useful.",
            "review_score": "1"
        },
        {
            "review_text": "Grind for experience points and 平仮名! I will grind till I collapse, no matter what!",
            "review_score": "1"
        },
        {
            "review_text": "Extremely helpful learning tool if you're trying to learn Japanese. Teaches you how to write and pronounce all the hiragana along with some vocabulary lessons. The story is alright, but the main selling point of the game is the educational software.",
            "review_score": "1"
        },
        {
            "review_text": "perfect learning game, does exactly what it says, you learn hiragana in about one to two weeks if you really try. Gameplay feels good , the story is nothing new but i keeps you motivated throughout the entire learning process",
            "review_score": "1"
        },
        {
            "review_text": "I'm only an hour into this 'class' and I have to say that is this wildly ingenious and impressive. It helps so much.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely useful for learning Japanese! You can easily get those hiragana characters memorized by fighting against the warriors. The only problem is, it cannot be saved on the steam cloud, I have two computers, and they couldn't share the progress. After all, if you had no idea with Japanese, you can't miss it.",
            "review_score": "1"
        },
        {
            "review_text": "The game is awesome if you want to learn and is willing to put some effort into it, getting yourself a notebook and practicing when you're not playing is probably a must if you want to learn and not only finish the game (if you don't repeat enough and give it time for your brain to remember everything, you'll probably giving up at the middle since you'll have forgotten the starting hitagana).  PROS: - Can actually be used for learning; - It follows oldschool JRPG mechanics; - It has some twists in the learning process (like sometimes making latin letters appear as enemies intead of hiragana).  CONS: - The repetitive music can get really annoying after some time playing; - You can't switch easily between characters in Equip menu; - Shopkeepers' menus have some delay opening; - There is little variation on the hiragana warriors groups' showed, it has about 4 on each zone I think (random permutations would be ideal IMO).  I'm lucky enough to have a friend that lived in Japan during highschool, so he corrects my writing every now and then. Also, if you can get a notebook with squares instead of lines it would be for the best, since each stroke drawn has to be in the proper space. But I digress. Good game this one.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. I never spend time on the game so usefully.",
            "review_score": "1"
        },
        {
            "review_text": "Walking into this game with absolutely zero japanese knowledge I found that after a little over an hour of game play I had learned 15 characters and I had afull page of notes already. The lessons are a bit tedius, but the simple fights do a lot to reinforce it. Plus...cute story and characters. Well worth supporting and I hope others make games for other languages.",
            "review_score": "1"
        },
        {
            "review_text": "This is really interesting and useful",
            "review_score": "1"
        },
        {
            "review_text": "Well one week of playing the game and practice i can recognize and read hiragana. I can write atleast half of the characters but with more individual practice i can write the rest.  I recommend this game because of its cheap price and it's more motivating to use the game than to try to learn hiragana by yourself.  Note you also have to practice it outside of the game if you want to get it down (Flash cards, Writing, Speaking, Cellphone apps, etc)",
            "review_score": "1"
        },
        {
            "review_text": "Not quite what I had expected in terms of story. Still, way more fun than learning in a conventional way.",
            "review_score": "-1"
        },
        {
            "review_text": "I know a REALLY good To Zanarkand ripoff when I hear it ;)",
            "review_score": "1"
        },
        {
            "review_text": "-I refunded this game  After spending time in Japan, I thought this game would have further improved or been a refresher for me. Turns out this game is meant 'Purely' for beginners. This game isn't bad. It's just I'm forced to sift through the beginnings of a language I already understand. If this game had a skip chapters feature or gets an update for Kanji, I would gladly buy this title again.  Guess it helps to read the banner of the game... lol",
            "review_score": "1"
        },
        {
            "review_text": "It was well done, i learned. It recommends to write notes and study, it moves at a well pace if you do. Without it you can quickly get lost in the sheer number of characters (Japenese letters) you have to memorize. I had a lot of fun. It Goes over everything and leaves no small detail untouched. Its our job to learn and memorize, all they have to do is give us the practice sheet. Which they absoulutely do! The graphics and music also made it all the more enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing anti-cheating job.",
            "review_score": "1"
        },
        {
            "review_text": "now i know 5 letters あ い う ゑ を and its a fun rpg game i highly recommend it for the plot if you know what i mean.........             ..........to learn hiragana japanese",
            "review_score": "1"
        },
        {
            "review_text": "This is pretty hilarious and educational at the same time. I hope they do these for the entire japanese writing system eventually!",
            "review_score": "1"
        },
        {
            "review_text": "Sadly I have to concur with the negative reviews.  The interface is clunky and bad. It takes way too long of a time to navigate and it's frustrating. The people who defend it with 'It was made in RPG maker' or 'It's a JRPG, that's what it's supposed to be like' are missing the point. This game could have been made so much easier and more user friendly.  Why does it HAVE to play like a JRPG? It can mimic the graphical style and look like one but there's no reason for it to play like one. Why couldn't I be able to just select the Japanese character on the screen and then select the correct corresponding romanji in a menu at the bottom, an entire attack made with TWO clicks of the mouse? Does anyone REALLY think it's better to have to go through menus clicking 'Attack' and then 'Answer' and then the correct answer in a list that covers the entire screen and THEN the character the answer is for. And for EVERY character in the party?  This is far too slow and awkward to be effective learning. It's not that difficult a game to make.",
            "review_score": "-1"
        },
        {
            "review_text": "I refunded this game 30 minutes after I played.I don't why but this game is boring as hell.Despite having to learn Hiragana characters to defeat enemies,the story itself is consider boring.Hiragana characters are easy to learn.I'm also learning Japanese but this game makes it harder to learn.Not recommended for beginners.Just learn from the internet.It is much easier.",
            "review_score": "-1"
        },
        {
            "review_text": "horrible little game.",
            "review_score": "-1"
        },
        {
            "review_text": "So cliche. Good guy fights the bad guys and has to save the town while learning a language. Don't waste your money on this piece of rubbish.",
            "review_score": "-1"
        },
        {
            "review_text": "Wow this is such an awesome idea. And the RPG actually works. Haven't had a bug yet. Now they just need to make another game for katakana and another few games for Kanji. :-D",
            "review_score": "1"
        },
        {
            "review_text": "Suprisingly really efficient and easy. It really does work as an amazing start into learning Japanese or at least one variant of it.",
            "review_score": "1"
        },
        {
            "review_text": "Great start for every RPG lover who wants to learn Hiragana. I've always wanted to speak Japanese and tried a few times but every time I failed. This was definitely my motivation. Thanks!",
            "review_score": "1"
        },
        {
            "review_text": "I was asking years ago why this was never done before and now the game/learning tool of my dreams is finally here! I love it! Any fan of Final Fantasy style games and any gamer who wants to learn Japanese needs to buy this game. The only thing that would make this better would be if they mixed up the words each attack so couldn't just spam enter on repeat attacks to reinforce the lessons.",
            "review_score": "1"
        },
        {
            "review_text": "Whilst this seems to be an OK tool for learning hiragana, I'm disappointed that such simple Japanese words are written incorrectly: 'こんにちわ' instead of 'こんにちは' - the subject marker は is used in this greeting. I've also seen 'さよなら' rather than 'さようなら' - note the long vowel sound in sayonara.",
            "review_score": "1"
        },
        {
            "review_text": "The thing I like about this game is the cool consept and that I get to learn japanese the problem is that the xp and fighting is a grind but I hope that they will fix this in the next game so overall im going to give this a thumbs up :)",
            "review_score": "1"
        },
        {
            "review_text": "A good way to hiragana... yep!  It's alright, little long winded at times though.",
            "review_score": "1"
        },
        {
            "review_text": "Love this game! Easy way to learn hiragana! Fun! Cool music! Great story!",
            "review_score": "1"
        },
        {
            "review_text": "When I was very early into learning Japanese this helped me quite a bit at learning Hiragana, and is a nice easy and well designed game to introduce very early stage Japanese learners to the Japanese language, a lot of people say that you don't need a full game to teach you hiragana, since you can acomplish the same goal in several days using Anki and learning by repetition, but I think this game is still worth it, make sure to get a notebook and a pencil to practice writing down the hiragana yourself, as it will help you greatly for learning the stroke orders, which will help you later when it comes to forming words.  Overall, this game is cute, and ultimately was what made me decide to start learning Japanese in the first place.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game!   Looking forward to playing katakana battle! :) ",
            "review_score": "1"
        },
        {
            "review_text": "This is a nice way to learn Hirigana.  However, this needs some serious optimizations. Almost every move or action can cause the computer to chug for half a second. I know this because I was eyeing the task manager while I was playing this game. When doing an action of some sort my CPU immediately spikes.",
            "review_score": "1"
        },
        {
            "review_text": "having fun with this game wrote my frist word in japanese in two lessons. i wander what this game has in store for me and how much i will learn from it. i hope you guys find the mix of rpg (final fantasy like game play) and learning as fun as i have so far...... also keep a note book handy you never know when you might need it.",
            "review_score": "1"
        },
        {
            "review_text": "I could only recommend this game to somebody who knows *ABSOLUTELY* nothing about Hiragana or Japanese writing. This game can be extremely frustrating if you have prior knowledge; the more you know the more you will be annoyed.   Most of the impatience comes from RPGmaker, however, as this is bare-bones as RPGs come. This coupled with the aggravating UI (you have to scroll through an ever-growing list of all the Romaji syllables to make a selection) makes it more of a chore than it should be. I digress...  I haven't completed it yet, and I'm not certain if I will. As it is, this game is a great introduction to learning Hiragana. It is paced out well enough, and the lessons are simple to learn. I cannot fault the game for what it does, because it does it quite well. This game WILL make you remember the Hiragana characters, as promised, but in the most aggravating way imaginable.   An RPG where you fight enemy characters (literally) by matching them with the corresponding Romaji. Seems simple enough, but the rate of random encounters in this game is obscene. Areas that take 30sec to walk through can take up to 30 minutes because of all the battle sequences. After finishing an encounter, you cannot walk for even 10 seconds until the next one starts, which is infuriating. In a game depending on classic RPGmaker level design (ie. crude mazes), the player HAS to walk around somewhat unimpeded to complete the level. This is impossible in this game.  Since you won't fight more than a few characters in each battle, you will be seeing the same 5 syllables pop up in every zone (for example, the first zone consists of 30+ encounters with only 5 'S' characters). You only memorize a small chunk of Hiragana at a time, while completely ignoring those that were previously learned. If I did not already know my Hiragana, this would almost definitely lead me to forget the early lessons.   The small bits of vocabulary you learn are a nice addition, but is definitely not a focus or even really a selling point. Apparently you fight full words by the end levels, so I'm going to try and stick around until then.  TL;DR: This game will make you memorize Hiragana in the most annoying way possible, but it is effective. Only buy if you know *NOTHING* about Japanese writing.   P.S. you're better off googling the different alphabets and writing them out yourself, it's free and much simpler to remember.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic I finally learned Hiragana due to this awesome game  And now I'm really looking forward to play Katakana Battle ;D",
            "review_score": "1"
        },
        {
            "review_text": "I played this game a little and i have to say it's been a fun way to learn hiragana.",
            "review_score": "1"
        },
        {
            "review_text": "One could expect a lame game with educational purposes, akin to those musics your teachers invent to help you memorize the subject. But even as a game, it is fairly good. It teachs japanese really easily and the combat is well balanced. The only two drawbacks, that in no way should make you give up on buying this game, are the lame dialogs (the guys are not from CD Project, cut them some slack) and the 'answers' menu that gets progressively bigger as you progress through the game. bonus points for the bonus point mechanic that let's you buy levels with points you get from side quests, and for the talking dog.",
            "review_score": "1"
        },
        {
            "review_text": "Simple to use and fun to play lots of helpful repetition which is important to learning anything.",
            "review_score": "1"
        },
        {
            "review_text": "This was a very fun &amp; exciting game for me! In just a little over a month, I learned all 71 hiragana characters with this game. If you love RPGs, have a very strong passion &amp; desire for learning Japanese, I highly recommend getting this game. For me it was worth every penny. &amp; now I can't wait for Learn Japanese To Survive: Katakana War! さよなら！",
            "review_score": "1"
        },
        {
            "review_text": "I love this game!!! You'll learn my favorite language,  while playing a cool retro rpg. It's the best!!!  10/10 IGN (I couldn't help it, sorry...)",
            "review_score": "1"
        },
        {
            "review_text": "If you have any interest in learning Japanese, this game is a must-have! The developers have not only found a way to make learning fun and rewarding, but a way that can keep even those with ADD on track.  I look forward to seeing what else this studio puts out.",
            "review_score": "1"
        },
        {
            "review_text": "I like the game and I've been learning a lot.   I do have 1 criticism that is a hinderance to learning. Each character you are taught is shown to you in 3 different fonts.  1: The font in the message body 2: The font that you fight 3: The font used to show how to write the character   Having multiple fonts isn't really a problem, but it would be nice if we had a sort of 'times new roman' equivilent or a 'This is how you write it with a standard pencil' font rather than the (very nice) brush strokes.",
            "review_score": "1"
        },
        {
            "review_text": "this ♥♥♥♥♥ great cant wait for the katakana version.  yes there are better ways to learn the kana but my attention span is much greater when playing games.   I wish they incorporated a bit more vocabulary to it and some more side missions. ",
            "review_score": "1"
        },
        {
            "review_text": "good game ( Recommended) for weebs, my rating 8,9/10  -----------------------------------------------------------  + help u learn japanese words + cute character + long story + good story  - fighting with japanese words? - 6969696969696 battle in 1 minute - make my friends cant stop calling me weebs :( ",
            "review_score": "1"
        },
        {
            "review_text": "  as far as to learn Hiragana goes it does it job, but I wouldn't recommend this game if you  only  want to learn Hiragana.  but ¿why I am recommending it then? it's because it give some really usefull basic about japanese grammar for beginners mid and late in the game, making it really good game for those who know nothing about japanese. if you have never studied japanese and wants to this will help.",
            "review_score": "1"
        },
        {
            "review_text": "This is an awesome game. It has you really repeating each of the characters over and over again as you play. It inadvertently forces you to remember the hiragana characters or else you'll just be wasting attack turns for nothing. (And we all know that every gamer hates attacking and seeing a 0 pop up. :D )",
            "review_score": "1"
        },
        {
            "review_text": "Classic turn based RPG style. You don't have to worry about any other abilities apart from answering the hiragana characters properly and healing. I don't think I've ever taken notes before in a video game. Sank about 6 hours into it on the first day. I look forward to the next installment on Katakana.",
            "review_score": "1"
        },
        {
            "review_text": "Well put together and constructed, fun to play and easy to follow. Definitely a useful tool to have to help embed the japanese language in your brain in a fun way!",
            "review_score": "1"
        },
        {
            "review_text": "Do you want to learn Japanese Hiragana the same way you memorise random encounters in RPGs? This is still a educational game, so you will need to write down notes and lessons.  The difficulty is very low, as most mobs die in 1 or 2 hits and your team usually goes first.  If you do sidequests, you have the option to get instant level ups.  The usable items are unnecessary, because the girls can heal and the dungeons are not long enough to run out of mana.  The guys only get a skill at high level, if you even notice it. It does feel like a basic RPG maker game, but the Japanese culture it presents improves it.",
            "review_score": "1"
        },
        {
            "review_text": "Good way to grind japanese basic language.",
            "review_score": "1"
        },
        {
            "review_text": "For those of players who trying to learn Japanese, this is a descent way to start. It is far from perfect as it pretty much ignores the existence of the other 2 character systems, but if you can't afford college course, or a plane ticket its a good starting basis.   Something that should be remembered before purchasing, this is first and foremost an educational tool, and a game second. If you buy this expecting some miracle of gameplay, or an incredible story; then you need to look at the games price tag. If you still believe that after, then you will be dissappointed. If I were to rate this as a game alone, I could not give my recommendation to buy.   But looking at this as an educational tool, you couldn't find a better (or cheaper) tool to teach yourself Hiragana. It really isn't a replacement for a college course in Japanese, with a competent teacher; but it will be a useful tool for the memorization of these symbols. The game was obviously made in your average RPGMaker, and the story is corny and mediocre. But as an educational tool for beginners and a descent way to practice for intermediate speakers, I can give my recomendationto buy it.",
            "review_score": "1"
        },
        {
            "review_text": "Very beautiful game. Highly recommended to whoever wants to learn Japanese!",
            "review_score": "1"
        },
        {
            "review_text": "I never thought I would try to learn Japanese, but this game makes it seem possible. My handwriting is atrocious though...",
            "review_score": "1"
        },
        {
            "review_text": "great game, really helps learn hirigana only downside is from what i've seen no random battle mode to help increase speed of recollection.",
            "review_score": "1"
        },
        {
            "review_text": "This is an excelent way to learn the very basic hiragana. It is taught in order of the alphabet and it is done in a fun and interesting game. I would totally recomend this to people wanting to learn the basics and have a little fun. I would not recomend this for people who want a quick practice of all the alphabet at once as this has a lot of story for that, but it is great for learning and drilling while learning. I also like how the game is played and that it is so remenicent of old school RPGs. I can't wait for Katakana War to hit Steam. I feel I still have not learned Katakana, alphabet for forigen words, that it will help me more and will get me to learn the darn thing.  Anyways good luck with learning Japanese! It is a fun and interesting language. にほんごはたのしとおもしろいです。",
            "review_score": "1"
        },
        {
            "review_text": "I normally do not write reviews for games but this one deserves one, it is rather fun and makes it extremely easy to learn. 10/10 would suggest to friends trying to learn Hiragana.",
            "review_score": "1"
        },
        {
            "review_text": "I like this game, to bring learning of a language into a game was a fabulous idea and its a bit more fun learning it from a screen than having a teacher go off at you, while you learn at your own pace and play a game has been a rather interesting time for me..",
            "review_score": "1"
        }
    ]
}