{
    "app_id": 438490,
    "name": "GOD EATER 2 Rage Burst",
    "release_date": "2016-08-29",
    "developer": [
        "BANDAI NAMCO Studio",
        "SHIFT",
        "QLOC"
    ],
    "publisher": [
        "BANDAI NAMCO Entertainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Steam Achievements",
        "Full controller support",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "RPG"
    ],
    "tags": [
        "Anime",
        "Action",
        "Character Customization"
    ],
    "achievements": 47,
    "positive_ratings": 2576,
    "negative_ratings": 738,
    "price": 39.99,
    "description": "Swear your oath as a GOD EATER and drive back the supernatural harbingers of Earth’s destruction. Buy GOD EATER 2 Rage Burst and get GOD EATER Resurrection FOR...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/438490/header.jpg?t=1539272735",
    "minimum_requirements": "OS: Windows 7 Processor: Intel Core 2 Duo E7500 2.93 GHz / AMD Athlon 64 X2 Dual Core Processor 5600+ 2.9GHz Memory: 3 GB RAM Graphics: NVIDIA GeForce 9800 GT 1GB / AMD Radeon HD 6670 DirectX: Version 9.0 Network: Broadband Internet connection Storage: 15 GB available space Sound Card: DirectX compatible or onboard chipset",
    "recommended_requirements": "OS: Windows 7, 8, 10 Processor: Intel Core i3 4130 3.4 GHZ / AMD FX-4100 Quad-Core Processor 3.6GHz Memory: 8 GB RAM Graphics: GEFORCE GTX560 1GB / AMD Radeon HD 6850 1 GB DirectX: Version 9.0 Network: Broadband Internet connection Storage: 15 GB available space Sound Card: DirectX compatible or onboard chipset",
    "reviews": [
        {
            "review_text": "tl:dr: Two great Monster Hunter style games that will last you a long time. Great PC port. NOTE: I have played God Eater Burst on the PSP  Gameplay + Monster Hunter style, but faster and has more plot (and 'plot') + Both GE:R and GE2:RB will last you a long time if you like MonHun style games (NOTE: GE:R will come with GE2:RB 'for the duration of the product's life cycle')  Presentation + SSS Character and Monster Design + Anime-style lyrical songs during power-up mode +/- OK English dub, no Japanese voices, but it seems mods are possible despite Denuvo - Some environments are meh  Technical + Can natively plug in a Dualshock 4 and get Playstation button prompts + KB+M controls seem good + Toaster friendly on low settings + Quite a few graphics options including Screen Resolution (Minimum 800x600, can go to 1440p apparently) Refresh Rate (25,29,30,59,60 Hz) Fullscreen,borderless windowed and windowed modes V-sync On/Off FXAA On/Off Shadows Off,Low,Med,High Texture Filtering: Trilinear, ANISO up to x16 Particle Effects On/Off  Overall: Great MonHun style game. Glad to finally see it done justice. THANKS BAMCO/QLOC!",
            "review_score": "1"
        },
        {
            "review_text": "So where should we start here, eh?  FAQs  -Does the game runs at 60fps? Yes -Does it have a keyboard/mouse control support? Yes -Is it worth the money I'm paying for here? ♥♥♥♥ YES, considering you're getting another game in the series which gives different style of gameplay overall, I wouldnt ask much more. -Why would I choose this over MH? This game offers a much more fast paced gameplay than MH that offers sluggish and 'realistic' gameplay.  -Where should I start? Resurrection or Rage Burst 2? The story first starts at Resurrection and the direct sequel would be Rage Burst 2 so I'd reccommend those who havent played Rage Burst on the PSP before to start with Resurrection first. Even so, both game have unique features on their own so it's up to you to choose. -What's the different features between the two? Resurrection offers a newly revamped ways of Devouring the Aragamis called Predator Style and revamped Control Unit. As for Rage Burst 2, it carries over the same thing from the original Rage Burst with some additions to new weapons and Blood Arts. [Note that since Resurrection came out after Rage Burst 2, Resurrection also have the new weapons with exceptions of the different featurs mentioned]  1. Controls Considering it's a hunting game you people probably would want to know how good the control feels and how good they are. I gotta say Im really surprised by this one though explaining which button does this wont be of any use unless you play it yourself. Key commands are CUSTOMIZABLE but I figured the basics are already good enough to be adapted since it's not really far off from those mmorpgs out there. The only thing that makes it different is the bullet system, more on that later.  2. Graphics Graphics arent really the thing to focus on here, though it does look good enough to bring out the textures of the environment, weapons and aragamis(monsters in this game). You want to be impressed by the monster to convince yourself to buy this game? Google 'Hannibal God Eater' and you'll be stoked. No, not that Hannibal show. Mostly it's still your typical JRPG graphics but it's better for most of the part but not on the high end.  3. Audio For this part, those who think they'll enjoy some good sounds and music using their stereo or headphones wont be getting the surround effect and sometimes the music would just stop on its own. I believe this one is one of the major things to look at to enjoy the game, though you can adjust the sound yourself but still wont really do much. You hear a monster's footstep near? Sure you go to them and the sound of the step wont be closer. It's fixed.  4.1 Character customizations So there are two parts for this customization. First being the weapons and then your character.  -Your weapons by default [created by crafting] wont have any customizations on it. However, if you upgrade that weapon, it'll offer another set of colours. Some will change the colour completely but worry not, you can still retain the previous colour by pressing LeftAlt and it'll give you the option to do so. ie: Your sword by default is black, upgrade it once it'll become white and upgrading it once again and it becomes yellow. If you so choose to use the black or white colour, just as I said earlier and it'll still keep the upgraded stats of the weapon.  -You can customize your character from top to bottom throughout this game. You get new set of tops and bottoms as you progress through the story. Personally I think they options of accessory are a bit lacking here but you change change the colours and whether it's right or left. Oh and the accessory will just be on your head by the by so dont expect anything extreme till the point you think you'll be able to put a jetpack on your back. Nu'uh.  -Other than those mentioned above, the last part would be customizing your teammates. Nothing big but some of them are given a set or two of clothes that you can change by your will. After completing a mission, the teammates you chose to bring will be rewarded by AP points. These points will allow you to give their own set of arsenal. Larger benefits would require more AP to buy though acquiring these APs wont be that long. Examples would be having your chosen teammate to apply poison to the enemy, or stocking more heals so the group can stay longer in fight  4.2 Blood Arts  Each weapon has their own set of Blood Arts. In short, your weapon actions will be given additional effects, more damage and visual effects. ie: the weapon type called Buster Sword have charge attack. So you'll see a number of Blood Arts for the charge attack in your loadout for you to choose for the charge attack. One would be having your charge attack to dash you to the front with high speed forward(you can tilt left or right until the duration ends or until you press the button again] and then press the button again to deal a much higher damage than the normal charge attack. Upgrading this path will reward you with higher damage, some additional new effects and as I said earlier new visuals. In this particular matter, the skill I mentioned above is called CC Chaser. Level 1 would have you just dashing. Level 2 will give you additional damage and visuals, level 3 with increased damage and better visuals including a shield that'll mitigate some damage for you and finally the last level where it'll really benefit your fight when you land it right. Upgrading these Blood Arts arent hard but how you actually do that isnt that interesting so I'm not going to elaborate. Imagine yourself dashing forward with your big sword in a flashy red visuals covering you, and then slamming the sword to the ground creating a nice red whirl. Sounds sick eh? For this CC Chaser only the sword deals damage though, the whirl doesnt actually do any damage other than being beautiful.  4.3 The infamous Bullet Editor  Oh my oh my how should I say this. This is one of the best part about the game. You can customize your bullets as the name alreayd implies. You can shoot lasers. You can shoot a bullet. You can shoot a bullet that explodes afterwards. You can shoot a bullet that explodes and then rain lasers. You can shoot a mortar that puts orbs onto the enemy and then the orbs shoots flamethrower and then explodes. You can create rasen shuriken. Look, tl:dr you can do whatever the ♥♥♥♥ you want with your bullet. There are some good recipes out there in the internet and have fun with them.  5. Story and Character progression The stories does its job good enough, but your very own character speaks very little lines and they RARELY SPEAKS. I was stoked when my chara spoke. Most of the conversation goes with you selecting an option to reply [any option doesnt reflect the gameplay] w/o any voice acting. During cutscenes, he just nods. There are also a feature called Character Episodes where you can socialize yourself with the characters and progressing these will give you a good benefit if you bring them in missions. The story progresses as you play these STORY missions and cutscenes will play at the end or before the start of a mission. Cutscenes also plays when you talk to characters in between missions. The woman where you'll pick up the mission at will tell you what to do in order to progress the story everytime you talk to her so you really wont lose any track here.  I think that's all. Also the game deserves more people that it already have, so spread out about this game to your friends. It needs more publicity but NOT by Nintendo. Please, just no. No ♥♥♥♥♥♥ graphics. Cheers!  Also, should I mention about the b00b physics? And help me choose between Alisa or Gina. Side-Underb00b game too stronk.",
            "review_score": "1"
        },
        {
            "review_text": "As a Monster Hunter fan that got tired of playing on a 3DS and playing a little of the original God Eater for the Vita; I was surprised to find that it was getting a release on PC.  The game is a PS4 port, that is handled beautifully, it runs at a smooth 60fps and looks fantastic.  As for gameplay, it's exactly like monster hunter or any other clone. Start out fighting small cannon-fodder monster to possible giants, scavenging drops, crafting/upgrading weapons, etc.  I would recommend playing with a controller, as I haven't tried KB+M  It has a 4p co-op multiplayer. I haven't tried it though, so I don't know how well the multiplayer aspect fares.  A minor issue that I have is that the music will cut out during a fight or will not loop properly in a menu.  Other than that, this game is great. I would recommend it to MH fans, MH clone fans, and anyone else new to the series.",
            "review_score": "1"
        },
        {
            "review_text": "An excellent game with a fast paced gameplay reminiscent of that of the 'Monster Hunter' series.  Here's a brief review.  -The game runs at a smooth 60 FPS,the graphics look really good and can be enjoyed even on a toaster tier computer.  -Good story and characters,also the cutscenes are nicely done as well.   -Great art directions for the monsters,environment,weapons and characters.  -A very enjoyable OST and a good english dub.  -Impressive longevity thanks to the long main story,many sidequests and co-op online play.  -The first game of the series is included with this one.  -The action looks great and flows awesomely.  -A ton of weapons and moves as well as countless character customization options.   If you like stylish action games and/ot taking down huge creatures in Monster Hunter you'll love this game.    ",
            "review_score": "1"
        },
        {
            "review_text": "in my opinion, pros: -vast customization of everything, ESPECIALLY BULLETS -tons of hours of gameplay -each character in the game is unique -multiplayer fun! (if you have friends to play with) -monster hunter-esque gameplay   cons: -story is a bit bland -no japanese for voice :c -gameplay gets tiring sometimes: register a mission , kill something, repeat. -no option for camera speed adjustment. -quick devour in GER (pc): shift + right-click, quick devour in GE2RB (pc): hit once, shift + right-click. -cost of the game :/ i can't play with some of my friends because they can't afford the game.  overall this is a great game, i recommend this game for everyone",
            "review_score": "1"
        },
        {
            "review_text": "I've play this game before since it was in PSP, back then it was very good, and no doubt when this release to PC this automatically became my target game, i thought the story for Resurrection was same like Burts but i'm wrong, there was an actuall another story in it, Recommended to play Resurrection first then Rage Burst, 9/10 for me, well i'm done with steam before but i created new one for this. Awesome BGM, nice Art, Great Story, Great overall Gameplay and Customization, it's worth every penny for me, for cons, yeah i agree with the other maybe for multiplayer, and voice acting for Resurrection, well Rage Burst isn't that bad but Resurrection kinda weird for me, i hope there was an Japanesse voice pack or something, but overall this was Awesome. If you like RPG Hunting action like Monster Hunter, this was reommended for you",
            "review_score": "1"
        },
        {
            "review_text": "This review is partly personal and via the perspective of an old GE player.   I am just gonna review GE Resurrection mainly because GE2 Rage Burst is pretty solid based from previous reviews and youtube vids I've seen and read. I won't delve into the Pros and Cons because you can read that in other reviews.  GE Resurrection is a great revamp of the old GE from the PSP but sadly the voice acting, the new script and repetitive dialogue after missions just got to me. I know what you people might think, 'Well its pretty obvious that they might not reach out to the old Voice actors', or something like well I know that much but its just the VAs didn't cut it like the ones the got me immersed from the original game. I partly also blame this on the script since it was changed but the core of the script didn't, thank God for that. The script the VAs used was similar to the original but just became more dramatic to point where I was like, 'Really, this isn't how Alisa or Lindow talks'. Yes their personality base is still the same but as an old fan it just didn't made me feel the same way about them. The after mission dialogues were I guess both good and bad. Good in terms of you can get attached to the character just a bit more. Bad becuase some scenes start to get repeated. I do enjoy playing it again thanks to the Personal Abilities that were added to the comrades you can bring which an amazing improvement. I question though if it was good that they added the Hammer and Scythe to the revamp.  I do recommend people buy this but I warn the old fans of the original because it's just not the same.",
            "review_score": "1"
        },
        {
            "review_text": "Pros  1- Deep and detailed character creation 2- A handsome variety of weapon classes to choose from 3- In GE2:Rage Burst there is a mechanic which gives your weapon an additional move or 'special move'. These moves are called blood arts which adds an additonal layer of uniqueness to your weapon. 4- Rich story that makes you drawn towards NPCs 5- NPCs are not dead models that just stand around and give you dialogue. They can join you on quests,can be upgraded and even have their own quest and ask you to join them. 6-Runs pretty well im just playing with an Intel HD and it has drops below 30 fps. 7-If you're a fan of anime you may enjoy this - speaking of anime there is an anime based on GE: Ressurection 8-The biggest pro is it comes with an additonal game just as big as the intended game. Well played Namco.  Cons 1- Online is a dead even though the game just came out. I put partial the blame on players since some people would look at the online mode and get a little confused and go back to the main story - like what i've done 2- Could get a little repetative.  8/10   This game is the best hunting game on steam so far keep it up namco. It was very wise of you localizing games like this.  ",
            "review_score": "1"
        },
        {
            "review_text": "godly 60fps and great port BUT WHY NO JAPAN- nvm found the mod 10/10 would recommend. And yes, i am a weeb",
            "review_score": "1"
        },
        {
            "review_text": "This is less like monster huunter and more like freedom wars. This game is fast paced and fun action game with a lot of customization.",
            "review_score": "1"
        },
        {
            "review_text": "Good game, fast pace, the port is nice and the story is very interesting.plus free ressurection so why not.",
            "review_score": "1"
        },
        {
            "review_text": "You can eat monsters with an almost sentient alive weapon while partying with waifus and husbandos   10/10  Also the port isnt as horrible as Toukiden,its actually playable and smooth",
            "review_score": "1"
        },
        {
            "review_text": "Great Port, My Potato PC could run it consistently at 60fps at max setting, what sorcery is this??",
            "review_score": "1"
        },
        {
            "review_text": "Senpais, almost cat-girls, Ciel's facial expressions, oh, and you get to smack giant monsters around with a big hammer. What's not to love? P.S. Ragna the Bloodedge.",
            "review_score": "1"
        },
        {
            "review_text": "I was waiting for this to get released on the pc, and when i played it, it didn't disappoint me, sure this version is in english dub, but i gotta say that it's not so bad at all, plus it runs on low end pc quite fine, and what's more is that you get the 1st god eater bundled with it, i really recommend this game to those who are interested/taking an interest to this game, of course it supports mouse and keyboard, and you might have trouble playing multiplayer though, as it is region locked, but that won't be a huge problem, so buy it, try it, enjoy it, love it, lmao",
            "review_score": "1"
        },
        {
            "review_text": "What can I say? The game is alright... Let's start with the bad:  Other then the terrible controller controls that even if you rebind them they are still ♥♥♥♥ because when you rebind keys other keys automaticly rebind themself as well making the game pretty much unplayable with a controller. The enviromental and effect sound way overpowers the music which just breaks a ♥♥♥♥ ton of experience. When locking onto enemies with mouse and keyboard you can't look around freely which sucks. No undub without a mod which is still work in progress + the dub is pretty bad. And coming from me as a dub fan that is a pretty giant flaw.  The good: It is 60FPS It runs smooth. It has full keyboard and mouse support. The music that you actually hear is good.......  So to sum it up. The game is good... Not great but alright.",
            "review_score": "1"
        },
        {
            "review_text": "I have about 50 hours logged in to the Vita version of God Eater Resurrection and, 5 hours of God Eater 2 Rage Burst on PC so far. You'd think that having a remaster version of the first God Eater (Resurrection) based on the enginge and gameplay tweaks of it's sequel (Rage Burst) would make them a little to similar and fatigue would set in pretty quick, right? Wrong. While Resurrection carries over to it all the weapons, graphics, and a few gameplay tweaks from Rage Burst, they couldn't be much more different from each other. Yes, they are both games focused on hunting action and taking down Aragami and crafting weapons out of their cold dead carcasses, the main difference comes from how character progression is handled. In Resurrection its all about Predator Style, you unlock different ways to consume aragami mid-combat and enter burst mode in the most badass way possible. At first you only have access to a few predator styles but after a few missions and a bit of story progression, no two player will likely have a similar setup. In Rage Burst it's ll about the Blood Arts, similiar to Resurrection in the way you unlock more Blood Arts depending on your style of gameplay, if you like to jump in the air and combo the Aragami from the sky, you'll unlock Blood Arts supporting they play style and, if you're like me and like to slash and dash at your enemy and chip away their HP, you'll unlock Blood Arts reflecting that style of gameplay too.  The story is pretty much your standard anime fair, you're a nobody who becomes amazing at something, blah blah blah, you're now the MC and only you and your friends can save the world. Characters are nice, waifus and husbandos abound, they do not get as developed as you might want them too, but they all have rooted and based reasons for the actions they take within the story. Honestly the one thing I do not like about the story is how the main women in the games always seem so damn unsure of themselves in the actions they take, it's like they dont know how badass they are.  The difficulty in the games ramps up quite a bit near the end, about half way through the game it's like it tells itself that the kid gloves are coming off, but fails to tell you about the decsion it's made, more than likely due to the level of teen angst oozing from its supporting cast of characters. If you like Monster Hunter but always thought it was a little TOO slow, wanted to jump around and do crazy air combos and, wanted to main a gun but hate how slow it was, holy crap, this game is for you. At first glance it appears to be a shallow flashy imitation of Monster Hunter, and other hunting action games, however it grows into its own and becomes game where split second thoughts about how to approach a situation can mean the difference between getting slammed into the ground by a monster 4x you size and dodging out of the way and giving that same monster the first and last beating of its life.  It's worth it, God Eater is awesome.  ",
            "review_score": "1"
        },
        {
            "review_text": "can shoot teamates. underboobs. hours of character custom. 10/10 best gaim evur",
            "review_score": "1"
        },
        {
            "review_text": "As a fan, I am very happy that God Eater has arrived on PC. I played the original GE, and GEB on PSP. Now, I completed GER, and almost there on GE2RB. It is worth the waiting despite some minor issues, anyway, here's my opinion:   Difficulty &amp; Balance",
            "review_score": "1"
        },
        {
            "review_text": "RESURRECTION REVIEW  +Character customization +Nice outifts +Nice characters (except Kota, he's a ♥♥♥♥♥♥) +Good gameplay  -English voices -Monsters reskin  7/10  RAGE BURST REVIEW  +Character customization +Nice outifts +Nice characters (except Kota and Romeo, they're ♥♥♥♥♥♥s) +Good gameplay +Blood Arts  -English voices  7/10",
            "review_score": "1"
        },
        {
            "review_text": "nice game....  how to solve Multiplayer Online Problem simple first OPTION &gt; GAMEPLAY &gt; AUTOSAVE &gt; OFF...... TAADAAAA..SIMPLE RIGHT..!!!  MAKE SURE TO SAVE A LOT MANUALLY AT THE TERMINAL",
            "review_score": "1"
        },
        {
            "review_text": "Great game 10/10 Alisa best girl",
            "review_score": "1"
        },
        {
            "review_text": "Very good game, my only complains would be the camera when locking on monsters.  Create your waifu simulator 2016 &lt;3  The main story is neat to follow (Its rare that I don't press Skip button but this game had me listen to all the cutscenes I witnessed so far)",
            "review_score": "1"
        },
        {
            "review_text": "Pros : + Good Port  Cons : - No JP voice",
            "review_score": "1"
        },
        {
            "review_text": "Good Game. Pretty good story, game play isn't that hard, also not to easy. Graphic quality requirements ain't to high. (Able to run medium on my laptop,but sometimes the FPS will drop during gameplay)  The only bad thing i think is the English voice lines... I had GE2RB on my psv(Japanese Version) and I also prefer to have Japanese voices on the PC version. Japanese voice lines sounds more cute on female characters......  :)",
            "review_score": "1"
        },
        {
            "review_text": "Monster Hunter all over again with a twist. loving it!",
            "review_score": "1"
        },
        {
            "review_text": "it's a decent port, i'm not saying it's really a good PC port since some graphical issue and lags still occured, but at least it's playable, i'm sure that devs will come out with patches soon.   and also, Alisa still the best girl",
            "review_score": "1"
        },
        {
            "review_text": "Such a underrated game, everything about this game is great fun and a throwback to monsterhunter style games. The only thing wrong with it at all is the partymaking/lobby needed more work and is poorly put together.",
            "review_score": "1"
        },
        {
            "review_text": "Really love this game ~",
            "review_score": "1"
        },
        {
            "review_text": "It's Monster Hunter on PC, but more story driven instead. Includes barbie simulator and item grinding simulator.   Easily 100 hours of gameplay to complete all the story quests.",
            "review_score": "1"
        },
        {
            "review_text": "Fast-paced version of MH + endless variations of bullet customization. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Asuna Simulator 5/7 will play for it  On a slightly serious review, God eater 2 Rage burst is a remake of God Eater 2, a sequel to God eater, where you are a member of a new unit 'Blood' which are the elite among God eaters. They hold a special power, which can turn the tide in a battle.  Graphics 7/10 Pretty decent graphics for a port, a fair amount of settings that can be used. Cutscenes are at 60fps, although you could tell its made from 30 fps.  Controls 8/10 I used a Xbox controller, havent tried using keyboard and mouse, but i recommend using controller.  Would like to have vibration for more immersion factor.  Gameplay 7/10 Like the game as it is so far, the classic monster hunter setting, with few interations in the game lobby. Character creation is a joy, would wish to have height customisation and certain other customisation related to 'size'. hmm hmmm XD Game lore is great, you can have a great deal of reading in the terminals found in the lobby of the game. One exception I found is there isnt a preview mode for the costume when you want to buy them. You can preview in crafting, but not buying them in a shop, hope that could be changed. Dialogues in the 'free-roam' lobby is is limited by only subtitles, would have hoped to have audio dialogues as well. Cut scenes dialogues are well done, except as usual, your main character is mostly a mute. Since in character creation you are allowed to have 20+ voice customisation, it may be the main reason of not including voice dialogues in cut scenes.  Overall 7/10 Pretty decent port, only crashed once during saving, not sure of the reason. Fun gameplay and would definitely recommend it if you are a God Eater/Monster Hunter fan. Another gripe is that I wish theres a Japanese Dub audio for it, too used to watching anime in their original voice, feels weird to be hearing English speaking voices in anime, but thats my personal preference, which, incidentally, quite appealing to most people too, hope the developers would care to put in an Japanese audio.   Will try multiplayer soon, but for now, the single player is good enough to play.   Hope this review helps in your decision for purchasing! Have a great day.",
            "review_score": "1"
        },
        {
            "review_text": "run perfectly in my wooden pc i didn't expect that also 10/10 for alisa boobie",
            "review_score": "1"
        },
        {
            "review_text": "It's fun",
            "review_score": "1"
        },
        {
            "review_text": "Great game, I played it on the PSP and the everything looks nice. Ended up refunding because friends are on the PS4. ",
            "review_score": "1"
        },
        {
            "review_text": "Good game, excellent graphic addicting game 10/10",
            "review_score": "1"
        },
        {
            "review_text": "If your into Monster Hunter esque like games then this one will be definately be a good one for you.",
            "review_score": "1"
        },
        {
            "review_text": "I've been playing God Eater series for 6 years and had waited the localization when it first announced.  +Conversations are translated nicely and every detail can be acquired so easliy. +Great port! As far as I know, FFXIII is 30fps capped but playing a game on 1080p/60fps really made me happy. No fps drops either! +The hints are neither too long, nor too short. Just the way I like. +Keyboard + mouse combo is decent. However I can't get used to it :/  -VA's suck. -No visible change on graphics -As far as I know, 3rd party joysticks aren't supported (tell me if i'm wrong) so you have to have a Logitech joystick or a PS3/4 dualshock that is compatible with PCs. (PROVEN THAT IT'S ACTUALLY WRONG) -Mouse sensivity is extremely slow and no way to make it faster. (just get a gaming mouse and change its dpi it legimately works)  My final result: 8/10. If 3rd party joysticks are supported, it'll be 8 out of 10. Gonna try that tomorrow.  Edit: 3rd parties are compatible, but the key mapping for them is worse than keyboard + mouse. Got used to keyboard, and got a new mouse so i can change its sensivity whenever I want to. &gt;:3",
            "review_score": "1"
        },
        {
            "review_text": "GOD EATER 2 WAS AWESOME! definetely worth buying!",
            "review_score": "1"
        },
        {
            "review_text": "God Eater Ressurection Eric shows up for 2 minutes then dies with Chivalry and Honor  God Eater 2: Rage Burst Eric's little sister Erina show up and Emil tells the protagonist how Eric died with Chivalry and Honor.",
            "review_score": "1"
        },
        {
            "review_text": "Made a waifu that says 'We kicked their asses!...Ooops. I mean tushies.     (Is playing GE:R atm but will play this soon)   10/10 Would hear the word tushies again. Okay I love this game in general I played both and it is amazing its like playing Monster Hunter but for PC its a god send seeing that most of the MH clones failed. This game delivers with a variety of custmization variation of weapons and clothing ( Fashion Eater 2 ) I highly reccomend this game with friends you will share laughs trust me...You will... anywho happy eating!",
            "review_score": "1"
        },
        {
            "review_text": "Amazingly ported. No problem at all on Max Settings.  I miss japanese voice, but english is good too.  Gameplay is great and the story is better than I expected.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best game ever :D with great story and gameplay.  it will be better if there's a japanese dub .  ",
            "review_score": "1"
        },
        {
            "review_text": "Porting quality is 10/10. Ran perfectely fine, just had to direct it to my NVIDIA card manually. The dub over I can take or leave though. It's a fun game, and it comes with the remake of the first game too. Pretty sweet.  Note for NVIDIA Graphics Card users:  The game might default to your intergrated and run poorly as a result, so double check your NVIDIA Control panel if you are experiencing poor performance. It did for me.",
            "review_score": "1"
        },
        {
            "review_text": "All Day destroying aragami with waifu",
            "review_score": "1"
        },
        {
            "review_text": "Great Port on PC, its better than PS4 Dat Chi you aragami making combo Kick i almost died LOL",
            "review_score": "1"
        },
        {
            "review_text": "In a world where most games do not work on release for PC while being lazy ports, one comapny tries to break this cycle and they did. I Mean you can use controller and keyboard at the same time and which button you use it switches the control schemes on the fly and I like it.",
            "review_score": "1"
        },
        {
            "review_text": "great game with tons to offer for its price point. comes bundled with god eater resurrection and both games together have hundreds of hours of content, anyone that is a fan of fast paced action combat with squad mechanics and hunting giant monsters that offer quite the challenge this is a must buy.  the port is very well done for a vita game no graphical glitches, crashes, bugs of any kind and im about 12 hours into resurrection.  as someone that has never played monster hunter or any games of this genre im enjoying it immensely deffinitely worth checking out if you have the funds.   the english dub is quite good you can tell the va's put effort into their dialogue and it doesn't seem forced or lacking emotion while not as good as the japanesse voice overs it holds its own regardless.   verdict: must own for fans of monster hunter type games, friendly to newcomers with amazing price tag for the content offered, well worth a buy.",
            "review_score": "1"
        },
        {
            "review_text": "Well, this is my first game ever in steam that I'm compelled to buy it. First of all, this game comes in bundle, meaning you get 2 games for the price of one. Totally worth it. I finished GER before starting playing GE2RB one and frankly, GER was better in term of gameplay because of its 'Predator System'. I feel awkward when I have to do basic attack first before doing quick devour on GE2RB as opposed to GER where you could cast it instantly. Story wise, I haven't gotten far yet in GE2RB so I can't really compare it with GER, but man, I totally missed Hibari as operator. People said she's annoying but GE2RB operator (don't remember her name) is dull as hell and sounds like she's half-assing her job lol.  All in all, 10/10 would play GER (only) again.",
            "review_score": "1"
        },
        {
            "review_text": "Love This Game i have been playing from psp",
            "review_score": "1"
        },
        {
            "review_text": "Good port so far, no problems on my end. Runs smooth, constant 60FPS, no crashes.",
            "review_score": "1"
        },
        {
            "review_text": "Bandai's verson of monster hunter since nintendo and capcom won't share :(   want a game that lets you kill BIG GUYS! and make weapons out of BIG GUYS! and carry BIG SWORDS! that can switch to BIG GUNS!, Do you want to eat a BIG GUY! in the name of Harambe then get your wallets out and your ♥♥♥♥♥ cause it is time for you to spend that $50 and Create your Waifu/Husbando and send them out to save Earth for Harambe.",
            "review_score": "1"
        },
        {
            "review_text": "Both games run easily at 4k/60fps. Great port. Will update with new discoveries.",
            "review_score": "1"
        },
        {
            "review_text": "It has been 7 years since the US saw a Monster Hunter game designed for something other than mobile (or three I guess if you count the re-release of Tri). At this point, considering how popular it is in Japan vs the rest of the world and how well the DS games are doing, this is probably the closest we are going to get on a PC.  It's not bad a bad game. It looks like something trapped between the PS2 and PS3, it lacks the free roaming nature of Monster Hunter, and the group AI in the single player often feels more cluttered than helpful... but at it's core it's a good game because at it's core it's beating up things that should be eating you and making gear out of their parts. I just wish I had a new Monster Hunter I could play on a screen bigger than my palm with a polygon count I couldn't actually count.   If your last positive experience with Monster Hunter was emulating Tri on the Dolphin, I absolutely recommend it. Just know it is as likely to increase your longing for something you can never have as it is to fill that void.",
            "review_score": "1"
        },
        {
            "review_text": "so.. you buy 1 game you get 2 games and get the benefit of 3 games.. yes.. you don't have to buy senran kagura  Screenshoot ",
            "review_score": "1"
        },
        {
            "review_text": "just buy it it will make your life better",
            "review_score": "1"
        },
        {
            "review_text": "underboob n taking down an overpowered beast would be the reason i pick this best game xD plus i nominated this game for 'just 5 more minutes' award , cause once u started playing it, u cant stop until u get to the main story point (?)",
            "review_score": "1"
        },
        {
            "review_text": "4 hours and I'm rating it 10/10 Good port. GOD I LOVE THIS GAME COMBAT : 10/10 Graphics: 8/10 Voice acting: 8/10  I can't find the tokyo ghoul pre-order bonus tho I only found SAO and TOZ DLC PLS FIX Ty",
            "review_score": "1"
        },
        {
            "review_text": "I remember playing the 1st God eater on Psp and now rage burst 2 along with ressurection is on steam.... Time to relive the childhood!",
            "review_score": "1"
        },
        {
            "review_text": "Everythings FINE and GREAT,after i go to game controls...and i ♥♥♥♥ed up. the controls not like the originals if anyone who played psp/psvita ver there have Type A,B,C controls patch. I tried to set my style but the button not support when i press 2 key togetehr at the setting or the running not work in field.  and i wan to say the audio you guys did a GREAT job,just the 'Translator' is terrible. That's all i wan to say. Player from PSP who played GE,GERB,GE2 and very looking foward to this english ver GE2RB.",
            "review_score": "1"
        },
        {
            "review_text": "The mouse and keyboard work quite well, I've tried to play the game with the steam controller, however, as I'm not used to a controller as much, KB/Ms work better just as well.  I'm glad I got this over No Man's Sky to be honest.",
            "review_score": "1"
        },
        {
            "review_text": "A fun game and I have not noticed anything different from the ps4 version",
            "review_score": "1"
        },
        {
            "review_text": "Game said it would be released Augest 30th. I rake up enough money to buy it on Augest 29th. Try to prepurchase it. End up just purchasing it, not prepurchasing it. After sulking for two hours, and cussing out a wall, I play the game. After so much frustration, I still gave it a positive review. Need I say more?",
            "review_score": "1"
        },
        {
            "review_text": "It's an overpriced PSP game but it's really an amazing game.",
            "review_score": "1"
        },
        {
            "review_text": "Game runs smooth and so far is very enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "Runs really smoothly, no issues. if you like monster hunter, you will enjoy this. Still doesn't quite beat monster hunter for me though.",
            "review_score": "1"
        },
        {
            "review_text": "Alright! The sequel to gods eater burst is finally out. And it comes with ressurection, a more polished version of the 2010( i think) release. For what you pay for, I think the game is extremely underwhelming and repetetive. Now, the game seems too much like burst. Grind, grind, grind, cutscene, grind. Cutscenes arent even worth while. The voice acting sounds extremely obnoxious and there isnt any japanese. The character design sucks SUCKS. From the limited time I had with this game, the 2 female protagonists are replaced with this squeaky weaboo girl. The game runs smooth, but for the graphics(trash, horrible) the game should. This game is like a run down PC version of monster hunter....Atleast monster hunter makes grinding fun......",
            "review_score": "-1"
        },
        {
            "review_text": "First of all, the game itself is great. However, the incredibly clumsy way that multiplayer was handled is too much to ignore.   The region block makes it troublesome for an already niche community to find like-minded player (no, forums and discussions are not a stand-in for what the in-game search is supposed to do), and there are also numerous reports of online play being constantly interrupted by disconnects and crashes.   Evidently someone at Bandai-Namco figured that they can get away with it because people would be playing with friends anyway... which is a terrible attitude to have when you're trying to sell your product. Hopefully they fix it and fast, before most of the life drains out of the game.",
            "review_score": "-1"
        },
        {
            "review_text": "Friggin DUB make this game look total idiot! this what happen when you allow such fanservice take everything! especially those ENGLISH people want everything be in their friggin language, SUB is enough and its already enough to have SUB but DUB? my thumb down will last forever here until they remove the DUB or the origin jap audio is available back. The game is already good but the friggin DUB oh god ..",
            "review_score": "-1"
        },
        {
            "review_text": "Japanese audio and Chinese subtitle please. Most of the fun is cut since English is not familiar for me as Chinese and Japanese does even though for the people who has taken a lot of English trainings as me. I can understand English but games are just for fun. English takes me more energy to understand than Chinese. Plus, it is weird to listen to English audio playing JRPG.Japanese audio is more comfortable. 60 fps is really good. But I am tired of horrible English audio.  The reason I recommand this game is to let more people buy and the Baidai Namco may decide to add Japanese audio and Chinese sooner.  I am sorry for not recommanding this game but If the Japanese audio and Chinese subtitle are added, I will reverse my comment for sure. Thanks.",
            "review_score": "-1"
        },
        {
            "review_text": "The game itself can be enjoyable for those looking to just have fun in an arena style hunting game. Sadly games that would be considered similar to it have much better gameplay mechanics and give the player a challenge.   -The story itself seemed pretty interesting but very generic and didn't really get me sucked into it. -The gameplay was easy to pick up but lacked any really thought process when it came to combat and made beating most enemies way too easy -Having to play through the story just to get to more high difficulty missions seemed frustrating -Some weapons seemed way more powerful than others -The ability to cancel out of any attack means you don't even need to try to think about your attacks -This game is pretty much Phantasy Star Warriors by Koei-Tecmo  If I were to compare this game to similar titles it would be Monster Hunter and Phantasy Star. The only problem is that the qualities that make those two games good just do not exist in God Eater 2. Monster Hunter gives the player tools as well as limitations on how monsters can be engaged which constantly change and creates situations that require the player to approach everything in different ways. This helps keep the combat alive. Phantasy Star is somewhat similar but due to combat mechanics being slightly different they can use enemies in different ways in comparison but achieve the same goal.   Overall I don't feel like the game is worth the price tag. I don't feel like the game will actually offer the entertainment and longevity I expect for $50.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is god awful. The controls are inexplicable, the information you need to understand what is going on is hidden in a stupid early 90s style UI and there is significant screen tearing on my machine which can run most other modern games at high settings. I cannot imagine what version of this game others are playing that caused them to give it a good review.",
            "review_score": "-1"
        },
        {
            "review_text": "First, GE:R should be sold separately, afterall, it is the only one worth it. Specially now, since they have added GE2 features to GE:R.    Second, they brought us a multiplayer game, with the most fail matchmaking existent. Disgusting.   No Original Audio option, in a RPG that is practically a must have  You should buy it if the price is below 10$, that is what this is worth.  As a God Eater fan since the first one came out in JP for PSP, I feel offended.  To be fair, the port is quite well made, considering it's just a handheld game it could be better of course, plenty of options and configs.   ",
            "review_score": "-1"
        },
        {
            "review_text": "No JP voice.  50% off 2 month after release. ( I pre-ordered.)  BANDAI NAMCO Please go f**k yourself",
            "review_score": "-1"
        },
        {
            "review_text": "Absolutely worse game i have EVER played in my life. The back story is shallow enough to drown a pug in, the graphics on highest settings are not up to the standard of 2016, but the game is so poorly coded that the game runs at low frame rates even with a machine that blows the recommended specs out of the water. The 'action' is so slow that it feels like you are playing on slow motion combat. The ranged combat is lame because you cannot aim your gun, or look down the site, or lock onto the enemies.   All in all the game is just terrible, i actually asked for a refund. and i never do that.",
            "review_score": "-1"
        },
        {
            "review_text": "Well worth it to anyone into the Monster Hunter gerne. This is a similar style experience, but with a better story and more interesting characters. It's also less grindy. Part of the gameplay has some depth (picking skills and bullets and so on), but most of that is kind of optional. I wouldn't say the game is too easy, the game is depending on dexterity and some strategy in fighting the monsters, but with enough HP restoring potions for each mission it'll be somewhat difficult to really die too often. (It's not as super easy as some of the other JRPGs out there though.) This game also is a decent port for PC, although some 'console'-ish controls should be expected. The art style, introduction movies and various other cutscenes are all topnotch. The best I've seen so far. Especially the intro looks like a true anime. In-game art generally looks awesome too, although level design is left somewhat basic. I guess this is due to the original games being for PSP and PS Vita.  Gameplay has enough going for it to keep you busy for a while and the story is actually pretty good. I wouldn't recommend getting this game at it's full price, but at a discount I would totally recommend it. I think it's this expensive because of the great art and great designs, but 50 bucks is really a bit much for what is still fairly low depth gameplay. Fans of Monster Hunter games are still going to like this though, maybe even at full price. The monsters have enough variation to be worth your while and the action is responsive to not feel too forced. The game does have a few things that makes it apparent this is not really a 'current generation game' or full PC game though. Do expect fairly uninspired or rudimentary levels in line with PSP and PS Vita performance and invisible walls when trying to jump over water. Nothing too annoying, but if you can't stand stuff like that this game might not be for you. The characters, the story and the monsters are the main meat of this games. The levels or environment definitely aren't and some are re-used throughout the game. People familiar with JRPGs and the dungeons in some of them will generally understand what I mean. All in all, I still recommend the game. Oh and for those who care the game is extremely low on true fan service, basically only some very mild suggestive dialogue and that's it. This doesn't even deserve a 'nudity' tag, let alone 'dating sim' tag. It's definitely not a dating sim.",
            "review_score": "1"
        },
        {
            "review_text": "Fast pace monster hunting game with one of the best support AI created. Vampire Themed from the original sucessor God Eater/God Eater Burst adding a 'special unit' of God Eaters with personal Blood Power to combat new type of Aragami : The Psions. Creative and interesting character build available with main melee,main gun or defensive support are all available for everyone's enjoyment.  Never really found an antagonist that I ever hated that I could think of but Grem and (Spoiler Elert): Dr.Rachel's voice actor pretty much made the 1st hateable villain I ever encountered. Great work! Talking about voice acting,Ciel's and Gilbert's got the best dialogue and nice voice acting in most dubed JP games.  some cons though,and this goes for Ressurection as well: 1.Characters long comments got cut of before it could finish-doesnt exist in Burst version on PSP 2.Whole dialogue got replaced (Overhaul/Reworked) from the original dubed version on PSP Also you will notice the 1st encounter with Marduk,Julius will call you vice captain before you were even promoted at that point. 3.Non selectable language-JP or Western,should be available when they were localise. some can cope with full dubed but som part are better in JP in my honest opinion like the Aria of Light Cutscene (Yuno vs World Opener aftermath) 4.Sometime the AI got glitched on some doorway from one zone to another spinning around. Can only be fixed if you comand a converge. 5.Clothing choices are a bit limited.  Overall the storyline are magnificent,gameplay and build are interesting,monsters are challenging(mostly end game ones). Recomended for RPG and Monster Hunting Lovers.",
            "review_score": "1"
        },
        {
            "review_text": "Kanon's friendly fire is worse than my teammates in CS:GO.",
            "review_score": "1"
        },
        {
            "review_text": "2nd is as addictive as the first was. Little disappointment tho. Old maps from 1st were 'cut and paste' into Rage with slightly different looks.",
            "review_score": "1"
        },
        {
            "review_text": "lots to do and really difficult at points",
            "review_score": "1"
        },
        {
            "review_text": "I had lots of fun playing this game I haven't fully maxed out the game yet, but I really enjoyed the 'main story' of it! I would recommend!",
            "review_score": "1"
        },
        {
            "review_text": "great game",
            "review_score": "1"
        },
        {
            "review_text": "Just to start off, I love this game. Character customization and character interaction is a big plus from me. Weapon designs are beautiful and the stats are well balanced for each new difficulty mission. The plot is good, altough can be a bit bland at times. I have no complaints about the voice acting, as getting the right people for the characters would be pretty hard to accomplish. There isn't much to complain about the gameplay; it is meant to be a bit grindy. The monsters are a good, decent challenge so there is always some strategy involved and not just hack and slash. Overall, the game is brilliant and leaves little to be desired. Would rate 9/10 for its good gameplay and design, but of course the grinding element is always a stickler for me `~`  Now, for some bugs I found (Will try to update every time I find a new one) - The Infantry Swarm Urgent mission seems to crash my game everytime I try to complete it  ",
            "review_score": "1"
        },
        {
            "review_text": "is their any chance that we can get the DLC from pre order? :&lt; its just that i want all of it. &lt;/3  ",
            "review_score": "1"
        },
        {
            "review_text": "Quite fun, especially with friends. Worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "pretty much it's like playing monster hunter but more simple maybe the only complex thing in this game is bullet customization  well if you love doing repetitive quest, grinding monster and seeing boobs while you're at it you're at the right place",
            "review_score": "1"
        },
        {
            "review_text": "The biggest gripe I have with this series is the fact that there is practically no mission variety. As miuch as I hate to admit that all the negative reviews posted are valid, they are to a good extent, true. The game can easily be boiled down to cutscene, grind, cutscene, grind, and when you strip it down to something so barebones, that is literally all you have. Missions try to justfy their urgency/importance with cutscenes, dialogue, and descriptions that declare you're out there on a mission, trying to protect whatever, but it simply isnt enough.   I appreciate the developers doing so much to add to your char's look and arsenal, but if I were to have a talk with them, i would highly, highly suggest toning down on it a bit, and focus on what the game ACTUALLY needs more of. Having started the monster hunter-esque genre with of course, MH, I can still say I like GE loads more, but love what MH brings to the table.   While MH can learn loads from GE's flexibility in character customization, and having a decent story to engross someone in the world, GE can learn lots from MH by actually MAKING THE ENVIRONMENTS MATTER. MH was incredible for its environmental atmosphere, having loads of areas to collect items, do all sorts of stuff like mining, fishing, climbing heights, having areas where temperature matters, and in the recent installments, water environments for swimming. Monsters stick in their natural habitat, and there are simply loads of ways to itneract with the environmental objects around you.   GE in comparison, has lifeless environments that are only there for mere, pretty visual aesthetic, filled with only copy paste aragami (the enemies), and found RNG items that come in the form of lazy sparkles on set spots over the map. The only time the maps matter is when you consider how big it is for everything to run around, how narrow the corridors, and if you are looking something specific to find for crafting.  Now you ask, 'Well, how would you fit environmental attributes in a post apocalyptic setting of survival like GE?'   To that I say, look no further than the story, and hell, even the mediocre, but somewhat interesting anime adaptation. GE can easily make missions have far more urgency, importance, and variety by adding all the things that matter in its world. Include missions where you run around in a cityscape, scavenging for materials like food, gas, or rare parts, you know, like what a lot of post apocalyptic games do?  Have missions where you escort an unarmed Ai civilian, or maybe some where you need to rescue a fellow god eater WHO IS ACTUALLY PHYSICALLY IN THE MAP, protect the outer ghetto with the defense team, or plant some strange device that attracts the monsters or whatever. The environments would have buildings/forests/run down areas for you to hide, and that way you can add stealth aspects to missions which make abilities like Muted matter, and simply downgrade the weak aragami like ogre tails so that we can satisfyingly deal with them quick and en masse like chars in the anime do during these missions. There is loads of things you can do with the already fun action, and i feel the developers simply need to start using their damn heads to focus on what the game is lacking in and ponder why MH is beating them in quality. The answers are frikin obvious.   Finally, where in the hell is the Online!!??? I can understand if people wanna complete the story first, and I know I did, but there are practically no lobbies where people can simply meet for the first time, and just play the damn game, and assist each other, while exchanging avatar cards for offline. Everyone seems to be anti-social ♥♥♥♥tards that wanna simply group up with their own set of 1-2 friends and set passwords so that the BARE minimum like me that actually look for SOME DEGREE of social aspect in this game to actually live the dream of playing Adhoc without a PSP, don't get to get in their own little box for whatever ridiculous reasons. And don't say they simply dont want anyone over/under leveled, because that can easily be fixed by request. Seriously guys, GE is online compatible, make some new damn friends already, and give this game some life.  With all that said, I still highly recommend this game series, especially if you love anime. The combat is smooth, fast paced, customization is plentiful and wonderful, the designs and graphics are just good enough for me. The story is decent, and im glad they simply have one, as opposed to MH where you are simply a sort of hired gun er blade. Ai partners are for the most part reliable, and I just love how you can seriously really feel like THE badass main character in an anime, which is just great. The dialogue having being polished from Burst is a wonderful touch, and while the in-game banter gets repetitive at times, most of the time it's great, and adds a lot of personality to the characters especially if you came from playing Burst (I actually LOVE Kanon after hearing her banter, that it practically makes up for her crappy aim XD) The voice acting is well decent enough, and i kinda feel people that outright hate it, just hate dubs in general tbh. I do agree though that it should've at least included Japanese voices as an option. despite the shortcomings, I can easily say that I am a fan of the series,s eeing that it has loads of potential to become even greater, and with all its support, I hope the developers start to address what needs to be addressed.",
            "review_score": "1"
        },
        {
            "review_text": "Not a review",
            "review_score": "1"
        },
        {
            "review_text": "When I first saw God Eater in my queueI was intrigued. I figured it looked cool so I gave it a shot. What I was not expecting was for it to be as good as it was. Not only does the game come with the first game in the series, but each game was a wonderful experience by itself.  GOD EATER 2 Review:  Pros: Great Story - Overall this game has a great story. Its an emotional ride that is for sure, and it was executed very well. Amazing soundtrack - One of the best soundtracks I've heard 60 FPS and Graphics Options Fun gameplay - there are tons of customization options for weapons, guns, outfits all the way down to bullets. Each gun and close combat weapon has its own feel and there is a weapon combination for everybody. Single or Multiplayer - the entire game can be played in either single or multiplayer. I was actually surprised how well this works, the story elements are presented like I was playing by myself but come combat the other players would join. I feel this worked very well. Good length  Cons: Graphics are dated - This game is a port of a psvita game and it looks like one. On the plus side you should be able to run this on a toaster if you try hard enough. Audio looping bug - as of this writing there is a bug in the game that causes some of the audio tracks to not loop properly. Not a big deal but what happens is the audio track will play through once during a level instead of looping for the duration of the level.  Overall this was a very fun game with a fantastic story. The graphics are dated but it ran at a silky smooth 60 FPS and looked very sharp. I would highly recommend this game to anybody that enjoys JRPGs with fast action battles.  GOD EATER RESURECTION Review:  Pros: Good Story - The story of the 1st game is quite good but it gets washed out a bit by the 'filler' content (see cons) Fun gameplay - the gameplay is almost the same and the 2nd one above with some minor changes. Single or Multiplayer - same as the 2nd one above 60 FPS and Graphics Options  Cons: Repetitive - The game gets really repetitive as it goes on. The second game has enough story and variation of levels to keep it from feeling this way but the 1st one does not. Half of the time it just feels like certain levels were put in just to make the game longer aka 'filler'  Graphics are dated - same as above but the second does have a lot more level detail, this game is however a lot older than the 2nd one  Overall its a pretty fun game. I found myself continuing to play despite the repetitiveness. The story is also pretty good and while it isn't entirely necessary for the 2nd one, there are a bunch of 'easter eggs' so to speak for those that did play the first one.",
            "review_score": "1"
        },
        {
            "review_text": "Best When U wanna play Together with your friends since its multiplayers mode lock on local servers u need few friends to help you out on story mode",
            "review_score": "1"
        },
        {
            "review_text": "As a massive fan of the first one, It has more depth to it's combat and mechanics, The story is just as good as the first, The game looks as beautiful as the first one too. A lot of new interesting characters, Only issue i can have with it is there's not a Japanese Dub for the game out. Other than that i would recommend it a lot.",
            "review_score": "1"
        },
        {
            "review_text": "Best game I ever played",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game and I love it. Sure its not a Japanese voice over with english sub but its still playable. Although it would be awesome if they update it to where we have an option to change it from english to japanese. Other than that its a great game.",
            "review_score": "1"
        },
        {
            "review_text": "its a nice game. but, not much playing it online.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing, and full of content. I'll review it as best as I can according to my own experience with the game:  + Hunter style! + Awesome Graphics, plus you get some anime cutscenes once in a while. + Incredible soundtrack. + Good Storyline, and some extra missions add a finishing touch to those stories left incomplete on GE1/GE:R. + Loveable characters, and tons of waifu material. + Character creation is vast; although i'd like some height/weight sliders, I can't complain. + Weapon customization is still a great way to make your character feel unique, going along nicely with Char Creation. + Monster design is superb. + Great Xbox controller support.  - No japanese voices to be played along english subs, which could easily be a configuration setting. - Although its Monster design might be flawless, it does feel repetitive when you find a recolor of the same enemy (which has better stats) after a while. - Multiplayer is unexistent. I was not able to play a single online mission during my entire playthrough. - **** special missions and their frecuency.",
            "review_score": "1"
        },
        {
            "review_text": "fans of God eater 4ver",
            "review_score": "1"
        }
    ]
}