{
    "app_id": 438430,
    "name": "Valentino Rossi The Game",
    "release_date": "2016-06-16",
    "developer": [
        "Milestone S.r.l."
    ],
    "publisher": [
        "Milestone S.r.l."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Racing",
        "Simulation",
        "Sports"
    ],
    "tags": [
        "Racing",
        "Sports",
        "Simulation"
    ],
    "achievements": 35,
    "positive_ratings": 214,
    "negative_ratings": 61,
    "price": 15.49,
    "description": "The most complete MotoGP™ game ever! Join Valentino Rossi’s VR|46 Riders Academy and train with him in order to become the new champion of the 2016 MotoGP™ season!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/438430/header.jpg?t=1482315308",
    "minimum_requirements": "OS: Windows® 7 SP1 / Windows® 8 / Windows® 8.1 / Windows® 10 Processor: Intel i5 2500K 3.3GHz / AMD Phenom II X4 850 Memory: 4 GB RAM Graphics: GeForce GT 640 / Radeon HD 6670  1GB* DirectX: Version 10 Storage: 20 GB available space Sound Card: DirectX compatible Additional Notes: *Laptop versions of graphics cards may work but are not officially supported.",
    "recommended_requirements": "OS: Windows® 7 SP1 64-Bit / Windows® 8 64-Bit / Windows® 8.1 64-Bit / Windows® 10 Processor: Intel Core i5 4670K 3.4 GHz / AMD FX-9590 4.7 GHz Memory: 8 GB RAM Graphics: GeForce GTX 970 / AMD Radeon R9 390 4GB* DirectX: Version 11 Sound Card: DirectX compatible Additional Notes: *Laptop versions of graphics cards may work but are not officially supported.",
    "reviews": [
        {
            "review_text": "With over 120 hrs on motogp 15 i can instantly tell the difference in the 2 games. this game has been improved in every way apart from one and thats the braking. the braking is useless and may aswell be using 2 blocks of wood to stop. this needs fixing ASAP. to me right now it needs improving in just that single way other than that its great",
            "review_score": "1"
        },
        {
            "review_text": "Haven't really played MotoGP series since MotoGP12, as a MotoGP fan i am impressed with this although there are a few things i'd say to anyone reading reviews before making this purchase.  Pro's so far (will come back to edit): -Easy to get into -Nice career mode, fairly well built around the player -Good leveling system within career  Con's -Not good for keyboard players, would suggest investing in a controller -Car Physics for Drifting/Rally are god awful (Stick to Bikes...Please) -AI suck, by far the biggest con for me. It seems as though they don't even count you as being on the track, they hit you out of the way and you can't do they same to them or you'll just fall off.  The game itself is good fun when you're just passing time. I wouldn't recommend this at full price though so i'd suggest to anyone wanting to buy it to wait til it's on sale or buy it cheaper from a third party website.",
            "review_score": "1"
        },
        {
            "review_text": "Rear wheel on the GP bikes is no longer made of butter,  they changed those tyres to the flat track bikes, those things have anal lube coating on the wheels   braking on GP bikes is terrible, your old braking points are useless,  you must brake sooner as the bike cant stop, wont stop,   cant trail brake into turns anymore without getting a mouthfull of tarmac  sounds are a bit better you get a stamina bar now, still not sure what happens when it runs out  positively surprised, im loving the flat track mode, still need to get used to the new feel of the GP bikes ",
            "review_score": "1"
        },
        {
            "review_text": "Not bad at all",
            "review_score": "1"
        },
        {
            "review_text": "M.P. not working. Read many complaints regarding M.P. so I'm not the only one with this problem. Milestone, you seem to get worse every year.",
            "review_score": "-1"
        },
        {
            "review_text": "Just no, not worth the money. Weird control layout.   I might be blind or something, but I can't seem to change my controls at all as there are no options to do that.",
            "review_score": "-1"
        }
    ]
}