{
    "app_id": 438680,
    "name": "One Troll Army",
    "release_date": "2016-05-19",
    "developer": [
        "FlyAnvil"
    ],
    "publisher": [
        "tinyBuild"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Achievements",
        "Partial Controller Support"
    ],
    "genres": [
        "Casual",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Free to Play",
        "Indie"
    ],
    "achievements": 15,
    "positive_ratings": 936,
    "negative_ratings": 169,
    "price": 0.0,
    "description": "Play as a giant troll in One Troll Army - a defense game about building forts, upgrading your troll, and fighting off waves of enemies. Play Against The Twitch Chat!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/438680/header.jpg?t=1464213295",
    "minimum_requirements": "OS: Windows XP or later Processor: 1.8GHz single core Memory: 2 GB RAM Storage: 500 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "18 May 'If Twitch Chat beats us in One Troll Army, we'll make it free' 19 May 'It's official! One Troll Army will be free'  Still makes me laugh. Good game.",
            "review_score": "1"
        },
        {
            "review_text": "Clunky laggy engine.  DLC adds itself to your cart without permission.  Cannot recommend.",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty fun for a free game. Played for about 4 hours felt like 30mins",
            "review_score": "1"
        },
        {
            "review_text": "Extremly Enjoyable  so many diffrent styles of games mashed up into This One minor problem its my personal problem i fell like in the campaing im attacked more often than normal  but thats my problem i guess i have to come to accept it and I love This Game 10/10 would recommend and love to see many diffrent Tatics Have Fun All Hope this Review Give Everyone wanting to try the game a idea on what its like BYE :)  ",
            "review_score": "1"
        },
        {
            "review_text": "This game is great and for a free game Iv rarely touched better. Sets a new standard in free gaming!  Very fluid dynamic gameplay... ;) If you like tower defence youd be a fool not to play this.  Your tower is in the middle. You need to allocate the amount of workers between repairing, building upgrades to your tower and collecting resources between each wave. When the enemies build up enough you charge your gorilla-like Troll around punching, pushing and generally being a nuicance while your towers rain pain on the invading savages (you did build some towers by now right?!)  There are a few levels of upgrade (so far, I hope) and 4 types of towers to build, one in each corner of your main tower. Its pretty simple yet well done. Did I mention its free?",
            "review_score": "1"
        },
        {
            "review_text": "  Eh, its not bad. About as much replayability as something like Bloons Tower Defense 3. Graphics make it fun and a bit more engaging, but otherwise its at its core just another defense game. My game hours were enough to beat the 'campaign', get every achievement, and unlock every building, and max out my resources. And, well, since it was free, I'd say I got my money's worth.   The one annoying and shady thing the game does (as other reviewers have mentioend) is ingame is a link to auto-add their DLC skin pack for like $2.00. Also lame, also not worth it, and also skecth that they kinda make it too easy to accidentally buy.  TLDR: The game is good, if you get it for free and need an afternoon to kill",
            "review_score": "1"
        },
        {
            "review_text": "Good 2-day time waster. Not that hard, unigue and free. Achievements are finishable.",
            "review_score": "1"
        },
        {
            "review_text": "  Definitely a fun little game, it's still a little rough and needs a tich more polish, but very enjoyable and a nice different take on the Tower Defense genre. It's definitely worth your time on the side.",
            "review_score": "1"
        },
        {
            "review_text": "ok all i have to say is WOW!   If you are like me i was bored and looking for something, well you found it!  Great game a bit clunky at times but very fun!",
            "review_score": "1"
        },
        {
            "review_text": "Great Game to pass the time, and its free, definately worth a play",
            "review_score": "1"
        },
        {
            "review_text": "  Nice little game! I did not think it would keep me entertained for long, but it I ended playing right through all the stages. It's very seldom to find a game that's free and this good.",
            "review_score": "1"
        },
        {
            "review_text": "What an amazing video game. If it only wasn't for those bugs and some optimization could have been well worth 10 bucks or more. Thank you for this amazing experience!",
            "review_score": "1"
        },
        {
            "review_text": "Great game!",
            "review_score": "1"
        },
        {
            "review_text": "I don't typically write reviews these days, but for the low low price of free One Troll Army is a neat take on Tower Defense. A little short (because goblins huehue), but you'll definitely get your no-money's worth.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome fun game... and its free.",
            "review_score": "1"
        },
        {
            "review_text": "A nice game, wish you could bind ''Troll'' skills to keybinds.",
            "review_score": "1"
        },
        {
            "review_text": "Its cool, but to unpolished and lack of content.... Need + things, + mechanics to make game better",
            "review_score": "-1"
        },
        {
            "review_text": "This is a GREAT little game and a lot of fun... if it was 2 or 3$ i´d pay that all day long but its FREE! And no, its NOT a 'upgrade from shop with real money' kind of game or a browser game or anything its just a realy cool, free little game! Get it while its hot! :)",
            "review_score": "1"
        },
        {
            "review_text": "great game remind me of a old game(only had the demo :( of it ) where a hero had to protect the village and his cows grafic is ok  contols can be better but its ok too best tower defend game so far and one of the few games i didnt turn off the music",
            "review_score": "1"
        },
        {
            "review_text": "  Really good game!",
            "review_score": "1"
        },
        {
            "review_text": "A fun little tower defence game reminiscent of flash games from a few years ago that were extremely fun and addicting, but suffered from a lack of content. As with those, One Troll Army is pretty fun to play but all of the game's content can be completed in around 3-4 hours, after which you unlock a 'survival mode' that offers an endless version of the game's campaign. One cannot truly complain about the lack of content though, considering the game is completely free to play with no microtransactions that I'm aware of except for some cosmetic things for your troll.  The game itself focuses around a troll who offers to protect a fledgling goblin settlement from being raided and destroyed by invading migrant beastmen and to do this you are given direct control over both the settlement and your troll itself.  The troll is controlled in a manner similar to a real time strategy unit, or an action roleplaying game character; he can move around, be told to attack enemies and has access to several abilities as well as stat and ability upgrades. The settlement itself is controlled through menus and sliders, with goblin workers that are assigned to perform different tasks to gather resources or upgrade buildings. It's a relatively simple progression system, with goblins gathering resources to upgrade buildings that either improve base defence and towers or allow you to upgrade your goblins so you can gather resources even faster. Each building upgrade also gives you more goblins, allowing you to do more things at once and do them more effectively.   Though this sounds a little like a more traditional real time strategy title, it is in fact a wave-based defence game. Each wave is split into two different roungs, with the first being a non-combat round during which you can control the economy and upgrades of your settlement. During this first round, enemy beastmen will begin to approach the settlement and hang around on the outskirts, waiting for enough of them to appear to begin an attack. When enough enemies arrive, the will initiate the combat round of the wave in which all goblins hide inside your settlement and you have to fight back the onslaught with the aid of hireable orc mercenaries and towers capable of firing upon the enemies. When all enemies are defeated or your settlement is raided, the combat round ends and the next wave begins.   This, unfortunately, is the worst part of the game. If your settlement is raided (I.E, you lose against an enemy wave), there are absolutely no negative repercussions for this loss. All of your resources remain and the difficulty of the next wave will be lowered to compensate for your inability to proceed. This leads to situations in which there is absolutely no reason not to purposely lose every single wave and just focus entirely on upgrading your settlement to maximum, since enemies cannot steal your gathered resources or kill your goblin workers to upset your progression (this does mean you don't gain gold from looting enemies, but since you can trade resources for gold and other resources at a very good rate, this is hardly a negative).   Once you have upgraded all of your buildings to maximum level, have fully upgraded your troll and and completed all three of the 'campaign' levels in the game, you have pretty much seen all of what this game has to offer. It's a fun little game, but it ultimately has some serious design flaws that makes it unlikely that I'll play it again. I enjoyed my three or so hours time playing, but it's not worth investing more time than that. Still, the fact that the game is completely free means that there's no harm in trying it for yourself and having some fun.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome freebie. Short, but if you're a fan of tower defences it's worth a try. Kudos to the devs!",
            "review_score": "1"
        },
        {
            "review_text": "  Trolls always get the last word.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome freebie. Short, but if you're a fan of tower defences it's worth a try. Kudos to the devs!",
            "review_score": "1"
        },
        {
            "review_text": "Great game got about 2 hours of fun out of it before i beet the game there are some bugs but nothing awful.",
            "review_score": "1"
        },
        {
            "review_text": "A decent game that is ruined by holding your hand the entire time, making it a chore instead of a game.",
            "review_score": "-1"
        },
        {
            "review_text": "  very nice game and it's free",
            "review_score": "1"
        },
        {
            "review_text": "Best F2P game on steam :)",
            "review_score": "1"
        },
        {
            "review_text": "  This game has cool base-building and cool goblins.",
            "review_score": "1"
        },
        {
            "review_text": "very very very fun game!!! highly recommended!!",
            "review_score": "1"
        },
        {
            "review_text": "  the embodyment of a spectacular lo-spec game",
            "review_score": "1"
        },
        {
            "review_text": "Interesting twist on defense game.",
            "review_score": "1"
        },
        {
            "review_text": "  Fun Easy and Free.. Beatable in 10 hours.",
            "review_score": "1"
        },
        {
            "review_text": "  Your troll is supposed to get healed in between rounds. This doesn't always happen. Sometimes you can see your health bar and sometimes you can't. Your troll dies after being attacked once. You're told to make upgrades that are pointless and that you can't use for a long time in to the game. The loot you are supposed to collect off the ground disappears in seconds so you can't get it fast enough slowing your progress.",
            "review_score": "-1"
        },
        {
            "review_text": "A one troll army couldnt hold me back",
            "review_score": "1"
        },
        {
            "review_text": "I did all the tutorials and then I moved on to endless which was fun at first, but then when I started the game on easey it auto-maticly increased the hardeness level every time i opended the save file. So I deleted the save file and started another game but I wanted to skip straight to endless but it would not allow me to. Do not get horriblr and buggy game.",
            "review_score": "-1"
        },
        {
            "review_text": "It's pretty cool, but it's far too clumpsy (building &amp; management interface + orc combat controls) to be enjoyable. I know that it's free, but it's not the price vs enjoyability that's the problem, it's just the enjoyability that's too low.",
            "review_score": "-1"
        },
        {
            "review_text": "It\\'s free, but it\\'s terrible. The UI is unintuitive, and the game itself couldn\\'t hold my interest past the first few rounds. Some might say you don\\'t lose anything by trying it, but your wasted time is also a loss.",
            "review_score": "-1"
        },
        {
            "review_text": "I tried to play this with a controller. Hitting attack buttons would result in my troll swinging in random directions. It was difficult just to hit anything. Seemed fun, but the horrible controls made it all frustrating.",
            "review_score": "-1"
        },
        {
            "review_text": "Can't recommend this game. Combat is clunky and involves clicking enemies repeatedly. Your troll is incredibly weak and falls even on the first wave. Losing a wave seems to have no consequence, and makes progression feel trivial and unrewarding. Remove the troll and instead step up the base building and you could have a great stronghold game, but this just isn't fun. But ultimately, it's free, and might be worth a try, but I can't recommend it.",
            "review_score": "-1"
        },
        {
            "review_text": "don't have much to say didn't make it past 5 min",
            "review_score": "-1"
        },
        {
            "review_text": "Trash, it's too hard.",
            "review_score": "-1"
        },
        {
            "review_text": "thank god it was free ign wouldnt even give it 5/10 gg",
            "review_score": "-1"
        },
        {
            "review_text": "Fun game. Developers get support through the purchase of cosmetic items. No punishment for death, no real grinding that I noticed while playing, an entertaining product! ",
            "review_score": "1"
        },
        {
            "review_text": "Awesome little game. Really enjoyed it and it's worth spending a couple hours on.  That said, there's a fair bit of polish missing. The inability to lock workers (constantly removing from resoure producing accidentally), the sliders aren't accurate enough at high levels so 2 workers will be assigned/removed instead of 1. There are also some balance issues, one wave you'll be able to clear it with ease and the next you'll be dead before you can kill your first group. Overall though - definitely a recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Fun and simple game. Good to waste a few hours, but on long term you'll get bored.",
            "review_score": "1"
        },
        {
            "review_text": "  Suggestions- Orc mercs respawn Incorporate goblin warriors to replace with loafers that respawn with the barracks. Overlord costume (Sauron-type-like.)",
            "review_score": "1"
        },
        {
            "review_text": "This game is very fun. Spend me a lot time.",
            "review_score": "1"
        },
        {
            "review_text": "  Fun game and free who doesnt like that? but on the downside the controls are shall we say lacking in every department, the first lvls tutorial menus are very intrusive and make it hard to manage your peeps and the peeps were designed to me constantly managed if the controls were fixed i could easily see dropping hours and hours on this game and by fixed i mean for keyboard and mouse i dont know anything about the controller options. That being said is free game and who could hate on free games without pay to win elements that is.",
            "review_score": "1"
        },
        {
            "review_text": "Good game. 7/10 because slightly repetetive and the controls need improving.",
            "review_score": "1"
        },
        {
            "review_text": "  Suggestions- Orc mercs respawn Incorporate goblin warriors to replace with loafers that respawn with the barracks. Overlord costume (Sauron-type-like.)",
            "review_score": "1"
        },
        {
            "review_text": "  Nice game for free, fun gameplay and nice grafics.",
            "review_score": "1"
        },
        {
            "review_text": "Great strategy game, and it's free. Love it!!",
            "review_score": "1"
        },
        {
            "review_text": "Protect a village while battling an army. Always enjoyed a strategic underdog approach while rebuilding a village.  ",
            "review_score": "1"
        }
    ]
}