{
    "app_id": 438640,
    "name": "LEGO® STAR WARS™: The Force Awakens",
    "release_date": "2016-06-27",
    "developer": [
        "Traveller's Tales",
        "TT Games",
        "Feral Interactive (Mac)"
    ],
    "publisher": [
        "Warner Bros. Interactive Entertainment",
        "Feral Interactive (Mac)"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support"
    ],
    "genres": [
        "Action",
        "Adventure"
    ],
    "tags": [
        "LEGO",
        "Star Wars",
        "Adventure"
    ],
    "achievements": 69,
    "positive_ratings": 1828,
    "negative_ratings": 422,
    "price": 24.99,
    "description": "The No. 1 LEGO® videogame franchise triumphantly returns with a fun-filled, humorous journey based on the blockbuster film. The game will also feature brand new story content from the Star Wars Universe that explores the time between Star Wars: Return of the Jedi and Star Wars: The Force Awakens.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/438640/header.jpg?t=1470162955",
    "minimum_requirements": "OS: Windows XP/Vista/7/8/10 Processor: Intel Core 2 Quad Q6600 (2.4 GHz) / AMD Phenom x4 9850 (2.5 GHz) Memory: 4 GB RAM Graphics: GeForce GT 430 (1024 MB)/ Radeon HD 6850 (1024 MB) DirectX: Version 9.0c Network: Broadband Internet connection Storage: 14 GB available space Sound Card: DirectX compatible Additional Notes: Windows XP and DirectX® 9.0b and below not supported",
    "recommended_requirements": "OS: Windows XP/Vista/7/8/10 Processor: Intel i5, 4 x 2.6 GHz or AMD equivalent Memory: 4 GB RAM Graphics: NVIDIA GeForce GTX 480 or ATI Radeon HD 5850 or better, 1Gb RAM DirectX: Version 11 Network: Broadband Internet connection Storage: 14 GB available space Sound Card: DirectX compatible Additional Notes: Windows XP and DirectX® 9.0b and below not supported",
    "reviews": [
        {
            "review_text": "TL;DR: I enjoyed it and would recommend! I was a real fan of the actors coming back and voicing new lines, the space/air combat, and I found the length of the game to be satisfying (took me 33 hours to achieve 100% completion).   “There has been an awakening in your wallet. Have you felt it?”  Lego Star Wars: The Force Awakens is my first venture into a Lego video game since Lego Star Wars III: The Clone Wars; I bring this up because I'll be covering some features that are new to me, but may not be new to the Lego video games. Before I go over the 'new' mechanics, I'd like to address a concern I had about the game and that some of you who are reading this may be having: the other Lego Star Wars games covered three or more episodes -or what existed of a TV show at the time- but this only covers a single film, so this one is probably on the short side compared to the others, right?   Well, in my experience and opinion, I found there to be a very satisfying amount of content. The game contains ten chapters which each took me close to an hour to complete (I went for filling up the stud meter), then there is a prologue and epilogue level (probably about 20 minutes to finish these), plus there are six bonus missions that fill in some blanks that aren't addressed in Episode VII which took me around 40 minutes a piece, and there are side activities that you can complete on top of all that. So if you like collecting studs and maxing out your meter then this might be somewhat reflective of the playtime you may experience. If collecting isn't your thing, then you can probably rush through a chapter in about fifteen to twenty minutes, depending on the chapter, but I'm not entirely sure.  I really appreciate the high quality of the game and I felt that corners weren't cut beyond not waiting to release it as a trilogy (such a small nick in my opinion). The graphics looked great to me, though I admittedly don't have much of an eye for graphics or art. The one thing that absolutely blew me away was the fact that they got nearly all the actors from the film to come back and voice new lines for the game, including Harrison Ford who they got to say, “Wookiee Cookies.” Although I am considerably older since I last played a Lego game, I did find the humor (both dark and otherwise) to be well in line with what I remembered and it did get a few audible laughs from me.   Moving on to those 'new mechanics' I teased earlier. They added a cover system that only works during certain segments of the game (you go into cover mode because the game makes you as part of the level design, it's not a choice based thing) which I found to be alright, but nothing to type home about, but I guess the joke is on me, because I am typing about it! Space and Air combat (both done with starships) is present, some segments are on-the-rails, while others let you fly freely to your heart's content. I found those segments really well done and they ended up being a highlight of the game for me (I would sometimes go back and load up that segment of the chapter and just mess around shooting down fighters, rather than completing the objective and being forced along the story).   Unlockable cheat codes return, so you can do things like make the voices squeaky or increase the rate at which you earn studs. Character creation and hidden unlockable characters from the other films, such as Darth Maul, also return.  My three gripes/criticisms about the game are as follows: You cannot skip the introduction video which includes the companies involved with the production of the game, BB-8 is required for a whole lot of puzzles (moreso than any other character, so that got kind of annoying to me), and one of the extra missions (the one detailing how C-3PO got his red arm) is PlayStation 4 exclusive. That said, those complaints are minor and didn't hamper my overall enjoyment of the game.   I heartily recommend this game, especially to Star Wars fans and/or fans of The Force Awakens.",
            "review_score": "1"
        },
        {
            "review_text": "Straight to the points Review 3 Apart from being ♥♥♥♥ on with DLC not included in season pass which is needed to 100% game. I will however not let this bias review.  Its a Lego Game you complete a story, which is good and follows the plot of the film nicely. Then we come on to the bane of all LEGO games the collectables, well theres lots and I mean lots. Luckily the collectable finder is available to purchase for 500000 studs. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "I can say proudly that I am an 18 year old male who is a USMC Poolee, and that I love this game.",
            "review_score": "1"
        },
        {
            "review_text": "I own most of the lego games and they admittedly start to seem a little similar. This was a lot better than I expected and very different from the pack. I was pleasantly suprised. Starting off with the prologue the game takes you back to Episode VI and, well, no spoilers... Then it's off to Episode VII. I'm happy I picked this up. Now I want to get the season pass. So far I've had no crashes and no black screens. Running at 1440 I'm getting flawless performance on my custom built PC.  Way to go Lego and Travellers Tales. 10/10 would buy again.",
            "review_score": "1"
        },
        {
            "review_text": "Not perfect, but hey, it's lego. we don't play it cause it's hard, we play it cause it's fun. and this game checks all the right boxes for a good lego game. tons of characters, check. mildly amusing cutscenes,check. fun hub, check. Great game, I highly recommend it to any fan of the original lego starwars games.",
            "review_score": "1"
        },
        {
            "review_text": "The most gaming fun I’ve had with either series in years. The story is great, the levels are dense with fun puzzles, and unlocking all of the secrets is a blast.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best Lego games I have ever played 10/10 ",
            "review_score": "1"
        },
        {
            "review_text": "I've played LEGO Star Wars The Complete Saga since it was released and I think that this game came out great.  I didn't really like the concept of voice acting at first, but suprisingly it turned out to be better than expected. I also appreciate the option travelling to planets and exploring them in this kind of open world feeling. It has awesome gameplay, graphics, and a whole lot of new features, that the old one didn't have.  Overall it's really just amazing, yet The Complete Saga will always remain best in my opinion.",
            "review_score": "1"
        },
        {
            "review_text": "It's good. So good.  Now to be fair, I have'nt played a Lego game since the original Lego StarWars games and this game is like that but 1000 times even better. The Jokes are simplistic yet still put a smile on your face. For a game directed to a younger audience it still holds up for the older fans of Lego and StarWars.  10/10 Would Recomend getting.",
            "review_score": "1"
        },
        {
            "review_text": "The buggiest game I've played since Assassin's Creed Unity. I've got, what, ten-twelve hours played now? And I'm guessing at least - AT LEAST - half of that is just replaying broken sections. Objects disappearing, player characters falling out of the game through floors and walls; enemies not spawning or getting stuck somewhere, buttons randomly no longer working, animation issues and graphical issues and crashes, oh my.   The game's actually unbeatable for me. I've got all my drivers updated, have tried with various graphical settings, DX9 and 11 (11 doesn't work at all, for the record - game crashed during the first level every time), and it doesn't matter. I get to the Resistance Base level, relatively late in the game, and I'm able to complete it... but it crashes every time during the end cutscene. And doesn't save the level as complete. So I have to do it again. And again. And again.   Anyway. I'm sure I've forgotten something, but that's fine. I'll just go ahead post this now, and patch in a better review later.",
            "review_score": "-1"
        },
        {
            "review_text": "I haven't played a LEGO game in a while and was kind of itching to play one. The Force Awakens scratched that itch well enough. The LEGO game formula is still enjoyable when experienced in moderation.  Traveler's Tales added a few new twists since last LEGO game I played (cover shooting being one of them - had a laugh at that), but nothing that really drastically changes the gameplay versus the prior games. That's ok, I still have fun with the very basic puzzle solving and button mashy combat in these games.  One new element (to me at least) is side missions on hub worlds - but these are all pretty tedious. They mostly boil down to time limited checkpoint races or performing short tasks recycled from the sort of tasks you perform in the story mode levels - both of which are exceptionally easy and repeated many times. Repeating these tasks outside of the context of playing a level just feels like busy work to pad out the play time and I don't think the game needs it. I got my money's worth from the story mode - though was compelled to do the side stuff anyway because of the obsessive completionist in me.  On the bright side, I was pretty impressed by the graphics, even though they're only representing LEGO figures, they're quite detailed and look almost photorealistically believably as toys come to life at this point. Also they got the entire principle cast of the movie to record new lines for this game, which is pretty amazing.  I did experiencing some crashing, somewhere around a half dozen random crashes over the course of 30 hours of play - which is not too bad, but the game has one of the most obnoxiously long, unskippable (by any means) startup sequences I've ever seen, so that certainly didn't help lessen the annoyance of getting back into the game after a crash. Obviously fixing the crashing would be best, but even if it was fixed, a skippable intro still the only major thing I'd wish was different about the game.",
            "review_score": "1"
        },
        {
            "review_text": "This is by far the best lego games in terms of graphics, gameplay mechanics and voice acting( by the actual actors themselves!). The new cover/shooting mechanic that was introduced is absoulutly amazing and helps add variety into this game. I would highly recommend if you like lego games and star wars",
            "review_score": "1"
        },
        {
            "review_text": "Great Game! But 40$ Is Not Recommended",
            "review_score": "1"
        },
        {
            "review_text": "Combines the good parts of the original games and adds new and interesting concepts with new weapons and powers, would definetly recomend if u enjoyed the original Lego Star Wars games",
            "review_score": "1"
        },
        {
            "review_text": "Best game in the series, no doubt.  ~8 hour main story (managed to play through the whole thing my first try over the course of about a week without a single crash or game-breaking glitch). -More side missions on top of that. -Multiple versions of each character for different outfits and abilities. -Tons of humor. -Great graphics and audio (however some of the lines taken directly from the movie have awkward sounding cut-offs) -Respectable loading times considering level sized.  -Only real gripe is that it takes too long from launching to playing. Un-skippable intro scenes and a main menu style that just takes too long to use (you'll know what I mean) ",
            "review_score": "1"
        },
        {
            "review_text": "I would whole-heartedly say that this is my favourite, and if not the best LEGO game to date. Massively immersive, the new 'cover' system is a fantastic addition to the franchise, adding something really fresh to the gameplay. I also like how the play styles for each character are a lot more intuitive than the other games. And also whenever there is a bug i.e character not being able to move, or walking on the spot, the game will realise it and almost automatically frees the character, unlike the other LEGO games where some bugs have been absolute gamebreakers. Honestly, the graphics are stupendous, with every LEGO game the graphics are improving each time. The story and overall feel is so much better than the actual movie. I will definitely be going for completionist on this just because of how much fun it is. Even if you're a mediocre LEGO games fan, just buy it, I'll be extremely surprised if you don't get on with it.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game! But 40$ Is Not Recommended",
            "review_score": "1"
        },
        {
            "review_text": "I knew this game was about the dark side, but i didn't realize it would be all black...",
            "review_score": "1"
        },
        {
            "review_text": "i liked this game better then the others     ",
            "review_score": "1"
        },
        {
            "review_text": "Very glitchy and kinda short, the lego clone wars game was better, but it is still worth the price. The new AI is much worse. In the clone wars lego game, when you played as a soldier of the federation for example, the seperatists would attack you during free play, and they no longer do that. The free play mini games are pretty fun but lack depth. Also if you are going to buy the character packs just buy the $10 one, because if you buy the other ones first you are littlery paying for nothing. overall game quality: 75/100",
            "review_score": "1"
        },
        {
            "review_text": "Best. Lego. Game. Ever. Honestly, I've only played the first few chapters, and this is incredible, it looks amazing, it plays brilliantly and it's genuinely really funny. If you like Star Wars, Lego, Fun, Happiness, Etc. Buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "...",
            "review_score": "1"
        },
        {
            "review_text": "I feel like most of the reviews left out how bad the controls are. The worst controls I have ever seen. I don't even know right now. It almost made me sick. I love Star Wars but I feel like most of the reviews are biased and this game isn't made for PC. Had to refund.   P.S. If you are planning on using your mouse to play this game then go ahead and unplug it. It serves NO purpose in this game.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is great I have been playing it on splitscreen co-op with a sibling. I havnt completed the story yet but its really cool and so are the side missions, the admiral ackbar rescue one is quite good.  Also there are many easter eggs!  It is a great game to play if you like LEGO and are a Star Wars fan.",
            "review_score": "1"
        },
        {
            "review_text": "great best lego game ever! Well when the game works, the autio did nit wirk when i frist downloaded the game so i had to clean my regestry and then it worked! the same great lego humer that we all know and love. ",
            "review_score": "1"
        },
        {
            "review_text": "Lego - timelss classic! All lovers recommend.",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed the game, it has some great humor in it, if you're a LEGO® STAR WARS™ fan, i would really recommend this game. I've loved the whole serie, and it's getting better with every lego star wars game that comes out. 9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Everything is amazing aside from the fact that the Astromech Droids like R2-D2 can no longer hover like they could in the original saga. They actually weren't very useful in general, but that may be because they didn't show up a lot in the movie. 9/10 until they give R2 a jetpack.  As good, if not better than the other Lego Star Wars games.",
            "review_score": "1"
        },
        {
            "review_text": "Poorly optimized for my computer and wonky controls. Sounds like a Lego game to me!",
            "review_score": "1"
        },
        {
            "review_text": "If I may say so, This is one of the best Lego games ever to come out. The humour, the stages, the Gameplay, everything is (just) awesome. (xD) A really good job.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic looking game with almost just as fantatic gameplay. I say this because being a fairly new-ish game, there are some bugs and misshaps throughout the game. Nothing too game-breaking, but bugs nonetheless. One great thing they did with the game was include characters from the prequals and the original trilogy. I'm personally glad they didn't add Jar-Jar, but I also wished that they had chose different characters to implament. Hopefully all the bugs will be worked on/fixed. Highly reccomend playing this if you like Star Wars.",
            "review_score": "1"
        },
        {
            "review_text": "this game is perfect. so glad to see another lego star wars game cant wait to see the DLC's and future lego star wars games.",
            "review_score": "1"
        },
        {
            "review_text": ":}",
            "review_score": "1"
        },
        {
            "review_text": "Great LEGO game. Anyone who enjoys or has a 'history' with Lego games or Star Wars should definitely pick this one up",
            "review_score": "1"
        },
        {
            "review_text": "Awesome. 10 out of 10 Wookie Cookies. I went from playing the lego games on my Wii to this, so imagine my surprise at the incredible graphics...for legos. Super fun game. I'm about halfway through it if the plot from the film is any tell, and i just got it two days ago. I can't stop playing. Best lego game yet! Lots of funny bits too...just wait til you see Kylo Ren's room. HA!",
            "review_score": "1"
        },
        {
            "review_text": "People say it is better than the movie...I get that.  Game is great, I am usually not a big Lego fan but Tt rellay nailed this one. It is a great use of the Star Wars license and imo Tt's best work. It treats the Star Wars license with a lot of respect but still making constantly fun of it. Lots of locked out content though which lets you grind to play them which is sh#t.",
            "review_score": "1"
        },
        {
            "review_text": "This is amazing, by far the best game I have ever played nice job TT.",
            "review_score": "1"
        },
        {
            "review_text": "best lego game! graphics are good and barly any glitches and great gameplay experiance. this is a very good lego game and its star wars! 9/10",
            "review_score": "1"
        },
        {
            "review_text": "The game is great and its nice they added new content but it does not work as there is a glitch which makes the level impossible to complete the level is the First Order Siege of Takodana which is a level pack from the dlc but when you get to the point to save the stormtroopers you do the action to save 2 out of the 4 but they dont jump down and you then cant complete the mission other than that the game is great but PLEASE PLEASE FIX IT.",
            "review_score": "1"
        },
        {
            "review_text": "its good but it just didnt have the good impact that the complete saga or the clone wars had there just doesnt seem to be anything new",
            "review_score": "1"
        },
        {
            "review_text": "I am a long timer lego player and love the lego games and always try to play them to 100%. Right off the bat I want to say I'm very happy with the original voice lines the actors from The Force Awakens did for this game. They didn't say anything amazing but the fact this lego game had its own dialog from the actors themselves was a huge point of pleasure playing this game. The game also looks amazing, scenery and characters look great, its still a lego game but it looks crisp.  Now on to the negative part of the review.  This is the first lego game I've played on the PC and I'm not sure how other games have worked but the keyboard controls for this game were difficult and awkward to use. I had to use a controller to play this game comfortably, not a big complaint though as I have a seperate controller, but for users without one it might be difficult.  I am upset with the constant level breaking bugs. Critical items disapear as soon as you build them, if you fall off devices stop working the way they should, characters are randomly inside the roof or walls. I have to restart the level for all of these and it is very frustrating when you work hard to complete a level 100%. This game has had more bugs and problems than others I've played.  The gameplay is fun, but I'm sorry to say it suffers from the lack of force powers. Previous star wars games were very fun with the use of the force and the creative ways the game incorporated it. It isn't the games fault so much as the movie has little force use at all, but even after acquiring force users and playing free play your force use is limited to shaking and breaking things, nothing more than that.   The side missions can be fun, but for the most part its just running your head against a wall for a gold brick. The carbonite classic character feature is a waste of time. I have to collect the carbonites, then take them to the Alliance base to open them and unlock the character? Just give me the character token, don't make me open 30 something carbonite boxes in a row and take up 10 minutes of my time.  Overall I ask myself what was I expecting? There are lego games that cover multiple movies that are filled with great game play but this movie just wasn't something that could have been made into a fun lego Star Wars game. It wasn't bad but it was a little boring and unremarkable.This combined with the large amount of bugs and other mentioned issues is why I am giving it a negative review. I will still continue to try to get 100% completion, with luck I won't reach my limit of level restarts before then. ",
            "review_score": "-1"
        },
        {
            "review_text": "Very funny maybe not worth the 50 dollars for premium but is still fun ",
            "review_score": "1"
        },
        {
            "review_text": "Best Lego game of all time, I'd say better than The Complete Saga!",
            "review_score": "1"
        },
        {
            "review_text": "I've played through the story mode. And this is what was good and bad.   Pro's 1. The grapich is pretty good 2. The sound is very good 3. The game was well made 4. You had many playable characters 5. It is very fun to play 6. Its different from all other lego games. 7. Very good music in the game to.  Con's 1. Kinda small story mode. It would be better if you added 1-6 or 4-6.   There isin't that much con's to be honest. I enjoyed the game. But it would be better if you could play ep 1-6",
            "review_score": "1"
        },
        {
            "review_text": "Amazingly fun game great for any star wars fan!",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing! I haven't even completed all of the story but I knew just from the first few levels that this is the ultimate Lego video game. The characters, weapons, vehicles, and scenery all look great. When I first started the game, I had a little trouble due to the way the controls were set up. Since I reconfigured the controls to better suit me, I've had no problems with this game, it's more fun and also more challanging then previous Lego games.  When you don't understand something, there's almost always a little control panel you can hit that will give you a helpful hint making it easy to understand. The blaster battles, which I believe are a new thing with Lego games, are so fun and satisfying. You get to duck behind cover and pop-out to blast some enemies. This is also the first Lego Star Wars video game to have dialogue. It has lines from the movies throughout and also some unigue dialogue that wasn't seen in any of the Star Wars movies. Flying in an X-wing or the Millennium Falcon, shooting down TIE Fighters has never felt more gratifying then in this game.  Overall, I would call this game the most satisfying Star Wars video game experience available to us today.",
            "review_score": "1"
        },
        {
            "review_text": "The Prolouge was my favorite part, being able to play the last few levels of the complete saga but looking nicer is amazing.",
            "review_score": "1"
        },
        {
            "review_text": "it possible to make characters that are not in the game as customs you can make luke skywalker from episode 7 star wars the force awakens I recommend you play this",
            "review_score": "1"
        },
        {
            "review_text": "on the mission where you have to get supplies for the falcon like the cookies and the fuel, everytime i finsih in the cutscene the game crashes and i have to do it all over again. the game is very glitchy ive dont this level at least 5 times. once they fix the glitches it will be a good game but for now i dont recommend it. buy the complete saga instead",
            "review_score": "-1"
        },
        {
            "review_text": "Am i Ok? My Star Wars The Force Awakens is blank screen i know its preload and thats why but people are saying stuff about 'rebooting your computer', do i have to just turn it off then back on, or completely reinstall my entire computer?",
            "review_score": "1"
        },
        {
            "review_text": "If you like Lego games buy this, if you like Star Wars buy this",
            "review_score": "1"
        },
        {
            "review_text": "Very good game, funny and long levels, the best part was when my game didnt load a level properly and i wasted half an hour trying to play.",
            "review_score": "1"
        },
        {
            "review_text": "The game is nerly unplayable on a PC because of the terrible way they have mapped the controls to the keyboard.",
            "review_score": "-1"
        },
        {
            "review_text": "Game lags hardcore and keeps stopping and starting making it really difficult to get past the menu. Also won't recognise my controller so I have to use my keyboard which it also struggles to recognise. Would probably be a great game if I could actually play it.   Dissapointed",
            "review_score": "-1"
        },
        {
            "review_text": "its not mulitplayer if youre planning to play through with a friend campaign then youre going to have to do it split screen and not online",
            "review_score": "-1"
        },
        {
            "review_text": "10/10  only issue is that they should nerf the loading screen   edit  they nerfed the loading screen",
            "review_score": "1"
        },
        {
            "review_text": "Worst game ever for a 5 year old. Worst keyboard interface ive ever come across.",
            "review_score": "-1"
        },
        {
            "review_text": "story for fun 9/10   kylo ren u hot head kid LOL",
            "review_score": "1"
        },
        {
            "review_text": "pros:   ok storyline  cons:  game crashes when you alt tab  game crashes randomly in general  game crashes cause my computer to crash and i have to restart it  game resets your progress after it crashes",
            "review_score": "-1"
        },
        {
            "review_text": "Don't bother buyign this game until it is fixed. It should be called Lego Star Wars: The Force Awakens Black Screen Edition. Price should only be £0.99 for a game which allows you to play Black Screen for the entire game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is for 10 year olds - and even they will have a hard time enjoying it. This game needs a tutorial and mechanics that don't suck - worst star wars or lego game i've ever played.",
            "review_score": "-1"
        },
        {
            "review_text": "its to hard cxant complete  ] ",
            "review_score": "-1"
        },
        {
            "review_text": "Traveller's Tales has done an amazing job with the LEGO games, and this is no exception.  Easy to play, multiplayer works great, controller integration through Steam is seamless.  A great game for parents to play with younger kids.",
            "review_score": "1"
        },
        {
            "review_text": "Great games :D",
            "review_score": "1"
        },
        {
            "review_text": "I've been having an absolute blast playing this. I've been playing the Lego Star Wars games ever since the very first one came out, and this one definitely stands out from the rest. Up until this game, they've mostly played the same way but with new levels and characters. This one introduces a ton of new gameplay mechanics, has a ton of replayability, and actually feels new. The game is also gorgeous and features voice acting. Daisy Ridley (Rey) recorded her own lines in this game.  I think that if you're looking for a fun, relaxing game with a nice charm, this is worth your money.",
            "review_score": "1"
        },
        {
            "review_text": "Possibly the best Star Wars game so far",
            "review_score": "1"
        },
        {
            "review_text": "All the hidden jokes made me laugh so hard I fell down the chair :D",
            "review_score": "1"
        },
        {
            "review_text": "I have only played the first 4 levels so far and can easily say, 'This is the BEST Lego Game in YEARS, if not of All Time.' I was completely blown away by the Graphics, the Movie voices are used perfectly and capture the feel of watching a movie. I can only wonder how Disney got the original actor(including the legendary Harrison Ford) to voice their characters for this game. Combat has improved tremendously over the years (I still have my original copy of the first game), and it makes you feel like a boss. However, since the fighting is a little more intense (as is the story), this isn't as good for younger players as some of the older games. But if you have no problem with your kids watching Star Wars, then this is no worse. Highly recommended for any Star Wars fan and any fan of the Lego Franchise.   10/10  Awesome!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "This game is pretty good, everything is up to standard as a lego game and all. Only downside is that it black out sometime, not all the time just only a little bit. The other downside is that it lags a bit which connects to the black out. It only lags on two worlds, Jakku and Starkiller base. Other than this, everything is fun and is good to play",
            "review_score": "1"
        }
    ]
}