{
    "app_id": 438650,
    "name": "Gravity Compass",
    "release_date": "2016-05-10",
    "developer": [
        "NovaWake Studios"
    ],
    "publisher": [
        "NovaWake Studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Casual"
    ],
    "tags": [
        "Casual",
        "VR",
        "Relaxing"
    ],
    "achievements": 0,
    "positive_ratings": 9,
    "negative_ratings": 9,
    "price": 1.99,
    "description": "A mental massage. Relax in an enchanting universe, by flying smoothly through a gigantic system of caves with otherworldly galaxies, and original music. Without handheld controllers, but a Mouse and Keyboard mode is included for those who don't have an Oculus Rift.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/438650/header.jpg?t=1463178884",
    "minimum_requirements": "OS: Windows 7 or Greater Processor: CPU: Intel Core i5 4590 or greater Memory: 8 GB RAM Graphics: GeForce GTX 970 or AMD Radeon R9 290 or better DirectX: Version 11 Storage: 1 GB available space",
    "recommended_requirements": "OS: Windows 7 or Greater Processor: CPU: Intel Core i7 4590 or greater Memory: 8 GB RAM Graphics: GeForce GTX 970 or AMD Radeon R9 290 or better DirectX: Version 12 Storage: 1 GB available space",
    "reviews": [
        {
            "review_text": "I don't have VR as yet, so I've run this in 'flat screen' mode on my PC. Anybody who ever watched the media player visualisations to music will be familiar with the premise. If you've watched the sequence in 2001 a Space Odyssey with the space ship approach to the majestically spinning space station (and if not why not?) this is probably for you. Its pretty and relaxing - but it goes nowhere and does nothing - while I can see the appeal of walking through a galaxy of stars, this is a sit down simulation, so not sure what the point would be in VR. I think you need to go somewhere, be taken on a journey through those spiral arm galaxies and feel like there might be a destination, like watching the galaxies birth. I confess to not being keen on the music provided. Vangelis music for Cosmos from the Heaven &amp; Hell album or something classical feels like it might be a better fit. The ability to switch the music for something trance like of your choice would be a future improvement I'd make. On the plus side, it ran wall without stutter and the mouse can guide your path but you can't speed up or slow down the gliding motition. Cons: it needs to be higher res. (I ran it using my monitors native resolution and it made the white blobs a bit intrusive.) Well worth it for the money as a relaxing way to chill out at the end of a stressful day light some fragrant diffuser candles and go and lay on the bed and watch it would be my advice. will be interesting to see if Nova makes more levels and what they do with them. (And undersea journey? A flight through the clouds from dawn to sunset? From earth through the clouds and into space and beyond our galaxy? The possibilities are endless!) This is officially my new favourite waste of time!",
            "review_score": "1"
        }
    ]
}