{
    "app_id": 438720,
    "name": "Heroes of Shadow Guard",
    "release_date": "2016-08-03",
    "developer": [
        "Iron 27"
    ],
    "publisher": [
        "Iron 27"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Online Multi-Player",
        "MMO",
        "Cross-Platform Multiplayer",
        "Steam Achievements",
        "In-App Purchases"
    ],
    "genres": [
        "Free to Play",
        "Indie",
        "Massively Multiplayer",
        "RPG"
    ],
    "tags": [
        "Free to Play",
        "Massively Multiplayer",
        "Indie"
    ],
    "achievements": 39,
    "positive_ratings": 26,
    "negative_ratings": 28,
    "price": 0.0,
    "description": "Experience both sides of dungeon crawling! Navigate deadly labyrinth dungeons and design your own in this ground-breaking MMO. Unlock new heroes, new gear, and new labyrinth guards. Conquer single player sagas, climb multiplayer leaderboards, and challenge friends to custom matches.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/438720/header.jpg?t=1470258980",
    "minimum_requirements": "Requires a 64-bit processor and operating system OS: Windows 7 Processor: 1.4 gigahertz (GHz) or faster Memory: 2 GB RAM Graphics: DirectX 9 graphics device with WDDM 1.0 or higher driver Storage: 200 MB available space",
    "recommended_requirements": "Requires a 64-bit processor and operating system",
    "reviews": [
        {
            "review_text": "I'm not going to put any time in on this game. Not because it's horrendous, or offensive, or really all that bad. It's just small. It's a mobile port. Which, in and of it's self isn't an issue I suppose, but they're inherently small, far too small for something like this. What it does works, in a cute little way, it's just not finished. To play it much further would, to me, almost seem indecent. It feels naked to me. So, being that it's free, and that it isn't offensively bad, (Except for the music, what the hell.) i'm going to say it's worth looking into in the future, if the developer cares enough about the game to make it a full fledged PC game. Dungeon builders CAN be great, but this formula is limiting. So my message to other players is; avoid it for now, try it in a month. My message to the developers; Go sit in time out for a minute. It was bad of you to release this in the condition it's in. Try harder. I'm not mad, i'm just dissapointed.",
            "review_score": "-1"
        },
        {
            "review_text": "As per the description, it's a cross-platform game - so you get everything that comes along with it: the UIs aren't PC targeted and neither are the graphics. However, some of the visuals are actually pretty nice, and the concept is very original. If you're into turn-based dungeon crawlers - something with a multiplayer spin like this is really cool.  Definitely worth the download.  ",
            "review_score": "1"
        },
        {
            "review_text": "Yet another awful game trying to empty your bank account with endless ways to spend money on it.",
            "review_score": "-1"
        }
    ]
}