{
    "app_id": 438730,
    "name": "Poly Towns",
    "release_date": "2016-04-22",
    "developer": [
        "Red Phoenix Studios"
    ],
    "publisher": [
        "Red Phoenix Studios"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements"
    ],
    "genres": [
        "Casual",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Casual",
        "Strategy",
        "Indie"
    ],
    "achievements": 10,
    "positive_ratings": 15,
    "negative_ratings": 18,
    "price": 3.99,
    "description": "Poly Towns is a simplistic town builder. Start with a single zone and expand, growing your town and managing your resources along the way.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/438730/header.jpg?t=1535654292",
    "minimum_requirements": "最低配置: 需要 64 位处理器和操作系统 操作系统: Windows 64-bit 处理器: Intel, AMD 内存: 4 GB RAM 图形: AMD Radeon 6000 Series or equivalent DirectX 版本: 9.0 存储空间: 需要 100 MB 可用空间",
    "recommended_requirements": "推荐配置: 需要 64 位处理器和操作系统 操作系统: Windows 64-bit 处理器: Intel, AMD 内存: 8 GB RAM 图形: AMD Radeon R9 Series or equivalent DirectX 版本: 12 存储空间: 需要 100 MB 可用空间",
    "reviews": [
        {
            "review_text": "I like the premise, but for 1.0 release, this is quite disappointing mostly because of these three things:  - Graphical / Sound settings are not properly saved - Game gets (graphically) stuck at dawn every once in a while and requires you to reload - Night is too long and too dark to properly see what you are doing  This is something I would be able to understand for an Early Access title, but for a full release with 1.0, these things are a clear oversight. Please fix these bugs and until they are fixed, I wouldn't recommend buying this right now.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game so far, but I am experiencing a few bugs like not being able to buy a Mine for my town or when moving a building that has a 'job' assigned to it, the line from the old house's position remains there, while the house is moved. Another objection is that the production rates are preety confusing and i need to stay and wait if production grows or drops :)",
            "review_score": "1"
        }
    ]
}