{
    "app_id": 439440,
    "name": "Of Carrots And Blood",
    "release_date": "2016-03-25",
    "developer": [
        "Trite Games"
    ],
    "publisher": [
        "Trite Games"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Cross-Platform Multiplayer",
        "Steam Achievements",
        "Full controller support"
    ],
    "genres": [
        "Action",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Casual",
        "Action"
    ],
    "achievements": 85,
    "positive_ratings": 68,
    "negative_ratings": 22,
    "price": 2.09,
    "description": "Of Carrots And Blood is a twin-stick survival arena shooter about kissing bunnies, hungry mutants and a lot of blood.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/439440/header.jpg?t=1459001904",
    "minimum_requirements": "OS: Windows 7 Processor: 2,16 GHz Memory: 1 GB RAM Graphics: Intel (R) HD Graphics DirectX: Version 10 Network: Broadband Internet connection Storage: 200 MB available space Additional Notes: Gamepad highly recommended",
    "recommended_requirements": "OS: Windows 8.1 Processor: 3 GHz Memory: 2 GB RAM Graphics: Radeon HD 8570 DirectX: Version 11 Network: Broadband Internet connection Storage: 200 MB available space",
    "reviews": [
        {
            "review_text": "Fun Game, but a bit lackluster content wise. I haven't been able to play beyond single player, but I feel like there should be a description stating that if you want to enjoy at least 75% of the game, you need to have a buddy who also has it. A lot of the game modes are locked out of single player. The items in the game are fairly limited, perhaps each character has different items they can equip? I am not sure. I am in the process of creating a new character in-game but it takes time (or at least thats what the Dr. said, no idea).   I really wish there was some type of campaign mode, but it seems nonexistant. IF you play single player, expect to play the same one over and over, no other stages. Just 1. Now it is fun, at the time of this review, I got about 2 1/2 hours in the game. Its a good bit of fun, but I wonder about the longeity of the game.   At this point, I would still recommend it, because its fun shooting ♥♥♥♥ with carrots, but realistically, for the amount of game content, the price should be far cheaper, OR the game should come in packs of (2) so you can take advantage of all the multiplayer features.",
            "review_score": "1"
        },
        {
            "review_text": "  Damn, potential in this game is sick but for now i can't recommend nothing here for this price.",
            "review_score": "-1"
        },
        {
            "review_text": "Disclosure: A copy of this game was provided by the developers.  Of Carrots and Blood is a top-down arena-style shooter where you play as a rabbit protecting a carrot from waves of mutated monsters.  What, that didn't sell you? OK, read on.  The art direction is fantastic with crisp, animated sprites, and the overworld reminds me a lot of the kind found in Super Mario Bros. 3. The overworld essentially functions as the game's main menu, which is a cool integration of features and gameplay.   The meat of the game is the arena-style defense and deathmatch modes. As such, the amount of fun you have with the game is likely proportional to how many friends you have playing with you. Even in a failed mission, currency is saved so you can continue to make upgrades to your arsenal: unlocking more characters and equippable items during combat.  The game gets hectic very quickly, making for fast rounds whether you're playing with friends or against them. But because the game delivers a lot of party-like elements in its gameplay, the amount of time and value you'll get out of the game is once again partially reliant on whether you have 3 friends to play with.   The only snag I've found so far is accidentally kissing my friend when playing 2-player co-op mode (I know that sounds ridiculous). Sometimes I'm scrambling to clear the screen and end up accidentally running into my friend's character, where we end up locked in a kissing animation for a brief moment. Luckily the kissing mechanic does play a useful role, which you can discover in the item shop.   Overall, the game delivers lots of intense shooting action. The controls are a breeze to pick up and you'll get the hang of it in no time. It's a great game for short play sessions, but it could also work as an amazing drinking game with a few buddies. It's weird and funny and an all-around fun experience, and if you enjoy games of this genre you'll likely be charmed by the graphics and gameplay.  ",
            "review_score": "1"
        }
    ]
}