{
    "app_id": 439930,
    "name": "Control Craft 2",
    "release_date": "2016-02-15",
    "developer": [
        "Badim"
    ],
    "publisher": [
        "Badim"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Casual",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Action",
        "Indie"
    ],
    "achievements": 6,
    "positive_ratings": 58,
    "negative_ratings": 35,
    "price": 1.99,
    "description": "Control Craft 2 is a fast paced RTS, which brings quick thinking and clever tactics together for some planet conquering action.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/439930/header.jpg?t=1549215035",
    "minimum_requirements": "OS: WINDOWS XP / WINDOWS VISTA / WINDOWS 7 / WINDOWS 8 / WINDOWS 10 Processor: Any 64 or 32 bit processor Memory: 1 GB RAM Storage: 45 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This is a enjoyable, addictive and challenging game which you can play for hours. I lik'd 95% of the game due some facts that's a great potential about very well concept of fast thinking style game. The art, music, voice acting and graphics, gameplay are great and plus 10/10 though. On the other hand in some cases the gameplay feels unbalanced in some missions that makes harder(last levels only) even with the upgrades. Only thing i may suggest if apply is a reset upgrades/stats button if it's possible.  There's one upgrade page(Skills) in the shop which contain 14:  6 troop(ground, armored and air) upgrades 8 others heavily useful(lightning strike, nuke, freeze and backup).  A tip: take the time to learn what works best for you. A tip: Jet Packs is mostly the key of victory.  You'll face 27 missions which will grant you 1+ star per mission so choose correctly because there isn't way to roll back the upgrades.  This game is basically about speed over any kind of strategy. You need conquer big/barracks, armorys, jumpers and towers by moving on it. Besides sometimes you need to be smart do letting the enemy decrease the number of the capture points while you keep increasing your amount of troops so when the enemy capture point is close to 0-5 then send all your troops there making the capture very easy. It helped me a lot.   At least I haven't found any error or something that prevents normal operation of the game. The game run very smooth, it's clear and satisfactory good. I would highly recommend this game to everybody who interested in challenge your mental/hands skills. i dare you! :D",
            "review_score": "1"
        },
        {
            "review_text": "Its an excelent game, good action, good strategy, nice graphs, good sound, and very low requisites for playing.  We need more Casual games like this!",
            "review_score": "1"
        },
        {
            "review_text": "A largely uninspired game, no meaningful challenge or difficulty, and altogether a boring, 1 hour playthrough at most.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a mobile game. Being on PC detracts greatly.",
            "review_score": "-1"
        }
    ]
}