{
    "app_id": 440420,
    "name": "True Fear: Forsaken Souls",
    "release_date": "2016-10-19",
    "developer": [
        "Goblinz"
    ],
    "publisher": [
        "The Digital Lounge"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Captions available",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Casual"
    ],
    "tags": [
        "Adventure",
        "Hidden Object",
        "Horror"
    ],
    "achievements": 40,
    "positive_ratings": 343,
    "negative_ratings": 36,
    "price": 5.99,
    "description": "True Fear: Forsaken Souls takes the best of the psychological thriller, blending in fun and intuitive gameplay mechanics. Episode 1, the first in a trilogy, will long be remembered.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/440420/header.jpg?t=1542972616",
    "minimum_requirements": "OS: Windows XP SP2+ Processor: 1.5Ghz CPU: SSE2 instruction set support. Memory: 2 GB RAM Graphics: DX9 (Shader model 2.0); 256MB DirectX: Version 9.0c Storage: 2700 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Great game, the fear lies in the mystery that continues to unfold around the main character. Player feels mostly isolated throughout the adventure. Graphics are top notch! Doesn't try to bait players with an overwhelming amount of jump scares, but rather the 'true fear' comes from a player's ability to become part of the story.  Give it a try!  ",
            "review_score": "1"
        },
        {
            "review_text": "I played this game originally on a different site. When I saw it offered on Steam with a chance to demo the sequel, I jumped at the chance to support the developers and get a sneak peek at what's coming. It's a great game. I just finished playing it again. I like it even better without the hidden objects. It's suspenseful with very well done cut scenes. I can't wait to get the new game when it's released. It's by far the best casual game I've played to date.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games I have ever played. I have never tired of it despite playing it several times. It's gripping, scary and addictive. It's a pure gem.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game if you like the leisure pastime of playing games that don't require days and weeks of your life, particularly HOPAs, but really, really, really hate the Damsel storylines that are flooding the genre. I hope part II is a success and we finally see more games like that. Developers, please set us free from the candy unicorns!  I have played this game more than once and I really enjoy the story. It has twists and turns, you visit different places (with a purpose, not just for play time) and it actually makes sense, which is really hard to say for more than a handful of games. There are quite a few of us that await patiently the next part of the trilogy (patiently, for years I must add) and this is saying something.  It is not particularly gory, but it is scary. But you have to actually play it, if you skip everything and just rush the game you'll miss half the fun. The voice actors do a great job.  It run greatly on Vista, with a glitch or two on Win10. I would prefer it if I could lock the toolbar up.",
            "review_score": "1"
        },
        {
            "review_text": "A very unique Hidden Object game. Definitely worth the money! Good story and effects.",
            "review_score": "1"
        }
    ]
}