{
    "app_id": 440550,
    "name": "Atomik: RunGunJumpGun",
    "release_date": "2016-08-31",
    "developer": [
        "ThirtyThree"
    ],
    "publisher": [
        "Good Shepherd Entertainment"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Platformer"
    ],
    "achievements": 20,
    "positive_ratings": 176,
    "negative_ratings": 20,
    "price": 5.59,
    "description": "Atomik: RunGunJumpGun is a tough as nails game that puts a gravity-defying weapon in your hands. One button lets you fly, the other blasts obstacles out of the way. With a cast of crazed characters, challenging gameplay, and a pulsing musical score, it delivers twitchy platforming goodness.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/440550/header.jpg?t=1534151393",
    "minimum_requirements": "OS: Windows XP SP2+ Processor: Dual Core 2 GHz + Memory: 2 GB RAM DirectX: Version 10 Storage: 1 GB available space",
    "recommended_requirements": "OS: Windows 7+ Processor: Dual Core 2.5 GHz + Memory: 2 GB RAM DirectX: Version 10 Storage: 1 GB available space",
    "reviews": [
        {
            "review_text": "TL;DR --&gt; Probably one of the best and most polished autoscrollers made out there, by a 3-people team that you can tell they've put their heart in this.  ------------------------------------------------------------------------------------------   THE SCAVENGER'S BACK!",
            "review_score": "1"
        },
        {
            "review_text": "The best deal of the whole Winter Steam Sale for me. (-85%!)  Absolutely amazed by everything in this game.",
            "review_score": "1"
        },
        {
            "review_text": "Dying has never been more fun, you will laugh, and you will cry, I reccomend having a designated scratcher near by, because even a fraction of a second could mean death, this game will test your metal, you will need nerves of steel, because this game will break you, but if your like me you will love every second of it!",
            "review_score": "1"
        },
        {
            "review_text": "Great game, does a good job of making it addicting! I liked it better than super meat boy. Very fast paced but doesn't get too frustrating and never feels tedious. Levels are just long enough to be hard but also solvable if you spend a few minutes perfecting it.",
            "review_score": "1"
        },
        {
            "review_text": "In the current state, I cannot reccomend this game due to performance issues of constant frame drops making the game unplayable.  Supposedly a prior patch fixed this issue but it hasn't on my computer. The game has problems running on 144hz monitors.   I would not reccomend this until they fix the frame rate bug.",
            "review_score": "-1"
        },
        {
            "review_text": " RunGunJumpGun is a very peculiar game...",
            "review_score": "-1"
        },
        {
            "review_text": "A total steal at $1! Oozes with style and charm, with satisfying and incredibly polished gameplay. Simple gameplay still allows for moments of depth and interesting on the fly choices despite the emphasis on muscle memory. (especially when facing the gunships, which are my favorite enemy)",
            "review_score": "1"
        },
        {
            "review_text": "Positives: Fast paced Easy to control Addictive Narrative is told in an interesting way  Negatives: The Third World Prone to delete player progress occasionally",
            "review_score": "1"
        }
    ]
}