{
    "app_id": 440760,
    "name": "Cube Destroyer",
    "release_date": "2016-02-15",
    "developer": [
        "Freedomize Studio"
    ],
    "publisher": [
        "Freedomize Studio"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "Top-Down"
    ],
    "achievements": 0,
    "positive_ratings": 936,
    "negative_ratings": 165,
    "price": 0.79,
    "description": "Cube Destroyer is a top-down shooter with a dynamic gameplay.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/440760/header.jpg?t=1516981371",
    "minimum_requirements": "OS: Windows Xp, Vista, 7, 8/8.1, 10 Processor: 1.8 Ghz Memory: 2 GB RAM Graphics: 512 MB VRAM DirectX: Version 9.0c Storage: 450 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Very good &amp; simply game,  It's easy to control,it has good music,the different lvl's are balanced &amp; the backrounds are pretty.  Here you're a cube which has to defend itself agaist other &amp; often stronger cube.You finish a lvl when you eliminated all enemies. With wasd you control the cube,with auf mouseclick you shoot &amp; with the mousewheel you zoom/zoom away.You must avoid the enemies shoots, or the Level will restart.  I'vent met bugs.  It improves also your reaction.   &amp; the best thing is: I made the 5lvl-card badge for it, got the heart emoticons 2-times,sold them bouth for 15€+.  12/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is strangely really entertaining to play, it's cheap and it's a good way to spend your time when you don't have anything else to do. (Also, you might rage a bit in this game :P)",
            "review_score": "1"
        },
        {
            "review_text": "Very good old school game!",
            "review_score": "1"
        },
        {
            "review_text": "I guess its ok for its price ;E kept me busy for a while ;E p.s. ok soundtrack + tradecards = ;) ",
            "review_score": "1"
        },
        {
            "review_text": "Simple And Legit Game And Cheap As Well Hope To Get A Update With Better Guns",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game I really liked it.",
            "review_score": "1"
        },
        {
            "review_text": "Personally I Have Realy EnJoyed THis Game If You Do Buy this game be warned as soon as you start you will just be thrown into the action Rule No.1 Don't Panic. it took me a while to figure out how to play the game and the stratergys involved. But Overall It was A good buy for £0.17",
            "review_score": "1"
        },
        {
            "review_text": "1. buy on sale 2. play or run in background 3. trading cards 4. profit",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "arcade game for phone ... oh wait",
            "review_score": "-1"
        },
        {
            "review_text": "Great Game!  it will slowly improve your reaction Time and make you Rage.  But its a good game to play!",
            "review_score": "1"
        },
        {
            "review_text": "Already finished the 75 levels. And i would say it needs some gameplay improvements.  no, its not a bad game, it just could be better since there are times that feel kind of a nuisance  -The shots from the turrents and the basic cube enemy are hard to see +The shots from the really tough mobs are easy to see  -Every enemy just shoots where you stand, simply dont stand where they shoot and you can just not look at the projectiles and you are still pretty much sure you will live. AKA 'keep sidestepping'  +One exemption, the spinning turrets are harder to deal with since they have hard to see shots and are very random in where they shoot.  -No boss levels, there was probably not enough motivation to keep on going if you wont give the player at least something surprising to look forward to.  -No achievements. maybe at least 1 achievement for beating the game?   ",
            "review_score": "1"
        }
    ]
}