{
    "app_id": 440740,
    "name": "Tap Tap Legions - Epic battles within 5 seconds!",
    "release_date": "2016-02-08",
    "developer": [
        "YFC games"
    ],
    "publisher": [
        "YFC games"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Casual",
        "Free to Play",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Free to Play",
        "Action",
        "Strategy"
    ],
    "achievements": 23,
    "positive_ratings": 169,
    "negative_ratings": 141,
    "price": 0.0,
    "description": "Constant fun and excitement! Bloody fighting from the start. Epic battles within 5 seconds!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/440740/header.jpg?t=1454976824",
    "minimum_requirements": "OS: Windows XP or Later Processor: Intel Core™ Duo or faster Memory: 2 GB RAM Storage: 300 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "TAP TAP TO SUMMON ALL THE TROOPS! Will be a great game if only there is no pay to win. ",
            "review_score": "-1"
        },
        {
            "review_text": "It's a moble game that is not ported for easy computer use. just a time waster game.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is bad and has horrible and boring gameplay. I do not recomend this at all. If you want to see why i don't like it and why i also don't recomend it. I suggest you see for yourself. But I warn you. Don't",
            "review_score": "-1"
        },
        {
            "review_text": "I recomend this game to others, not because it has the best quality gameplay, but because it is a free-to-play game that has, in my opinion, about an hour of fun playability before it becomes boring",
            "review_score": "1"
        },
        {
            "review_text": "fxxk. level 5 wanna to buy money -_-",
            "review_score": "-1"
        },
        {
            "review_text": "...",
            "review_score": "-1"
        },
        {
            "review_text": "I just finish the game please put more levels!!! :D",
            "review_score": "1"
        },
        {
            "review_text": "All those years of piano lessons lead up to this...",
            "review_score": "1"
        },
        {
            "review_text": "LOVE this same development from 300 SPARTANS LOVELY still vs Skeleton armies ^^ BETTER gameplay feature.. can u make it drop cards so people more play this :D",
            "review_score": "1"
        },
        {
            "review_text": "I was kind of dissapointed with this game, their fist game Battle for Blood was actually really good. So I was hoping for more like that.  First of you cannot change the resolution, my resolution is 3840*2160, and it fills most of the screen. It would be nice to have the ability to choose the resolution.   Next of and the deal breaker for me is that when entering the castle to buy something, it zooms to the item, if you cannot afford it, it never zooms back out. So I need to close the game, and load it again.   Oh well.. they are updating the game along the way, so hopefully they can fix it.   Even though the gameplay isn't as enjoyable as Battle for blood, so I hope they would add some more levels to that instead.",
            "review_score": "-1"
        },
        {
            "review_text": "Looks like fun and is (acording to the screenshots) somewhat rediculous but it lost the fun of the game after ... well look at the time i played.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a good and fun game. I recommend it as a good time waster. You should use keyboard instead of mouse though, it's much better.",
            "review_score": "1"
        }
    ]
}