{
    "app_id": 441380,
    "name": "PAC-MAN™ CHAMPIONSHIP EDITION 2",
    "release_date": "2016-09-13",
    "developer": [
        "BANDAI NAMCO Studios Inc."
    ],
    "publisher": [
        "BANDAI NAMCO Entertainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Leaderboards"
    ],
    "genres": [
        "Casual"
    ],
    "tags": [
        "Casual",
        "Arcade",
        "Great Soundtrack"
    ],
    "achievements": 18,
    "positive_ratings": 196,
    "negative_ratings": 144,
    "price": 9.99,
    "description": "The much-awaited sequel to PAC-MAN™ CHAMPIONSHIP EDITION! Featuring eye-popping 3D graphics and funky visuals! New modes include Score Attack and an Adventure mode!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/441380/header.jpg?t=1539273763",
    "minimum_requirements": "OS: Windows 7/8/10 (64-bit OS required) Processor: Intel Core i5-2300 2.8 GHz/AMD Phenom II X4 945 3.0 GHz or equivalent Memory: 6 GB RAM Graphics: NVIDIA GTX 550 Ti 2GB/AMD Radeon HD 7870 2GB or equivalent DirectX: Version 11 Storage: 3 GB available space",
    "recommended_requirements": "OS: Windows 7/8/10 (64-bit OS required) Processor: Intel Core i7 4790 3.6 GHz/AMD FX-9590 4.7 GHz or equivalent Memory: 8 GB RAM Graphics: NVIDIA GTX 780 3GB/AMD Radeon R9 290X 4GB or equivalent DirectX: Version 11 Storage: 3 GB available space",
    "reviews": [
        {
            "review_text": "Is  CE2  a good game? Yes. Is it a good game on its own right? Yes. Is it a good game compared to its predecessor,  Pac-Man CE DX ? I'm still not entirely sure.   Pac-Man Championship Edition 2  is the next iteration in the  Pac-Man Championship  franchise. It takes the standard Pac-Man arcade formula and spins it on its head. The first iteration had changing mazes and speed increases,  CEDX  introduced ghost trains, and now here we are with  CE2  that throws more ideas into the system than either of the other two games in the series did. While building on the familiar concepts of  CE  and  CEDX ,  CE2  stands far apart from these two previous titles.  If you haven’t played either  CE or  CEDX , the basic gameplay is this: Pac-Man roams around the maze, typically an asymmetrical grid, eat dots. When he eats enough dots, a fruit appears that will change that half of the maze into a different layout. Eating dots builds up Pac-Man’s speed, and the overall goal is to rack up a high score in X amount of time.  CEDX  expanded on this formula by introducing the ghost train. With sleeping ghosts scattered throughout the map, any time Pac-Man rushes by, the ghosts wake up and form a massive conga line behind him. Eat a power pellet, and they’re yours for the taking. Get caught in a bind? Hit any button to through a bomb, and all ghosts return to the cage in the middle of the screen.  While  CE2  has these concepts, it takes them in a whole different direction. The maze changes, high speed, bombs, and ghost trains all still exist, but their functionality has changed drastically. To start, there really isn’t a build of speed anymore; Pac-Man jettisons off right from the get-go, so there isn’t a need to build up to anything. Ghost trains now roam the map, attaching themselves to the four main ghosts. Bombs serve to move  you  back to the starting point, and no longer affect the ghosts at all. And, most of all, instead of changing half of the maze to something else, fruit now throws Pac-Man and the ghosts on a completely new grid.  The action is quick, the score flies, and the game is constantly making you feel on edge. The core gameplay of  CE2  is something that can stand on its own, and doesn’t really relate, functionality-wise, to the previous titles in the genre, and this is where I’m having trouble enjoying the game. See,  CEDX  is probably one of my most played games, starting with it on the Xbox 360 when it came out originally.  CEDX  built on CE in a natural progression; you still had to build up your speed, be cautious about your route, and aim for that highscore once the blood starts pumping a few minutes in. But, in  CE2 , you’re already starting out at lightning speed, and now the ghosts aren’t even very threatening anymore.  One of the major changes to the Pac-Man formula in  CE2  is that hitting ghosts  initially  no longer kills you. Instead, the ghosts have a threshold for the amount of times you can bump into them. When you bump into them enough in a short period, they’ll get angry,  and only then  will you lose a life. On top of that, ghost trains, despite being however large they are, scatter across set paths when you eat the power pellet. While you can easily see these set paths, it’s a literal game of cat and mouse, and you have to be quick to catch them, as they’ll always move opposite direction you’re headed.  What unfortunately irks me about this game is how it doesn’t feel like there’s a buildup anymore. While, yes, the action does culminate to ghost-train-power-pellet-fest once you reach a certain iteration of level jumps, that’s the only signifier that you’re near the end of the time limit.  CEDX  had, in my opinion, much better pacing to give you that satisfaction when you reach max speed, and you were zooming by because  you  built that all yourself. Screwing up your plan by missing a turn or hitting a ghost meant that you had to rebuild a chunk of what you’ve done. In this, well, it feels like nothing really happened. However, despite all that, the game is still solid fun. And at the $13 price point, it’s a no brainer if you enjoy arcade games. My only issue is that I still feel that  CEDX  is the superior game of the two, and that isn’t a bad thing. Both  CE2  and  CEDX  are great games.  My only real complaints against the game are: • It feels like Pac-Man floats in his movement. Turning corners preemptively takes practice, as there is much more leeway for if you screw up. Say you passed an intersection, and are just riding on the edge of the next wall, pressing up to preemptively turn at the next intersection at this point may throw you upwards at the intersection you just passed. • The graphics look like they clash in many places. It feels like everything was placed in here, rather than everything was created here.",
            "review_score": "1"
        },
        {
            "review_text": "Compared to PAC-MAN CE DX+, its predecessor: I'm not impressed. Partly the little things: no windowed mode; unskippable tutorial; high performance requirements. But also the big things.   In CE DX+, I liked winding my way through a non-random course and improving my path through it. I liked how misusing bombs/pellets or missing fruits would make your mistakes pile up. With the changes it made to the board, to power-ups, to the ghost trains, CE 2 just no longer has the things I liked about CE DX+.  It's still PAC-MAN. It's still an audiovisual treat. But I can't even appreciate it as a 'zone-out' game; the new elements of chasing ghost trains and power-ups makes it too overwhelming and frustrating for me. You might like it, but I can't recommend this over the first one.",
            "review_score": "-1"
        },
        {
            "review_text": "Very poor compared to Pac-Man Championship Edition DX+.  Currently, the game is unplayable due to a bad update which broke a lot of functionality with the Xbox One controller. Currently, the left analog stick on the Xbox One Controller doesn't accurately control Pac-Man correctly: There's a 60% chance that he'll go in a random or opposite direction of where you send him.  The game also is severely lacking in options. There's no graphics options (not even a borderless window mode, that the first game had), and the only configurable options appear to be rumble and sound, which is equally unacceptable.  There's a mandatory 10 minute tutorial which feels wholly unnecessary, considering this is Pac-Man, a very simple game.  Overall, the bugs and lack of options make this game a non-starter compared to the first game. Pick up CE DX+ instead.  EDIT: Namco has made the situation worse by apparently claiming that diagonal movement isn't recognized by the game (presumably a bug) but apparently that's our fault because 'your moves must be precise.'   Please just don't buy this game. The developer response to clear bugs is wholly unacceptable.",
            "review_score": "-1"
        },
        {
            "review_text": "There's only one question that matters: how does it compare to Championship Edition DX? This is the only question that matters because this should not be anyone's entry or re-entry into the series. If someone out there hasn't played Pac-Man since its days in the arcade, Champion Edition DX is in order, not this game. So, how does it compare for those of us who are continuing on from DX?  Poorly.  It alarmed me when I started the game and tried to go to Time Attack, only to find it locked. It said I had to complete the Tutorial first. A tutorial? In Pac-Man? 'Move the circle guy and eat the dots. Have fun.' is all the tutorial such a game needs. Why on Earth did it become unacceptable to let the player muddle through a few times while they figure out the mechanices, especially in arcade-style games, where a bad run will cause a player to lose no overall progress and only a few minutes of their time? But not only is there a tutorial--it's a FORCED tutorial.   Designed for stupid people, too, with easily decipherable pictograms there to show the player what it means when it says 'Ghosts.'  Can I ask--why are we acting like these sleeping ghosts that only become active when you move by them, and then begin following the ghost train, are a new mechanic? That's not new. That was in DX. Once more, the sleeping minions are not a new addition to the series.   There isn't a lot to be said in favor of CE2. It overcomplicates where it isn't necessary, changing things simply for the sake of changing them. Bombs now return the player to the spawn point. Why? So that using a bomb becomes a penalty? Not only do you now lose a bomb, you also lose your momentum. In fact, it's probably better to die in these cases, since the difference in points is only 9000--in a game where scores are in the millions--and at least then you will pick back up right where you were when things go south. If you use a bomb, you'll keep your life, but you'll have to travel all the way back to where you were. You probably lose just as much time using the bomb as you would if you simply died and respawned.  Ghost trains are an irritating mechanic, because each ghost is part of a train. There will be several times where you'll be munching down on one chain only to have another chain overlap--do you get a double bonus, and continue on devouring the second chain? Nope. It just goes right by you.   The slowly evolving levels of DX were much better than this one. In DX, each board was split into halves, and each half could be changed by getting one of the two pieces of fruit. Doing this changed the layout of the map and refreshed the dots, and you had to react to the changes on the fly. Not so here! Grabbing the fruit interrupts the gameplay as Pac-Man leaps down to the next board. So instead of having the stage slowly evolve as you gather fruit, you just leap from one board to the next and are slapped back in its center every time.   My biggest complaint, though, is that CE2 just isn't as clever. DX was almost perfectly designed. If you played without mistakes, you would see that you were just a pixel ahead of a ghost; if you played perfectly, you could see how smart the design was. Skidding around corners, saving fractions of a second in random places, and doing it perfectly yielded almost frame perfect success. It was great. Here, that's not present. Even if you play a portion perfectly, you'll end up smacking straight into a ghost--who only kill you if they 'become angry' by having you bump into them a few times. There have been a few times where I noticed that I encountered problems precisely because I didn't make a mistake, as though the bar had been lowered and the maps designed for people who didn't pre-turn or whatever it's called in Pac-Man.   'Babies' Edition' would be more appropriate, given the pictograms, the constant slowing and stopping of the gameplay to let the player catch up, the interruptions to the maps so that the player can breathe. I'm currently reinstalling DX. If you want Pac-Man, then Championship Edition DX is the game for you. This one is alright, but it's not more than that.",
            "review_score": "-1"
        },
        {
            "review_text": "This game improves on the first one in every way and is very fun!",
            "review_score": "1"
        },
        {
            "review_text": " Summary",
            "review_score": "1"
        },
        {
            "review_text": "All right, I've been playing now for a while, so now I can recommend the game, but you should know  It's NOT CE nor CE DX. If CE awesome gameplay is what you expect then you're gonna be dissapointed. At first, it feels boring in comparison with the first one, the tutorial is long and --Who needs tutorials in a PacMan game!? It's doesn't feel like a sequel cause it doesn't add new stuff to the CE game mechanics. CE2 changed the whole gameplay, so it's like a totally new PacMan game. For example, you can't control how many ghosts you eat and turn around anymore, it goes automatic and you end up going in a direction you might not want to go; bombs doesn't send ghosts flying back to their lair, instead they send YOU back to the starting point of the maze. Also, ghosts doesn't harm you but you have to touch them like twice for them to make them 'mad'.  So, It takes a little to get used to this new mechanics and once you do, you'll realize it's not the great CE sequel we were waiting for (actually I wasn't waiting for one, I still love CE DX the way it is). Maybe it should have been called Ms PacMan CE, cause believe me, it's a totally different game. Not a bad one but it doesn't live up to it's predecesor.  Be warned, this game consumes more memory. It also has some problems like the infinite loading screen which can affect you or not depending on unknown factors. I hope the game bugs will be fixed soon.  I recommend you to give it a chance, it gets pretty fun after a while. Watch the replays from those who have reached high scores and get inspired to get a place on the scoreboard.",
            "review_score": "1"
        },
        {
            "review_text": "  I love this game and all the improvements from the game. I like it more than the 1st one for sure.",
            "review_score": "1"
        },
        {
            "review_text": "This game is so completely terrible in comparison to the first one, nothing is enjoyable about it. The controls are crap, I have a delay/pause on every single corner I want to turn and I don't have that problem with the first game. The newly added game ideas and 'improvements' are awful...It's like they managed to screw up by changing everything that made the original so great. Will be asking for a refund.",
            "review_score": "-1"
        },
        {
            "review_text": "nice new twist to pacman but add's for more fun love it",
            "review_score": "1"
        },
        {
            "review_text": "Pac-Man Championship Edition 2 is ok, but well short of great. Your mileage may very, but I just didn't have much fun with this game, especially as compared to the first one - Championship Edition DX+. I will be requesting a refund.  Note: I didn't have any problems at all with performance, but I did notice my overclocked 980Ti sitting around a pretty steep 35-40% usage to maintain 60fps at 1080p. So I can definitely understand where a lot of the complaints I've read about performance may be coming from.  For me this didn't quite feel like Pac-Man. Mainly in that the speed has been absolutely cranked up, and along with it the game allows for a certain amount of 'tolerance' to compensate for the inevitable fidgityness. You can 'bounce' off of the ghosts. Repeatly doing so makes them 'angry' and only then do they become activated and come to kill you. Traditionally, I expect a Pac-Man game to have 0 tolerance for error. You hit a ghost, you lose a life. That way the game is fast, testing the exact limits of control. This one just goes deliberately beyond those limits, and success is determined by your level of sloppiness in how you handle being out of control. Catching ghost streaks seems to be more about making educated guesses and trying to set yourself up to get lucky more often in catching them, rather than just straight up twitch execution. You don't even need to eat all of the pellets before moving onto the next stage; just most of them-ish. This game isn't about hiting the nail squarely on the head.  It is very telling PM:CE 2 is listed on steam under 'Casual Games', while the original PM:CE DX+ is listed under 'Action Games'.  The graphics are certainly colourful, exciting, and fresh, but occasionally a little too much. The wild animations for ghost streaks I found disorienting in that they pulled me completely out of the map and it took me a second to reorient when dropped back in. Pretty graphics are fun, but ultimately they don't always serve the gameplay.  One obnoxious little bug I found when running with Big Picture and a steam controller, the game has a cursor that just kinda sits there on the screen. I have to actually go over to the computer and use an actual mouse to move the cursor off the edge of the screen.  The first PM Championship Edition DX+ game was great, and I highly recommend it... but no this one.  p.s. Kudos to the publisher for setting a very reasonable price.",
            "review_score": "-1"
        },
        {
            "review_text": "I absolutely loved the original CE games. They are fast paced, fun, and addicting as hell to try and beat you and your friends scores. This was due to the AMAZINGLY tight controls those games had. This game's controls are terribly sensitive to the point where it is unplayable. I tried to get into it, but it gave me cancer.",
            "review_score": "-1"
        },
        {
            "review_text": " A patch has been stealthily releasead on 28/10/2016, which has cured many of the technical problems.   The very definition of a 'video game', with some really thought through twists leading to an amazing flow.  A mostly creative interpretation for the current era -a strategic take on Pac-Man if you will- this one has me better engaged than DX; the phenomenal BGM adding to the experience!  The game's a steal too, compared with the pricing of -oh, so many!- 'indie'/rogue-like/action-platformer/artsy/hipster/pixel/Unity/Gamemaker/whatnot forgettable ♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "i can see this being fun but it lags to much 1 tenth speed",
            "review_score": "1"
        },
        {
            "review_text": "I am not sure how someone can screw up a Pac-Man game but this game is a complete miss. Controls are TERRIBLE. Leaderboards haven't been working since launch. The overall game is just bafflingly boring. Not even a good budget game or time killer. This game is just an absolute husk.",
            "review_score": "-1"
        }
    ]
}