{
    "app_id": 441350,
    "name": "Assault Suit Leynos",
    "release_date": "2016-08-30",
    "developer": [
        "Dracue Software"
    ],
    "publisher": [
        "Rising Star Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Partial Controller Support"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "Mechs",
        "Robots"
    ],
    "achievements": 35,
    "positive_ratings": 52,
    "negative_ratings": 22,
    "price": 19.99,
    "description": "A classic reawakens – Assault Suit Leynos is back and in high definition! Get ready for all-out robotic war as the fan-favourite Mega Drive classic is reworked with all new HD visuals for the ultimate alien-blasting experience!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/441350/header.jpg?t=1478085478",
    "minimum_requirements": "OS: Windows 7 SP1 / 8 / 8.1 / 10 (64bit) Processor: Intel Core i5 Memory: 6 GB RAM Graphics: GeForce 8xxx Series / Radeon HD 2xxx/HD 3xxx DirectX: Version 9.0c Storage: 5 GB available space Sound Card: DirectX 9.0c compatible soundcard Additional Notes: Controllers supported, but must be activated in Options &gt; Config &gt; Controls menu on first boot (game will remember settings every time after that)",
    "recommended_requirements": "OS: Windows 7 SP1 / 8 / 8.1 / 10 (64bit) Processor: Intel Core i7 Memory: 8 GB RAM Graphics: GeForce 200 Series / Radeon HD 5xxx DirectX: Version 9.0c Storage: 5 GB available space Sound Card: DirectX 9.0c compatible soundcard Additional Notes: Controllers supported, but must be activated in Options &gt; Config &gt; Controls menu on first boot (game will remember settings every time after that)",
    "reviews": [
        {
            "review_text": "A reimagining of one of my favorite Sega Genesis games, Target Earth. Plays best with a controller.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome robots shooting each other.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great reboot of a classic game. it's a bit easier than the classic game, which i'm really greatful for as the old game was damn near impossible when I was younger and is still 'nintendo hard' to this day, but you can later unlock 'classic mode' complete with classic music and sound effects that actually mimics the classic game quite well. so it cartors to both new player and fans of the classic game as well! It's a fairly short game but there are plenty of unlocks to crack open for those completionists out there, so it makes for decent replayability.  I definitely recommend this to fans of challenging 2D platform shooters and fans of the original game itself. It definitely lives up to the classic game and doesn't disapoint.",
            "review_score": "1"
        }
    ]
}