{
    "app_id": 441670,
    "name": "Jelly Killer",
    "release_date": "2016-03-24",
    "developer": [
        "Immortal Game Studio"
    ],
    "publisher": [
        "Immortal Game Studio"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Casual"
    ],
    "achievements": 16,
    "positive_ratings": 145,
    "negative_ratings": 38,
    "price": 2.89,
    "description": "Jelly Killer - Retro Platformer The Adventures Of A Young Bioweapon. In this game you will act like the young bioweapon. You will encounter lots of traps and puzzles. You will have to possess human bodies to pass the game to the end. Good luck!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/441670/header.jpg?t=1458860484",
    "minimum_requirements": "OS: Windows XP SP 3 Processor: Intel Core 2 Duo Memory: 512 MB RAM Graphics: 256 MB graphics DirectX: Version 8.0 Storage: 128 MB available space",
    "recommended_requirements": "OS: Windows 7 or 8 Processor: Intel Core 2 Duo Memory: 1 GB RAM Graphics: 512 MB graphics DirectX: Version 9.0 Storage: 256 MB available space Additional Notes: Xinput Gamepad",
    "reviews": [
        {
            "review_text": "Design-wise, the game is pretty good. The only problems I have are the camera and control layout for a keyboard; you can't shift the camera, which can obstruct your view and not see what is ahead, causing to get hit by something you couldn't see coming in the first place.  The layout for the keyboard controls is fairly awkward. Allocating the fire button to 'Alt,' when it could've been put to either 'Q' or 'Space,' coupled with no way to edit the control layout, is a design choice I don't entirely understand.  Other than that, the game plays and controls very smoothly and has an artstyle that seems reminiscent of Scott Pilgrim vs The World, which is pretty cool.",
            "review_score": "1"
        },
        {
            "review_text": "Another puzzle platformer game like meatboy and prison Run and Gun. Just like any game of that genre, it can be fun and yet frustrating at times. The frustrating portion of the game was trying to get the right timing of avoiding traps, which were not well synchronize. The game has three difficulty levels(easy, normal and hard). I'm not sure if the map layout changes with each difficulty but from playing only a few levels in hard mode they add mines to the game to create more of a complex atomsphere. The game has about 54 levels and possibly more on hard mode.  If your a big fan of the genre then you will enjoy this game.  ",
            "review_score": "1"
        },
        {
            "review_text": "Wow, great game.  A nice variety of moving between traps, while making jumps and possessing bodies to help you reach the end goal. Graphics are nice. Controls are very responsive. What seems to be a nice progression of difficulty. The story is laid out in the very beginning, Music is a bit repetitive, but I was reaching for at least one thing to complain about. Controller HIGHLY recommended.(I just like controllers.) I haven't tried the keyboard. The price is right and so isn't everything else.",
            "review_score": "1"
        },
        {
            "review_text": "I refunded this pile of poo because the 30fps made my nose bleed.",
            "review_score": "-1"
        }
    ]
}