{
    "app_id": 4420,
    "name": "Silverfall",
    "release_date": "2007-03-20",
    "developer": [
        "Monte Cristo"
    ],
    "publisher": [
        "Focus Home Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "RPG"
    ],
    "tags": [
        "RPG",
        "Hack and Slash",
        "Action RPG"
    ],
    "achievements": 0,
    "positive_ratings": 57,
    "negative_ratings": 36,
    "price": 7.99,
    "description": "Silverfall, a once glorious city, lies in the fantastical Kingdom of Nelwë, where the forces of Technology and Nature are strongly opposed. Symptoms of this terrible conflict have begun to manifest physically as melded cyberbiologic organics and living steam-driven automatons.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/4420/header.jpg?t=1447350982",
    "minimum_requirements": "Windows® XP Intel Pentium 4 2.8 Ghz or AMD Athlon XP +2800 higher 512 MB RAM ATI Radeon 9800 256MB VRAM or Nvidia 6600 GT with 256 MB of VRAM or better DirectX version 9.0c-compatible sound card DirectX® 9.0c Network Interface (only for multiplayer games) 10 GB available HD spaceRecommended:  Intel Pentium 4 3 Ghz or AMD Athlon XP +3000 1 GB RAM 256MB ATI Radeon X850 or Nvidia GeForce 6800GT",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "DO NOT BUY !!!!!!!  I really like the premise, for me Silverfall falls under the hack/slash rpg genre; it has character creation (female/male), ability to upgrade your character as you choose, armour/weapons choices.  I tried hard to like this game, but where it fails horribly : - is the insane and extremely difficult controls. I found it hard to wrap my head around the mini map and the orientation of the whole game. Plus the character is prone to getting stuck in the most awkward moments. - extremely difficult, coupled by the fact that when you die you lose all your equipped items. So if you are fighting a challenging boss or swarms of enemy and die, you can pretty much kiss all your equipped items good bye.  I bought both Silverfall and Silverfall : Earth Awakening for less than $5, I want my $5 back.",
            "review_score": "-1"
        },
        {
            "review_text": "Polished visually, completely lacking in refinement. This game is ultimately a ruse. A mirage. At first glance it's beautiful. Visually, the combination of good graphics and Cel Shading is stunning. Quickly, however the true gamer realizes the actual gameplay is flawed beyond reproach. Lackluster clunky combat, an archaic quest system and VERY liminted voice acting make this game mediocre at best. A poor ecuse for an action RPG, and a poor excuse for either genre, period.   The combat barely passes as a Diablo clone. The camera options, while involved, are seemingly limited, scarring the experience at every turn. Choose one angle, you'll be doomed to limited view, choose another, you'll be thrust into a pseudo-3d world. Any camera you choose limits the experience.   Couple this with repetetive combat and repetetive gameplay. I.E. NO puzzle solving, no clickable objects. Basically, you kill, kill kill, LEVEL up, add stats,. collect loot, KILL some more repeat.   There are some notable points of interest. They have graciously added in their desperate quest to copy Diablo, more options for loot...you can get yellow, green, blue white AND artifact (brown and rarest) loot types. Beyond this, Silverfall is a hack and slash nightmare...it will remind you of all the cliches of a game of this genre, while satisfying next to none of those expectations.   Expect the expected with Silverfall. Expect the predictable. Barely worth the price of admission.",
            "review_score": "-1"
        },
        {
            "review_text": "Do a Google search on 'The Shaggs' and watch one of their videos. If you enjoyed that, you will probably love this game.",
            "review_score": "1"
        },
        {
            "review_text": "Worst game without a doubt I have ever played, very confusing, controls are bad, and the gameplay is a non-fun grindfest of boring mobs.",
            "review_score": "-1"
        }
    ]
}