{
    "app_id": 442290,
    "name": "Pointless",
    "release_date": "2016-02-22",
    "developer": [
        "Cake Collective Games"
    ],
    "publisher": [
        "Cake Collective Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Indie"
    ],
    "tags": [
        "Indie",
        "Clicker",
        "Retro"
    ],
    "achievements": 8,
    "positive_ratings": 81,
    "negative_ratings": 67,
    "price": 0.0,
    "description": "Pointless is a game about destroying Dots. Each Dot you destroy adds one point to your score. You can add your score to a global point pool, and see how many Dots have been destroyed globally. Rad!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/442290/header.jpg?t=1484600638",
    "minimum_requirements": "OS: Windows 7, 8, 10 Processor: 1.6 Ghz or faster Memory: 512 MB RAM Graphics: 256MB VRAM DirectX: Version 9.0 Storage: 120 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "The title was right. 8 minutes to get 100% Steam achievements. Nothing to do other than mindlessly click dots. On top of that, this game which has graphics of a lower quality than the first gameboy games lags like crazy! It drops to 0 fps on a Gtx 760.  Nothing to see here really, totally not recommending this game. Click dots, click on powerups, click on more dots.",
            "review_score": "-1"
        },
        {
            "review_text": "Well the title describes it perfectly... It is pointless. The only reason i would recommend it to someone is to get easy 100% achievements like me and only when you have a coupon for it. So therefore i will only click recommend for that..",
            "review_score": "1"
        },
        {
            "review_text": "Woah now this is exactly what it says on the tin.   POINTLESS  Takes 10mins to get all eight Achievements for another Perfect game :D Had a random coupon for it as well.",
            "review_score": "1"
        },
        {
            "review_text": "Get it on sale only, or with coupons :P  I'm being very   SERIOUS   ",
            "review_score": "1"
        },
        {
            "review_text": ".........Thumbs up from papi",
            "review_score": "1"
        },
        {
            "review_text": "If you're looking for a time-killing game, seek something else out. Most time killers try to at least have some sort of challenge so that you're entertained while you wait 10 minutes downloading something or etc, but clicking on dots with zero challenge or goal other than getting your points up just gets boring very quickly.",
            "review_score": "-1"
        }
    ]
}