{
    "app_id": 442810,
    "name": "UFO Online: Invasion",
    "release_date": "2016-06-08",
    "developer": [
        "Bad Pixel"
    ],
    "publisher": [
        "Bad Pixel"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Multi-player",
        "MMO",
        "Co-op",
        "Steam Achievements",
        "In-App Purchases"
    ],
    "genres": [
        "Free to Play",
        "Massively Multiplayer",
        "RPG"
    ],
    "tags": [
        "Free to Play",
        "Massively Multiplayer",
        "RPG"
    ],
    "achievements": 157,
    "positive_ratings": 256,
    "negative_ratings": 212,
    "price": 0.0,
    "description": "UFO Online: Invasion is a turn-based tactical combat MMORPG set in the post-apocalyptic world",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/442810/header.jpg?t=1482236841",
    "minimum_requirements": "OS: Windows XP, Vista, 7, 8, 10 Processor: 1GHz or higher Memory: 1 GB RAM Graphics: any DirectX 9.0c compatible with 128 MB VRAM DirectX: Version 9.0c Storage: 2 GB available space Sound Card: DirectX 9 compatible",
    "recommended_requirements": "OS: Windows XP, Vista, 7, 8, 10 Processor: AMD Athlon FX or Intel Core i3 Memory: 4 GB RAM Graphics: AMD Radeon 5xxx or nVidia GeForce 5xx DirectX: Version 9.0c Storage: 2 GB available space Sound Card: DirectX 9 compatible",
    "reviews": [
        {
            "review_text": "edit - june 14, 2016 : If you are going to play this game. There are now 2 guides, in english, that will help you enjoy your time learning the game. They were not available when I tried playing UFO: Online. There is a Link for one of them in the comments below from the community. ---------------------------------------  it is NOT a bad game, it's free &amp; somewhat fun. But it is very grindy &amp; has a very slow progression curve, especially if you refuse to pay  the original player base is NOT english, though many of the players who are still playing do try hard to help in english... but the lack of english information makes it very dificult to 'know' what to do when you hit a snag. If there were not newer games available to play, i may have4 played this more than 13 hours.   Why i won't play more. Being forced to wait while traveling between areas (which gets longer the more your encumbered). Again, being forced to idle after a battle (quests can NOT be completed via co-op) on the world map, waiting for the passive hp regen to 'heal' me. It get's better with more cash, to buy health items. Again, if your a paying player you get stuff that makes this take less time. Ie: only paying players get the option to auto loot. etc.   My last reason is the reply i recieved from the Steam Mod in regards to a fear i mentioned in regards to one of the Rules. i will let you decide for  yourself if my fear is warranted , or not.  --------------thread post------------------- Originally posted by Diarmuhnd: 1.7.1.  It is forbidden to  insult the UFO Online Administration, as well as  express explicit disagreement, dissatisfaction with decisions or actions of the UFO Online Administration.   Penalty: silence 1 hour + servitude of the 3rd category/14 days of forum ban   The above underlined section of rule 1.7.1 gives me pause for any resolution in regards to any possible 'abuses' that may be comiited by an Online Administrator who is themselves breaking any of the aformentioned rules of the game.  Moderator Reply: well, you're free to not to accept with rules. Besides you're free to not to play this game. ------------------------------------------  Post-review additional information :  edit 1 : It has been brought to my attention, that ALL in-Game-Shop items, inlcuding the Premium License, can be purchased with in game currency instead of RL currency. And that there are items that reduce the Travel Time Delay. Which is a Good Shop Model for any game.",
            "review_score": "-1"
        },
        {
            "review_text": "I haven't played too long. But enough to know that the reviewers below are being a little harsh.  It's not a terrible game by any means. There's no pay to win, though there is a cash shop.  Progression is fairly slow, at least it seems that way so far. You'll mostly be murdering mass amounts of slavic dogs and getting better tracksuits to squat in. I have yet to see any Vodka, though(Update: Acquired Vodka).  There's a lot to learn to the game, which is why progression being slow isn't too big of an issue. Lot of inventory management, but the gameplay itself when it gets down to the combat is smooth and comprehensive.   The overworld map movement is kind of weird, but works given the playstyle. While I haven't participated in it yet, there seems to be some form of PvP system where you can enter someone else's PvE battle and ♥♥♥♥ them up. Though I could be wrong, and it might be PvP only. I honestly can't tell, I only know that you can jump into random's games and help them, but there is also an option to PvP however I've always been told I can't do that(Because of some mechanic that probably involves clans??) Update: So PvP works weird. There are safe areas, which are towns and buildings that you can't be attacked at perior. Then there are 'Secure' areas where you can be attacked by creatures but not players. Then there are 'wastelands' which are unsecure areas and you can be attacked by players in those tiles. There are also PvP arena matches in the main starting city, but those usually have level requirements to enter so that is mostly end-game stuff. I'm sure there are Clan PvP mechanics, too but as I haven't gotten there I can't comment on it.  As for that one guy complaining about not being able to level up your stats: He's an impatient ♥♥♥♥ who didn't wait long enough. You buy skills from the market, or get them from quests, and use those to level up your stats directly. If he had paid attention to the tutorial he would know this.   As well, at level 4-5 when you get your weapons skill up to level 4, you go into an arena and get to try out classes from the looks of it. Seems to be Machine gunner, sniper, and tank class. Though I only have Weapons at level 3 so far. So I will maybe revise my review once I get there. Update: So it turns out there aren't really 'classes' per se. There are armor types that buff specific weapons(Tank, Assault, Tactical for Tanking, LMGs and ARs, and Sniper Rifles/SMGs respectively). There is a way to reset your stats, but it only popped up once the first time and I think because I got a quest from the guy who does it, I can't talk to him again until I complete it.  I only barely touched on the crafting system, but it seems fairly complex. Will also update when I get something on that end.  Anyway, if you want a Multiplayer RPG with turn-based combat, this is a good game to try.   tl;dr Turn-based Slav dog murder simulator 2016.",
            "review_score": "1"
        },
        {
            "review_text": "Ok After 65+ hrs time to review.  I nearly didn't try this game, mainly cause of the massive amount of neg comments about P2W and overall 'fairness'.I am thankful at these times i make my own choices and not follow the 'trendy' crowd looking for games to play on 'easy'.  Firstly, This game is NOT pay to win. There are NO weapons, armour or items in the game to buy that you cannot get by grinding or crafting. so lets stop 'crying' about P2W. Pay to progress is more like it, I see nothing wrong with this as dev's have the right to get  paid for there efforts.... Right.  The basic concepts, (as i see them) Firstly, i see this as a game of 'sheep and wolves', You can be a sheep or a wolf, your choice. This game is basically a 'sandbox' style of game, meaning you have a lot of choices as to what you do with your character and how you play the game.  1: The Sheep. You can 'farm' resorces from monsters and refine them. you can 'mine' resorces from bots in mines and refine them. You can take these resorces back to 'factorys and make nearly  anything you can buy at the shop. You can then set up as a trader and either provide vital resorces  for your clan or just be a merchant.  2:The wolf. Basically you hunt, you hunt sheep of course if they are stupid enough to wander out of  the Safe zones. Better yet you get to hunt outher wolves.   3: the hero. Tool up and become a 'gladiator', fight in the arena for exp and rewards.  You may choose one of these styles of play or try to be a little of each, It is YOUR choice. That is the cool thing about this game. I would suggest this game is sutable for players who like an EXTREME challange to there gameplay, Certainly not for the fainhearted, if you never max out the hardness on your games this might not be the game for you.  Personally i think it is an exellent game that rewards thought and planning and REALLY punishes stupidity and 'rushing.  [EDIT:]  Now after over 200 hrs and nearly level 10 of 21, I can update my review. This game is still NOT pay to win. I got where i did through normal gameplay. I am pleased to find this game has incredable depth both in skills training and  crafting. the Gfx are nice, down to the empy brass ejected visibly into the minig cart next to me filling it up... After the 1.7.1.0 Patch last night, you can now travel fairly safely between the 2 main settlements. Looting in [yellow] squares has also been halved meaning they  can only nick half your stash. All this from dev's that apparently don't care about  the players concerns. Not the picture i see. You can feel the presence of the dev's evrywhere in the game. They appear to be very active and from what i've seen in my  paltry 200hrs care a great deal about the english speaking players game experience. Then there are the clans. As a new player you will not encounter ANY higher level players for a long time unless you do something really stupid. There are warnings about this built into the game so.... Some of the clans Drip menace while some, most noteably MIB clan are very friendly and extremely helpful regading advice. These guys are solid and you can trust them as a new player. Whilst im still a bit of a sheep, I have BIG nasty upgraded teeth and a kevlar fleece. I will get the 'wolf's clothing' one day. My personal decision to buy a bit of gold at this stage is not because i can't win.... I just REALLY want that wolfsuit.... I do hope you find this review helpful i will update again if needed.",
            "review_score": "1"
        },
        {
            "review_text": "I couldn't even click 'Accept' on the license agreement. Fail.",
            "review_score": "-1"
        },
        {
            "review_text": "Fun game, never ran into any mentally handicapped hate-filled Russians or any harassment, probably from the name or lack of communication with others. Personally don't like travel time and the ability to just attack any player.  But, devs about as bad as the Warthunder devs because communism and negative bias towards English-speaking players. I don't play or support games if their devs are the biggest ♥♥♥♥♥ to ever think '♥♥♥♥ ♥♥♥♥♥; ♥♥♥♥ the americans [vodka chugging] a nu chiki briki i v damke'",
            "review_score": "-1"
        },
        {
            "review_text": "the game suckes ♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "this game has play for russian verson realy ",
            "review_score": "1"
        },
        {
            "review_text": "Yesterday i played around 7h and I like the game so far.  A few parts in this game feel a bit like eve online. You have to do something to collect your xp to get a skill leveln. You learn the skills like in eve, you buy them, inject them (will train the first skill level if a point is available). If you want a weapon you have to Train the novice skill (5 is max). With lvl 4 in that skill you can use at least the first sniper, MG etc. Better weapons will also Need then their subskills. Like for the m16, you Need like 4-5 in the weapon skill and also the assault rifle skill. Like if you Need in eve eg. for the assault frig, the frig skill and then the subskill (assault frig). There are some skills that boosts different stats and so on too. Crafting is also bit eve like, because all the items can be crafted and sold by Players. You also might find rare blueprints.  You reprocess ressources in the laboratory and craft items in the factory via a blueprint.  As a old eve Player i like those mechanics a lot. Beside that, its possible to craft weapons also in higher Qualities. There are a lot of different weapons and armor ingame, that also can be modded. Also there are different Kind of ammunitions, like em bullets against robots, poision bullets and so on.  I like the evil games where you may loose all your Equipment on death (full loot System). Games where you dont rly risk something getting bored very fast for me. In this game u dont loose you Equipment on death, but at least the stuff you collected while you were outside and what you didnt stored meanwhile. That risky enough for me and makes the game exciting for me. I was a few times too greedy and had to pay for it.  You can also Play with a friend and do pve and pvp. Quest battles dont work in a gang, but it still may help to travel to the Mission spot in a Group, because you will have to fight stuff on the way to there and back for sure.  A friend can also a great help when you mine. Theres a Titan armor that let you carry a lot of ores, but with low defense. In case you wear such a armor it may be wise to bring a friend with better armor that will fight in the front, while you mainly shoot from the back and collect the stuff.  As far as I know you can also conquer strongholds or something like that.  For me at least it seams like that this game enough complexity to let me Play that game for some time.  Regarding to the bad Reviews about this game. The mayority who gave bad Reviews didnt even played a hour. In under a hour u know almost nothing about the game.   I played this Kind of games since Ufo (the old one) and i also tried the other Ufo-online/jacket alliance-online games. The online games I could only Play for a few minutes before I stopped to Play them, because i didnt like them. Talking about the mp online versions, UFO Online: Invasion is actually the reference product.   Sorry that my english is a bit crappy and that some words are upper case, or lower case, which shouldnt, but those words got auto corrected, because my language was set to Default which is german. (didnt helped that i switched the langugage to english...) Ye and iam too lazy to correct it now, but i hope this Review helps you to decide if you want to Play it or not. :)",
            "review_score": "1"
        },
        {
            "review_text": "Its a great game,dont know why all that negativity",
            "review_score": "1"
        },
        {
            "review_text": "If you hoping for squad combat or anything complex out of this 'strategy' game. Move on you start out with a single guy with a 4 shot pistol shooting at dogs and the game doesn't get complex enough or hard enough fast enough for me to care what might happen afterwards.",
            "review_score": "-1"
        },
        {
            "review_text": "The terms of service do not actually read like an agreement for a piece of software. They read like arbitary, suppressive laws imposed uppon the populance by a malevolent dictator and his military regime. So, of course i declined. Would have loved to give this game a try otherwise.",
            "review_score": "-1"
        },
        {
            "review_text": "After first 20 min or so I can see what author wanted to say.  This game have great potential. Farming, Gathering, Manufacturing  As every MMO - better try all by yourself... and dont relay onpeople reviews. Especially if it take F$$$ time to download.",
            "review_score": "1"
        },
        {
            "review_text": "Many people don`t give this game much of a chance. It can be fun and you should check things to find out what you may have missed. I did that and it helped me lots.",
            "review_score": "1"
        },
        {
            "review_text": "Piece of garbage.",
            "review_score": "-1"
        },
        {
            "review_text": "It's boring and I don't like it.",
            "review_score": "-1"
        },
        {
            "review_text": "If your into Strategy Post-Apocalyptic games, I'd definitely give it a shot. The only thing that drains my enthusiasim is the travel time mechanic, at this point.",
            "review_score": "1"
        },
        {
            "review_text": "A very... Meh~ game. I played it for only about 20 minutes and it made its first impression the best it could.  The good things are that it doesn't lag  The bad things however (although most of these are probably opinion biased) are that: 1. Very dull atmosphere. While you CAN say it feels somewhat like STALKER series with all the moodyness in it, but alas, combined with the garbage music in this game I almost fell asleep. 2. Sounds as well as the graphics are very mediocre. 3. The customisation screen is a joke. Select if you are a male or a female, and your profile avatar. 4. The game doesn't like me Alt+Tabbing, my pc froze for a good minute. 5. Old-school UI. While this may not be a BAD thing, but it IS 2016, i'd expect a much better overlay of the things presented to me. 6. While I made it to level 2 (wow hardcore am I not?) I did not get a chance to increase my own stats as I please (Which i'd expect from most mmo-rpg-ish games, but i might be greedy here) , because all I wanted is to increase my intelligence level. 7. The Turn based combat is super heavily RNG based, as in I was standing right next to a filthy dog, and I still managed to miss 4 of my 'Zipper' bullets, then the dog decided to run away, and regenerate more HP than I deal with 3 or 4 shots. After the dog got tired of running, I switched to my shotgun (which in turn costs me ActionPoints) and shot once, no more AP left for the second shot, the dog runs away and I have to chase it for another two minutes. Now I hate dogs. 8. The waiting times. As we all must have crossed path with a game that has a system where you need to wait a certain ammount of time to something, this game is no exception. What irritates me the most is that you not only have to wait for your character to heal in city (which would be ok, because it takes up to 2 minutes if you are dead), but IF you want to move in between territories (safe or otherwise) you will have to wait for 10 seconds staring at the screen unable to do things.  I'm sure there are many more things but i just won't waste my time anymore with this, sorry not sorry.  TL;DR garbage facebook game.",
            "review_score": "-1"
        },
        {
            "review_text": "After being really enthusiastic about the game, writing positive review while spending copule of hours with it i must say that this game is nothing more then pure grind fest with repetative content. Do not waste your time on it.",
            "review_score": "-1"
        }
    ]
}