{
    "app_id": 443330,
    "name": "Malus Code",
    "release_date": "2016-05-06",
    "developer": [
        "M2 Co.,LTD"
    ],
    "publisher": [
        "Dogenzaka Lab"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 16,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "Anime",
        "Visual Novel"
    ],
    "achievements": 0,
    "positive_ratings": 69,
    "negative_ratings": 23,
    "price": 9.99,
    "description": "Malus Code is the story of a graduate student studying abroad at a Japanese university, and the three people he meets in the laboratory there. In this unfamiliar environment, can you earn their friendship? For those who don't want a lonely, sad life.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/443330/header.jpg?t=1476864574",
    "minimum_requirements": "OS: Windows7/8.1/10 Processor: 1.8 GHz Pentium 4 Memory: 1 GB RAM DirectX: Version 9.0c Storage: 1 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "A VN with nice artwork and the animation is made using the Emote engine (which was also used in the Nekopara series). The characters are cute and have some decent development, although I thought the story was rather convoluted at times. In some ways, its very similar to Tokyo School Life, in terms of plot (a foreigner coming to Japan, etc). Too bad it is rather short (about 5-10 hours or so), but I guess I'm just saying that because I am used to long VN's. :-) Anyway, if you liked TSL or Nekopara, then you will like this.",
            "review_score": "1"
        },
        {
            "review_text": "I have no idea what the **** I just played",
            "review_score": "1"
        },
        {
            "review_text": "The story is even more ♥♥♥♥ed than Metal Gear.          U.N. Owen&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "If you watched Lost Pause, then you know what your in for.",
            "review_score": "1"
        },
        {
            "review_text": "(!) Warning: spoiler (!)  To be fair this virtual novel is really good and have a particular plot which make this novel unique even at some point i was literally trying to find what was going on in each route and what will the protagonist will do and also how the main protagonist will react. In my personal opinion ,for the story, the chap.3 is the best but sadly have a lack of romance compare to the others 2 chapiter.I know this VN do not necessarily focus on it but it kinda dissapointing to have some kind of dating between the protagonist and the character's route like on yuri's route and in Suzukake's route but almost nothing for Yae's one which is kinda sad.and for the 2 first chapiter was a real horror's playground which was great in my opinion because it never had show anykind of horror before the end of chapiter 1 and also the fact even the main menu changed into something very ''special'' i should say is pretty cool ! Also really like it how the game try to explain thing in a scientist way.   The only cons for this game are probably the facts that this game is short, if you like to choose your route this game may make you dissapointed, if your into a romantic virtual novel this game probably (or not) made you think you wasted your cash or if you hate science or any type of game which try to learn you something it may possibly make your cringe or rage allitle inside.If you hate cross-dresser in VN you should totally pass for this one.And Finally if you like classic VN and dislike complex plot and stuff you should also pass for this one.  There are a lot of thing to talk about but i think i rode too much so i will stop and rate this game 8.5/10 mostly good but have some problems to solve for next game or possibly( possibly not) an DLC ?! Who know !",
            "review_score": "1"
        },
        {
            "review_text": "i dont even know where to begin with this it just left me saying what the hell happened here tokyo school life was good but i have no clue where the direction of this was going and at the end i was so confused and like what happened not recommended",
            "review_score": "-1"
        }
    ]
}