{
    "app_id": 443370,
    "name": "The Treasures of Montezuma 5",
    "release_date": "2016-03-10",
    "developer": [
        "Wellore",
        "Alawar Entertainment"
    ],
    "publisher": [
        "Buka Entertainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Casual"
    ],
    "tags": [
        "Casual",
        "Match 3"
    ],
    "achievements": 0,
    "positive_ratings": 58,
    "negative_ratings": 24,
    "price": 4.99,
    "description": "A thrilling gem-matching adventure awaits those who dare to explore the jungle of the Aztecs, where untold treasure lies hidden deep within an ancient temple!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/443370/header.jpg?t=1518597847",
    "minimum_requirements": "OS: Windows XP, Vista, 7, 8, 10 Processor: 2.0 GHz Memory: 1024 MB RAM Graphics: 128 MB VRAM DirectX: Version 9.0 Storage: 250 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "[Review key provided by the publisher] I only played TTOM3, so i'll mostly compare it to that game, without context of the rest of the series.  The Treasures of Montezuma is a fast, flashy, challenging match-three game with a lot of bonuses and upgrades. In this installment the graphics wуre switched to more bouncy and cartoony, while the gems remained very elaborate, which i don't really like. It seems like they tried to add some story, but abandoned that idea after obnoxious mobile-level restricting tutorial. Playing field is still cluttered and noisy, but super-score now is not that intrusive, on the flip side, now it's not as obvious as before, so you have to use audio cues to track it. Also it seems like it has a lot of f2p rudiments. Core scoring system became much easier, there are several money-grind levels, so you can buy more power-ups before retrying failed main level. But again, because of that, green statue became super OP on the early levels.  Works fine with nvidia surround. Unlike 3rd game this one works very stable.   Despite all the flaws it's one of the more challenging and complex games in the genre, while being definitely finite, which pleases my inner completionist and gives me incentive to play it. Finished it in one 7 hour sitting.",
            "review_score": "1"
        }
    ]
}