{
    "app_id": 44350,
    "name": "GRID 2",
    "release_date": "2013-05-27",
    "developer": [
        "Codemasters Racing",
        "Feral Interactive (Mac)"
    ],
    "publisher": [
        "Codemasters",
        "Feral Interactive (Mac)"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Valve Anti-Cheat enabled",
        "Steam Leaderboards"
    ],
    "genres": [
        "Racing",
        "Sports"
    ],
    "tags": [
        "Racing",
        "Sports",
        "Multiplayer"
    ],
    "achievements": 60,
    "positive_ratings": 11953,
    "negative_ratings": 3009,
    "price": 19.98,
    "description": "Be fast, be first and be famous as the race returns in GRID 2, the sequel to the BAFTA-award winning, multi-million selling Race Driver: GRID.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/44350/header.jpg?t=1546282708",
    "minimum_requirements": "Minimum  OS: Windows Vista, Windows 7, Windows 8                 Processor: Intel Core 2 Duo @ 2.4Ghz or AMD Athlon X2 5400+                 Memory: 2 GB RAM                 Hard Disk Space: 15 GB HD space                                 Video Card: Intel HD Graphics 3000 / AMD HD2600 / NVIDIA Geforce 8600                 DirectX®: 11                 Sound: Direct X compatible soundcard                 Additional: Broadband Internet connection                    Additional Supported Graphics Cards: Intel HD Graphics 3000, Intel HD Graphics 4000, Intel Graphics 5200. AMD Radeon HD2600 or higher, HD3650 or higher, HD4550 or higher, HD5000 Series, HD6000 Series, HD7000 Series. NVIDIA GeForce 8600 or higher, 9500 or higher, GTX220 or higher, GTX400 Series, GTX500 Series, GTX600 Series: AMD Fusion A8 or higher.",
    "recommended_requirements": "Recommended  OS: Windows Vista 64 Bit, Windows 7 64 Bit, Windows 8 64 bit                 Processor: Intel Core i7/AMD Bulldozer                 Memory: 4 GB RAM                 Hard Disk Space: 15 GB HD space                                  Video Card: Intel Graphics 5200 / AMD HD6000 Series / Nvidia GTX500 Series minimum 1GB RAM                 DirectX®: 11                 Sound: Direct X compatible soundcard                 Additional: Broadband Internet connection",
    "reviews": [
        {
            "review_text": " Before I proceed to the review, you should know that personally I'm racing games addict and cars lover from kid. You should know that I raced in many online leagues in reputable simulator: rFactor - it could have been even 800-1000 driven hours. You may ask 'why have you stepped back to GRID?' - it's simple: I don't have time for preparations to compete in online leagues (1 race = whole week of training).     Here's where the GRID2 steps in! ",
            "review_score": "1"
        },
        {
            "review_text": "I like when games tell stories through gampelay. GRID 2 at a first glance seems to be about racing and social media but it's actually a post-apocalyptic dystopia in which all the roads are covered in invisible ice.",
            "review_score": "-1"
        },
        {
            "review_text": "According to some statistics made by the developers, they removed interior view since only like 30% used it and upon playing the game for a while you'll discover that was not the only thing they removed to save development cost and time.  Pro: - Good graphics. - Decent audio, apart from the obnoxious low frequency noises switching between menus. - Fun for a short while. - Damage model - Online demolition derby.  Cons: - Lack of interrior view. - Lack of any game music/theme. - No rear view mirror, you have to look back. - Extremely annoying slow animation transitions between menus, customisation..etc (aesthetics infavor of functionality) - Pure arcade car handling. - Most cars if not all are drift happy, as the game rewards drifting even in circuit racing. - Extremely annoying announcer everywhere with a sense of humor matching a cheesy car salesman, and unskipable. - Pay 2 win dlcs for online racing, as you get very few cars for online racing. - Rubberbanding AI.    Overall impression: meh... skip it. ",
            "review_score": "-1"
        },
        {
            "review_text": "+ Calling by name is amazing feature more games should have. Even losing is fun, Damaging is arcade-like, I popped a tire, came last and it was most entertaining loss I had. It's well optimized, runs with unbelivable framerate, explains developer's name Split-screen! Haven't seen that for ages. Might be able to drive both cars some day... Uses gamepad's vibration really well - rare game where I felt it was in-context all the time. Switches out of full screen into small borderless window upon Alt+Tab - why it's not in every game?  +/- Controls are very sensetive, makes it challenging to start from medium difficulty, so I had to switch to 'very easy' to finally advance.  - Online community is hiding somewhere. Racenet seeems useless in comparsion to NFS' Autolog, everyone wants to make an account out of me.",
            "review_score": "1"
        },
        {
            "review_text": "Codemaster, SHAME ON YOU!!! There are more DLC than game modes !! 53 £ for a complete game!! Such a disappointment... Grid WAS in the top 10 'most fun games'..! Gone! SHAME ON YOU!",
            "review_score": "-1"
        },
        {
            "review_text": "Many gamers use cheats ,this game is not for serious racers  When I compare this game to TOCA games , you can kick cheaters and rammers off the game  Will think hard before I spend my money on a code master game again. I have all the code master race games up to Grid 2 When you buy a game you should be able to be competetive to the end with out spending more money to buy cheats to get extra speed or grip  Have no problem winning up grades as you progress  Thanks Andrew",
            "review_score": "-1"
        },
        {
            "review_text": "This game is not really an improvement over Race Driver: GRID, except for the graphics. This game has a number of defects including:  - No cockpit view (apparently because of 'memory constraints'. Really? This is a PC game, right?) - A high chance of having zero multiplayer which still hasn't been fixed after 8 months - Cheaters in multiplayer if you are lucky enough to have it - DLC is pretty bad, seemingly just content ripped from release so you can pay extra - DLC shown during any car select so it feels like you're playing a demo  The physics are er, ...interesting. It's very drift friendly - perhaps for the younger generation - and sometimes I like this and sometimes it seems my car breaks into a slide purely at random.  Singleplayer - Seems to be 90% city courses so far (I'm most of the way through tier 3) with only the occasional time trial on decent real world circuits, which might be quite a disappointment for Race Driver: GRID fans. The much hated Codemasters D0uchebag™ is alive and present in singleplayer, sounding like an absolutely ♥♥♥♥♥♥♥♥ idiot blabbering on about social media ... I want to punch that fool. Fortunately you can tun him off which is a massive improvement over Dirt 3, where you are forced to listen to the fūckwit tell you to 'upload your video to youtube!!11!1!!'.   Only things it's got going for itself is the graphics and the damage modelling. If you're looking for a sequel to GRID I suggest you look at Shift 2 Unleashed, even for all it's problems it's far superior to this.",
            "review_score": "-1"
        },
        {
            "review_text": "starts ok but cars are ridiculously loose at the rear end, and become undrivable like a real car as they get faster, and the sensitivity of the throttle doesnt seem to work if you are using pedals.  ",
            "review_score": "-1"
        },
        {
            "review_text": "Don't get me wrong, this game had potential but just has some major issues that make it almost unplayable.  - Handing  The cars handle like complete crap and are either boaty as ♥♥♥♥ or so sensative you can't drive in a straight line. The cars spin so freaking easily and its impossible to overcome a spin or control it. If you so much as touch someone, you spin, if you touch a wall you spin, if you do anything you spin. Trying to drift is nearly impossible, as soon as you start to slide, it's like a bar of soap sliding on the bottom of a wet bath tub. Honestly phone racing games have better handling this. 3/10  - Performance  I don't know if this is my own fault, or what but after playing the game for 10 hours the performance decided to jump off a cliff and I know it's not me playing on a weak PC, I play Shift 2 above 60 fps no issue at all on max. If it wasn't for the ♥♥♥♥♥♥ performance, the graphics would be really good. 4/10  - Difficulty  I don't want to play a game that is so easy you dust everyone, but damn its nearly impossible to win even if the game didn't have the ♥♥♥♥♥iest handling ever. If all of the AI have the same car as you, they are still way faster in all ways despite them owning the EXACT same car as you. It makes winning more of a hassle than fun, you end up restarting the event over and over again until either you wreck one of the AI or they do something stupid and you get extremly lucky. 2/10  If you want a nice looking track racing game, just get Shift 2, it's a lot better and cheaper, you even get all the DLCs for free.",
            "review_score": "-1"
        },
        {
            "review_text": "Amazing! The carrer mode is amazing, just outstanding. And the handling surprised me, it's better than Grid Autosport, wich is fantastic and ridiculous. The ESPN parts are just amazing... Makes he story a lot better and enjoyable! REALLY RECOMENDED!",
            "review_score": "1"
        },
        {
            "review_text": "One of the most disappointing racing games for me. The first GRID was incredible and had a more semi-sim feeling to it where as GRID 2 is 100% arcade, something that is very unlike what Codemasters have been doing since the first Race Driver. The sponsors function has been changed completely, very dumbed down. And the absence of a decent monetary system is very disappointing. There's nothing left of what made the first GRID great. Thanks Codemasters for ruining a great game.",
            "review_score": "-1"
        },
        {
            "review_text": "While the graphics have improved, the racing excitement and game-play from Grid is gone; no teams or team mate, no licenses, no money (win fans instead!!!), no open seaters, no LeMans and few actual circuits. The game is linear and you have no choice where to race. The roads are lined with walls and hitting them seem to be integrated into the game. The in-session commentary is annoying and condescending and no option to change it.",
            "review_score": "-1"
        },
        {
            "review_text": "So i finished the game.. BUT generaly it was BAD...  Firstly and most annoying the opponent AI cars are like immortal. I mean come on! you crash on them with 270km, you get tossed like &lt;3 &lt;3 &lt;3 &lt;3 and they are just keep going like nothing happened AND NO DAMAGES? really?  The maps .. All the same, no matter what mode you play. 5-6 areas with a biiiiiiiit modified tracks. The 'freezing' because of enviromental lightning.. Doesn't matter how high or low you have your graphics. Doesn't matter if it's Intel or AMD. IT WILL FREEZE for a few miliseconds that will propably ruin your race especialy online. The car handling. The whole thing was bad. where are those awesome ORIGINAL GRID settings for realistic driving? They don't even have the HEAD VIEW option.  Now for the online mode. This was the worst. The menus.. You have to click in damn LOT choices to just enter an event.. You need to exit a party to change car settings or get new unlocks or upgrade cars -means you will lose that party, take it's sweet time to find new-. The car menu was poorly designed.. To upgrade cars you kept needed to move up and down on riddiculus selections, to swich between cars you need to do all over menu browse from start.. ReALLY? Second most stupid thing online.. CHEATERS .. yep just like dirt or f1 we have a lots of those here .. nothing more to say. And ofcourse that there is no penalty for those who are just playing to crash on you so their 'pals' can get the flag. THIS IS NO &lt;3&lt;3&lt;3ING DIRT!  My opinion, get GRID 1 if you want a really good racing game.. with a LOT of tracks and cars again, with NO need for stupid upgrates.. Just get money and buy cars.. Just no online games there. lan and splitscreen are still available.",
            "review_score": "-1"
        },
        {
            "review_text": "Singeleplayer: Ok.  Not as good as the one from the first Grid. Repetitive tracks. Fun at stages.  Multiplayer: Just bad! Pointless level system.  Annoying lobby system. The rules of most the modes are just unbalanced and stupid. Voice over ip makes up the rest.   Conclusion:  Just don't buy it until you just want to play a singleplayer.  For fans of the first one: just act like this is not a sequel to it. :D",
            "review_score": "-1"
        },
        {
            "review_text": "Game is well optimized but the only thing that is missing is a ♥♥♥♥ pit view. If this game is on sale I would reccomend it.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent arcade and terrible sequel. It's even not a sequel, it's completely another game, named GRID2 by mistake. If you are looking for some racing action - GRID2 is good choice. If you're looking for real GRID sequel... Well, I have bad news for you. It is still not released yet.",
            "review_score": "1"
        },
        {
            "review_text": " Game was played on Hard",
            "review_score": "-1"
        },
        {
            "review_text": "I wish someone would do more with the demoliton dlc. I love bashing into the other cars. I just wish someone would expand on this. I can only find one car and one track for bashing into other rolling death machines.   Great racing game though. One of the best I have.",
            "review_score": "1"
        },
        {
            "review_text": "i like how they have built drifting into the physics so that you can choose to use it or not (although id say the game favours the drifting style). very cool.  i never used the ♥♥♥♥ pit view but ill admit it was a nice novelty, meh w/e its still every bit as good as the first imo.",
            "review_score": "1"
        },
        {
            "review_text": "Yeah, this game is fun, I guess. Some of the mechanics are ridiculous, though. If an NPC spins you out or even nudges your bumper mid-race, you are guaranteed to end up facing the opposite way you need to be, though, regardless of how well you try to steer out of it, and might as well just restart as there is no possible way to recover. So just be forewarned - save yourself a lot of frustration and know that unless you race perfectly, be prepared to 'restart' a lot of races. Some races are factually unwinnable, especially the ones at the racetracks. The best, though, are the races where you're all in the exact same car, but the NPCs can corner at 120mph and you spin out at 60. The game is fun, to be sure, once you know what you're doing, but just be prepared for a lot of WTF head shaking at the blatant cheating. I am going to say that I recommend this game, but only if you can get it for two dollars or less.",
            "review_score": "1"
        },
        {
            "review_text": "Mamadu, if you ever happen to read this, I hope you ♥♥♥♥ing die ♥♥♥♥♥♥ and I never wish to race you again because you're a ♥♥♥♥♥♥. The end.",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant game. Makes other raceing games look boring. Would recommend.",
            "review_score": "1"
        },
        {
            "review_text": "this game isnt really fun if you dont have a controller but holy ♥♥♥♥, demolition derby makes it all worth it.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome racing game, love it!",
            "review_score": "1"
        },
        {
            "review_text": "Never got into the original, was always a project gotham/gran turismo fan. Ticks most the boxes for me  The Good  +Sense of speed +Graphics +Easy to run +Interesting tracks, not too much chatter between races +Fun to play +Nice balance of arcade racing but you can feel the car under you +No stupid racing lines  The bad  -lack of cars -DLC car packs(Yuk) -Has a rewind feature -You can buy car packs for online gameplay.  Overall if you are looking for a decent fun racing game that you don't have to put 100 hours into, this is recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Definitely one of the better racing games I have played on the PC in a while. Definitely recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Horrible arcade where your car weights like a car and opponents are running trams.",
            "review_score": "-1"
        },
        {
            "review_text": "I had the original Grid on xbox along with Forza 3 and while Forza puts you to sleep playing it Grid kept you wide awake. To this day Grid is the only racing game i've played where you actually get a real sense of speed when racing.  Grid 2 isn't as good as the first, they took a few things out like being able to spectate when waiting to race when a session has already started (you can now only spectate if you had already been playing and crashed/retired) . I also don't like the interface either.  Car handling is similar to the first Grid but maybe slightly easier? i still get the same sense of speed playing this that i did playing the first one, so in that sense it's just as addictive for me playing it.  Graphics with everything turned up to max only really seem marginally improved over the original (but then the first one looked great to begin with), I guess the smoke effects have improved and the exhaust heat.  I should warn people actually that if you buy it now you really need to buy the car DLC as well to stand a chance in a race as you have to level up to buy certain tiers of cars. If you don't have certain cars unlocked you will only be able to realistically come 6th place in a race, you won't be able to win or come in the top 3 that's for sure. Also what's ridiculous is you can only unlock tier 4 cars (highest tier supercars) when you are in the mid 20 ranks. I am rank 31 right now and put in about 70 hours of play time, so you are looking at playing for 50ish hours to unlock the last tier of cars without DLC. The game does loan you a car if you don't have one for the required tier but the one they loan you for tier 4 is terrible, can't steer or turn to save its life. The cars they loan you for tier 2 and 3 are fine, tier 1 not so much.  If you played and liked the first game you will probably like this, if you haven't played the first one i'd wait till it's on sale to try it out as it's a polarizing ARCADE game (not a sim) as you might not like the fairly simplistic car handling.  But saying all that, the sheer sense of speed you get while playing it you can't get anywhere else, and that's what does it for me which is why i'm addicted to this racer.  7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Definitely one of the better racing games I have played on the PC in a while. Definitely recommend.",
            "review_score": "1"
        },
        {
            "review_text": "A very nice game! Sure at the beginning u have to get used to it, but it becomes a lot of fun, especially if u play it on a lanparty with friends!  +!",
            "review_score": "1"
        },
        {
            "review_text": "This game is 1/2 Retail an another 1/2 DLC version ! Shame on you Codemasters !!!",
            "review_score": "1"
        },
        {
            "review_text": "It's alright if you want a mix between arcade and simulation, I prefer the original Grid because this one is too arcadey.",
            "review_score": "-1"
        },
        {
            "review_text": "In short: Great racing game.  Longer version: You're being discovered as a talent in motor sports by Patrik Calahan and he tells you about this idea he's been having: WSR - World Series of Racing. In order to make this idea come true he would need a guy who could persuade different driving clubs over the world to participate in the series. So... The first season you're driving in the US, the second one in Europe, the third one in Asia... and the fourth one is the best drivers combined. What 'grinds my gears' is that the fifth season makes the game SOMEWHAT outstaying its welcome, it doesn't need the fifth season since it's pracically the fourth one but with some faster cars.  Also... Codemasters decided to remove the cockpit view. WHY?!?! It's the best one.  But I recommend this to anyone looking for a fun (arcadey) racing game.",
            "review_score": "1"
        },
        {
            "review_text": "Did not like it one bit. I use a Logitech G27, and I've got to say the way the game handles is just bad. When I clutch kick it'll put me back in neutral, and that just sucks. Nothing really feels 'real' about this game at all. I'll be going back to NFS Shift until I can find something better.",
            "review_score": "-1"
        },
        {
            "review_text": "Nothing like the first grid game. badly made game.",
            "review_score": "-1"
        },
        {
            "review_text": "0/10 bs pos game would not recommend",
            "review_score": "-1"
        },
        {
            "review_text": "looking for realistic graphics? buy this game",
            "review_score": "1"
        },
        {
            "review_text": "The first version are awesome, And this? Shiiiiiit ♥♥♥♥ing dope asf.",
            "review_score": "1"
        },
        {
            "review_text": "This is a Rage Review. IT IS IMPOSSIBLE TO TURN IN THIS GAME. The end.",
            "review_score": "-1"
        },
        {
            "review_text": "So a quick 'review'. PROs and CONs first. Then some comments &amp; random notes I have about the game. (note, my #/10 score =  MY ENJOYMENT  + minimal thought of gameplay+graphics/sound+story etc.. )   PROs:",
            "review_score": "-1"
        },
        {
            "review_text": "A highly robust racing game. Appeals to both hardcore and casual alike. It's very much focused on the racing - there's no extra clutter. There is however, a great deal of variety in the event types and the tracks - so it's not just a boring race round circuits. Handling is excellent - very accessible for racing game newbies but deep enough to be fun and satisfying for more experienced players. Graphics are decent too - especially the lighting. But if you have an Xbox 360, then there is absolutely no reason to buy this game over Project Gotham Racing 4.",
            "review_score": "1"
        },
        {
            "review_text": "They All Say GRID 2, is Worst than GRID 1, But I say Both Look Different Both are Great Driving Games!",
            "review_score": "1"
        },
        {
            "review_text": "Grid 2 give you the most incredible experience behind the wheel.  In spite of being focused on a touring concept, it has the largest choice of cars and tracks on the urban and mountain territory, where you can race on a ford focus or on a bmw in midtown chicago or drift them in the mountains of japan.  Grid 2 brings the old school muscle cars, the brand new urban cars, the fastest touring cars, mixing them and put you into a test of different race modes, like drift, sprint, lap race, endurance, etc, giving you a total experience of racing your way to the top.  The multiplayer is outstanding, unfortunately since the release of Grid Autosport, the number of players have decreased but believe me guys, Grid 2 is even more worthy to buy because its more versatile and not so 'one dimensional' like autosport is, only focusing his gameplay on touring. Btw, the demolition derby free dlc is awesome and just gave me a ton of good laughs when i smash my friends!",
            "review_score": "1"
        },
        {
            "review_text": "Graphic, sound are good, damage physics is good. But the most important thing in racing games, Car physics (control) is really bad.  It's no where near simulation. It's somewhere near arcade, but it's not. It's like... somewhere between them and it's awful. In this game, you go through corners faster with drifting than braking and following the racing lines. It's ok for arcade style, but then it tries to be like simulation, tiny error will ♥♥♥♥ you up and make you lose places or even crash your car (that's why there is rewind feature?). This control will make you very frustrated when you go deeper in the career mode (when your cars are faster and facing harder components).  May be you can do better after practicing more with this game. But when you played another racing games, no matter it's simulation type like F1 2013 or arcade type like NFS, you will find it hard to adapt to this controls. It's very unique that no racing game is similar to this.  This game shows potential but it's totally ruined by its car physics.",
            "review_score": "-1"
        },
        {
            "review_text": "Online mode is dead. Single player isn't that much fun.",
            "review_score": "-1"
        },
        {
            "review_text": "An insult to racing games..",
            "review_score": "-1"
        },
        {
            "review_text": "I purchased this game when it first released because I am (was) a huge fan of the original GRID and of CodeMasters in general. This game is, without a doubt, a disgrace to the GRID franchise.  You're forced to endure a stupid storyline that focuses on social media and getting popular. The handling is absolutely awful. It is about as far from a sim as you can possibly get. I should not be able to race entire tracks and full throttle and drifting should not be as easy as it is with EVERY car in this game.  Pros: + Good Graphics  Cons: + Terrible Social Media Gimmicky Junk + Worst vehicle handling I've ever experienced + Damage is unrealistic + Starting in last place in every race means at one difficulty, the game will be easy, but at one step higher, it will be impossible to win.",
            "review_score": "-1"
        },
        {
            "review_text": "Yea its a very nice idea to put Mustang as a starting car. Game plays better on the keyboard and gamepad than on wheel. ",
            "review_score": "-1"
        },
        {
            "review_text": "Good arcade fun. Sure, not a simulator, yet fun with friends in online, and amusing in singleplayer. Only if the game was free, not only for the weekend. The fun lies in it's castualtiness, it is simple, but if you want to play simulator go and find one.  I'd say 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Anti-corner cutting system and insane difficulty jumps ruined this game for me.  Just buy the first one and you won't be dissapoint.",
            "review_score": "-1"
        },
        {
            "review_text": "Gorgeous visuals, impressive audiodesign and the racing is fun too.  Just don't expect a simulation.",
            "review_score": "1"
        },
        {
            "review_text": "A must have, amazing game!",
            "review_score": "1"
        },
        {
            "review_text": "The best game ))",
            "review_score": "1"
        },
        {
            "review_text": "A step down from GRID. Codemasters continue their pattern of dumbing down their racing games in GRID 2.  If you want an arcade racing game with voiceovers telling you how awesome you are when you win races, a ridiculous storyline and ads being pushed in your face, then this might be the game for you.  The storyline removes almost any choice you have in how you play the game. There's no element of building your garage or team, as you're essentially a hired driver.  In terms of driving, before release the developers boasted about removing assists, such as traction control. This isn't true, strictly speaking. What you have instead, is traction control that's permanently on - perhaps at a slightly lower level than in GRID. This totally undermines the drifting minigame (which was quite good in GRID), which is now 'pull handbrake on corner, and wait for car to auto-correct', essentially.  Certain cars will have the rear step out given the right conditions, but broadly speaking all the cars handle the same. There is a fairly wide selection of cars, but when they're all the same and you have around 20 cars to pick from for a race, there's no point in picking any of them, except the fastest one.  Additionally, there are no interior views on the cars, like in GRID.  The game looks great though. The cars and scenery are well modeled, and there's a very nice lighting system. Some of the new tracks, are also quite nice. Overall however, this is an outright worse game than GRID.  If you like arcade racing, the original GRID is still quite a good game, flaws and all.  If you're looking for a simulator, this certainly isn't the game for you.",
            "review_score": "-1"
        },
        {
            "review_text": "Amazing ! Recommend to all the race fanatics out there !",
            "review_score": "1"
        },
        {
            "review_text": "A step down from GRID. Codemasters continue their pattern of dumbing down their racing games in GRID 2.  If you want an arcade racing game with voiceovers telling you how awesome you are when you win races, a ridiculous storyline and ads being pushed in your face, then this might be the game for you.  The storyline removes almost any choice you have in how you play the game. There's no element of building your garage or team, as you're essentially a hired driver.  In terms of driving, before release the developers boasted about removing assists, such as traction control. This isn't true, strictly speaking. What you have instead, is traction control that's permanently on - perhaps at a slightly lower level than in GRID. This totally undermines the drifting minigame (which was quite good in GRID), which is now 'pull handbrake on corner, and wait for car to auto-correct', essentially.  Certain cars will have the rear step out given the right conditions, but broadly speaking all the cars handle the same. There is a fairly wide selection of cars, but when they're all the same and you have around 20 cars to pick from for a race, there's no point in picking any of them, except the fastest one.  Additionally, there are no interior views on the cars, like in GRID.  The game looks great though. The cars and scenery are well modeled, and there's a very nice lighting system. Some of the new tracks, are also quite nice. Overall however, this is an outright worse game than GRID.  If you like arcade racing, the original GRID is still quite a good game, flaws and all.  If you're looking for a simulator, this certainly isn't the game for you.",
            "review_score": "-1"
        },
        {
            "review_text": "This is GREAT GAME !!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "The best racing game to date, period.",
            "review_score": "1"
        },
        {
            "review_text": "Fun racer that is definitely worth buying, especially if it is on sale.   Pros: -Runs well and looks good  -Flashback system is really helpful for beginners and helps with learning curve  -Some cool international locations in the game -Not too much of an arcade racer, still somewhat challenging  -Lots of different game modes -It is just fun; what else do you need?  Cons: -Can get a bit stale after 15 or 20 hours -DLCs options can be seen as annoying, but didn't really bother me",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game with very fun gameplay, makes you want to race even more !",
            "review_score": "1"
        },
        {
            "review_text": "Best car racing game at this moment.",
            "review_score": "1"
        },
        {
            "review_text": "This could be by far one of the best racing games and really is.It is better than any other racing game on Steam.Good sound,realistic driving based most on drifting and the best thing that this game has to offer is an amazing visual experience.Multiplayer is one of the interesting parts of this game too and as a game this one is very stable and very good optimized for PC.A bad thing could be the missing 'Inside of the car' camera view but this thing doesn't matter at all because this is a really good game from almost all points of view...It has a lot of other amazing features to offer...I recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "I have only played this game for 3-4 hours, below are my initial thoughts.   Pros: Easy enough, good for casual racing. Full steam support, compare timing with friends. Nice graphics Career mode provides certian sense of purpose.  Cons: Limited selection of cars Certain animation can't be skipped",
            "review_score": "1"
        },
        {
            "review_text": "great game",
            "review_score": "1"
        },
        {
            "review_text": "GRID 2 is highly recommended for fans of the racing genre. I have thoroughly enjoyed it and I think anyone who likes the Codemasters or NFS series this should be a no brainer.  PROS - - Huge variety in cars, tracks and race types - Graphics - Damage modelling - Paint job customization - Driving model - Rewind feature  CONS - - No race line feature - Car spins during painting - Driving model  If you noticed that I put the driving model as both a pro and a con, it's because really the model is subjective. It is not a 'hardcore' model like you will find in other high end racers. Nor is it too arcady. Like I said, if you enjoy NFS etc, this fits in well with those.  The rewind feature is a huge step forward to reduce frustration in racing games. Ever run the perfect race only to make a small error at the last lap and get dumped to the end of the pack? That's over. Have a crash or take a corner wrong and spin out? Just rewind a few seconds and have another go at it. Feel that's cheating? Don't use it. Personally, I love the option.  Cars look great, tracks look great. Track your best times and stats against your Steam friends. I haven't used the multiplayer much, but its there if that's your thing.   Get bored of racing? Try the demolition derby! You'll have lots of fun with this one.",
            "review_score": "1"
        },
        {
            "review_text": "This is grid 2 what more is there to say, But go racing.. probably one of the finest racing games you will ever play until the next grid game?",
            "review_score": "1"
        },
        {
            "review_text": "If you're just the average gamer looking for a fun racing game, this is a great option. The physics aren't ultra realistic like racing simulators, but they're better than the basic arcade games like Need for Speed or Burnout. It can be extremely challenging to nail a corner perfect, but the cars are very forgiving if you make mistakes. If you like the DiRT games, there's a good chance you'll enjoy the Grid games too.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, but the first Grid is better. Grid 2 doesn't have all the great tracks the first game had, and the steering is a bit worse. The amount of cars i greater, but they are not better to drive. If you want a racing game like this, buy the first grid.",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best arcade racing game. I repeat it: an arcade racing game! The same 'swimming' controls, even with a steering wheel - that's why I say it's an arcade game. Don't expect a serious real simulation, and you'll like it. Better graphics than Race Driver: GRID, more cars, more tracks. It's still great fun online after so many hours. I recommend it, 9/10!",
            "review_score": "1"
        },
        {
            "review_text": "One of the greatest racing game. If you like that kind of games, you should think about try this one. I prefer the money system that we had in the previous game than the fan community system. But it is easier to have new cars.",
            "review_score": "1"
        },
        {
            "review_text": "I know I've only played a tiny portion of the game at just 10 hours, but I am confident I can give it a glowing review right this split second.  It's amazing. Absolutely, truly. A real finisher!  This is coming from someone who has stayed away from racing games for the better portion of the last 25 years. Why? Because I hate 'timers' in games... and what is a race? mostly timers! However this game may have some timers (the checkpoint races I 'just' started are a bit annoying), they are in no way abusive like how 'other' games do timers. So here I am feeling stupid and sheepish for staying away from racing games due to that. ANYHOW...  There is so much variety in this. Different kinds of races and events and locations. So many different kinds of cars, some of which I have quickly found suck (I'm looking at you crystler and mazda)! While some are just so in sync with me that I'm ripping up the events (oh my volkswagon I'm in love)! Its just great.  To top it all off, this game absolutely roars on my system. I have that 144hz monitor, and this game never hitches a single frame off 144fps at max detail. Its absolutely gorgeous and smooth, making it so intense I feel like I'm there!   I began playing in the 3rd person behind the car mode, because I had wanted to see my car and others nearby. But then I switched to hoodcam (where you see the hood), and my effectivity increased insanely... I was drifting tight corners and barely running into anything. It was night and day. Its awesome the game has the choice! Some games force you to their way or the highway, no pun intended.  If you dont already have this game, and even if you are not a racing game fan... I say get this. Its a blast!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best modern racing games in my opinion. Definitely worth giving a shot. Improved on everything from GRID, except for drifting. They made drifting worse. However, you can pretty much drift with every RWD car on non-drift stages, it's just that the actual drifting stages are hard as ♥♥♥♥ and cars behave completely different.   8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game. I perfer Dirt 3 because of the in car view. But this is THE best racing game on steam. I just wish more people played online. :'(",
            "review_score": "1"
        },
        {
            "review_text": "This is pretty close to the best racing-game I have played in 31 years. The multiplayer with friends is unbelieviably fun.",
            "review_score": "1"
        },
        {
            "review_text": "By far best racing game i played, and realy good graphics. defianelty recommend to try this out :]",
            "review_score": "1"
        },
        {
            "review_text": "pooooooooolecam toxik",
            "review_score": "1"
        },
        {
            "review_text": "Grid 2 is brilliant. It's hard to master but each vechiles feels unique with handling speed and sound. I have played a lot of racing games but GRID 2 is probably one of the best i have played in a long time",
            "review_score": "1"
        },
        {
            "review_text": "The game's dynamics are very good and very well refined for all cars of any specifications. It has a story line, which is not typical of a racing game but it is very well done so that as you complete targets and objectives the story continues and you can play the game at your own pace.  If you set it to easy the races still pose a challenge perhaps not from the bots but from the game play its self, the harder difficulties offer a great challenge from the bots and forces you to better your skills.  You have the option to customise your vehicles in any variation of colour with each section of the car (tags, wheels, stripes etc.), however you don't have the option to customise (add/remove) stripes etc, which is a disappointment. Also the game looks amazing with the graphics set to maximum.  If you're looking for a racing game that isn't 100% realistic but will still give you a lot of realism along with some awesomely fine tuned game play I highly recommend buying GRID 2.",
            "review_score": "1"
        },
        {
            "review_text": "21/60 :(",
            "review_score": "1"
        },
        {
            "review_text": "Very good game with epic moments, beautiful graphics, destroyable cars and absolutely staggering scenery (especially Pacific coast).",
            "review_score": "1"
        },
        {
            "review_text": "Great game, really nice graphics. Totaly worth the shot. They driving in this game is amazing, it combines the good 'ol Turismo with Flatout in a really dynamic way. Multiplayer is still alive and very fun, since most of the people dont know their microphones are on and sigh every time they lose a turn.   11/10 too many cars.",
            "review_score": "1"
        },
        {
            "review_text": "Great game!",
            "review_score": "1"
        },
        {
            "review_text": "Even tough i am not into driving games, this is a must have game !",
            "review_score": "1"
        },
        {
            "review_text": "Picked it up through the HumbleBundle and though a bit gri(n)dy it's quite enjoyable. A view more tracks would have been nice.",
            "review_score": "1"
        },
        {
            "review_text": "-♥♥♥♥♥♥ repetitive gameplay    +♥♥♥♥ing beautiful",
            "review_score": "1"
        },
        {
            "review_text": "As Grid was the greatest racing game of a generation, Codemasters has done it again by taking that greatness and reworked it as a successor from the ground up. Grid is no longer that benchmark. Grid 2 is. THIS is by far, the greatest racing game I've ever played. Pure adrenaline, high-octane action which doesn't let up until you've crossed that finish line. Make no mistake; there is NO rubberbanding from the AI in this game. You wanna win and claim 1st? FIGHT FOR IT, because the AI will work just as hard as you do to be there: Trading paint, slicing corners, braking risky turns and burning off every inch of asphalt on those treacherous straight aways.  Come to think of it, this is more than a racing game. This is an experience. Just as Skyrim has done for RPGs, Grid 2 has done for racers. To oversimplify the fact: this is the Dark Souls equivalent of racing. A challenging, but extremely rewarding experience that will captivate you again and again behind every wheel of every car you take to the pavement.  Incredible sound design, outstanding controls which truly make you feel like you are behind the wheel of every car you drive, and the reactive environments you race in: no two races EVER feel the same and I would be hard pressed to believe anyone who claims otherwise.  If you've never played Grid, now is the time to acclimate yourself to the one and only racer that might just be the only thing truest to the form.  Trust me. This is one HELL of a game!",
            "review_score": "1"
        },
        {
            "review_text": "Good Racing Game - Graphics are very good but racing mechanics feel increasingly 'need for speed-ish'. Really wish that a Gran Turismo existed for PC. Something about Drifiting a $800K Bugati Veyron around a corner at 150 MPH doesn't feel realistic. Doing it at 100 MPH in a 20 Year old Nissan 300Z feels even less so.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game I picked up for 10 Euros, long 'campain', lots of cars. Fancy graphics, good mechanics. The only problem is that you're gonna need a pretty good setup to run it to the max. Them shadows ya' know  8/10",
            "review_score": "1"
        },
        {
            "review_text": "Worst piece of ♥♥♥♥ I have ever played dont waste your money too arcadey worse than Burnout Paradise.",
            "review_score": "-1"
        },
        {
            "review_text": "By far the greatest racing game yet.  - Excellent Car Physic - Excellent Atmosphere - Nice Graphic - Great Sound ( Engine, Soundtrack, etc. )  -- Most realistic Drift i ever play in my life --",
            "review_score": "1"
        },
        {
            "review_text": "The vehicle control dynamics are certainly different from many other racing games. Someone stated in previous comments, that it's a lot like driving around in a snow. And it kind of is, sometimes. One of the main reasons I'm stuck playing this game is that it's challanging. Along with great graphics, good variety of locations and wide vehicle selection.",
            "review_score": "1"
        },
        {
            "review_text": "Okay here we go  PC Port:  The PC Port is amazing! There is a reason that in a lot of graphics card benchmarks they use Grid 2, the game is optimized very well on PC. I've had no issues, no crashes, no Games for Windows Live, no issues with menus or anything at all.   Grid 2 is an example of a PC port done right!   The Game:  You start in a little garage with no fans or anything, then you have to get better, gain more fans and then you'll get a better garage! I really enjoy the progression in this game and it had me hooked for hours.  A lot of people complain about how the cars handle compared to Grid 1, in fact almost everyone complains about that. I haven't played Grid 1 but I really like the Grid 2 handling. Obviously the cars dont handle realisticly or anything like that but they're very much fun to drive in.    For its price this game is an amazing PC Racing game! You should defenetly check it out.  ",
            "review_score": "1"
        },
        {
            "review_text": "This must be a joke. 24eur discount price for a game which is practically dead is mockery. MP is most of time deserted. DLCs are not likely to revive it.",
            "review_score": "-1"
        },
        {
            "review_text": "Really good fun came. Easy to pick up for none race type people,",
            "review_score": "1"
        },
        {
            "review_text": "Good for collection but not really important   Recommended if you buy this on sale  7/10",
            "review_score": "-1"
        },
        {
            "review_text": "I was pretty disappointed with this one. It gets by as a predictable and safe arcade racer, but that's about the best to be said about it. The graphics and effects are OK. The story mode is less cringey than many of its counterparts, but it still holds your hand a bit more than i care for. The controls feel like a standard, mediocre arcade racer and don't do much to excite. I have a stability issue with the game that i haven't been able to resolve, which is that it crashes without fail about 15 minutes into every play session. Others have this issue as well, but i have yet to be able to resolve it. The game doesn't do enough to get me to keep attempting a fix anyway. Recently, i grabbed this game's predecessor, GRID, and was shocked to find that it is a better game in practically every way. I enjoy it's UI more, it feels better optimized, it doesn't crash, the controls feel much better, the tracks are more fun and exciting, and it's story mode is less intrusive. If you're looking for a solid arcade racer, I would definitely suggest the original GRID over this one. If you enjoy a challenge and have a decent computer, definitely consider a game like Project Cars or Assetto Corsa over this series, as they go on sale frequently and have much more to offer.",
            "review_score": "-1"
        },
        {
            "review_text": "Lot of fun in on-line races! ^^",
            "review_score": "1"
        },
        {
            "review_text": "My graphics were low and it still looked stunning.",
            "review_score": "1"
        },
        {
            "review_text": "If you like dodging other cars while driving then this is the game for you. Because it sure feels like the AI drivers were paid to kill you and make it look like a racing accident.  Otherwise this is an OK and easily approachable arcade racing game. Well at least it has multiplayer.",
            "review_score": "-1"
        },
        {
            "review_text": "Get's boring after a while, still fun if you put it on the hardest difficulty. Challenging.",
            "review_score": "1"
        },
        {
            "review_text": "it is a really fun game, whit the time becomes repetitive.",
            "review_score": "1"
        },
        {
            "review_text": "This is worth the money for sure mega fun playing with freinds :D loving it so far",
            "review_score": "1"
        },
        {
            "review_text": "GRID 2 is drift racing game.  + Gameplay feels great + Amazing graphics for 2013 game + Tons of cars to choice from to pleasure your needs + Great sound + Great difficulty scaling + Game is very enjoyable with keyboard too + Split screen + Many modes from races, time attack, drift... + Online multiplayer that works as you would expect + Very well optimized + Has free demo to try b4 buy  - Only few camera options (no inside camera options) - Tracks should be spread into more enviroments to make game more excting  I recommend game to those who enjoy drift racing games, as this is one of the best I've played so far.",
            "review_score": "1"
        },
        {
            "review_text": "Grid autosport its like a failure,but this game I must admit the gameplay is very enjoyable, Codemaster always make the car easy to control it doesn't like any other developer.But i think there's should be advanced modification like tuning or bodykit that would be great.",
            "review_score": "1"
        },
        {
            "review_text": "Would completely recommend, tons of hours of fun. The graphis are great, and they did a fantastic job making each car diferent from the rest!",
            "review_score": "1"
        },
        {
            "review_text": "Cool game.I dont like to trevel in the rush-hour.",
            "review_score": "1"
        },
        {
            "review_text": "hit leegreves. much fun. 5/5",
            "review_score": "1"
        },
        {
            "review_text": "No first person camera. Terrible.",
            "review_score": "-1"
        },
        {
            "review_text": "Grid 2 is a very good game ",
            "review_score": "1"
        },
        {
            "review_text": "Best racing i ever played. ",
            "review_score": "1"
        },
        {
            "review_text": "It's an awesome racing game.",
            "review_score": "1"
        },
        {
            "review_text": "To race, you play To play, you drive To drive, you need skills To have skills, you play this game To play.... you just have to click play and use wasd.  profit.",
            "review_score": "1"
        },
        {
            "review_text": "This game ♥♥♥♥ing sucks. I bought it because I loved drifting in Grid 1. In this game, you can't even properly drift, it's all just powerslides. There's literally no control, you can't maintain a drift. There's no option for changing assists, so you're basically forced to drift with traction control and active stability management and other stuff. -1/10.",
            "review_score": "-1"
        },
        {
            "review_text": "It's an awesome racing game.",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "Good for chill out :D",
            "review_score": "1"
        },
        {
            "review_text": "Very well- designed game nice gameplay   (i sugest you to play it on hard with full damage in car ) because it makes this game realistic af",
            "review_score": "1"
        },
        {
            "review_text": "This game is orientated around drifting. It is NOT a grip style racing game. Its drift 2 win. If you dont drift you've come last. And dont even try playing with a keyboard. The devs clearly embraced the idea of DLC because 99% of the cars are DLC.",
            "review_score": "-1"
        },
        {
            "review_text": "Too weird. The controls were awful and the game didn't give me the good driving feeling.",
            "review_score": "-1"
        },
        {
            "review_text": "best car screenshot for wallpaper ever  11/10 -NOT.IGN CONFIRMED",
            "review_score": "1"
        },
        {
            "review_text": "GRID 1 was better, but this has more customization options for cars. I'm torn between the two.",
            "review_score": "1"
        },
        {
            "review_text": "This game is basically an extended tech demo for lens flares with a few cars thrown in. The lens flares were so wild and screen-covering that I found the game to be completely unplayable because I couldn't even see where I was supposed to go.",
            "review_score": "-1"
        },
        {
            "review_text": "I'm not a big fan of racing games but this game is different. It's just amazing.  11/10",
            "review_score": "1"
        },
        {
            "review_text": "online is dead....",
            "review_score": "-1"
        },
        {
            "review_text": "Really fun additive game a must buy !",
            "review_score": "1"
        },
        {
            "review_text": "Great game.  Waiting times are annoying.",
            "review_score": "1"
        },
        {
            "review_text": "Grid 2 is very similar to the original grid, but maintains all the problems with the first one and adds quite a few new ones.  Biggest overall issue, car handling. Its very difficult and frustrating to play any driving game where the handling is poor, and this game has some of the worst. Every car snaps loose multiple times every race. Not just breaking a bit loose and having to oversteer to correct, but snapping loose, losing control constantly. Even the front wheel drive cars are constntly oversteering. Many of the cars go from massive understeer to wild oversteer in a second. If you make contact with an AI driver, you will spin. If an AI driver makes contact with you, you will spin. The driving feels unrealistic, unpleasant, and unfair.  Other issues are: Money system replaced with 'youtube fans'. No decision making for car unlocks, you just get it all at a slow pace. Single player story is on a rail and feels like you have no choice over tracks or direction of play. Endurance races are abysmal, short in duration, no map and random turns makes for frustrating gameplay.  Positives: This game is very pretty  ",
            "review_score": "-1"
        },
        {
            "review_text": "101% dead  also can't get controller to work for some reason  buy dirt rally instead if you can handle it",
            "review_score": "-1"
        },
        {
            "review_text": "Game is worth buying!   1.Has really nice graphics  2.Nice physics  3.Runs high fps on low end pc's even on high graphics  4.It's Fun  5.Buy it! :)",
            "review_score": "1"
        },
        {
            "review_text": "Bought this on Humble Bundle for $1. I wasnt expecting much but this game is pretty fun. It is somewhere between a arcade type racer and a hardcore sim. I like the cheesy story mode. Most driving games dont really have any, except maybe for a couple of the NFS ones.",
            "review_score": "1"
        },
        {
            "review_text": "Yet another GRID game.",
            "review_score": "1"
        },
        {
            "review_text": "EDITED: If your Windows 10 Computer keeps crashing go to computer keeps crashing GRID in the middle of races to the desktop, go to Search&gt;Services&gt; and then stop Touch Services and Handwriting Panel. It will stop crashing i promise ya  Good game, AI is far too aggressive and commonly rams me from behind forcing me to lose a race but i like it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is pretty fun, I'd recommend it to anyone who enjoys racing games.  However it is not without it's flaws: - Some of the cars feel like you're driving on ice most of the time, for example the T4 Mercedes that you get when you haven't levelled up enough to buy T4 cars... - When playing online the community seems hell-bent on screwing you over rather than properly racing.  But, overall, a fun racer with good controls and, when you're up against reasonable opponents, you can have some pretty intense races.",
            "review_score": "1"
        },
        {
            "review_text": "very accurate racing sim, although not the most accurate. menus are ♥♥♥♥, but its a port- still better than anything forza will have.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game with awesome graphics with great optimization I love it.",
            "review_score": "1"
        },
        {
            "review_text": "love this game.",
            "review_score": "1"
        },
        {
            "review_text": "A Paradise compared to the first, even though I'm not a fan of the 'on track' kind of games, this is really good, graphics are astonishing, gameplay is good, took me a bit to get used to it but it's fine, oh and the DRIFTING... dear God... really nice!  I definitely recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Game is worth buying!   1.Has really nice graphics  2.Nice physics  3.Runs high fps on low end pc's even on high graphics  4.It's Fun  5.Buy it! :)",
            "review_score": "1"
        },
        {
            "review_text": "perfect racing game",
            "review_score": "1"
        },
        {
            "review_text": "Terrible game, AI cheats, car design is a mis-mash, zero attempt to adhere to the realism of many of the cars. AI ignores players and plows into players ad-nauseum. Cars are randomly fat, slow, or drift happy (drift is so unreal it's moronic). Drift design ignores the laws of physics. Drift, tire squeeeeeeeellll.  Lens flare is often blinding, camera shakes absurdly over 120 MPH (why do all the bad racing games have this effect?), most of the races in the campaign are done without a sighting lap, so you'll be at a perpetual disadvantage.   The random levels are stupid, most of the locations are the same one backwards and forwards with such little variety. It's like playing a late 90s racer with new graphics.  0/10 at worst, 5/10 at the best moments. DO NOT BUY.",
            "review_score": "-1"
        },
        {
            "review_text": "Gets boring really quick &amp; tbh nobody cares if u max lvl online cos ive seen loads trash max lvl players online easy...Gets boring really quick..would i recommend it.............no unless u wanna Grind on a weekend game.Single player is bllx..Tbh dirt 2 is def the best 1 ..",
            "review_score": "-1"
        },
        {
            "review_text": "  why buy dlc to open the car, sad froo :[",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "-1"
        },
        {
            "review_text": "why is it keeep crashing and restarting?????????",
            "review_score": "-1"
        },
        {
            "review_text": "Better than project cars",
            "review_score": "1"
        },
        {
            "review_text": "Better than project cars",
            "review_score": "1"
        },
        {
            "review_text": " In my opinion one of the best driving games on the market for people who dont look for a very realistic simulation ! ",
            "review_score": "1"
        },
        {
            "review_text": "cant even play it, crashes after startup",
            "review_score": "-1"
        },
        {
            "review_text": "This game cool because it is a fairly cheap game that will satisfy you if you arent too picky.",
            "review_score": "1"
        },
        {
            "review_text": "Buy,play, and FEEL it !!",
            "review_score": "1"
        },
        {
            "review_text": " In my opinion one of the best driving games on the market for people who dont look for a very realistic simulation ! ",
            "review_score": "1"
        },
        {
            "review_text": "bad ai. break too early. not fast enough.",
            "review_score": "-1"
        },
        {
            "review_text": "horrible controls, centered around drifting. Really awful. Autosport, however, is amazing.",
            "review_score": "-1"
        },
        {
            "review_text": "Rubberbanding AI, no cockpit view, cars control like ♥♥♥. AI is absolutely idiotic.",
            "review_score": "-1"
        },
        {
            "review_text": "Not plain good, not plain bad. A game wonderful in controversial feelings it induces, the one you never know what will do next -- either show you heavens or throw you into the rift of despair.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would play again",
            "review_score": "1"
        },
        {
            "review_text": "Dis gaem is liek crash kart wif betr graphex, it was rely fun",
            "review_score": "1"
        },
        {
            "review_text": "This game is such a let-down in terms of playability because it suffers from the 'Black Screen Crash' and unfortunately no one is taking responsibility nor prepared to fix the issue. A number of workarounds have been posted here on Steam and on various websites and after trying out many of the suggestions I have managed to play the game for short periods of time before the inevitable crash occurs. Therefore I do not recommend this game which clearly suffers from bad programming , it is a game which should never had been sold to the public in it's current state. If this were a hardware product it would have not been sold in the first place because it would be classed as faulty goods, I don't see why any digital product should be any different. ",
            "review_score": "-1"
        },
        {
            "review_text": "If you have played this and you like it, you probably touch children",
            "review_score": "-1"
        },
        {
            "review_text": "AI ramming you up the backside all the time. One example is winning the race with 10 seconds to go and get rammed into a wall and car dies so I just wasted 6 minutes for nothing. The better the car the worse the handling gets to the point of being on icy with no grip because the game wants you to drift everywhere. The commentator keeps talking about having to fix the car, which doesn't matter as you don't have money and it is his job to fix the car so why not stfu? The cutscenes for your career feel so cheap and tacky and this game is nowhere near as good as the original Grid, which also had a car cockpit which Codemasters taken out of this Grid.",
            "review_score": "-1"
        },
        {
            "review_text": "second part never be good",
            "review_score": "-1"
        },
        {
            "review_text": "This game has no skilled involved boring and gets old very quick i refunded it because of how boring",
            "review_score": "-1"
        },
        {
            "review_text": "worst game ever i've played",
            "review_score": "-1"
        },
        {
            "review_text": "Code'Masters' Nuff Said.",
            "review_score": "-1"
        },
        {
            "review_text": "Lost save after 14 Hours, ♥♥♥♥ this. Mby not use japanese confirm- cancel options when asked to remove/overwright your saves. Not doing 14 hours work again. Use a better profile save system, even skyrim has backups, what is this, Forza 1?",
            "review_score": "-1"
        },
        {
            "review_text": "..",
            "review_score": "-1"
        },
        {
            "review_text": "I can play this game while smoking 10/10 - IGN",
            "review_score": "1"
        },
        {
            "review_text": "Insta refund on first lap",
            "review_score": "-1"
        },
        {
            "review_text": "Only english settings without a tyre pressure, supension hight, or power transmission and ratio for 4wd is not it, or chip tune even if it is previous version sold in many copies. The Q is how can you sell improved game without off it?  If no one ask, it is so?  Game logic drives a car as artifitial cookie, totally unrealistic with track !",
            "review_score": "-1"
        },
        {
            "review_text": "This game requires fast PC! but I love it though, It has a nice graphics. Recommended for all players :)",
            "review_score": "1"
        },
        {
            "review_text": "Pros: better graphics and more cars than grid 1  Cons: cant modify cars in career mode, more of NFS racing style than racing simulator.  Overall: 7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome. It has a ♥♥♥♥ing split screen!! i never expected that. 10/10 SP+MP. ",
            "review_score": "1"
        },
        {
            "review_text": "Fast based car game. Car damage physics and driving itself is ok. Good racing game with friends!",
            "review_score": "1"
        },
        {
            "review_text": "Pros - variety of races - has some great cars (DLC) - onlines dead because autosport is better  Cons - they forgot that ferrari and lambo exist - seriously how can you not put in the 458 or aventador? - nowhere near as good as the original - the some great cars are mostly DLC",
            "review_score": "1"
        },
        {
            "review_text": "Awesome Game! I highly recomend it for racing game fans!",
            "review_score": "1"
        },
        {
            "review_text": "Make sure to change your steam download server to something in Europe if you want to find anybody to play online.  The game is region locked online.",
            "review_score": "1"
        },
        {
            "review_text": "Havemt foun a nice racibg game like this for a while, but what the ♥♥♥♥ is with some of the lighting, ♥♥♥♥s up my vision of the track, so all i see id pink or green light, 9 times out of 10 i crash and it ♥♥♥♥s up the race for me ",
            "review_score": "1"
        },
        {
            "review_text": "If you liked the first GRID game you'll probably like this one too, there are a few major differences tho, in this one you don't earn money and buy your cars, you just get them handed to you, and can get more cars through racing, and there's no team racing element in this either.",
            "review_score": "1"
        },
        {
            "review_text": "Grid One is better than Grid 2. Thats all.",
            "review_score": "-1"
        },
        {
            "review_text": "This is an OK game and worth buying but not a game I am likely to recommend. The difficulty really seems to ramp up at the end and along with increased track lengths the game gets quite tedious. In the end I dialled back the diffculty simply to stop myself becoming too bored. The rubber banding on the longer tracks is very noticable and good driving is not rewarded enough with descent gains.",
            "review_score": "-1"
        },
        {
            "review_text": "I haven't played a racing game for hours ever since Hot Pursuit. I love how it brings together simulation and arcade gameplay, so yeah. Pretty good.",
            "review_score": "1"
        },
        {
            "review_text": "No cockpit view, but great graphics and easy to use arcade stlye handling and physics make this game fun!",
            "review_score": "1"
        },
        {
            "review_text": "Put simply - It's a really fun arcady sort of race game. Easy to get into and can be played in short sessions or over longer periods.  My only gripes are the price of the DLC and the akward navigation of the menu's which aren't exactly intuitive.  Using a 360 pad the controls feel great, I haven't tried the keyboard but I'd think it would take away a lot of the feeling of control.  Graphics are on a par with DiRT 3 and inlude some nice effects to add to the sensation of speed. It is apparent it's a console port but one thats been done to a satisfying level to please PC gamers.  It runs along nicely on my measly 1680x1050 resolution monitor, averaging 63fps on my ageing AMD 5870 and Phenom 2 1100T @ 3.8-4.2Ghz boost. That includes all settings maxed out apart from the nvidia only settings and AA set at 4x. I'm building a new system in a couple months so if I remember, I will come back and update this if it's possible.  Update: Ok I'm running it on a i7 4790k and GTX 970 on a 2560x1440 monitor. It's still great fun, the settings are all maxed including AA and it all runs great ! Some games have graphical problems running at 1440p but this one is fine.",
            "review_score": "1"
        },
        {
            "review_text": "Seemed nice while I only had access to slow cars.  All started getting ♥♥♥♥♥ier and ♥♥♥♥♥ier after season 2 of WSR.  Pros: The graphics look great.  Cons: * AI always run on max speed in corners without starting to drift or spinout and the car type only changes how YOUR car handles, * Controls of this game are awful: even when using analog input, it's either max or zero turn left/right, * Some events don't allow to make a contact with other cars - it doesn't matter who hits who, you always get disqualified for that, * You're drifting 100% of the time: even when going without acceleration in corners, if you turn to the side, the car starts drifting.  Basically it's impossible to play this game if you don't get a good racing wheel for your PC. I started playing on medium difficulty, but in season 2 had to change to easy and in season 3 changed to very easy, as the cars got more and more uncontrollable, while the opponents were going at max speed with no control issues.",
            "review_score": "-1"
        },
        {
            "review_text": "GRID 2 is a highly arcade racing game, you won't find any real simulations that obey laws of phisics here. Having this said, If you're into that cup of cha, you'll be delighted to play it.  + amazing graphics + interesting career mode + the feel of speed  - handling can be pretty awkward at times  8/10",
            "review_score": "1"
        },
        {
            "review_text": "Another boring, repetitive and short-lived title from Codemasters .....Brings NOTHING new to the table. Waste of time and money.",
            "review_score": "-1"
        },
        {
            "review_text": "Lap a racer, i get last... 11/10 would not buy",
            "review_score": "1"
        },
        {
            "review_text": "Grid 2 is an amazing game! The online works great, the campaign is so much fun. All in all it is an amazing game!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "This game is really good, I love the whole WSR racing leage Fiction story it's very cool. I just WISH I can tweak my race cars suspension settings, brake bias, engine timing, boost presure.....  stuff like that",
            "review_score": "1"
        },
        {
            "review_text": "It's a Great Game, I Recommend it, worths its price, great quality graphics and gameplay /physics, I really dont udnerstand why so much hate and negative reviews from others. One negative is that there's not much people playing online and if you are higher level sometimes you can be get kicked often from other hosts which makes you most times go back to single player/carrier mode.  A good way is to find other skilled players to you level and send a friend request to have someone to play with. ",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME IS SO BAD LIKE OHMYLORD YOU CANT EVEN GO INTO COCKPIT VIEW LIKE M8 WAT. THE FIRST GRID IS A BILLION TIMES MORE GOOD. THX 4 LISTENING",
            "review_score": "-1"
        },
        {
            "review_text": "If you liked Grid, you will love Grid 2. Very cool, great graphics. Love it.",
            "review_score": "1"
        },
        {
            "review_text": "Was hoping for a good sucessor to GRID. However, GRID 2 disappointed me with drifty and arcadey handling of the cars. So if you like racing sims, this might not be as enjoyable as GRID, if you like arcade type of games Single Player in this game might be your thing. Don't buy it for the Multiplayer part as it riddles with cheaters and trainer bots.",
            "review_score": "-1"
        },
        {
            "review_text": "I never liked racing games before GRID 2. Very fun and the flashback system is really well-thought-out. The only thing that annoyed me was that whenever I alt-tabbed the game would mess up my graphics settings. Perfect 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "awesome game. Cant wait for the next one to come out.",
            "review_score": "1"
        },
        {
            "review_text": "Arcade physics and gameplay. Too unrealistic for my tastes.",
            "review_score": "-1"
        },
        {
            "review_text": "I met a guy named muhammed, I smoked his ♥♥♥♥ with my subaru I rate 10/10 would buy again",
            "review_score": "1"
        },
        {
            "review_text": "Cool game.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, I can really reccomend it.",
            "review_score": "1"
        },
        {
            "review_text": "Great game",
            "review_score": "1"
        },
        {
            "review_text": "For me, I think Grid 2 is better than Grid Autosport. The feel and gameplay especially online, make me keep going back to Grid 2 over Grid Autosport.  Just my view x",
            "review_score": "1"
        },
        {
            "review_text": "Not a bad game, I worked out that by editing a file in the game directory it's possible to enable those Intel only FX on any PC. Overall well worth the $8 while it's on sale.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best racing games on pc :) ",
            "review_score": "1"
        },
        {
            "review_text": "Pros: better graphics and more cars than grid 1  Cons: cant modify cars in career mode, more of NFS racing style than racing simulator.  Overall: 7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Racing on ice O_o",
            "review_score": "1"
        },
        {
            "review_text": "Got two events in and it gets stuck in repeat... beat the race, select continue, same race... and repeat... Typical arcade physics, great if you're the age yoru still living at home. If your a sim racer its pretty forgetful dead feeling arcade racing.",
            "review_score": "-1"
        },
        {
            "review_text": "this game goes from fun racing to road rage simulator  the camera is HORRIBLE WHY do game developers always put the camera RIGHT BEHIND the car? if i'm driving a car, wouldn't it be a good idea if I could see what was in front of me? no, instead they put it right there. you can change the camera angle, but it only causes it to go from 'car blocking your view' to 'car slightly down but still blocking most of your view'.  there are so many unskippable parts that exist for no reason  all the other cars can easily pit maneuver you and make your car go out of control but you can't do the same to them  the cars constantly block you and ram into you it's so irritating, avoiding them is next to impossible",
            "review_score": "-1"
        },
        {
            "review_text": "i Was Surprised This Wasn't What I Call A Sim Racing Game. I Was Impressed by the type &amp; variety of cars&amp; that the tracks change on the fly during certain type races. Plus I like the customization.Certainly a game I might buy this weekend if the price is right,",
            "review_score": "1"
        },
        {
            "review_text": ":)",
            "review_score": "1"
        },
        {
            "review_text": "Physics and sound are awesome!",
            "review_score": "1"
        },
        {
            "review_text": "I think Grid 2 is a really good racing game with tight corners and epic drifting. However with all racing games rthere are some flaws but there arent't many, one big flaw for me is no incar view because that really makes the game better ion many ways. Also with almost all PC racing games you'll need a controller if you want your steering to be smooth and not spin out on almost every corner.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game, but THE WORST user interface I have EVER seen",
            "review_score": "1"
        },
        {
            "review_text": "now thats it unfreed it wont work it just pops up a update news and doesnt play &gt;:(",
            "review_score": "1"
        },
        {
            "review_text": "Love this game. Graphics are unreal.",
            "review_score": "1"
        },
        {
            "review_text": "This game is the best racing game i have ever played in a long time. It is so fun to play and so fun to drift round all the different tracks in this game. If you are not good at drifting then thats fine because you dont have to thats the good part you can drive how you like. Also the grafics of the game is fernominal. The only game better than this is FH2 but you cant get that game on steam so this game is the best racing game on steam.... I just cant wait for grid 3.",
            "review_score": "1"
        },
        {
            "review_text": "Nice arcade racer. i dont like codemasters career modes so much because you change car too often. I like to keep 1 car and make it good xD but ok career nonetheless =)",
            "review_score": "1"
        },
        {
            "review_text": "Love the game, hopefully a 3rd one comes out..",
            "review_score": "1"
        },
        {
            "review_text": "Worst racing game I've ever played. I prefer realism when playing racing games. Makes me glad I didn't pay full price or even half price got it in Humble Jumbo Bundle 3. Paid $6.25 for the hole thing.",
            "review_score": "-1"
        },
        {
            "review_text": "You'd be better off getting the original GRID. You know, the one that DID win the awards and sold couple million copies.  This one is basically the same as the original, only worse. You do the same thing but are given less options, less real world tracks less cars and shorter races. Seriously. Half the races your career consists of have ONE lap. ONE. Driving assists are always on with no option to disable them makes the game pretty easy for anyone familiar with racing games. It's no longer 'almost a racing sim' where you can still turn assists on and have fun with it. You're only getting the 'arcade' experience. Even on the highest difficulty I had no trouble winning races. Unless it's a one lap race that you start from last place - good luck with that. Only new and interesting mode is the 'Overtake' but it's ruined by the AI obviously being awarded way more points that you can earn yourself unless you have an absolutely perfect run. I understand AI needs to cheat sometimes but at least don't do it in front of my eyes. Other modes have been dumbed down. Drift now consists of you making a SINGLE run down like 3-4 turns on one of the regular tracks, which are completely not meant for that, while your driving assists are still on. No skill is required. It's a joke basically. Also no 24h Le Mans or 20-something car races. 6 cars max, short tracks, 1-2 laps each. ",
            "review_score": "-1"
        },
        {
            "review_text": "I enjoy arcade racing games (like this one) much more than racing games that try to be on the more 'realistic' side (like Forza). I don't like waiting to hold down the controller's trigger all the way, and this game let's me do that. This is a great arcade racer not only because it provides an excellent variety of fun and unique challenges, but also because it has a basic timeline without an excessive number of cutscenes and story noise. Never a dull moment in this game, and there are difficulty settings to suit any racer's skill level. In Career mode, you feel like you actually make progress, and in Arcade mode, you can have the same amount of fun without messing up your career. Recommend for anyone who is looking for a great arcade racer.",
            "review_score": "1"
        },
        {
            "review_text": "Very much like the first game, if you liked that one, you'll like this one",
            "review_score": "1"
        },
        {
            "review_text": "One of the best racing games I've played in a while, and I only got it for 8 bucks! I definitely recommend this one to racing fans everywhere",
            "review_score": "1"
        },
        {
            "review_text": "Simply an amazing great experience of playing a racing game like this with a huge speed sensation while racing! the only bad thing is there isn't a cockpit unless you go for the mods...and i would love to see more tracks like London or Madrid for example...but, overall is a wonderful game you can't skip, especially if you're into racing games!",
            "review_score": "1"
        },
        {
            "review_text": "A-Maz-ING!!! The best game ever! Well, not ever. Could do with a cockpit view but, meh! It's great otherwise!",
            "review_score": "1"
        },
        {
            "review_text": "Racing games are hard and i suck at them but atleast they look good.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun racing game, but don't expect it to be a realistic driving experience.",
            "review_score": "1"
        },
        {
            "review_text": "Things I´ve learned from this game:  -Japanese cars are always faster than any other -Drifting the ideal raceline is faster than normally driving it -If you´re driving according do normal rules (DTM, F1 p.ex.) you´re not gonna win. Car to car contact is needed, although it will affect the performance of your car-&gt; you´ll have to learn your car carefully. That´s probably the reason why my most used car is the Nissan Silvia S15 or the BRZ untill now (WSR Season 2) through all the events where i could choose my car. (Tip: BRZ for racetracks, Silvia for 'Street Races') -Drifting needs a lot more driving skill than NFS said. -Don´t play racing games at night time; You ARE gonna rage at the A.I., I promise; speaking of my own experience right now :D Still a very fun game for casual racer guys. If you are into simulations, I´m not really sure, it is pretty realistic but you can obviously trick the physics somehow by going sideways. I turned off all help and stuff with only 5 resets or something, but still it seems to have wider limits than a sim.  Overall it´s still a great balance between arcade and simulation and I love it. I like race games like NFS, but NFS has gone to whatever the ♥♥♥♥, maybe ♥♥♥♥ or something and Grid2 just feels really like I think racegames for casual gamers should feel. So if you´re tired of too much realism or tired of NFS because NFS is ♥♥♥♥, this is the game to go with, although there are no cops in it.",
            "review_score": "1"
        },
        {
            "review_text": "Nice Racing Game",
            "review_score": "1"
        },
        {
            "review_text": "The car game I´ve been awaiting for... Just makes Forza Horizon bites the dust",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite racing games for sure. i was looking for a really good NFS but was getting mixed reviews.. this is like NFS and a slight bit of Forza but definitley closer to NFS. The physics of this game are fenominal not to mention the graphics are crystal clear (macbook pro retina display). definitly a great buy",
            "review_score": "1"
        },
        {
            "review_text": "Stop making me drift whenever I make a turn.",
            "review_score": "-1"
        },
        {
            "review_text": "it's good. Not enough cars, you'll have to buy it with your real money.",
            "review_score": "1"
        },
        {
            "review_text": "Damn, I love this game! A fun career mode, clean retry system, and a relly pretty graphics.  The cars may be a bit on the more arcade side, but its nice they included a satisfying damage visuals. The options let you customize the game to your feel and the car painting is fun too. Easy to use and very hard to come out with a ugly car... unless well you have to eye for design.  I got it on sale and it was completely worth it, even for 30 bucks its not bad either. Looking into picking up some of the DLC",
            "review_score": "1"
        },
        {
            "review_text": "You can't play with Logitech GT unplayable. It have nice graphic the sound is good.",
            "review_score": "-1"
        },
        {
            "review_text": "Lap a racer, i get last... 11/10 would not buy",
            "review_score": "1"
        },
        {
            "review_text": "Offers a great sense of speed and isnt packed full of LAMBOOGEENEEZ and BOOGAADEEZ. It actually has some decent cars like the silvia and E30. However the online is completely dead so consider that when purchasing.",
            "review_score": "1"
        },
        {
            "review_text": "great game get it and play with me",
            "review_score": "1"
        },
        {
            "review_text": "Very much like the first game, if you liked that one, you'll like this one",
            "review_score": "1"
        },
        {
            "review_text": "Very good racing game, arcade physics with a track setting, a bit like nfs shift",
            "review_score": "1"
        },
        {
            "review_text": "Even after placing first in the qualifying races and being number 1 in tournament points, you still start towards the back of the pack just to force increased difficulty instead of making it a hard fought race, it just ends up being you weaving the bad drivers to catch up to the 'featured driver' who always starts frist on the grid. Not only is this frustrating(lowering the difficulty makes it much too easy) it distracts you from the game and takes you out of the world it so desperately tries to emerge you in.",
            "review_score": "-1"
        },
        {
            "review_text": "that's feeling of speed",
            "review_score": "1"
        },
        {
            "review_text": "I feel like I am driving semi trucks half the time",
            "review_score": "-1"
        },
        {
            "review_text": "pretty good... not my cup of tea though.",
            "review_score": "1"
        },
        {
            "review_text": "I managed to slide on my roof 5 seconds into my first race on even ground. Basically I´m awful at racing games but i managed to laugh my ♥♥♥ off for 2 hours in multiplayer nevertheless.  Solid racing game, hilariously funny if you suck at it, I´d buy it for 2 euros again.",
            "review_score": "1"
        },
        {
            "review_text": "Grid 2 is one of the best racing games out there. On PC, it runs very smoothly. You can max out the graphics on nearly any modern computer. The graphics are beautiful and i love customizing cars. In my opinion, better that the Dirt racing games.",
            "review_score": "1"
        },
        {
            "review_text": "I haven't played a racing game for hours ever since Hot Pursuit. I love how it brings together simulation and arcade gameplay, so yeah. Pretty good.",
            "review_score": "1"
        },
        {
            "review_text": "Grid 2 is a great followup on the first Grid. Arcade racing at its best. Great buy, if you ask me! :)",
            "review_score": "1"
        },
        {
            "review_text": "It Is a fun fast paced arcade style racing game!",
            "review_score": "1"
        },
        {
            "review_text": "Grid 2 falls way behind either Gran Turismo or Forza in terms of vehicle control, its unresponsive and sluggish compared to the first Grid which I'd rather play than this. After playing Grid 2 I have serious reservations about buying and playing Grid Autosport",
            "review_score": "-1"
        },
        {
            "review_text": "It manipulates user's play badly. Super mario is better to recommend than this.",
            "review_score": "-1"
        },
        {
            "review_text": "10/10 This is the best racing game I've ever played. The realistic car controls feel great, making the races much more difficult than Burnout, Forza, or Need for Speed. The campaign is the best of any racing game ever, because it not only feels more realistic, but it offers variety and options of how to do it, with many extra features. The online play is well-made, really the CS:GO of racing. It's quick, punishing, and requires honing your skills. No mouse support does drag this otherwise amazing game down, along with it being a bit of a CPU hog. Don't get me wrong, it runs, and has good graphics, but the graphics to memory ratio isn't great. Overall, I can't recommend this game enough.",
            "review_score": "1"
        },
        {
            "review_text": "An awesome game that I really enjoy playing! The story is nice, the gameplay is nice, overall I would reccomend this game !",
            "review_score": "1"
        },
        {
            "review_text": "Controls are horrid, physics are terrible, and thinks that going sideways is the fastest way to go around a corner",
            "review_score": "-1"
        },
        {
            "review_text": "this game is terrible: -its hard to control the car, every car is like the roads are covered in ice.  -limited amounts of flashbacks -the menus, ugh -No music, come on.   pros: great graphics, but that's it.",
            "review_score": "-1"
        },
        {
            "review_text": "After buying GRID 1, I feel like I should change my opinion about this game.  Compared to GRID 1, this feels like the Shortened Version of GRID 1. No cockpit view, the narrator is terribly tedious, less cars, extremely lack of car customisation. AI in both games are stupid, but since GRID 2 is newer, I really expect the AI to be a lot better, nope, not one bit however. This game is not a racing simulator anymore, its just an arcade racing game, unrealistic. The money system is replaced with a fan earning stuffs. It's not really fun you cannot use the fans you earned to do other things like buying vehicle, it's pointless.  This game is really good; I really tried to like the game, got all DLCs, but no. It lacks too much thing in the game, and I refused to like the game. Buy it only when it's on a huge sale.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a really good, solid racing game. GRID 2 is fast-pased, speedy and exiting driving experience. I never imagine that passing someone would be so much fun! The driving is thrilling and racing makes you sit on the edge of your seat. The graphics are a big plus too, beautiful landscapes and lens flares look really astonishing. Unlike getting more exp you get more fans, which is pretty unique and fun thing to have. The whole athmosphere of the game is so uplifting and, in a sertain way, relaxing that it had to be mentioned. If there would be any bad thing to say about this, it would defintelty be the difficulty of this game. This is a quite hard racing game even in a most easiest settings, especially for those with no racing game experience.  Other than that, GRID 2 is easily above average racing game, with fantastic graphics and athmosphere.  3/5 The scenery was so beautifull that i accidentaly drove of the cliff",
            "review_score": "1"
        },
        {
            "review_text": "If you want a good racing game buy ''Racedriver Grid'' and not Grid 2 or 3 !!!!!!!!!!!!!!!!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "worest game ever when it comes to relatity - complete joke",
            "review_score": "-1"
        },
        {
            "review_text": "No cockpit view, but great graphics and easy to use arcade stlye handling and physics make this game fun!",
            "review_score": "1"
        },
        {
            "review_text": "The graphics are better than Grid1 but the gameplay is pretty similar while driving but with less choice in what sort of races you do. Grid gives a alrge choice in the events to do next, grid 2 makes the choice very limited.  Also it keep crashing for me. I win a 3 stage event then the game crashes on the results page. After restarting you are classed as DNF on the event and have to do the whole thing again.  Buy grid 1 instead. The graphics are not quite as good but it's cheaper, is a great game and it doesn't crash all the time and cause frustration.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game. Enjoyed a lot.",
            "review_score": "1"
        },
        {
            "review_text": "It was one of my favorite racing games until I reached the end-game part. Towards the end, it gets very repititive. A complaint I often see with this game is the handling, like how all the cars are so extremely drifty and what not. I was able to deal with this and I for the most part mastered the controls, but near the end all you're given are supercars which are just AWFUL to drive. I get that it's an arcade-y video game, but these cars are just a chore to control. I used to enjoy this game greatly, but nowadays I just can't play it without getting angry at the awful controls the supercars have.",
            "review_score": "-1"
        },
        {
            "review_text": "this sucks more than the demo",
            "review_score": "-1"
        },
        {
            "review_text": "good game, love it, would buy if there's another game like that, or if they just relesed Grid 3.",
            "review_score": "1"
        },
        {
            "review_text": "The feel of the cars is great and accurate for each type they are classified in, but the selection is extemely lacking without buying a cash grab DLC to play anything other than small handful of cars in the base game.",
            "review_score": "-1"
        },
        {
            "review_text": "After a few hours (~50-60 hours) I think could write a review for this products too: I Love It and hate it. Multiplayer easily can ♥♥♥♥ off [there are soooo many wreckers].  //After 1220 hours: sadly nothing's changed - german cheaters, wreckers and anti-fair players... //But --- SOMETIMES! --- we have a good times with good &amp; fair players in the lobby. That's why I stayed in this community yet.",
            "review_score": "1"
        },
        {
            "review_text": "this game is too much fun i just wish i could get it to work with my G27",
            "review_score": "1"
        },
        {
            "review_text": "Cannot recommend this game enough - brilliant progression with an unusual storyline for a racer. Very good.",
            "review_score": "1"
        },
        {
            "review_text": "Great racing game, arcade style with plenty of cars and nice challenges. Good graphics and nice race tracks.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best ARCADE racing games I have ever played in my life like NFS underground. The physics are better than NFS games. Online &amp; Career modes are really enough. If you want an ARCADE racing game, this is the best. If you are looking for a real racing simulation game just get F1 series such as F1 2013. Thanks to codemasters for building these games!  MAC OS X NOTE: If you buy GRID 2 Reloaded version you could face a problem during game such as 'damaged downloadable content'. The solution is easy. Close your steam application. Clean caches in your SAFARI via develop menu in SAFARI. After then, open steam and right click to GRID 2. Click properties and open local file tab. Click verify cache. Finally, restart your computer and it's done!  Have Fun!",
            "review_score": "1"
        },
        {
            "review_text": "Gave myself the nickname 'Bird'. ♥♥♥♥ing beautiful.",
            "review_score": "1"
        },
        {
            "review_text": "Really enjopying this one. Good graphics and game paly.  COuld do with a little more damage when you hit a wall/another player  But good fun all the same",
            "review_score": "1"
        },
        {
            "review_text": "Been wanting a decent racing game for a while, so I got this whilst it was on sale. This is by far one of the best games I've purchased in ages! I'm going to play this so much!",
            "review_score": "1"
        },
        {
            "review_text": "GRID 2 combines both an arcade and simulation style racer creating a unique, intutative and responsive control system. The cars are fast, pretty and there is an element of cusomization eg. color, wheels and my favourite... wheel size :D Looks amazing, plays amazing and there is lots of content 9/10",
            "review_score": "1"
        },
        {
            "review_text": "moost unstable racing game ive played, highly iritating -_-",
            "review_score": "1"
        },
        {
            "review_text": "Grid 1 is 10x the game this is, don't waste your money.",
            "review_score": "-1"
        },
        {
            "review_text": "Great racing game, interesting ideas, good progression and story. Game is hard, and has no cockpit view (personally I don't use that view so wasn't a factor for me), physics are great, its inbetween a sim and arcade, feels perfect to me when going from a bathtub like a charger to a import tuner the game changes and is done right IMO. Won't regret it especially with all the DLC's and if you can find it on sale its a must have.",
            "review_score": "1"
        },
        {
            "review_text": "worst racing game EU",
            "review_score": "-1"
        },
        {
            "review_text": "its a funny and good game for racers",
            "review_score": "1"
        },
        {
            "review_text": "A good balance between arcade and simulator. Good graphics.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun thus far. A bit arcady but overall worth the price I got it on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Bought it because I enjoyed the first one install it as well as all DLC go to play finish first race fine go to play second game closes try a few more times game closes before it even starts google fixes turns out has problems with certain keyboards switch keyboards lets me start second race than causes my PC to blue screen and fixes in sight complete ♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "Grid 2 is a fast paced and exciting racer, a great combination of Simulation and arcade style racing games. The graphics are beautiful and the audio is life like!  There are a lot of challenges the game has to offer such as no car driving assists, no racing line and a difficult AI. However the game does lack in two areas I find important, buying your own cars and then upgrading their performance is non existent in single player, you earn you cars by completing races and you are limited in which cars you are able to drive for each race.  As for multi player I have spent a lot of time on this and find it really enjoyable, the race types are a lot of fun and it is easy to join a lobby. Sadly until you hit level 30+ other players often dominate the lobby because you're not able to start upgrading cars until you reach certain levels which can take quite a lot of time, and unless you download the DLC packs to get other cars you will not be very competitive until higher levels but still it provides hours of entertainment. Demolition derby can be hilariously funny and in a full lobby it can prove to be really challenging but also really entertaining. However there is only one car to use, two tracks and it is quite buggy. Rating 4/5  +Beautiful Graphics +Great sound effects +Multi-player is Social and a lot of fun! +Career is entertaining and doesn't get boring  -There is always 1 or 2 cars in each tier that are much better than the rest -Until you hit level 30 in Multi-player you will not be competitive",
            "review_score": "1"
        },
        {
            "review_text": "A pretty solid single player racer with sweet eye candy and a lot of nice and varying tracks. As in every Codemaster racing game there may not be a huge amount of tracks and during the single player campaign it might get a bit repetetive but in a nutshell the game stands a solid ground.   For multiplayer, unfortunately, many of the tracks, especially the 'tube' ones are very narrow and the game is harsh with punishing small errors or collisions with other drivers, which will ruin the fun, when up to 12 competitors are rallying on the track.  If you want to have a nice single player racer, go grab it. If you seek multiplayer &gt;&gt;fun&lt;&lt; you better get another title.",
            "review_score": "1"
        },
        {
            "review_text": "This game in particular is very fun to play.  Crash your own car, pimp your own ride, drive and win new cars.  The Singleplayer part of this game is quite trilling to do, though I must say drifting still proofs to be difficult for me because I keep overstearing.  I have tried out the Multiplayer part, but I cannot keep up with some of the people who have begon the game since release. If you wish to challenge yourself and others, I would recommend playing Multiplayer after you got a GRIP on the game (Lame Pun.).  ",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good game overall, fast smooth handling, quite acradey but makes for a more fun experience.",
            "review_score": "1"
        },
        {
            "review_text": "Solid racer, but I prefer the more real world race world of the original grid.  I also prefer the cars, tracks and handling of the old game, not to forget the team approach with multiple cars.  Codemasters chose not use real world licenses and ended up with a fantasy race league, which is IMHO again a real step back.  A city race with dynamically changing routes is not believable, as it would be virtually impossible to change a layout while the race is ongoing as is the case in Grid 2. Not that it isn't fun, but again it detracts from the level of realism that was present in the original Grid.  In the end, regardless of some graphical improvements, I just prefer the original over Grid 2 and hope that Codemasters will revert to the same type of game if they ever produce Grid 3.   Good game, but I recommend you look at Grid before Grid 2, unless you want to play multiplayer. Codemasters pulled the plug on the old Grid MP, not very nice of them...certainly not a long term selling point.  ",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ realistic racing games. The slightest tap of the brake causes me to spin out. Bumping into another racer causes you both to spin out. I haven't finished a single race online. This is pathetic.",
            "review_score": "-1"
        },
        {
            "review_text": "A good classic racing game. Kinda simple with lots of fun and lots of sweet wagons.",
            "review_score": "1"
        },
        {
            "review_text": "Better visuals than the first, but the cars are way to drifty. An american muscle car e.g. 1970's Ford Mustang, slight twitch and i'm sideways round a corner, like seriously... and also ruined gamelay with likes. There's no money or co-driver, you don't feel like your progressing or getting better. There's no teams to follow and improve and you acquire cars for free, just for coming first or beating a particular time. I've played for maybe an hour or so and already have 33 cars.",
            "review_score": "-1"
        },
        {
            "review_text": "Better than NFS!",
            "review_score": "1"
        },
        {
            "review_text": "This Is The Best True Racing Game I Ever Played  The Drift................",
            "review_score": "1"
        },
        {
            "review_text": "Great Game!",
            "review_score": "1"
        },
        {
            "review_text": "All in all, pretty good.   I have to admit that the game has been a little glitchy, with my rig crashing an average of once every 45 minutes, but for some reason I keep coming back. Anti-aliasing settings seem to be part of the problem, and once I dialed them in a bit it seems to run a lot better now.  There is something about the ambience, the quiet music and the feel of nostalgia. Starting out in your own suburbian garage? A world racing league? It grows on you, fast. The story is not so in-depth that it gets in the way. (I mean you, NFS: Undercover!) Some may say over-simplistic; if you are into being able to control every little setting on your car than this is not for you, but if you like feeling like you are part of the story, than GRID 2 is...",
            "review_score": "1"
        },
        {
            "review_text": "I expected more, and so the first part I liked more than the second(",
            "review_score": "-1"
        },
        {
            "review_text": "What to say about this game. Besides the whole deal around the cockpit view, there's much much more this game doesnt get right. First of all it's a fun game which has good looking graphics that run fairly well on slower computers and has a great destruction model of the cars. This beeing said, the game itself is like a broken record (the same stuff all over again), simply said the single player is like any other racing game, you are trying to be the best racer in a racing league, with the distinction that now you are supposed to be the poster-boy for the racing series, but it doesnt make any difference at all. The multiplayer is where the game is supposed to shine, unfortunately, it isnt true. Even though technically the MP works fine, the people completely ruin the expirience, To explain: most people ram you and grind the bariers around the corners. Simply said, most poeple play it more like Burnout rather than a somewhat serous racing game.  So to sum up, it's not a simulator, it's not an simulator like racer (e.g. the first GRID of the NFS Shift series). It's an arcade racer, I don't recommed it for the full price, you may considder getting the game if it's heavily discounted (75% or more). If you are looking for a fun arcade racer, get it, if you are looking for a simillar expirience like the first GRID, get GRID or NFS SHIFT 1 or 2.  I'm still recommending the game as it's fun when all it's elements work, and I enjoyed it except for the occasional frustration in multiplayer.",
            "review_score": "1"
        },
        {
            "review_text": "Great game with alot of features, but the multi-player is hard to navigate around, as you cant really choose what game mode like the first grid, but great graphics and 'story' mode. Overall very good, needs a little bit of work in multiplayer.",
            "review_score": "1"
        },
        {
            "review_text": "Fun, exciting and still enjoyable after a year. great visuals and fast racing with some beauttiful cars. Great tracks and awesome multiplayer. Cannot wait for its 2014 sequel: Grid Autosport. Grid 2 is great",
            "review_score": "1"
        },
        {
            "review_text": "It's a very enjoyable racing game, but has its ups and downs. I actually got into the original GRID very late, having picked it up on sale a few months before I bought GRID 2. The handling and the gameplay is very similar in both titles, even the drifting, in my opinion. Yes, there is a lack of in-the-seat first-person perspectives, which is a shame (even though there are no-car 1PV and over-the-hood 1PV); though to be honest I have always been a 3PV player when it comes to racing games so it was of no consequence to me.  The base price of the game is steep, though, as is the $30+ for the DLC. I picked up both during the Steam Christmas sales for a total of ~$25, which I think it a fantastic deal.  The campaign mode is a lot more linear and simplistic than the original GRID, though. You no longer have the ability to hire on an additional driver to your racing team, which is something I miss. Rather, you essentially just beat other racers to gain popularity for Callahan's World Series Racing ... thing. And then beat them again the the actual WSR. The AI in the single player is pretty simplistic as well, and follows very predictable driving lines (and will predictably crash into you without a care in the world), and usually brake far too early. Getting through the campaign on normal difficulty will make you better than a lot of the players you find in multiplayer though &gt;.&gt;  The multiplayer is a whole other deal. You buy cars with money you win in races, which is fine, but unfortunately there's also a leveling system applied. And it's VERY much a grind. I've been playing a lot since I got the game ~3 weeks ago, and I'm only at level 12 of 99. You can't even start unlocking Tier4 cars until you hit level 20-something, so prepare to play Tier1 and Tier2 a lot, unless you're happy with crappy loaner cars in T4 (or... buy DLC). It will take you something like 20 races just to get to level 2. Thankfully, there is also an enjoyable Global Challenges system that will give you a needed XP boost, but it only cycles weekly. DLC can give you an edge, but at the same time hosts of custom games can just turn DLC off, so ... yeah.  Speaking of DLC: Yes, I picked up the All-In DLC pack while it wa on 66% off, which was a good deal. Here is my general take on the packs: - The Spa Francorchamps pack is worth it for the track alone. Haven't had much time with the cars to make an opinion on 'em. - The Bathurst track pack is kind of meh. - Demo Derby is fun and free. - Peak Performance Pack looks like it's a bad deal, but is actually decent. In the MP, you can upgrade cars to make them perform better. If you upgrade them fully, they get ranked a Tier higher than usual. The Peak Performance cars are all Tier1 cars upgraded into Tier2, BUT these DLC 'performance' cars actually perform a bit better than their counterparts if they get fully upgraded. Thus, a fully upgraded Volkswagen Golf R in Tier2 will be slightly worse than a 'Golf R (Performance)'. Additionally, some of these cars are ones you'd want to have in both tiers anyway. - The Classic Grid pack gives you two very enjoyable Tier4 cars from the original GRID, but I'm not convinced that they're necessarily better. The DLC Koenigsegg CCGT is significantly slower than the Koenigsegg Agera R (which is the fastest GRID2 car in the game). Not bad cars, though. - The IndyCar is pretty nice, but you're not going to find a lot of ppl using it much. - No opinions on the rest.",
            "review_score": "1"
        },
        {
            "review_text": "This game has to probably be one of my favorite games, it's super addicting, and amazing, and I love it! Also it is one of the few racing games where I'm actually paying attention to the story.",
            "review_score": "1"
        },
        {
            "review_text": "It's fun arcade racing game. Cars are very slidey and you need to drift most of the corners if you want to play optimally. Some people don't like it but I find it very satisfying to pull off series of turns while drifting perfectly.  Singleplayer is racing on different tracks with few special events dropped here and there. It's nothing special.  Multiplayer is where this game shines. You have experience level and you get money from races. You buy new cars with in-game money. If you're just starting out you're in bit of a disadvantange because you can't use all cars. Once you're about level 30 you'll have access to all the cars you will ever need. Multiplayer works fine and there aren't any lag issues. It's fun with many people but can get crazy if you have collisions enabled. Most of the matches don't have rammers and even if you get rammed in the beginning you can usually recover if you're a good driver. There are still many players during evenings. If you can't find any matches you need to change you steam download region to London. I think it's the best multiplayer arcade racing game on PC at the moment.  That being said I can't wait for GRID Autosport. I expect this game to die once it's released.",
            "review_score": "1"
        },
        {
            "review_text": "A great game! If you enjoy racing games, this game is perfect!",
            "review_score": "1"
        },
        {
            "review_text": "its asam thank you ",
            "review_score": "1"
        },
        {
            "review_text": "Fun game great graphics. Don't expect to play online though. Servers are still up but nobody is ever on.",
            "review_score": "1"
        },
        {
            "review_text": "Wow Great. i fun a lot.",
            "review_score": "1"
        },
        {
            "review_text": "Can I get a refund? This isn't even fun. GRID original was ten times better. There isn't even a cockpit view?? What a waste of money.",
            "review_score": "-1"
        },
        {
            "review_text": "Really great Racing game, but no cockpid view. How lame. Still this game is Worthed to buy and play.  72/100- I expect more",
            "review_score": "1"
        },
        {
            "review_text": "A race simulation? Not exactly, but codemasters has delivered the same high-octane race game that grid was known for, only better with a better looking UI and better thinking AI.  This is a very good sequel.",
            "review_score": "1"
        },
        {
            "review_text": "Very good racing game, arcade physics with a track setting, a bit like nfs shift",
            "review_score": "1"
        },
        {
            "review_text": "Very good driving simulator, takes skill to perform well in this game",
            "review_score": "1"
        },
        {
            "review_text": "Solid racing title. Feels a bit arcade-ish at times, but nothing that ruins the game. With out a doubt a good 'AAA' title for racing.",
            "review_score": "1"
        },
        {
            "review_text": "Focus ST. That is all.",
            "review_score": "1"
        },
        {
            "review_text": "GRID 2 is amazing racing game! Way better than NFS'series...",
            "review_score": "1"
        },
        {
            "review_text": "3 *** As a racer I like it, really its a good game. I can't help but feel like they could have done more with it. Eh well still its good and I like it.",
            "review_score": "1"
        },
        {
            "review_text": "Entertaning , and completely worth the money I spent on it. It's not perfect, and does have some annoying probelms with both single and multiplayer. I ampleased with graphic performance based on my system specs. I do wish there was a better selection of vehicles.",
            "review_score": "1"
        },
        {
            "review_text": "decent game good graphics but am unable to save my game so it is useless dont waste your money or time with this game",
            "review_score": "-1"
        },
        {
            "review_text": "It's back and it's amazing! Driving is a little more arcadey than previous games, but it's still awesome! The online is phenomenal, hope more people buy this amazing game!",
            "review_score": "1"
        },
        {
            "review_text": "I managed to slide on my roof 5 seconds into my first race on even ground. Basically I´m awful at racing games but i managed to laugh my ♥♥♥ off for 2 hours in multiplayer nevertheless.  Solid racing game, hilariously funny if you suck at it, I´d buy it for 2 euros again.",
            "review_score": "1"
        },
        {
            "review_text": "Very good graphics great gamepay",
            "review_score": "1"
        },
        {
            "review_text": "This game is great for everyone, and even if you don't like drifting, you will love this drifting game, it is endless fun and even funner with a friend.",
            "review_score": "1"
        },
        {
            "review_text": "One of my favourite racing games. I love it. You can choose many different cars which are divided in four classes.",
            "review_score": "1"
        },
        {
            "review_text": "no cockpit view and all time on traction control!! Drift on FWD Cars&amp;!?!?!?!?",
            "review_score": "-1"
        },
        {
            "review_text": "Even if it's not as good as the first GRID, it's still a very good arcade racing game. Worth to buy at steam sales.",
            "review_score": "1"
        },
        {
            "review_text": "worst racing game EU",
            "review_score": "-1"
        },
        {
            "review_text": "Best racing game ever, single plater and online well worth the £7ish pound for game and all the DLC but hurry offer ends soon",
            "review_score": "1"
        },
        {
            "review_text": "I really like this game i give it a 9 out of 10",
            "review_score": "1"
        },
        {
            "review_text": "I am not usually a racing game guy but this game is definitely worth a look. Its realistic enough to keep the hardcores happy and easy enough for casuals to jump in.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game pretty good deal for $12.49 couldn't pass this Racing genre. Great Graphics, gameplay, cars, but I still miss GRID 1's original cockpit view as to the 2nd version lacking it :( Just a way of lazyness on the developers part. They took it out using a 1% users use cockpit view shouldn't matter it's a racing game all racing games should have this view no questions asked. Multiplayer is a blast especially bringing back Destruction Derby. Single player would be ok if they didn't make the opponents over powering like when you want to make them wreck they have way too much power over you from making it possible you either have to go 100mph to side swipe them to even get into any collision, other than that good luck trying at any other speed, please make this an option or fix, thank you. Other than that the game is worth the money especially the sale we had.",
            "review_score": "1"
        },
        {
            "review_text": "love it. best racing game out on pc right now. until project cars that is. we shall see though.",
            "review_score": "1"
        },
        {
            "review_text": "I hate racing games but there are 2 series out of that gerne that i adore. Dirt (not the showdown crap) and Grid. Fastpaced, lots and lots of cars and tracks, multiple categories, amazing graphics and addictive gameplay. Nothing comes without flaws though and there are a couple technical mistakes in Grid 2. Is it worth 45 euro (reloaded edition), probably not but you can find it in steam sale for a LOT less. Would recommend!",
            "review_score": "1"
        },
        {
            "review_text": "Nice Game.",
            "review_score": "1"
        },
        {
            "review_text": "it's a pretty cool game, and will be even better if you have a steering wheel. :)",
            "review_score": "1"
        },
        {
            "review_text": "I have spent many years playing racing games from the arcade style Need for Speed series to the in depth Gran Turismo series, which is by far my favorite. I no longer play console games, I'm strictly PC. That means I'm searching for a game which can satisfy my Gran Turismo need. I own several racing games for PC such as Grid 1, Shift 2, Dirt series, Need for Speed, and I only use an Xbox One controller. Grid 2 has become my goto racing game when I have time to sit down and spin some tires.  I have heard that Shift 2 is better, but so far I have not been able to get into it. After work and time with my family, I don't have a lot of time for gaming. So when I finally have a moment to race, Grid 2 is where I turn.   Gamepad control works well, it is challenging enough to keep me engaged while not being so realistic that I get frustrated since I don't have a wheel. The visuals are excellent and that includes vehicle damage. Plenty good enough to please my tastes.",
            "review_score": "1"
        },
        {
            "review_text": "Original Grid was very hard for me, handling wise. But found this one just right for me. Game looks great. Driving feels good. DLC content seems too much spread over multiple DLC's, but I got Reloaded Edition during Summer Sale, so not much complaint about that. But still cars in 1 DLC, tracks in 1 DLC should would have made it much better. ",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME IS SO BAD LIKE OHMYLORD YOU CANT EVEN GO INTO COCKPIT VIEW LIKE M8 WAT. THE FIRST GRID IS A BILLION TIMES MORE GOOD. THX 4 LISTENING",
            "review_score": "-1"
        },
        {
            "review_text": "Got four cars in less than an hour and they all feel about the same. GT2 and GT3 on the playstation were so awesome they've ruined me from all other racing games out there so far. Also, wtf is up with you starting out in a massively torquy RWD car for the first races when you're trying to get the feel for the physics in the game? Stupid. Start players out in an AWD or something and then go from there.",
            "review_score": "-1"
        },
        {
            "review_text": "A fun,challenging racing game with a good leveling system, only problem is that there is rarely anyone on the servers which you need for some unlocks.",
            "review_score": "1"
        },
        {
            "review_text": "4/10 This game can be very fun, but the AI can not detect you AT ALL, they will brake when they are in front of you, so you can not move, they will smash into you with full force when they want, sometimes you can not even finish a race because the ♥♥♥♥ing stupid AI can not detect you, this game took a lot of effort, but when it came to the AI they did no work at all, oh I forgot to mention, online servers are only in your area, not public, so you can never find anyone online unless you live in the UK or USA. However this game can be tremendously fun arcade drift racer, and if you know how to do good handbrake turns, you will dominate ... oh nevermind, your drift was ruined by the ♥♥♥♥ing AI who is braking at the wrong time as ussual, however if you have a lot of patience, this game will be the best racing game ever. Changng dificulty makes almost no difference at all, because you cant finish the race because of the AI in front of you",
            "review_score": "1"
        },
        {
            "review_text": "Multiplayer system -1",
            "review_score": "-1"
        },
        {
            "review_text": "best racing game",
            "review_score": "1"
        },
        {
            "review_text": "The most fun race game i have play try it :)",
            "review_score": "1"
        },
        {
            "review_text": "I feel like I am driving semi trucks half the time",
            "review_score": "-1"
        },
        {
            "review_text": "One of the good racing games. I play this when i get bored in NFS world. I like the simulation of this game.",
            "review_score": "1"
        },
        {
            "review_text": "It's what happened if Namco commissioned Codemaster to make RR: Unbounded, left it halfway and then kept on developing it.",
            "review_score": "1"
        },
        {
            "review_text": "great game get it and play with me",
            "review_score": "1"
        },
        {
            "review_text": "If you remove everything driving-related from GRID, and add a storyline - then you'll get GRID2.",
            "review_score": "-1"
        },
        {
            "review_text": "Flashback is not available in real life.  8/10  nice substitute for dirt 3, which is not playable atm",
            "review_score": "1"
        },
        {
            "review_text": "I remember Grid 1 being a lot of fun. This on the other hand feels... very new age tween gamer.  Twiddling with the forced intro race, and trying to setup a Simraceway wheel (which was unmanagable), the entire grid finished the small circuit before I even started moving... and yet when I finished I received that annoying poitive reinforcement nonsense that is the reason why kids today are self entitled morons. Horribly late finish = OMG, that was amazing, all eyes were on you, that generated so much interest.  Forced, unskippable cutscenes = Check Decent though generic to Codemasters handling = Check (didn't feel engaging like Grid 1 did at the time)  And the visuals... lens flared street lamps during the day? That's just a cheap way out to add bells and whistles to an otherwise overglossed and unbalanced/unrefined art style.  All of those things are initial markers of what the game really is. Disposable and forgettable. I've played more than enough titles over the years to know that feeling of mediocrity at the start of a game that is just going to stay mediocre, at best.... and this is one of them.",
            "review_score": "-1"
        },
        {
            "review_text": "Amazing!!!! Best racing game out there!!  Get it and you won't regret it, even when your ♥♥♥♥ this game is fun xD ",
            "review_score": "1"
        },
        {
            "review_text": "great game kinda hard but you'll learn",
            "review_score": "1"
        },
        {
            "review_text": "Tried it on the free weekend. All was well untill after I finished the indie race. Then just a black screen while the game was playing in the background. Look in the forum and could see a lot of players with a similar issue and little in the way of help from CM. Shame as I really liked the original Grid which I had no problems with. Will go back to that I think. Anyone considering getting this I'm sure its a great game if it works. My advice to you is to try it first and possibly save yourself some money and grief. Disappointed in CM given their past successes.",
            "review_score": "-1"
        },
        {
            "review_text": "best car graphics 10 out 10 ign game of the year",
            "review_score": "1"
        },
        {
            "review_text": "Very Great Game,i've played a lot while the game was free,and from what i see the game is awesome :D  the pleasure of doing amazing drifts,high speed (Fact),and playing online with your friends is an awesome experience.I Highly recommend this game.  I'm Brazilian :P",
            "review_score": "1"
        },
        {
            "review_text": "The driving is fun, but there are too many boring, un-skipable cut scenes.",
            "review_score": "1"
        },
        {
            "review_text": "Of all the games that I own, I can't run this even on Ultra Low. Check my games if you want, you'll see that the majority of them have better graphics than this game, and I run them on Ultra/High. This game is broken, do not buy.",
            "review_score": "-1"
        },
        {
            "review_text": "very nice graphics. real time controls. lots of diversity in game.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game! Especially if you are playing with your friends and not only driving to win, but also destroy eachother and have fun!",
            "review_score": "1"
        },
        {
            "review_text": "doesnt work with controller",
            "review_score": "-1"
        },
        {
            "review_text": "Hey, would be a nice game except it crashes every 15 minutes without fail. No solutions available online. Oh, and since some of the events are multi-race you've got almost no chance to proceed through the game. So pretty bloody annoying really.",
            "review_score": "-1"
        },
        {
            "review_text": "A Great Game! It Moves fast. Found one issue in grid 1 it tells you when to brake but in grid 2 does not.",
            "review_score": "1"
        },
        {
            "review_text": "awsome game when i played it :) shame the weekend was so short :D nice driving not to hard but still not to easy :) right on the go",
            "review_score": "1"
        },
        {
            "review_text": "My controller stopped working right when I got this game, so my race experience was worse than buttered sandpaper. By the way, I got eigth place on the tutorial level, and that was the tutorial... This game kind of expects you to have a controller. If you come across this game, move off the grid (see what I did there) into Southern Antarctica.",
            "review_score": "-1"
        },
        {
            "review_text": "Another great Codies racer.",
            "review_score": "1"
        },
        {
            "review_text": "Sadly, game crashes on loading screen. Barely could play and tried everything. People with new system and windows 10 should aware of that.",
            "review_score": "-1"
        },
        {
            "review_text": "10/10 Would hit tree at 90 mph again.",
            "review_score": "1"
        },
        {
            "review_text": "Boy am I glad I did not buy this game when it was first released, I bought it today and only paid around $7.50 for the damn thing and as far as I am concerned I wish I had not even spent this amount on it. I am new to racing games and this one was a very poor choice for me even at the 7 dollars spent for it. The reason? There are no tutorials or practice sections in the game. When you first start the game you are put right in a race, no time to even figure out how to drive the damn car etc. It is probably ok for an experienced gamer who has played a lot of these race games but stay away if you are new to race games. Even though I paid for this I am going to uninstall the local content so it does not take up storage space, I only wish there was a way to permanently remove the game entry in my game library and if I thought I stood a chance of getting a refund I wold ask for one.",
            "review_score": "-1"
        },
        {
            "review_text": "Gave myself the nickname 'Bird'. ♥♥♥♥ing beautiful.",
            "review_score": "1"
        },
        {
            "review_text": "Been playing for about 100 minutes (1 hour 40 minutes) when writing this, and I'm loving it! I was hoping for a game that you started off with a bad car and upgraded it over time, and that you get fans so quickly and easily, not really realistic. Still love driving as a whole in this game and drifting! :) I recommend it if you like racing games (obviously!)",
            "review_score": "1"
        },
        {
            "review_text": "Really fun game, especially if you have a wheel.",
            "review_score": "1"
        },
        {
            "review_text": "you must buy this game",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. It is so mush fun",
            "review_score": "1"
        },
        {
            "review_text": "*shrug*  I played it for a bit. I'm not usually one to take chances on racing games, but I picked it up as part of a bundle thought I'd give it a go. Played with a controller, maybe it would have been better with a wheelthing?  At any rate, the cars just don't feel fun to drive. The controls felt kind of loose, and generally sluggish, maybe it gets less bad as you unlock other cars?",
            "review_score": "-1"
        },
        {
            "review_text": "Played the crap out of this game on PS3! To me, Grid and Grid 2 are 10x's better than any of the Need For Speed Title. They just bring so much content to racing thats different and how it's delivered is what keeps me coming back for more. I highly recommend Grid and Grid 2. The racing is fun with just the right challenge. Grid Autosport doesn't know if it wants to be an arcade racing or racing simulator. Just stick with 1 and 2.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome, more cars, more tracks, more fun",
            "review_score": "1"
        },
        {
            "review_text": "Grid 2. Genre: Racing, Simulation, Arcade  Pros: -Physics -low system requirement -Ability to rewind -challenging  Cons: -Drifting is not really satisfying -Small car customization (you can only change the rims and add vinyls to your car)  Summary; This is a great racing-sim game, its not really hard for beginner. eventhough there's some drawback this game is recommended to everyone who likes racing-sim games with some arcade aspect  8,5/10",
            "review_score": "1"
        },
        {
            "review_text": "another code masters game with lack of steering wheel support.  I don't buy car racing games to play with my keyboard you know.   I uninstalled after this review. What a disapointment.",
            "review_score": "-1"
        },
        {
            "review_text": "This game s poor you can change paint job but you cant ♥♥♥♥ing tune a car what the hell the ai drives on roads more easy than the player if they bump you,you can spin out of control or crash man f i see anyone that made this game we Throwing Hands!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "GRID, you went all Burnout and DLC on us. Why the ♥♥♥♥ did you go Burnout and DLC on us? You basically took GRID 1 and all it stood for, and spat on it. At least you made things a little better with GRID Autosport. I hope you've learnt your lesson.",
            "review_score": "-1"
        },
        {
            "review_text": "Many people criticize this game for what they wanted it to be, rather then what the game trys to be. This game is arcady drifty slidy physics. Which aren't bad, I enjoy flinging cars around corners sometimes. GRID 2's physics are RELIABLE, if you start drifting and know how to control it, you can do very well. You have to learn the foreign physics model before you can truely do well.  Personally, I like GRID Autosport more since it is a bit more simulatory (?) but I still enjoy a GOOD arcade racer, which GRID 2 delivers.",
            "review_score": "1"
        },
        {
            "review_text": "if you have friends to lay with it is awesome but i would like to see the game where the dont slide out in every corner",
            "review_score": "1"
        },
        {
            "review_text": "So much bad UX! Bad menu! You can't switch cars in online mode only under some mysterious conditions.",
            "review_score": "-1"
        },
        {
            "review_text": "NIce game",
            "review_score": "1"
        },
        {
            "review_text": "First off, this game has decent graphics, and is very easy to run. Gameplay wise it's just like any other racing game and not much differentiates it from other games, the physics, customisation and overall immersion are all quite good, nothing quite stands out about it but I would still recommend the game to anyone who's a fan of racing games in general. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "It's cool",
            "review_score": "1"
        },
        {
            "review_text": "Great racing game, arcade style with plenty of cars and nice challenges. Good graphics and nice race tracks.",
            "review_score": "1"
        },
        {
            "review_text": "Okay, the game is enjoyable if you love drifting and stuff. But like everyone says, the streets seem to be covered with ice. Another thing - no 'first person' which i loved in first GRID And - the thing that makes this review a negative - HALF THE CARS ARE DLC! Come on.",
            "review_score": "-1"
        },
        {
            "review_text": "Kind of fun racing game with a lot of drifting, but my enjoyment is severely killed with how disgustinly obnoxious the AI cars are even on easy difficulty. When they just simply graze my car, I get sent flying to africa, and if I were going full speed into them, they'll stay in the same spot as if they were a VGA cable with screws And they're always on 300 in speed",
            "review_score": "-1"
        },
        {
            "review_text": "Good simulator game but in half this is also the arcade racing game, but after some time in this game I got bored a little bit.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good for a half simulation come arcade themed game",
            "review_score": "1"
        },
        {
            "review_text": "Easy to play and fun as I am a fan of racing games. Got this in Humble Bundle, very good value.",
            "review_score": "1"
        },
        {
            "review_text": "good game, most valuable game bought for now",
            "review_score": "1"
        },
        {
            "review_text": "I did this for the badge.",
            "review_score": "1"
        },
        {
            "review_text": "Really frekin cool game.",
            "review_score": "1"
        },
        {
            "review_text": "Half of my hours are spent just listening to the soundtrack lol",
            "review_score": "1"
        },
        {
            "review_text": "realy good",
            "review_score": "1"
        },
        {
            "review_text": "I was really looking foward to playing this game, but this game really doesn't bother to work properly. It's quite sad to be honest.",
            "review_score": "-1"
        }
    ]
}