{
    "app_id": 443650,
    "name": "Wailing Heights",
    "release_date": "2016-04-27",
    "developer": [
        "Outsider Games"
    ],
    "publisher": [
        "Outsider Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Point & Click"
    ],
    "achievements": 12,
    "positive_ratings": 47,
    "negative_ratings": 7,
    "price": 6.99,
    "description": "A body-hopping, musical adventure game. Trapped in a horrific hamlet of modern monsters, ex-band manager Francis Finkelstein uses the possession wheel to sing his soul into hipster vampires, vegan werewolves and soulful zombies, using their ghoulish powers to escape from Wailing Heights.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/443650/header.jpg?t=1540122052",
    "minimum_requirements": "Requires a 64-bit processor and operating system OS: Windows 7 or higher (32-bit not supported) Processor: Dual-Core 1.6 GHz Memory: 4 GB RAM Graphics: Nvidia GeForce 7600 GT/AMD X1650 XT DirectX: Version 9.0 Storage: 8 GB available space Sound Card: Sound Card",
    "recommended_requirements": "Requires a 64-bit processor and operating system",
    "reviews": [
        {
            "review_text": "This game is so great, its not a fixed comic book game , its totally animated and interactive. Awesome artwork, humour and voice overs together with top audio/music.  The story really sucks you in with its characters.",
            "review_score": "1"
        },
        {
            "review_text": "It's fun, unique, riddled with bugs and inept implementation of nice ideas.   Some game design aspects are very quartionable. For instance, your 'soul' can switch between several characters in game. But to do so, you have to travel to the location of that charater, which takes time. It's absolutely not neccesary and becomes tiring when you have to switch between 4 characters.  Music is great, art is great and for that I can forgive ♥♥♥♥♥♥ programmers job and even more ♥♥♥♥♥♥ sound engineer job.",
            "review_score": "1"
        },
        {
            "review_text": "Although I'd say this game brings outstanding gameplay elements, and offers a genuinely good experience. As of right now, it's much too buggy. I've been sent outside of the map several times, and some times, it can ruin any progression you've made thus far. I'll have to check back in later to see if these glitches have been patched.  Edit: Turns out whatever was wrong with my game, had to do with my FPS. Even though I had a problem, I don't want it to turn anybody off from this game. If you're half interested, just buy it. It's a super fun and entertaining, and the developers seem super cool and on top of things!",
            "review_score": "1"
        }
    ]
}