{
    "app_id": 443810,
    "name": "This Is the Police",
    "release_date": "2016-08-02",
    "developer": [
        "Weappy Studio"
    ],
    "publisher": [
        "THQ Nordic"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Sexual Content",
        "Violent",
        "Adventure",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Management",
        "Story Rich"
    ],
    "achievements": 10,
    "positive_ratings": 5315,
    "negative_ratings": 1096,
    "price": 13.99,
    "description": "This Is the Police is a strategy/adventure game set in a city spiraling the drain. Taking the role of gritty Police Chief Jack Boyd, you'll dive into a deep story of crime and intrigue. Will Jack reach his retirement with a nice stack of bills, or will he end up broken ... or worse?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/443810/header.jpg?t=1532416370",
    "minimum_requirements": "Минимальные: ОС: Windows XP 32 Процессор: Dual Core CPU Оперативная память: 2 GB ОЗУ Видеокарта: Geforce 7800, AMD HD 4600, Intel HD3000 or similiar DirectX: Версии 9.0 Место на диске: 5 GB Звуковая карта: DirectX compatible",
    "recommended_requirements": "Рекомендованные: ОС: Windows 10 Процессор: Quad Core CPU Оперативная память: 4 GB ОЗУ Видеокарта: GeForce 560 or higher, AMD Radeon HD 5800 or higher DirectX: Версии 11 Место на диске: 5 GB Звуковая карта: DirectX compatible",
    "reviews": [
        {
            "review_text": "This game comes loaded with promise. You play Chief of Police Jack Boyd, a hard-boiled old-school cop trying to get enough money to retire and survive a city full of gangs, political corruption, and apathetic citizens. It's very atmospheric, and I was drawn in almost immediately. The voice acting for Jack really helps set the scene, and there are lots of little touches that make the game's world feel real.  At first. *MINOR SPOILERS FOLLOW*    You see, this game gives you 180 days to get Jack to his goal of $500,000. I had met this goal by day 80, and even with some story-related time skips, the game drags and the story gets sparser and sparser until I felt like the developers hadn't had any idea how to wrap things up. Main plot threads are tied up in increasingly contrived manners and the game railroads the player in its final act into a forced binary choice about which corrupt, sleazy individual to support for head of the city. Sure, it lends to the game's dark atmosphere, but by this point the player feels no sense of agency. I was playing like a hustler and a supercop- City Hall loved me, my staff adored me, I made tons of money off the mob only to betray them and break up their operation to the tune of almost half my monetary goal- and then the game says 'No, you suck again. Which one of these two characters who cannot succeed without you would you like to have win rather than you?' I badly, desperately wanted an option to tell them both that I didn't care and wouldn't help either, which would have perfectly fit Jack's character. Heck, even an option to run for mayor myself would have varied things up, maybe given me a chance to call in all the friends and connections I had built in gameplay... but nope, pick your flat Pepsi or sour Coke and watch a final disappointing cutscene.  I'm fine with stories where the protagonist doesn't win, but this is diabolus ex machina of the worst kind. Everything in gameplay was going my way, but the story went its own way and decided that heads I won, tails I lost. If this struggle had been reflected in gameplay and tied in with the overall narrative better, fine. As-is, I got a little bit of foreshadowing and then had the game metaphorically beat me up and take my lunch money.  The ending of a game is important. And this one has a complete lack of respect for the player, its world, and the game as a whole. While I had fun in the first half of the game, the latter half of the campaign is a slog and the story unravels and careens in wild directions. Not worth your money.",
            "review_score": "-1"
        },
        {
            "review_text": "   Pre-Release Version",
            "review_score": "1"
        },
        {
            "review_text": "I'm very disappointed, The reviews are very missleading saying it reminds you of police quest. It does not. Also missleading to say it´s a good cop / bad cop game, you don't really have the choice to be a good cop, the only choice you have is how corrupt you rather be. Being a good cop gets you killed by the 10th day. I was hoping this game would be a police micromanagement game with a nice story-line but in the end it's just a very linear game about corruption and barely any micromanagement. I have to say they did a good work with the graphics and some aspects of the game such as the investigation part where you have to puzzle togueter evidence based on testimonials to get the right criminal. Unfortunately this is just one pro in a large list of cons.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is Suuuuuuuuuppppppppeeeeerrrrrr Disapointing.  In all honestly I loved the game but the ending killed everything this game ever had. It offers decisions that literally amount to nothing. In the end every critical partnership and decision you build up doesnt matter. If you become a good or bad cop it just doesnt even matter cause the ending is always the same when it tells you that you can change that. Thats a lie I couldn't change the ending and I couldnt do anything about it and it infuriates me. This game tells me to pick, it tells me to pick a side, choose who I care for and don't, and in the end the Dev just tell me to go ♥♥♥♥ myself cause it didn't matter.   This game was amazing the build up was perfect. The voice action spot on. It is a beautiful story that crumbles because the Devs thought they had this amazing symbolic poetic message on the whole situation. This is a perfect example of a great game ruined by horrible closure.   Pros - voice acting - really compelling story  - Investigations are pretty cool - Always a twist  Cons  - Endings are functionally the same  - choices don't matter - friends don't matter - gameplay does get boring and repetitive considering how long the game is  - Horrible storytelling at the ending just ruins the game  I don't recommend it if story is the reason you're buying it cause it is honestly not worth it. The ending isn't symbolic it isn't poetic, it isn't a great metaphor for corruption. The ending plain and simple just ♥♥♥♥en sucks.",
            "review_score": "-1"
        },
        {
            "review_text": "[Possible spoilers]  This is long so TL:DR: Buy the game.  What can I say about 'This is the police'?   First let me clarify a few things, I never write reviews. NEVER. I think I wrote one as a joke and that's probably about it. I hardly ever feel strongly enough about a game on steam to write a review about it.   Another thing I'd like to make clear is how big of a fan I am of cop fiction. Crime shows, books and comic books.   When I got home from work the night the game came out I was so happy. I was looking forward to this game so much I went home during lunch and installed it and played the first few days.   I accidentally discovered this game while searching Duke Nukem on steam and finding this because Jon St John voices Jack Boyd.   I don't want to keep this going forever but let me get to the actual review part.   It was a very fun game and I loved every second of it. At first I wanted to play as a clean cop that did nothing wrong. A James Gordon if you will. But soon I realized that wasn't the story that Weappy was trying to tell. I loved what they did with the game. I know that I'm probably bias since I love this stuff so hardcore but.   If you like managment games, if you like cop fiction. Or if you just like a damn good story then this game is for you.   I beat the game last night and I still cannot stop thinking about the ending.  The betrayal and sadness that I felt.   Even though I finished the game, the nights I listened to Holli Scott's 'No good' while in the later stages of the game will be something I'll remember fondly.   To the developer: I love you guys, if I had seen the kickstarter I would have donated without a doubt.   Please keep doing more.   10/10",
            "review_score": "1"
        },
        {
            "review_text": " A breath of fresh air, for the boys in blue.",
            "review_score": "1"
        },
        {
            "review_text": "After nearly 20 hours of playing this game, I have come to this conclusion (I did not finish the storyline, btw.).  What I really love about this game is the ambiance. The art style is minimalistic and very simple, but in my opinion, that only adds positively to the experience. The voice acting is amazing. I will have to agree with some people saying that the lines could be delivered a little bit faster. Fortunately, you can read the subtitles and skip the sequence or the whole scene. What I also like is that you can choose the soundtrack you wish to hear in the gameplay. The music and the art style, the overall atmosphere make this game almost look like a 'Roman Noir', which - I think - the developers were aiming for.  The plot in itself (so far) is intruiging and interesting, altough it can be quite confusing sometimes.  Unfortunately, I have to say many negative things about this game which keep me from giving it a thumbs up. First of all, as many others habe already mentioned, the game gets incredibly repetitive and boring after a while. And quite frankly, I stopped to give a damn about the crimes and cases - I just wanted to continue with the main storyline. In between the story scenes, there was just too much 'nothingness'. Send cops there, send cops there, send cops there, send cops there, and so on. The next point has to do with that: At first, the game mechanics are a challenge. You will have to think about where to send your cops, what might be false alarm. But later in the game, I just didn't care anymore because it was the same things over and over again. For example: In the beginning, you send your cops to the Police Academy so they might get a star and some XP. The XP don't really matter and later on, you can't even send your cops to the PA anymore. I feel like this was a feature that could have had such an amazing impact on the game, but it was just superfluous and added or changed nothing.  Third parties (e. g. 'The Church') don't matter at all. You can just ignore their missions and nothing will happen. In fact, if you do accept their missions, they will take a lot of your ressources, but in exchange you get nothing. Sometimes your cops might even quit after you send them to third parties (because my 80 years old Miss Price is now the bouncer of a gay nightclub).  The game is sometimes unintentionally funny, but more in a bad, ridiculous way. There is a case: A woman runs around in the park, naked. But I don't have the cops to arrest her. The outcome is: Offender escaped. Civilian killed. HOW THE F DID SHE GET KILLED?! It's little things that don't make sense and that completely break immersion.  At one point, I started to lose my cops and detectives. It's a vicious circle: Half your cops get killed. Then your shift will become ineffective because of the lack of ressources. Then some investigators come by, you get a penalty and lose more cops. The City Hall is butthurt and also makes you fire cops, which will make your shifts even more ineffective, thus come the investigators and take away more cops. But you can't just 'restock' your shifts - the City Hall denies your requests and buying a new job slot is extremely expensive (22k $). This makes the game unplayable for me. Not because I were so dissatisfied with it, but because I literally can't play it without any cops!  What also is disappointing, but not very negative, is that you have to be the bad cop. You cannot resist the Mafia - you will be killed if you don't aid them enough. This is just so that your gameplay matches the pre-programmed storyline how you are the mafia's bit*h.  I cannot, by all means, say that this game is bad or waste of time or money. I am saying, however, that there is a lot of improvement to be done in order to be able to fully enjoy this game. I would not recommend buying it. The beginning of the game is great, but after not much time, you can see behind the mechanics and that breaks the experience for - at least - me.",
            "review_score": "-1"
        },
        {
            "review_text": "Kind of a staff management and strategy game mix, with good story and dialogue. The Duke Nukem voice actor really brings the text to life :)  Also the balancing you have to do in order to keep Mafia, Mayor and your own staff happy is really well done ^^",
            "review_score": "1"
        },
        {
            "review_text": "The first time I played this game I played it for 7 hours straight, could've gone longer but it was late. I haven't finished the game and will edit this review with my full opinion but so far the game is well worth its price, it is addicting, it has a great soundtrack and pretty nice art.  EDIT: The worst part about this game for me is the story, I did not like the protagonist, the love story in it is not believable and seems VERY forced. Another issue is the music player, at first the cassete player was like a fun little gimmick, but later on having to scroll through the discs to pick out a song to play was more of a hassle than a positive.  Aside from those two problems the game is fun, well worth its price!",
            "review_score": "1"
        },
        {
            "review_text": "This is a decent game. It's got an interesting story; it's easy to play; and, most importantly, it's fun. You play a police chief with 180 days to go until his retirement. The crooked mayor wants it to go smoothly with no problems, and your crooked deputy is making deals with the mafia.",
            "review_score": "1"
        },
        {
            "review_text": "'this game holds a mirror up to the situation (even if it shows some ugly things) rather than simply being a place to live out the ideal and more easily forget the harsh realities that need to be changed in the real world' - Geewhizbatman (RPS review comment section)  THIS GAME IS A GREAT NOIR  Most of the bad review's complaints can be summurized to just - 'OH! I don't have a freedom to be super honest/good, I can't make everyone happy and continue to wear my pinky glasses all the time. I can't be captain Shepard!' Well, guess what... THIS IS GOD DAMN NOIR You won't find here some moral highground to observe and judge others THis is an honest game about real world (you can believe it's distant, whatever helps you sleep at night). It asks hard questions, it often punishes you for morally right choices. It doesn't discuss with you whether or not you are racist, corrupt, good, bad or ugly. These thing are up to you to decide, but if you won't be able to survive in the system, welp... as Frank Sinatra once put it 'That's life...'.  In other words - that's the conditions of the game. If a lot of people might hate bullet-hell games for gameplay reasons, I guess some people migh aswell hate games like that for narrative reasons.  So, please buy it if you like noir or/and good managment games. This is a unique experience of wonderfull storytelling, challanging managment-game and even more challanging strategy where your personal moral choices might be the hardest part of the game.",
            "review_score": "1"
        },
        {
            "review_text": "Does this game remind you of the animated disney movie?  A tough, but a rewarding game based on your actions commited throughout the gameplay. Its either you play as the good cop or the bad. Only the bad, ugly, strong, and the dishonest can rule and survive the city of Freeburg. You play by the books, and this city will swallow you up whole. I recommend you get this game. P.S. it's like Zootopia but in a very dark dystopia future of the corrupted law.",
            "review_score": "1"
        },
        {
            "review_text": "Love this game. I find it addicting with an intense storyline.",
            "review_score": "1"
        },
        {
            "review_text": "As a police chief you are given choices that aren't exactly black and white the consequences of it will effect you only if you want it too. Do you feel comfortable of using brute force to suppress a riot then blaming your actions on a third party? Or take full responsibility?  How will you reach your financial goal, by investigating local gangs and working up the ladder? What will you do with all the confiscated weapons? Take them back to HQ or sell it back to the Mafia?  By the end of each day its up to the player if they feel guilty, or is it too late to make a change? Or who really cares, the game doesnt force you to feel anything, you make it happen yourself. That's what I love about this game, for $13 its a steal and to be honest I would of paid at least $30.",
            "review_score": "1"
        },
        {
            "review_text": "this game is painfully slow in it's progression.   I guess the plan was to slightly change game's rules every X hours throughout the game, but the lack of journal or constant reminders of what you need to do and who asked what, makes it really hard to understand what you've been punished for.  the fact that autosaves here are set to every week makes situation even worse - if you forget to 'help Sand's' to stay ontop of gang war every 3 days (there is no calendar ingame, so there is no way to track the date you need to prepare to, overwise then remembering for yourselve, which is impossible, if you let's say made a break of one or two days) - you are dead, and you can't fix this, you can only load last monday's save, on which - guess what, you won't remember if you need to help Sand's or not either.  All this makes me bored of this game only after 4 hours of playing, and even if game will change it's rules later to the story - I don't care, I don't really entertained enough to try and play that far.",
            "review_score": "-1"
        },
        {
            "review_text": "This game's story is told in an amazing way, if you enjoy old fashioned cop noiers than I highly recommend this game, not for the gameplay, but for how its told.",
            "review_score": "1"
        },
        {
            "review_text": "It's a really cool game, worth the money",
            "review_score": "1"
        },
        {
            "review_text": "This game was honestly a great time. The choices are a shallow, but feel meaningful and are important enough that you feel like it really impacts the narrative although your choices do little to nothing to change anything. The story and voice acting alone allow me to make such a reccomendation, while the gameplay is interesting enough to keep you involved. Not a game for eveyone, but it offers about 20 hours of work related stress and addiction so it is quite fun overall",
            "review_score": "1"
        },
        {
            "review_text": "I see a lot of people saying that there's 'no choice' in the game, you have to be a dirty cop. That's not exactly true. Yes, you must agree to help the Mafia, you must help them to a degree, but you don't have to follow every request. If you're playing good cop, simply send cops to their requests where cops would be needed anyway, like a kidnapping or arson.   People don't realise that you an totally back stab the Mafia by starting an investigation on them and taking them down from the bottom up.   I have to say that this is one of my favourite games, te art, music and voice acting is brilliant and the gameplay is fun. The story really interests you and perfectly captures a noir like atmosphere. There's plans to release a new game mode in September, which will presumably be Endless mode, which I'm very excited for. This game is incredibly fun and challenging. Certainly recommended to anyone who enjoys this type of game.",
            "review_score": "1"
        },
        {
            "review_text": "This is the Police is one third luck, one third common sense, and one third balance, and all are crucial elements to dodging the bullet, so to speak. Some comments to throw out there for someone who would look for the things I would in an RPG - there are consequences to your actions, but the story is guided. The scenarios are not randomly generated and if you are a completionist with a perfectionist complex (like me) you'll have 100% nightmare weeks. The game creates a unique balance of the grind, as Jack might feel in his day to day routine, and challenges that sometimes just need to be met with a small prayer and some explitives. The script warms up a bit and in that cliche'd way, your gruff police chief will eventually grow on you. 8.5/10, would recommend.  also, shout out to my people - Mark Fishbach is in this game and he's a beast officer.",
            "review_score": "1"
        },
        {
            "review_text": "Simple and easy game to play. It's great getting attached to certain officers and developing your team.   The writing is pretty good at times and terrible at others, but overall the story is engaging enough.  For a $15 price tag though? HIGHLY recommend.",
            "review_score": "1"
        },
        {
            "review_text": "This game is in my opinion brilliant. inmediatly liked the game when I opened up the game and listend to the brililant music and saw the start screen with its beautiful animations.  The game feels like Maffia II but from the side of the police. The game is made up out of several different parts. At first there is a story that you can influence by making choices, a bit like the telltale games. Then there is the cop management and finally the detective management. These three elements give the game a lot of variety and al the parts have depth, they are worked out very well in my opinion.  If you love story driven games with good gameplay this is the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "Started playing, built up police force, got sweet talked into selling evidence to gangsters, made lots of money, city hall ordered me to fire all black police members, instead had to hire at least 50% of my staff with women.   10/10 would be bribed again   P.S.: Still hoping there will be a Frank Drebin - Police Squad mod/DLC.",
            "review_score": "1"
        },
        {
            "review_text": "This game is pretty fun. Some of the scenarios are pretty funny. overall addicting game 10/10 5.4h played stright after purchase. If only i wasnt tired and it was 6:54am i would still be playing it",
            "review_score": "1"
        },
        {
            "review_text": "very good game",
            "review_score": "1"
        },
        {
            "review_text": "Lets you suppress black and feminist protests with force ( ͡° ͜ʖ ͡°)  50/51 for being questioned for potential racism",
            "review_score": "1"
        },
        {
            "review_text": "Haven't been this addicted to a game in a long time. Great puzzles, great story. Sometimes could be gimmicky, and once in a while the puzzles made no sense to me. But overall great game.",
            "review_score": "1"
        },
        {
            "review_text": "Pros Great and mature story Wonderful music Good art style  Cons Kinda repetitive after 8 hours strait  10/10  Note: A 10 doesn't mean a game is perfect, it means its worth every penny. At least in my opionin.",
            "review_score": "1"
        },
        {
            "review_text": "Story driven management game, where you do are not required to have quick reaction times.   Game will give you lots of choises between Good and Erdogan and you really have to think about every action you take and prepare for the consequences. Also prepare yourself with time, since making hasty decisions might be fatal for you or for your policemen.  Don't let the simple graphics style fool you, it has been laid out greatly with thought taking you inside the game. Music is groovy downtempo jazz/blues what at least made me quite relaxed and concentrated. Game provides you with a music choise every morning thus you can listen them all and decide your favorites... Really love some of those songs!  Story 5/5 Graphics 5/5 Music 5/7 Sounds 5/5  I paid 15€ for this game and I would buy an expansion if one might become available.   Perfect Sunday game.",
            "review_score": "1"
        },
        {
            "review_text": "Just describing a typical day in this game is enough to get people interested. Or just mention the part about the woman beating another woman bloody with a ♥♥♥♥♥. Long live Adrian Godbomber!",
            "review_score": "1"
        },
        {
            "review_text": "Really enjoying this, think of it as an adventure game with resource management as the main gameplay. The objective of earning 500,000 in 180 days is mostly a set up for a lot of story threads going on day after day. The pacing ensures there's always something going on and because its hard to tell how things turn out it will keep you engaged.  The game is quite lengthy so it's real value for money if you enjoy a good story and resource management. So far I have yet to see any repeat elements so i really appreciate the effort that went into this  Edit: I'm not so sure what I think of this game  It took me 27 hours to finish the game, i think it went long because I tried to read everything but there really doesn't seem to be much reason to but too much effort in. There are time skips but not really enough to keep the game from dragging on a bit too long. I reached my money target about 80 days in so everything after that was about the story.   However, the story elements which are the main draw and keeps you interested in the first third becomes a bit sparse and feels low effort as you go. There are a lot of story threads that seem to go nowhere. There is a possibility that playing differently could get you other events but with a playthrough taking this long, its a bit too much of an ask. What bothers me the most is that the ending doesn't seem to be affected by your decisions in the game unless you go really bad or really good. There's just very little acknowledgment of what feels like major decisions you've made.  Another complain I have is how little your management of the police station seems to matter. The police management almost seems like a seperate part of the game that's barely acknowledged in the story. If it is then the feedback you recieve within the game is very poor. Civilians die, your officers die, criminals escape but as long as you prepare a bit its pretty ok. City Hall might say that they're not happy but beyond denying a few requests you make, it doesn't matter. What's amusing though is in one failed playthrough, I managed to get my entirepolice force cut in half and wages cut by 90%. That, I found very amusing  Still it's enjoyable enough if you like resource management and text adventure gameplay. The art style is nice and the story element are good enough to draw you in but leaves you a bit unsatisfied in the end.",
            "review_score": "1"
        },
        {
            "review_text": "'Great conversation piece at the very least, I tell people how easy it was for me to become corrupt.'  A story based game that does well in developing its characters. I personally enjoyed the voice acting. If you're into management with a few minigames, investigations and those bit games, in between, then you're in for a treat. Honestly, this is the kind of game I would imagine playing again a year later at the least. So why do I recommend this game? The narrative is a nice break from the typical predictable plot lines found in most games. It's a tragic story. Now the story isn't perfect, but it isn't horrific either. As you can tell by some of the funny comments, this game at the very least will generate some interesting stories.   -One day a guy asks me for 3 corpses from my force to use for his own interests, and gives me no insentive to do so. So of course I wasn't going to give what he wanted. But on the same day, I had two people die on the way back from a job where they got drunk. So then I thought, well I already have 2 ready for him.   -Asked the Mafia to help me get rid of some people to satisfy a request from City Hall. Not only did I fail that request cause the trap is set for the next day, but I forgot I set the trap and sent 3 decent people to get ambushed.  ",
            "review_score": "1"
        },
        {
            "review_text": "One of the best Games ive played this year. Amazing story, music is pretty good all the way through. I put in over 24hrs. You will get your money worth out of it.",
            "review_score": "1"
        },
        {
            "review_text": "Absorbing and depressing, though I am loving this so far. It's a hard lesson to learn being a good cop is bad for your health.",
            "review_score": "1"
        },
        {
            "review_text": "This game has a good story,but making decisions doesn't really matter.The music is good,but it is kind of boring when you have played it for too long.(I started to feel bored about the game on the 23.5th hour.)",
            "review_score": "1"
        },
        {
            "review_text": "Great game to play when you want to relax and follow a nice story.  Really liked the graphics style, and music.",
            "review_score": "1"
        },
        {
            "review_text": "An 'unexpected' game: very interesting and quite hard, also to replay.  It's a good sim/adventure game, and you see they put a lot of effort in it: good graphics, good game mechanics, good music selections...  However, I agree the main plot is a bit... I don't know... 'soap opera' style. But I didn't find it terrible (as someone pointed out), just a little 'plain'.  Howerall, a really good game, for the right price.",
            "review_score": "1"
        },
        {
            "review_text": "Sent all my officers to be killed by the mob. ??? Profit  10/10 GOTY ",
            "review_score": "1"
        },
        {
            "review_text": "A plot oriented game with a solid concept very solid core gameplay but it drops the ball:- - The minor plot points the sub plots and stories with the character relationships and scenes get dropped. - The game gives you many decisions with consequences but the ending is very scripted. - Midgame got slow &amp; grindy, it just becomes a chore. - In the middle to end stages of the game the instructions on how to deal with the newly introduces mechanics is vague at best.  As if they ran out of funding or they're about to meet their deadline so they just threw it out the door I'm glad I bought this game at a discount.",
            "review_score": "-1"
        },
        {
            "review_text": "There's no success in this game, just bad, really bad, and worst answers you can choose from. The mechanism, the base structure of the game is nice. But the story... it's just showing a corrupt city's justice/police system in a real dark way. You can't make real lifelike decisions. Just what the game offers. I've got 20 or so cases/events, and my officers were able to solve the problem in like 2-3 cases. Really??? That just ridicoulus, not even close to realism. This game just want to throw you down in a hole of corruption, bad public safety, mafia system and all the worst things you can imagine in a dark city. The only thing you can do is choosing from answers/possibilities from: bad,worse,worst... There's no real 'managing'. This game was not the game what i waited for. Sorry, big mistake.",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥♥♥♥IT LAURA WHY DIDN'T YOU REMEMBER?!?!  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Its great, everything from the art style to the way the mechanics of the game ♥♥♥♥ you up when you put your entire task force on a false alarm is great. It might get a bit repetitive over time but the fact that you can re-write the whole story with 1 decision is great (even though its a common feature)",
            "review_score": "1"
        },
        {
            "review_text": "This is the story of a police chief voiced by Duke ♥♥♥♥ing Nukem serving in a town full of corrupt shitheels.  The story and voice acting are pretty great, but the management gameplay can be slow at times.   ",
            "review_score": "1"
        },
        {
            "review_text": "*NOTE* it may seem like the 'cons' section is much longer than the pros but that is simply because I included examples so please don't let that deter you from trying the game out or learing more of it.    FINALLY a well made strategic police managment game! Now to some people this game may seem odd and 'foreign' due to it's very specific setting and genre, But trust me this game is worth it. Firstly I will start with the pros of this game and then move on to the cons.   This game does a marvelous job of setting the mood and atmosphere of this game, wether it be the lovely collection of tracks that you can buy with your in game money in the catalog or simply the events that are happening throught the game. This game also does a good job on the choices in certain events during the game if it's a cutscene or just a call to your station throught the game. It definetley makes you feel like your choices matter greatly because they actually do instead of jut making it look like that. The game has an interesting plot and a likeable main character that is consistent through the entire game. Now you may be asking 'well this game sounds great what could be wrong with it?' and to be honest it really isn't much of a 'game breaking problem than it is an inconvenience.  The category where this resides is the game mechanics. Now to start off i will list an example of a certain problem occuring that happened quite often in my first playthrough, (I say first because I plan on restarting and playing the game again now that I have learnt more tips and helpful things through my first go) while i was playing I had just sent my last remaining officers on a recent call that I had very little time to respond to. The second I send them a mission from the mayor (which you will recieve commonly) now you would think, or at least I would,that you would at least recieve some time since most all of these calls are not as urgent as any of the others you usually attend to. But no, you must send a specific number of cops right then or else the mayor will be dissapointed and lower your chances of requests that you send to city hall and when this happens constantly it will irratate you when you always get them right after you run out of cops. The next problem i have wiht this game is the fact that when there is a riot and you are called it is completley random as to wether or not you should use force, now on my first riot I had no clue about this so when I chose to not use force during the feminist rally I was punished for it so when the next riot came around (The lgb one) I thought I was supposed to use force and when I did I was wrong to do that and thenbrought in for questioning under the accusation of 'abusing my power'. For right now these are all the 'main' problems with the game as I am currently on day 67 and I probably am in no position to review the game yet but I thought i'd express my opinion. Thank you for reading.",
            "review_score": "1"
        },
        {
            "review_text": "I liked the game. The management system is fun, this game itself is pretty stylish. I really like the decision making within the game - like, it's up to you if the mafia does well or ceases to exist. I really liked multiple references to real life, humorous and tragic. However, there were a couple of things that I missed:  1. I feel like the story with his wife and Lana do serve the purpose (to create a neonoir environment), but still I'd like them to be complete.  2. Zero replayability. Like, the events are not random generated but scripted, so the next game is going to be exactly the same - with the exception of your choices. 3. The missions by the Bishop. The description is super fun, but the pay is ridiculous. BTW, did anyone ever used anu church service in the game?  Overall - great game. I got about 1.1M and eradicated 5 gangs including both major ones and didn't get killed. So I'd consider this success.  10 corrupted police chiefs out of 10 possible",
            "review_score": "1"
        },
        {
            "review_text": "A rich businessman offered to fund me 3 more officers, but I have to take in his incompetent son and cannot fire him under any circumstances.  I want to get his son killed, so I can hire a proper officer.  Sent his stupid son alone to a bomb threat in the ghetto. He asked for backup after arrived to the scene, and I refused. Bomb exploded, civilian died, suspect escaped, and he survived.  He took the remaining explosive back to me, and I asked the mafia to sell the explosive for me.  Same day, an armed robbery at the pawn stop. I sent him off on his own again. He took out the armed robber by himself, with the lowest competency rating possible.  11/10 would try to get him killed again.",
            "review_score": "1"
        },
        {
            "review_text": "Great promise, but quickly becomes dull. As the gameplay itself is sending out cops to do various tasks (could basically be a browser-game), and the campaign is 180 days, I found myself bored to death after a month or so. Sure, some mafia war appears with different tasks to send cops out to, and sure you slowly build up on your illegal retirement fund, but there just is not enough to keep me interested. A pity, as I really like the idea of a police chief-game.",
            "review_score": "-1"
        },
        {
            "review_text": "*spoilers alert*  Old school whiskey sipping, cigar smoking police story. With light weight police department management in between the story telling. Cut scenes are made with tender and care. Voice acting greatly intensivy the allready great style of the story telling parts. Overall graphic desing is solid, only part where I would liked to made changes is the management map. Grey scenery would have been more interesting with  healthy dose of details. Now the map starts to get a bit boring towards the end, no matter that it has some nice seasonal effects. I personally like the smooth selection of soundtracks for the first half of the game. in the second half of the game soundtrack changes towards more  hectic assortment of tracks. Also I really would have appreciated auto play feature instead of the constant album changing roulette. Nice bonus would also have been use of custom music tracks outside of the game.  First half of the game is kind of freewheeling, you can nicely keep up with the pace the game is moving and there should not be too much of a troubles managin your police department. When the game starts to get closer to the end it feels like it getting a bit tedious to keep the police department  circus turning decently and keeping all the whiners happy. Especially when the city hall cutting your budget all the time.  There should also be more randomness in the game. What I have noticed that loading save state always results same ammount of police not coming to work or being drunk. This is just bad game desing. Also the missions in the second half seem to be quite heavily police experience depent, because oh lord if you send too little experience to the mission youäll end up more than one dead police officer in your hand. Which leads more problems the next day.  Same time you should try to keep detectives on your payroll or it will end up some kind of stupid investigation 'Why ain't there enough detectives?'. It's kind of hard to keep people on the payroll when budget is cutted all the time in the end half of the game. Also what really felt rather weird was that I end up paying the penalty from my personal bank account... w000t, who's so stupid that keeps his/her dirty money on the bank account, plus how on earth can some investigation group get their hands to your bank account? :D There should be some level of realism in this kind of game.  Summary, Story is great, first half is entertaining, second half is kind of stupid because you have to do everything correctly or you end up zero police  on the shift list and get the-end screen. The end is too much grinding to make a perfect day, I just want to see how the story ends so I'll just watch some youtube walktrough.  Couple of things that should be corrected, but still a decently entertaining game 70/100",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ man. that game was great.  For me, it was so satisfying to finish an investigation, and taking down a crime organization. This game was great but except for one thing that possibly ruined a lot of the game for me. I wouldn't read this if you're going to play the game but you can.   The ending. Oh my god the ending just completely kicks you in the balls. After 21 hours of one playthrough, I got kicked in the ♥♥♥♥ to hard for that.  &lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;read at your own risk ",
            "review_score": "1"
        },
        {
            "review_text": "You have no real choise of being a good cop at this game, 'cause game will end very soon (after 2 hours, approximately) in this case. And it's not because of me being a bad gamer, but only because of my sincere choice to be a good man. If only I'd have a very difficult gameplay with the way I play. But I have no choice at all.",
            "review_score": "-1"
        },
        {
            "review_text": "I really like it. Story game, but fun play.",
            "review_score": "1"
        },
        {
            "review_text": "Really, really great game. Love the voice acting and the animations. Reall well made!",
            "review_score": "1"
        },
        {
            "review_text": "This is the Police - Review  After playing TitP for about 6 hours, i have a pretty positive impression of this game. It is a mix of a classic adventure campaign and a kind of police simulation. The main story appears randomly all couple of days and keeps the player motivated. The developers work with serveral pictures connected through exellent ambient sound, which make the pictures alive. Special in this combination is, that you are not just a regular police chief, no you are cooking serveral 'meals'parallel to your work. After keeping the city secure you need to find your disappered wife and make sure that you gain enough 'dirty money' to make yourself a happy retirement. You get some extra cash doing jobs for the mob or just by folding evidences like guns or drugs. Furthermore there are beside the regular 'send cops to crime' mechanic the investigations about bigger crimes like i.e. murder. In this cases you need to put some detecives on the job and try to get the proper sequence in a row of pictures, which show the actual execution of the crime. If you have the pics of the crime in the right way than the name of a suspect appears and you can close the case by geeting the guy arrested.  TitP is a nice game for someone who is looking for alternative game concepts. It is quite funny to play and watch yourself 'interpret' the law. The price is fair, the quality (bugs etc.) is fine and the dubbing excellent. 4 of 5 Points!",
            "review_score": "1"
        },
        {
            "review_text": "its a really good and realsitic game its like papers please but with tons of easter eggs like you can hire markiplier as a cop the story is good i like how you can pick how certain situations go",
            "review_score": "1"
        },
        {
            "review_text": "Great game, but story is a bit confusing.",
            "review_score": "1"
        },
        {
            "review_text": "Not a masterpiesce, but a unique game for sure. Nothing like this on the market, provides great deal of fun.",
            "review_score": "1"
        },
        {
            "review_text": "Cool gameplay and amazing atmosphere (thanks to in game music).",
            "review_score": "1"
        },
        {
            "review_text": "Gorgeous art, terrible gameplay.  The concept of This Is The Police caught me instantly. You play as a police chief 6 months from retirement, who can choose between being morally upstanding, a mafia stooge, or anything in between, essentially having to decide whether building up a retirement fund(legally or not) or staying true to his position. It seemed like it could be a fun ride.  The art? Interesting, unique, haven't seen a game with quite the same art before.  The gameplay? Conceptually good, but the issue is an absolute absence of what I'd call 'feedback.'  Say that I can send between 1 and 4 officers on a particular case. Let's assume I decide to send one guy with great skills, because everyone else is occupied and the case will time out shortly. And then assume that I fail: is it because that was too few officers? Because that officer had too poor skills? Did I actually have a 90% success chance and just flubbed the RNG roll? Was there even an RNG roll, or was it just a deterministic adding-up of office numbers and skills?  The game never lets you in on what's happening behind the scenes. Similarly, some cases offer short multiple-choice narratives. I pick a given option and end up with two dead officers, an escaped offender and a dead civilian. Was that the only potential result of that option? Was it the result because my officers sucked? Or was it just random chance? Again, you never know.  If I have to read a wiki or decrypt the game's code to figure out how it fundamentally works, the game has failed. I'd recommend against getting this.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is reeeeeaaaaally good! If you like tycoon games or anything like that, you will LOVE this game!",
            "review_score": "1"
        },
        {
            "review_text": "Cool gameplay and amazing atmosphere (thanks to in game music).",
            "review_score": "1"
        },
        {
            "review_text": "This game is quite fun and I really enjoy it! The gameplay is fun, and the story is amazing!",
            "review_score": "1"
        },
        {
            "review_text": "Pros -Great unique storyline -Great artwork -Long story for a game you would expect short story from -for $17.99 12 hours is not bad Cons -Game gets boring about halve way though it gets boring -Not much replay value -Gameplay gets boring to do over and over   I would say to get this game if you can handle doing the same thing over and over again and don't get bored easily but if you are like me and can't handle games that make you do the same thing over and over and get bored and need to take 5 breaks a day just to do maybe 1/4 of the game then don't get it the storyline and gameplay gets bad about halve way though.",
            "review_score": "-1"
        },
        {
            "review_text": "'You are in charge, but not in power' is constantly reminded to you throughout the course of this game, and there is nothing you can do about it.  A very good game, if not one of the best, especially if you are into detective games and an 80s-90s era fan.  My PROs &amp; CONs:  +Unique gameplay +Interesting Story +The perfect Music to set the mood +Simple to learn how to play +Choices you make influence the rest of the game +Keeps you curious of what will happen next +Small detective cases which add optional objectives to solve. +No Good Ending just to remind you that you are a puppet lost in the big picture. +Devs update the game and add new features and new languages for users (if you do not want it in english) , so it's a big thumbs up for this effort, as they care about their players, which became more and more of a rare thing in the last couple of years for lots of game companies.   - Even though you have choices, the story is kind of going in only one direction. - Maybe more endings would be a cool feature to increase the game replayability. - Not really worth playing it more than 2 times at the moment (I've said twice as you can chose other paths and alliances). This is mostly because the crimes commited in the city are scripted and not random.In other words, if you play the game again from day one, you will discover that the same crimes happen again at the exact hours so it decreases in difficulty because you already know what will happen ahead of time. So in my opinion, just to see how the story progresses is not enough to get you through weeks of repetitive crimes and gets boring (once you finished the game once already).  Overall score : 9/10 ~ one of the best indies out there.",
            "review_score": "1"
        },
        {
            "review_text": "Bomb game, 10/10. Playing it a second time through rn",
            "review_score": "1"
        },
        {
            "review_text": "  This Is the Police, is one of those 'diamonds' that come from a desert full of other new titles I never heard of before, developed by studios I neverheard of before, priced suspiciously low and released at a ten percent dicount.",
            "review_score": "1"
        },
        {
            "review_text": "Was loving this game until, at day 168, I got a Labor Union Formal complaint for nothing (had already    eliminated the mafia    and stopped doing questionable things involving officers well before this day) that wiped out all but two of my detectives (most of whom I'd had since the beginning of the game and were actually good) and all of my competent officers. So I was left with a paltry sum of cops, unable to take care of any crime without them getting killed, and unable to    investigate most of the people that would help in the final assault against city hall   .  I had a great time getting here, but I never want to pick this game up again. I read the endings and am honestly glad I didn't bother finishing. Uninstalled. Good job Weappy, you really did a fantastic job at messing up a good game.",
            "review_score": "-1"
        },
        {
            "review_text": "I really liked the game on the first run through, in which it took me 15 hours to complete. However on a second look the choices you make have no impact on the story and you are forced into being a crooked cop if you want to make it past day 30. The management system that the game is based around becomes very repetitve and predictable, and in the latter stages of the story it becomes impossible to be efficient as all your experienced officers begin dying in car crashes for no reason. Certain groups, like the church, appear to have no bearing on the game and contribute nothing whilst demanding a lot of you resources.  The good points to this games are;  The voice acting is great The story gives you the illousion of choice on your first playthrough The excuses, fake calls and some cases are very funny and, The investigations with detectives have some good little puzzles  Clearly there aren't enough good points to justify a £15 price tag ",
            "review_score": "-1"
        },
        {
            "review_text": "I do not reccomend this game to anyone personally. I feel like its a bit too boring and you really dont control ♥♥♥♥. The mob does if you dont listen you die.",
            "review_score": "-1"
        },
        {
            "review_text": "well the only yhing you can do is to help the mafia, but why aren't there a path for decent honest police, rather then corrupting. you only get to choose which side won, varga or sand which again, not what i wanted, i thought this is a management sim which allow you to get a lot of path, more ending then this and ability to carve your path. but it seems its more of a personal story about a cop getting corrupt as he is helpless with the situation he is in",
            "review_score": "-1"
        },
        {
            "review_text": "'Usually, before I go shaking my ♥♥♥♥ for the press'... I like to give this game a 10/10  Since only 1 person found my review helpful, I decided to make a clarification. The quote above is not mine. If you buy the game that's you gonna hear over and over again each time you'll start the game before you will be able to skip the intro.  The game is great. It's satisfies my appetite. It's a funny manangement game with great voice acting, an interesting plot and you will try (but fail) to satisfy everybody. So let's be clear. You can't! If the mayor is satisfied the mafia boss will not, an most probabl not even the people that you must serve and protect. If the mafia is satisfied the others will be not.   I've played 7 hours and I didn't finish mostly because I want it to do it right, in my way. Is hard to keep peace to the city, to fight crime, to decide which detective to send where, how many cops to respond a call that might be a joke or the start of a real riot and also to put some money aside and make a profit.  So if you want to manage a police station, listen to nice chill music while you must focus on crime calls, finding your missing wife, get to know your enemies or foes and do some detective work this is the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "Couldn't wait for this to come out having seen some youtubers play it, but was so disappointed... It got so boring I found myself enjoying the tetris and poker mini games more than the main story, and the ending was such a smack in the face I was annoyed with myself for sticking it out. The storlyine is relentlessly negative, and the gameplay leaves a lot to be desired, so it gets a thumbs down from me.",
            "review_score": "-1"
        },
        {
            "review_text": "A local VIP asked me to send 4 officers to his daughter's wedding. you know to check for any troublemakers. They came back drunk and one of them died in a car accident on his way to a strip club  10/10  would recommand",
            "review_score": "1"
        },
        {
            "review_text": "slow, lots of rng, no free mode, have to play how they want you to play",
            "review_score": "-1"
        },
        {
            "review_text": "The game hooked me at first, with interesting choices and narrative. Sadly, for the last fourth of the game things become way too easy in the daily activities and the detective missions are only hard because of artificial moments when detectives don’t find the missing piece of evidence. Most of all, the endings are completely insulting and leave a bitter taste when I thought I would be getting true choices",
            "review_score": "-1"
        },
        {
            "review_text": "Very fun game, love the design. It just flows.... good job guys  As an addendum, I've finished the game and had a blast completing it the first time. Now I'm looking forward to playing it again just a little differently to see how any subtle changes I make may affect my out come.  Don't be discouraged by those who say there isn't any choices. You have choices, you just have to live with the consequences. 8)",
            "review_score": "1"
        },
        {
            "review_text": "got this online for 7 quid which is maybe a little pricey for this title anyway yoons ignorant ♥♥♥♥s read the rest or dont.  Watched Dreed Got a hard on for justice Got to cleaning up the city,  didn't go well  Watched Copland  Got rich sent all my black officers to die in mafia hits went Lul ect.  Really its a fun game with some very anoying cutsceens and make work tasks like the whole music ♥♥♥♥♥♥♥♥ which are very anoying red tape heopfully someone will find the file for those cutsceens so I can delete them to enjoy the game better.  great soundtrack",
            "review_score": "1"
        },
        {
            "review_text": "I kept getting penalized by city hall once every 2-3 days in game.",
            "review_score": "-1"
        },
        {
            "review_text": "You can die for unclear reasons that you cannot even fix by restarting from a previous save game.",
            "review_score": "-1"
        },
        {
            "review_text": "I liked the game and it kept me busy for a few days, but once the story came to an end, I didn't feel like replaying it at all. They also should add some different endings, because the standard ending is a lame one.  Still, I'd recommend it because it gives you more hours of story time than the game costs in euro's.",
            "review_score": "1"
        },
        {
            "review_text": "Fun Little Cop game. worth 10 Bucks no more",
            "review_score": "1"
        },
        {
            "review_text": "Truthfully, I want to recommend this. It's different from most games and has an appealingly cynical story. The theme is also painted in shades of grey that makes it more relatable and realistic.  However, some may not like the gameplay - you'll be focused on an overall picture of the city and dispatching police to the every day crimes - a task to the end. There's also an RNG issue that may REALLY screw you over and kill a large number of your force - I recommend just restarting the day when that happens. Some detective cases are confusing as well, but fortunately a guide on Steam has been posted for when you're truly stuck.    But what ultimately turned me away is the ending.      The money collected ultimately doesn't matter to you or your character Jack Boyd. Too much is left unresolved story-wise. Finally, Jack's job is his real passion... and no matter what he loses it.     The ending is not just unsatisfying, it feels incomplete - and unless they fix this ending, the game is tragically tarnished for me.",
            "review_score": "-1"
        },
        {
            "review_text": "I don't know what the others are talking about, you absolutely DO have a choice to be a good cop.    Just don't expect to make it past day 13 though.  ",
            "review_score": "-1"
        },
        {
            "review_text": "Its got a fantastic artsyle and a stellar soundtrack but that is completely underlined by an unfortunatly bland story and repetitive gameplay.  I really enjoy the idea of the game a dark cop story around a police station management game but i just felt annoyed playing this , I really wanted to like it but I was sadly bored. Also the 45 minutes I played felt like three hours I would of tried it out for longer but i really couldnt sit through it,",
            "review_score": "-1"
        },
        {
            "review_text": "Gr8 writhing",
            "review_score": "1"
        },
        {
            "review_text": "it was okay i guess.",
            "review_score": "1"
        },
        {
            "review_text": "Like a real police.",
            "review_score": "1"
        },
        {
            "review_text": "2/5 - Great game until the climax/final mission. This is the police is another 'Manager' type game with the format of being police chief. Nothing too great from the gameplay aside from the fact it has decent multiple choice events which makes people actually have to read. I really enjoyed the voice acting and the art style of the cut scenes as well as majority of it's story that is until the last 'mission'.   FIrst of all it's a pain to figure out how many units go here or there for it. So painful it added another 2 hours to my play time just to figure out through trial and error which I really would not have mind except the final mission didn't bother with a proper cutscene or a conclusion for all the plots going on in the story. It left a lot of loose ends and being that the game was only really great due to it's story ruined the game entirely. Luckily it was at the end of the game so early reviews could say many positives.  The way the game ended made me believe that it was most likely rushed which was a pity as I would have easily recommended the game until I finished it. There are 2 different endings but both are equally horrible and leave too many loose ends.  ~Also hopefully they allow the game to run while tabed out, it would have made me less disappointed.",
            "review_score": "-1"
        },
        {
            "review_text": "Sent three officers to handle a single drunk man. Ordered them to taze him. Officer killed.  But seriously, as well-made as the game is, after an hour of playing, no matter how sucessful you are, you just feel frustrated and unhappy. The game simply fails at being fun. It just leaves you wishing that this was a real police management game, with actual choices that have realistic outcomes.",
            "review_score": "-1"
        },
        {
            "review_text": "Find this game a little pricey for what it has to offer.  Thought failure was funny, as long as it was random.  At the start it's a fun organizational game, but relatively scripted to ensure succes.  After a while it gets a little too buggy for my taste.   Examples: -Lead detectives die and gang investigation becomes unsolvable.  -After officer died I can't directly hire a new one. Have to wait a day in case he suddenly revives perhaps.  Story is enjoyable but lenghty cutscenes make them a little annoying.  0/10 prefer cocaine",
            "review_score": "-1"
        },
        {
            "review_text": "So i'm only on day 3 and this irritating bug, or whatever keeps happening. As soon as i choose which cop to hire or fire, it automatically freezes and i have to exit the game and restart that day. I thought it might have just been a glitch or a fluke but when it has happened over 10-15 times it is quite irritating to even try to play this game anymore. If someone could help me with this it would be appreciated. i know this game is new and all but this shouldn't be happening on any game after release.",
            "review_score": "-1"
        },
        {
            "review_text": "You get to play as Murican Cops,  PEW PEW PEW  10/10 WILL SHOOT AGAIN",
            "review_score": "1"
        },
        {
            "review_text": "Played 36 hours. Was fun for first 20. Last 16 are repetitive, and I've come to realize that all/any choices made during gameplay don't matter. Don't-buy-this/10",
            "review_score": "-1"
        },
        {
            "review_text": "I hate kid in this game ..",
            "review_score": "1"
        },
        {
            "review_text": "Boring, tedious, unfun. Wanna play an awesome game? Get 'This War of Mine'!",
            "review_score": "-1"
        },
        {
            "review_text": "Great game, really addictive and has got me playing it for almost a week without even touching other games.   The ending is kinda weird and unsatisfying, but it shows that life kinda sucks       ",
            "review_score": "1"
        },
        {
            "review_text": "Make sure you know what you're getting before you buy and you will be absolutely rewarded with a brilliant experience. Loving this game so far and only on Day 10 of 180.",
            "review_score": "1"
        },
        {
            "review_text": "I wish there was a neutral recommendation for the game, because this is a perfect example of a game that is good to play once and not for full price.  Pros  - Engaging story, found myself wanting to know more and actually paying attention to the backstory. - Easy management. As someone who isn't savy with managment games, this one was pretty straight forward. While its a 'mile wide-inch deep' type management, its lets you dip your toe enough without being overwhelmed. - Fun events. Loved the quirky police calls. - Neat music feature. You choose from records that you can collect, and play in the background. WIsh there was more variety than Classical/Jazz, but it fits the story and character.  Cons  - Scripted story. Any attempt to replay the game will have exact same encounters each time. No real replayability. - Predictable events. You know that if one call needs 4 officers, youre goint to get more calls than officers during that time. You either choose to fail that event, or fail the other ones. - No concequences for your actions. Want to straight up kill every criminal you have the option to? Want to send your guys in for a suicide mission where you paid to have them killed off? Go ahead, there is no investigations or anything. No morale hits on the force. Nothing. - Linear story mode. You have to be a dirty cop, you cannot be 100% clean, I believe its the Developers intent to drive the story, but it falls under the zero replayablility since you can't go good cop once, then bad cop the next time. Its just how dirty do you want to be. - Due to the simple management the crime system is based on a point value. Most crimes will either succeed or fail strictly on the point total of the police being sent in. No other variables.  Overall, its an entertaining game with good story and funny situations, but with the linear scripted story its hard to justify paying over 5.00 for a short single playthrough game. I would only replay the game for steam achievements, or to see small story changes. ",
            "review_score": "1"
        },
        {
            "review_text": "So - about 2 days into playing this game - I've noticed an irritating fact about the game. I'm a lover of freedom - I like to be given a rough idea of where to go - a mission, then take any options I feel like to reach the goal. Unfortunately, this game isn't one of those.  It's a good game - don't get me wrong (hense the recommended), but it's certainly not got much freedom in it. I agree with a numnber of other reviews on the subject - this ISN'T a game about being lawful, or being corrupt. It's actually all about HOW corrupt.  My first playthrough I was a good guy, and got killed for it maybe an hour and half into playing. I just finished my 5th playthrough basically picking and choosing how far I'm willing to go (I'll let the mafia off with thefdt, but not murder) - and I died a few days after my first save.  So it would seem that - the only way to play this game and NOT die before 50 days, is to do EVERYTHING the mafia want you to do - just be corrupt. Let them kill, steal, trersspass - and take down anyone who isn't affiliated with them.  Still a good game though!",
            "review_score": "1"
        },
        {
            "review_text": "It's worth just for the soundtrack!",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, just needs to be a few hours shorter and have a more satisfying ending.",
            "review_score": "1"
        },
        {
            "review_text": "Very Good game, just wished there was a little more story to it.",
            "review_score": "1"
        },
        {
            "review_text": "First of all, the GUI keeps freezing on Linux despite the game allegedly having Linux support. As such, I cannot really recommend it.  Secondly, the game is almost entirely random - based on the roll of the die, you can either have everyone show up or get six officers asking for a day off. You can have 6 1500+ officers with SWAT support die in a mission, but get no injuries if you were to reload and try the exact same sequence of events. The only way you can affect the outcome of events is through foreknowledge of events due to the questionable experience mechanic (every officers gets 10xp for each successful mission, so should maximize the officers sent out if there isn't anything else coming up because your most experienced veteran will still learn something watching a rookie complete a the most trivial of missions). It's a fun experience, but I would question if it is really a game.  Finally, some of the puzzles can be rather unfair (e.g. one case has the squence 'bomber walking with full bag', 'bomber walking with empty bag', 'bomber removing bomb from bag') and subjective (e.g. there are two pallete swapped bags, and one of them is 'girly' - is that the black leather one, or the brown leather one?)",
            "review_score": "-1"
        },
        {
            "review_text": "I never write reviews too much. But only the games that I really like, and this is one of those games that I love. This is the Police, have a great story and management gameplay. Even if I have not finished up the game this game would make me go back and play it all over again. Which to conclusion is that this game is great to kill time and also have fun and immersed throughout the story even if its linear style. The only gripe that I have is that I also wanted to play as a old good cop image. But I know that in reality is very complex and hyporcitic in way and also corruption is a a thing :p. Anyways This is the Police is a good game to play for me",
            "review_score": "1"
        },
        {
            "review_text": "Good concept. Good execution. Low learning curve. Lots of gameplay. Much is similar, but it doesn't get old. I enjoy it.",
            "review_score": "1"
        },
        {
            "review_text": "  Beautifully Made.",
            "review_score": "1"
        },
        {
            "review_text": "This game is not at all what I expected, and that is both a good and a bad thing. I was expecting an in depth police simulator with some light story elements. Instead I found an in depth story experience with some light police simulator elements.  The story really sucks you in, I just wish the gaps between story elements weren't so big. I'm about 15 hours in now and there are countless days where you just go about your normal police business. In theory this is fine, but after an hour or two you've seen everything that the standard police management has to offer.   The police management is basic and gets old very quickly. I don't find the daily tasks them particularly challenging or interesting. For the most part it's quite easy to get plenty of money while keeping everyone happy.  Don't get me wrong this is a great game but it just becomes tedious, like the devs have artificially increased the length of the game through grind. I don't know if I'll actually end up finishing the game, I want to see the story through but at the moment the game feels like a chore.  The reason why I'm recommending the game is mostly value for money. I really enjoyed the early hours of the game and it isn't that expensive for what it is.",
            "review_score": "1"
        },
        {
            "review_text": "A refreshing sim, the likes of which I haven't seen before. You have to make a lot of tough calls right out of the gate, and you feel like they have impact. When you're ordered by City Hall to fire all of your black police offers due to recent targeting of black officers, it really makes you consider the ramifications. Do you fire them all to protect them only to seem racist, or keep them on the force with the potential to be killed. Inner corruption is another added aspect that throws in even more tension. Definitely worth the $15.",
            "review_score": "1"
        },
        {
            "review_text": "This game is very atmospheric with good sense of humour.",
            "review_score": "1"
        },
        {
            "review_text": "It is really a fantastic game. Not only becasue of its plot , but it reveals some provoking reality of humanity.",
            "review_score": "1"
        },
        {
            "review_text": "a game where a 70 year old man can diffuse a bomb and succesfully clear a bomb threat and a squad of 5 plus a SWAT team cant. Great game 9/11 IGN",
            "review_score": "1"
        },
        {
            "review_text": "I was pleasantly surprised with this game, because who sees, or expects a police simulator game to be this engrossing and deep while setting an appropriate tone? Definitely recommended, and Duke Nukem and Serious Sam voice act to 'boot'!! Pun partially intended ;)",
            "review_score": "1"
        },
        {
            "review_text": "I had a good 4 hours out of this today and Jack (the character you play) was killed. Gutted! Oh well, shall start again. This game has a great style, i love the Vectored graphics, it reminds me of old school Amiga games.  So if you love vectored graphics and stratagy games.  Get this",
            "review_score": "1"
        },
        {
            "review_text": "Starts out great with an interesting story but gets boring by the end. Still worth checking out if it's on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Just lost my top 4 officers while chasing 1 woman in a van.. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Excellent Game, Sent some people out to deal with a car theft, found the car abandoned, told them to ask eyewitnesses, they all died. Ended up with a pretty good police force till i let Sands be on the losing side of the war 3 days in a row. Accidently ate some bullets for breakfast the next morning",
            "review_score": "1"
        },
        {
            "review_text": "Great game, 20 hour story mode. Disappointing ending leaves a bit of a sour taste when compared to the rest of the game.",
            "review_score": "1"
        }
    ]
}