{
    "app_id": 444000,
    "name": "Super Night Riders",
    "release_date": "2016-02-22",
    "developer": [
        "neko.works"
    ],
    "publisher": [
        "neko.works"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Partial Controller Support",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Indie",
        "Racing",
        "Simulation",
        "Sports"
    ],
    "tags": [
        "Racing",
        "Sports",
        "Indie"
    ],
    "achievements": 20,
    "positive_ratings": 106,
    "negative_ratings": 18,
    "price": 6.39,
    "description": "A modern arcade racing game inspired by the retro classics.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/444000/header.jpg?t=1547128102",
    "minimum_requirements": "Processor: Intel Core 2 Duo Memory: 1 GB RAM Graphics: NVidia GeForce GTS 450 DirectX: Version 11 Storage: 95 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Very fun old school style game.  You only need to use four controls, well really you only need three if you don't use the brakes.(cause slowing down is bad) It take multiple tries to learn the track/course, but it's worth learning if you're gunning for the leaderboards.  It's hard to follow the upcoming turns in the night roads with the city lights, and the pink streets with pink landscape. Other than those two things it a pretty solid game.",
            "review_score": "1"
        },
        {
            "review_text": "Only played about a half hour of this game, but it is awesome! Especially for the price. Great soundtrack, colorful graphics, a great mechanic where the lighting changes based on what time of day it is, and extremely faced paced racing action. Reccomand to everyone who's a fan of arcade racers.",
            "review_score": "1"
        },
        {
            "review_text": "Decent start to what could be a good game but too short and too limited to justify even the $5.99 sale price. Get Final Freeway on android for $0.99 to get a much much better retro racing experience.",
            "review_score": "-1"
        }
    ]
}