{
    "app_id": 444260,
    "name": "Mindless Running",
    "release_date": "2016-02-18",
    "developer": [
        "Quiet River"
    ],
    "publisher": [
        "Quiet River"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Adventure",
        "Comedy"
    ],
    "achievements": 19,
    "positive_ratings": 235,
    "negative_ratings": 125,
    "price": 0.79,
    "description": "Mindless Running - it's a classic runner with story mode. Explore a randomly-generated world while listening to a unique soundtrack!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/444260/header.jpg?t=1493570649",
    "minimum_requirements": "最低配備: 作業系統: Windows XP, 7, Vista, 8, 8.1, 10 記憶體: 512 MB 記憶體 DirectX: 版本：9.0 儲存空間: 150 MB 可用空間",
    "recommended_requirements": "建議配備: 作業系統: Windows XP, 7, Vista, 8, 8.1, 10 記憶體: 1024 MB 記憶體 顯示卡: SLI Titan X or GTX 1090ti DirectX: 版本：9.0 儲存空間: 200 MB 可用空間",
    "reviews": [
        {
            "review_text": "Probably the MOST FRUSTRATING game to 100% Achievements on I've EVER played, across ANY platform! The precise timing involved in this game is EXCRUCIATING, ESPECIALLY on a laggy old clunker of a computer! That being said, it's:  A. Cheap B. has trading cards (cheap ones, even the foil ones!) and C. is 100% Achievable achievement-wise (gah! painful non-grammaratical errors!)  Once the frustration of 100%ing this game is over, it's pretty enjoyable afterwards...  WARNING: If you quit Story Mode to the Main Menu FOR ANY REASON, it WILL send you back to level ONE on Story Mode!  GOOD NEWS: Story Mode is only 4 levels long...  ACHIEVEMENT NOTES: For the Never Forget cheevo, sit in the end credits after story mode until it pops. For the AAA Toke Tope cheevo, spam-click on the developer's name in various places until it pops (not sure if it's anywhere, or a specific spot on the name, it dinged for me after spam-clicking the last name)  This game is recommended for its cheapness and access to trading cards and 100% cheevo'ability! =^_^=",
            "review_score": "1"
        },
        {
            "review_text": "Yes it's hard, but not because you just suck at it but because it feels rigged for failure.  You have to press the space bar to jump over spikes which are either vertical or horizontal and 9 times out of 10 you will die even though you didn't touch the spike. This is why this game gets a thumbs down. It's not good hard, it's  stupid  hard. The other complaint I have is that with some maps it's difficult to see the actual spikes because they are almost the same colour as everything else. I guess if you really hate yourself you could give this a go?",
            "review_score": "-1"
        },
        {
            "review_text": "  A simple endless runner. You might wonder what makes it special, right? Here's a list of why you should play this game: +Nothing +Nothing +Literally nothing  It may be harder than your average endless runner, but this one is full of almost pixel perfect jumps. Sometimes you even get obstacles or jumps that are impossible to pass. There's a story mode that you can finish in 5 to 10 minutes. Or even 2 minutes if you're good enough.  It's tedious, there's no leaderboard, and sometimes achievements fails to trigger. Especially those score-related ones. ",
            "review_score": "-1"
        },
        {
            "review_text": "the background will give you arthritis",
            "review_score": "1"
        },
        {
            "review_text": "Couldn't run it becuase i don't have SLI titan x's :(",
            "review_score": "1"
        },
        {
            "review_text": "I'M THE TRASH MAN. I START PLAYIN' GARBAGE!     Seriously, it uses music from stock music sites. That's not good.",
            "review_score": "-1"
        },
        {
            "review_text": "i dont like this game because ITS IMPOSSABLE. YOU CANT JUMP OVER THINGS HALF THE TIME",
            "review_score": "-1"
        }
    ]
}