{
    "app_id": 444420,
    "name": "24 Hours 'til Rescue",
    "release_date": "2016-02-19",
    "developer": [
        "J. Fletcher",
        "Michael Flynn"
    ],
    "publisher": [
        "BrainCraft Gaming",
        "FlynnFour Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Casual",
        "Indie",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Action",
        "RPGMaker"
    ],
    "achievements": 20,
    "positive_ratings": 24,
    "negative_ratings": 56,
    "price": 2.79,
    "description": "24 Hours ‘Til Rescue plunges you into dynamic, hand-crafted, city overrun by the undead with one, simple premise: to escape the city alive. Yet, with most of the streets barricaded, all of them teeming with enemies, and with rescue not coming for another 24 hours, the chances of survival are slim to none.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/444420/header.jpg?t=1456351426",
    "minimum_requirements": "OS: Microsoft Windows XP / Vista / 7  / 8 - (32-bit/64-bit) Processor: Intel Core2 Duo or better Graphics: Intel HD Graphics 4000, Nvidia GeForce 8000, ATI Radeon HD 4800 Series Storage: 200 MB available space",
    "recommended_requirements": "OS: Microsoft Windows XP / Vista / 7  / 8 - (32-bit/64-bit) Processor: Intel Core2 Duo or better Graphics: Intel HD Graphics 4000, Nvidia GeForce 8000, ATI Radeon HD 4800 Series Storage: 200 MB available space",
    "reviews": [
        {
            "review_text": "These controls are clunky, I had to fight with them just to loot the starting house. Then when I went on the street I was swarmed with zombies that I could not avoid or turn fast enough to shoot back at. Overall I feel like burning $4 would have been more fun.",
            "review_score": "-1"
        },
        {
            "review_text": "For a quick read: I cannot recommend this game because it is not an enjoyable game. I love challenging games and I love to test my skills in whatever any manner. This game, as what I have experienced, is hard only because it requires a player to be lucky enough to win a series of lottery, and know what is going to happen at certain time period. Thus, it is 100% not a delightful sight: on the contrary, it is a torturing, boring, and terrifying experience. If you are trying to find a game to test your skill, DONT buy this game. If you are trying to find a game to scare your ♥♥♥♥ out, DONT buy this game, you should only buy this game if you are boring enough to test your luck with terrible graphics and controls.   Below is my specific experience:   Long story short. After about 20 tries (was really a torture since I never die because I make a mistake, I only die if I enter a new area and got surrounded by 3-4 zombies which makes me cannot move, and these zombies attack 3 times a second and deals more than 400 damage so I die instantly without given any chance to fight back) I got a perfect start, killed everything on my way and was lucky enough to diable to anti-air weapons... Then I decided to try out a grenade. It was a tragedy: the grenade exploded indefinitely and killed several zombies like a thousand time (yes, these zombies just die repeatedly for some reason.) in a minute, which caused my top quality alienware to run as slow as a snail.  This game do not really challenge a player's skill. On the other hand, it challenged my patience and luck. Not to mention the weird control that makes the combat very much torturing. For a survival game , I would really expect it to challenge my skill of managing resources or defeating monsters, but this game requires a very good start (being lucky enough to find the right weapon, right tools, and right resources... at the very beginning.) to even let you start playing it (well, or you die after several minutes of running). And you just need to be unlucky (not... very unlucky) once to get killed (and hell yes, this game has permadeath).   The pros listed by previous reviewer. I totally DISAGREE.  First because this game is not fun (well was fun for the first hour... untill I noticed the true nature of this game).  Second mutiple difficulty levels and characters to be unlocked is... nothing special, you only mention them when there is nothing else to mention.  Third, the music is horrible, it would be fantastic if the music scares me but no, the music only makes the game experience as bad as possible.  AND STEAM ACHIEVEMENTS: no I do not want to argue around this topic.   I have already written my feeling about this game, again, it will be up to you to choose if you want to buy this game, but unless there is a major change to this game, I will not recommend this game, and will never try to play it again.   Thanks for reading!",
            "review_score": "-1"
        },
        {
            "review_text": "Good about this game: First you get to kill zombies who doesn't love killing zombies ! The bad guys are also AI like the zombies.  'I really like this game. Zombie killing is great and it is really hard to survive. I love the fact you can play as different characters and I especially enjoy all the crafting. I'd definitely recommend you give this a go if you like survival games'",
            "review_score": "1"
        }
    ]
}