{
    "app_id": 444480,
    "name": "Broken Dreams",
    "release_date": "2016-02-19",
    "developer": [
        "Mihai Morosanu"
    ],
    "publisher": [
        "New Reality Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Co-op",
        "Shared/Split Screen",
        "Steam Trading Cards"
    ],
    "genres": [
        "Casual",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Casual",
        "Platformer"
    ],
    "achievements": 0,
    "positive_ratings": 278,
    "negative_ratings": 119,
    "price": 1.59,
    "description": "A darkly-enticing story about unrequited love; Broken Dreams is a casual platforming game featuring full voice-acting, beautiful hand-drawn environments and a twist on the original platforming mechanic!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/444480/header.jpg?t=1460295203",
    "minimum_requirements": "OS: Windows 7 Processor: Intel Pentium 2Ghz Memory: 512 MB RAM Graphics: 1Gb Storage: 16 MB available space Sound Card: Stereo Sound",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I enjoyed it ... Simple as that :)",
            "review_score": "1"
        },
        {
            "review_text": "  Pretty good game but needed some more instructions on how to play it. The level where 10 lights had to be in sync took way too long to figure out. But I got a solid hour of gameplay so can't complain.",
            "review_score": "1"
        },
        {
            "review_text": "Game's pretty boring and the story is crappy. Bad Voice Acting and Graphics but kinda commend the Music for being soothing. But that's the only thing that's worth of the game. THE SOUNDTRACK! Don't bother buying these even if it's on sale.",
            "review_score": "-1"
        },
        {
            "review_text": "Why can I print from file? I thought I brought a game, not a school essay.  9/11 would print game again  (Would recommend if on sale otherwise don't bother buying it)",
            "review_score": "1"
        },
        {
            "review_text": "So I Beat Broken Dreams...and...dang lol but youll have to check out my Videos on my Channel when i get them Uploadeed ;) hope yall Enjoy them :D (my Channel is PHantom STar )     Thank you Reality Studi Games. Keep up the Great Work. i would Love to Test any Games you Come out with in the Future but thats Your Call.",
            "review_score": "1"
        },
        {
            "review_text": "It's okay I only bought it for .10 So no complaints",
            "review_score": "1"
        },
        {
            "review_text": "Well, this review will contain nothing about the gameplay, story, graphics and all that. I just wanted to write a review about the name, it's so true...it's like this game called 'irl' with the best graphics out there but the worst gameplay ever...most of that game ends up in the title of this game...",
            "review_score": "1"
        },
        {
            "review_text": "funny platformer game where you, just like st. Valentines, do everything to help boy and girl be together :) interesting levels, not trivial tasks, sometimes the boy refuses to jump - usually i don't play platformers but this one was so addictive i could make a break only at level 15 after numerous tries :)",
            "review_score": "1"
        },
        {
            "review_text": "► Amazing This Game. ★ ► Sounds 10/10. ♫ ► Graphics 10/10. ☣ ► Trading Cards. ✓  ♕ My Review™",
            "review_score": "1"
        },
        {
            "review_text": "My conclusion of the game. The gameplay was extremly amazing pressing the 'k' key to skip the levels and enjoy the awesome, heartbreaking story. I cry everytime its like mario you get to your princess (girlfriend) and then she is in another castle (level), quite amazing.",
            "review_score": "1"
        },
        {
            "review_text": "  The game is OK.It was a bit boring playn' it,but..Its OK",
            "review_score": "1"
        }
    ]
}