{
    "app_id": 444580,
    "name": "ALONE IN SPACE",
    "release_date": "2016-02-22",
    "developer": [
        "Butterflyware"
    ],
    "publisher": [
        "Butterflyware"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Partial Controller Support"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "Space",
        "Exploration"
    ],
    "achievements": 0,
    "positive_ratings": 80,
    "negative_ratings": 66,
    "price": 7.19,
    "description": "Experience an immersive sci-fi adventure.   Walk in the footsteps of the ill-fated crew members of the Miranda station. Explore a world cloaked in mystery and danger, solve clever puzzles to help discover the questions that...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/444580/header.jpg?t=1503302565",
    "minimum_requirements": "OS: Windows 7 32-bit 64-bit or higher Processor: 1.8 GHz Memory: 2 GB RAM Graphics: Intel HD 4000 series Storage: 2 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I got it at a discount, and it still feels like I've been ripped off. 'Immersive story'; what a lie. The background is entirely told through texts on screen. Sometimes, that text plays a role in solving the next 'puzzle'... in that it tells you you need a bomb, which you find on Oliver's desk. No need to tell you who Oliver is and where his desk is! Just do what you've been doing for hours already: Run around until you find something useful. Be careful not to die, or you have to retrieve everything again. Not that it's worth the effort. Because you wanna know how the game ends?   You escape in a ship, but your cryosleep pod fails and you die.   Yeah. Just like that. Even 'it was a simulation/dream all along' would've been better than that. Long story short, don't burden your wallet with this trash.",
            "review_score": "-1"
        },
        {
            "review_text": "This is basically a space-themed walking simulator with puzzles. And a bit of mystery. It takes about 5 h to finnish. If you like that sort of thing, go for it.  Not a bad game, but I found the ending disappointing.",
            "review_score": "1"
        },
        {
            "review_text": "6/10  I finnished the game in around 7 hours, then ran around again on the last save point to see if there was more to the game, or if i missed anything. The puzzles are ok, but apart from that it soon gets tiresome and predictable.  Thankfully I only paid £2.09 in the sale. ",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty nice game placed in space (well, its written in the name of the game so it should be in space!) Just wake up and start making those nice puzzles to make your way through. And because you are alone and everyone else seems to be gone, you can play some minigames on the ship, cool! And also you can play with balls all the time :D  But seriously... this game is pretty cool, I like the puzzles (good idea with anomalies). It´s made just by few people and I recommend it to everyone who likes space and balls.  + good graphics + nice and easy puzzles + minigames + space!  - maybe too much corridors - you could add some sound when the doors open, it´s weirdly quiet without it ;) - my tennis ball stuck behind the chair, couldn´t get it out.. but I made it!  Buy it, play it, enjoy it.. that´s all ;)",
            "review_score": "1"
        },
        {
            "review_text": "Really funny game ... there are still things to do ... but good idead ... pretty good engine and nice graphic",
            "review_score": "1"
        },
        {
            "review_text": "Nothing much really happens and I couldn't even complete it due to a puzzle near the end ( I think) where there is no explanation whatsoever.",
            "review_score": "-1"
        },
        {
            "review_text": "  And I would have paid 4,99$ for this...",
            "review_score": "-1"
        }
    ]
}