{
    "app_id": 444640,
    "name": "Bloons TD Battles",
    "release_date": "2016-04-20",
    "developer": [
        "Ninja Kiwi"
    ],
    "publisher": [
        "Ninja Kiwi"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Cross-Platform Multiplayer",
        "Steam Achievements",
        "Steam Trading Cards",
        "In-App Purchases",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Free to Play",
        "Strategy"
    ],
    "tags": [
        "Free to Play",
        "Tower Defense",
        "Multiplayer"
    ],
    "achievements": 16,
    "positive_ratings": 6486,
    "negative_ratings": 1227,
    "price": 0.0,
    "description": "Go head to head with other players in a Bloon-popping battle for victory. From the creators of best-selling Bloons TD 5, this all new Battles game is specially designed for multiplayer combat, featuring the ability to control bloons directly and send them charging past your opponent's defenses.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/444640/header.jpg?t=1515511178",
    "minimum_requirements": "OS: Windows 7 (32 &amp; 64bit) Processor: 1.5Ghz or better Memory: 512 MB RAM Graphics: OpenGL 2.0 Storage: 512 MB available space Sound Card: Windows compatible sound card",
    "recommended_requirements": "OS: Windows 7, 8 or 10 Processor: 2Ghz or better Memory: 1024 MB RAM Graphics: OpenGL 2.0 compatible, ATI, Nvidia or Intel HD Storage: 512 MB available space Sound Card: Windows compatible sound card",
    "reviews": [
        {
            "review_text": "I'm suprised that BTD Battles actually made it to Steam, and It works very well.  Although, it dosen't seem anymore different to the Mobile edition with some exceptions, such as a monkey hand for a cursor, using 1,2,3, etc. for hotkeys, upgrading ( , and . ) and some other features. I remember when BTD Battles came out for FLASH, and everyone USED to play it on the Ninja Kiwi website. Till it came out for mobile, than nobody played the Flash version.  I REALLY like you can play this with the players on Steam and on an iPad/Android, so you'll not have to wait about 20 seconds to fight someone (unless you have really bad connection, if so, you shouldn't play this game). And connecting to the Steam Cloud and the Ninja Kiwi Cloud, I found that really useful if you had a record before.  But of course, there are some problems.  I'm a bit dissapointed that if you want to have the best of BTD Battles, You'll need to pay for it, and the Club Rooms is a perfect example. I don't really wanna pay 5 USD (I'm Australian, so I'd have to pay more) just for new maps and different gamemodes.  And also slowly having to play for hours on end to unlock the best towers, it's gets quite frustrating that you want to unlock a 4th tier Bloonchipper, but if you're into the grinding genre of games, I guess it's alright...  Also, I would want to be able to customise hotkeys, but if that is not going to happen, it's ok, I guess. BUT there is no hotkeys to send out Bloons, and I'm REALLY used to do that. It's really weird.  Overall, I'm glad this went onto Steam, and I'll be playing it on Steam, the game itself is great, challenging and competitive. (I mostly wrote about the Steam and Mobile version and differences, sorry.) But I shouldn't be able to pay 6.40 AUD to have access to the more interesting features of the game. Also, Hotkeys. Give me dem hotkeys man.  EDIT: Oh god I went over this after 1 day, and this review is so so bad,",
            "review_score": "1"
        },
        {
            "review_text": " Basic Information",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would nolife again.  Some would say that this game follows a pay to win model because either A) they ran out of medallions, or B) they got owned by someone with a trillion cobras and what not. If you run out of medals it's not that hard to get them back if you know how to rush properly especially. Nobody is forcing people to play battle arenas, anyway. I also saw a few reviews claiming to get towers it was a massive grind, however even as a noob to the game I managed to grind out all the towers (minus the t4 I don't use ever) in about 6 or 7 hours. To me this isn't very bad, but then again I also enjoy mmo grinds. Anyway, if you're looking to burn some time and don't mind putting in a bit of effort to learn the game, it's a great pick!",
            "review_score": "1"
        },
        {
            "review_text": "This is a very fun game. It has a unique competitive twist where you throw balloons to kill the other player! What's not to love about throwing balloons at other players? Especially giant green and black ZOMGs that are probably making them scream 'oh crap, oh crap, oh crap.'",
            "review_score": "1"
        },
        {
            "review_text": "If you know anything about the Bloons series you know its fun. This game is no exception. Very solid TD. Build-Send balloons-upgrade and repeat. The multi-player seems to work properly. I'm not so sure about the 'club' thing or the in-game purchases but it doesn't seem to break the game. Anyways if you like Tower Defenses then you will like this game. Keep in mind it's mp only. Have fun! -Casey",
            "review_score": "1"
        },
        {
            "review_text": "Meh nice game good time waster but love it keep up the good work! recommended!",
            "review_score": "1"
        },
        {
            "review_text": "Fun And Nice Arts! 11/10 Wait? This is possible? YES!!!",
            "review_score": "1"
        },
        {
            "review_text": "very good game, recommend to all i play hours and hours and hours day after day night after night very good game",
            "review_score": "1"
        },
        {
            "review_text": "i think this game is very fun and i love playing it &lt;3 ",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, but the hotkeys to sell towers (backspace) and to stop holding a tower (esc) should be added.",
            "review_score": "1"
        },
        {
            "review_text": "Bloons TD Battles is a great game but matchmaking takes ages and rarely ever finds people, even on the first battle arenas; my experiences on iOS/Android were much better. However, there are still some good things about the game like cloud saving, so you can play on the same account on multiple platforms and devices. But overall Bloons TD Battles is a very fun, gameplay-wise.",
            "review_score": "1"
        },
        {
            "review_text": "A different take on Bloons Tower defense, I'm really enjoying this game. All of the aspects of this game are quite enjoyable and it has the feel of the classic BTD games we all know and love. It's even built to be a co-op game by default, which is really cool- and it's cross platform. You don't get better than that. It's a very smooth-running game, where the graphics really don't matter. I definitely recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Great game",
            "review_score": "1"
        },
        {
            "review_text": "That's a nooice game boi.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best Tower Defence games that is free",
            "review_score": "1"
        },
        {
            "review_text": "i can't reset my game content",
            "review_score": "1"
        },
        {
            "review_text": "Gets boring very fast... Only worth the time if you are willed to pay money...  Also: This is unlike the browser version; you just have a tiny peace of content what you used to have in the browser version",
            "review_score": "-1"
        },
        {
            "review_text": "this game is very adicting i play it once a week and its very good so i suggest you to download this game have a great time playing!!! ",
            "review_score": "1"
        },
        {
            "review_text": "  this is a good game but it is nor realy my style of game but if you like it i wont judge you i give this game a 8.5 out of 10",
            "review_score": "1"
        },
        {
            "review_text": "Took someone coins or whatever they are xD  11/10",
            "review_score": "1"
        },
        {
            "review_text": "A great addition to the most addictive Tower Defense game franchise. Great work Ninja Kiwi.",
            "review_score": "1"
        },
        {
            "review_text": "i like this game alot of people would say its pay to win but i disagree with them i have unlocked all tier 4 towers and have gained 24k medalions with only 60+ hours played and not spending a single penny the game takes a little bit of skill and micro and as long as you can do that its pretty simple to win also alot of people seem to engage 'hackers' and with over 300 games played i did not encounter a single hacker so yeah...  in the end i give the game a 9/10 as some stuff like glitches and things are not prefect but thats a good game probably ninja kiwis best one",
            "review_score": "1"
        },
        {
            "review_text": "This game is absolutely fantastic. Will again.  Graphics are lovely!",
            "review_score": "1"
        },
        {
            "review_text": "As someone who has played BTD Battles since it's release on Mobile devices, I have had a huge blase. Finding new techniques and ways to humuliate your player, and the game has just gotten better over time. The new battle arenas are cool, but what bothered me at first were 'Club Access' but I've bought Club Access with the limited offer, and I am having more fun then ever. I absolutely love the bananza mode.  I don't see much cheaters, and the best part is is that I can play on mobile and continue on Steam and anywhere else.  Fantastic.  8/10  Cons -  More decals. ",
            "review_score": "1"
        },
        {
            "review_text": "The game is quite fun, quick and easy to pick up, but it can take quite a while to find a game some times.",
            "review_score": "1"
        },
        {
            "review_text": "Love this game so much",
            "review_score": "1"
        },
        {
            "review_text": "i like the game, but i find it sad that people have to cheat in order to win. this game isnt hard, you dont have to cheat...",
            "review_score": "-1"
        },
        {
            "review_text": "GREAT game crikers",
            "review_score": "1"
        },
        {
            "review_text": "&gt; enters game &gt;round 18, big mother♥♥♥♥ing red ballon comes out &gt; I lose &gt;enters game &gt; lose &gt;??? &gt;lose &gt;buys a tower &gt;lose &gt;♥♥♥♥  360/10",
            "review_score": "1"
        },
        {
            "review_text": "I thought: 'Hey I can play BTDB on steam!' I backed up my data, I had every tower unlocked, but no upgrades. So I was left with the inability to progress in the game. I faced higher level people so I couldn't win. Thanks for wasting my time.",
            "review_score": "-1"
        },
        {
            "review_text": "block cheats please",
            "review_score": "-1"
        },
        {
            "review_text": "It doesn't take long to realize how pay-to-win the games are with microtransactions. Go play bloons monkey city instead, where you can avoid microtx effectively and still have fun.  EDIT: Don't hate the player, hate the game",
            "review_score": "-1"
        },
        {
            "review_text": "  very fun and competetive",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game!!",
            "review_score": "1"
        },
        {
            "review_text": "Really cool game",
            "review_score": "1"
        },
        {
            "review_text": "i played this on my phone once",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME IS AWESOME",
            "review_score": "1"
        },
        {
            "review_text": "Pay 2 Win. Want better monkeys PAY. Want to improve your towers PAY.  Fun for Bloons fans that play casually vs ai. Or people with to much money who want to win.",
            "review_score": "-1"
        },
        {
            "review_text": "Pros:  -Classic BTD style gameplay (But only allowing 3-4 towers). -Multiplayer. -Quick to find matchs (a couple secs). -Good fps (hard to measure since I have a good pc, but never going below 60fps). -Strategy can beat power (people may have unlocked more tower upgrades, but with strategy, anyone can win).  Cons:  -Could be considered P2W (I think strategy can beat it though). -No graphics options. -Nothing really new to the actually content (Only really one tower that is really expensive). -Connection issues (some people will have bad connection making you play in slow-mo). -Hacking (I have heard of hacking, but never seen it).    There are a lot of cons, but don't take that as a bad thing since most of them won't affect you much.",
            "review_score": "1"
        },
        {
            "review_text": "Its a great game, but you can't transfer your web version save to here, so I have to start again.",
            "review_score": "-1"
        },
        {
            "review_text": "this game is awesome for tower defense must play game it also live battle",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good game, but it has a bit of P2W in it. It's a pretty good time-waster.",
            "review_score": "1"
        },
        {
            "review_text": "9/10 not enough monkey porn",
            "review_score": "1"
        },
        {
            "review_text": "Man, i love these games. A lot of things about them is great. Really, You need to play this.  Ratings Music: 2.5 (Awful) Gameplay: 10/10 (AWESOME) Graphics: 7 (Good) Overall: 8 (Great)",
            "review_score": "1"
        },
        {
            "review_text": "ill let you bloon my TD battles ░░░░░░░░░░░░░░░░░░░▒▓▓█████████████▓▓▒░░░░░░░░░░░░░░░░░░░░░░ ░░░░░░░░░░░░░░▒████▓▓▒▒░▒▒▒░▒▒▒▒▒▒▓▓████▓▒░░░░░░░░░░░░░░░░░░ ░░░░░░░░░░░▒███▓░░░░░░░░░░░░░░░░░░░░░░▒███████▓▓▒░░░░░░░░░░░ ░░░░░░░░░▒██▓░░░░▒▒███▓▓▒░░░░░░░░░░░░░▓▓▒▒▒▒▒▓██████▓░░░░░░░ ░░░░░░░▒██▓░░░▓███▓▒░░░░░░░░▒▒▒▒▒▒▒▒▒▒░░░░░░▒▓▓███▓████▒▒░░░ ░░░░░░██▓░░▒▓██▓░░▒▓██████▓░░░░░░░▒░░░░░░▒██▓▒░░░▓███▒▓▒░░░░ ░░░░░██░░▓███▒░░▒██▒░░░░▒▒██▓░░░░░░░░░░░██▒░░░░▒████▒█░░░░░░ ░░░░██░▒▓▒▓▓░░░██░░░░░░░░░░░█▓░░░░░░░░░██░░░░░░▒███░░█▒░░░░░ ░░░▓█░░░░░░░░░██░░░░░░░░░░░░▓█░░░░░░░░██░░░░░░░░░░░░░█▒░░░░░ ░░░█▓░░░░░░░░░█▒░░████░░░░░░░█▒░░░░░░░██░░░░░░░░░░░░███░░░░░ ░░▒█░░░░░░░▒▓▒█▓░▓████▓░░░░░▒█░░░░░░░░▒█▒░░░░░░░░░░██░█▒░░░░ ░░██░░░░░▒▓▒▓▒██▒▒▓▓▓░░░░░░░██░░░░░░░░░▒████▓███████▓░█▒░░░░ ░░█▓░░░░░▒░░░▒░▒██▓▒░░░░░▒██▓░░░░░░░░░░░░░░██▓░░░░░░▒██▓░░░░ ░░█░░░░░░░░░▓▒░░░░▒▓██████▓░░░░░░░░░░░░░░▒██░░░▓█▓▓▒░░░██░░░ ░▒█░░░░░░░░░░░░░░░░░░░░░░░░░░▓▒▓▒▒▒▒▒▓▓▓▓██░░▓█▓░▒▒██▒░░██░░ ░▓█░░░░░░░░░░░░░░░░░░░░░░░░░░▒▒▒▒▒▒▓▓▒░░██░░██▓░▒░▒░██░░▒█░░ ░██░░░░░░░░░░░░░░░░░░░░░░░▒▓▒▒▒▒▒▒▒▒░░░██░░▓█░█▓░█▒█▓█▓░░█░░ ░██░░░░░░░░░░░░░░░░░░░░░░░░░▒▒▒▒▒░▒▒░░▓█▓░░██░█▒▒█▒█▒▓█░░█░░ ░██░░░░░░░░░░░░░░░░░░░░░░░░▒░░░░░░░░░░▓█░░░█▒░░░░▒▒░░▒█░▓█░░ ░▒█░░░░░░░░░░░░░░░░░░░░░░░░▒▒▒▒▒▒▒▒▒▒░░█▒░░█▒░░░░░░░░▓█░█▓░░ ░░█▓░▒▒░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░▓█░░█▒░░░░░░░░█░▒█░░░ ░░▓█░░▒░░▒▒░░▒░░░░░░░░░░░░░░░░░░░░░░░░░░█░░█▒░░░░░░░█▓░█▓░░░ ░░░█▒░░▒░░▒░░▒▒░░░░░░░░░░░░░░░░░░░░░░░░░█░░█▒░░░░░░▓█░░█░░░░ ░░░██░░░▒░▒░░░▒▒░░░░░░░░░░░░░░░░░░░░░░░░█░░█▒░░░░░░██░░█░░░░ ░░░░█▓░░░▒░▒░░░░▒▒░░░░░▒▒▒▒▒▒░░░░░░░░░░▒█░▒█░░░░░░░█▒░░█▓░░░ ░░░░▓█░░░░▒▒░░░░░▒▒░░░░░░▒▒▒▓▓▓▒░░░░░░░██░██░░░░░░░██░░▓█░░░ ░░░░░██░░░▒░▒░░░░░▒░░░░░░░░▒░▒▒▓█▒░░░░▒█░░█▓▒▓▓▓▒░░▓█░░░█▒░░ ░░░░░▒█▒░░░▒▒▒░░░░▒░░░░░░░░░░▒▒▒░▒▓░░░██░▒█░░░░▒▓▓░░██░░█▒░░ ░░░░░░▒█▒░░░▒░▒░░░▒░░░░░░▒▒▒░░░░▒▒░░░▒█░░██░░░░░░░█░▒█░░█▒░░ ░░░░░░░▓█░░░▒░▒░░░░▒▒░░░░▓▒▒▓▓▓▒░░▓▒░██░░██▒▒▒▒▓▒▓▓███░░█▒░░ ░░░░░░░░██░░░▒░▒░░░░░▒▒░░░░░░░░▓█▓░░░█▓░░██░▓█░█░█░░█▒░░█▒░░ ░░░░░░░░░██░░░░▒▒░░░░░░▒▒░░░░░░░░▒█▓░█▓░░▓█▒▒█▒█░█▒██░░▒█░░░ ░░░░░░░░░░██▒░░░░▒░░░▒░░░▒▒░░░░░░░░▒▓██░░░██░░░░▒▒██░░░██░░░ ░░░░░░░░░░░▓██░░░░░░░░▒▒░░░▒░░░░░░░░░▓█░░░░▓███▓▓██░░░██░░░░ ░░░░░░░░░░░░░▓██▒░░░░░░▒▒▒▒▒░░░░░░░░░░██░░░░░░▒▒▒░░░░██░░░░░ ░░░░░░░░░░░░░░░▓███▒░░░░░░░▒▒▒▒▒▒▒▒░░░░▓██▒░░░░░░░▒███░░░░░░ ░░░░░░░░░░░░░░░░░▒▓███▓▒░░░░░░░▒░░▒▒▒▒░░░▒██▓██████▓░░░░░░░░ ░░░░░░░░░░░░░░░░░░░░░▒████▓▒▒░░░░░░░░░░░░░░░▓██▒░░░░░░░░░░░░ ░░░░░░░░░░░░░░░░░░░░░░░░░▒▓████▓░░░░░░░▓█████▒░░░░░░░░░░░░░░ ░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░▒█████████▒░░░░░░░░░░░░░░░░░░░ ░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░▒▒▒░░░░░░░░░░░░░░░░░░░░░░░ ",
            "review_score": "1"
        },
        {
            "review_text": "played with my friend we came up with a whole theroy of how robo hitler and OPEC teamed up to make the bloons and how the glue is monkey ♥♥♥♥. great time",
            "review_score": "1"
        },
        {
            "review_text": "Getting this on Steam was a bad idea in my case. As I already have a NinjaKiwi account. It's very strange having two accounts and it's not set up properly to work with two accounts.",
            "review_score": "-1"
        },
        {
            "review_text": "This is fun for a while lol",
            "review_score": "-1"
        },
        {
            "review_text": "I have been a fan of the mobile version and the flash version for years. SO glad this finally came to PC!!!",
            "review_score": "1"
        },
        {
            "review_text": "Welp, You Can Say That Games Have Everything. Adventure,Action And Others But To Things Are Missing. Strategy And Free To Play. This Game I Used To Play It About A Year Ago On My Phone And I Loved It I Had Tier 4 Bommerrang Towers And Tier 3 Wizards. And Im So Glad Its Now On Pc. Im Just Saying This Game Should Be Played By Everyone. Kids,Teens And Adults. Thats All I Gotta Say.",
            "review_score": "1"
        },
        {
            "review_text": "i bought the club acea and i didnt got it so it and i didnt got a refund from ninja kiwi so dont buy anything on this game",
            "review_score": "-1"
        },
        {
            "review_text": "Fix those lag bugs!.. People complaining that some are cheating coz bloons are going through without life going down. I say it's the game itself. When it lags, sometimes the game does not register some bloons that goes through.   Do i like this game? Hell yeah! but with this simple bug ♥♥♥♥, hell no i won't recommend.",
            "review_score": "-1"
        },
        {
            "review_text": "  ♥♥♥♥♥♥ game . He say Im connected to another device , but Im not .",
            "review_score": "-1"
        },
        {
            "review_text": "I really like this game its really good :P",
            "review_score": "1"
        },
        {
            "review_text": "I love it I would Reallu=y love if they took the cobra out or alteast get rid of some of the thnings becuase do you really want a tower with a gun? when the rest have darts? ",
            "review_score": "1"
        },
        {
            "review_text": "Press 'Esc' to quit the game.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would uninstall again",
            "review_score": "1"
        },
        {
            "review_text": " Finally on Steam!   Compete with fellow monkeys while still fending off intelligent plastic balls. Make your own plastic balls, coat them with ceramic, put them in a blimp, and send them to murder your fellow opponent monkey. Or you could just use a leech/Cobra to slowly drain your opponent of his/her/its health  without sending a single bloon .  Fun and addicting. Doesn't lag much, even for someone with a useless computer like mine. Great gameplay, too.  Would be better if the chat options had a 'Thanks!' or 'Wow!' Also needs more towers, in two days I've unlocked every single tower (not all tiers, but still). Network needs optimization. Still a fair amount of hackers. Attrition cobra op. A few bugs.  Entertaining, but definitely has room for improvement.    Also, why's there a Trading subforum? This game has no items.  ",
            "review_score": "1"
        },
        {
            "review_text": "I love this game!",
            "review_score": "1"
        },
        {
            "review_text": "A great example or how to port a mobile or browser based game to steam. Don't charge for it, have support for keyboard and mouse, and don't have the microtransactions so bad that it's impossible to play without them. The only part I don't like so far are the club game modes. They add new rules and make the game more fun, but you have to pay for it. And you can only challenge friends to them. Overall a decent game.",
            "review_score": "1"
        },
        {
            "review_text": "It's free, It's Bloons, and it's on PC. Get it, it's fun.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game developers, new updates often and much more bloonish, if you speak with me.",
            "review_score": "1"
        },
        {
            "review_text": "ok right now i hve 0.3hrs but in mobile i that game 3 years 604 wins 345losses",
            "review_score": "1"
        },
        {
            "review_text": "my favorite thing is when a game says its free then it makes you pay to do anything at all",
            "review_score": "-1"
        },
        {
            "review_text": "  good take on the Bloons franchise... except for the tons of poor UI limitations. - no replay function (you can't see what you did wrong or what your opponent did right). - lack of keybinds for sending balloons (the available keybinds are not even shown in-game) - poor use of screen real estate (probably because there's some mobile version) - tower descriptions often give insufficient info (price, attack speed, range, damage... all mostly missing) - bloon descriptions are pretty much completely missing in game - tower placement is still dependent on skillful mouse-pixelling; no snap-to-edge function - some towers require unnecessary micro: farms, gatling, etc - tower abilities don't allow targeting (and also have no keybinds) - incoming waves are neither described nor indicated  some gameplay elements are also not up to par for a multiplayer game: - no elo matching (it's pretty much a random matchup) - weirdly structured leaderboards (no way for newcomers to catch up without weeks of grind) - medal pricing is quite prohibitive for newcomers (be prepared to grind the first few days unless you git gud fast) - towers aren't very balanced (apprentice/ninja/buccaneer &gt; almost every other tower)  all in all, if you enjoyed the bloon TD games, this is a pretty fun take allowing you to match against other players. at the very least, the game isn't P2W. well, you could pay to unlock towers more quickly, and that COULD help you win; but it only takes at most up until your first weekly reward to unlock most towers.  nonetheless, until they upgrade the UI substantially, this game will annoy the heck out of you and force you to read copious amounts of guides just to find out what towers do, which bloons to send when, and why certain waves + assault are so powerful. if you just want a casual versus game, might wanna look elsewhere.",
            "review_score": "-1"
        },
        {
            "review_text": "so ♥♥♥♥ing many cheaters",
            "review_score": "-1"
        },
        {
            "review_text": "This easy butter chicken recipe can be made in 35 minutes and is SUPER delicious. It's rich, creamy and addictive. It's also very easy to make dairy-free!    Makes: 4 servings   Ingredients 2 tablespoons grapeseed oil (or another neutral flavoured oil) 1 lb. chicken breast or tenders (see notes) 2 yellow onions, roughly chopped 3 tablespoons chopped ginger 6 garlic cloves, crushed 1 tablespoon garam masala 1 teaspoon ground turmeric 1 teaspoon coriander, ground or seeds 1 teaspoon cumin, ground or seeds ¼ teaspoon fenugreek, ground or seeds ¼ to 1 teaspoon chili powder Seeds from 4 cardamom pods 1 - 28-ounce can of crushed or diced tomatoes 2 tablespoons almond butter 2 tablespoons dairy or coconut cream 2-4 tablespoons brown sugar, to taste Optional: 2 tablespoons plain yogurt Sea salt, to taste (I like about 2 teaspoons)  1.Heat 1 tablespoon of the oil in a medium-sized frying pan over medium-high heat. Add the chicken breasts or tenders and cook, stirring frequently, until they are cooked through and no longer pink, about 12-15 minutes. Remove them from the pan and cut them into 1-inch chunks.  2.While the chicken is cooking begin preparing the sauce. Add the remaining tablespoon of oil to a large skillet over medium-high heat. Add the onion and cook, stirring occasionally, until the onion starts to brown, about 10 minutes. Add the garlic and ginger and cook for 1 minute more.  3.Add all the spices all at once, or remove the pan from the heat for a moment while you add them. (garam masala, turmeric, coriander, cumin, fenugreek, chili powder and cardamom seeds) Let the spices cook for about one minute, or until they are quite fragrant. Add the tomatoes to the pan and scrape up any stuck on brown bits. Add half a cup of water and bring the pot to a boil. Lower the heat to medium and let the sauce simmer for 15 minutes.  4.Carefully add the sauce to your blender and blend on high until it is very smooth. Add the sauce back to the pan and stir through the almond butter, dairy or coconut cream and the optional yoghurt.  5.Serve with a side of rice.",
            "review_score": "1"
        },
        {
            "review_text": "  awsome!!!",
            "review_score": "1"
        },
        {
            "review_text": "Its a ♥♥♥♥ gamr",
            "review_score": "-1"
        },
        {
            "review_text": ".",
            "review_score": "-1"
        },
        {
            "review_text": "this game is offensive",
            "review_score": "-1"
        },
        {
            "review_text": "Bloons TD Battles is a very fun an tower defence game which gives you a diffrent experience every match. You cant use the same strategy everyime you allways have to adapt to what the other player is doing otherwise you will most likely lose. There is many diffrent towers which have diffrent special abiltys that are all helpfull in their own way. There are also alot of fun diffrent maps which have their own layouts that force you to put ur towers in diffrent uses and lanes which might sound pretty obvious but this is my first 'legit' review so forgive me. But anyway if you really like tower defence games you will really like this game. And if you havent played tower defence games you really should try this one out! Anyway enjoy some games of Bloons TD Battles!",
            "review_score": "1"
        },
        {
            "review_text": "Too many hackers and .",
            "review_score": "-1"
        },
        {
            "review_text": "They put a lot of effort to either remove or make you pay for most of the features of a flash game that is free online, but didn't even try to add a close button.",
            "review_score": "-1"
        },
        {
            "review_text": "We Need To conect thorw FaceBook ;(.bUT I is a fun game ;333 101/101 wood play agine",
            "review_score": "1"
        },
        {
            "review_text": "Coming from a former MKOTH player I must say, well done for porting this over to steam. Cross platform between android and gamecenter and googleplay + hotkeys to help u out....well done Ninjakiwi, well done.   9/10 - TheDistantNeko",
            "review_score": "1"
        },
        {
            "review_text": "this game wont work for me and i tried everything this new update sucks it ruined my favorite game",
            "review_score": "-1"
        },
        {
            "review_text": "it wont let me play the game now it keeps sating (erro coad 81)",
            "review_score": "-1"
        },
        {
            "review_text": "Its about time!!  I played this alot on mobile, glad to see it on the steam store.  Download it, it is free!",
            "review_score": "1"
        },
        {
            "review_text": "It tore me down from the inside. I felt like I was playing one of those crappy advertised games that you see on TV. 10/10 Would NOT see John Cena popping balloons again. (e,e)",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "A perfect example of how to create a money grabbing P2W game that doesn't bring on any of the charm of the originals. ♥♥♥♥ing terrible",
            "review_score": "-1"
        },
        {
            "review_text": "It's basically a pay2win and ruined Bloons Tower Defense",
            "review_score": "-1"
        },
        {
            "review_text": "Microtransaction simulator 8/8 Would uninstall again.",
            "review_score": "-1"
        },
        {
            "review_text": "10/10 would get dunked on by my friend again",
            "review_score": "1"
        },
        {
            "review_text": "Pay 2 Win  You have little towers at your disposal at the start of the game, and guess what? The good ones can be unlocked with real money.",
            "review_score": "-1"
        },
        {
            "review_text": "Not at all like the other games.  This game limits you to using 3 towers instead of having access to all of them at the same time.",
            "review_score": "-1"
        },
        {
            "review_text": "  Its nothing like the originals! There arent even super monkeys. Its Hardcore Pay to win.",
            "review_score": "-1"
        },
        {
            "review_text": "THIS GAME RUNS THROUGH THEIR STUPID WEBSITE, NOT STEAM(PARTY OPTIONS). I JUST WANTED TO PLAY WITH FRIENDS. FORCES YOU TO DO TUTORIAL, THEN FORCES YOU TO PLAY ONLINE AGAINST A RANDOM OPPONENT, THEN OTHER DIRTY THINGS.",
            "review_score": "-1"
        },
        {
            "review_text": "It's hot garbage",
            "review_score": "-1"
        },
        {
            "review_text": "A ♥♥♥♥ing Pay to win strategy game......how the ♥♥♥♥ is it called strategy if a item you bought plays the game for you.....Blows ♥♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "i FOUND IT VERYGOOD BUT IT HAS NO BUTTON TO CLOSE IT SO i TRIED TO GET UP BUT i WAS TAPED TO MY CHAIR WHICH i WONDERED 'how did that happen?' BUT WHEN i TRIED TO MOVE MY CHAIR IT WAS BOLTED TO THE GROUND AND AFTER THAT i LOOKED OUT MY WINDOW AND i FOUND OUT MY HOUSE WAS IN SPACE! SO PLEASE DO SEND HELP i HAVE NO IDEA WHERE i AM AND i THINK i'M RUNNING OUT OF OXYGEN i JUST HOPE MY FAMILY FINDS THIS SO THEY KNOW WHAT HAPPEND TO ME. IF YOU SEE THIS i LOVE YOU ALL GUYS AND i WILL MISS YOU. LOVE THOMAS.",
            "review_score": "1"
        },
        {
            "review_text": "Good multi-player and syncs with mobile.",
            "review_score": "1"
        },
        {
            "review_text": "In defence mode Focus on your economy first. ie get 1 tower out then wait for the 1000 and double your economy then toss a second tower till you have enough cash to keep tossing more towers and upgrades.",
            "review_score": "1"
        },
        {
            "review_text": "eh, decent, although nowhere near as good as BTD5",
            "review_score": "1"
        },
        {
            "review_text": "How to win:  tower loadout: Boomerrang Monkey, Monkey Village, (Tower of your choice) first, but down a boomerrang monkey and updgrade it to bionic boomer. then place a monkey village next to the bionic boomer and upgrade the village to radar scanner. this will let the bionic boomer hit camo bloons. keep placing bionic boomers in the radius of the monkey village. then place the tower of your choice in the radius of the monkey village. the only thing that this loadout cannot help you with is if a ZOMG comes towards you.",
            "review_score": "1"
        },
        {
            "review_text": "Pop the ballons!",
            "review_score": "1"
        },
        {
            "review_text": "It be good bro.",
            "review_score": "1"
        },
        {
            "review_text": "A lot of fun when you play it with friends, but not fun if you have a losing streak in Ceramic Crucible",
            "review_score": "1"
        },
        {
            "review_text": "BTD Battles is a fun game and easily a time waster. I've had it on my phone for the longest time and i backed up my data so i got all my monkeys, so its easy to save aswell. I've had this game for a while and it'l never get old. Its worth getting!",
            "review_score": "1"
        },
        {
            "review_text": "I saw this game and got my friend to play it too. And it was actually really fun. We hadn't played a BTD game for a couple of years since we left primary school and it was really fun expecially with the addition of playing against each other. It seems pretty balanced unless your facing someone who has been playing for a lot longer of PAYING for longer. Some fun competetive leaderboards and modes and challenges.   Short version: Fun competing against other players. Even more fun competeing against your friends! Micro transactions, but avaoidable. A bit grindy without microtransactions. Competative leaderboards.  Story time! My friend didn't know that you could spawn baloons so i won a fair few games thanks to that. It was hard to not laugh as he was being absolutely swarmed when i was just brushing off a few dozen baloons.  ",
            "review_score": "1"
        },
        {
            "review_text": "Well. Im not in the mood for typing alot. So. Just gonna say.  This game is awesome.   Just  Play It.  Trust me ;)",
            "review_score": "1"
        },
        {
            "review_text": "Its Free. And MONKIES. um get watch MasterOv he plays it",
            "review_score": "1"
        },
        {
            "review_text": "I very buch enjoyed this game, it's action and different towers, but I switched to the steam version because of all the lag I was getting but otherwise this was great.",
            "review_score": "1"
        },
        {
            "review_text": "A very good statagy game Although you cant call somebody a ♥♥♥♥♥ on chat.",
            "review_score": "1"
        },
        {
            "review_text": "A fun and interesting game! Like any other game, you can level up and get even more monkeys! And for some reason, the balloon popping is very satisfying and I have no idea why.",
            "review_score": "1"
        },
        {
            "review_text": "Riddled with hackers. They're literally in every second game. If they made a single player in this as well however, it'd be pretty ♥♥♥♥ing awesome.",
            "review_score": "-1"
        },
        {
            "review_text": "Very nice game!",
            "review_score": "1"
        },
        {
            "review_text": "pretty addictive",
            "review_score": "1"
        },
        {
            "review_text": "Besides the P2W aspect of this game, it is very much fun and competitive",
            "review_score": "1"
        },
        {
            "review_text": "Based on my experience~ This game has it's fun times to play with friends with either co-op or competitive! It's something for you to play if you need a change of pace or so and it has a 12 hour cooldown of the free prenium trial which you can enjoy a whole tons of contents to play with your friends or you could just buy them and unlock it permanently~",
            "review_score": "1"
        },
        {
            "review_text": "  Great game, but I was playing on assault mode, sent in a M.O.A.B, and out of the Bloons that reached the end, the opponent took no damage, meanwhile he/she sent one after me, and I took the damage and lost the match. The game is great, just needs this one fix.",
            "review_score": "1"
        },
        {
            "review_text": "This is a Great game .",
            "review_score": "1"
        },
        {
            "review_text": "It it AMAZING that they added Bloons TD Battles on pc for FREE",
            "review_score": "1"
        },
        {
            "review_text": "best free game on steam",
            "review_score": "1"
        },
        {
            "review_text": "multiplayer doesnt really work      nuff said",
            "review_score": "1"
        },
        {
            "review_text": "Too in your face about too many things that have nothing to do with a game. Make a game, sell it or give it away, people play. Stop ♥♥♥♥ing with ♥♥♥♥. Your game is marginally fun when you 'randomly' get matched against someone you have a 'chance' with / (that hasn't ♥♥♥♥ gold bricks to beat the game).  Next.",
            "review_score": "-1"
        },
        {
            "review_text": "It's good.",
            "review_score": "1"
        },
        {
            "review_text": "  First Things First: I have been a fan of the Bloons TD series since BTD1 came out, I had this game on my phone and played it with my brothers every day.  Real Stuff: THERE IS A WAY TO QUIT: HIT Esc OR THE TACKS IN THE TOP LEFT CORNER Great game  Pros: Large Fan Base Addictive Game Prizes for playing a lot in-game purchases not required play against your buddies or random strangers  Cons: takes awhile to get into a match if you are low level, sucks for you Assault--&gt; having a weakness (camo metal bloons) that's it",
            "review_score": "1"
        },
        {
            "review_text": "  It's a great game, however the flash version will always be the better version.",
            "review_score": "1"
        },
        {
            "review_text": "addictive",
            "review_score": "1"
        },
        {
            "review_text": "i´ve played this game a ridiculously amount of time and I still enjoy playing it!",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good game i would give it a four and a half out of fivei would recomend you to defintley play it!",
            "review_score": "1"
        },
        {
            "review_text": "is good to waste time",
            "review_score": "1"
        },
        {
            "review_text": "Very cool g8m Lov It 69.420/10",
            "review_score": "1"
        },
        {
            "review_text": "its much slower than bloons td5",
            "review_score": "1"
        },
        {
            "review_text": "Very good game. Could include a singleplayer maybe for practice.",
            "review_score": "1"
        },
        {
            "review_text": "Great free game. It is a copy of the mobile game with less lag! I'm loving playing it! The game play is fun, and although there are purchases you can make in the game, they are optional and aren't required to have fun or play the game.",
            "review_score": "1"
        },
        {
            "review_text": "Nice game",
            "review_score": "1"
        },
        {
            "review_text": "Not as good as the Browser version but stil good to pass the time.",
            "review_score": "1"
        },
        {
            "review_text": "I grew up playing Bloons TD on a terrible web browser, so naturally i enjoyed this alot.  I originally thought that Bloons were selling out with this, and that most of the possitive reviews are from little kids who dont know better. Now, after i played this game, that thought still hasnt change for me.  I guess im just a little kid then.  I have no idea why but i utterally enjoy this game. Whenever im bored i would just play it i would have a grand time. Of course there are some serious cons to this gmae, like the lack of towers compared to the orignal bloons, but still, im in love with this game.  Download this game if you really want to have tons of fun.",
            "review_score": "1"
        },
        {
            "review_text": "i Loved It! so much i play it every day!",
            "review_score": "1"
        },
        {
            "review_text": "fun game but i played this so much on my tablet and i cant transfer the data PLZ DO SOME THING about taht and i will be hapy :D ",
            "review_score": "1"
        },
        {
            "review_text": "This game is simple, easy to play and easy to hook on. I don't know why but me and my boyfriend, we play this straight for hours. It is just a 'kid' game to be silly back amongst the many 'adult' games.",
            "review_score": "1"
        },
        {
            "review_text": "Grate game, well done, only downside its not avalable for ubuntu",
            "review_score": "1"
        },
        {
            "review_text": "fun  worth all my time ",
            "review_score": "1"
        },
        {
            "review_text": "I love this game and play it every day! I hope more monkeys will be created in the future and can contain more content. It also works really well on slow computers. If you are looking for a multiplayer game I recommend this to you because it is fun and free to play.",
            "review_score": "1"
        },
        {
            "review_text": "very good game recomended",
            "review_score": "1"
        },
        {
            "review_text": "can anyone help? i cant download the club membership pack! it just wont work",
            "review_score": "1"
        },
        {
            "review_text": "Pretty Good ",
            "review_score": "1"
        },
        {
            "review_text": "Finally,i got over the terrible excuses of youtube channels for this game,such as Masterov and Ryan Chiew,and im beggining to like it! Its easy to run (you pretty much at least need a toaster to run it at 100 fps. Ive changed my mind and will say its pretty nice,nothing outstanding. And ive heard a rumor on ♥♥♥♥♥ (of all places) it will become an Esport! I dont agree with this, since there is no matchmaking system. Anyways on to cons and pros,the boring part in my opinion.   Pros- F2P,Easy to understand,Fun and well thought out gameplay in my opinion,lots of new content,Its not P2W.  Cons- Time consuming,no real focus on comp,no proper chat system. Finnaly its a nice game,worth playing 7/10",
            "review_score": "1"
        },
        {
            "review_text": "A new, free take on the Bloons TD games, definitely worth a shot if you like those games.",
            "review_score": "1"
        },
        {
            "review_text": "Great game",
            "review_score": "1"
        },
        {
            "review_text": "its very addicting 10/10",
            "review_score": "1"
        },
        {
            "review_text": "It's an alright game",
            "review_score": "1"
        },
        {
            "review_text": "I am so happy this game came on Steam. My favorite mobile game of all time, now as an easily reachable game on Steam. The gameplay can become very addicting, especially if you find yourself winning a lot and unlocking new towers. Games can last at least 2 minutes, or extend to 10 or more, depending on how good you and your opponent are. This game puts a nice spin on the Tower Defense genre, and has a nice player base at all times of the day.",
            "review_score": "1"
        },
        {
            "review_text": "They should add a Chat Box while playing against someone.",
            "review_score": "1"
        },
        {
            "review_text": "p2w crap ",
            "review_score": "-1"
        },
        {
            "review_text": "0/5 tutorial unclear. got ♥♥♥♥ stuck in toaster",
            "review_score": "1"
        },
        {
            "review_text": "If you want to play with me friend me on steam ",
            "review_score": "1"
        },
        {
            "review_text": "good game quality you just need to learn how it all works to master it.",
            "review_score": "1"
        },
        {
            "review_text": "Played the ♥♥♥♥ out of the browser version, same thing on steam. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "No. Dont play this. P2W.",
            "review_score": "-1"
        },
        {
            "review_text": "First off, I am no new comer to the game. After playing 30+ on the Android game (both battles and bloon TD 5) I have come to enjoy these games. I was very happy to see the game released on steam and so far I am loving it.  Pros: Easy to learn and enjoy. Ranking seems nice, not too OP matches VS new comers. Hours of gameplay packed into a game with no ending.  Cons: Game gets kinda boring after a while (Fix: Play in short terms, two matches then something else, then come back)   The whole, rechaging energy part (Fix: Don't waste the energy on map skips and such, OR: Follow fix 1.)  The Cobra tower seems, unbalanced. Its like a hack basicly but you can buy/spend your life earning (Fix: Have more stratagy, or just lose and move on)   Your internet pops out for 1 minute and bang. You now have an LOSE on your record. I know it wouldn't be good to not have that, (combat logging) but still. I guess that isnt really a con so I don't have a fix.    Thanks for reading!",
            "review_score": "1"
        },
        {
            "review_text": "i love the game... it is great but when you run out of metals wich are like turns you can play unless you buy more with real money",
            "review_score": "1"
        },
        {
            "review_text": "really fun :) great game",
            "review_score": "1"
        },
        {
            "review_text": "Played this a lot before it hit Steam, lots of fun!",
            "review_score": "1"
        },
        {
            "review_text": "best game ever!!!! and its free",
            "review_score": "1"
        },
        {
            "review_text": "This game is quite good with addictive and high-paced battles. The only problem I see about this is the steam multiplayer. I cannot join a steam match with my friends or make one without steam suddenly crashing with the game along with it. Other than this, the game is ok.",
            "review_score": "1"
        },
        {
            "review_text": "SO GOODZ FREEZ TEMMIE TOO EXITE AND TOO WELL DONE",
            "review_score": "1"
        },
        {
            "review_text": "this might be cuz im stoned af but this new bm feature they just added just adds 170% more fun to this ♥♥♥♥ing addicting game...  u wanna play for 5 mins and end up spending 6 hours spamming lil monkeys shootin ♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "When i first started and finished the tutorial it sent me straight into a game without me wanting to. It was really unbalanced in that game. I had only the basic balloons you get at start and he had all these other balloons. It said 100% win to him too which wasn't fair since i started, not sure if it was just that one game or others, ima do another game. Its still a fun game.",
            "review_score": "1"
        },
        {
            "review_text": "  good but im sorry it lacks almost all the things that the website has. for example. keys for deploying baloons to enemey and chatting with other player ext",
            "review_score": "-1"
        },
        {
            "review_text": "  It is an ok game a good time fill if your board. Other than that its free cant beat free.",
            "review_score": "1"
        },
        {
            "review_text": "If you read my review for BTD5 then you'll get this.   This is BTD5, but this time around your rival tribe's king saw your tribe's king sleeping with their wife (or vice versa)  So, you two go to war and hire bloons to eat your enemy's children and ♥♥♥♥ your enemy's women.  8/10  seems realistic enough.",
            "review_score": "1"
        },
        {
            "review_text": "Another pay to win game.",
            "review_score": "-1"
        },
        {
            "review_text": "I played the game since in came out on moblie and was addicted worse than anything else so i got a total of 30 million medalions and people who say its pay to win GET BETTER",
            "review_score": "1"
        },
        {
            "review_text": "  This game is cool and i realy like it",
            "review_score": "1"
        },
        {
            "review_text": "  A day without flash it a good one!",
            "review_score": "1"
        },
        {
            "review_text": "Shooting big colored testicles and sending big colored testicles to enemy. 11/10 would Rainbow Testicle again",
            "review_score": "1"
        },
        {
            "review_text": "  This is a good game in all. i wish there was a co-op mode tho it will be nice if they add it!!!",
            "review_score": "1"
        },
        {
            "review_text": "  some guy's name was lategameplease so i gave him a round 60 attack in 5 minutes",
            "review_score": "1"
        },
        {
            "review_text": "  this game is free so im down",
            "review_score": "1"
        },
        {
            "review_text": "Installed this to have a laugh, 24 laters I'm hooked on cartoonish game poping balloons. FML",
            "review_score": "1"
        },
        {
            "review_text": "Great game, I used to play this on my phone, and now that its on the PC I've started playing it again. Its a very well-balanced game and the leveling system gives it a long playtime.  9/10 *slight pay2win aspect",
            "review_score": "1"
        },
        {
            "review_text": "Played it on mobile, fun vidyagame.",
            "review_score": "1"
        },
        {
            "review_text": "It's funny ! ",
            "review_score": "1"
        },
        {
            "review_text": "this is the grates f2p game ive ever seen",
            "review_score": "1"
        },
        {
            "review_text": "You know bloons? Yes? No? That doesn't matter, because it's game for you ^^ I do recommend it, after over 300 matches played on mobile now I got my favourite game on my PC. Glorious.  But, you must be warned. Don't rush in Assault Mode, go arena for rushing.",
            "review_score": "1"
        },
        {
            "review_text": "not bad I played this game on my tablet when it was more populer this is a good port that is good to kill some free time. my only complaint is that the game gives you adds after almost every game I know it's free to play but if I want to buy the extra t shirts and stuff I will go on the store and get it.",
            "review_score": "1"
        },
        {
            "review_text": "So much frustration. And now that frustration has been added to steam. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "i have it on TAB And Phone",
            "review_score": "1"
        },
        {
            "review_text": "This is a really bad game, its pay to win to the knee I cant upgrade my units to the max while the enemy opponent has both more hours and literally statistical advantage over me. Ninjakiwi should be ashamed of himself go back and make bloons 6 singleplayer no more early access please.",
            "review_score": "-1"
        },
        {
            "review_text": "trying to login to Facebook but it does not work i am trying to log in to my Facebook account that has better stuff than Starter crap     How can i fix it?",
            "review_score": "-1"
        },
        {
            "review_text": "better version than for the mobile",
            "review_score": "1"
        },
        {
            "review_text": "It´s like the one in the phone, but in Steam.",
            "review_score": "1"
        },
        {
            "review_text": "It´s like the one in the phone, but in Steam.",
            "review_score": "1"
        },
        {
            "review_text": "The best game for free 30mins",
            "review_score": "1"
        },
        {
            "review_text": "love it me and my friend are just about to VS echother XD",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good game",
            "review_score": "1"
        },
        {
            "review_text": "I hate it would recommend :0 666/666  099085)547",
            "review_score": "1"
        },
        {
            "review_text": "I just want to know were the hell everyone gets all these different emoticons from... I see tons of emoticons that are not in the game but people have ones with a monkey with shades on and tons of different ones i tried looking it up but nothing online about it",
            "review_score": "1"
        },
        {
            "review_text": "I played this game on my phone, now moved onto playing on PC. PC is much better and more comfortable to me, and I still have a blast playing this!",
            "review_score": "1"
        },
        {
            "review_text": "A very good game!",
            "review_score": "1"
        },
        {
            "review_text": "I hope this game gets the 'best mobile game to PC award' because alot of mobile games going to PC are ♥♥♥♥ now",
            "review_score": "1"
        },
        {
            "review_text": "This game is a fun way to waste your time, Good to play with friends, rewards can be earned and strategy is required.",
            "review_score": "1"
        },
        {
            "review_text": "It turns me on",
            "review_score": "1"
        },
        {
            "review_text": "its really fun and its for free!! ",
            "review_score": "1"
        },
        {
            "review_text": "I love this game.",
            "review_score": "1"
        },
        {
            "review_text": "I have seen people play this game, I have played this game myself. I would say get this game because if you LOVE tower defense, this is surely the right game for you!",
            "review_score": "1"
        },
        {
            "review_text": "Fun free game to play with your friends when youre bored! :D",
            "review_score": "1"
        },
        {
            "review_text": "Ok 10/10 best game ever, but one problem steam says it is running but its not and i cant shut it down. Ive tried everything. Does anyone have this issue too?",
            "review_score": "1"
        },
        {
            "review_text": "What more do you want from this game you have monkeys and bloons ? this game is the best thing i have ever seen",
            "review_score": "1"
        },
        {
            "review_text": "it's a GREAT game i play it everyday it's awesome!",
            "review_score": "1"
        },
        {
            "review_text": "best game on steam.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome Game with strategies and bloons.",
            "review_score": "1"
        },
        {
            "review_text": "Very good classic game use to play this and the others back in school GG 10/10",
            "review_score": "1"
        }
    ]
}