{
    "app_id": 444800,
    "name": "NO THING",
    "release_date": "2016-04-07",
    "developer": [
        "Evil Indie Games"
    ],
    "publisher": [
        "Evil Indie Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "Adventure"
    ],
    "achievements": 12,
    "positive_ratings": 197,
    "negative_ratings": 27,
    "price": 2.79,
    "description": "The year is 1994 and it is the future. NO THING is a minimalistic surreal action game set in totalitarian regime of future. Tells the story of an office clerk who is sent with important message to the Queen of Ice.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/444800/header.jpg?t=1465991187",
    "minimum_requirements": "OS: Windows XP, Vista, 7, 8, 10 Processor: 2.0 Ghz Memory: 2 GB RAM Storage: 300 MB available space",
    "recommended_requirements": "OS: Windows 7, 8, 10 Processor: 2.0 Ghz+ Memory: 4 GB RAM Graphics: Pixel Shader 3.0 Storage: 300 MB available space",
    "reviews": [
        {
            "review_text": "A really weird but great game that requires the player to go left/ right at the right time or risk falling off the area and having to restart. It can get very difficult and frustrating as it gets faster and there is very little you can do to correct yourself if you go wrong.   Levels get progressively harder as you get further into the game (level 7 gave me more trouble than bloodborne. Evil Indie Games is a literal game description btw) with more difficult challenges. I died so many times on the first area alone, one at 99% complete -_- Music is really great and fits the psychadelic kinda style of the visuals. The story is so weird but interesting too in a way.  Will update as I play more but 10/10, would die at 99% area complete again.",
            "review_score": "1"
        },
        {
            "review_text": "If you ever wanted to run through a maze, out of your mind on meth, while Stephen Hawking reads you surrealist poetry, here's your game.",
            "review_score": "1"
        },
        {
            "review_text": "This is a minimalistic endless runner with 1980s style futuristic visuals envisaging a dystopian 1990s, made in the 21st century. Seems a good idea, eh?  All you do is push the left and right buttons to turn, and stay on the road. Sounds easier than it actually is.   Its levels that are just a bit too long, so I really hate it when I lose near the end of a level, because that means I have to do the exact same thing yet again and hopefully not screw up and the end.   Also, the runner doesn't run in exact straight lines parallel to the roads you run on, so if you land too near to the edge of a long stretch, your runner may fall off near the end. You can't really correct your errors - your runner can only turn every so often so for example, you can't turn then turn back again fast enough to move 'slightly to the left' to correct your errors.  The game is irritating like that.  Thankfully, as you run, some charming electronic music plays and an electronic voice speaks, and it gives you something to ponder about the world of the game, whoever the voice is, and whoever your character is.  ...actually, I switched the music off after a while, because it get a bit irritating after the first few hundred times because it becomes repetitive and was too chilled out and I wasn't. It's not a fault of the music, but a reaction to it. I put on some faster-paced music and found that I was playing better. Is this cheating?  Overall, I recommend this game. It's simple, and it's annoying, but it makes my brain wake up, and despite its flaws, I seem to keep coming back to it.",
            "review_score": "1"
        },
        {
            "review_text": "NO THING has taught me several life lessons to simplify my ways of living.  Some of the most memorable would be that the neighbors are eating dinner, also they happen to be watching TV, and I could not possibly forget the fact that I have also been taught about their relative location, specifically, that they are located behind the walls and doors.  Jokes aside, this game is a runner genre game, if that is a genre, never heard about it before I laid eyes on this game, it had me interested in it ever since I saw the cover picture in the store. At first I thought that somebody made a vaporwave meme come to life in the form of a game. I was baffled by the fact that the only gameplay is just switching directions by 90 degrees to the right or left and as I would soon learn, having to go a full 360 degrees to save yourself from the endless void underneath the pathways you navigate that make up the levels. The trailer had me hooked, the game is one of a kind if there aren't any other like it, which had me thinking about spending money on it.  So I did.  And I got what I wanted.  This is as simple as an indie about a simple office clerk gets, don't buy the game if you're not looking for uniqueness, it isn't even expensive, so I wouldn't say it's a waste of money if you don't like the game.  Not much to say about the plot as there's not much of a lead to catch onto, but you can make up your own ideas about what's happening in the game. The game has a pretty addicting soundtrack and it blends with the gameplay very well, the increasing speed as you turn makes it even better, in my opinion, all of that makes this game have a good replay value and a drawback effect, I just can't get enough of it. I've also found some exploits (level 3, turn slightly before the turned pathway and get stuck in the corner, press left/right repeatedly for a speed increase and point farming, if you want to place high in the leaderboards) and minor bugs (level 7 had me do some experimenting at the spawn point and I somehow had the character go diagonally, not straight, but this doesn't happen until you die repeatedly and respawn extremely quick, also can make you turn with little delay)  The soundtrack is stunningly amazing, can't wait for the DLC, will gladly pay for it, and would be even more glad to do so if the songs weren't simple loops ripped from the game, but I'll be happy with either.  I wonder what message the clerk was supposed to deliver though, probably a safety railing suggestion for every pathway.",
            "review_score": "1"
        },
        {
            "review_text": "Wow ! Amazing game, left and right arrow it's all you need.  That not because it's minimalist that you're going to pass this easily. It's a run / fast paced game. More and more difficult. So far i pass the first level.  Buy it my friends :)",
            "review_score": "1"
        },
        {
            "review_text": "this game is too weird to not be played. its addictive and frustrating and i love it.  its actually kinda poetic, nostalgic, the way it talks to you as a player. i didn't expect to LOVE this game as much as i do. i think the music were VERY well done.  ( you may wonder why i reviewed it early, well because the story is for you to figure out, plus i wont be finishing it anytime soon with the pacing i'm at = dying a lot )  as the game would say to me dying multiple times, ''It is Not The Time For Your Little Inner Fight'' so go play the game now and share the madness.",
            "review_score": "1"
        },
        {
            "review_text": "'Temple Run with an 80s techno motif!' NO THING is a simple yet challenging game, and reminds one what it truly means to be a maze runner. It's fast and unforgiving, and there isn't much variety as far as this reviewer got. If you enjoy pressing 'left' and 'right' with precise timing while watching a bare polygonal track with a computer rambling at you and cool 80s techno bumping in the background, then you'll probably enjoy NO THING.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good, a bit hard though.",
            "review_score": "1"
        },
        {
            "review_text": "I just completed level 10. I don't understand what I just spent 12.6 hours on.",
            "review_score": "1"
        },
        {
            "review_text": "it is not the time for your little inner fight the city is not sleeping this city is grey",
            "review_score": "1"
        },
        {
            "review_text": "I love this game, every one of the 10 levels have a unique feel to them and are progressively more challenging (apart from level 7). The game is quite mean with checkpoints but that works well because you really have to master the level to complete it. Despite this, the game never feels unfair or cheap and always gives you a fair chance, you can correct your course if you turn at the wrong time a lot of the time. And sometimes you can land somewhere earlier in the level, even though its hard to pull off.  I would recommend this to everyone, since its quite simple but very well made, the level design is great too!",
            "review_score": "1"
        },
        {
            "review_text": "this is the thing to play when you can't sleep at night",
            "review_score": "1"
        },
        {
            "review_text": "this ♥♥♥♥ fire",
            "review_score": "1"
        },
        {
            "review_text": "i'm crap at this game and i love it. don't play this if you don't like being frustrated and playing the same level over and over again. do play this if you like simple gameplay, fantastic music and that #aesthetic value",
            "review_score": "1"
        }
    ]
}