{
    "app_id": 444970,
    "name": "SPATIAL SOUND CARD",
    "release_date": "2016-03-13",
    "developer": [
        "NEW AUDIO TECHNOLOGY"
    ],
    "publisher": [
        "NEW AUDIO TECHNOLOGY"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "VR Support"
    ],
    "genres": [
        "Audio Production",
        "Utilities"
    ],
    "tags": [
        "Audio Production",
        "Utilities"
    ],
    "achievements": 0,
    "positive_ratings": 116,
    "negative_ratings": 52,
    "price": 7.19,
    "description": "The Spatial Sound Card is the first VR sound application by New Audio Technology. It provides virtual stereo or surround sound for any computer using regular headphones, also giving the choice between surround sound 5.1, 6.1 and 7.1.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/444970/header.jpg?t=1524758830",
    "minimum_requirements": "OS: Windows Vista, 7, 8, 8.1 or 10 Processor: Intel Core 2 Duo or AMD Athlon or newer Memory: 2 GB RAM Graphics: Standard Storage: 100 MB available space Sound Card: Standard Additional Notes: None",
    "recommended_requirements": "OS: Windows 7, 8, 8.1 or 10 Processor: Intel Core 2 Duo or AMD Athlon or newer Memory: 4 GB RAM Graphics: Standard Storage: 100 MB available space Sound Card: Standard Additional Notes: None",
    "reviews": [
        {
            "review_text": "If you have good sources, this software is nothing short of incredible. It takes surround input and gives you realistic headphone stereo. This isn't like the other headphone-surround tools I have used (Razer, etc), which produce an overly clinical sound. SSC uses room virtualization to make the sound echo from one speaker around the room, which takes the realism to a much higher level.  I have primarily tested this with Rainbow Six Siege and Mad Max. In R6 this has allowed me to quite accurately kill people through walls based on sound positioning. That is how good this really is.  SSC does have some technical issues for me, namely the sound 'popping.' This gets less significant over time, but it sounds really bad when testing immediatly after launching the program. In the five minutes it takes to actually get ingame the pops generally recede to an ignorable level.",
            "review_score": "1"
        },
        {
            "review_text": "11/10.  Just buy.",
            "review_score": "1"
        },
        {
            "review_text": "it's good but... it lags my laptop..... can you at least reduce the cpu usage for a bit?",
            "review_score": "1"
        }
    ]
}