{
    "app_id": 445140,
    "name": "Smell Of Death",
    "release_date": "2016-07-04",
    "developer": [
        "Alkame Games"
    ],
    "publisher": [
        "Alkame Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "VR Support"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Horror"
    ],
    "achievements": 0,
    "positive_ratings": 40,
    "negative_ratings": 14,
    "price": 9.99,
    "description": "Smell of Death is a Horror FPS virtual reality game includes action and horror items. The game consists of two game modes including Story and Survival.In story mode you can explore the manor with teleport.You should find magazines and keys.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/445140/header.jpg?t=1498177915",
    "minimum_requirements": "OS: Windows 7 SP1, Windows 8.1 or later, Windows 10 Processor: Intel i5-4590, AMD FX 8350 equivalent or better Memory: 8 GB RAM Graphics: Nvidia GeForce GTX 970, AMD Radeon R9 290 equivalent or better",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Good horror fps with some annoying bugs.  Pros: - good level design with some nice sound effects - good (and frightenly ugly) enemies - good shooting with pistol - nice slashing with sword (including separating limbs) - you can open closets and drawers and might find additional ammunition - enemies and items (ammo and keys) spawn on different locations each time you run the game  Cons: - reflections on sword are far too bright - very annoying bug: when you grab something (ammo, handle of a drawer or door) automatically the weapon that hand was holding is holstered. that might be ok, but automatic holstering also takes place if you pass doors (many are not really functioning and open only partially) or come close to a handle for other reasons. that way you end up with no weapon ready when beeing attacked. suggestion to the devs: just remove the code for the automatic holstering! - slashing with sword seems to have a very small hit box when you try to separate the head from the body",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome! And I will give you the reasons why! A) You don't get motion sickness so easily B) This is seriously terrifying game C) This is hard even though you play on easy D) It is very well made in my opinion E) It was worth the money! F) Super Fun! G) Super Scary  Yes I know i said scary twice but it seriously is scary!  Thanks to the Game Developers! Thumbs up!!!  Here's a link to my video where I scream like a little girl!         YouTube™ Video:  Smell of Death I ALMOST POOPED MY PANTS!&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Scary as ♥♥♥♥! I´m loving it so far!",
            "review_score": "1"
        },
        {
            "review_text": "Ok so I ran through the Tutorial and found both the motion and the controls to be absolutely solid, motion is achieved by swinging your arms as if you were a soldier marching and it works well, the swords and guns felt good and meaty as well.  So onto the main game, I loaded up and was immediately met by pinocchios' evil twin brother and a load of arms coming out of the ceiling........I then quit the game and will return as soon as my nerve does :P   Great game from what I have seen.  10/10 cowardice/nope simulator.",
            "review_score": "1"
        },
        {
            "review_text": "right overall the games not to bad the dark house mode is by far the best but considering i paid £18.99 just for the first game i couldnt recommend it, i see that its gone down to £11.99 but thats still more then its worth. The £5 mark is what this game should be, this price you might aswell buy brook haven experience which is the best zombie game, i no people will probably say hordz but hordz is a terrible game. the pistol on it is probably the only weapon you can actually hit stuff with, the sword is just terrible and the machine guns not far off. good reload system but thats about it still to much for me tho so Refund time!",
            "review_score": "-1"
        }
    ]
}