{
    "app_id": 445130,
    "name": "The Average Everyday Adventures of Samantha Browne",
    "release_date": "2016-04-18",
    "developer": [
        "Lemonsucker Games"
    ],
    "publisher": [
        "Lemonsucker Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements"
    ],
    "genres": [
        "Casual",
        "Free to Play",
        "Indie"
    ],
    "tags": [
        "Free to Play",
        "Indie",
        "Casual"
    ],
    "achievements": 5,
    "positive_ratings": 686,
    "negative_ratings": 164,
    "price": 0.0,
    "description": "An interactive story about a painfully introverted college student who must find a way to make some oatmeal in the communal kitchen of her dorm. One simple task, can you help her complete it?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/445130/header.jpg?t=1548547758",
    "minimum_requirements": "OS: Windows 7 Processor: 2+ Ghz Memory: 2 GB RAM Graphics: Intel 3000HD or greater Sound Card: Optional (but recommended)",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": " “Nobody realizes that some people expend tremendous energy merely to be normal.” - Albert Camus   It is more than true that casual interactions of everyday life and trivial anecdotes of one random conversation end up being tremendous tests of courage and regulation for some people. Nowadays, it is called as Social Anxiety Disorder. I have never been one of those, yet I had my mood swings, my antisocial moments and most invested 'me-times' as any other introvert. I most prefer reading a book, watching a movie or sipping a glass of drink all by my lonesome to thrilling adventures of a social butterfly. I can - to a degree, relate to this.   The Average Everyday Adventures of Samantha Browne  features a young university student living on a remote dorm - who isn't also only an introvert, but one that suffers from SAD most assuredly. This short, relatable visual novel is Samantha's challenge to make herself a cup of oatmeal porridge in the middle of the night at her dorm's commune kitchen. She first has to gather courage to get out of her bed and leave her room, still her drumming heart to walk down the hallway, brave all possible social encounters around and manage to cook herself a cup of oatmeal before returning victorious to the safety of her room. It is a quest nonetheless.  Visuals are all hand-drawn in a humorous graphic novel style, with cheesy anecdotes scattered, carrying proper exaggerations to illuminate Samantha's own train of thought better. I must say sound effects are another well done detail to enhance the mood. As a character, Samantha isn't impressive or even remotely interesting but she is real. She is a girl who lives in a dorm and has genuine hardship to get herself a cup of oatmeal only. She fears of judgment and suffers from constant social insecurity, constantly trying to plan what to do, how to react, what to say or not to avoid any kind of awkwardness. It is there. It is very real, even though it is not logical at all, and this game manages to enact a trivial errand as a perilous quest most successfully.  For the gameplay mechanics, it is mostly a visual novel with some choice options. You are to watch for Samantha's anxiety meter and manage to lead her through her quest and back to her room with a cup of edible oatmeal. That's all. I'll present a clue to help your heroine: sometimes not making a choice and waiting things out is a choice.  The game is free here on Steam for your enjoyment, and it also carries some humorous anecdotes just as it has its contemplative nature. Look around, you'll notice Samantha's kindred all around you in your daily life; waiting on the bus line, sitting at your desk at school or the workplace, at the movies... They are the people that would sweat and blush before asking you directions to a place. Treat them with kindness, and you may get surprised by them.  Please also check out Lady Storyteller's Curator page  here  - follow for regular updates on reviews for other games!",
            "review_score": "1"
        },
        {
            "review_text": "Sorry, but I can’t recommend this game. Yes, I understand it’s about anxiety and dealing with its daily challenges (I myself suffer from anxiety disorder — went to various doctors and I’m on treatment), where when simply cooking a meal might be a hard thing to do. But Samantha is an annoying MC, and this game also fails to help people who don’t suffer from this condition to understand what it feels like.   3/10.",
            "review_score": "-1"
        },
        {
            "review_text": " 'Social anxiety as a VN game'",
            "review_score": "-1"
        },
        {
            "review_text": "I have mixed feelings. Overall, for a free game, a short time filler, I'd give it a 3.5/5  It's nicely put together, it shows how some people can think when they have anxiety. Not too long. I finally managed to make the oatmeal on my third attempt. I was incredibly pleased with myself, until I saw there were two more achievements to get.    I have anxiety, so I can understand how she feels with a lot of the stuff, but this was really frustrating... ('though maybe that's the point?) because- (minor I guess, but still) spoilers-    she got to uni but doesn't know how to use a kettle?? What the hell? What english person gets to 18/19 without using a kettle or seeing someone use one or even understanding how it works? she went to uni with no cooking equipment except a mug &amp; spoon? she's downright rude when there's no need to say anything. No wonder her flatmates dislike her. she knows she has problems with a shared kitchen but doesn't have any food in her room that she can eat? and why isn't she on meds?!   ",
            "review_score": "1"
        },
        {
            "review_text": "It's fun to be in someone else's head for a little while.  In this game, you are in the head of a really paranoid and judgemental North American girl who has come to England to attend university but doesn't know things like the basics of how to live, and also thinks terrible things about her neighbours, so she can't ask them for help.   Sounds unbelievable? I met people like this in university. It was a university where you needed to be very very clever to get in, too. And yet... ah. People who put food directly onto cooking rings because they thought the pan was unnecessary. People who decided to boil eggs in the microwave. The numerous fire alarms set off by burnt toast.  Calm down, Samantha Browne! You can get your own kettle and microwave and water jug from Argos or Wilkos or something for under £50 and never need to leave the room to use the kitchen!  I fully expect that if there is a sequel to this, she'll try to do her laundry. Or try using the communal bathroom facilities!",
            "review_score": "1"
        },
        {
            "review_text": "This is, by far, the best Visual Novel I've ever played. A true and accurate depiction of how a simple everyday task may be an impossible thing to do for a person with social anxiety. It's a well-written story, the text is easy to read and easy to understand when it's not your native language, maybe a little short but probably one of the reasons why it's free. I really hope there will be another adventure of Samantha one day, longer than this one!",
            "review_score": "1"
        },
        {
            "review_text": "This may have worked in a different setting. For example, maybe she lives at home with a suffocating parent and going to the kitchen would draw attention and force you into a long conversation about 'what are you going to do with your life' which makes me anxious just thinking about it. But in a college setting, I just kept thinking 'how does she even get to class?' So what, there are people in the kitchen, none of them seem at all inclined to talk to her, which is how I prefer things with my social anxiety. If they had tried to force her into conversation, okay a little more believable, but not much. She's in college. Going to classes would be a lot worse for people with social anxiety.  Also, how do you undercook oatmeal? You put in hot water, then you wait. If it's not done after 30 seconds, microwaving it isn't going to 'cook' it faster. You just let it sit for a while. This may have worked if she was making Cup Ramen or something, but she could have taken it back to her room and let it sit for a few minutes just fine.   Aside from many glaring setting and subject issues, as a person with severe social anxiety, this game didn't speak to me at all.",
            "review_score": "-1"
        },
        {
            "review_text": "Hm, I actually kind of liked this :D There's many decisions and many ways to fail at doing something as simple as creating oatmeal, which makes it entertaining to play around with and see all the different outcomes. Also, Samantha reminds me a lot of myself--painfully shy and awkward. I could totally see myself doing/saying half the things she does in this game x'D Lastly, I really like the art style, it's really cute C: All in all, I'd say this game deserves 6 spoons out of 10 ^-^",
            "review_score": "1"
        },
        {
            "review_text": "All I have to say is that I'm glad this was free... no thank you. Deleting immediately.",
            "review_score": "-1"
        },
        {
            "review_text": "I swear the god I never met a person as single-handedly ♥♥♥♥♥♥♥♥ as Sam.",
            "review_score": "-1"
        },
        {
            "review_text": "That is a girl I can relate to. While I don't got it near as bad, as she does. there are certinaly times and places that I totaly felt like that, and it seems everyone else is having a blast.   As for the game it self, is a short but well made game, it's like a Visual Novel but the story does actualy change with what decistions are made in the game. I would like to see more games on Samantha's adventures, I'd even be willing to a little for the episodes.  Last thing I'd like to comment on, with her beeing frustrated about how loud the microwave is, I've sure been there, but what I do to make them less noisy is watch when the time is low and open the door when there is a second or two left that way you still get 99.99% of the cook time but since it never hit zero it doesn't get all noisy, then you can just hit the cancel button and it's just like you microwaved it for the right amout of time and no loud beeping.",
            "review_score": "1"
        },
        {
            "review_text": "An Adorable Introvert Overthinking Oatmeal Simulator 9.9ish/10.",
            "review_score": "1"
        },
        {
            "review_text": "This free Visual Novel is quite short and shows the story of a brave making some oatmeal in the communal kitchen of our female protagonist dorm... Drawings are just ok, but to get all of the achievements You'll have to go through a bit of bothersome algorithm... and... if you play You'll be able to choose the spoon!!!...",
            "review_score": "1"
        },
        {
            "review_text": "Not Worth the 15m it takes to beat. Cliche, and generally annoying, I very disappointed that I had the unfortunacy to play this. There is almost no interactivity, the choices don't matter (besides seeing different pictures); and without any morale or message, it just comes across as a waste of time, and a bad one at that. Also, it seemed to present women, or maybe college students, as dumb sheep who are all passive aggresive, sick, and terrible people, and this girl as the cliche ' stereotypical introvert'. Dissapointing, awfully made, and a hot mess of ideas that come off as lazy and cliche.",
            "review_score": "-1"
        },
        {
            "review_text": "I really enjoy this game, it is fun and quite cheesy in a way.  The main character Samantha is pretty relatable, I go to university and I can seriously feel her. Haha  The game is short though the events changes on your choices but they're suprising to see...   It is a easy game to relax and play, so enjoy it! :D &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "This is a charming little slice of life adventure game about the challenges of living in a dorm. I am not sure if there are multiple paths, but i suspect the experience is more about the narrative than the choices you make. The art is bold and the audio works well to build tension when it's warranted. I played it while i was waiting for a couple other games to download, and it is perfect for that. The emotions will likely be familiar to many who have had to share accommodation in the past, but even for those who've never experienced this sort of anxiety, this game gives a fun and friendly way to build empathy. Very good.",
            "review_score": "1"
        },
        {
            "review_text": "It's a super short little indie game about making oatmeal. What's not to love? Quite sad to see the mixed reviews as I find the game super cute and relatable. If you have half an hour you should give it a play. Love the style and concept!",
            "review_score": "1"
        },
        {
            "review_text": "You make oatmeal, It is not fun.",
            "review_score": "-1"
        },
        {
            "review_text": "Ok, I understand this little 'cute' game is supposed to make people understand anxiety but, this makes people with that look like they are stupid You can be socially anxious without being this stupid.",
            "review_score": "-1"
        },
        {
            "review_text": "Its average alright. Like my life and this game.",
            "review_score": "1"
        },
        {
            "review_text": "Aside from the super cute art the narrative is entertaining and really accurate of someone living with social anxiety",
            "review_score": "1"
        },
        {
            "review_text": "  I ABSOLUTILLY LLOOOVVVEEE THIS GAME!",
            "review_score": "1"
        },
        {
            "review_text": "It's a really nicely made game! I like the format and your decisions and choices actually matter. It's not a terribly long game [ unless you're having some issues helping her get the oatmeal ] and I really enjoyed it. Great game overall!",
            "review_score": "1"
        },
        {
            "review_text": "10/10 its what its like at university. great game w great name.",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed it for what it was (and you can't really expect much for free) and I liked how it was presented. It takes about 5 or so minutes to play so don't come into this expecting anything long. (there are multiple end scenarios though)  I'd recommend it if you have an interest in anxiety or social anxiety, I think the game does a good job of expressing that. ",
            "review_score": "1"
        },
        {
            "review_text": "So let me get this straight. Eating in front of other people makes her uncomfortable, but parading in her underwear doesn't? And damn, I have huge anxiety issues, but if I cared as much about others' opinions as she does, I'd have gone ♥♥♥♥ing bonkers. Also I resent that I failed because of the keys. She could have eaten in the corridor, right on the floor like an animal, if she was really hungry. Or maybe she wasn't really hungry because apparently three packages is a portion for cows. And by the way how can anyone be wrong choosing what sort of oatmeal to make? How the hell are we supposed to know what she's into? Also I'm pretty sure I killed the Samantha chick when I accidentally made her return to the room empty-handed. Like there was literally some intense dimming of light going on. So dramatic.  Generally a very easy game. it was pretty obvious what answers you are supposed to choose in order to win. As long as you're patient and insecure enough but not giving up on your 'quest', the win is in the bag. I still answered how the hell I wanted. Some people are picky with their oatmeals, others are errr just picky.",
            "review_score": "-1"
        },
        {
            "review_text": "The Average Everyday Adventures of Samantha Browne teaches you the art of making oatmeal.        I still have no idea how to make oatmeal.",
            "review_score": "1"
        },
        {
            "review_text": "  Gets boring after first playthrough; even then it's not very fun, I wouldn't call this a visual story; it wouldve been better if you had backstory about the characters you encounter such as your online friend, maybe then it would be fun.",
            "review_score": "-1"
        },
        {
            "review_text": " I liked this game, I thought that the artstyle was simple and, as a person who has huge amounts of social axiety, I can relate.  Cute, simple, and sweet :D",
            "review_score": "1"
        },
        {
            "review_text": "The game is a slice of life depiction of a spaz. Can't complain about that since that was the intention. The dialogue sounds awkward which was the purpose, so mission acomplished. Gameplay experience really made the player feel frustration for having to put up with the non-sense that the spaz character exhibited, this feeling was compounded if trying to play all the different routes; I take this as a positive since again that was their goal. After all, not every feeling trying to be portrayed in a medium is supposed to be euphoria. Looking forward to more from this dev team.  pros -art -music -free -short -frustration  cons -lack of a settings menu -writing",
            "review_score": "1"
        },
        {
            "review_text": "I don't really like this game. Something bugs me about this girl suddenly undergoing the effects of the well known drug, marijuana. Not just that but this girl is lazy af. Either this is just lazy game making or this girl is a ♥♥♥♥ing pothead. #js.",
            "review_score": "-1"
        },
        {
            "review_text": "Game makes you wonder what you could have done in the time you spent playing this.  In all honesty; it's a game that teaches you how to make oatmeal.........  Alright alright; the game is one of those odd titles that you're happy is free cause it isn't worth any more than that I'm sorry to say. Interaction is bare bones, and the story is not interesting. One element it has is multiple playthroughs which are roughly 15-20 mins pending the decisions you make.  I don't think it's worth the time.",
            "review_score": "-1"
        },
        {
            "review_text": "RE-LA-TA-BLE  anyone who struggles in social situations will either love it to ♥♥♥♥ or be left in a sobbing heap on the floor 10/10",
            "review_score": "1"
        },
        {
            "review_text": "As someone who actually has social anxiety I can relate to most of this.  I think most of the really negative reviews are from people who are simply not capable of understanding how it feels and how having this 'disorder' can affect someone's life. For me it was interesting and funny when I realized I would make the same mistakes and feel the same way in that situation.  That being said, this is a very short... ehm... visual novel? And I do understand how the story can be a little boring for someone who can not relate in any way. Keep in mind though that it's free to play. Just give it a try and realize that you have lost absolutely nothing if you end up disliking it.",
            "review_score": "1"
        },
        {
            "review_text": "This is a short and visually nice looking game. I think many people with anxiety can relate to this.  I enjoyed it :)",
            "review_score": "1"
        },
        {
            "review_text": "If you want a cute little interactive story that gives a spotlight to what it's like to live with social anxiety, than this is a great choice. Not to mention, it's free, so how much can you really complain?  I enjoyed this quite a bit! Very cute art, and a very relatable story. I see other reviews on this criticizing and moaning that Samantha is a whiny baby, but I really appreciate how the writing captures social anxiety. I really likes this so much because when you have social anxiety, everything you do that involves or could involve people really seems like a quest, and I think it makes for a great set-up for a game. It makes me sad that the neg reviewers can't understand that Sam isn't just whining over nothing. It might seem like just going down the hall to make yourself food isn't a big deal at all, but that's the point: to some people, socially anxious people, it can be. I give the people who made this game lots of kudos, and I would love to see more Average Everyday Adventures in the future.",
            "review_score": "1"
        },
        {
            "review_text": "I was sleepless... Now I'm not... Great alternative to sleeping pills",
            "review_score": "-1"
        },
        {
            "review_text": "Really sweet little game, I think it does accurately represent social anxiety, but I would have happily played for much longer, i hope too look forward to more in the future. I want to know about the girls in the kitchen and our online friend!!! :)",
            "review_score": "1"
        },
        {
            "review_text": "Cutting to the chase: this is a 15-20 minute game about a college girl making oatmeal. And I enjoyed this game. It's really visually cute, short, and sweet. I'm disappointed in the negative reviews it's getting. People seem to be missing the mark on what this game is about. It's not about Samantha being 'pretentious' or 'quirky and awkward', it's about her having social anxiety, especially within communal living. I, for one, like how it doesn't blow this fact out of proportion and shove it down your throat. If you know what to look for, the game's theme is pretty clear and I think elegantly displayed by the devs. Having social anxiety, yes, every average day is an adventure, because the outcomes are never clear to the person experiencing it, while others can simply stroll through the average day without much fuss or insecurity.  I would recommend a play, even just for the experience of something not everyone experiences. And really, taking a risk on a game that's less than 30 minutes long and is also free is really not too much too ask for, is it?",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed this quick, comfortable looking but delicately empathy provoking game. I am not the most social person, so it was easy for me to sympathize with Samantha's social anxiety even when it massively outstripped my own. Spending a little time with that level of stress helped me imagine what it might be like to live with that mindset on a day to day basis. Hats off to the developers for this educational and enjoyable experience. I look forward to Samantha's next adventure!",
            "review_score": "1"
        },
        {
            "review_text": "She is so Unlikable, Shes not anxious shes rude with no life skills :( was literally a game about trying to make oatmeal with someone that hates people and doesnt know how to use a microwave or a kettle XD but its ok.... for free",
            "review_score": "-1"
        },
        {
            "review_text": "  This game is so relateable aaa",
            "review_score": "1"
        },
        {
            "review_text": "pretty gud i give this game 8/10",
            "review_score": "1"
        },
        {
            "review_text": "  I'd definately recommend this game for a time waster it's fun cute and the music is good. I loved the art style and music however it seemed like they didn't quite make it so the auidio matched the kind of situatuon you were in. The sound design is also a very nice part about this game it is nice and not to complicated, I would have liked atleast a volume slider for it as it was really loud in my ears haha overall: 7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "  A perfect game for special introverted little snowflakes... like me",
            "review_score": "1"
        },
        {
            "review_text": "awesome game. 10/10 would play a sequel.",
            "review_score": "1"
        },
        {
            "review_text": "I'd like to start by saying I completely sympathise with this character. I did exactly the same thing myself. While the subject matter may be interesting, unique even, that does not excuse the arbitrary, unpredictable outcomes of your choices, and I personally feel the game is incompleteable without a guide. I tried multiple times and got stuck on the same two game over screens without understanding where I was failing.  It's a nice try at a relateable, meaningful story, and it's free, but it relies on repetative failures for you to learn what the character will do and how earlier descisions make the game impossible to win later. In short, I want to like it, but it simply isn't fun. If you want the acheivements, you'll be playing through the game 10 times, and while holding Ctrl speeds this up, it is still a massive bore.  I beleive this would have been a better game if it were more linier, with failures taking you back to the last descision, rather than the beginning of the game (more or less). In retrospect it feels as though that choice was made to pad the game length. That said, the art is lovely and it IS free, so you lose nothing by giving it a go (and if you don't want that to go against your acheivement percentage, you can just remove the licence from your account).",
            "review_score": "-1"
        },
        {
            "review_text": "Its a free stealth/Survival game centred around making oatmeal.  You will die.   Highly recommended!",
            "review_score": "1"
        },
        {
            "review_text": "Story of my life",
            "review_score": "1"
        },
        {
            "review_text": "Wow.. That was pretty good.. I wish it was a bit longer though.. Maybe more, eh, scenarios! Different types of scenarios!",
            "review_score": "1"
        },
        {
            "review_text": "Super cute, fun, and relatively easy game. Definitely would check this out! Love the artwork and anxiety commentary",
            "review_score": "1"
        },
        {
            "review_text": "We braved the rood girls in the kitchen and got Oatmeal.   If we can do this, we can do anything.",
            "review_score": "1"
        },
        {
            "review_text": "  Yes it is short, but really fun to play. And relatable :) I suggest this game to everyone! I would pay for it if it was much bigger/longer (that's wat she said).",
            "review_score": "1"
        },
        {
            "review_text": "This was so adorable and relatable. Who knew that making oatmeal could be such a tense and thrilling adventure? As someone who also struggles with social anxiety, this was a very short and sweet representation.",
            "review_score": "1"
        },
        {
            "review_text": "Literally me everyday, anywhere in my life.",
            "review_score": "1"
        },
        {
            "review_text": "My life in a nutshell, lol...  Nice little game about anxiety and introversion. Really enjoyed it! Also loved the art and the very good sounds! And it's free, so why not just try it! ",
            "review_score": "1"
        },
        {
            "review_text": "not all that but if your bored then this is a nice time waster",
            "review_score": "1"
        }
    ]
}