{
    "app_id": 445170,
    "name": "The Haunting of Billy Classic",
    "release_date": "2016-02-26",
    "developer": [
        "Targon Studios"
    ],
    "publisher": [
        "Aaron Legault"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "Adventure"
    ],
    "achievements": 0,
    "positive_ratings": 28,
    "negative_ratings": 9,
    "price": 1.99,
    "description": "It’s Halloween night and your girlfriend is missing! Play as Billy, fighting through the randomly generated halls of an old, haunted mansion. Fight zombies, ghosts, goblins, and more with over 120 unique weapons and more than 610,000 costume combinations!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/445170/header.jpg?t=1518813817",
    "minimum_requirements": "OS: Windows 7, Windows 8 Processor: Pentium 4 Memory: 128 MB RAM Graphics: Intel Family Graphics DirectX: Version 9.0 Storage: 240 MB available space Sound Card: Any",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": " First impression : Game is a 2D side-scroller that looks like a simple platformer but plays more like a NES era beat-em-up with rogue-like elements. The weapon and costume combinations are a fun twist that gives the game replayability, it was neat exploring some of the options available and getting a new piece to wear was always exciting.  The game is certainly unique so if you're a fan of rogue-likes (Risk of Rain, Binding of Isaac, etc) or clasic side-scrollers (Ghosts &amp; Goblins, Friday the 13th, etc) then this game may be worth checking out.   Pros :   Procedurally generated levels make the game feel fresh (new enemies, bosses, items, etc).   Art style has a nice retro feel to it.   Costume and weapon combinations provide a bit of strategy to the game.   Reasonable price for the amount of content, seems like there's quite a few items and game modes to unlock.   Cons :   Game can be a bit cryptic at times. There may be a few things you weren't taught that can lead to some cheap deaths (but it might just be part of the learning curve).   Much like the classic NES era of games Haunting of Billy harkens back to there isn't much in terms of story.   Difficulty is on the higher end, like most rogue-likes.    Overall , a fun little game from an indie developer that's worth giving a shot.     NOTE : I was gifted a copy of the game to review by the developer.  ",
            "review_score": "1"
        },
        {
            "review_text": "All around fun time, I really enjoy it In my opinion, the branch and rusted weapons deserve a small buff though, the beginning of the game can be a chore with their low damage Other than that, loving the gameplay, atmosphere, and just overall feel of the game. Keep it up my friend!",
            "review_score": "1"
        },
        {
            "review_text": "I'm sorry to say that I hated this game.",
            "review_score": "-1"
        }
    ]
}