{
    "app_id": 445310,
    "name": "Might and Magic: Heroes VII – Trial by Fire",
    "release_date": "2016-08-04",
    "developer": [
        "Limbic Entertainment"
    ],
    "publisher": [
        "Ubisoft"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Partial Controller Support"
    ],
    "genres": [
        "RPG",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "RPG",
        "Turn-Based"
    ],
    "achievements": 0,
    "positive_ratings": 159,
    "negative_ratings": 151,
    "price": 25.99,
    "description": "Five years after the epic events of Might &amp; Magic Heroes VII, lead the new Fortress faction to define the destiny of the Dwarves and shed light on some of the darkest chapters of their history.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/445310/header.jpg?t=1470408833",
    "minimum_requirements": "OS: Windows 7 SP1 or Windows 8/8.1 (64bit only) Processor: Intel Core i5 660 3.3 GHz or AMD Phenom II X4 955 @ 3.2 GHz Memory: 4 GB RAM Graphics: nVidia GeForce GTX460 or AMD Radeon HD5850 (1024 MB VRAM)",
    "recommended_requirements": "OS: Windows 7 SP1 or Windows 8/8.1 (64bit only) Processor: Intel Core i5 2400 @ 3.1 GHz or AMD FX-6100 @ 3.3 GHz Memory: 6 GB RAM Graphics: nVidia GeForce GTX670 or AMD Radeon HD7870 (2048 MB VRAM)",
    "reviews": [
        {
            "review_text": "Ubisoft, sell the rights to series pls",
            "review_score": "-1"
        },
        {
            "review_text": "All i need to say, is if there is a refund i want one",
            "review_score": "-1"
        },
        {
            "review_text": "This game almost destoyed my PC.!  It somwhow changed the Direct X Settings (i guess cannot explain it otherwise) making the CPU shut down instant. However it didn't change that settings only for Trial by fire but for every other game and even on Desktop with only Windows running, it shut the system down after 10-15 minutes. Uninstalling didn't help at all. Just imagine your PC shuting down again and again with no reason, and nothing helps.  I managed to restore Windows 7 from a System security saving after 3 hours trying around and that finally fixed the Problem.  So This is not only a review its a warning. This game might screw your PC for good!",
            "review_score": "-1"
        },
        {
            "review_text": "It's a good game. I don't understand why people are complaining about it so much. My favotie Heroes games were H2, H5 and now H7. It's not as good as H5 but it's still good.",
            "review_score": "1"
        },
        {
            "review_text": "This DLC make HeroesVII better. try it when you have enough time to kill. of course, Ubisoft game emm... F v c k the bloody hell Uplay!!!",
            "review_score": "1"
        }
    ]
}