{
    "app_id": 445770,
    "name": "Airport Madness 3D",
    "release_date": "2016-05-25",
    "developer": [
        "Big Fat Simulations Inc."
    ],
    "publisher": [
        "Big Fat Simulations Inc."
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "Simulation",
        "Management"
    ],
    "achievements": 48,
    "positive_ratings": 171,
    "negative_ratings": 35,
    "price": 14.99,
    "description": "This is the seventh version of Airport Madness, offering players a 3-dimensional air traffic control experience from a control tower perspective.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/445770/header.jpg?t=1489877546",
    "minimum_requirements": "OS: Windows 10, Windows 8, Windows 7, Windows Vista, Windows XP Processor: 1.0 GHZ Memory: 512 MB RAM DirectX: Version 8.0 Storage: 200 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I am a real life tower controller. This game is not super realistic and you are allowed to brake many ATC rules. That being said, it is really fun and the best 'out of the box' simulator I have played. I enjoy that you can cruze in from the pilot's perspective and still issue tower commands. I also like the games intensity. Want more maps like the non-3D version.   I'm not a huge fan of doing the 'ground control' as no day shift tower control does both. Also wish the controls were a bit smoother (always clicking top left is annoying). Instead of 'slow down', perhaps warn of 'company traffic, crossing or ahead'.   Well worth the money, love the game, love pushing tin beyond what is actually allowed.  Get it!",
            "review_score": "1"
        },
        {
            "review_text": "This game is a fun management game. I find its graphics flawed and the mechanics are little more than that of a mobile app. I would recommend this game but only at a very cheap price.",
            "review_score": "1"
        },
        {
            "review_text": "It's fun but needs improvement...  The features i'd like to see in this game:  -Emergencies...engine fire sick passenger hijacked airplane refulling and sending police officers to handle the situation and self aborting take off so we have a hard time ext... -Upgrading and customising airports with new runway emergency facilities more parking slots helipads business jet area flight school with small runways and ext... -More weather fog snow ext -Closure of runway after aircraft crash and handling the situation -Runway selection so aircrafts can go to that specific runway ecxept for the aircraft declearing emergency... and change of runway so an aircraft taxing to a specific runway can taxi to other runway... -pushback crashes if pushback clearance is not given well (i think i went too far here lol)  These are the things that i would love to see it in the game thank you for this game willing to see new improvements...",
            "review_score": "1"
        },
        {
            "review_text": "Same gameplay as previous Airport Madness, but in 3D. It takes some adjustment but once you do, it's a huge improvement over the previous games. Hopefully this serves as the 3D base game for future Airport Madness expansions or sequels.",
            "review_score": "1"
        },
        {
            "review_text": "THis is NOT a Real 'Air Traffic contol' But it is serious fun. I like the 15 minute challenge, where you can post your score and compare to other users. It is worth $15 I spent.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game to pass the time with if your waiting for an update or if you're downloading something",
            "review_score": "1"
        },
        {
            "review_text": "Yeah been looking forward to this game! Now I just hope they will have Singapore Changi Aiport!",
            "review_score": "1"
        },
        {
            "review_text": "Played game.......Should never work as an aircraft controller...will crash planes again!",
            "review_score": "1"
        },
        {
            "review_text": "Great game for the money A+",
            "review_score": "1"
        },
        {
            "review_text": "Fun ATC game, but not for real training. 9/11 would crash again!",
            "review_score": "1"
        }
    ]
}