{
    "app_id": 446000,
    "name": "Stellar Monarch",
    "release_date": "2016-12-05",
    "developer": [
        "Silver Lemur Games"
    ],
    "publisher": [
        "Silver Lemur Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Indie",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Simulation",
        "Indie"
    ],
    "achievements": 0,
    "positive_ratings": 104,
    "negative_ratings": 26,
    "price": 14.99,
    "description": "Asymmetric space empire builder where you feel like the Emperor, not a logistics officer. No micromanagement, grand scale, fast paced, audiences, assassins, imperial court, disloyal admirals.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/446000/header.jpg?t=1529916013",
    "minimum_requirements": "OS: Win XP or better Graphics: Screen resolution minimum 1024x768 Storage: 49 MB available space Additional Notes: The game should run on almost any hardware, even outdated one. In case of problems run &quot;safe&quot; mode version.",
    "recommended_requirements": "OS: Win 10, Win 7, Win XP Graphics: Any non integrated card should be perfect Storage: 99 MB available space Additional Notes: In case of problems run &quot;safe&quot; mode version.",
    "reviews": [
        {
            "review_text": "Surprisingly enjoyable.  Despite its low end graphics and un-storied developer, this title is worth your time especially if you are into Paradox strategy games.  It's a quick, hands off, space based 4x, the conceit being that you are the immortal emperor of the Terran race, ruling from the centre of the galaxy, naturally superior to all. To win you must be prestigious enough, blood-thirsty enough or valorous enough to claim the title of 'Ruler of all Galaxy' (developer is not a native English speaker, cut them a little slack). Anyone familiar with the Warhammer 40K licence should find some common ground here, but it also calls on classic sci-fi such as Asimov and Clarke.  There is almost no micro-management in this title, that's what you have courtiers and councillors for, instead you are concerned with balancing political power, addressing the court and dictating the fleets. It is, as the name might suggest, like crusader kings for a pocket-able device.  Despite it's low-fi feel, it does a good job of depicting what it would be to be the immortal emperor of Terra, dictating the growth of your people and seeing off the mewling, un-evolved alien races of the galaxy.",
            "review_score": "1"
        },
        {
            "review_text": "As I write this please bear in mind I only have 3 hours or so in playing; however have watched many videos. My first impressions while it was in Beta intrigued me enough to put on my wishlist but just could not see $20 plus(Cdn funds). The best way for me to describe this is this...remember back in the day with the original MOO series that you are looking at the clock; seeing its 11pm...ok just one more turn?...then when you hear the birds tweeting as daylight envelops the room you realize oh no! This game has that kind of pull in my opinion. If you do purchase get your affairs in order, as in no more social life, maybe you will lose your spouse(not always a bad thing I know). Lucky for me my wife works nights! 'nuff said! Easily worth every penny IMO",
            "review_score": "1"
        },
        {
            "review_text": "Legend Of The Galaxy Heroes anyone? Put the music, some Malher, Dvorak, or the anime behind as fond music, and get ready to roll out hahaha.  I dont need to say whats inside, theres already enough review for that, if you guys are bored of non in deph 4x, i mean real in deph, human-like in deph, go for it, this game will suck you out. ",
            "review_score": "1"
        },
        {
            "review_text": "A neat game concept that is undermined by boring and repetitive moment-to-moment game play. Most of the game will be spent directing your fleets to planet after planet, waiting a few turns to finish conquering, and then clicking them on to the next planet. The UI for this is crappy, and you need to conquer some 200+ planets, so settle in. :(  The empire level management and politics can be interesting, but you will very quickly see everything there is to be seen. After that it is just keeping the court in balance and seeing the same random events over and over again.",
            "review_score": "-1"
        }
    ]
}