{
    "app_id": 446310,
    "name": "Sabres of Infinity",
    "release_date": "2016-03-29",
    "developer": [
        "Hosted Games"
    ],
    "publisher": [
        "Hosted Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Captions available",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Adventure",
        "RPG",
        "Indie"
    ],
    "achievements": 16,
    "positive_ratings": 78,
    "negative_ratings": 5,
    "price": 2.89,
    "description": "Wage a war of gunpowder and magic! As a gentleman-officer of the Royal Dragoons, will you sacrifice your fortune? Your honour? Your men? Your own life?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/446310/header.jpg?t=1486691907",
    "minimum_requirements": "OS: Windows 7",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Subjective Review  I like the setting, real world and fantasy wise.  A bit hard for me as a veteran of these games to gain good stats. [Saying this due to carrying into the next game]  Very complex choices which all matter in expected and unexpected ways.  Carry your character over and continue a'la Mass Effect.  Amazing writing, Top shelf writing and choice management. Few/no illusions of choice.  ",
            "review_score": "1"
        },
        {
            "review_text": "Incredible game, truly. One of the most replayable in its kind and one where desicions matter a lot. beutiful writing as well.",
            "review_score": "1"
        },
        {
            "review_text": "I played this game and the next more than a game that cost me £30.",
            "review_score": "1"
        },
        {
            "review_text": "Won every battle no matter the odds.  Hated by everyone and nearly broke.  11/10",
            "review_score": "1"
        },
        {
            "review_text": "I loved chose-your-own-adventure books as a child, and maintain fond memories of placing finger after finger between pages, if only to keep some track of the trail of the tale.   Sabres of Infinity far exceeded my expectations of a similar, if digital, experience. I didn't die on the first run-through, though I did twice on the next. Five successful game completions down, and still, I had not gained a simple steam achievement. Though I have yet to play as a coward or, simply, the juxtaposition of myself, in which the seemingly most stupid decision is taken. One day, perhaps I shall, if only to see where it takes me - other than death.   In regards to the lack of Decorations, perhaps I am simply playing a longer game than in necessary, in that where I could not myself decide on a course of action, I was guided by the simple question: 'What would Raj Whitehall do?' His was the longest game of all, but he would not, I believe, have been out of place in this realm.  For now, I, undecorated still, retire as a Captain, and a Knight of the Red; eagerly awaiting the sequel. I hope it ties in with the decisions I have made in this game.",
            "review_score": "1"
        },
        {
            "review_text": "An excellent romp through a fantasy-influenced world broiled in Napoleonic warfare or mass slaughter. Highly recommended. I own Sabres of Infinity on the Chrome web store and have read through it at least a dozen times. It's been an inspiration for myself to get involved with writing, and has reinforced my love for the historical fiction and historical fantasy genres.  Now, if you are expecting a visually grandiose game to play, perhaps Sabres is not for you, but if you enjoy deep storytelling and reading well-flowing prose, then you should definitely pick this one up and at least give it a chance. Interactive Novels are a slowly growing market, there's more and more coming out each year, and this one belongs on top of the pile of must-reads.",
            "review_score": "1"
        },
        {
            "review_text": "It's gripping, it's tense, it's above all very-well written, I can't recommend this enough to those of you who like a good old chose-your-own adventure playbook. In this first episode (quite lengthy), you have a wide array of choices ensuring high replayability, and your choices are imported to the second episode (Guns of Infinity). The writing is credible, you can feel the author has researched actual veteran's memories to give an account of war that you can buy into. ",
            "review_score": "1"
        }
    ]
}