{
    "app_id": 446590,
    "name": "7 Mages",
    "release_date": "2016-06-23",
    "developer": [
        "Napoleon Games, s.r.o."
    ],
    "publisher": [
        "Napoleon Games, s.r.o."
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "RPG"
    ],
    "tags": [
        "RPG",
        "Dungeon Crawler",
        "First-Person"
    ],
    "achievements": 0,
    "positive_ratings": 61,
    "negative_ratings": 36,
    "price": 10.59,
    "description": "The epic RPG 7 Mages in the tradition of the greatest classics of the genre takes you around the magical island of Roven.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/446590/header.jpg?t=1466668295",
    "minimum_requirements": "OS: Windows XP SP2 Processor: Dual Core 2.0 GHz Memory: 2 GB RAM Graphics: Shader model 2.0 capable card with 512 VRAM DirectX: Version 9.0 Storage: 4 GB available space",
    "recommended_requirements": "OS: Windows Vista or Windows 7 Processor: Quad Core 2.66 GHz Memory: 4 GB RAM Graphics: Shader model 4.0 capable card with 1GB VRAM DirectX: Version 11 Storage: 4 GB available space",
    "reviews": [
        {
            "review_text": "The gameplay is vastly better than most other first person party-based RPGs to have come out in recent years. It's quite fun and the puzzles are actually enjoyable. There's some innovation going on here as well, what with the ability to split up your party.  I have one gripe, and that's with the writing. It's bad. Like so bad. It's like a 12-year-old who was doing his aboslute best to be edgy wrote this crap. It barely makes any sense. At one point your main character actually sexually harasses a woman until your friend Dog (yes, that's his actual name) tells you it's inappropriate. At which point you start to insult her. For like a full minute. Because you want her to be your friend. And that's just an example of the writing when it's intelligible.   The writing is so bad it actually almost made me want to ask for a refund, but the gameplay is actually good enough to make me want to keep playing. I mostly just ignore the writing now.  tl;dr amazing gameplay but they hired a brain damaged chimp to do the writing",
            "review_score": "1"
        },
        {
            "review_text": "Changed my mind. Too many bugs and stucking during combat. Almost impossible to play in some locations and permanent shuting game down, restarting and loading needed.   5/10  Fot the old school players one of the best recent games. In some locations you have to thing. Some maps you can visit soon after begining but you need higher level and more mages to beat them. Not like in modern games when oponents are leveling on your level and you can beat them whenever you want.  Some bugs with no responding and restarting game.  Nice soudtrack.  For czech players alse czech language available.   Good game (8,5/10)",
            "review_score": "1"
        }
    ]
}