{
    "app_id": 446600,
    "name": "Magi Trials",
    "release_date": "2016-11-17",
    "developer": [
        "Chronofire Arts"
    ],
    "publisher": [
        "Dharker Studio"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Casual"
    ],
    "achievements": 10,
    "positive_ratings": 63,
    "negative_ratings": 16,
    "price": 9.29,
    "description": "Do you have what it takes to join the Royal Academy of Magi in a new Highschool Romance story. After attempting a dark ritual which increases innate magical ability, but transforms your body.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/446600/header.jpg?t=1545390812",
    "minimum_requirements": "OS: Windows XP Processor: 1.66 Ghz Memory: 1 GB RAM Graphics: DirectX compatible card Storage: 1 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I liked the game. The illustrations are very good, I quite like the style of the illustrator.  Unfortunately I just think it's a bit short and also lack more characters to interact and extra events (festivals, holidays, etc).  But overall, I enjoyed it and I'm happy with the game !!",
            "review_score": "1"
        },
        {
            "review_text": "I get it may not be everyones cup of tea, but I personally enjoyed the endings, though not all ideal, it was a good set up to sequels. Loved the story, the protagonist, and our purple haired love-interest.",
            "review_score": "1"
        },
        {
            "review_text": "I just finished my first playthrough, and i can say it was heartwarming, funny and dramatic. I've read some of the other reviews, and it sounds like you can easily be mislead in the story aswell...  A very fun read i recommend it :D   I'm going to try for a different ending now! (okay maybe after i wake up)  &lt;3 The demon girl btw she's hot",
            "review_score": "1"
        }
    ]
}