{
    "app_id": 446640,
    "name": "Space Pilgrim Episode IV: Sol",
    "release_date": "2016-03-04",
    "developer": [
        "Pilgrim Adventures",
        "GrabTheGames Studios"
    ],
    "publisher": [
        "GrabTheGames"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Leaderboards"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "RPGMaker"
    ],
    "achievements": 10,
    "positive_ratings": 234,
    "negative_ratings": 26,
    "price": 0.9,
    "description": "Locked away in the most secure prison in the galaxy, with little hope of escape, Gail Pilgrim faces the most difficult ordeals of her life. Her only hope lies in trusting those who she has come to regard as her friends.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/446640/header.jpg?t=1554170550",
    "minimum_requirements": "OS: Windows 98/XP/Vista/7/8/10 Processor: Intel Pentium III 800 Mhz Memory: 512 MB RAM Graphics: 1024x768 or better video resolution in High Color mode Storage: 250 MB available space Sound Card: DirectSound-compatible sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "If you’re thinking about getting only one episode of the series, then I suggest buying the bundle to experience the full story. Gail Pilgrim travels to other places and usually in trouble. Through the episodes, you can play as a different character for their part of the story. Even though the game is made in RPG maker, there is no leveling in it. You’ll talk to people, combine items, use it, and examine things. It’s a point-and click adventure filled with a good story, puzzles, and clichés. As you progress to each episode, you find more content leading to a longer gameplay. I felt that the ending of Space Pilgrim Adventures left a possibility to expand the series. The game is still good overall!",
            "review_score": "1"
        },
        {
            "review_text": "If you played the past three, you need to play the fourth chapter. Part 4 is the longest, and while I feel has a bit of an anticlimax, everything is wrapped up neat and tidy for a satisfying ending.",
            "review_score": "1"
        },
        {
            "review_text": "This is a cute little point and click adventure with some comedy moments and a crime/drama/scifi theme.  There is no action, just a storyline and some simple puzzles.  Don't buy it at full price, the game (each episode) has less than 2 hours of content. (It's about 6 to 8 hours to complete all 4 games ~ episodes)  If you can get all 4 episodes (in a bundle) for under $3 on sale, then it's worth it.  Game is not worth $2 per episode and not worth bothering with unless you are going to get all 4 episodes (they are too short to be worth much alone)  Playing through once for the storyline was fun, but there's no real replay value.",
            "review_score": "1"
        },
        {
            "review_text": "OH NO. Last part trough. 1 happy 1 sad eye. Story is very good, i love the ending (only that agent Anape dies is the only dislike). The graphics and sounds are okay. Game lenght is good. You can choice 1 time that change the way a little bit. I really want a 5TH PART and MORE ACHIEVEMENTS. I give this part 95 % for 2D gamers. For normal gamers i give 80 %. Thx 4 reading and to the developer &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "It's a great end to this 4 part series, you cant really just stop at the first one and call it a day. for me I had to keep going and the price was right for the amount of entertainment I had. The story was enjoyable a good ending.",
            "review_score": "1"
        },
        {
            "review_text": "Last episode of this series and it didn't disappoint. The lore was nice and once again puzzles and exploring were fun and relaxing.",
            "review_score": "1"
        }
    ]
}