{
    "app_id": 446770,
    "name": "Skeet: VR Target Shooting",
    "release_date": "2016-04-05",
    "developer": [
        "Flatbox Studios"
    ],
    "publisher": [
        "Flatbox Studios LLC"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Simulation"
    ],
    "tags": [
        "Action",
        "Simulation",
        "VR"
    ],
    "achievements": 14,
    "positive_ratings": 106,
    "negative_ratings": 28,
    "price": 0.0,
    "description": "A VR target shooting simulator for the HTC Vive. Use one of three shotguns and shoot clay pigeons and other targets in Virtual Reality. Features Trap, Skeet, and Quickdraw modes.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/446770/header.jpg?t=1483538538",
    "minimum_requirements": "OS: Windows 7, Windows 8.1 or later, Windows 10 Processor: Intel i5-4590 Memory: 4 GB RAM Graphics: Nvidia GeForce GTX 780 Storage: 1 GB available space Sound Card: N/A",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Really, really fun. Not a whole lot in there but definitely worth the money.  EDIT: Woops, forgot it was free LOL",
            "review_score": "1"
        },
        {
            "review_text": "Very satisfying, not a lot of replay value but a good game to pull out at parties to showcase the Vive to friends.",
            "review_score": "1"
        },
        {
            "review_text": "not sure why there is such negetivity aroudn this demo, I mean it's free and it works pretty well for me. I think that maybe there could be more variation in the game modes or more features added but, .... did I mention that its free?   I prefer to be supportive of the dev, clearly a lot of time has been put out just to test a few concepts, and good ones at that. Thumbs up from me.",
            "review_score": "1"
        },
        {
            "review_text": "Could not get game to start from opening scene",
            "review_score": "-1"
        },
        {
            "review_text": "It's okay, but I need more to keep me entertained. Check it out if you're a new Vive owner and can't afford games yet.",
            "review_score": "1"
        },
        {
            "review_text": "I'd like it more if it had some automatic weapons, but it's a lot of fun as is. Recommended!",
            "review_score": "1"
        },
        {
            "review_text": "Real fun, recommended!",
            "review_score": "1"
        },
        {
            "review_text": "Wow, what a great workout, the timed shooting is the best! I am sweating like crazy right now, could not stop playing until my sides started hurting from twisting around, reloading and firing. 1.63 seconds!!!! Woohooo!",
            "review_score": "1"
        },
        {
            "review_text": "  Super fun. Already spent more time than i should have making the shotgun go clickity clack. Would love more guns.",
            "review_score": "1"
        }
    ]
}