{
    "app_id": 44690,
    "name": "GT Legends",
    "release_date": "2012-11-28",
    "developer": [
        "SimBin Studios AB"
    ],
    "publisher": [
        "SimBin"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player"
    ],
    "genres": [
        "Racing",
        "Simulation",
        "Sports"
    ],
    "tags": [
        "Racing",
        "Simulation",
        "Sports"
    ],
    "achievements": 0,
    "positive_ratings": 201,
    "negative_ratings": 24,
    "price": 4.99,
    "description": "The golden age of motor sports has returned. Experience one of the world’s most exciting racing series in GT...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/44690/header.jpg?t=1478077613",
    "minimum_requirements": "OS:Microsoft Windows XP/Vista/Seven Processor:1.3 GHz Intel Pentium III or AMD Memory:512 MB RAM Graphics:DX8.1 comp. video card/64 MB DirectX®:8.1 Hard Drive:3 GB HD space Sound:DX8.1 comp. sound card",
    "recommended_requirements": "Processor:2 GHz Intel Pentium IV or AMD Memory:1 GB RAM Graphics:DX9.0c comp. video card/256 MB DirectX®:9.0c Hard Drive:3 GB HD space Sound:DX9.0 comp. sound card",
    "reviews": [
        {
            "review_text": "This is the sim racer I have been looking for, good selection of classic cars from small fiats to big american muscle. Has a decent selection of tracks, ai drivers are a decent challenge where they will try pass other drivers in smart places and not just push you off the track like a horny moose.  The biggest thing for me is that this game has great driving physics. Cars handle like you think they would. When you drive a small front wheel drive car you notice how nimble it is through the corners and has very little understeer and the bigger american muscle cars feel heavy with lots of torque. There are close to 100 different cars and you unlock them as you play through the career. You can adjust almost everything on them either with simple sliders for oversteer/understeer, stiffness and ride height to more advanced setup where you can change camber and so on.  Graphics are ok with decent textures and nice lighting effects for the time. Exterior damage modelling is very minimal but collisions do feel like they have some weight to them even though sometimes side to side collisions can feel a bit akward, but still you can push cars and make them spin. Very playable with older hardware and newer aswell. Also supports 21:9 aspect ratio monitors. Driving feels nice even with a gamepad, though oversteer can be difficult to control with such sensitive controls. I would recommend a good FFB wheel with this. I have not personally tested how it is with a wheel but support for all kinds of wheels and controllers are there and are very configurable with sensitivity, dead zones and so on. (I will try to add my thoughts later on about how it feels with a wheel since at the moment I don't have a good place to install my Fanatec CSR wheels, pedals and shifter.)   My favorite moments from the game are when you are playing the 'david vs goliath' on career mode where you have to drive with a small and not too powerfull Lotus Cortina against big muscle cars like The Mustang. In the straightaways you get passed easily but if you carry lots of speed through the corners you can almost oversteer past them.  The game is very moddable, nogrip and other forums has a ton of beatifully modelled cars and tracks, period correct of course.",
            "review_score": "1"
        },
        {
            "review_text": "For the low price it has, the amount of fun, reality and a lot of other stuff is just unbelieveable! Definately worth to buy , only if you like a game thats realistic, its not an arcade.",
            "review_score": "1"
        },
        {
            "review_text": "this puts all the the forza, nfs and grids to shame....superb sim that does not hold your hand...you can either drive or you cant....prob the best race sim ever, with dedicated online racing via  simracing.org.......amazing!  lol@ zero hrs on record...i've prob drove this game to death! my go to game.",
            "review_score": "1"
        },
        {
            "review_text": "(REVISED) Some issues with the 'sim'-ness of the game aside, this is one of the most satisfying racing games I've played. That's largely in part to the huge mod content available.  Compared to the hundreds of cars that games like Gran Turismo and Forza have ballooned into, even the modding community can't offer a comparable volume on that front, but it makes up for that in the quality of many of the car liveries (or 'skins') and sheer volume of race tracks. You won't find a console racing game or many PC ones that offer the volume of race tracks you can download for GT Legends (and presumably its sister games, too). At the moment, I have more than 100 tracks installed, and there are lots more available. Not only can you find different tracks from around the world, and a few made-up ones, but some classic tracks -- such as Le Mans, Spa, Monaco, Nurburgring, and others -- offer some of their various incarnations over the years. In short, I've never seen a racing game offer more opportunites to race the tracks you've always wanted to race.  The visual quality of the tracks varies, some looking plain and dated, with textures like roads and trees looking painful old in some, but pleasantly realistic in others. This is also true for the creativity of the 'fantasy' tracks, some a little bland, but others achieve what they advertise very well, like the 'Moorlands' track looking like it came right out of Wuthering Heights.  Besides the mods, the game offers suprisingly good-looking cars and still some of the most impressive natural-light effects, particularly at dawn and dusk and how the light looks on the cars.  The 'sim' aspect is also mixed. Having never raced real cars (much less any like these old ones), I can only compare the sim authenticity to my instincts and the closest game equivalent I've played -- namely, Forza. It feels a little overcooked in parts, with certain physics seeming oversensitive, like the grass and sand feeling more like ice; some cars getting lost in a slide that renders counter (or any) steering ineffective; cars flip too easily and overreact to some contact; some cars' inability to hold a straignt line under braking. Not only do they feel overdone, but vindictively so, too often pushing it beyond challenge into unbearable irritation. In short, while some of the over/understeer and other physics are impressive and satisfying, there seem to be just as many elements that make this as aggravating as often as it can be fun.  Perhaps some of the over-fidgityness of the cars are avoided by using a racing wheel instead of a controller, like I'm using (PS3), which also doesn't recognize any rumble/feedback.  Also vexing, on the single player side is the poor balancing of AI and grid competition, and the relative uselessness of many cars in a mixed grid. That means that the number of actually usable cars -- in terms of being able to win the races on the harder difficulties -- is limited. You are stuck with whatever car you pick for all the races in a particular 'tournament', so there are really only two or three choices (at most!) to give yourself a realistic chance of winning on pro or semi-pro. I imagine you can find (or create) online one-make races, though, that would allow you to drive all these nice classic rides.  Ultimately, the well-aged visuals, the mixed but overall still adequate sim-racing experience, and the gobs of mod content (most notably, the tracks!) makes this a must-have for serious racing game fans.",
            "review_score": "1"
        },
        {
            "review_text": "Best vintage racing sim ever made. Highly recomend wheel though. Despite steam saying i have only 4.1 hours i have about 40 hours on this game due to me not launching this game through steam and the mods avalable will suit any vintage craving.",
            "review_score": "1"
        },
        {
            "review_text": "The racing game I always return to. Whether it is starting from the back of a full grid of easy AI or trying to make it to the end of a full length endurance race there is much fun to be had here. The variety of cars makes this my favourite of all SimBins games, GTR2 would be a close runner up, anything after that doesn't come close. If you are familiar with any of the ISI engine games you will know what to expect from the handling, the attention to detail for each of the cars interiors means you will want to own and try them all - its up to you if you want to earn the money to buy them or use the savegame trick to unlock them for nothing.",
            "review_score": "1"
        },
        {
            "review_text": "Great racing sim! I bought this to play on an old laptop and it runs extremely well. A++",
            "review_score": "1"
        },
        {
            "review_text": "Great game!!! You will need a wheel because playing it with keyboard is really hard. Enjoy!!!",
            "review_score": "1"
        },
        {
            "review_text": "if you had the misfortune of buying this game,, you will agree not being able to drive yer car is the first problem with the game.. i was like.. oh so why don't you just ask for donations in GT legends honour instead of calling it a game and making me think im gonna get to race.. you heaping pile of dung...",
            "review_score": "1"
        },
        {
            "review_text": "Let’s start out with two points:-  For the basis of this discussion,  Dictionary.com  defines ‘simulation’ as: - The representation of the behaviour or characteristics of one system through the use of another system, especially a computer program designed for the purpose.  It defines ‘arcade’ as:- An establishment, public area, etc., containing games of a mechanical and electronic type, as pinball and video games, that can be played by a customer for a fee.  I would say with a fair amount of certainty that the sim-racing community does not use these definitions when labelling racing games under one of these two categories. So how do sim-racers see the difference? Well you can only find out by asking, so I did. Here are only a few responses…",
            "review_score": "-1"
        },
        {
            "review_text": "I got this game for $3.60 I almost feel like I stole it at that price. A really awesome classic driving sim without any of the X-Games monster energy drink ♥♥♥♥♥♥♥t most driving games give you these days. If you like classic GT cars and realistic driving games you would be doing yourself a disservice if you did not pick this game up.",
            "review_score": "1"
        },
        {
            "review_text": "Simbin are kings of the proper race simulator - as opposed to the arcade type of racing game. The realism is astounding; the whole experience immensly satisfying on all of their offerings up to and beyond the Race 07 series. This early game set the standard and is one of the most satisfying, especially as you have to compete to access all of the types of cars - a huge range of 1960's / 70's touring and GT classics. The dynamics, each one handles differently and requires simple chassis adjustment to get the best result, and the bespoke engine sounds, are sublime. I waited 6 years for GT Legends to be released on Steam and it was well worth the wait. And don't think about playing it without a decent wheel. I use the Logitech G27, which does a excellent job of handling the force feedback and responds well to driver input. Start on beginner and graduate to amateur level. The semi and pro levels require a skill level above most users I suspect, at least that was the case with me.",
            "review_score": "1"
        }
    ]
}