{
    "app_id": 446990,
    "name": "The Huntsman: Winter's Curse",
    "release_date": "2016-04-22",
    "developer": [
        "Desert Owl Games LLC"
    ],
    "publisher": [
        "Desert Owl Games LLC"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Adventure",
        "RPG",
        "Indie"
    ],
    "achievements": 10,
    "positive_ratings": 184,
    "negative_ratings": 64,
    "price": 0.0,
    "description": "The Huntsman: Winter’s Curse is a narrative-driven, interactive fantasy fiction game with a card based combat system set in the universe of Snow White and the Huntsman.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/446990/header.jpg?t=1513794106",
    "minimum_requirements": "OS: Windows 7 or higher Processor: Intel Core 2 Duo 3.0GHz / AMD Athlon 64 X2 6400+ 3.2GHz Memory: 4 GB RAM Graphics: NVIDIA GeForce GTX 260 / ATI Radeon HD 5670 or higher with 1GB memory DirectX: Version 9.0c Storage: 1500 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": " I love card-based combat, but this is just BORING",
            "review_score": "-1"
        },
        {
            "review_text": "It's fun but only episode 1 is actually free.",
            "review_score": "1"
        },
        {
            "review_text": "Lots of love for this game.  -Amazing art style -Battle squences that are challenging in just the right ways -Interesting storyline -Likeable characters -Skill tree and weapons that bring something new to your battles Only complaint is that the first book is rather short. I played the whole things through in maybe an hour or so",
            "review_score": "1"
        },
        {
            "review_text": "I bought all DLC and played through the entire game. It's a simple, very enjoyable game for some chill gaming. Uses a time bar in combat which controls turns, players can manipulate the speed and movement along the time bar using different abilities.  GAME IS UTTERLY RUINED BY FINAL BOSS (at the end of chapter 5) WHICH IS AN ENORMOUS LEAP IN DIFFICULTY AND USES EXTREMELY ANNOYING MECHANICS. Bad balance, don't waste your time with it unless you're a sadist.",
            "review_score": "-1"
        },
        {
            "review_text": "This was suprisingly good.",
            "review_score": "1"
        },
        {
            "review_text": "It's incredible game! It looks like Child of light(another one incredible game) and it has a beatiful story with great characters. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Not very much tactical about the fights. If you like a story told with some fights its a nice enough game to pass the time, but its incredibly short. Each chapter takes only 1-2 hours to complete and 5,- is far too much for such a short game with little to no replay value.",
            "review_score": "-1"
        },
        {
            "review_text": "Lovely concept. Tried the free Book 1 and loved it but on purchasing the Season Pass, the game kept crashing on Book 2. So sad cos it has so much potential to draw you in and keep you busy for hours on end.",
            "review_score": "-1"
        },
        {
            "review_text": "Me: Yay, cool f2p game, I have to play it! *having fun for 30min* Game: You have to buy next book (episode) Me: I'll miss you *uninstall*  True story. Really cool game, but I won't pay 5€ for next episode, when first episode lasts for 30min... 8/10, would recommend it for people that likes to throw money for short games.",
            "review_score": "1"
        },
        {
            "review_text": "Long boring conversations with the occassional card battle that appears to be impossible to lose - unless you're a simpleton.  Meh.",
            "review_score": "-1"
        },
        {
            "review_text": "Interesting game. Interesting plot and characters. Music and play is relaxing. Play is turn based (which I prefer).",
            "review_score": "1"
        },
        {
            "review_text": "Very relaxing game, I prefer RPGs and this is a very nice one. Artwork and music are lovely as well.",
            "review_score": "1"
        },
        {
            "review_text": "When I first tried out The Huntsman: Winter's Curse, I did not know what to expect. Video games based on movie franchises usually tend to be lower quality, but this game was actually pretty great. It felt like a combination of a visual novel and a card game. The battle card game is not something complicated, it is a simple but fun one. The difficulty throughout the game was pretty good. Sometimes it could get kind of difficult if the character was alone in battle against multiple enemies, but it was doable. However, the final boss fight was nearly impossible. I got game over around 6 times with different equipment combinations until I gave up and changed my game setting to Easy, which felt horrible, to be honest. You can’t really level up much in this game after doing all the side quests, so I was stuck on what to do. I believe I was at the max level with all characters. Anyway, I finally defeated the Enchantress. I don’t know if I messed up somewhere in the story, but the battle system had 3 slots for characters and I only had 2 max at all times, so there’s that tidbit.   When it comes to the story, I really did enjoy this game. The story was a nice fairy tale-like one, not too complicated but good enough, in my opinion. I really liked the main characters—Elizabeth and Marcus. Although, Elizabeth did get on my nerves at times when she kept going against Marcus’s advice.   I mean, he had gone through the enchantress’ curse, so of course he knew what could happen to Elizabeth and her brothers!   Yet, she just kept doing her thing, even though it ended up badly most of the time. I’m not sure how much the choices in the game actually affected the story, but I did feel like I messed up a couple of times when making choices. In the end, the game did have a nice ending, although I feel like it was a bit abrupt. I would have liked a bit more closure to it. Overall, this was a fun game and one I’d recommend, especially if you get the season pass! It’s very nice and well worth the price. I hope this developer makes more games like this. Story rich games are fun and the added battle card mechanism was very enjoyable! I’m looking forward to more games like this one. ",
            "review_score": "1"
        }
    ]
}