{
    "app_id": 447040,
    "name": "Watch_Dogs® 2",
    "release_date": "2016-11-28",
    "developer": [
        "Ubisoft"
    ],
    "publisher": [
        "Ubisoft"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Co-op",
        "In-App Purchases",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Adventure"
    ],
    "tags": [
        "Illuminati",
        "Open World",
        "Hacking"
    ],
    "achievements": 0,
    "positive_ratings": 20905,
    "negative_ratings": 5366,
    "price": 49.99,
    "description": "Welcome to San Francisco. Play as Marcus, a brilliant young hacker, and join the most notorious hacker group, DedSec. Your objective: execute the biggest hack of history.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/447040/header.jpg?t=1527101545",
    "minimum_requirements": "OS: Windows 7 SP1, Windows 8.1, Windows 10 (64bit versions only) Processor: Intel Core i5 2400s @ 2.5 GHz, AMD FX 6120 @ 3.5 GHz or better Memory: 6 GB RAM Graphics: NVIDIA GeForce GTX 660 with 2 GB VRAM or AMD Radeon HD 7870, with 2 GB VRAM or better - See supported List* Network: Broadband Internet connection Storage: 27 GB available space Sound Card: DirectX compatible using the latest drivers Additional Notes: Minimum specs above for 720p , 30+ FPS, Low graphic settings // Periphericals: Microsoft Xbox One Controller, DUALSHOCK® 4 Controller, Windows-compatible keyboard, mouse, optional controller / Multiplayer: 256 kbps or faster broadband connection / Note: This product supports 64-bit operating systems only. Laptop versions of these cards may work, but are not officially supported. For the most up-to-date requirement listings, please visit the FAQ on our support website at <a href=\"https://steamcommunity.com/linkfilter/?url=http://support.ubi.com\" target=\"_blank\" rel=\"noopener\"  >support.ubi.com.  High speed internet access and a valid Ubisoft account are required to activate the game after installation, to authenticate your system and continue gameplay after any re-activation, access online features, play online or unlock exclusive content. Game contains EasyAntiCheat <a href=\"https://steamcommunity.com/linkfilter/?url=http://(https://www.easyanticheat.net/)\" target=\"_blank\" rel=\"noopener\"  >(https://www.easyanticheat.net/) anti-cheat technology and Denuvo <a href=\"https://steamcommunity.com/linkfilter/?url=http://(https://www.denuvo.com/)\" target=\"_blank\" rel=\"noopener\"  >(https://www.denuvo.com/) anti-tamper technology.",
    "recommended_requirements": "OS: Windows 7 SP1, Windows 8.1, Windows 10 (64bit versions only) Processor: Intel Core i5 3470 @ 3.2 GHz, AMD FX 8120 @ 3.9 GHz Memory: 8 GB RAM Graphics: NVIDIA GeForce GTX 780 | AMD Radeon R9 290, with 3GB VRAM or better - See supported List* Network: Broadband Internet connection Storage: 27 GB available space Sound Card: DirectX-compatible using the latest drivers Additional Notes: Recommended specs above for 1080p , 30+ FPS, High graphic settings // SUPPORTED VIDEO CARDS AT TIME OF RELEASE: • NVIDIA® GeForce® GTX600 Series: GTX660 or better / GeForce® GTX700 Series: GTX760 or better / GeForce® GTX900 Series: GTX950 or better / GeForce® GTX1000 Series: GTX1060 or better. • AMD Radeon™ HD 7000 series: Radeon™ HD7870 or better / Radeon™ 200 series: Radeon R9 270 or better / Radeon™ 300/Fury X series: Radeon™ R9 370 or better / Radeon 400 series: Radeon RX460 or better. Game contains EasyAntiCheat <a href=\"https://steamcommunity.com/linkfilter/?url=http://(https://www.easyanticheat.net/)\" target=\"_blank\" rel=\"noopener\"  >(https://www.easyanticheat.net/) anti-cheat technology and Denuvo <a href=\"https://steamcommunity.com/linkfilter/?url=http://(https://www.denuvo.com/)\" target=\"_blank\" rel=\"noopener\"  >(https://www.denuvo.com/) anti-tamper technology.",
    "reviews": [
        {
            "review_text": "  *THIS REVIEW IS BASED ON PORT FOR NOW, WILL UPDATE AS I PLAY IT* ",
            "review_score": "1"
        },
        {
            "review_text": "Watch Dogs 1 is forgiven.",
            "review_score": "1"
        },
        {
            "review_text": "Ubisoft didn't lie about this one.... fair optimized, good graphics and better gameplay!! 11/10 would recommend it",
            "review_score": "1"
        },
        {
            "review_text": "  It works and it's fun, you did good Ubisoft. ",
            "review_score": "1"
        },
        {
            "review_text": "Let me say first, this is NOT EVEN CLOSE to the ♥♥♥♥ poor game that was the original Watch Dogs. This game has style, a compelling story and refreshing gameplay. It is stealth based, so if you are looking for a run and gun game, this might not be for you. You can run and gun, but you will die quickly.   In a nutshell, this game is awesome. First time I haven't had buyers remorse for a video game in a long time. I honestly think this is one of the best games to be released this year, and you should give it a go. If you like vibrant world spaces, anti-establishment rhetoric, a compelling story and new and refreshing gameplay, this game is for you.",
            "review_score": "1"
        },
        {
            "review_text": "Let's start this off with something I thought I would never say: Well done Ubisoft, well done.   Who would have thought that Ubisoft would release a game that is both fun and well optimised, maybe they are turning a new leaf, the Steep beta was also both of the above as well. In a time where new releases are plagued by bugs, terrible optimisation and poor console ports (here is looking at you Mafia 3 and Dishonored 2) it is nice to see a game that is actually good out of the gate.   Graphics:   I play on 4k with a mixture of high and medium settings and the game looks wonderful, it is a bit brightly colored and happy, but honestly that is what I think of when I picture San Fran. There is definitly a difference as you drive though Oakland compared to say Silicon Valley, and you don't really even need the map to tell you where you're at as it is visually apparent. The effects that are used, blur, bloom, DOF are all well done and not over used, a stylistic blur comes in when you're cruising top speed down the highway, the shadows are well done especially on the highest settings (though fps taxing) so i roll with them on medium. The cars and characters look nice as well (aside from car interiors, again.)  Story:   I am not that far into the main story line as the side quests are quite enjoyable and varied, but from what I have played of it it is interesting and fresh. There are a ton of pop culture references strewn about the game from Anonymous to Tom Cruise to Scientology and they are all well done and some are actually laugh out loud worthy. The relationship between the group of hackers really shines, the banter back and forth, the picking on each other and the sense of comradery is great, it makes you feel like you're actually part of something.  Sound:  There is a huge lack of volume settings in the game, you cant individually adjust say the radio or the vocals, but other than that everything is spot on. The voice acting is fantastic, in the first few minutes of the game I thought they were going a little overboard with the main character dropping the F bomb, to a point where it wasn't realistic, but it calmed down and everyone has their own personalities that shine through with the voice acting.   Performance:  Running 4k on a gtx 970 is netting me a solid 40 fps (which i will take with gsync) Don't bother with SLI as it runs worse than using one card and temporal filtering. Some people have noticed a large visual decrease when turning this on, I for one haven't seen anything at all. Check my screen shots for some examples of how it looks.    Overall this is the most fun I've had with a game this year straight from the box without having to wait for a handful of patches.   My Specs:  Intel i7 4790k Gtx 970 sli (running single card mode) 32gb Ram Win 10 64bit Acer xb280hk 4k Monitor",
            "review_score": "1"
        },
        {
            "review_text": "Ubi actually made a good game!  +there are giant spider robots",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good game. At first the controls were a bit weird but in time I got used to them. Constant 60 fps, game runs very well and is really smooth, no crashes yet or anything. Definite improvement from the first game.",
            "review_score": "1"
        },
        {
            "review_text": "Well for starters, great game overall. Some people say the characters and story are uninteresting, but in my opinion (the characters atleast) are some of the most memorable characters ever. The performance is fine even for me. Im playing on a r9 280x graphics card and a Fx-6300 running the game at very high setting with temperal filtering on. Would recommend this game",
            "review_score": "1"
        },
        {
            "review_text": "Watch_Dogs 2 succeeds where the first one didn't do so well:  Day 1 optimization, visuals delivered as promise, a good story with interesting characters and an actual good driving system.   But overall besides that Watch_Dogs 2 is a purley superior version of the first Watch_Dogs with better visuals, gameplay, soundtrack and character design except this time you're part of the memy Dedsec hacker group with alot more gadgets and tools to play around with. It's fun and fufills all the expectations the first one was meant to meet and can easily be said worth your $60 if you're willing to buy it before waiting for a sale. I'm pleased and glad Ubisoft pulled off a good port for once without downgrading the visuals. Thanks Ubi, proud of you.   Solid 9/10 out of me.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, I enjoyed the first game but it did have it short comings. This game builds apon the orignal formula of the first game and does it really well. The setting of San Francisco and the surrounding areas was a great choice for a game like this. The Story is a a lot more light hearted and comical compared to the first, I do prefer the darker tone of the first game but this is still a great story.   The PC port is really good the 2 week delay was not a bad choice by any means.  I havent finished the game yet but I would have to say that it is worth the $60 price tag.",
            "review_score": "1"
        },
        {
            "review_text": "I got this game with knowing little of the back story regarding I only played it a couple times, but this game... man this game took whatever I knew from the last game, made it bada** and 24.56x better. This game has one of the coolest story and it is written and played out perfectly, I played over 40 hours in the first week and I finished the whole main mission in that time with hours of co-op. I can not describe how great the graphics are and how awesome it is to play - If you are debating on getting this game, think no longer... get it   My only advice is to use a controler, and try to stealth, not all missions are good for full out combat.  100/10",
            "review_score": "1"
        },
        {
            "review_text": "  Really good game, The texture is amazing, Realistic shadows, Parkour, Cool weapons, Very good graphics, Very detailed, I love this game...   10/10",
            "review_score": "1"
        },
        {
            "review_text": "Although the game is very well optimized, have good graphics, small cool little details and all in all, great from mechanical aspect, I am a sucker for story, side missions, story pacing and the game fails in these three aspects for me.",
            "review_score": "-1"
        },
        {
            "review_text": "Shock .. this is actually a good AAA PC title. Gameplay is fun, the graphics are superb and are fluid, the game is stable, and there are lot's of interesting locations to explore. Can't wait to play some more.",
            "review_score": "1"
        },
        {
            "review_text": "The game looks absolutely stunning and optimization is good.",
            "review_score": "1"
        },
        {
            "review_text": "This game is so cool that I followed it from the start. I played the first one but it lacked some important features but this game will not disapoint, my only consern is that if you have not played the first game you might not understand the story of this game, but if you have you will enjoy every second of this game.",
            "review_score": "1"
        },
        {
            "review_text": "  When I launched Watch_Dogs 2, I thought it was going to be a complete ♥♥♥♥ing ♥♥♥♥♥how like the last one.   I could not have been more pleasantly surprised.",
            "review_score": "1"
        },
        {
            "review_text": "+ One of if not the most optimized pc game I've ever played, smoother than butter ultra 144hz with a 390  + New hacks, parkour and weapons are a lot of fun  + The most amount of customization items of all open-world games, barring colour customization  + Driving &amp; Combat are immensely improved  + Very good animations  + Story/Character development feels genuine, not quirky  + Decent soundtrack  Honestly I have nothing negative to say about this game, if you're gonna get an open-world game get this one, it beats out GTA in my eyes.",
            "review_score": "1"
        },
        {
            "review_text": "the first time ubi didn't fckd it up..",
            "review_score": "1"
        },
        {
            "review_text": "this game is too good to be developed by ubi, there are no problems except for frame drops co op is very fun as well",
            "review_score": "1"
        },
        {
            "review_text": "I love everything about it! I don't mind the graphics like what every other people are, just the gameplay. And for that, the new mechanics are interesting to use!",
            "review_score": "1"
        },
        {
            "review_text": "the best game of my life",
            "review_score": "1"
        },
        {
            "review_text": "tl;dr If you loved the first watch dogs for the hacking and gameplay, you would surely love this, especially with the improved story, hacking options and graphics. If you didnt, there is no harm in trying the game, as it is one of ubisoft's best games in recent years.   I would rate this game 8/10, way better than the first watch dogs, but still not as good as the benchmark of openworld games, gta v.  Note: If you are reading this in december-january before the release a new patch, do not get the game yet because of the current consistent crashing issue. Of the 27 hours i have played, i experienced more than 20 crashes, sometimes only after 30 mins of playing, sometimes after 4-5 hours. Its not unplayble, but nothing sucks more than having a game crash when you are so close in completing the objective of a super hard mission.  When it comes to graphics, this game blows the first game away, and is one of the most beautiful open world games ever. In my opinion it is even better than an unmodded gta v, but its no surprise due to an almost 2 year gap. With Ultra settings and hbao+, pcss and san francisco fog turned on this game looks stunning. It is also pretty well optimized, mainly due to temporal filtering, however the gameworks does kill your fps, and I would not recommend turning it on if you care more about fps. I got around 40-60 fps with all settings set to ultra, as well as enabling hbao+, pcss shadows as well as san francisco fog with my gtx1070. I can easily hit 70-80fps with gameworks turned off.  When it comes to hacking, it certainly feels more diverse, as if you are the one who is making the decisions. The controls might take time to get used to, and i recommend binding the hacking button to your side mouse button if you have a gaming mouse. While i still feel that some features feel limited, the arsenal of hacking tools provided this time gives a much more complete experience. Being able to hack vehicles as well as call hits on innocent civillians makes the hacking fun.  When it comes to gameplay, it is more diverse than the original. It does help that the story is shorter, therefore it feels less repetitive. As most people would say, stick with stealth or gadgets, and try to be non lethal, at least not durectly gunning down enemies. Needing to sneak around and make use of my gadgets as well as the environment makes each mission unique thanks to the many different building layouts and there is nothing better than calling gang or police hits on your enemies, especially when the gangs end up wiping each other out. The world of san francisco is not only beautiful but it packs way more content than the original watchdogs. Missions range from preparing ambushes, controlling a giant spider, breaking into super secure locations and even an easter egg of helping aiden break out from the clutches of a local gang.  Driving is fun, but not realistic. While it is an improvement over the original, it feels pretty 'arcady' as many reviewers said, however with the ability to activate a nitro charge, I think the devs made the driving arcady on purpose. It is fun to drive around, though I would still prefer the driving of gta v. I personally feel that the driving in watchdogs 2 is alot easier when using a keyboard compared to gta v so if you are using a keyboard, the driving in this game might be easier for you.  Not going to spoil the story, but this story is way more lighthearted, and there are more interesting characters in the game, with cutscenes with the villian dusan showing how the other side is faring, and Tbone coming back is amazing, though it would have been funny if tbone referenced aiden sometimes. There are missions which actually show the more human side of these hackers too, with a fellow hacker dying, causing marcus to seek revenge, as well as wrench getting kidnapped and having his mask stolen, and marcus actually risked himself to get his mask back. The protangonist as well as supporting characters are way more likable than the original.  Some of the few things that I especially liked was being able to call hits on people by forging evidence, the presence of various gangs in san francisco who can start fights with each other, the areas with dense vegetation in the city as well as the recreation of famous buildings, or parodies of famous structures (maybe because i'm an architecture student and the details they put into this city sometimes make me just forget my mission and explore instead) and last but not least the parodies of real companies for examply google-nudle, facebook-!nvite etc, as well as parodies of public figures, for example mark thruss being a parody of donald trump.  Is this game a must buy? Yes if you are a fan of the original, but if not, I would wait for a sale. If you are someone who likes good graphics and love to explore the city, someone who likes stealth missions which requires you to utilize your environments, love hacking and gadgets or love cyber jokes and cliches, some which might be pretty cringy, I would say get this game now. If you want to play a game only for the gunfights, this game is not for you. Compared to the first watch dogs and many games ubisoft released recently, this game is miles ahead of those, being enjoyable and fun from the start. It still has a long way to get to the level of gta v. Perhaps giving it more than 4 years to develop would result in a better game, but currently this game is amazing considering how it only took 2 years to develop.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty much everything that made Watch_Dogs mechanically bad is back. There are some improvements scattered around but the overall product is pretty much indeed a sequel to the original (unfortunately, not for the better).",
            "review_score": "-1"
        },
        {
            "review_text": "Great game, worth the upgrade from the original watchdogs  pros= story is much better character is way better than aiden stealth is way better graphics looks pretty good  cons enemy is kinda annoying sometimes while stealthing uplay sometimes dc frame drops when driving not that great of a port but not horrible so its kinda at the mid very squishy characters health",
            "review_score": "1"
        },
        {
            "review_text": "This game is one of the best games i've ever played and i'm not even joking, i had so much fun in the game already and i only played it for 6 hours now, the port is very good, i haven't gotten any lag spikes or anything, suprisingly the game didn't crash at all through out my 6 hour gameplay, and yes i was playing on ultra. The game isnt supposed to be serious its mostly like a parody, so my rating is 10/10 tbh",
            "review_score": "1"
        },
        {
            "review_text": "I can't play the game for more than five mins before it crashes and closes i have tried many thing to try to fix the game with no luck including reinstailing the game multiple times. I wouldn't leave a negitive review if this only effected me but other online have also reported this issue without a fix so it is clearly not just something affecting just me. This makes the game unplayable and is very annoying due to it price",
            "review_score": "-1"
        },
        {
            "review_text": "Its a good game while multiplayer suffers from constant Ubisoft servers maintainance or connecting issues.   Overall: 6/10",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Very well optimized compared to most of the games in 2016.",
            "review_score": "1"
        },
        {
            "review_text": "'Port isn't garbage and there's no downgrade' - Things I never thought I'd hear myself say about a Ubisoft PC release",
            "review_score": "1"
        },
        {
            "review_text": "Watch_Dogs 2 Awesome Game you can hack almost everything..   it's just awsome.!!",
            "review_score": "1"
        },
        {
            "review_text": "It's hard to believe nowadays that Ubisoft could actually create a really great game with a somewhat compelling plot and characters that you actually want to see more of. Well let me tell you that you should believe it: because it has happened with this game. I won't go into crazy detail as I want to keep this short but let me just say that it is awesome and totally worth the (as of 12/25/16) 40 dollars to purchase. I'm not sure about the 60 that I paid for it three weeks ago but it is without question a no brainer for 40 dollars.  9/10 easy",
            "review_score": "1"
        },
        {
            "review_text": "Well Ubisoft has really done great work. Here are my thoughts Marcus is a cool character than Aiden. There is so much freedom in gameplay. Graphics are nice. I don't have the best rig but i can play it without compromising the performance. The Seamless Multiplayer is amazing, but some more modes are needed. Driving is definately improved and smooth. The world feels alive and the atmosphere is nice. I definately recommend the game.",
            "review_score": "1"
        },
        {
            "review_text": "An improvement in every way from the first game  Better driving Better map Better graphics The main character is not a soulless ♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "Great gameplay, amazing graphics  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Generally, this game is pretty nice. It provides a glance at future tech life with creative view.   Pros: 1. Nice PC optimization. 2. Excellent graphics and other effects. 3. Rich story line. (It takes about 14+ hrs to complete the mainline.) 4. Creative view and outstanding hacking system.  Cons: 1. Pretty simple (and a bit boring?) game experience. (only hack, steal, and escape) (I feel every mission is the same, same game with different map. :P) 2. Combat and stealth system could be further improved.  3. Multiplayer mode is not good enough. (but i think Ubi will improve it soon.)  Suggestions: 1. More multiplayer modes. 2. More Assassin/Knock-out ways. (Like double/triple assassin, drop assassin in AC) etc.  I have not completed mainline when i wrote this review. I will update my review ASAP after i completed mainline.",
            "review_score": "1"
        },
        {
            "review_text": "Watch dogs 2 is amazing. Runs very smoothly and the UI is amazing. 20000000/10",
            "review_score": "1"
        },
        {
            "review_text": "I've enjoyed my experience in this game so far, for the most part. CONS: -Poorly optimized. I understand that my GTX 960m is not great, but with all my settings on low (but on 1080p), having the game freeze and drop if fps every 10 seconds when driving fast is disappointing.  -Inconsistent texture quality. Not sure if this is different on anything but low quality, but often there are many ridiculously low-res textures compared to the rest. (Ex: Dedsec logo on Cyberdriver car). I mean, it can be extremely bad at times.  PROS:  -Basically everything not performance/graphic related. -Online invasions! These things are super fun, whether you are the hacker or hackee -Fun gameplay. I prefer to take missions slowly, scoping out areas with my drone (seems to be the way Ubisoft intended) -Great open world. Seems huge, lots of secret areas, fairly detailed.  Overall, I think if you don't mind",
            "review_score": "1"
        },
        {
            "review_text": "I liked the first 6 hours i was only able to play and then i can't find my activation key to continue and i can't refund the game so im stuck right now.   and before you ask how I was able to run the game without activating it idk don't ask me but if it works for you it's fun anyway",
            "review_score": "1"
        },
        {
            "review_text": "---I didn't play the first game due to it having issues on the PC so this review won't be comparing the two. ---  A really fun game in terms of gameplay. The game's art design looks fresh, from the Dedsec hacker cutscenes, the art on your in-game phone and the graffiti design on the street walls. I can tell that they made an effort on that.  The game takes place in San Francisco and the world feels alive and vibrant with NPC's interacting with each other. Characters and story are meh, not that interesting. Basically, you're with a group of hackers called 'Dedsec', your goal is to reveal the hidden truth behind the city's corrupted government and companies, that the people is being manipulated and you have stop this big bad villain that's behind the whole thing. Gameplay wise, it's quite enjoyable.   You can be a ghost, mapping and planning your attacks by deploying RC cars and aerial drones, hacking into security cameras and manipulating the environment. Causing mayhem while you sit back with your laptop, behind the danger. Or, face the enemies head-on rambo style with guns. Many areas and missons can be completed within a variety of being a ghost or a badass mofo, which makes it fun. You can cause local blackouts (which are really cool). If you get somehow spotted by enemies, you can jam their comms, causing high pitched noises and incapacitating them for a short duration while you escape.   Freerunning around is limited, you can only climb walls or buildings to point where you can jump and reach them. You can jump building to building through small gaps. You can't climb pipes and vents are too small for you to crawl into, they're only used for the RC car. You can use lifts though to get you to high places. End game skills require special 'keys' that you need to collect in specific places of the game world. The game tells you where to collect them, however is till feels like a chore to do. Luckily, you don't need to discover or capture fast travel points, you can fast travel between clothing shops, food stores and car sellers. Speaking about cars, the driving is okay, it just gets you from point A to point B kind of deal, not that special. The cars ranges from motorcycles, muscle cars some offroad vehicles, SUV's and high performance cars. They all feel the same with the performance cars just being fast.  There's this puzzle design that feels like a chore with you having to run around the place to finish the puzzle. There are some of these puzzles that you can't finish without using the aerial drone so getting that early in the game is needed. With all of that said, Watch_Dogs 2 is a fun and enjoyable experience, a surprisingly okay port (coming from Ubisoft) and deserves my recommendation.   TL;DR A fun experience and a surprisingly okay port coming from Ubisoft.",
            "review_score": "1"
        },
        {
            "review_text": "CJ you just had to follow the train!",
            "review_score": "1"
        },
        {
            "review_text": "I love this game, its very fun! Amazing graphics, fun driving, fun gameplay,   I liked The first one and I like this one",
            "review_score": "1"
        },
        {
            "review_text": "Ubisoft finally did it",
            "review_score": "1"
        },
        {
            "review_text": "im addicted please send help",
            "review_score": "1"
        },
        {
            "review_text": "Nice game, the story is great but the performance is mwah. Im playing on a I5 6600k with gtx970 and i got approximatley 65-70 fps on high settings, FPS is ♥♥♥♥ when driving through the city.",
            "review_score": "1"
        },
        {
            "review_text": "The game USUALLY crash and exits to desktop since the first day I played. Please have an update to fix this!",
            "review_score": "1"
        },
        {
            "review_text": "Everything the first Watch Dogs should have been. This game feels more like a standalone than a sequel. Literally every aspect of the game has been improved or fixed. I wish they would have done more with the story as it can be played through fairly quickly but there is alot to explore and learn about San Fracisco in the universe the devs created. All in all I enjoyed the game and look forward to what this franchise has the potiential to become.  Pros: Ubisoft actually listened to community feedback.  Large open world that is interesting to explore and learn.  Free HD texture pack for high end gamers.  Vehicle handling much improved.  Interesting likeable characters with alot of personality.  A real sense of progression as your character develops and learns.  Fun multiplayer with a Dark Souls like touch to world invasion.  Cons: Short main story line that can be quickly completed.  AI needs improvement. Stealth mechanics feel very old school.  Side missions tend to get repetitive.    ",
            "review_score": "1"
        },
        {
            "review_text": "I broke down and got this...  I don't regret it...  I is MUCH more PC optimized than WD1...  Just give it a try.",
            "review_score": "1"
        },
        {
            "review_text": "This game is AMAZING. It is a definite better rating then gta 5 in my book. The graphics look amazing and the gameplay is exciting. My onlu complaints are lack of weapons and the performance is a bit choppy even on my gtx 960 4gb v-ram",
            "review_score": "1"
        },
        {
            "review_text": "Great story line but some of the worst programming/coding there is. If you get cops be ready to die to lose them. Apparently SF has billions of dollars and an army at their disposal. You can accidentlly run into a police car then they instantly start shooting you. You non lethal taser someone shooting you with lethal bullets, and the police start shooting to kill. On top of a mountain, 5 police cars spawn out of thin air. Seriously, full on retard mode with the police. Randomly get glitched into the ground with a car and can't move, car randomly turns full lock to one side when only pressing the Gas button. Sniper in the helicopter is still just an aimbot like the first game and can shoot through the floor of the helicopter, some lazy coding there. Armor apparently magically covers the face because it takes 10 shots from an assault rifle to kill a police officer with no helmet.(BTW I turned the difficulty down to Easy mode since the police system is so broken and it doesn't change a thing so difficulty doesn't mean anything)  Seriously Ubisoft....WTF. You could have one of the best games out but instead you spent money sponsoring YouTubers to play the game and build hype ainstead of fixing obvious bugs in the game. I'm just glad I didn't pay full price, Steam Sales saves the day as usual but still wish it was cheaper. If you can pick this game up for $15 then it's worth it.  The storyline is amazing and the only reason I haven't asked for a refund. It's just ruined by lazy bugs/glitches in the game and a terrible police system.  ",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a masterpiece. It adapts for any, play-style; whether you want to barge into the base, shoot everone up, and then steal the USB, to sneaking in, using the cameras and enviroment to your advantage, and completeing the mission with no one the wiser. There is an endless amount of content, and a main story you could follow all day as well. The driving feels great, the strategey is phenomenal, the only downside is that it needs a beefy PC to run well, but once it does, every moment feels like you might as well be in San Francisco, beating some guy to death with a yo-yo weapon.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good story, but there's nothing else. It's just the main story that's enticing.",
            "review_score": "1"
        },
        {
            "review_text": "I'm not expect the game really good like this mate  9/11 to me  kappa",
            "review_score": "1"
        },
        {
            "review_text": "I love this. All the elements in this game come together perfectly forming a rich and fun experience. The world is visually beautiful and you'll actually want to take pictures of sanfranciscos famous landmarks.  I actually wanted to participate in bike races instead of actively avoiding them and you want to earn money so you can buy the quadcopter drone and all the toys and gadgets.  The remote control of the drones in this game is very tight and and you can have great fun manipulating different objects in the world remotely as well as accomplish objectives without having to walk into a single mission area theres a great deal of freedom here for experimentation.  The particle and physics engine is very impressive and it almost feels like being in a movie doing insane things with cranes and slamming the accelerator on an unsuspecting driver at the traffic lights can cause all sorts of chaos that looks amazing. I would love a replay feature in this game!  Guns feel great to use and you'll love playing around with the different weapons.   Characters feel alive and they'll randomly get into fights and react to the world around them which makes for some amusing photographs.In combat the AI can hold it's own and is a genuine threat to the player.   Online is pretty seamless and enjoyable for the most part if you can find anyone to team up with that is. When I did team up with another player it was a pretty great experience!  I had a few clipping isues with the camera colliding with the terrain when doing the dirt bike challenges.   With such incredible attention to detail in the world I can't sit down on a single seat lol but these are minor gripes. Also I can't ride a bicycle although I have a feeling this will be DLC. It only crashed for me a few times and was very stable considering all that is going on in the world.  I would love to see a an option to skip the large hacking puzzles. I just find they are needlessly frustrating and actually made me quit a few of the missions out of frustration..  This is a must buy game if you love open worlds and sandboxes in general. It is genuinally is a fun and addictive game.  Recommended",
            "review_score": "1"
        },
        {
            "review_text": "I pretty much like everything about this game, - vivid and detailed open world - easy and enjoyable driving mechanics - there are enough guns to keep fights interesting - didn't have the urge to skip dialogues like other similar games, on the contrary I found them interesting and sometimes funny, especially between marcus and wrench - you can be completely stealthy or guns blazing - also liked multiplayer and especially invasions and bounties as it keeps things fresh  Negative (on a i7 4790k, gtx 970, 16 GB RAM) : - fps drops (which seem to happen rarely now)  - microstutter  After searching on some forums and watching some videos on youtube, these two seem to be optimization issues and i guess they will be patched. Definitely nothing game breaking though.  Have not finished it yet and the story keeps getting better and better.  I'm really lovin it, def recommend it, especially for assasin's creed fans.",
            "review_score": "1"
        },
        {
            "review_text": "Crashes a lot, wait for patches before buying.",
            "review_score": "-1"
        },
        {
            "review_text": "I already had enough fun out of this to recommend this at full price. Well sike, you got -33% but well I preordered but I must say it's been worth the full price. Beat the game long ago but had fun playing through some missions and just casual roaming. This GAME actually feels 'ALIVE' unlike GTA V.",
            "review_score": "1"
        },
        {
            "review_text": "I was taking pictures of people dressed as zombies. They were happy to pose at first, but then started calling me 'dickass' and 'doucheface'. 11/10  But seriously, it's a really good, fun game with amazingly detailed world :)",
            "review_score": "1"
        },
        {
            "review_text": "Good game overall, much better than the first one. Only few annoinces like forced stealth, game is too long for what it has to offer (about 20hrs), optional missions which are not optionall at all. Would recommend buying on a sale",
            "review_score": "1"
        },
        {
            "review_text": "This game in my opinion has taken me by storm as it completely surprised me with its awesome story campaigns which will keep u busy for a good few days or a week, and awesome and better graphics as compared to Watch Dogs 1. The graphics are really detailed and realistic (for etc. The fog on golden gate bridge and many more). It also has a great amount of side missions which allows you to play together with friends and will definitely keep u busy too. Although, it would really be even more awesome if more players could be allowed for co-op missions and free-roaming. This in my opinion has been the second best open-world game after GTA V. Ubisoft has really step its game up. Side note, there are a few pricy DLCs which aren't really worth it to get but overall, definitely thumbs up and would recommend this game ! :)",
            "review_score": "1"
        },
        {
            "review_text": "Best game of 2016  Recommend this at its best. This game is so awesome and fun to play, but the bad thing is that it is short, not really short nor long.   Super awesome game :D",
            "review_score": "1"
        },
        {
            "review_text": "Dis game is amazing I wanna play this more than gtav even tough there's a lot of bugs its still fun",
            "review_score": "1"
        },
        {
            "review_text": "  Watch_Dogs 2 Review",
            "review_score": "1"
        },
        {
            "review_text": "This game is so fun but there were a couple problems 1 every time i played it my screen would flicker but i found a way around it insted of fullscreen i used windowed and the stelth is preaty basic but it so fun the puzzles were chalenging and fun and i only got to the part where horito died (sopiler alert) and the frist misson is amazing and i love the character Wrench and i love the begening",
            "review_score": "1"
        },
        {
            "review_text": "Totally worth playing it, improved gaming from previous one",
            "review_score": "1"
        },
        {
            "review_text": "Its really fun, i like the character and the scenery, i enjoy this game more than the first watch dogs",
            "review_score": "1"
        },
        {
            "review_text": "if you liked the previous Watch Dogs, then just jump for this one. Thats all.",
            "review_score": "1"
        },
        {
            "review_text": "Ubisoft killed it this time with this game. It should have been like this with the first part. Although I also liked it, but it seemed to be a little bit of a lackluster game. Watchdogs 2 feels so much alive with all the colors and activities put into this. Im playing on gtx860m with medium settings and with a avg fps of 42 its not so bad at all! Definitely Recommended",
            "review_score": "1"
        },
        {
            "review_text": "Amazing Watch_dogs Series",
            "review_score": "1"
        },
        {
            "review_text": "IT'S OPTIMISED! THATS ENOUGH",
            "review_score": "1"
        },
        {
            "review_text": "I've only played a few hours, but this is already ten times the game the original was.  A lot of fun, beautiful and I've only just gotten started.  Would reccomend.",
            "review_score": "1"
        },
        {
            "review_text": "Feels like the only game in the franchise.  (Though enjoyed the first game with the death metal rocking horse)  This game references alot of movies, game culture, memes and pretty much alot of things. The game uses the mechanics of the earlier game and changes it to be more 'indepth'. Setting the mafia on your enemies... then setting the cops after the mafia then looping that around bit by bit is ever so fun.  This game also takes the ♥♥♥♥ out Night rider, Scientology, 'trolls', deadmau5, ubisoft, Nasa, Google... It even had a very detailed female genetalia (until Ubisoft censored it). I don't want to spoil anything of the game other than it is fun. Also don't try to 'Maximise' the settings of Watch Dogs 2 as you will get 100% computer usage if you aren't careful (to the point it can crash).",
            "review_score": "1"
        },
        {
            "review_text": "It works, and its fun. Rare for Ubisoft!",
            "review_score": "1"
        },
        {
            "review_text": "I'm really enjoying playing Watch Dogs 2. To be honest, I thought it was more of a failure as it was the first one but this time Ubisoft goes around and I can rectify the mistakes. I highly recommend, for those who always like to have something to do and explore, this game is for you.",
            "review_score": "1"
        },
        {
            "review_text": "2016 is pretty ♥♥♥♥ed up: Brexit happened, Donald Trump got elected, and somehow Ubisoft made a decent game.",
            "review_score": "1"
        },
        {
            "review_text": "Really disappointed with this Watch_Dogs 2.. poory optimized, terrible anti-aliasing, poor physics and overall bland gameplay.",
            "review_score": "-1"
        },
        {
            "review_text": "Ubisoft Made This Game !!!",
            "review_score": "1"
        },
        {
            "review_text": "A huge improvement on the first game and Ubisoft seems to have learned a thing or two about proper optimization this time around. Its the best open world game I've played  No loading screens between single player/online  PROS  - very good grapichs(specially water *_*) 9/10    -awesome combat 10/10    -good sound and music 10/10    -no loading screen in mp and co-op    -damn good driving    -good weapons    -no repeative missions    -nice player customization   -very good optimized(after applying high res texture pack)  CONS  -2player co op only :(   -packet loss &amp; too much lag while playing with friends   -players can hack your data,money easily -_-     -lil bit problem with shooting :/   -short map   -sometimes faced rendering problems hope will be fixed soon by devs  totally worth the money 4 me ^_^  TYSM UBI &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Drink all the booze Hack all the things Drink all the booze Hack all the things Drink all the booze Hack all the things Drink all the booze Hack all the things     oh and i got ride around the city in a scissor lift  10/10 would spend an hour riding a scissor lift oh and there is a spider tank     This one's dedicated to all the hackers  Even out settle score quick My disaster recovery requires even more disks Put your bytes up, prove it or you forfeit Got my C64 and we blew it into orbit M. Bison with eight straight perfects Overload emotions make hate, break circuits In case you heard, it's a name fake service Optimize our runtime to escape verdicts  Got an integer scope flow That they can't sign Passing code, didn't sanitize Command lines; land mine  So before, they'll see me after I'm Advice dog Courage Wolf Plus Philosoraptor  Don't prove we're human unless we really hafta My team built schemes that destroyed recaptcha Hate what they see, finish this chapter By the way we're not any geeks, we hack into NASA  Drink all the booze Hack all the things Drink all the booze Hack all the things Drink all the booze Hack all the things  Got this Vodka and this Redbull They still give me wings  So we drink all the booze Hack all the things Drink all the booze Hack all the things Drink all the booze Hack all the things  Zero through Three We're in every single ring  I'm just waiting until my blackberry dies Cause I'll replace it with a raspberry pi  Don't compare to this track It makes everything they said dull Neutralize any threat Turn Red skull to dev null  They killed virus writers that we mentioned But instead they ascended to the VXHeavens To reincarnate as live wires Still inside we hide ciphers in signed device drivers  Which school will we hit next? They didn't learn the format So we've gotta printf Next step is a chin check Freestyles that I spit best They didn't decrypt yet  I crush internet MC's in rhyme battles Get your WiFi tackled Hak5 Pineapple I don't think you'll like my snapple Cause I popped it with vodka And a cyanide capsule  We drink all the booze Hack all the things Drink all the booze Hack all the things Drink all the booze Hack all the things  Got this Vodka and this Redbull They still give me wings  So we drink all the booze Hack all the things Drink all the booze Hack all the things Drink all the booze Hack all the things  First we drink all the booze Then we hack all the things Then backdoor the firmware On anything you bring  Regardless of the hardware, service, or encoding Connected it to the internet And someone's gonna own it  This is for the pirates who clap And love the sound Attacking from the cloud Then we're back in underground  There's no masking from us now We pop Tor nodes around the globe Track and hunt you down Hacked on schedule, add it to your calendar Devices online; here comes another challenger  State infiltrated, so undercover This is for my comrades who stare at their debuggers And trace every buffer Examining the code flow Haven't been to sleep? Better pop another No-Doz  I think I'll need a planet sized urn Cause some men just wanna see the world burn Your turn  Drink all the booze Hack all the things Drink all the booze Hack all the things Drink all the booze Hack all the things  Got this zodka and this Redbull They still give me wings  So we drink all the booze Hack all the things Drink all the booze Hack all the things Drink all the booze Hack all the things  Zero through three We're in every single ring",
            "review_score": "1"
        },
        {
            "review_text": "It's like GTA SA on GTA IV engine. If you can navigate GTA SA, you can navigate Watch Dogs 2. I'm also really high.",
            "review_score": "1"
        },
        {
            "review_text": "Honestly, Ubisoft has turned a corner recently it seems - and I'm someone who hates Ubisoft for many reasons. The Division got a 1.4 update, which changed the game for the better. Steep Beta showed promise, and I'll likely be buying the full game in between when I finish Watch Dogs 2 and when Wildlands releases.   I've put 5 hours into Watch Dogs 2 (despite Steam not showing this due to VPN) and it's already enjoyable and I haven't done any actual missions. This game makes me wonder what the hell Ubisoft was thinking making the first Watch Dogs, cause this game takes a satisfying dump all over it.  So in a nutshell, The Division is better than it was at release, Steep Beta made me wet for snowboarding, and Watch Dogs 2 makes the original look like the sibling that nobody likes but is the reason it's new younger brother exists. So if Steep turns out to be good, I will end up looking forward to Wildlands.  It's hard to say this personally, but good job Ubisoft.",
            "review_score": "1"
        },
        {
            "review_text": "Way better then I expcted. It's very similar to GTA in a lot of ways however, the side missions are far better. Also the graphics really are on another level when compared to GTA. The city feels very alive and its absorbs you more then you would expect. Really is a 10/10 experience. Worth the money if you have the money. Easily 30+ hours of content right here.",
            "review_score": "1"
        },
        {
            "review_text": "A great game, interesting story, fun mechanics and all in all just fun.  Highly recommended",
            "review_score": "1"
        },
        {
            "review_text": "i just wanna know why i can't play it. i start the game and a little square with the guy you play as come up and it's loading the game, like it should do. but after like a minute it just completely closes down and quits the game. I can't fix this which i am annoyed at. there are so many people with the same problem.",
            "review_score": "1"
        },
        {
            "review_text": "Rating for Watch_Dogs 2 This is the Best Games for 2016   It has great Graphics and FPS 9/10  Good Soundtrack and Music 10/10  Great Weapons and animation 8/10  Good Storyline, Side Missions and DLC 9/10  Animations 9/10  Overall 9/10  If you Don't know the controls or story, I recommend you play Watch_Dogs first before pre-ordering or purchasing the Games",
            "review_score": "1"
        },
        {
            "review_text": "THIS IS THE MOST ENTERTAINING GAME I HAVE EVER PLAYED IN MY ENTIRE LIFE!   I have a very decent Pc so I can run this game very smooth, with (nvidia control panel settings ajusted) I have had so much fun with this game, and I was playing other games at the time before I got this, (like GTA V ) and I totally dont even wanna go back at the moment because I'm so enticed with WD 2 that even typing this review is taking time from me to play...  I highly recomend this awesome game and online playing will make your adrenaline go high!",
            "review_score": "1"
        },
        {
            "review_text": "Watch Dogs 2 in my opinion, was tons better than the first. The graphics are really nice, TONS of side quests and things to do, I'm not far into the story at all because of all the side quests I'm doing, and each sidequests feels different, despite a few repetitive goals and paths needed to take to complete a quest, the areas, dialogue and characters that is featured within the quest adds variety to the game. I also love the characters in this game, especially the difference in personality within the DedSec squad.  My one gripe about this game is how badly optimized it is, I have an i7 6700k, GTX 1070 with 32gbs of ram and I'm running this game at 60-70fps at 1080p very high settings. With a system like this I expect well over the 70s range while running at the ULTRA graphics preset. When I do run my game at the ultra preset, my game stays at 60fps but drops to 30-40 every few seconds which is a big turn off, but I do understand that it's stil fairly early into Watch Dogs 2's release so I shouldn't complain. I have also experienced well over a few bugs in co-op with a few friends such as teleporting and disconnections, which I expect to be patched later on.  Overall I definitely recommend this game! Even if you haven't played the first one!  EDIT: By turning on 'Temporal Filtering' my fps shot up to the high 80s to low 90s when I'm at the ULTRA preset.",
            "review_score": "1"
        },
        {
            "review_text": "Only played 2 hours of it, and its so much better then the original. A lot more customization to your character, the cast is way cooler, this game has drawn me in already and I'm loving it!",
            "review_score": "1"
        },
        {
            "review_text": "I've been longing for it for a long time!!!And great improvement on driving",
            "review_score": "1"
        },
        {
            "review_text": "Good performance, no downgrades. All the while considering it's an Ubisoft game, Watch Dog 1 ran poorly and was downgraded from the E3 version and it's using GameWorks. That's impressive.  Runs around 60fps on my slightly old AMD hardware (though on Medium, but still looks great). So far the game is quite fun, hacking is interesting, but I've only played about a hour so far.  Whatever the first game was, the sequel has improved everywhere. Get it",
            "review_score": "1"
        },
        {
            "review_text": "This is an amazing game! Could not stop playing it when I bought it!",
            "review_score": "1"
        },
        {
            "review_text": "Finally a game that is optimised in 2016..",
            "review_score": "1"
        },
        {
            "review_text": "Obviously, this is better than the first Watch_Dogs. Optimization is good, just some frame drops from time to time.  Also selfie simulator.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, much better than the original",
            "review_score": "1"
        },
        {
            "review_text": "Nice game",
            "review_score": "1"
        },
        {
            "review_text": "Watch Dogs 2 is a big step up from the first one this game feels much more alive than the orignal, Also the little touches Ubisoft have added makes it alot more realistic.  There are new toys to play with in which to hack and interact with the world, very enjoyable experience the time I've put in to it so far 15h +   The graphics are great even on meduim settings I'm running on Core i5 2500K @3.3GHz with Asus HD 7950 3GB, 8GB 1600 MHz Memory... I get 45 FPS  10/10 from me",
            "review_score": "1"
        },
        {
            "review_text": "Three save slots in a Ubisoft game???   What sorcery is this?!!!!!  But seriously the game actually works and is fun as well. Well done Ubisoft! A big recommendation from me. 8/10  EDIT:  The optimization is - mediocre, but the game works, I really hope the coming patches improve the framerate, just don't go in with a GTX760 and expect wonders.",
            "review_score": "1"
        },
        {
            "review_text": "Three save slots in a Ubisoft game???   What sorcery is this?!!!!!  But seriously the game actually works and is fun as well. Well done Ubisoft! A big recommendation from me. 8/10  EDIT:  The optimization is - mediocre, but the game works, I really hope the coming patches improve the framerate, just don't go in with a GTX760 and expect wonders.",
            "review_score": "1"
        },
        {
            "review_text": "Just purchased watchdogs 2 gold edition, Won't let me play without an activation code where do i get one?",
            "review_score": "1"
        },
        {
            "review_text": "This game succeeds over the previous Watch_Dogs! I am having so much fun throughout San Fransisco, and just having a blast playing as Marcus. The game brings the quadrocopter and the RC car to the hacking ability! I love this game, Ubisoft take word, this is what a good game is!",
            "review_score": "1"
        },
        {
            "review_text": "changing my review to a NO.  game crashes every time you even remotely aim a gun and shoot. no reason for it at all. happens in co op or SP, and makes a black screen crash.   YES, the game is a vast improvement to the original. YES, as a whole the game is a worthy purchase. BUT, random unexplainable crashes on updated drivers, graphical settings set to what is optimal for gameplay AND on a rig that can handle the game on high-very high within reason is something YOU do not want.  nor can i back the day one cosmetic pay for dlcs, all of which should be included with the pass (most are not) or simply be in game as is.  you can pat dogs, use scissor lifts as get away vehicles and launch people with explosions....... thats if the game does not crash. wait for a few months, get a [hopefully] patched game.",
            "review_score": "-1"
        },
        {
            "review_text": "I forgive you Ubisoft, but dont dissapoint me again.",
            "review_score": "1"
        },
        {
            "review_text": "To be honest, this is the game that watch dogs one should have been when it was released, a very intense and good campaign, lots of stuff to do in the pvp, and very likeable characters! all in all, a very good game.",
            "review_score": "1"
        },
        {
            "review_text": "UBISOFT DID IT!     A GOOD GAME!   ",
            "review_score": "1"
        },
        {
            "review_text": "10/10 whould delete again",
            "review_score": "1"
        },
        {
            "review_text": "I have a really good computer that can run bf1 on ultra at 60 fps, and I can't run this game on medium without getting 15 fps. Game is good but optimization is poor",
            "review_score": "-1"
        },
        {
            "review_text": "Pros: 1. A great gameplay, much wider range of hacking tools than in the first Watch Dogs. 2. San Francisco city is ALIVE. 3. Great graphics. 4. The online part of the game is really fun. 5. Good replay value, breaking in Goo... Nudle and other buildings again, when you have upgraded you hacking arsenal is fun. Cons: 1. Stealth is only good when playing with gadgets, as you alert everyone if enemy spots you even for a fraction of a sec, when going for a personal aproach. 2. Even though the hacking arsenal is good, if you're into Computer Science, you might feel the game lacking a bit more serious aproach to the hacking process.",
            "review_score": "1"
        },
        {
            "review_text": "Rating for Watch_Dogs 2 This is the Best Games for 2016   It has great Graphics and FPS 9/10  Good Soundtrack and Music 10/10  Great Weapons and animation 8/10  Good Storyline, Side Missions and DLC 9/10  Animations 9/10  Overall 9/10  If you Don't know the controls or story, I recommend you play Watch_Dogs first before pre-ordering or purchasing the Games",
            "review_score": "1"
        },
        {
            "review_text": "Even though the first one wasnt a fan favorite (I still like it), it was still a cool concept for a video game. Ubisoft did a great job this go. The story is absolutely hilarious, gameplay is smooth on ultra (980ti), driving is very clean. The new hacks you can do with your mobile device are also very nice. Not to menthion, T-BONE IS BACK! Anyone that is thinking about getting this game should defenitaly pull the trigger and get it! 9.9/10",
            "review_score": "1"
        },
        {
            "review_text": "Good job on the PC port Ubisoft. Very optimized and runs super smooth. A rarity these days... 60 - 80 fps on GTX 1080 with all video settings maxed.  Some very lame/corny/cheesy moments of dialogue...",
            "review_score": "1"
        },
        {
            "review_text": "anonymous the game",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ interface and player controls, no freedom of movement because the game forces you into a stealth or combat state. Imagine gta5 then imagine the protagonist with downsyndrome.",
            "review_score": "-1"
        },
        {
            "review_text": "My Specs i7 6700k GTX 1070 32 gb ram  i've tried everything this game is literally unplayable. It has tons and tons of stutters especially while driving it is the worst optimized game i've ever played in my entire life.",
            "review_score": "-1"
        },
        {
            "review_text": "Games looks promising, storyline ok, hero is fine, the multiplayer aspect is well integrated in the solo, anyway I'm experiencing since the beginning various crashes &amp; stuttering on a 2015 PC (i5 6600k / GTX 970) in any of the presets (from High to Low, I've voluntarily not tried Very High and Ultra).   Waiting for an uncoming patch, I've tried a lots of 'fixes' found on the Community Hub / Forums / Internets. Next attempt is uninstalling from SATA HDD to install on SDD but, hey, game should be working instantly (at least with the default presets autodetected by the game), we haven't to try everything to play a game we paid...  If you want to try your luck, wait for an agressive promotion (max 10-15€).  ",
            "review_score": "-1"
        },
        {
            "review_text": "Love It I can't Get Enough of It",
            "review_score": "1"
        },
        {
            "review_text": "VERY ENJOYABLE AND GEORGE CARTER OF 9TR1 IS A SWEAT",
            "review_score": "1"
        },
        {
            "review_text": "Good choice of (fitting) music in certain scenes Optimization Good character development Good Gameplay Buy it lol",
            "review_score": "1"
        },
        {
            "review_text": "game of the year 2016 freom me",
            "review_score": "1"
        },
        {
            "review_text": "Look son, a PC game with optimization in 2016",
            "review_score": "1"
        },
        {
            "review_text": "well played",
            "review_score": "1"
        },
        {
            "review_text": " My view on Watch_Dogs 2",
            "review_score": "1"
        },
        {
            "review_text": "Wouldn't do anything but put a black screen up, and no refund. Thanks Steam!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "I don't have the time to comment deeply about this game because I just want to play it right now. It's awesome.",
            "review_score": "1"
        },
        {
            "review_text": "I liked it. Maybe you will too.",
            "review_score": "1"
        },
        {
            "review_text": "I'm incredibly thankful to Ubisoft for delaying this game. Optimization is amazing, game looks incredible. Missions are very fun, story takes itself less seriously than Watch_Dogs. Do yourself a favor and buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would commit cyber terrorism again",
            "review_score": "1"
        },
        {
            "review_text": "Definitely a step up from the first one this game has a more fun and colorful gameplay style",
            "review_score": "1"
        },
        {
            "review_text": "Im happy to have a new open world game.  Im happy it worked on PC first time  Im happy the game is vibrant exciting sandbox and not a dull snooze fest  Im happy to see representation of minorities  Im very happy with this game",
            "review_score": "1"
        },
        {
            "review_text": "Played a little over an hour. So far so good. Remember to update your drivers before you play and the game runs fine. I get about 30-45FPS on my laptop's GTX 960m. The game is very fun. It's like a beautiful cross between GTA and Assassin's Creed. It feels like a real city and the NPCs feel very alive as well. The driving is a major improvement. It feels a bit like rocket league like you're driving a RC car. I do reccomend it. I think the game lives up to its price point.  EDIT: After playing on my desktop's GTX 960 I can safely say this a great port of a great game. I get 60fps on high settings at 1080p. 10/10 would reccomend.",
            "review_score": "1"
        },
        {
            "review_text": "it turns off the lights on my keyboard on boot",
            "review_score": "1"
        },
        {
            "review_text": "It's a group of hipsters in the Bay Area who think they are too edgy for society so they attack google or sumethin idk it's fun tho",
            "review_score": "1"
        },
        {
            "review_text": "Dear ubisoft: not every pc gamer has 2 gtx 1080s.",
            "review_score": "1"
        },
        {
            "review_text": "the hacking gets really boring after some time and the game kept crashing every hour for me",
            "review_score": "-1"
        },
        {
            "review_text": "Best Open World Game I Have Ever Played!!!",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed the first one way better and the graphical quality hasn't improved much or at all. The space to make more content is there, but they didn't. You can do all of the side missions before you get half way through the main missions. The target locking absolutely sucks, you could aim directly at a person to hack their phone and end up crashing a car a block away.  I also had problems with audio clipping along with ai malfunctioning in the forms of clipping into each other or some how finding their way into the cutscenes in the hackerspace and Wrench's garage.  The game seems pretty boring and linear even before the half way mark.  The map is pretty spread out and everything is already discovered for you making it easy to just fast travel around.  The longest parts of this game are not the missions it's the time it takes to go through the one sliding door at the hackerspaces (HQ) combinded with parkouring around on buildings to get to the objectives.  The majority of the game can be done solely by the RC car and the Quadrotor which makes it really unneeded to buy any weapons from the 3D printer, even more so when you notice that you can pick up military grade guns from just about any dead body. The only reason to buy a gun is if you need a supressed wep. Overall it was a giant let down, but I really wasn't expecting much going in. Only bought it because it was on sale and I ran out of solo campaign games to want to play. **Side note: PC Gamer didn't give it a very good review.  ****EARLY GAME SPOILER:::: THE BLACK GUY (HERATIO) DIES FIRST. LIKE BRUH.*************",
            "review_score": "-1"
        },
        {
            "review_text": "Just 5 minutes into it and MIND = BLOWN! And, as you all know, epic optimization!",
            "review_score": "1"
        },
        {
            "review_text": "It's like if sam fisher was put in a grand theft auto game as a hacker. Plays like splinter cell in combat.",
            "review_score": "1"
        },
        {
            "review_text": "very big improvement over the first one. the game itself is atually very fun. you need a pretty beefy pc to run it tough. recomend 5/7",
            "review_score": "1"
        },
        {
            "review_text": "The open and care free world is great, better than gta in some places. The addition of co op mode was much needed. Only disappointment is its pixelated graphics at 1600x900 resolution and lower. Hope Ubisoft brings out a patch to remove this asap.",
            "review_score": "1"
        },
        {
            "review_text": "Silky smooth, great gameplay, somewhat interesting story and a must have!",
            "review_score": "1"
        },
        {
            "review_text": "It's showing me a black screen when i start it up, i want a way to fix this please fix ubisoft, I only reccomend cause I heard it's hype.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game no doubt",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game but it is pretty difficult to run and I get only about 50 frames on somewhat medium settings. I recieve some massive frame drops which is fine because it was recently launched but I would like to see it fixed.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game but it is pretty difficult to run and I get only about 50 frames on somewhat medium settings. I recieve some massive frame drops which is fine because it was recently launched but I would like to see it fixed.",
            "review_score": "1"
        },
        {
            "review_text": "So far much better than the first one. I guess I need a slightly better video card than my 780, some lags are noticeable, but nothing major. My aiming in this game sucks for some reason, but I don't really shoot up ppl that much. Well done, Ubi.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game yet with my 1070 computer it comes to a crawl at mere single digit fps at random times. Unplayable at that point, but it's somewhat rare. Absolutely phenomonal game. Much better than the first, that's for sure.",
            "review_score": "1"
        },
        {
            "review_text": "  The game is fantastic but they need to update the game so it doesent lag as much",
            "review_score": "1"
        },
        {
            "review_text": "Thoughts: This game is better than the first watch dogs game. I like the characters. Pros -Driving is better. -More Missions. -Good Story -If you shoot civillian or cop you dont lose rep. Cons -After completion of the story and side missions not much to do. -Multiplayer is bad.  Recommendations for ubisoft -Improve multiplayer -Make Dlc where you can play as one of the dedsec crew characters.",
            "review_score": "1"
        },
        {
            "review_text": "100/100",
            "review_score": "1"
        },
        {
            "review_text": "100/100",
            "review_score": "1"
        },
        {
            "review_text": "i'm a chinese player, i think this game is really amazing, i have had a great fun in the single mode. but the online mode is awful because of the lag and frequently drop-off. i really want the Ubisoft can improve its online serve in China.",
            "review_score": "1"
        },
        {
            "review_text": "I was pleasantly surprised with how much fun this game actually is. If you’re craving a fresh open-world game I can tell you I have absolutely been satisfied. A sale may be ideal, but supporting Ubisoft with the full $60 purchase will not be in vain, as the work, in my book, is a definitive success.",
            "review_score": "1"
        },
        {
            "review_text": "Yes.      Better Than The First One.",
            "review_score": "1"
        },
        {
            "review_text": "I really recommend you to try out this game!! Why? Beachside you can  Hack Kill Run Fly Ship Die",
            "review_score": "1"
        },
        {
            "review_text": "i've seen a whole mixture of reviews for this game some good and soom bad. i'd lke to start my review by saying that if you played watch dogs and enjoyed it chances are your gonna like this game too but if you didnt enjoy the first i would still recomend that you try this one as it is a whole lot better. is watch dogs 2 the next best open world game? no, not by any stretch of the imagination but is it a great, fun game to play? yes i got this game 3 days ago and ive already gave it over 20 hours of my life and im prepared to invest a lot more hours.   the story  the story of watch dogs 2 isnt one your really gonna remeber in a year or two but that doesnt mean it isnt enjoyable, its a basic plot; take down blume but it has some great missions to play through and along with the the funny band of characters and some good gameplay i can over look the fact that your character doesnt really have much of a good reason for hating blume or any big coorperations   the characters  probably the biggest improvement in this game from the first. the protagonist in watch dogs 1 was almost meaningless, he didnt have any personality or any emotion except '♥♥♥♥♥♥ off'. the new protagonist marcus is almost the modern young, hip teenager stereotype and its funny to play as him hes kinda goofy and seems to make almost any situation light hearted. the other chracters in your hacking gang dedsec are also great the girl (i cant remember all their names) is pretty cool too shes like the hippie type of person that loves art and hates everything governments do. wrench is a straight up funny character and is pretty similar to marcus always cracking jokes. josh is more like the awkward nerd who hasnt ever done anything wild and his interactions with marcus are hilarious.   the gameplay  gameplay mechanics are similar to the first although i much prefer the stealth now it feels more free and challenging the gunplay is meh though   overall i definitley recomend this game if your into open world games it really is just a fun game to play  ",
            "review_score": "1"
        },
        {
            "review_text": "dont get it if you have a low end PC it can get really laggy",
            "review_score": "1"
        },
        {
            "review_text": "Easily one of my favorite games of 2016. Everything about it just works, and is a load of fun. If you enjoy open world games, I highly recommend picking this game up. Especially during a sale.",
            "review_score": "1"
        },
        {
            "review_text": "I found a dog, I was happy.",
            "review_score": "1"
        },
        {
            "review_text": "Reviews seem to be much better than the first one. An hour in and I agree with the positive reviews.  Except of course that the game drops to 30-40fps as I drive even on low settings, which is refund worthy for me. I had enough issues buying this even on sale after the debacle of Watchdogs 1, a month after release and it still having fps issues during its main segment of gameplay is a no go for me. I'll wait until I upgrade my rig, by then I can get more than 20 bucks off for this.",
            "review_score": "1"
        },
        {
            "review_text": "I finshed the game and i think its worth your money, every last cent 8.5/10 - RIP Blume",
            "review_score": "1"
        },
        {
            "review_text": "Can't comment on the quality of the game, as choices made by the design team mean the game will refuse to run on any system which fewer than 4 cpu cores. Even worse, this is not shown on the store page, despite being a major issue to anyone running a more budget, modern system",
            "review_score": "-1"
        },
        {
            "review_text": "One of the best open world game of 2016 hands down .11/10",
            "review_score": "1"
        },
        {
            "review_text": "As the pagefile gets larger, the stutter gets worse. With 16GB of DDR4. The game ran fine on launch",
            "review_score": "-1"
        },
        {
            "review_text": "I wanted to like this game and after 2 hours I thought to myself just keep going it'll get better and it did not get better. If you want a fill the gap game like I did and think that this wanna be GTA would be a good choice then let me tell you dont do it. Just go buy GTA V.",
            "review_score": "-1"
        },
        {
            "review_text": "its actually good what the ♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "ITS WORKING!!!   I love this game so much!! Best game I bought in 2016!!",
            "review_score": "1"
        },
        {
            "review_text": "nice better than wd1,but i dont understand that multiplayer---",
            "review_score": "1"
        },
        {
            "review_text": "This is everything Watchdogs should have been.",
            "review_score": "1"
        },
        {
            "review_text": "Nothing particularly stands out here, and to be honest, I found Watch Dogs to have a superior story. The hacking mechanics in this are far better, some of the graphics are prettier, but overall, while I wouldn't discourage anyone from getting if they just really enjoy the series, I'd certainly wait for a sale. Can't recommend this at current price.",
            "review_score": "-1"
        },
        {
            "review_text": "This game has promise. However, at present, the framerate stutters SEVERERLY in the open world, despite whatever graphics settings I give. 60 FPS in closed areas on ultra, 5 FPS driving around on minimal. As such, I was forced to refund this game. I'll probably wait until next year to look into it and see if it was patched to run properly. Until then, I can't recommend this.  Shame really, I was looking forward to playing and I liked what little I did get to do...",
            "review_score": "-1"
        },
        {
            "review_text": "Half the time when I close the game it renders my system unable to open programs or shut down properly. Thanks, UPlay.  (As a game, it's a bit annoying at first, then there's a nice period where you have stuff unlocked but are still discovering new ways to use it, then it becomes boring Ubisoft paint-by-numbers in, admittedly, one of their most atmospheric sandboxes with some characters that, at the very least, are written consistently and have a stance. But it still renders my PC unusable when it closes. So... fun?)",
            "review_score": "-1"
        },
        {
            "review_text": "Did...... did Ubisoft really make this? This is beautiful.",
            "review_score": "1"
        },
        {
            "review_text": "WD2 is very cool games. There are alot of things to do. The story is ok, the gameplay is ok. But the performance on my PC is more than awful.  My configuration is as follows:  CPU - i5 4590 VGA - GTX 1070 RAM - 16GB @ 1600 My resolution is 1680x1050. And as I said above the performance is awful. It does not matter on what settings I put the graphics. The games runs around 30-40 fps. But most of the time runs at 29fps.   ",
            "review_score": "-1"
        },
        {
            "review_text": "Okay, so Watch_Dogs 2 for me was great. A few bugs here and there but it is a new release, give it a break. The story line is good, full of action and intense moments.  Pros: Dope ♥♥♥ hacker Great Story YOU GET A MOTHER♥♥♥♥ING QUADCOPTER!!!!   Cons: A few bugs Missions are a bit repetitive Sometimes doesn't feel like you are in 'control' of Marcus, movements is a bit fiddely. Lack of different cars (If you buy this game for the driving you may be disappointed)  I would defenitely recommend this game to people. Very fun.",
            "review_score": "1"
        },
        {
            "review_text": "Seems like Ubisoft learned their lesson with WD1, Better optimization, Good graphics, loving gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "Great Job Ubisoft.",
            "review_score": "1"
        },
        {
            "review_text": "plzz help me guys... when started to playing after formatting my pc it was working fine giving 40 fps...but now when i start the game it gives only 30 fps..ie 10 fps has been eaten away by game .. i dont know what is the prblm..plzz somebody give me a fix for this bug or prblm ...thnx in advance... ",
            "review_score": "-1"
        },
        {
            "review_text": "Way better than the first one! I wont say pros and cons, but a little spoiler:     Defalt is in the game! Hes coming back! Which is for me the best because i am actually Defalt. Look on my youtube channel to understand it. If you dont want to, then dont go on my YT channel (TheTrackster)   ",
            "review_score": "1"
        },
        {
            "review_text": "Its good..worth the money..optimized",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome!! Better than the first one!",
            "review_score": "1"
        },
        {
            "review_text": "I dont usually review so this is going to be short.  I haven't had this much fun with a game in a long time. It looks and runs beautifully. I do get the occasional frame rate dips into the mid 40's but they are a rare occurrence. I'm running 2 GTX 970's and an i5 4690k oc'd to 4.6ghz. Overall I am really impressed with what they have done with the I.P. I haven't turned on the multiplayer aspect of the game yet so I cannot comment. I have heard some people are complaining about the driving, I however have found it enjoyable in an arcade sort of way. I'm about 10 hrs in and plan on putting in a lot more.",
            "review_score": "1"
        },
        {
            "review_text": "Great, game.. I accidentally got the russian version (xD) by mistake but it was quickly solved by the settings on steam. Great story and gameplay.. Recommended!",
            "review_score": "1"
        },
        {
            "review_text": "very nice pc game havent been hooked with one since gta/csgo rate 10/10",
            "review_score": "1"
        },
        {
            "review_text": "A Actual Good Optimized Ubisoft Game for PC It actually runs really well,pretty much every setting is customizable fov,Hud etc, im liking it so far. No downgrade from E3 footage too. Good job Ubi!",
            "review_score": "1"
        },
        {
            "review_text": "awesome game all around cant wait for ansel and i need sli :)  San Francisco great story environment",
            "review_score": "1"
        },
        {
            "review_text": "its great",
            "review_score": "1"
        },
        {
            "review_text": "dips to 25hz with a rx480 at max settings without msaa, fog, motion blur, dof, extra detail at 1080p on win7",
            "review_score": "-1"
        },
        {
            "review_text": "Finally you can be the ♥♥♥♥♥♥ Styled Anonymous-Weebo-Hipster-Neckbeard-Edgemaster-Hacker youve always wanted to, but couldnt because you cant code and have adult responsibilites! 8/10 would Troll again!",
            "review_score": "1"
        },
        {
            "review_text": "This game is really solid so far but even on meduim settings the game stutters real bad i get good frames most but with random frame dips and stuters please fix",
            "review_score": "1"
        },
        {
            "review_text": "This time i can literally watch dogs!  10/10",
            "review_score": "1"
        },
        {
            "review_text": "IDK if u know this but u can hack in this game.",
            "review_score": "1"
        },
        {
            "review_text": "Such a fun game it's like a better GTA V",
            "review_score": "1"
        },
        {
            "review_text": "So ahh... I mean look at these packs that offer clothes and customizations for your car and drone... I mean if they merely sum up they are more expensive than the gold edition right? And this game just came out not long ago..",
            "review_score": "1"
        },
        {
            "review_text": "- Terrible optimization, frame drops under 60 with R9 Fury (w/ i7 4770k 16GB RAM).  - Especially there are trees, CANT EVEN GET 60 with the LOWEST settings - A LOT of frame stuttering and random frame drops to under 30, if you have any kind of frame rate target / Vsync turned on - Worst online server, can't connect properly even with 1000Mb/s network. - Anti-cheat disabled by its own make me cant connect to the multiplayer server - Car on demand / Calling your vehicle, never works properly.",
            "review_score": "-1"
        },
        {
            "review_text": "Sooooooooooooo lets begin. First of all i just wanna say PewDiePie is only in it for the money. Second of all the story mode was absolutely super duper kind of good (could be better but who cares right?) This game has some awesome graphics it runs smoother than Trumps ♥♥♥. The guards in this game is like cancer + aids i dont like them.",
            "review_score": "1"
        },
        {
            "review_text": "If Steam would let me, I'd refund this. I regret trying to give this game an honest try - it's boring, repetetive, and the controls are frustrating.",
            "review_score": "-1"
        },
        {
            "review_text": "after being shout at by middle-aged cops in games like GTA for years, female cop voices in the game turns me on a bit. . Pleaeese punish me, I've done bad things. ( ͡° ͜ʖ ͡°）  中文：警察姐姐的性感声音让我微微一硬",
            "review_score": "1"
        },
        {
            "review_text": "The worst of the worst. Dont buy this if played GTA V, stick to it.  This game is far from GTA V Killer, driving in this game is very cartoonish and cant be compared to GTA V at all. Graphics are nicely done however gameplay is very confusing and bad driving.  I totally regreat buying this game. I tried to get refund but i exceeded steams refund policy of max 2 hours of gameplay. I used the first 2 hours of gameplay for browosing on youtube tring to figure out the first mission (Very confusing) and ended up exceeding their policy.  Now, i will just delete this game. Waste of hard disc space.",
            "review_score": "-1"
        },
        {
            "review_text": "Runs pretty good, much more interesting characters and toys and a few improvements in gameplay over the first title.  Still this game was nothing more than a timewaster between diaperchanges for me. It didn't engage me nor am I interested in any dlc or ever playing it again, and one thing that was ALOT better in the first title was the car chases. There are almost no missions, main or side, that includes carchases where you can use your hacking to stop pursuiters. I uppgraded that branch completely and the only time I got to use it is if I deliberatly ♥♥♥♥♥♥ off the cops to trigger a chase. I don't recomend this game really unless you are stuck at home with a baby and need something to waste time on when he/she sleeps. ;)",
            "review_score": "-1"
        },
        {
            "review_text": "i meet all of the requirments for the game but is still so laggy. whats wrong?",
            "review_score": "-1"
        },
        {
            "review_text": "at least, there's a dog around..",
            "review_score": "1"
        },
        {
            "review_text": "There are even Watch Dogs in the game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is very awsome. I like this game very much",
            "review_score": "1"
        },
        {
            "review_text": "The game is SO much better than the first in almost every single way. It's easily as fun, seems bigger for certain - and the story is WAY better. Give it a chance - it's worth it!",
            "review_score": "1"
        },
        {
            "review_text": "At first glance this is a great game. However after playing it for just two hours I find the gameplay to be extremely repetetive and borderline pointless. There is very minimum character customization, missions feel... mediocore. Overall this is not a game I would recomend to anyone at all.",
            "review_score": "-1"
        },
        {
            "review_text": "terrible optimization with 1060, 16gb ram, win 10",
            "review_score": "-1"
        },
        {
            "review_text": "A SCAM!  Downloaded and excited to play this game to find out that I didn't recieve an activation key. Steam support ticket or Obisoft support doesn't help me out.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is amazing but not recommended for low pc performance :) gg ubisoft",
            "review_score": "1"
        },
        {
            "review_text": "Pros:  1. The map : You can roam around all of SF, it's huge and it's lively. Devs must have put in a lot of work mapping a whole real city in a game. 2. The phone's music feature is kinda new, usually you can listen to songs while driving right ? well guess what, in WD2 you have a music app that you can play throughout the game (you can't put in your own songs but WTH it's still cool). 3. Story rich.Characters are cool, especially Wrench and Marcus' duo.  4. Parkour is great, and if you go out and do the side missions, like collecting money bags or skill points, trust me some of them really take a lot of work and thinking, it gives me a weird sense of satisfaction when I collect a difficult to reach item. 5. The online part, the hacking invasion part is the same as Watch Dogs 1 but adding the drones to the equation makes it a whole lot interesting, it's hard to do if you are up against a skilled player but nevertheless it's a thrilling experience to not be caught.  Cons: 1. Even on the best of PC hardware the FPS is limited to around 60-ish (I have a GTX 980 and i6 4690K with 16 GB Corsair Vengeance RAM) 2. The nudle map is kinda annoying to me, I mean it's all great and all but it's difficult to locate yourslelf given the really small and indistinguishable blue marker. 3. For most part the online part works good, but it's still a little buggy. 4. Not much detail given to driving and cars. I mean if you compare it to GTA V, it just doesn't feel all that great to drive.  My score : 8.5/10   Overall : Definitely a good game and recommended.I hope some performance patch is released soon.",
            "review_score": "1"
        },
        {
            "review_text": "Where is Watch_Dogs® 3?",
            "review_score": "1"
        },
        {
            "review_text": "Is NO ONE capable of making a PC game that is bug free? For a while there I truly began to believe that it was Ubisoft. I'd played about 25 hours of this game without a single problem. No crashes, no misfires, no GPFs, no tantrums, nothing, just smooth gameplay in three easy sessions. Now I can't even start the game. Crashes every time. The source of this error, I am convinced lies with this insane perversion of a save system that has been imported from consoles (because, Y'KNOW, anything that works on a standard spec machine will OF COURSE work perfectly on 20,000 variations of PC), where you have ONE save (three separate games, but you cannot choose to save the current game to one of those), and if it corrupts, and having learned nothing from RAID5 and its inherent flaws, there's an online backup, but it's copied from the local and corrupted file. YAY! Instant start-your-game-from-the-beginning-all-over-again! Until PC game distributors insist that developers introduce F5/F8 technology, PC games will always be the poor cousins of console games, and we should not bother with buying them.  This SHOULD have been a good game, and for 30 hours, it was. But, like FC3 before it, now it's just taking up valuable space on my HDD.",
            "review_score": "-1"
        },
        {
            "review_text": "Smh EasyAntiCheat ♥♥♥♥s up my online constantly, and then the ToS for EAC is crazy. I stream so i play in windows mode, they legit say they can and will whenever they want screen capture and post on public sites, anything that is in the photo that i did not take nor have pior knoweldge of, is fault of my own only. SO either i keep getting dropped/people get dropped due to EAC and can't play online*Only reason i bought game, I OWN GTAV* or i turn off EAC and never play Multiplayer? OH WAIT OR I REFUND THIS ♥♥♥♥. I ♥♥♥♥ing got conned the first game preorder and season pass LEGIT waht a week of ♥♥♥♥ beng down on day 1? SMFH not worth 60 bucks if can't even play online. Gonna give it a few more tries and keep googling other dumb workarounds.",
            "review_score": "-1"
        },
        {
            "review_text": "All new game in 2016 have a ton of issue and this literally is the only game where: I didnt have to change my sound driver for any reason because the game is optimized for it (Thank Goodness) and there where no crashes or frame rate issues whatsoever. Good Job Ubisoft on a good PC port for this game!",
            "review_score": "1"
        },
        {
            "review_text": "not working for me asking for a disk",
            "review_score": "-1"
        },
        {
            "review_text": "Game was great on my new high end system, until I got to the second misson, which gave me the Blue screen of death (BOSD). I investigated it on the internet and it only seems to be me that has this problem. My setup is a fresh I7 6700k, GTX 1080, 32gb ram, 3600mhz. Everything else runs like butter on a Crumpet, but in a certain stage, second mission, I get the BSOD, with immediate restart.  I tried looking this up on the internet and utube, to no avail. Seems a waste that it crashes and takes my money. If you have my similiar setup then the game will be broken for you. Sorry to say, If know one else will tell you..",
            "review_score": "-1"
        },
        {
            "review_text": "Game crashes on startup or after a few minutes of gameplay without even an error message. Forums are full of the same/similar problem and after 4day still no patch, fix or solution.",
            "review_score": "-1"
        },
        {
            "review_text": "Absolutely crazy to not have English Text in a game and no support for English, when bought on Chinese Steam Region. What they think this region only has Russian and Chinese readers? I have bought and been gifted many games, but this really is beyond Business etiquette and even rasist on the level that i have never seen before.   Me being foreigner living in China for last 12 years, and not being able to get a game in English. And i have to change region to Europe or USA and pay more for the game, just for Language? That is just WRONG!  Having more than 20+ titles of UBISOFT this is the limit. Why support a game company that is not supporting its players. And only focusing on maximising profits, and not actually focusing on the gamers.",
            "review_score": "-1"
        },
        {
            "review_text": "pros: starts up  cons: can't play",
            "review_score": "-1"
        },
        {
            "review_text": "This game suffers from the same optimization issues that Watch Dogs 1 had (shadows flickering, colors randomly changing, etc.)   Chances are, Ubisoft won't fix that. Good plot, but not worth the time. Try buying it on a sale. A very huge sale.",
            "review_score": "-1"
        },
        {
            "review_text": "im a fan of watchdogs but the game wont frikin start. i frigin love the games watched it on twich and alll i have well over the specs but somehow ubisoft says im not allowed to start it? i want a refund.",
            "review_score": "-1"
        },
        {
            "review_text": "An interesting game filled with too many bugs, unrealistic abilities, and scenerios that don't make sense (why would people be abanding money and expensive gadgets around the city?). A lot of improvements over the first Watch Dogs, but I feel they went backwards in some areas. The bugs however are really making this game hard to play. You're probably better off just watching playthroughs for the time being.",
            "review_score": "-1"
        },
        {
            "review_text": "Worst PC-port ever! I've got FPS-drops all the time while driving and I just got a new gaming pc.... Someone pls sue Ubisoft!",
            "review_score": "-1"
        },
        {
            "review_text": "i strongly recommend this game if you are new to watch dogs. but you see i have had many dificulties from the start to the end also mentioning that i currently live in china and they give me russian and silmplifyed chinese versions of the game. so, as you may have guessed i have refunded my game. ps ive seen walk thrus and the story is brilliant",
            "review_score": "-1"
        },
        {
            "review_text": "I just cant play after the first level, the game crash every time.",
            "review_score": "-1"
        },
        {
            "review_text": "If you don't have a very high end computer to run this, don't even bother. I can only run this game at low settings for it to run smooth and it looks absolutely terrible. Don't buy this game if you don't have the new Nividia graphics card, otherwise you will be very very disapointed",
            "review_score": "-1"
        },
        {
            "review_text": "  why this game are locked in Chinese ang Russian lang????",
            "review_score": "-1"
        },
        {
            "review_text": "Trash. Not on fleek even a little.",
            "review_score": "-1"
        },
        {
            "review_text": "Terrible performance. I refunded and I'll wait to see if they ever fix it.",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ game poorly optimised my gtx 1060 6GB and I7-4790 cant even run this game at ultra 60fps still broken dont buy this game yet wait for another patch performance fix",
            "review_score": "-1"
        },
        {
            "review_text": "Bad optimization. I have a GTX 970 and a i7-4790K and get good framrate in all the games I've tried. However this game gives me stable ish 60 fps at low graphics.",
            "review_score": "-1"
        },
        {
            "review_text": "Minimum Specs lie, I only get 27-35 frames on lowest, Gtx 950, amd-6300 clocked at 4.3 ghz, 16gb ram",
            "review_score": "-1"
        },
        {
            "review_text": "I want to like this game, but the fps is way too inconsistent. Yes, I've lowered the settings, but nothing changes.",
            "review_score": "-1"
        },
        {
            "review_text": "Hell no, one of my most anticipated game of this year, not at all what i expected, the map sucks, becomes repetitive as hell, story is no show at all, badly optimized, they might patch it but for now its really sad to see that a card like Zotac GTX1070 AMP Extreme (system is good no bottlenecking) also can't handle it, even on lowest settings fps drops. BF1 looks more intense in graphics and still plays better than this game, and ONLINE is so bad, it sucks, i was expecting a GTA style Online but naah, that's too much of a deal to expect from Ubi, man wasted money on season pass edition, requested a refund, i wish i get my money back :(",
            "review_score": "-1"
        },
        {
            "review_text": "Do not buy this! every damn game now is always open world, It's not a downgraded ♥♥♥♥ storm like other ubisoft titles. The story is just to bland, u can tell they focused more on the world and less on the story!",
            "review_score": "-1"
        },
        {
            "review_text": "Really lame story. Overall a boring game.",
            "review_score": "-1"
        },
        {
            "review_text": "Ran at 25-35 fps on my GTX 1060 6GB. Not surprised it is Ubisoft lmao",
            "review_score": "-1"
        },
        {
            "review_text": "I bought the game in China for apparently full price and it's limited to Russian and Chinese. I'm Canadian. Why limit language selection to region?",
            "review_score": "-1"
        },
        {
            "review_text": "even cannot enter the game..",
            "review_score": "-1"
        },
        {
            "review_text": "it sucks",
            "review_score": "-1"
        },
        {
            "review_text": "can i have my money back please",
            "review_score": "-1"
        },
        {
            "review_text": "  I love Watch_Dogs 2, I think it is the greatest Video Game ever made and I would be willing to be shot to death in an alleyway just to defend Watch_Dogs 2.",
            "review_score": "1"
        },
        {
            "review_text": "Don't buy this game!",
            "review_score": "-1"
        },
        {
            "review_text": "Haven't played it at all yet. I like using the xbox one s controller. Doesn't seem to be supported so I'm probably going to just get a refund until this is fixed.  edit: I ended up just playing the game to see what these guys in the comments were crying about. I really prefer gta 5.So 1 thumbs down.",
            "review_score": "-1"
        },
        {
            "review_text": "soo not sure is the graphics are too good or its my pc . game runs at 27/to 35 fps   i5 6500 3.2gh 16g ram msi gtx 1080  and msi motherboard and the gaming app oc",
            "review_score": "-1"
        },
        {
            "review_text": "That game is awesome in every ways! Love the selfies option! I strongly recommend it, but have more than 8gb of ram",
            "review_score": "1"
        },
        {
            "review_text": "the game works fine i give the game a bad review for bad stutter but it was my bad it was my hard drive i got a ssd and its great to add my hard drive was dying",
            "review_score": "1"
        },
        {
            "review_text": "Woops, someone got hacked..",
            "review_score": "1"
        },
        {
            "review_text": "i love it and all but why is there no way to talk to people via text instead of voice?.. :(",
            "review_score": "1"
        },
        {
            "review_text": "like gtaV they disided to make the stor fun, I would say that GTA V may have a smarter story with its satire but this one is funier and gives me the nerd giggles",
            "review_score": "1"
        },
        {
            "review_text": "The game has improved in general - graphics, hacking, etc. The driving is actualy good now. The only thing i don't like is the story. The story is more like joke and mission to fool around with others. Watch dogs 1 while had a basic story, the game had a better mood and feeling when playing it.",
            "review_score": "1"
        },
        {
            "review_text": "I watched 2 dogs 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Great game",
            "review_score": "1"
        },
        {
            "review_text": "So far not a single problem.. Runs better than the first one (lol)  Ubisoft did good this time!",
            "review_score": "1"
        },
        {
            "review_text": "I like this game very much. In my eyes This is way better than the first waatch dogs because it has more of a story and It has much more to do in watch dogs 2. It shows what goes on within the system unlike the first watchdogs ever did. but overall this game is fantastic and if you are looking to buy a new game for yourself this would be the one",
            "review_score": "1"
        },
        {
            "review_text": "So far looks good, feels good. No problems at the moment, i recommend a buy if you can.",
            "review_score": "1"
        },
        {
            "review_text": "This game is what Watch Dogs 1 SHOULD have been. It took all the bad and made it good.",
            "review_score": "1"
        },
        {
            "review_text": "Just amazing u can't even compare wd1 withwd2 it's just amazing game!!Well 70€ spended!!",
            "review_score": "1"
        },
        {
            "review_text": "Amazing! Do you like open world games? Do you like games with new ideas? Do you like hacking in-game? Do you like co-op missions?  The perfect game if one of these are correct!  Hacking, Open world, Driving,Drones, And alot more!  Great graphics aswell! Better then the PS4 version xP  Go ahead and buy it!",
            "review_score": "1"
        },
        {
            "review_text": "I am actually really enjoying this game so far! I know I have only played one hour at the time of this review, but I don't see this game becoming boring. I will update if necessary. This is a complete upgrade on every front compared to the first game in the series, and I wasn't expecting it to be this enjoyable. The dialouge can be a little cringey, but the game runs great and is a blast to play. 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "I am honestly surprised with Ubisoft, i did not expect a good pc port from them. I know a lot of people are still complaining that it is not well optimized but as you can see it's a minority so it's either them(they are being a little bit too ambitious withtheir settings) or it's a pontual case with a specific setup which might get fixed along the way.",
            "review_score": "1"
        },
        {
            "review_text": "Just and awesome game with interesting missions . Endless world to roam through with interesting characters and the city feels so alive , the seamless multiplayer is just awesome and one of the main attaraction of the game . Could be more better with wide choice of activities would have added ! Keep going ubisoft",
            "review_score": "1"
        },
        {
            "review_text": "Full Review after clearing the game:  Cons 1.The fps drops constantly for GTX1070 (Nov.29 Lastest Driver Installed) at Very High setting (not Ultra) with Shadow only High, I can only get around 45-55 fps when there is a large scene (like a couple buildings and people around) being rendered (unplayable), and 60-80fps in rural area like mountains, ocean, or small town (playable). You may think 50 fps is enough for you, but sadly it is not a stable framerate, you will get around a floating 40-90 fps which makes the game unplayable and the gun aiming completely out of control. Even above 60 fps, you can still feel the little shuttering when rotating your camera. If you want best graphic settings possible or smooth game experience, just hold on for the optimization patch if they could deploy. 2. I did not find the fps limit option, if there must be a fps drop, at least give us a option to limit our fps, we want a stable fps, even if it is only 50 or something (like Forza Horizon 3, 48 fps limit) 3. Anti-Alising is extremely bad, all stuff are jagged as hell under No AA or MSAA2x, if you want a MSAA4x no jagged stuff experience, due to the existing bad fps drop and the large amount of graphical computing that MSAA requires, simply, you can't play the game. 4. Compare to GTA5, AI is not that good for a open world game, if you kill a guy in public, some other guys will come and attack you (THEY ARE NOT AFRAID) 5. Personal point of view, if there will be less cop or restricted areas around when you kill someone or rob a car in public, it will be more fun for free roaming, currently the cops and gangs are a bit overreacted. 6. Some missions are a little bit harder than I expected, result in a great numbers of replay, and I have to deal with the frustrition of it.  Pros so far: 1. Passionate character and main story, it's a very fun game to play, main sotry involves a tons of different playstyle. 2. Side Missions are incrediablely instersting, no repeated grinding at alll, all missions are fresh and different, some of the side missions also feature a great number of cut scenes. 3. It's a lively San Fransisco, players are able to explore the world in their own ways, there are a lot of stuff going on in the city. 4. Clothes Designs is great, there are tons of different clothe shops selling different styles of clothes for your character to wear, which makes the character customization diverses. 5. Music is well produced, and decor the overall style of the game, you can hear ochestra melodys when doing some mission, or some progressive electric music when doing other missions.  Overall, if there is no frame rate issue, this game will be greater, but it's still a very good game to play!  My Rig: i7-4790k, GTX1070 FE, 16GB DDR3, Game installed on SSD, 1080p resolution",
            "review_score": "1"
        },
        {
            "review_text": "This is what we call a sequel..it takes the core hacking concept from its predecessor and shifts from the dark-revenge game tone to a cheerful , vibrant and fun story campaign with seamless multiplayer mode . Graphics are photorealistic ...Really well optimized...Well done Ubi...U deserve the bucks this time !!!",
            "review_score": "1"
        },
        {
            "review_text": "If anyone owns the original Watch Dogs, get this one. It's an apology letter from Ubisoft to prove it can do better and they did a fine damn job. This game is so addicting, the story is really ♥♥♥♥ing good, the missions are ♥♥♥♥ing amazing, and the jokes the characters make are ethier funny or not funny depending on your sense of humor and refrence-gettings and love the refrences sometimes. Overall, this game makes the original Watch Dogs look like an alpha version of this game. I would give it a 9/10. (The extra point is for doing a great job and working on your past mistakes of Watch Dogs, Ubisoft.)",
            "review_score": "1"
        },
        {
            "review_text": "It wasn't as bad as I expected it to be. The setting's as good as Ubisoft normally makes it, which is really good. One of the few things they excel at. The DLC's still up in the air but I wouldn't be too optimistic about length and fun-to-cost ratio.  Graphics are fine, even on low. Performance is a bit on the iffy side, but my PC's pretty low-spec'd as it is.  Biggest gripe for me is the plot, which is genuinely terrible in every single way. It's like someone tried to make bad low-cyberpunk/young-adult fiction based on how the characters act and so on. A few cheesy laught, but ehh. Honestly, the best way to resolve that is to just look at this game as if the plot's an outright parody of what it seems to be.  just get it on sale or something.",
            "review_score": "1"
        },
        {
            "review_text": "I can barely play it and I'm not sure why. I get around 14-35 fps on all quality settings.   Specs:  AMD FX-8320e ASUS GTX 1060 6gb 16GB RAM at 1866 MSI 970 gaming mobo 400W psu ",
            "review_score": "1"
        },
        {
            "review_text": "Awesome Game!!! Story Line Action Hacking Freedom And Most Important Graphics All are awesome And This Time Ubisoft didn't Downgrade This time they Patch the Previous Watch_dogs ♥♥♥♥ up",
            "review_score": "1"
        },
        {
            "review_text": "I played the first game and loved it! I couldn't wait for this game to come out and I haven't been disappointed yet. The game is fun and the characters were really well done.   I love having the ability to have remote devices that can go into areas where our hero can't go. I've only got the RC Jumper so far, but it adds something extra to the gameplay.  The nice thing about it is that you don't have to play the first game for this game to make sense. The creators did a great job of giving enough information in this game about what happened before that this is easily a standalone game.",
            "review_score": "1"
        },
        {
            "review_text": "Was hesitant to buy because of how the first one was. Don't let it discourage you. Went in with low expectations but was completely blown away. Great characters, decent story, beautiful environment. One of the better games I've played all year.",
            "review_score": "1"
        },
        {
            "review_text": "A great story, amazing soundtrack, amazing settings, etc 11/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is incredible in so many ways, here are reasons why.  - Amazing SToryline - Amazing Graphics  - One of my Popular Open World experience but he are reasons that I question. - Where the hell is Aiden Pearce? - What happened to Aiden Pearce? - Why is this game so much fun?  This game is literally my life. I am not joking. This is actually my #1 open world, freedom, thirdperson experience. How do you even manage to pull this off? It's incredible ubisoft good job guys and gals down there.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent come back from the fail that was the first Watch Dogs. Game is excellent all around, good story, great world, fantastic gameplay. The multiplayer seriously improved too and feels more blended into the world. Not much else to say, it finally feels worth the money :D",
            "review_score": "1"
        },
        {
            "review_text": "Just like the majority of people, I was skeptical of playing this due to the first one being a little disappointing. I was thankfully pleasently surprised. I was entertained throughout with great characters and a great plot. Some of the missions were a little weird and I'll admit I only got through them by bad npc movement. The hacking was a lot of fun and the climbing was frustrating but satisfying once you'd figure out how easy it really was. I would definitely recommend playing. And Wrench, I mean c'mon. He alone is worth playing the game. I don't think I've ever had such a huge crush on a game character. Didn't know I was capable of such girly squeals when he'd show up. 10/10 babe.",
            "review_score": "1"
        },
        {
            "review_text": "The game is cool",
            "review_score": "1"
        },
        {
            "review_text": "To start off, this game does have optimization issues. I interpret Ubisoft's minimum and recommended specs very differently. The minimum system requirments should probably be the recomended requirements or at the very least somewhere inbetween.   The optimization issues are the only issues I have. There are two things you must look out for; driving fast (you lose FPS), and lots of police lights. The police lights will reduce your frames by at least 5 fps (depending on your hardware).  Enough with the cons. The game runs great, loads super fast, and looks amazing. They made an almost perfect replica of San Fransisco and the story line is good. Most people hated the first Watch Dogs, I actually enjoyed it and I think it was a neccessary stepping stone for the almost perfect Watch Dogs 2. If you love hacking, shooting and driving fast, this game is perfect. This game is like GTA, but (IMO) much better.  ",
            "review_score": "1"
        },
        {
            "review_text": "It has a different feel from watch dogs 1. Not only are the graphics better but they turned it into a true free roam world! I would recommend this to be a buy but alittle expensive at $59.99",
            "review_score": "1"
        },
        {
            "review_text": "This is a very fun game. I do reccommend to anyone that atleast has the minimum requirements. This was made alot better than the first watch dogs. But still yet Ubisoft or Ubishit has done a poor job of optimizing the game but it is still playable. Driving is the worst thing in this game since it will drop your fps a good amount. Graphics are amazing!  Pros: Better hacking Very Fun Good amount of gameplay Amazing graphics  Cons: Optimization is ok Driving is terrible Need a good-end computer ",
            "review_score": "1"
        },
        {
            "review_text": "This game is great! I loved playing all the missions and always had something to do! This kept me playing, but something is that in GTA V once i finished that game i played it even more because of the mods in the game. But this game has anticheat which really annoyed me, i thought that once i was done playing the game i would just free roam using cheats.. But no.",
            "review_score": "1"
        },
        {
            "review_text": "This game is Beautiful with the ultra texture pack. its Ubisoft so alot of missions become repetitve but over all im having loads of fun dont think its quit worth the 59.99 I got it on sale for like 10 bucks off and so far im happy with that.... wait for it to go on sale and definitly pick it up :P",
            "review_score": "1"
        },
        {
            "review_text": "It's alright like...",
            "review_score": "1"
        },
        {
            "review_text": "Loving it so far! Very well done game and its quite entertaining. But there is performance issues and poorly optimzation for the game. But if you can deal with it and get passed the annoying stuttering at times, you'll have a lot of fun playing!",
            "review_score": "1"
        },
        {
            "review_text": "I preordered the game, and it was worth it. the new RC car and Drone are so much fun to play with",
            "review_score": "1"
        },
        {
            "review_text": "Tons of fun and the story is great. Loving it so far.",
            "review_score": "1"
        },
        {
            "review_text": "It isn't mentioned anywhere on the store page but online play requires the use of EasyAntiCheat, which oversteps its boundaries a bit by monitoring a ton of system resources while the game is running. EAC can be disabled (add '-eac_launcher' to the game's launch options) but doing so restricts you from online play.  Definitely makes the original Watch_Dogs feel like an alpha build compared to this. Only real gripes I have about the game are the odd use of weapons by a hipster artist/hacker movement, adding casual murder to scenarios such as breaking into server farms or lightly secured scientology spin-off churches. Stealth can also devolve into spamming mobile disruption and running by guards undetected or simply using the RC for an entire mission. Playing the game non-lethally and refraining from using a lot of the crazier abilities makes the game a whole lot more challenging and thrilling.  Multiplayer feels massively improved on, with next to no loading times (5 seconds on average of background loading when connecting to other players). The in-game invasions work just like the original game, players can invade you and initiate a hack to 'steal' your data, but a new PVP mode was introduced. If a player gains too much attention from the police, other players may go after them and kill them. Both modes happen periodically while running around San Francisco but they can also be started manually.  All in all its a solid 8/10 and worth checking out.",
            "review_score": "1"
        },
        {
            "review_text": "SO ADDICTING. The graphics are nice and the 'high res pack'(DLC,Its free) makes it even better. A few bugs but it just came out about a month ago so don't expect it to be perfect.",
            "review_score": "1"
        },
        {
            "review_text": "PROS: +Good Story +Side Characters  +Very Nice graphics.  +Character customization  +Good parkour moves +Drones  +Civilians AI +Soundtracks +PVP +ADDICTIVE +Can arrest or kill someone with 3rd parties +Can make a war   CONS: -After beat the game, characters are just dead and the world feels empty  Overall: -Buy this game if you love the hacking mechanics and some future technology",
            "review_score": "1"
        },
        {
            "review_text": "Pleasantly surprised with how good it actually is. Nothing it does is outstanding, but as a whole the game is fun to play. I've put 33 hours in and just finished the main story, so there's plenty of stuff to do. ",
            "review_score": "1"
        },
        {
            "review_text": "Just buy it. You wont be dissapointed at all.",
            "review_score": "1"
        },
        {
            "review_text": "Dog watch simulator 2.  Now with actual dogs.",
            "review_score": "1"
        },
        {
            "review_text": "Most fun you'll ever have with forklifts in a game.",
            "review_score": "1"
        },
        {
            "review_text": "  very very good time alas too short and less than side missions than in the first game but i recomend it... bvery good graphically and you can HACK EVERYTHING",
            "review_score": "1"
        },
        {
            "review_text": "Raises some intersting points on Alien VS. Predator. However I still do think that Aliens win out with sheer numbers.",
            "review_score": "1"
        },
        {
            "review_text": "Enjoy facing off against endless hordes of security guards because stealth is completely broken. The game forces you to go in guns blazing on realistic difficulty because of this.",
            "review_score": "1"
        },
        {
            "review_text": "can some one help. Game wont start up becasue uplay wont start up. already tried uninstalling and reinstalling",
            "review_score": "-1"
        },
        {
            "review_text": "Ignore anyone that says this game is bad because the first one wasn't good. It's a completely new idea. I highly recommend this game to anyone.",
            "review_score": "1"
        },
        {
            "review_text": "Good Story, Fun gameplay mechanics, Somewhat Optimized, Open and Fun open world.  When I say 'Somewhat Optimised.' Everything runs fine, except for when you are driving, when you drive really fast it stutters like a ♥♥♥♥♥. Keep in mind this is with a GTX 950 and a FX-8320 on medium settings.",
            "review_score": "1"
        },
        {
            "review_text": "I like this game. :)  -cons and bugs .Bug where game chrashes randomly, can be annoying especially when you are in the middle of a mission .The wanted meter thing dont dissapear, only way to fix is by killing yourself .Somewhat simple gameplay, not that much variety in puzzles and whatnot. .Civilians/ai is way to overeactive .When in multiplayer you die as a hunter for example it says that the other people left the session which is not true because i left the session by dying, idk this just pisses me off for some reason.  -Pros .The dialoge between wrench and Marcus is 5 star content .The game actually hit me in the feels .Interesting missions that are fun .Lots of gameplay (40 hours+ with side missions and main mission) .Stealthy .Ok-good music that can be turned on everywhere  All in all i recommend this game, especially if it is on sale.",
            "review_score": "1"
        },
        {
            "review_text": "i would like this game but everytine i launch it goes to a back screen so if anyone can help me i would be thankful",
            "review_score": "1"
        },
        {
            "review_text": "It's a very nice game first day no issues but on the second day it crashes within 1min - 1hr.",
            "review_score": "1"
        },
        {
            "review_text": "Well...what can i say. Nice touch on SF and its innovative mood. map is kinda small but exploreable. Acceptable.  But ♥♥♥♥ ubisoft for not giving us ENGLISH AUDIO. dont want marcus speak russian... yea i know it said purchases in this region will only receive cn/ru languages blablabla. All in all, pretty good game but not much improvements from the last one seems like a dlc. But might refund.  -after 1 day of playing- well this game is completely out of my reach. i got a gtx650 and even at lowest graphics settings it's still glitchy to play. well...i'll prob get a gtx980 after high school entrance exam. don get chance to use any electric devices till then anyway. gotta leave it there till june.",
            "review_score": "1"
        },
        {
            "review_text": "Watch_dogs 2: Pros:  +Colorful city +Customization +More parkour +Graphics +Marcus Holloway +RC Jumper +Flying drone +AI is more interactive  Cons: -The only thing to do after main missions/side missions is to get research points and play multiplayer -They could have added more multiplayer gamemodes -The story is kinda dull and short -The ''silenced guns'' aren't even silenced. -The driving is still bad (For me atleast) -Dlcs are ♥♥♥♥ even the Zodiac killer dlc (which I was excited for) was ♥♥♥♥. And the free dlc (Private Eye) is ♥♥♥♥ aswell -Stealth was better in Watch_Dogs 1  I really love this game but Ubisoft should have put more effort into the story and made more missions. I rate it 7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Can't believe ubisoft made this. Must be a ghost developer doing it for them.",
            "review_score": "1"
        },
        {
            "review_text": "CALL THE COPS, CALL THE GANGS YOU ARE NOT GETTING ME ALIVE! TAKE THE RAM, TAKE THE RAM! I am taking a selfie while you guys fight, btw. You mad bro? COPS, GET'EM! //Prime_Eight, I hate you //KILL'EM ALL //DEDSEC FTW        No,seriously this game is pretty cool and fun,the graphics are good,physics are somewhat okay. This game comes with quite a lot of content and the game size is not big at all. Pretty good game if you want a little twist on these open world shooting games by not making gunfights the primary target of the game. All missions so far can be beaten without single bullet. The call cops/gangs option can be exploited and make missions so much easier ,if you don't want the fun, that is. 10/10 will play as wrench",
            "review_score": "1"
        },
        {
            "review_text": "please god don't take this down the AC route",
            "review_score": "1"
        },
        {
            "review_text": "I can honestly say that Watch Dogs 2 is my favourite game of 2016, Besides the meny problems with glitches and the anticheat system. Good hob Ubisoft",
            "review_score": "1"
        },
        {
            "review_text": "Watch Dogs 2 is good but it has many issues lets start with the anti cheat glitch through out my time playing the game the muiltiplayer was fun but a few days ago it went and F*^ked itself and turned my anti cheat off then on THEN off stopping me from playing online co-op I since just left it and tried to get to the end of the game if that was possible with crashing 24/7 mid mission or just looking in the sky this game needs some fixing before I can say its 'good'",
            "review_score": "-1"
        },
        {
            "review_text": "yea it good",
            "review_score": "1"
        },
        {
            "review_text": "Great game, its super fun. There are different ways to approach every mission. Only one issue- FPS drops. Ubisoft, please fix the FPS issues on PC, it just drops while driving.",
            "review_score": "1"
        },
        {
            "review_text": "You can get an achievement for petting dogs.",
            "review_score": "1"
        },
        {
            "review_text": "Very good game. Nice storyline and good concepts. The shooting could have been better. Side operations are a bit easy but still fun. I recommend it",
            "review_score": "1"
        },
        {
            "review_text": "Very Interesting , this is a good game .",
            "review_score": "1"
        },
        {
            "review_text": "You can get an achievement for petting dogs.",
            "review_score": "1"
        },
        {
            "review_text": "If there's a single concept that sums up how this game plays, it's the strength of your technology versus the fragility of your flesh. No matter how much research you do to improve your hacking capabilities and the gadgetry you wield, there's no way to make yourself run faster or survive any longer against a hail of bullets. The game's central power fantasy is to mess with online-connected devices in ever more elaborate ways, while its central challenge is how to maneuver your fragile self past guards, robots, and security lasers to get to various important devices that have been isolated from the Internet. This combines into a character with massive offensive and limited defense who either dies quickly or wins spectacularly, and it's an absolute joy to figure out ways to win against high odds and bring down every guard in your way.  Or you could just bumble a little RC car through air vents until you get it close enough to the target computer to stick a USB in and start hacking. That works, too.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, highly recommend! The hacking mechanics are very nice and clean, as well are the stealth mechanics. Great story, along with great characters, make for one of the best experiences of 2016!",
            "review_score": "1"
        },
        {
            "review_text": "I found a vegen that was eating peperoni pizza.",
            "review_score": "1"
        }
    ]
}