{
    "app_id": 447190,
    "name": "Pub Encounter",
    "release_date": "2016-04-12",
    "developer": [
        "Dogenzaka Lab"
    ],
    "publisher": [
        "Dogenzaka Lab"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 16,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "Otome",
        "Visual Novel"
    ],
    "achievements": 15,
    "positive_ratings": 112,
    "negative_ratings": 17,
    "price": 13.59,
    "description": "&quot;Pub Encounter&quot; is a romance game where you can fall in love with one of several middle-aged men.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/447190/header.jpg?t=1478745312",
    "minimum_requirements": "OS: Windows 7 Processor: 1.8 GHz Pentium 4 Memory: 1 GB RAM DirectX: Version 9.0c Storage: 1 GB available space Additional Notes: Resolution: 1280x720",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Oh well, to my surprise, i like this one more than Destiny's Princess, because actually i dont have mature man fetish, but this novell surprised me with interesting romantic lines, and some *hot staff* early game ':). Maybe it's because i picked younger characters, but i'm scared to touch the older one, who knows if i find my hidden fetish.  +Touching romantic stories  +You actually can get laid in this one :) +Guys who are 30+ already but are still handsome +Rare example of josei on steam, but dont forget, this one filled with old man, if you want younger one try the Men of Yoshiwara, there are a lot of hot boys. +I like OST -Personally i find that background lacks of details, sometimes it looks blurry and kills beauty of the foreground view -I think that 6 save slots is not enough for games with a lot of routs and characters like this one",
            "review_score": "1"
        },
        {
            "review_text": "I am new to playing otomes and I chose this one as my 'first' one because I'm an older woman. I'm not a school girl, nor do I want to be one, so I jumped on the first one I found with men with some age on them, thank goodness. It's a little silly, but then a lot of them are. I was just so grateful for facial hair on the guys I almost overlooked everything else. It's not Voltage, but there's a lot to be said for being able to purchase something like this outright instead of being micro transactioned to death. I wish there were more of these made for a more adult/mature audience.",
            "review_score": "1"
        },
        {
            "review_text": "Aw I love this game!! The music is relaxing, and c'mon now... an otome dating game where you woo older menfolk in a classy bar? Hells to the yea! (OK so maybe I just happened to be the target audience for this masterpiece... your mileage may very. LOL.) Also, I WISH THIS BAR WAS A REAL PLACE. I would go there. Every. Effing. Night. And. Day. It's hard to find a classy bar, ya know? Esp one filled with sexy ojisans. :-P  Bought solely for Ryu's story but I will probably try the other ones at some point too. Though truthfully the way the other men (e.g. not Ryu) are drawn, it looks like they're either crack addicts with weird sunken in eyes, or just old grandpas. @__@; I can probably get past that part and enjoy the stories even if some of them are hopelessly predictable.   So far the only exposure I have had to the protagonist is thru Ryu's story, and she seems more dom than most Japanese generic female MCs. So I am hoping she doesn't act like a 'tard in the other routes, though after reading some of the other reviews that cite other routes, I am starting to lose hope, LOL.  Anyway, so glad this game (and similar ones by the same dev group) are on Steam now because previously I had tried to play these on my phone and it was sooo annoying cause of all the adverts!! So yay!! :D I hope they make more 'niche' otome games like this where you can woo older men. 'Cause some of us perverts are into that. xD  Bonus points that the screenshot feature actually works in this game and that there are acheivements, yay!  Also another thing worth noting - unlike the vast majority of other otome games/dating sim games out there, you must pick a guy's path up front. It's not one big free-for-all which to me, kinda makes the concept lose its allure just a tad. But not a dealbreaker for me. I like the 'freedom to choose' concept...and the idea you could end up falling for another guy instead of the one you originally set out to get is thrilling to me...er...or something. LOL. But yea, like I said, not a dealbreaker, just a bit different (for me anyway.)",
            "review_score": "1"
        },
        {
            "review_text": "why the ♥♥♥♥ not, I thought while buying it and now here Im all horny over old ♥♥♥ man (Mamoru best man)",
            "review_score": "1"
        },
        {
            "review_text": " Full review on Youtube   A steamy, melodramatic romance game that mixes charming men with cheesy dialog. It's pretty much the otome game equivalent of a dollar-store romance novel.  Pros:  - Attractive and charismatic older male characters - Gorgeously drawn CGs - A unique and somewhat off-beat premise   Cons:  - Almost zero variation: the choices you make affect two lines of dialog at a time, only diverging at the end of the game. - Infrequent typos and sprite errors - Repetitive soundtrack - The overwrought melodrama may be tough for some to stomach.  Fans of 'ossan' characters will probably find at least one guy they love to death, but for people who aren't really 'into' older guys, the story's too insubstantial to warrant much attention.",
            "review_score": "1"
        }
    ]
}