{
    "app_id": 447170,
    "name": "Destiny's Princess: A War Story, A Love Story",
    "release_date": "2016-04-05",
    "developer": [
        "Dogenzaka Lab"
    ],
    "publisher": [
        "Dogenzaka Lab"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 16,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "Otome",
        "Visual Novel"
    ],
    "achievements": 13,
    "positive_ratings": 130,
    "negative_ratings": 36,
    "price": 11.99,
    "description": "It's a game for girls designed with a dramatic storyline with an emphasis on an intriguing plot. You can fall in love with the well-known heroes of the Warring States Period!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/447170/header.jpg?t=1478744812",
    "minimum_requirements": "OS: Windows 7 Processor: 1.8 GHz Pentium 4 Memory: 1 GB RAM DirectX: Version 9.0c Storage: 1 GB available space Additional Notes: Resolution: 1280x720",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "So what do we have? Unexpectedly spooky josei visual novel, all the characters handsome af, even naughty Nobunaga, great ost, and multiple endings.  +Rare reverse harem visual novell on steam! +All the arts are beatiful +Great OST - epic music is epic and spooky one are pretty scary +Date all the cuties .____ . +Very nice intriguing storyline - you have a lot to discover, game puts you in the middle of the story very quick, and i guess to play with all the characters and get some kisses you have to waste like 10-20 hours or something like that -No voice acting - if those boys had some cool voices it would be 11/10 VN -Doesnt work when your steam is in the offline mode. I have no idea why, maybe some engine issues, maybe anti-piracy measures.",
            "review_score": "1"
        },
        {
            "review_text": "I originally purchased Kotaro's, Masamune's and Hanbei's routes on the mobile version, but I didn't think twice when I saw this released on Steam and immediately purchased it.  The art is extremely beautiful, although I'm sad there is no e-mote system. The music is okay. The writing and localization, for what originally was a mobile otome, are really good. The translation flows really well and is very modern ('okay', 'jeez') which is a good thing. Like all Forbidden Romance games, the writing can get a little steamy (bonus points). The interactions among the characters were well done and the hints to solve the bigger mystery spread throughout the various routes, although only in Nobunaga's we can see resolutions. Be warned, all the routes have two endings, one in which the guy stays in the Princess' world, one in which the Princess goes into the guy's world. Not all the characters have happy endings. Some are just doomed. As MC, the Princess isn't half bad. Really depends on the route and the ending. She could have been worse for an otoge MC. Also, she has eyes in the CGs, which is a HUGE bonus :)  Now, let's talk about men :&gt; and trigger warnings. My suggestions regarding route orders are as follow: Masamune = Yukimura &gt; Kotaro = Hanbei &gt; Nobunaga; the first two routes focus heavily on romance and less on plot, order can be switched up. The second two routes give more hints regarding the bigger picture, again order is up to preference. Nobunaga's route has all the answers and as the game tell you, is very spoiler heavy. - I really liked Masamune's route. He's a very cute guy and a genuine good person. He's also very respectful of the Princess' wishes, and his narrative is a take on the 'different social classes' trope. One of my favorites. - Yukimura's route dealt with 'incest'. Of course, Yukimura is not the real twin brother of the Princess, but he is convinced he is for 95% of the time and still rolls with it. Incest is not my thing so it made me slightly uncomfortable. - Kotaro's route was extremely refreshing because he appears so mischievous and carefree, but of course he's not, being a ninja and all. They had many sweet, sweet moments together. Should probably warn for one of his ending, in which he's 'so caught with passion that he has to satiate his lust RIGHT NOW', which personally makes me eyeroll every time. The other ending was cute tho. - Hanbei's route should have a big warnig for ♥♥♥♥ and abuse. Which kinda gets brushed off in the end by the Princess. Otoge MCs... nevertheless, I did enjoy his route. - Now, Nobunaga. Ooh boy. Where to start. The man is a pig and acts sleazy despite the fact that everybody around you sees him as your father. Also the writing seems to push you to like him. Uhm not really. I did enjoy the spoilers (some were pretty OMG WTF and made so much sense) and the endings were wicked good. But as I stated early, incest and play-pretend incest are squicky to me so I was uncomfortable playing his route. Also ♥♥♥♥ warning.  In conclusion, it's a solid port of a good mobile otome. The price is amazing considering it has all the main scenarions, all the sequels and the date scenarios. Does it have flaws? Certainly. I still found it an enjoyable read. Recommended :)",
            "review_score": "1"
        },
        {
            "review_text": "Rating- 4/5  Very deep, and intriguing story lines for each character. Art's pretty good too, but I feel like the visual novel as a whole is lacking scenery, in comparison to Blood Code. I have no other to compare at this point in time. Also, voice's would have been a nice touch, but I guess a good VN can't have everything.",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed this one. The guys were nice to look at, the story was interesting, and the music was good. There are a few translation issues, but not too bad. Just a warning... not all endings are happy, but that doesn't mean they are bad. I needed tissues for a few...",
            "review_score": "1"
        },
        {
            "review_text": "So before I bought the game I read the reviews here on Steam. Most of them were good and a few of them were bad... I should've listened to them... I've played quite a few otome games such as Code Realize, Dandelion, and Amnesia, which were all amazing games I actually bawled my eyes out. This game, however, did not make me feel anything at all.  WARNING POSSIBLE SPOILERS   There are like 10 endings and I played it all and unlocked all the pictures.. There were so little so it wasn't hard (which was one of the things that bothered me) The gallery was just filled with the same picture but just them closing their eyes or smiling (it was horrible and honestly this should've been a mobile game). It took me like 2-3 hours to finish each guy's story (both endings) which is super short. There were a few guys (won't mention who) that had died or got injured or whatever... I did not shed a single tear and the only thought that came to me was... idfc... It was a chore to play through it... As mentioned before in previous posts, there are a few scenes of sexual harrassment, but that didn't really bother me as much because I've played Diabolik Lovers *shudders* (never again). So if you're not into that, definitely don't buy it. What REALLY bothered me is the lack of details. They didn't answer my questions I had through out the game and it really aggravates me! And WTF was that ending??? Nobunga's story... I have no words... All I can say is that it made me cringe SO bad.  So in conclusion, if you're immune to cringey sh*t, knock yourself out. The art was still lovely though, I'll admit that... Lack of content, little details... all for 15 bucks... it's up to you guys to figure out if it's worth your money, but I should've expected much from a cheap game.",
            "review_score": "-1"
        }
    ]
}