{
    "app_id": 447200,
    "name": "The Men of Yoshiwara: Ohgiya",
    "release_date": "2016-04-19",
    "developer": [
        "Dogenzaka Lab"
    ],
    "publisher": [
        "Dogenzaka Lab"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 16,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "Otome",
        "Visual Novel"
    ],
    "achievements": 13,
    "positive_ratings": 102,
    "negative_ratings": 13,
    "price": 11.99,
    "description": "&quot;The Men of Yoshiwara: Ohgiya&quot; is a romance game for women, with the famous Yoshiwara pleasure districts as the setting -- but with the roles of men and women reversed!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/447200/header.jpg?t=1478745325",
    "minimum_requirements": "OS: Windows 7 Processor: 1.8 GHz Pentium 4 Memory: 1 GB RAM DirectX: Version 9.0c Storage: 1 GB available space Additional Notes: Resolution: 1280x720",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": " The Men of Yoshiwara: Ohigya  takes place in the same universe as the previous game in the series,  Kikuya , but it is not necessary to play the first game in order to enjoy the second one. It mainly uses the same concept: an island where women are in charge and take care of the businesses and economy, and the men mainly populate the pleasure district of Yoshiwara, where they work as courtesans.  You are the heir to the rich and respected Somei family, with a famous fabric and clothing shop. You are being sent to Yoshiwara by your mother specifically for the purpose of becoming with child to continue your family line. There are five courtesans you can choose from, from young and innocent to arrogant and famous, and from passionate and flirty to stern and mysterious... Which gentleman of the night will sweep you off your feet?    The Good ",
            "review_score": "1"
        },
        {
            "review_text": "Like kikuya, with some improvements, but lacking in content and uniqueness. A fun game, 7/10 overall.  What I liked: Variety of character types More assertive protagonist (compared to most of their games) Lovely art  Beautiful BGM  What I disliked: Inconsistent music loops  Short routes and lack of depth  This game takes place on the same island as The Men of Yoshiwara: Kikuya. Ohgiya is a competing brothel. Characters from the previous game make brief appearances, but not enough to further any storylines from the previous game.   I was not drawn to any of the characters at first. The art style is different (I prefer the character designs in Kikuya), which could be why. I also prefered the backgrounds in Kikuya as well. I thought the music in Ohgiya was more appealing though. Unfortunately, the music still pauses awkwardly, just like the other games.   What really shined for me in this one was the protagonist. It can be frustrating to play a character that behaves passively. The lead is much more assertive and straight forward than a lot of the ones I'm used to in these kinds of games, which I found refreshing.  Sadly, I had a hard time connecting to most of the characters and their storylines in this game. There were too many parallels to Kikuya's characters. I felt like the routes lacked depth, likely due to them having fewer chapters. I also found that even though I liked a character's personality, their storyline was lacking. My favorites in this game were Gakuto and Takigawa.  I likely won't be going back to this game too often. Though, it was a nice treat to have after finishing Kikuya! I still thought it was very enjoyable and aesthetically pleasing.",
            "review_score": "1"
        },
        {
            "review_text": "  WARNING: Long review, not spoiler-free.",
            "review_score": "1"
        },
        {
            "review_text": "This game was not as good as the first Men of Yoshiwara, but it is still better than most of their other games. Art is good (as usual) and the music fits the period and mood of the story. I still feel this developer needs to proof-read their visual novels much better before releasing them on steam, and they could do with a better editor, but I did find the game enjoyable enough to play.",
            "review_score": "1"
        },
        {
            "review_text": " TL;DR:  If you're not sure whether to get this one or the original Men of Yoshiwara (Kikyua), you'd probably be happier with Kikuya. There is less content in this version and I agree with those who've said they didn't like it as much as the first. It also still has the poor translation/editing quality that plagued the first. That said, it might be worth picking up on sale.  ---   Overall Impression:  Again, it is originally a mobile otome game, ported to PC. The quality level mobile otome needs to have to be accepted is much lower - and this game is not especially well edited, with typos everywhere. The romances didn't live up to the first game's romances (with the exception of one guy, whose story was the best in the series, imho) - but the heroine is much more awesome than the first. I'll be comparing this game to the first game in the series a lot, so be prepared.   Content:  As with Kikuya, the content rating is approximately 'R-18'. The images hover at around the PG-13 level at the most spicy, but the language can get pretty direct. If you prefer reading 'sweet romances' with closed door sex/no sex, you will not be happy with this story as sex (as brief as it is) is certainly 'open door'. As for other content concerns, I didn't find it as 'objectionable' as the first, but will instead give a blanket warning that this is a game written for Japanese sensibilities with an R-18 content level, set in a fictional historical past. In short - if you're not prepared to be at least a little put-off/offended by cultural differences, you'd better just move on because there might be something here that will upset you.   Translation : The translation quality itself is not too bad. There was very little that made me stumble in terms of understanding the story/what people were implying with what they said. Unfortunately...   Editing : The editing was, as before with Kikuya, pretty terrible. It's not as embarrassing as I found Kikuya's text to be, but there were still lots of typos, missing words/parts of sentences, missing punctuation, confused words (in the vein of their/there); etc.    Art : It's sort of a mixed bag, as before. Unfortunately for this game, it appears they cut even more corners. There are fewer unique poses/costume changes for each character, fewer side characters who get sprites (I think there were none, actually, aside from the servant), recycled backgrounds from the first game (which is fine since it takes place in many of the same places more or less simultaniously with the first game), and really sloppy CGs in places. (I was fascinated in a way with seeing stray lines in areas the composition of the image actually drew attention to. I assume the deadline was very close for it to have been left as-is.) Without double-checking, I think there were fewer CGs for each route too. Those complaints aside, the art was still nice.   Character Design : I think I overall preferred the character design from this game to the first. The characters were fairly distinct from each other, and even the characters that were in similar roles/positions to the characters in the first game looked distinct from each other. (That said - they do overlap quite a bit.)   Story : I draw attention yet again that this is an mobile otome port. The standards between an otome for PC/console and an otome for mobile are vastly different. The writing is 'choppier' and shorter, meant to be consumed while waiting in line or riding the train or something - so each chapter is quite short and there's no real luxury of a slow boil. Even in the best storyline the game offers (IMHO, anyway), the story proceeds quickly and character development can take a sudden and surprising leap. You have to keep this in mind when judging the work (as you wouldn't really compare a short story to a novel either).  Each hero's arc in this game explores the concept of the series premise and how it can bring trouble to not only the man in question, but any woman who might fall in love with a courtesan from Yoshiwara. For better or worse, it's extremely easy to get the 'best' ending with each hero, so you're probably more likely to have to take the trouble figuring out how to get the mere 'good' ending instead.   I personally didn't find any of the heroes of Ohgiya, bar one, to match up to the heroes in Kikuya. I actually would consider myself very indifferent to most of the storylines and it took me awhile to pick up the game to finish it. For me, Asagiri's (the pretty blond guy who wears pink and purple and smells nice) did, however, make the entire game for me. I'm very glad I left him until last. I might find his route to be the most interesting in the series - but perhaps that is  because  I had played all the other routes in the series before his and understood the heartbreak of Yoshiwara so well. I can't actually pick out any route in this game as 'bad', but I didn't enjoy them as much.    The Heroine : Unlike Kikuya's 'good-hearted idiot', this heroine might be shy and obedient, but is overall quite sensible and has backbone. I rather liked her and found her situation of coming to Yoshiwara to conceive an heir for the family business to be more palpable than Kikuya's more awkward situation.    In closing...  Ohgiya is probably not going to knock your socks off, but if you wanted to experience more in the world of Yoshiwara, I can certainly recommend it for Asagiri's route alone. (Though I'd personally say to play him last.) I would suggest you try to pick it up on sale, however, to avoid disappointment.",
            "review_score": "1"
        }
    ]
}