{
    "app_id": 447530,
    "name": "VA-11 Hall-A: Cyberpunk Bartender Action",
    "release_date": "2016-06-21",
    "developer": [
        "Sukeban Games"
    ],
    "publisher": [
        "Ysbryd Games",
        "AGM PLAYISM"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Cyberpunk",
        "Visual Novel",
        "Great Soundtrack"
    ],
    "achievements": 34,
    "positive_ratings": 12348,
    "negative_ratings": 294,
    "price": 10.99,
    "description": "VA-11 HALL-A: Cyberpunk Bartender Action is a booze em' up about waifus, technology, and post-dystopia life.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/447530/header.jpg?t=1531065982",
    "minimum_requirements": "OS: Windows 7/8/10 Processor: 1.6 Ghz Memory: 1 GB RAM Graphics: 256mb Storage: 250 MB available space",
    "recommended_requirements": "OS: Windows 7/8/10 Processor: 2 Ghz Memory: 2 GB RAM Graphics: 1gb Storage: 250 MB available space",
    "reviews": [
        {
            "review_text": "You, yes you, the person that is reading the reviews. I envy you because i can't play this game again for the first time.  Scroll back up, buy the game, get a drink and take a seat.  Enjoy you waifus, music, sex stories, and reflection on your own life at 2am moments. Don't mind the alpacas. ",
            "review_score": "1"
        },
        {
            "review_text": "VA-11 Hall-A is an incredibly comfy storytelling experience about a compelling cyberpunk world, with some fantastic aesthetics and music.  Even if you're not normally into visual novels (and weeb stuff in general), don't let that alienate you. Everything Valhalla does is wonderfully self-aware, and the writing is mostly clever, smoothly-flowing banter, with some insightful nuggets of wisdom strewn around.",
            "review_score": "1"
        },
        {
            "review_text": " It's time to mix drinks and change lives.",
            "review_score": "1"
        },
        {
            "review_text": "I'm going to marry Dorothy!    pls buy this game to help the developer move out of venezuela  ",
            "review_score": "1"
        },
        {
            "review_text": "Okay, I'm taking time out of my day to recommend this to as many people as humanly possible. Not because the creators are in dire need of money to escape the hellhole that is Venezuela, but to point out how fantastically crafted this game actually is.  Every single element of this product sets the bar at what it sets out to do which includes, but is not limited to, atmosphere, dialogue, soundtrack, character development, story, and world building. You would personally be doing yourself a disservice passing this gem up and I heavily implore that you do not do so.  10/10 satisfied my cyberpunk boner among other things",
            "review_score": "1"
        },
        {
            "review_text": "The following three things are true:   1. I spent 14 hours on a game that is *mostly* about scrolling text and taking in a story. 2. I found myself really sad when I knew it was almost over, I wanted so much more. 3. I had no idea I spent 14 hours on it until I checked and my jaw dropped.  In other words, VA-11 Hall-A comes as highly recommended from yours truly. If that's good enough, feel free to go in sight-unseen. *Definitely* don't be shy if you see it on sale in future, but it's well worth its asking price already. Read on for my input proper.  First of all, VA-11 Hall-A is the first 'mature' game I've played where 'mature' does not mean 'an almost childishly gleeful embrace of all that is violent or taboo'. I mean it's a story about actual grown-ups dealing with grown-up things. Don't let the anime aesthetic or talk of 'waifus' throw you off; this is a story that won't talk down to you, or make you feel like you have to put something of yourself away in order to be able to enjoy. Don't get me wrong; VA-11 Hall-A *loves* occasionally indulging raunchy humor and it absolutely bulldozes straight through certain sex taboos to a degree almost comparable to Panty &amp; Stocking with Garterbelt. But there's a sincerity to it and the humor doesn't overstay its welcome.   I strongly recommend playing it one day at a time. That is, play one game day per one real day. It feels like over the course of a month, I came to know these characters like they're real people. Real people with real issues and whose blossoming emotional maturity might even rub off a bit on you. I walked away feeling like I became just a bit better of a person.   Finally, VA-11 Hall-A is the first 'cyberpunk' story scene I've seen in a very, *very* long time which doesn't overuse its own setting, or force the story to support the setting instead of vice-versa. If you're hoping for some Deus Ex-ish high tale about how the world changed because of one humble bartender, you're going to be sorely disappointed. Again, see above; it's a somewhat realistic story about real-feeling people.  In this way though, I feel like its expression of common dystopia elements are more sincere as a result. Social inequity isn't treated as some cartoonishly over-the-top thing, nor one that can be simply 'solved' with carefully applied stealth and violence like in... well, a video game. It's a thing that hangs over all of life's proceedings and people have to do their best to navigate around it. Glitch City, while a nasty and dangerous place, is portrayed as a unique, beautiful and potential-filled place as well. This is much closer to how such environments are in real life.  On a closing note VA-11 Hall-A takes bold strokes on several progressive issues, but never, *ever* rams them down your throat with awkwardly placed exposition or tokenism. Some of those issues are very close to my heart, so I felt a lot less alone after playing. Not only did I feel like I was heard, but like my feelings were understood.   Very strongly recommended, even if you're not much into VNs. Gameplay-wise, it's almost like a completely stress-free dialogue-oriented Papers Please.",
            "review_score": "1"
        },
        {
            "review_text": "What'll it be?  Something retro, with a gut punch of feels and a killer aesthetic, with the face of your waifu plastered on the side?  Something to keep you warm on the rainy days, as the more reckless streaks of life pass on by?  Something to make you smile and laugh on the inside, to remind you you're still alive?   One Vallhalla, coming right up.",
            "review_score": "1"
        },
        {
            "review_text": "Maybe one of the best games I've ever played. Although, I use the term 'Game' a little lightly with this one. More of a well written, comedic, unbelievably enjoyable visual novel being held together with funky music and flawless pixelated graphics. Nothing warms my heart more than seeing the Cyberpunk genre being brought to life by plucky and loveable characters, and bizarre alcohol.  Less of a game, more of an experience. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Ghost in the Shell that we actually deserve.",
            "review_score": "1"
        },
        {
            "review_text": "i can't afford this many dakimakuras",
            "review_score": "1"
        },
        {
            "review_text": "This game is hard to describe. It's for a niche audience for sure. But if you like story driven games, get this. Just please. Get it.",
            "review_score": "1"
        },
        {
            "review_text": "Such an amazing, hilarious and charming visual novel/papers please-ish hybrid game that is so well written it makes me have to undust this review feature and write some good words about it.",
            "review_score": "1"
        },
        {
            "review_text": "I don't even know. The writing sounds like someone is channelling the misanthropy of five generations worth of Internets in your face with a heaping helping of everyone involved fornicating with everything that moves. In anime-format, no less, good god.  This game's writing is absolutely trashy to the extreme.  And I  love  it. Jump into the can today - only $99.99! Prudes can't afford that premium anyway!",
            "review_score": "1"
        },
        {
            "review_text": "For literally no reason they add a dog with shades and a Hawaiin shirt besides the fact he's rad af.  They really loved the game they were making and chances are you will too.  See you on /U",
            "review_score": "1"
        },
        {
            "review_text": "I'm not a huge VN fan.   Fortunately, VA-11 Hall-A gets away from most of what dislike about VNs.  - Atmosphere is conveyed through the art, not with narration. Text is almost exclusively dialogue, and the exceptions are things like in-setting newpaper articles. - Story is not driven by romance. It contains some, but is more about characters' relationships with one another than the center of the story. - Characters are nearly all adults. Not all of them terribly mature. - Though gameplay mechanics are few, they are well executed. You will not serve the wrong drink because you clicked on the wrong thing, only because you chose to serve the wrong drink. - You pick the music; it does not pick you.  The cyberpunk bar setting is fun, the characters are unique and colorful, and while the central story is a tad weak and suffers from hit-and-miss writing, the overall effect of the dialogue makes for an enjoyable experience. As a relatively fast reader, it took me about 6 hours to run through the game once, seeing the good ending and most of the optional endings. Could probably 100% it inside two more hours, if that was something I cared about.  A side note: Author has some fairly transparent biases, but does a relatively good job at making them secodary to the story. A very pleasant change from the rather sloppy and overt hackjobs one sees in indie and even AAA games all too often.",
            "review_score": "1"
        },
        {
            "review_text": "The developers live in Venezuela. Consider buying this game as a donation for a group of people living in a hellhole.",
            "review_score": "1"
        },
        {
            "review_text": "Its a fantastic game with booze, cyberpunk shenanigans and high class waifu material. What more could you possibly want?  On a serious note, the game is great. Saying that, it's less a game and more along the lines of a Visual Novel, with a cool little drink-making minigame through in. The characters are definitely the strong suit of this game though, I've played a fair amount of it so far and am yet to find even a single character I don't find interesting or that I dislike, and it's not as though there aren't quite a few of them. The music is great although a lot of the tracks do sound very samey which is a little disappointing, but it definitely fits the mood.  And finally:  JILL BEST GIRL ",
            "review_score": "1"
        },
        {
            "review_text": "This is very good story game. Must play with a drink of your own and in a dark room for 100% immersion. 9/10 Will bar tend again.",
            "review_score": "1"
        },
        {
            "review_text": "  One of my favourite games of the year so far. It's crazy to think that the writing in this game was by non-native English speakers. It is phenomenal. The music score is stellar. The entire game is a cocktail of myriad references and head nods to anime, movies, American TV, pop culture, and more. The dialogue is twisted and gets deep. I couldn't put it down.",
            "review_score": "1"
        },
        {
            "review_text": "Just completed my first play through and I can say for sure there will be another. I feel a familiar sadness (usually reserved for the completion of a good book) in knowing that I have reached the end of what was a great story with some of the most likeable characters I've seen in a long time. Do yourself a favor, buy it and go in blind. You won't regret your time in the comfy little bar known as Valhalla.",
            "review_score": "1"
        },
        {
            "review_text": "I cant say too much about it without spoiling parts of it, but its about 10 hours of really well written, detailed story with the occasional bit of gameplay (which is fine). 98% positive reviews for good reason  A visual novel with brilliant writing and a little more gameplay than usual, apparently has 7? different endings. Interesting characters and more 'normal' endings than most VNs. It's up there with Muv-Luv, perhaps surpassing it in some ways.  Normal first time playthrough is 9-10 hours. NG+ exists",
            "review_score": "1"
        },
        {
            "review_text": "VA-11 Hall-A (Valhalla) is a mix between a visual novel and an extremely simplified Papers, Please. You play as Jill, the bartender of the bar Valhalla, and your goal is to mix drinks and change lives.  The game tells its story through conversations with the clients you serve. Each character has their own interesting personalities, and equally interesting stories to tell. It doesn't provide any options for what you can say to your clients, but it does frequently allow you to choose a drink for them if they cannot decide on a specific drink. This allows you to get them drunk and - naturally, change the outcome of the conversation. If you so desire, you can even serve them the wrong drink, although this will affect you either sooner or later.  The drink mixing gameplay is fairly basic and can get rather repetetive, but that doesn't matter a huge amount if you're one who appreciates story over actual gameplay (although if you appreciate gameplay over story, why are you even looking at a visual novel?)  I wish not to spoil the story, but I will tell you that there are 6 endings you can get.  I can really recommend this game at full price (hell, the fact that I'm writing a review for it says something). I suggest you scroll up and buy it if visual novels and very enjoyable characters are your jam.  It's time to mix drinks and change lives.  I really, really wish the game had trading cards, though. I'd totally buy my way up to a level 5 badge.  Stella is the best character and that is a fact. (Jill and Dana are also great though)",
            "review_score": "1"
        },
        {
            "review_text": "So good that I can't finish it because then I would be forced to replay it again to enjoy it, but I hate replaying games.  Someone end my suffering.",
            "review_score": "1"
        },
        {
            "review_text": "This game looks so simple but it's so captivating. Besides the fact that they really nailed this pixel-art cyberpunk aestethic and sound ambience, it's really interesting to watch a hole story in a city develop while you're just sitting behind a counter serving drinks and talking to people or sitting at home reading danger/u. I really love this game, everything about it captivated me. Can't wait to see more from Sukeban Games.",
            "review_score": "1"
        },
        {
            "review_text": "This is best experienced with as little to no spoilers as possible. You would be doing yourself a disservice otherwise, just like a lot of games really. There’s a demo in the Sukeban Games website, it’s worth checking that out first if you are umming and ahhhing if the game takes your fancy. It gives you a very fair sample of what to expect, you’ll get to play away with the simple drink making mechanics, learn about the world of 207x and meet some of the regulars from the main game.   Now, I’m a massive sucker for Cyberpunk stuff. And this game has got me into a real thrust for more Cyberpunk. Now usually, in these cyberpunk games, it will have you being the big damn hero, saving the world from some mad conspiracy or some nonsense like that. But this? Not so much, if at all. You’re just a regular person in the end of the day, surviving what each day throws at you in this mad-tastic world through the eyes of a regular Bartender. Interesting stuff, and a massive change of pace from what i and others are used to.  This game contains some beautiful sprite work, a large cast of likable characters, all living through the ups and downs of being a part of dystopian future society and a stokin’ soundtrack that is just worth a listen in its own right, so go do that now if you haven’t already. The world building is rather well done to, this whole thing is just labour of love and you can see that from the very moment you press start. And if the developers enjoyed making it, then you’re going to enjoy playing it.  Some serious respect to the guys at Sukeban Games is due here. Pints are most well deserved.   If this just interests you, just ♥♥♥♥in' play it. ",
            "review_score": "1"
        },
        {
            "review_text": "I've been intrigued by VA-11 Hall-A since I first saw an article published by Siliconera and it got me curious. I was surprised to see this title just magically popped up on Steam and I got excited. The hype was immediately quenched by a simplistic, though fun mixing interface, combined with the challenge of not only making the drink correctly but also the challenge of remembering key details regarding regulars' 'the usual' and the like.  The characters, dialogue, tone, and general atmosphere shine like the developers not only truly grasped what makes the cyberpunk genre so enjoyable, but also with such a fine understanding of great dialogue and chemistry. Each character has their own wonderful backstory and personality that strikes a sense of curiosity in me. I want to know more about these characters, their lives, their history, and I love to be around them. Even the main character begins to flesh herself out which is remarkable.  I was also ecstatic at every sly reference to other cyberpunk/sci-fi wonders like Armitage and Bubblegum Crisis. It's nice to see other people taking such an interest in a genre that sadly goes rather underappreciated. VA-11 Hall-A does not refrain from addressing not only key social problems that exist within our own timeline, but addresses themes like self-pity, self-discovery, bonding, and even sexuality with some character's preferences being left ambiguous or hinted at. It's never thrown out at you or explained to it, it's part of a conversation and truly feels like a genuine one, at that.  Combine all of this with VA-11 Hall-A's incredibly detailed art that truly allows each character to not only be differentiated, but stand on their own in a unique way. You immediately recognize every character, remembering what you talked about last, and the game even encourages you to keep a keen eye on past conversations. Stella definitely stands out as one of my favorite characters in terms of design.  Major kudos out to the folks at Sukeban Games and thanks also to Ysbyrd for publishing this masterpiece. 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "Va11-Hall-a: Cyberpunk Bartender Action. Yeah. This is a bartender simulator. And boy does it simulate something.  -------------------------------PROS------------------------------------  -Dialogue. Bingo, this is the stuff. Some great story telling and it makes this feel like I'm talking to the kind of people who would really visit a hell-hole like Va11-Hall-a. All dialogue is done between either making drinks for your clientele or taking a smoke break.  -Characters. Also bingo, due to the sheer level of awesome characters. Funny hooker-bot who isn't just proud of her job, she let's everyone know about it. Aggressive lesbian girl and her meek robotic-friend. Chauvinistic journalist who orders nothing but pitchers of beer. Even your boss is awesome.  -Music. Easy one to describe, it's good. Listen, and choose which songs play while you work.  -Story. The main character, Jill, has an interesting story, along with others such as Ingram, Stella, and Sei. I think they all bring an interesting tale into the story.  -Environment. A nice cyberpunk backstory creates a nice feeling of being in a new time that has fully humanized robots and talking vending machines that just love 1980's R&amp;B.  -Difficulty. It's not hard. Which is a good idea seeing as the story relies heavily upon your ability to get people drunk or to get them the drink they need to cheer them up.  -------------------------------CONS------------------------------------  -Endings. I thought the lack of more choices kind of hurt the game. I'd like to see how it could have gone downhill harder. And yeah, I don't count being homeless that bad of an ending considering your boss will probably help your sorry ♥♥♥ out.  -Dosing. I thought the idea of being able to dose clients with extra Karmotrine (alcohol) to get them smashed faster was a great idea, but it feels like it has very limited use here.  ---TLDR--- It's a great little game that ads a fun atmosphere to enjoy. I'd love to see a sequel. DON'T buy this on sale, it is definitely worth the price.",
            "review_score": "1"
        },
        {
            "review_text": "An amazingly well crafted love letter to the visual novels on the PC-98. Incredible visuals, sounds, and a story that hit close to home for me.  10/10 Waifu Simulator. Would Waifu Bartend Again.",
            "review_score": "1"
        },
        {
            "review_text": "Comfiest game of the year by far, unf.",
            "review_score": "1"
        },
        {
            "review_text": "I need an OST for this game, stat!!!",
            "review_score": "1"
        },
        {
            "review_text": "My roommates told me I was making a mistake when I saw this at PAX and proclaimed 'Imma buy this' without much more htought. Yet it didn't take an hour before Valhalla captured their attention and had them in my room watching over my shoulder.   A surprise to the many friends I've told, Valhalla IS a good game, maybe even great; It's topical, but futuristic; Forced, but appropriate; cliche, but novel. Valhalla is balanced, not going to far off in one direction to make your average internet denizen uncomfortable. Backed by great visuals and a superb original soundtrack, Valhalla is heavily driven by its narrative elements, told through bar patrons at the 'hell hole' establishment our protagonist Jill works at. It's up to the player to piece together a story, and serve up drinks to keep patrons talking. There's very little actual 'game' elements to the game, scoring even lower in actions-a-player-will-make than TellTale stories. All discussions are scripted, and mixing drinks is trivial at worst; This is Jill's story, not yours, so why should you get to make any choices on what she's going to say? None of this ultimately detracts from the experience, however: Contrary to what it may seem, a heavily scripted on-rails story game is a surprising breath of fresh air in a Steam market dominated by randomly-generated open-world survival games.   Valhalla is a perfect game to grab your favorite drink, sit down, and casually play. It's not perfect, but I've solidly enjoyed my time with it, and it's well worth the price. Valhalla is difficult to put down, and I can't wait to keep playing. Recommended to most gamers.",
            "review_score": "1"
        },
        {
            "review_text": "A visual novel game that is not shoving anime boobs in your face that actually has gameplay and believeable characters!?  Has hell frozen over?  The soundtrack is really good and fits the bartending theme well. I recommend checking that out if this isn't your type of game.  Can't wait for another one of these. Maybe N1-RV ANN-A?",
            "review_score": "1"
        },
        {
            "review_text": "It's kinda like a less sphincter-clenching Papers, Please and a less gameplay-oriented Recettear had a baby.  I didn't think I was much for VNs. Truth is, I still don't. This grabbed me somehow though. I ended up caring about the characters, even the more insufferable ones. Everyone seemed to have a bit more going onto them then they first let on, which is good characterization in my book. I mean, I installed it and seven hours later it was two in the morning and I only barely managed to convince myself that getting to sleep might be a good idea. Props for that.  It seems obvious the creator has some firsthand experience with chan culture. You can browse threads in an imageboard between shifts and what I read did a good job of capturing what a smaller-scale imageboard looks like. There's plenty of memes and references sprinkled about the game but it somehow avoids coming across as trying too hard. I have to agree with Dana that that is a really cool shiba.  I guess my only complaint was that it felt like the game ended rather abruptly and there were still loose ends in the plot. I get that being a bartender means hearing a lot of fragments of stories and not necessarily ever knowing how they resolved but it was a letdown to have all these subplots going on only for the game to go 'okay, show's over! roll credits!'. Maybe I'm missing something or I could do something different to get the different endings and then I'd get the answers I want. I guess I'll have to do that now.  So yeah, I recommend it. It was cozy. It made me laugh and made me feel gloomy and I ended up feeling close to all the crazy people in this story. Good work!",
            "review_score": "1"
        },
        {
            "review_text": "You got money lying around for a nice story and want to support awesome developers? Buy this.  You are low on money and have no money whatsoever but still want to support this? Buy it.  Just Buy it.  I'm serious.  I will find you.  And I will make you buy this.     But seriously!  10/10 Soundtrack  10/10 Story Telling  10/10 Drinking  11/10 Lewd Robots.",
            "review_score": "1"
        },
        {
            "review_text": "Basically Papers, Please + Anime + Cyberpunk Setting + Bartending + Character Focus.  Let me start off by saying that this is a very niche game. If you dislike anime and anime character designs, as well as text-heavy games, this game probably isn't for you. Also, the whole 'Waifu Bartending' thing is a joke and there's no nudity or dating in this game, by the way.   Right. Imagine your average cyberpunk dystopia. Corporations have more power than the government. Police forces struggle to maintain order. A large divide between the rich and the poor. Terrorists. Nanomachines. Augmentations.  Now imagine that instead of playing as the big hero who saves the world, you play as an average bartender in an underground bar in a ♥♥♥♥♥♥ city.  Every day, you meet a bunch of clients. You serve them what they want. You listen to their stories while kick-♥♥♥ synth songs play in the background. Many become regulars, who come day after day and change slowly over time. Some don't.  You get to understand the world from the stories of others, which invites the Papers, Please comparison, and I'd say it's a pretty accurate one.  Pretty much every character is well-written, interesting, sympathetic, engaging, and I really cared for them. The game never takes itself seriously, but knows when to slow down, chin up, and deliver some heartwarming moments. Yes, I am not ashamed to say that one particular scene in the second act made me tear up a bit.  Overall, Valhalla is very much a passion project, and it all feels very genuine. It was developed by two Venezuelan weebs who channeled some of their experiences living in a ♥♥♥♥♥♥ third world country into this game. It's just as long as it needs to be (although it ends quite suddenly) and has multipule endings and interactions, depending on what drinks you serve to whom and when. It's worth your 15 bucks if you're even mildly interested in it.",
            "review_score": "1"
        },
        {
            "review_text": "Nobody expected the Dorothynquisition",
            "review_score": "1"
        },
        {
            "review_text": "Never actually liked VNs. Yet this one is just fukken awesome. A little summary (can't say all of these are pros): - There's no options of what you say. You only choose the story line by mixing drinks and sometimes by other actions. - Best script I've ever played through. Each character has his own problems, everyone has a reason and fads and quirks and really feels alive. Well, I guess, that's why there're no options of what Jill (the character you play as) says - because she's another character with a personality prescribed by scriptwriters. - The setting is not so realistic in a... scientific way, but characters are really in there, they interact with the world in every way possible. - Great soundtrack. Well, the length and number of songs is not quite enough so it goes pall to ~14th ingame day. Can't give this game 20 out of 10 because of it, only 18. - Memes and puns, lots of memes and ouns, pretty much as IRL. - The game is supposed to be replayable, storylines are kinda 'GOTTA PLAY 'EM ALL', yet I can't say I'd play it more than twice anyway. Therefore, I hope devs will implement some localizations, so players will be able to open new endings in other languages.  Also, it's the first game on Steam I bought for its full price. Totally worth it.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely love this game. Definitely the type of game you want to play when you're cozy alone with a drink. I love the art. the music and the story!  I expected more gameplay at first but after a few minutes I couldn't care about gameplay anymore. Sit back, relax and enjoy the story and music. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "First of all, if you are interested in the game, go get the Demo on itch.io : Why ? Because the content of the demo isn't in the game, and it refers often to what happened in the demo, which I find quite important. It just suffer from a lack of tutorial, but now go and get it, read this review while it download. There is also a prologue if you buy the game on itch.io, but it's more dispensable than the demo and the devs plan to port it on Steam in the future.  Now the actual review,  I'll probably update it later when I'll do the other endings, which may change some of my points.   1st update : Clear my point about replayability, but haven't finishing the game again yet for other endings.   In the this game you are a bartender of the future, Jill, mixing drinks sometimes ( fairly easy ) and chat with the customers, listening to their life in a cyberpunk dystopia. Each one with their own problems, story, stuff, witnessing the impact of certain actual events in Glitch City on them. Instead of living a main plot, you are more following the daily life of many people in the city. Between each day of work you can read some news and threads to know what's going on in the city and buy some stuff so Jill avoid forgettings drinks order when preparing it the next day.   ( --- You camp jump to the bottom to see a resume Pros / Cons. )   The game has a quite enjoyable pixel art, I personnaly love it, there is also very great ideas in the staging of some stuff ( Streaming-chan's chat for example ), the storytelling is very nice and I enjoyed most of the dialogues, which are often quite funny with nice puns, but know when to get serious. The OST is nice, you choose the playlist of the day from a lot of tracks, it is just missing a shuffle button to avoid choosing yourself but there is many titles fitting very well with the cyperpunk theme, plus they are various, from joyful and party like music to more nostalgic and slow ones.   The gallery of characters is just AWESOME , they rarely fall in the stereotype their looks would give them and are quite lovely, each one with their own life and stories to tell, making them quite alive and unique. I loved Dorothy and her extrovert personality.    Plus I saw some people comparing the game with Paper Please, saying they were alike, I'd say no , they are similar in the way that you have a job to fulfill to be able to pay your bills and afford to live, but you doesn't have any of the stakes of Paper Please, no time restrictions for mixing drinks and you can make one again before serving it if you failed one, and you spend a lot more time talking with people than doing orders. It has no dilemna like Paper Please is featuring : choosing if you should let pass some people despite of their false papers.   Now, the cons of Valhalla, remember what I say about following the daily lives of people more than an actual plot ? I don't know if it's that that bothered me at the end of the game, tough It have some kind of a plot, or just the feeling of having some things unresolved and characters underrepresented. Like you see one of them just once or twice and barely know them though you'd like to know more about them !   This is something which I don't know if other endings fix this, because I haven't done them yet, specially because the game isn't very adapted to replay, even by going to the right save : You have mainly to serve a specific drink to a specific moment to get an ending, no problem there, but if you haven't a save on this day you have to replay somes from an earlier save, dialogue will be the same then you'll just skip most of it,  but you still have to be careful what you skip to don't find yourself in a situation where you don't know what drinks to do, because you must pay your bill at the end and can't afford to lose much money with wrong drinks . I started replaying it, the games features a NG+ mode where you keep the stuff you bought, meaning you don't have to buy them again to keep Jill focused, and don't have to look after money that much. Though, it's laborious to skip all these dialogues.  I saw from other reviews that the game doesn't feature many alternate dialogues then you can't really get a different story by serving different drinks.    Pros :   + Nice graphics, I love this pixel-art.  + Nice ideas of staging ( Streaming-chan's chat ! ) + Nice OST, fitting right with the cyberpunk theme and  + An awesome gallery of characters : I loved most of them, and only few fall in a stereotype, who would expect a brain in a jar to hit on girls ?  + The dialogue are well-writed and often funny, tough able to take a more serious tone sometimes.  + Very nice storytelling. + Dorothy !    Cons :   - Some characters you see only once or twice but would like to know more about them ( Makes me expecting a sequel ). -  Hard to jump on another ending once you finished the game because you have to replay some days with the sames dialogues, and can't simply skip them all because of the risk to miss people precise order.  --&gt; The NG+ mode allow you to skip without bothering about money, but it's still long.  - A bit short ? Took me 12h to finish it one time, I would expect more from a narrative game but this is a very small issue. - Low replayability because of very similar dialogues, I haven't witnessed it myself because I haven't replayed the game, but this stand out in many other reviews. It would be nice in a potential sequel to have more control over that through drinks served.  -  I haven't saw Jamie say ' I never asked for this ' once, but I'll try to give him the wrong drink to be sure, this line absolutely have to be in his script  -&gt; I tried it and he didn't say it. I'm disappointed.  - Wanted to see Rad Shiba do more cool stuff and talk more  In conclusion, I loved the game and can only recommend it, a colorful range of characters coupled with a nice story telling, made me laugh often. I'll update the review after doing other endings to see if some of my cons points still stands. Anyway I'm expecting something like a sequel to see these characters again ( Even if the end don't seem to lend itself to ), a bit longer with different outcome in dialogue based on which drinks you give.    8.333333/10, loved it despite few issues at the end !  ",
            "review_score": "1"
        },
        {
            "review_text": "I've waited months for this, and I'll be honest. I'll originally got this game for the memes. I found this game from /a/ and /v/ and thought stuff like 'Has Waifu Bartending in it, instant 10/10' and 'The creators live in Venezuela for christ sakes, we gotta get them outta there. Support this game!'  But I played the first 'two days' and I could say I'm actually really enjoying it. The atmosphere of this game is comfy and the characters are pretty interesting. I really like the music and I'm interested in the diaologue, which is unusual since I'm more into games with some action.  The gameplay is also fun- they don't just give you a easy order like a Martin- I MEAN BRANDTINI, DAMMIT! Customers usually don't give you specific requests. They usually requests what TYPE of drink they want and want you to surprise them. Gives a feeling of the gameplay being dynamic.   Don't be mistaken, there's definitely some small room of improvement. Although I love the music and I've been praised in-game for having good taste, they actually require for you to choose the music thatwill play in game. I'm too lazy for that considering there's like 11 pages to choose from. I wish there was some random music shuffle button or something instead of hand picking 12 songs based on their name. There's also no time limit to making a customer's drink. You can take like 5 mins to make some customer's Brantini (YES! I got it right!) I get this is mainly a story game and all, but I was expecting this game to be a bit more like Papers, Please. Give the game a tiny bit of challenge while still being enjoyable.  But really, those are all minor cons. I didn't even play the whole game yet. Memes aside, I'm really enjoying this game. 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "Made me want to pick up bartending in a dystopian society and become friends with a robot ♥♥♥♥♥♥♥♥♥♥. 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "Oh man, I never thought I will ever find a relaxing game. Thus why, if one was hoping for this game to have some action - this isn't the game for that said person. I have to really give props to the makers of the game for the fact that their music really sets the mood within the game and really gives out a 9O's Capcom soundtrack vibes.",
            "review_score": "1"
        },
        {
            "review_text": "It feels like a world I wanna live in, with people I wanna interact with, with a life I want to have  ♥♥♥♥ it. Take me there, just kill me already.",
            "review_score": "1"
        },
        {
            "review_text": "According to certain definitions, VA-11 Hall-A is not a 'game.' Even though you mix drinks and change lives, and often without being prompted to do so (at least the latter part of that), it will indeed resemble more of a visual novel than anything.  That said, this game has nice-looking pixel art, good music, and wonderful writing. It's absolutely worth your time and money just meet and get to know the characters. The only downside is: sequel when?",
            "review_score": "1"
        },
        {
            "review_text": "This game will make you a better person.    &gt;tfw no sukeban gf :3  ",
            "review_score": "1"
        },
        {
            "review_text": "Probably one of the best games I've ever read.   Compelling characters, some pretty amazing dialogue that goes from thought provoking to lewd humor without missing a beat, and some fun little secrets to enjoy.  Pretty amazing art, ♥♥♥♥ing awesome music.",
            "review_score": "1"
        },
        {
            "review_text": "What a wonderful little gem this is! :-) Edit: Nominated for steam game awards 2016.",
            "review_score": "1"
        },
        {
            "review_text": "If you're looking for a comfy game, then you've come to the right place.",
            "review_score": "1"
        },
        {
            "review_text": "Serving drinks to waifus. Bretty good lad. This is honestly a very good game. Plays like a VN but with a really unique style. Soundtrack and art are both amazing. Setting is Bladerunner-esque which I love. All in all solid 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "I literally just finished one playthrough of the game today and I can safely say this is an 8 hours game per playthrough.  Now the simplest way to explain what this game is, imagine if papers. please is a VN with a lot of story and some gameplay. You can imagine that? No? Well then onto the detailed explanation and review then.  Va-11 Hall-A or Valhalla, is a bartending game, with visual novel style as you can see from the screenshot above, well it could as well be considered a visual novel though. It's about a bartender - in this game you play as a bartender named Jill - mixing and serving drinks in a cyberpunk city which life there is hard and everything is expensive ($1000 dollar for discounted beers, make what you will of that). Besides mixing and serving drinks, you'll manage your income but considering everything is ridicilously expensive, you'll struggle a lot. Now this two are the main focus of the gameplay, since if you're unable to give the right order, your customer could leave you early - might not come back but haven't test this yet so do it at your own peril - and your income get cuts in result you'll have to scrap the bottom of the barrels to pay for your needs. And if you fail, you'll end up in a bad ending route and you.  I did mention that this game have a VN style, but unlike a VN, the branching story is dealt by what kind of drink(s) you serve to your client. If someone ask for some non alcoholic, you could give them alcoholic drink and see what kind of response they give to you, or if some regulars ask for something they're not usually order, you could give them something else, and watch how the events goes. As long as you pay attention, it will help you a lot in deciding what kind of drink YOU might want to give to your client.   As for the branching story, too bad the choices you make doesn't really change how the game ends, and it's kinda a shame since it was nice seeing new events transpire when you give someone a certain drinks and they come back some day later or the next day to tell what happened to them. And to top it off, the game give MGS V vibe, where it felt like when the Jill's plot is ended, it just ends without telling what happen with the other plots. It sucks, and I actually care more about the other plot than Jill's plot. True the endings in the achivement involve other characters, but that ending was more about Jill and that character rather than the character plot. Again, it sucks and just makes you - actually, me - crave for some more.  Another good point in the story is for how the character is handled, I must say I quite enjoy the characters (Betty and Deal anyone?) and how fun they interact to each other, and that's why I'm quite disappointed when the game ends after Jill's plot. Should've ended with the bar's plot but yeah that's just me. Now each character might have their own preferred drinks, and if you able to give them that, new event will happen - just like I mentioned before - and also, if you feel like pulling pranks, getting them drunk is also an option, and it will also trigger a new events. So just try giving them drink as long as it's not something weird and something they order too, or hell just give them what you want and see how they reacts.  Enough about story and events, now about the gameplay. it's a cyberpunk bartender action, what do you expect? An action game? Hell no, it a bartender action game in a cyberpunk setting, which means mixing and serving drinks is the only action you'll get, and I guess hearing your client story too. Don't expect any kind of actiony stuff happens here, best you keep that in mind. Again, I have told that the events can change based on what drinks you give to your clients, but it might be a bit hard to imagine. Now think back to papers, please, how did you change the story? By letting or detaining or rejecting a specific individual from your border, and just like that, sometimes at a specific day, you need to give a specific drink for your regulars, or some clients actually order in cryptic and based on how correct your guess is, the event can continue. Oh and also, based on the achievement, you can make a certain character appears when you give a certain character a certain drink(s). And just like how papers, please lets you handle your income, you could get a bad ending route considering how you handle it. Your income is based on how your service is and how expensive the drinks you served is, there is a flawless service bonus that I read that you need 45 sec to serve the order if you want to get. But honestly, on paper it might sound very fast, but in practice, it's too long. And the mixing and serving boils down to following the recipes, it kinda makes it very simple, but I heard if you fail to buy Jill's needs, the recipe will be altered because she's not focused and you need to read the recipe, again I haven't tested this but it's something I gather from a certain place on the internet.  Wow! Holy ♥♥♥♥! You actually read all of that? That's great! At this point you should've get a much clearer picture of what this game is, tell you what, I'll just make a tl;dr above just to annoy you who read to this point :D Nah not really, you're a great person and actually knows that you need to get as much info as you can before buying something and I congratulate you, you have the intelligence that most people seems lack nowadays.   So all in all, this is a very comfy bartending game with a VN style to tell its story and events with a simple gameplay of following the recipes. The game itself is have a nice art imo and a comfy feeling to it. If you're looking for a nice and comfy bartender game in a cyberpunk setting, look no more, if you don't really like VN or this kind of game, then don't bother, you'll not enjoy it nevertheless. You could play it several times to get some events that you couldn't get in your first playthrough, but I don't recommend playing another playthrough after finishing it, but hey, it's only a suggestion can't dictate how you shall play this game.   If you end up buying this game after reading this review, I hope you enjoy and my review did give you clear picture of what the game is!   Thanks for reading!",
            "review_score": "1"
        },
        {
            "review_text": "Rasslin. Anime. Games. It speaks to me on a deeply personal level. Relax. Serve drinks. Drink drinks while you serve drinks. Always have the bar TV on the wrestling channel. Chill out and enjoy these cyberpunk anime stories.",
            "review_score": "1"
        },
        {
            "review_text": "The core gameplay loop does get repedetive without new elements or challenges being added, but given the spectacular worldbuilding, characterization, and the general quality of writing on display here, as well as the fantastic art, this is a game I will gleefully recommend. Think of it more like a novel with light gameplay elements.   (also I may or may not need a cuddling session with Dorothy)  ",
            "review_score": "1"
        },
        {
            "review_text": "It's pretty good, the bartender was nice. She's a cute twin tails girl lol. But the place smelled like dog ♥♥♥♥ and soap when I went in there.   I like to go there after lunch.   8.4/10 Decent",
            "review_score": "1"
        },
        {
            "review_text": "Beautifully written, with a fantastic score and gorgeous presentation. VA-11 Hall-A is quite possibly my favourite game of 2016.  All the characters are unique and a joy to interact with. Jill deserves special praise for being a relatable protagonist with great characterisation.  The story can get pretty heavy at points but it never feels forced or contrived unlike most VNs. All the Drama that occurs feels natural and I found myself drawn in heavily by it.  Quite simply by the end of the game I cared about what happened to the characters involved. To get that sort of connection these days is pretty rare and I really recommend you pick this game up if you are curious at all.  Dorothy best Grill. Jill best Girl.",
            "review_score": "1"
        },
        {
            "review_text": "This game is fatastic. Great characters, the writing is overwhelmingly on point, and some of those character interactions will have you choking up.",
            "review_score": "1"
        },
        {
            "review_text": "I first discovered VA-11 Hall-A on Itch.io nearly a year ago and instantly fell in love with the free prologue. I dropped my 5 dollars to back this game and I am so happy to see it finally get its release and even come to steam. The positive reviews are pouring in and it is clear why. Unlike most story and character driven games Valhalla doesn't give you 2-4 black and white options with clear and telegraphed consequences. The story flows fluidly and is based around which drinks you choose to prepare, rather than what you choose to say (you do not control the main character, Jill's, dialogue). The characters are diverse in both personality and design and the game strikes a fantastic balance between humor and serious drama. And the new mechanics of managing Jill's personal finances and happiness are engaging and bring another level of immersion. (Also the lock screen on Jill's phone may be the cutest thing to ever grace my computer screen). Overall this is a true indie gem and I'm delighted to see the positive response it's getting on Steam.",
            "review_score": "1"
        },
        {
            "review_text": "Recommended!!!!!!!!!!!!!!  Interesting story, great characters, and even the drink mixing minigame is fun! This game will surely hook you up right from the start.",
            "review_score": "1"
        },
        {
            "review_text": "A Cyberpunk Bartending Anime Waifu Simulator... one of the best kinds of simulators.  A blind playthrough of the entire story is about 12 hours.  You play as Jill, a 27 year old nerdy bartender who lives alone with her cat Fore in the year 207X. Essentially taking place in a universe similar to Shadowrun, where megacorporations rule the government, cybernetic mercenaries run on the streets, police are more corrupt and dangerous compared to the nearby gangsters and racist corporate dogs in buisness suits come in and trash the place.  Being the bartender of VA-11 Hall-A or better known as Glitch City's Valhalla, you more or less have to listen to the woes and rambles of the bar patrons. The visual novel doesn't offer dialogue choices for the main character but the dialogue and world building given from characters can change depending on the alcohol you give them. For all of the true endings, you must know your regulars extremely well enough to know what kind of drink they may actually want when they are feeling the cyberpunk blues and become best friends with the many neon-colored haired anime customers. There is no time limit when making drinks, so there is no tension, giving a very relaxing feel and pace.  The dialogue between characters is extremely well thought out and dynamic with just about every character memorable. The game serves as a really well made world building experience. Any fans of Anime, Cyberpunk, or Visual Novels should give this Cyberpunk Bartending Action a shot, pun slightly intended.  Welp, time to incorporate this stuff into my Shadowrun campaign.",
            "review_score": "1"
        },
        {
            "review_text": "What a ♥♥♥♥ing gem this game is &lt;3 I remember seeing it so long ago as just a small announcement with like one or two images.  It came so far, and it's a small, bittersweet journey I'll never forget.",
            "review_score": "1"
        },
        {
            "review_text": "Great asthethic and soundtrack. Writing is fitting and human. Very Comfy game.",
            "review_score": "1"
        },
        {
            "review_text": "The subtle changes in dialogue depending on what kind of drink you give people is the kind of meld between gameplay and story that should be present in all games. Someone asks for a bad touch? Give them a big bad touch, see what happens. It feels very rewarding to pay attention to a character's quirks and having a decision you make change what they do.",
            "review_score": "1"
        },
        {
            "review_text": "This game is incredible.   That's the short version. You need a reason to buy it? There it is. It's truly a wonderful game.   Went into it entirely blind and had just the best time I've had with a game in a while.  50 hours and I 100 percented it, it's worth every penny I spent.",
            "review_score": "1"
        },
        {
            "review_text": "Welcome to VA-11 Hall-A. A game chock full of dank spicy memes and waifus.  But there's a bit more meat to the subject than just that. Sure, the game has a lot of memes and doesn't hide it's anime and/or weaboo influence, but deep inside the game there is much more than that.  The game fully embraces it's influences, and actually creates a believable world around it's themes. Catgirls, sex robots made to look like 12-13 year old schoolgirls... and yet they're all part of this world and believable and don't feel like fanservice throw ins. The game, in this regard, is actually surprisingly mature. To avoid spoilers let's just say that (nearly) all the characters have development and are fleshed out with actual personalities. And never do they ever feel to be in there for the sake of only humor in regards to the game world itself.  In a way, this is a game much like steins;gate in that it benefits from the player understanding many points of the japanese anime 'culture'. Speech manerisms, references to popular anime (Yoooroo Yuuree) and well, the character designs themselves can be more understood and appreciated if you understand some of the nuances. Then again, I feel like this isn't a game people who aren't into that are likely to buy, which is a shame since despite it's outward apperance, it's a great game. The writing is mature and touches on some fairly heavy subjects.  Even the length is actually surprisingly long, but the game is so relaxing that it never feels like it takes up a lot of your time. It truly is best enjoyed with some snacks and a beer to unwind while playing.  The only real bone to pick with the game would be the price. 15€ is a steep entry price, ESPECIALLY with the game being released two days before the steam sale. Yes, people who pre-ordered such as me recieved the game for 5€ which is an absolute steal, but for people who are interested and aren't willing to spend a fair amount of money, or consider 15€ to not be disposable income levels, the game comes at a very steep price indeed.   It's the only real gripe I have with it. It's not game of the year, or probably even month, but it's an enjoyable experience I recommend to anyone willing to get past the whole 'dank anime memes' image of the game. Or hell, even that alone can give you plenty of laughs thanks to the good writing (even though the script could use another proof-read). Overall, wait for a sale. For 10 of your currency, you will recieve 4 or more enjoyable evenings.",
            "review_score": "1"
        },
        {
            "review_text": "I can't really write this review without being completely biased, because it spoke to me on such a personal level. The main plotline is so similar to something that happened to me personally, that I couldn't help the raw emotion evoked from the series of dialogues, especially near the ending. Main plot aside, however, VA-11 Hall-A manages to creates unique and interesting characters with plenty of great dialogue and third-person story telling that allow you to experience several plotlines at what I can only compare to being a bartender at world's end.  Great plot, great dialogue, and amazing sound/visualizes makes this a must buy. Don't be fooled, the bartending schtick is just there for immersive purposes. Come for the waifus, stay for gripping plot and a soundtrack that will stay on your playlists for years to come.  Well then, time to mix drinks and change lives.",
            "review_score": "1"
        },
        {
            "review_text": "Note: my playtime seems lower than it is because I played it in offline mode  Really neat visual novel game from Sukeban Games. The graphics fit the setting and thye music is really good. There is a bit of a story that can be funny but also touching , The characters are quirky and it can be fun and interesting talking to them while bartending. To keep it less boring there is a minigame for mixing drinks which is pretty simple but it also feels right to do, when the music is playing it just feels good to mix drinks .  I finished my first playthrough in about 9 hours so it has a decent length, there ar emultiple endings you can get so there is some replayabilty.  Definitely recommended for fans of visual novels, games with good soundtracks and games with these kind of graphics.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing. Who would have thought a game where you play as a bartender could be so good? The music's great, the art style is awesome, and the story is equal parts intriguing, sad and gripping. It should be on your list of games to play.",
            "review_score": "1"
        },
        {
            "review_text": "What attracted me at first was the 'Overwhelmingly Postive' reviews. So I saved it on my wish list, waiting for the day I could play it.   I wish I had played it sooner.   VA-11 Hall-A: Cyberpunk Bartender Action is visual novel, but not your ordinary VN. You play as a bartender, serving drinks and talking to colorful characters that come through your bar. You have the control over getting them drunk, which is honestly one of the best things because you can change a whole situation with that mechanic.   For the record, I kept most of my clients sober. But playing it again I'll probably get everyone ♥♥♥♥-faced.   The characters are well developed and all tightly knit together and if you pay well enough attention, you'll be finding yourself saying, 'Hey wait a minute, this sounds very familiar...' There is so much detail packed into just a few words that it's almost necessary to make a second run through, because you can't see it all the first time.  The story is told extremely well, and not by just one person too which makes it so interesting and complicated. The laughs are great and the feels are tear-provoking. I found myself getting chicken-skin several times by just normal conversations that these characters had because it felt so relatable and true. I never once felt bored or felt the need to skip any dialogue because it was all so entertaining, truly.   Overall, do I recommend this game to everyone? God yes. Do yourself a favor, get this game, some snacks and sit down for a good story.  You won't regret it.  Cheers.",
            "review_score": "1"
        },
        {
            "review_text": "My top two favorite things about this game are the art style, and the dialogue (which, I suppose, are two of the most important things for a visual novel!).  I need to make time to sit down and just binge it, because I know if I start, I'm not gonna want to stop until I play it all through. Totally recommend this to anyone who loves a story-rich plot~",
            "review_score": "1"
        },
        {
            "review_text": "Played the Prologue a few years ago, then forgot about it until this was released. Met the Devs on a certain image-board and tried to help them escape Venezuala, turns out they are labelled as cultural artists and are forbidden to leave the country. The story of the game is a masterful reflection and criticism of their own homelands state, as well as a comment on the economic and social mindset of their people. Also has waifus in it  Jill is best ",
            "review_score": "1"
        },
        {
            "review_text": "Nice slice-of-life cyberpunk visual novel, in early 90's anime kinda way. Bubblegum Crisis could be happening right next door. I would recommend getting it from ithc.io instead. You'll get Steam key, FLAC OST, Prologue and DRM free version of the game for the same money.  Pro tip: learn the keyboard commands for drink mixing, the drag'n'drop interface is biggest weakness of the game.",
            "review_score": "1"
        },
        {
            "review_text": "This was a really great visual novel with incredible characters and a lot of charm.  The soundtrack was really nice but I wish there was a way to play the tracks in random order instead of having to choose them everytime.   I wouldn't recommend it if you hate/don't enjoy anime though.   I don't regret the purchase and I'll be looking forward to my next playthrough.",
            "review_score": "1"
        },
        {
            "review_text": "Similar in many ways to Papers Please, the gameplay is based on making the right drink for the right person. It is, however, much more story-driven than Papers Please and the game tells you exactly what to do, for the most part, unless you're aiming for the 'true' endings for each character. What with the great cast of characters and the sheer amount of memes involved, it's definitely worth a play.  However for some reason the 'Got all achievements' achievement unlock just before I got the last achievement, and now the game's page is ruined for me since I don't see the right achievement under 'last achievement earned'. This triggers me.   0/10",
            "review_score": "1"
        },
        {
            "review_text": "Buy it, lover it, dream about it, get hooked to it, go to desintoxication. Download it again and ♥♥♥♥♥♥ mix drinks and chage lives. oo/10",
            "review_score": "1"
        },
        {
            "review_text": "It's good.  Replayable",
            "review_score": "1"
        },
        {
            "review_text": "It is a simple game where you serve interesting people interesting drinks. A normal girl in a city, not too shabby.",
            "review_score": "1"
        },
        {
            "review_text": "A short lived masterpiece, a diamond amongst coal, truly a game you cannot relive twice, only remember the good times of playing it.",
            "review_score": "1"
        },
        {
            "review_text": "gameplays a bit lacking but its a VN so thats not the reason youre buying this tbh i dont think there was a character i disliked, all enjoyable and interesting",
            "review_score": "1"
        },
        {
            "review_text": "Weeeeeeeell.. I haven't finished it yet, and there is no neutral recommendation, so I'll give it a thumbs up for now. Since I feel so on the fence about it, I hope my review will be objective.  Without spoiling any of the story, you're a bartender in a dystopian future society. You serve drinks and listen to people's stories. You can't change the storyline very much, but that's not a problem because the story is ok.  Pros: -The 8-16bit style art is good for the genre -The story is well fleshed out with several avenues of exploring it -The characters are diverse and sufficiently consistently different -The story is pretty imaginative and interesting -The gameplay is simple for a graphic novel  Cons: -The drink making gets old and eventually seems to be a distraction more than something fun to do -The process of dragging each drink REALLY slows down the story (tip for this below) -The ticking of each letter of the dialog onto the screen is too loud and too slow. Clicking to skip it will inadvertantly and unavoidably cause you to miss a little dialog here and there -There is no way to go back to previous dialog in the event that you accidentally miss something -The story can be a little slow at times  Tips that don't spoil gameplay: -Find that sweet spot where you can position the mouse on the corner or edge of a drink ingredient and get it to automatically drag itself on the the shaker when you click. It will take a little practice, but it will speed up the drink making by a whole lot. Making drinks becomes less of a hassel. -Click once to skip the text ticking, but if you click once, read, then double click, you won't have to bother with any of that text ticking at all. If you're not a robot, you will probably screw up a little and miss a line of dialog here and there. Still, this is prefereable to making the game take hours longer to complete for no reason.  Overall: I like the graphic novel nature of the game, but it isn't really utilized well. There aren't enough settings depicted in the game (as in locations), and the gameplay gets boring after a little while. The story is good enough to keep you coming back, but at the end of the day, I'd prefer an ebook.  Buy it if you're really into this sort of thing, but know that it isn't going to be the best thing ever.",
            "review_score": "1"
        },
        {
            "review_text": "Jill is cute! Cute!!",
            "review_score": "1"
        },
        {
            "review_text": "Time to mix drinks and change lives.  And it did change my life. I don't go into visual novels often, but this is definitely something real special. It is worth every penny.",
            "review_score": "1"
        },
        {
            "review_text": "VA-11 Hall-A is like a fantastic novel, and I don't want to finish the last chapter and have to put it down. It's as much an escape for the player as it is for the patrons of the bar, and spending every night learning about the interesting and likeable characters is something I'll genuinely miss.  The game gave me a hell of an emotional Gut Punch, as the main character went through an experience very much similar to my own. The fact the game ends of a note of closure for her felt pretty much like the closure I never got. That's some really ♥♥♥♥ing powerful writing.  I love the fact that there are references for all sorts of different sub-cultures in here. Some are less subtle than others, but I've actually been reading up trying to track some of them down.  I wrote the first paragraph a few days ago on my FB, and has since completed the game. It took me 12 hours to complete this game, making it good value for money even if you're one of those 'pound per hour' folks, and I'm already on the New Game Plus.  If you've never read a book, this might not be your spiced tea; but if you've never read a book, perhaps this is a great way to start reading?  Anna, best waifu, says you should join us.",
            "review_score": "1"
        },
        {
            "review_text": "  There's something magical about how a game can blend writing, atmosphere, and music, and VA-11 HALL-A does it near flawlessly. There may be a few bumps in the road, but when you're pouring your patron a drink as she cracks a quip about hacking computer networks, there's nothing quite like it in any other video game.",
            "review_score": "1"
        },
        {
            "review_text": "[ I like it, okay? ] Fill your playlist (ALL of it) with a song you like.  (most surprised game of the year!",
            "review_score": "1"
        },
        {
            "review_text": "A simply incredible game. The mechanics are straight-forward but additively entertaining, and the characters are about as colorful as they come. One of my new favorite games, would highly recommend to anyone who appreciates a character and story-focused style.",
            "review_score": "1"
        },
        {
            "review_text": "Dorothy best girl",
            "review_score": "1"
        },
        {
            "review_text": "When you start the game, it tells you that it's best enjoyed in a kickback/relaxed manner.  It's not kidding. The game has no challenge. It's literally the antithesis to Dark Souls in terms of difficulty.  However, the game has an enjoyable story/dialogue, and the music is very well done considering it's an indie game.  I can honestly say I enjoyed virtually every second I played the game. It's short and sweet.",
            "review_score": "1"
        },
        {
            "review_text": "It's like having a Beer after work.",
            "review_score": "1"
        },
        {
            "review_text": "Every single thing I love in one experience. The characters are memorable, the soundtrack is to die for, the graphics could not be more PC98 influenced, and the overall aesthetic is mindblowing as far as how much Sukeban Games NAILED it. May this game be remembered for a long, long time. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "When you actually want to live in a dystopian cyberpunk studio apartment",
            "review_score": "1"
        },
        {
            "review_text": "I am now an alcoholic.",
            "review_score": "1"
        },
        {
            "review_text": "It's got great music, characters, and atmosphere but it gets a little memey sometimes get it",
            "review_score": "1"
        },
        {
            "review_text": "Grills are wicked cute. Writing ain't too shabby. Art's pretty cool. Music's rad as ♥♥♥♥. Ends way too abruptly. Great cyberpunk vibes. Bartending is definitely actiony.  Overall it's pretty rad. Especially with a coupla brewskis. If you're unsure about VA-11 Hall-A maybe play the demos and prologue first.  press i/10",
            "review_score": "1"
        },
        {
            "review_text": "You get to serve a non-copyright infringing Adam Jensen, if that doesn't sell you then I don't know what will.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ing amazing game! The cyberpunk vibe and OST are awesome, beaultiful pixelart and interesting dialogue make this game totally worth it, give it a try!",
            "review_score": "1"
        },
        {
            "review_text": "this is the only game that made my OverWatch account lonly now",
            "review_score": "1"
        },
        {
            "review_text": "leave it open just for jill's music player",
            "review_score": "1"
        },
        {
            "review_text": "This is a REALLY REALLY good game! I enjoyed it! The characters are interesting and diverse. The storyline is kind of linear but it's still interesting and you feel like you know the characters, the game really succeeds in making you feel like you're talking to real people. The personalities, designes, everything. Oh, and the MUSIC IS JUST.... OMG. I really liked osts in this game.",
            "review_score": "1"
        },
        {
            "review_text": "TL;DR: Teenagers suck.",
            "review_score": "1"
        },
        {
            "review_text": "Do yourself a favor and buy this game",
            "review_score": "1"
        },
        {
            "review_text": "Lesbian bartending story.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "do you like to mix some drink do you like great soundtrack and do you like a good as hell story ? then buy this game already",
            "review_score": "1"
        },
        {
            "review_text": "I actually spent my animu time playing weeb games like these. and actually enjoyed it. nuff said.",
            "review_score": "1"
        },
        {
            "review_text": "it's like papers please but with future space booze   i've said enough",
            "review_score": "1"
        },
        {
            "review_text": "Its really nice, very comfy game to just sit back, have a drink and have a bit of a chuckle at Amazing Pixel art, characters are likeable, ♥♥♥♥ING 10/10 SOUNDTRACK Also /v/",
            "review_score": "1"
        },
        {
            "review_text": "i bless this game",
            "review_score": "1"
        },
        {
            "review_text": "One of the best story I ever played with one of the best sound track I ever heard.",
            "review_score": "1"
        },
        {
            "review_text": "With all the anime girls, memes and sex jokes it's very easy to see why someone would be turned off from VA-11 Hall-A at a glance. However, if you don't mind some pandering and a light main story you'll find a VN that's definitely worth your time. By the end of my playthrough I was invested in Glitch City and the quirky characters living within it.",
            "review_score": "1"
        },
        {
            "review_text": "I really like this game, but don't understand why.  The graphics are pretty cool, the music is good, the gameplay is alright, the writing is mediocre, BUT VERY grabbing.  There is just something really special about this game, and I am glad I bought it.  If you ever wanted to be a bartender and listen to people's stories, this game is for you.  The characters feel real which is awesome.   10/10 ",
            "review_score": "1"
        },
        {
            "review_text": "Time to mix drinks and change lives! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "great OST, fun dialogues, cute waifus.   Jill best girl.",
            "review_score": "1"
        },
        {
            "review_text": "the music right off the bat is fantastic and the characters are unique and i'm pleased with everything about this game so far.",
            "review_score": "1"
        },
        {
            "review_text": "two words: waifu bartending buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "Best waifus seen for a while  Also cool drink-mixing minigame, too.",
            "review_score": "1"
        },
        {
            "review_text": "This game is the best for finding your waifu.",
            "review_score": "1"
        },
        {
            "review_text": "The presentation is fairly nice, even though I'm not a massive fan of the anime aestethics.  The tutorial is blasted at you with everything the game seemingly has to offer with a massive info dump which fails to give it a nice difficulty curve as you'll get a special order right from the get-go. In this respect, it might be good that the gameplay is pretty simple. Read the recipe, follow it and repeat.  Mechanics do take a backseat though, which is where the game will divide people. The story seems to be key here and you have to click through massive amounts of dialogue for each patron. They all seem to have their own troubles and they go on for ages between orders.  If you find the characters remotely interesting you might like the game, but I can't say I'm sold on the writing or the humor, which is very on the nose and lack a punch. Throwing words like 'rapists', 'sex tourist' and other edgy things into the dialogue won't really spice things up, especially when you're told what to think about every character by the protagonist -- leaving very little for the player to interpret.  There is a cool idea here though. If you'd have to shut down customers in order to get more orders and get to choose which customer you'd interact with for longer periods of time, this would be an interesting take on the visual novel genre.  If things take off I'll update the review, but as things stand I'm having a hard time recommending this one.",
            "review_score": "-1"
        },
        {
            "review_text": "I really wanted to like VA-11 Hall-A.  It is most definately a step in the right direction from Random Access Memories, however, I don't think it goes far enough in fixing the issues in storytelling that RAM had. The characters still feel rather two dimensional. It also can't go more than twenty minutes without trying to remind you that the devs also made this other game called 'Random Access Memories, and you should totally play it lolz!1'  The pacing is inconsistent, and sometimes I feel that the story is coming along too slow, while other times it feels like they aren't really progressing it enough. What is there is just so cliche and trite that I just had to put the game down after a while of playing it.  That said, this is far from the worst game I've ever played. The art style works rather well, the music helps bring along that cyberpunk feel, and more than once there was a moment where I saw that there was the potential for a great game hiding amongst the writing, with a few characters acting like normal people every now and then.",
            "review_score": "-1"
        },
        {
            "review_text": "I feel cheated.  Reading some reviews and looking at the game gave me a really positive feeling! I Bought it, started it, and played it for only 10 minutes and decided to refund it...  &gt; There is no good explanation on how it works &gt; When trying to mix the first cocktail, it didnt work and didnt provide any good explanation ",
            "review_score": "-1"
        },
        {
            "review_text": "Great game for one to sit and chill.  Love the steampunk, love the music, and love the character design.  Oh, and of course waifus of course.  P.S.:dumb dialogues do pop up a few times, but it doesn't ruin this game",
            "review_score": "1"
        },
        {
            "review_text": "its time to mix drinks and change lives",
            "review_score": "1"
        },
        {
            "review_text": "It was quite the experience. It has a nice story about the main character but it mostly is about being a bartender listening to other peoples worries and stories. Theres a small mini game thats fun for a while but gets stale later on. You meet many people, learn about their life, problems, helping them. But having the character you yourself are using going through certain problems and having your regulars listening to you instead, really helps remind you that whoever you are talking you problems with have their own as well. I relate with some of the problems in the game and other problems I know i would eventually have to face. Many have most likely already dealt with it or are dealing with it right now. A thing to note is that there ARE different endings. 6 to be exact. As much as i hate to say it though, i dont think i would be playing it for a while. I personally dislike playing games over again from the beginning to simply unlock endings. However this game is something which, may help you in life quite a few times. Regardless, i believe everybody should at least play through the game once. The problems and people you meet in this game feels real. 8/10 (edit: Oops almost forgot, the music in this game is amazing)",
            "review_score": "1"
        },
        {
            "review_text": "So Ive decided to buy this game because I saw a friend of mine who owned this game, and it looked really neat... And god damn, its was great. Solid mechanics, great music and perfect for having a bit of time getting tipsy makes this game way too good to resist.   Basically, you are a bartender of VA-11 HALL-A, and you get to hear the stories of the people you serve. After the first night, you practically get invested in the story and desire to become a bartender than whatever job you originally chose to be. You make drinks by simply pressing your left click and dragging it to a cup and then after stirring it and serving it up. Absolutely great graphics and such fun for when you feel like you are alone in this world.   10/10 would drink again",
            "review_score": "1"
        },
        {
            "review_text": "Havent finished this game yet but loving it so far! music is awesome and it tells its story in a really unique way, so far havent experienced any of the blank slate anime bull****, every charcter has a unique personality and has tons of interesting things to say, be advised though, this game is more of a visual novel than anything so be prepared for that, otherwise if you like story-driven games, then this is the one for you!",
            "review_score": "1"
        },
        {
            "review_text": "11/10",
            "review_score": "1"
        },
        {
            "review_text": "Fenomenal.  The only thing that stops me from giving it a full 10/10 is the fact that there is no romance story line for the main character. But then again, you're just a humble bartender, listening to other people problems and trying to solve them and sell a few drinks along the way to pay your rent.  Oh, and the music is just amazing.",
            "review_score": "1"
        },
        {
            "review_text": "Visual novels are always a genre that interested me, but I can say that this is my first time actually playing one for any significant period of time. I managed to get a few endings on my first play through with little problem and had fun the entire time. The character art is gorgeous, dialogue is well-written, and the music is top-notch.  The only downside is I wish the story were a bit longer. It seems like a lot of things happen quickly near the end and then the game just kind of ends after all of that build up. It felt a little unsatisfying... but I do plan to replay it at least once to get some of the other endings, if nothing else.  I would recommend this one if you're looking for something engrossing, relaxing, funny, and with a lot of text. It's a winner.",
            "review_score": "1"
        },
        {
            "review_text": "Get it and try to get everyone as drunk as possible.",
            "review_score": "1"
        },
        {
            "review_text": "Robots are people too",
            "review_score": "1"
        },
        {
            "review_text": "A narrative driven cyberpunk game with great characters and awesome synthwave music.",
            "review_score": "1"
        },
        {
            "review_text": "Couldn't put this down. The incredible art, gorgeous soundtrack and charming characters all come together within the framing of a cyberpunk bar",
            "review_score": "1"
        },
        {
            "review_text": "It's pure gold. Great characters, music and the sprites are charming af. I don't even know why you're reading this, go buy it dammit!",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game! Buy n' Cry, that's the bartender's way.",
            "review_score": "1"
        },
        {
            "review_text": "Never before have I experienced such an intense level of comfy.",
            "review_score": "1"
        },
        {
            "review_text": "10/10. Would serve drinks again",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best VN Ive ever played can't help but reccomend it!",
            "review_score": "1"
        },
        {
            "review_text": "  I hate you Model Warrior Julianne    Soundtrack is top notch though",
            "review_score": "1"
        },
        {
            "review_text": "  The Visuals? Stunning. The Soundtrack? Eargasmic. The Story? Absolutle beautiful.  Do yourself a favor and play this game, you won't regret it.",
            "review_score": "1"
        },
        {
            "review_text": "This is the only game that has tied with Dark Souls as my favorite gameof all time. Everything from the art to the characters, dialogue and soundtrack is honestly perfect.   The story and characters resonated with me on a deep personal level and gave me a unique experience that kept me thinking and feeling all the way through.  If you want a game with a story that will keep you heavily invested all the way through, thi is the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "A great VN with well written characters in an amazing and interesting setting. Plus the minigames help you form getting bored.   Awesome soundtrtack as well",
            "review_score": "1"
        },
        {
            "review_text": "Quality bartending action with a lot of enjoyable characters. Get your own drink and settle into a cozy evening with some good music in the best bar in Glitch City.",
            "review_score": "1"
        },
        {
            "review_text": "Very awesome game, follow a bartender's life as she deals with her own problems and those of her client's while brewing fancy drinks.",
            "review_score": "1"
        },
        {
            "review_text": "VA-11 Hall-A is a game about Santa's resurrection as the Mega Santa that saved Christmas from the Redmonds. In a cyberpunk world.  10/10 give me a fedora with perfume &amp; a plum.",
            "review_score": "1"
        },
        {
            "review_text": "An excellently-crafted setting filled with fun and endearing characters. A joy to play and a refreshing take on 'standard' visual novel storytelling and play.",
            "review_score": "1"
        },
        {
            "review_text": "Despite the dual monikers of  Cyberpunk Bartender Action  and  Waifu Bartending  there's not really any action, nor is the game focused on romance.  This game's biggest merit is unmistakeably its narrative, but let me briefly overview the gameplay.  While there is no actual challenge in how you mix the drinks, there is a little bit of challenge given to the player in which drinks you serve. Usually it's just a kind of word puzzle, but there are also a number of scenarios that can be reached by offering somebody what they needed instead of what they ordered. Just don't expect the actual mechanics behind mixing drinks to be fun - it is, after all, emulating a job. You can effectively expect a visual novel.  I stepped into VA-11 Hall-A expecting a slice-of-life story about surviving the daily hardships of living in the cyberpunk future. And that is ever-present, but there's a lot more going on if you'll look for it.  Within the dreary shadow of the corrupt, corporate Glitch City, you'll encounter a diverse, well-written cast of characters, with plenty of woes to drink over. There will be entertaining, memorable people, and there will be unpleasant ones with ugly outlooks. There will be people you don't want to, but have to deal with, and you may come to realize that there's more to them than you thought.  The game succeeds at its upfront goal of building a  comfy  atmosphere, reflecting the mood of the bar. It's an oasis from the harshness of day-to-day struggles of Glitch City in much the same way that the game itself is an escape from the hardships of one's own life.  One of the strengths of the game in my opinion is that it challenges the very audience it appears to cater to. Most of the cast is female and even gay, but the script is flipped on how various characters are treated, without seeming unrealistic. Men and women and robots are all objectified and casually harassed. I don't know whether it goes over most players' heads, but it does a good job of showing how uncomfortable and grating it can be, or alternatively how relatable.  On that topic, the subject matter can be quite sexually explicit and very forward. While I think this is actually a very honest extrapolation of how sexually open we as a society might be fifty years in the future, especially  in a bar , this might make some people uncomfortable, so be warned.  The world is built in details that you can glean from conversations over time. Some details are asked for or explained, some are slipped sneakily in the text, and others are offered in optional daily news feeds or threads on the fictional 'Dangerous Opinions' board, Danger/u/, which echoes the daily fears and concerns of the laypeople.  Despite being so character-centric, some very vital recurring cyberpunk themes are addressed and briefly explored, like the nature of digital immortality, or living alongside sentient robots, or what said robots think about The Three Laws, or what it feels like being a good cop in a world full of bad ones.  There is some dark and heavy subject matter encountered across these stories - after all, they are usually being told by people who've been driven to the bottom of a glass - but the game is not without its share of humor (both good and bad) and moments of levity or tenderness. It pretty much runs the full gamut of human emotions, and it's easy to fall in love with because of that.  Lastly, Jill is surprisingly one of the best-written protagonists I've ever seen in a game. Her personality is very defined and her justifications for player actions are always consistent with her character. It's downright refreshing compared to the norm of silent and/or stoic.   Edit: I've nominated this game for THE “I'M NOT CRYING, THERE'S SOMETHING IN MY EYE” AWARD. I didn't go into this expecting an emotional story - everything I'd heard suggested that it was a humorous, cozy, colourful ride - and yet there is a powerful, personal tragedy nestled at the heart of all else that goes on.",
            "review_score": "1"
        },
        {
            "review_text": "What could possibly be considered some of the most fun I've had reading for hours on end. In the end, I had fun.   Also the badges are cool",
            "review_score": "1"
        },
        {
            "review_text": "Part visual novel, part bartending simulator; this fantastic game strikes an emotinal chord not often seen. The less you know going in the better. Suffice to say, you will spend a lot of time talking to people and learning just who they are. If this appeals to you, I cannot recommend this game enough. An amazing soundtrack is just gravy.",
            "review_score": "1"
        },
        {
            "review_text": "VA-11 Hall-A: Cyberpunk Bartender Action or better known as Valhalla is a game in which you play, as title might suggest, as a bartender.Now you might be wondering 'what's so great about game?' and I will answer this question below.  In Valhalla you play as Jill, a girl who is also a bartender.During the game you do nothing but serve drinks, listen to your costummers and stay in your room after work.I can hear you asking 'What's so great about this?', well, everything.Valhalla is more of a game where you learn about the world it's set in and about it's people, all from the perspective of a normal citizen.  While working at the bar you learn a lot about the custommers not just from them directly, but also from the other characters of the game.If you pay enougth attention you might spot the fact that most of the characters presnted in the may have met at least once.You might learn even more about the different characters of the just from givving them the right drink, because sometimes they don't say directly what they want.  After work, you can use the money you won to go shopping, because if you want to make serving drinks easier you need to buy whatever Jill wants at the moment, but remember you also have to pay Jill's taxes which are also imporntant for keeping her attention at work.You can also spend time on the internet and read news, like this you learn more and more about the world.  The gameplay consists of you dragging ingredients for the drink you are making and don't worry you have a menu if with information about every drink and how to make it.Based on how good of a job you will do you might win more money for your work.  My recommendation is to buy and play the game if you are interested in great worldbuilding and a great cast of characters.If this doesn't convince, keep in mind that it has a black J. Jonah Jameson called Donovan D. Dawnson. :D",
            "review_score": "1"
        },
        {
            "review_text": "Bought it on a whim, was pleasantly suprised to find it was a lot deeper than I thought it would be. It's basically a visual novel where serving different drinks will alter the story in some way. Interesting story and characters, and the soundtrack is fantastic. 8/10 Pretty damn good.",
            "review_score": "1"
        },
        {
            "review_text": "I'm weird with games. Some games I can sit for 20 minutes, play it and never go back to it, even if it's critically acclaimed and then things like Rocket League, I've got 200+ hours on it.  I think I go for things that are different and right now, this game is something different.  From what I've played so far (Just under an hour), the game is fantastic. From the really catchy soundtrack to the characters you meet, the way its presented, game mechanics. It looks so simple, it really is but it's a good simple.  I would recommened anyone to pick this up and play. Sit there, feet up and chill out with this.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent Game, had a good time playing it",
            "review_score": "1"
        },
        {
            "review_text": "I bought the profile background for almost the same amount of money i spent on the actual game.  10/10 great game",
            "review_score": "1"
        },
        {
            "review_text": "Fun little chat-em-up with a lovely artstyle and some really interesting character interactions, plays a lot like a VN/Puzzle game hybrid. The soundtrack is wonderful (Hell, i'd plonk down 11 quid for the OST by itself) and, when played with booze and a couple snacks at hand, it leaves this stupid grin on your face for hours.  The game *could* do with being a little longer, and go a bit more in-depth with the world it's set in. Or in-between bar managing sessions, feature a click-adventure-style exploration element (looking at you DIG) that lets you wonder along the cold and dreary streets of Glitch City, maybe find some more quirky clients to interact with.  But otherwise, it's definitely a winner. Worth full price i'd say.  P.S If you're expecting 'Papers, Please' with waifu's, don't bother. Only the core gameplay is even remotely similar, not the feel or style.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely great visual novel with an interesting twist on 'dialogue options' in the form of serving drinks. The soundtrack is stunning, too!",
            "review_score": "1"
        },
        {
            "review_text": "Everything about this game is just perfect, except the part where they're not real.",
            "review_score": "1"
        },
        {
            "review_text": "The writing is excellent and doesn't waste your time, which in my opinion is tragically unusual for VNs and VN-like games (and I've played many.)  Because the game lets you take your time, its drink-mixing 'puzzles' are mainly about using your knowledge about the cast and the drinks to try to do something that ends up having interesting consequences. I'm happy to say I was very pleasantly surprised by how much thought was put into it - your drink mixing decisions end up having a lot of real impact on the story and characters.  Play it if you could use a relaxing game experience, and you suspect the setting or its focus on exploring odd and interesting characters might appeal to you: it probably will.",
            "review_score": "1"
        },
        {
            "review_text": "This game has amazing art, characters, music and humour. There's so much more to this game behind the already cool concept.   The way you interact with characters can really change what you think about them and how much you find out about them, and the development and endings for each character are extremely satisfying. I was constantly interested in each person's past as I served them them certain drinks. Everyone is a real person with their own problems, interests and backstories, and they don't feel corny or boring in the slightest.   The setting is amazing and really paints the picture of a City that with its own issues outside of the bar.   Easily one of the best games I've played, and I don't even like visual novels all that much.   Games with this much ambition deserve to be supported to no end. I can't wait for your next game Sukeban!   If you're still not convinced, guys. Waifu Bartending. C'mon.  P.S God bless your soul with Model Warrior Julianne :,) (Gonna go see if I can buy the soundtrack now :D)",
            "review_score": "1"
        },
        {
            "review_text": "This book was a good read.  10/10 would buy from amazon.",
            "review_score": "1"
        },
        {
            "review_text": " Welcome to VA-11 HALL-A",
            "review_score": "1"
        },
        {
            "review_text": "Dana a best!",
            "review_score": "1"
        },
        {
            "review_text": "This game is fantastic. I didn't know how badly I wanted a mixture of slice of life and a melancholic cyberpunk setting to be a thing until I played it, but I'm glad it is. I don't usually go for OELVNs, but the clear love and hard work the devs put into this game really make it stand out. And OST is awesome. Easily 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing visuals and sountrack, very relaxing gameplay, compelling story, characters and writing. Great game! If, like me, the theme, style and mood strikes your fancy, do yourself a favor and buy it!",
            "review_score": "1"
        },
        {
            "review_text": "While serving drinks may not seem like the most fun thing to do. This 'video game' as put me from 'playing' it for a few minutes to reading it to start to finish.   Its filled to the brim with anime, games, and internet references, without coming out as cringy or too obvious.  The characters are interesting and their conversations never seem to drag on. They are a fun read and they all have their own preferences, quirks and stories to share. The music is one of the best things about it  So yeah, it's a visual novel. A very good one at that, and breaks the mold a bit with the 'Bartending Action'. So keep that in mind if you are following this recommendation.  TL;DR: Do Bartending, Listen to People, Get Paid, Enjoy the Story.",
            "review_score": "1"
        },
        {
            "review_text": "Branching paths based on serving the right drink.  10/10 Would mix drinks to change lives again.  Buy it. Buy the soundtracks.",
            "review_score": "1"
        },
        {
            "review_text": "The amount of Seinfeld jokes in the game is approximately 300% more than I was expecting.  Festivus for the rest of us/10",
            "review_score": "1"
        },
        {
            "review_text": "wonderfully self aware. buy it.",
            "review_score": "1"
        },
        {
            "review_text": "Shots for everyone!",
            "review_score": "1"
        },
        {
            "review_text": "there is a talking dog wearing sunglasses and a hawaiian shirt in this game.",
            "review_score": "1"
        },
        {
            "review_text": "I love this so much. Cyberpunk is my jam, Anime is my jam, Snatcher is my jam, Pixelated Anime Babes are my jam, Seinfeld is my jam. So this game is pretty much my jam. I urge everyone curious about this game to play! Also the music is sooo good  I'm looking forward to anything Sukeban is making in the future, great job and thank YOU for this piece of art.",
            "review_score": "1"
        },
        {
            "review_text": "You got waifus, great dialogue, top tier music, and bartending. What else could you ever need?",
            "review_score": "1"
        },
        {
            "review_text": "This is just a fantastic game, great setting, awesome artwork, amazing music, well written and likeable characters and a decent story.  If you like cyberpunk, this is for you. If you like synthwave, this is for you. If you like shibe, this is for you. If you likepixelart, this is for you. If you like underage sexworkers, this is for you. If you like visual novels, this is for you. Even if you don't like visual novels, this is probably for you. If there is anything at all that you like... yeah you guessed it, this is the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "This game came out of nowhere for me. I was browsing Steam when it appeared in front of my eyes. First thoughts? 'The hell is that?' Read the description. 'A cyberpunk bartending game? You got me there. Gotta buy it.' Got the money, bought it, played it. Instant love.  This is master story-telling, and is what I've always wanted in my sci-fi/cyberpunk. Who cares about 'X son of Y, Lord of New Earth' when you can have Jill, cute bartender of Glitch City? The guys who wrote this game used two media to display background exposition and story: 1) small shards of infos in the bar's dialogues 2) chat and articles over the Internet on Jill's tablet. It's really a smart and natural way to display such infos! Instead of the usual 'hey reader/player, eat those diaries and other archives that are pages long!' Nothing of that here, You got small shards of infos, small articles on webpapers, easy to swallow.  I must bow to this game. Both the story and the way the story is displayed are awesome and original. I'm greatly thankful to this game, bcs as a scenarist, it helps me to find better ways to entertain my readers. If you're curious about original narration, buy this game.  Oh, and if you like cyberpunk and cute waifus, buy it, too!",
            "review_score": "1"
        },
        {
            "review_text": "Aside from all the splendid artworks, soundtracks, good sense of humor and the refreshing experience of being a bartender, what makes this game utterly engrossing is, needless to say, the characters, who never lose their true beauty even in this gloomy, post-singularity dystopia.",
            "review_score": "1"
        },
        {
            "review_text": "i like this game, a lot.   i wont go into detail for fear of spoilers   I JUST LIKE THIS GAME",
            "review_score": "1"
        },
        {
            "review_text": "Good music, good characters, Alma best girl",
            "review_score": "1"
        },
        {
            "review_text": "this is only my first impression , from the user interface and art , the Creator really put a lot of time's creating this Game , Good Soundtrack , from my 30 min playing , the game seem's only 1 line , can't choose what you gonna say , but i can't say it's gonna 1 line until the end , still 30 minute gameplay , this is only first impression , i'll update this review after i finish the game",
            "review_score": "1"
        },
        {
            "review_text": "Really enjoyable writing, a branching dialogue based on what drinks you serve and a cute cast of characters What more do you really need?",
            "review_score": "1"
        },
        {
            "review_text": "It's comfy and enjoyable to play, with very entertaining writing to boot. Enable scanlines for that 90's visual novel experience.  Proud to have done my part to the Venezuelan Hellhole Rescue Fund.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing, the overall setting is perfect unlike other 'cyberpunk' games I've played in the past. The dialogue is great and kept me interest throughout. Not to mention what drew me to check out the game in the first place, the amazing pixel art and music.  Overall a great experience and reminded me some what of the Pheonix Wright series.",
            "review_score": "1"
        },
        {
            "review_text": "Characters are fun, music is good and art is cute. Game bit is nicely done too, simple, but still with couple spots that are hard.",
            "review_score": "1"
        },
        {
            "review_text": "Witty, adorable, and charming; VA-11 Hall-A is a pleasurably relaxing VN which draws you in with it's quirky and colourful characters and aesthetics; seasoned with it's humourous dialogue and amazing music. It follows a PC-98-esque format of visual novel, along with it's detailed and characteristic pixel art.   VA-11 Hall-A had me smiling from start to finish, with the occassional pout and single tear that may appear as the story goes. If you like character-driven and tight-knit stories, this for you as it tells a very concentrated and interpersonal web of lives that happen by the titular VA-11 Hall-A bar.   In all honesty, my personal Game of the Year; nothing has made me feel as great as I did cracking open beers and just leisurely going through my first playthrough of the game; a fine piece of interactive art, the blood, sweat and tears of the developers can be felt deeply and it resonates in the quality delivered. Well worth the wait. Thank you Sukeban Games.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty much the only thing I didn't love about this game was the fact that it ended :'(  10/10 would befriend a robot ♥♥♥♥♥♥♥♥♥♥ again",
            "review_score": "1"
        },
        {
            "review_text": "A great game if you like visual novels, main difference here is that you don't select choices, but rather serve drinks, and the drinks you serve act as choices and change the way the clients will tell their stories, which I might add, are all very interesting people. You will come across several waifus, if you're into that as well! I also highly recommend if you're into cyberpunk, 80's style fiction.   Pros - Writing is good, no errors and very funny! - The music. Its. So. Good. I'm not lying. Look up some of the OST. - 8+ hour long story with multiple endings, including NG+ - Gripping story line, you feel a connection will all of the clients, even if some of them are not so friendly. - Every character is unique, no repeat tropes like you find in many other VN's. - The art style is very unique, and fits the theme of the game to a tee. - The OST.  Cons - A lot of the clients don't have 'endings', only a certain few feel as if you closed off their arc, per say. - The things you buy don't have any purpose other than filling the room with clutter, other than a few times where you have to buy them to keep yourself from being distracted at work - There is no 'randomize' button in the jukebox, so each time you start a new day or take a break, you have to manually select new songs. Sounds petty, but it gets very annoying the more you have to do it.  The pros far outweigh the cons as you can tell, so yeah, this game is damn amazing imo.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "11/10 would discuss random sh*t with customers again.",
            "review_score": "1"
        },
        {
            "review_text": "This game is such a cozy and awesome game! Well trough tought charecters and tastes, very funny moments! LOVE IT &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "A very very fun game with witty writting and great characters, but incredible repetitive gameplay. The enjoyment of the game will come from the reading, not the playing.",
            "review_score": "1"
        },
        {
            "review_text": "So you know those cyberpunk cities where terrible things happen on a daily basis? Glitch City is no exception. There are a lot of stories happening in this city. However, you don't get to really experience any of them firsthand. You're Jill the bartender, in the run down VA11-Hall-A. Aside from what you pick up from patrons, you have your own story.   Off duty assassins. Dogs. Lilim (human-like androids). Visitors from Neo San-Francisco. Hackers. Your motto is to mix drinks and change lives, and that is what you do. They talk to you, and as they drink, they tell you their stories. Sometimes you give advice. Sometimes you can get them drunk as heck. As the system begins to crumble, Jill has a struggle of her own to get through.   By the way, you can buy things with your budget. You WILL need to pay rent and the bills, though. Keep that in mind! Just because you can start with money from last time in NG+ doesn't mean you should.   Retro graphics, unique premise, and great music? Yes! Characters you get attached to and feel like actual people? Yes! Use of the spacebar for scrolling? Yep. I can't describe how much I love this game. For a game about mixing drinks and talking to people, it's delightfully deep. I am so getting the Vita version when it comes out. I'm curious about how the controls for that system will mesh with the drink mixing.",
            "review_score": "1"
        },
        {
            "review_text": "I personally enjoyed spending $14.99 on this game. I'm no game critic but this is what I have to say for the game  VA-11 Hall-A: Cyberpunk Bartender Action is a game best played relaxed and tuned. The game is all about story, so if you're in to a bunch of dialogue with great characters, this game is just for you. Oh and the characters. All I really have to say about them is that Sukeban Games did an amazing job with characterization. Then again, I'm no critic and this is all coming from my opinion. I suck at backing these types of things up and I'm pretty lazy to even try. I gotta say, this game got me more times than the price in buying the game. (Idk if that statement helps, but I stand with my opinion of Va-11 Hall-A being a really relaxing and enjoyable game)  Congrats to chara John (totally forgot his name)   for getting laid (one of my favorite parts of the game)   ",
            "review_score": "1"
        },
        {
            "review_text": "A nice twist on the VN genre with a fun little barteding minigame added it. The characters are well writen as well and as the game goes on you get engrossed with the events of their day to day lives . So why not stop by for a drink and meet the Interesting people that inhabit VA-11 HALL-A you will not be disapointed.",
            "review_score": "1"
        },
        {
            "review_text": "I don't normally leave reviews for games. But this game has pulled me into it's world.  I'm not a visual novel gamer/fan I'm not a fan of old school/8bit/retro games I'm not a fan of simulation games  And yet, with all those reasons, I have to say that this is the most invested I have ever invested in a game emotionally.  10/10 - Would recommend ANYONE to play this game!   P.S: As the creators of this game have stated, it is truly a game to stick back with a drink in your hand while you play.",
            "review_score": "1"
        },
        {
            "review_text": "Boss is the best!",
            "review_score": "1"
        },
        {
            "review_text": "  Despite promoting itself as a waifu-centric game, VA-11 Hall-A carries an impressive amount of substance, and I'm not just talking about the drinks. The characters are all well fleshed-out, and so is the world the game is set in. The various topics that the games explores thematically are quite interesting as well, ranging from corporate and government corruption to prostitution to dealing with loss.  It's all wrapped together with a surprisingly fresh-feeling Snatcher-esque aesthetic and an excellent electronic soundtrack.",
            "review_score": "1"
        },
        {
            "review_text": "He really does have a Johnface....",
            "review_score": "1"
        },
        {
            "review_text": "I knew this game would be dope once I realized anon wrote it and included a Char reference, can't wait to finish it.",
            "review_score": "1"
        },
        {
            "review_text": "In my opinion, VA-11 Hall-A is a complete package. It has new and unusual gameplay, which works very well, the dialogue and characters are interesting and well written and the soundtrack is out of this world. I whole-heartedly recommend VA-11 Hall-A.",
            "review_score": "1"
        },
        {
            "review_text": "an interesting visual novel with a great cyberpunk feel. it's relatively short and getting all of the endings probably won't take you very long.  that being said, the dialogue feels much more authentic than your average VN. there's also plenty of quality audio tracks - which is pretty much a necessity for this genre! to top it off, you can even arrange them in the order you desire  if you don't want to fork out £11 for a VN, that's understandable. get it during a sale!  given how many trash VNs are floating around steam at the moment, it can be hard to discern the good from the bad. this one is definitely the former",
            "review_score": "1"
        },
        {
            "review_text": "This game is very addicting for how simple it is! The character designs and personalities are all so different. The humor is fresh and has something in it that will make just about anyone laugh. The stories of the caracters and the events in game I have experienced so far have been enough to get me thinking more about the cyberpunk, dystopian universe of this game. If you're looking for something to play while relaxing this would be a great selection.",
            "review_score": "1"
        },
        {
            "review_text": "10/10  Better story than Undertale.  Dorothy, best waifu",
            "review_score": "1"
        },
        {
            "review_text": "Great music and I'm old and actually hate playing videogames now so it's great to just read.",
            "review_score": "1"
        },
        {
            "review_text": "Jill is best girl  Literally flawless game 17/17",
            "review_score": "1"
        },
        {
            "review_text": "This game is exceptionally written, with a soothing atmosphere. Its characters are memorable, and the art is beautiful, and will still look good in years to come. Its soundtrack is amazing, as it's one of the only games that made me listen to the songs and find out my favorites before setting up the jukebox. Overall it would be one of my favorite and most memorable games of the year",
            "review_score": "1"
        },
        {
            "review_text": "Chill af",
            "review_score": "1"
        },
        {
            "review_text": "A very story focused game however I quite enjoyed it and the concept around is quite interesting as well.",
            "review_score": "1"
        },
        {
            "review_text": "Game of the year 2016.",
            "review_score": "1"
        },
        {
            "review_text": "It's a great story with a silly drink mixing mechanic attached. I'm in love with it.   'VA-11 Hall-A: Cyberpunk Bartender Action' is a beautiful game. The art style is fantastic, the dialogue is amazing and the story is phenominal. It's been a long time since I was truly sucked into a game that I could just play for hours without feeling tired or bored.   The game does two things very well: story and character development. Even without dialogue options or character customization VA-11 Hall-A is able to immerse the player in this bartender role. You listen to your clients and they listen back. It's such a wonderful experience watching this huge world unfold from behind a counter.  The gameplay is very simple, yet still manages to feel less like a chore and more like interaction. You mix drinks at the bar, check your phone at home and go shopping every once in a while. You're just living out your daily life in a cruel futuristic world where the only light is the bar.  My final statement is as follows. The game feels human. There's no other way for me to describe it. The friends you make, the people you speak to all feel human. Everyone has problems and everyone has emotions that can affect how you see them as a being. It's your job to make sure that you understand them and are there for them and that is what this game is about. Even with the dogs and the Lillim, we are all human in Glitch City.   I won't forget this game.",
            "review_score": "1"
        },
        {
            "review_text": "If you're on the fence about buying this game, do it. It's a fantastic experience that I would recommend to all of my friends.  With a visual novel, good writing is critical, and VA-11 HALL-A has some exceptional writing. Characters feel real, the world-building is great, and the overall story is excellent. Audio is also very well done, to the point where I went and bought the soundtrack on Bandcamp.  Not usually one to write reviews, but I cannot emphasize enough how much I enjoyed this game. Sukeban Games deserves serious praise for their work. Buy it.",
            "review_score": "1"
        },
        {
            "review_text": "Waifu's and booze. Need I say anymore?",
            "review_score": "1"
        },
        {
            "review_text": "Thoroughly enjoyed it from start to finish.  Great game to chill back with a drink/smoke and some food.",
            "review_score": "1"
        },
        {
            "review_text": "It's worth the $14.99, just buy it.",
            "review_score": "1"
        },
        {
            "review_text": "It's relaxing with its chill soundtrack and has not an amazing story but it's a story that engages you to think about your values (well it did for me).",
            "review_score": "1"
        },
        {
            "review_text": "Got to make a girl drunk and get late and fired from her job.  Amazing game.",
            "review_score": "1"
        },
        {
            "review_text": "Who knew that mixing drinks could be so entertaining.  I brought this on a whim, and was pleasantly surprised by the experience.  Love the soundtrack and the humor too.",
            "review_score": "1"
        },
        {
            "review_text": "Best dialogue i've seen in a game, every character feels real, and you can just sit back and relax while playing.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent. A visual-novel style game with a bit of actual gameplay in it to freshen it up! Great characters and writing, and art that makes me want every character on a t-shirt and wall-scroll and vinyl figurine and hug pillow.",
            "review_score": "1"
        },
        {
            "review_text": "An amazing soundtrack, interesting characters and plenty of alchohol.",
            "review_score": "1"
        },
        {
            "review_text": "This game I picked it up to get into visual novels and since it was on sale one day and thought what the hell I'll try it. However, after playing about 7+ hours of this game I realized that this game is in my opinion practically perfect! The story is great and absorbs the player into its world with unique and quirky characters making the world around the player believable seemibly full of life. I cannot even say anymore that most people have already said. All I can say is PICK IT UP either when its on sale or Full price if you have to! This Visual novel gem got me into the idea of playing a visual novel and is what I would consider as a basis for future visual novels should try to replicate when it comes to characters and world building.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun game, characters were lovable, very good soundtrack. it was very enjoyable!",
            "review_score": "1"
        },
        {
            "review_text": "Everything about this game is amazing. The story, characters, and music are all great. PLAY IT THEN! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Okay. My weeb friend told me to get this game. I didn't expect this kind of ride. I never knew that I could get so attatched to a gay, 2D, cold as ice bartender or her friends. This game is amazing and if you play it and don't enjoy it, you have no heart. This game needs more love and needs to be shared more.   A bit of advice though. DO NOT WATCH ANY LETS PLAYS! Usually I would advise watching a bit of the gameplay beforehand so you can get a feel for the controls, but not this game. This game is one that you should go in blind. You'll feel much more attatched to the characters, which is a fantastic thing in this game. Please.  Final note on this game. Buy it. Story is beautiful, graphics are nice, drink mixing is fun, and you will want to see the ending. Beautiful.",
            "review_score": "1"
        },
        {
            "review_text": "GOTY  Really good story, unique gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "So I'm just through the first night and I can only guess what lies ahead. But I recommend this visual novel because of its great style.  Just take some late night time, relax and go with the flow. The game itself even says so.",
            "review_score": "1"
        },
        {
            "review_text": "Serve Drinks, and Change Lives.  Simply put, the best game I played all year. With some of the best writing I've ever seen in a video game.  If good humor, well handled drama and some of the most likable characters ever are up your ally, this buy is a no brainer.  Just go in pure, this game is best when it isnt spoiled at all.",
            "review_score": "1"
        },
        {
            "review_text": "The game is a really nice change of pace from what's coming out these days. Smart and witty writing, immersive experience and surprisingly lots of player choice despite the limited gameplay. Definitely worth the full or discounted price. A really easy and enjoyable time sinker for what it is.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 I didn't know much about this game, apart from that it looked really cool. I owned this game a long time before I actually got the gumption to play it. But once I started, I was hooked. Mixing drinks, once you understand the rules, it quite fun and something differernt from a bog standard visual novel. I like the idea of what drinks you mix for people changes how things play out, rather than simply making dialogue decisions. You have to pay attention to what a character wants, even if they don't completely voice it themselves (or if they do). You play a character who isn't simply an avatar for you - she is her own person who you're playing alongside and learning about her is just as interesting as learning about your co-workers and patrons. I love the cyberpunk take on things and learning bits and pieces about the world you're currently inhabiting. This game does things a little differently and I really love that about it. Just go for it - you won't be disappointed.",
            "review_score": "1"
        },
        {
            "review_text": "This is sooo good, I WANNA HUMP IT!!!",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game, fantastic characters and highly recommend it. Very good for a relaxing game to play and just absorb the story.",
            "review_score": "1"
        },
        {
            "review_text": "Don't let the waifus and bartending sales pitch fool you. This game is a tearjerker. You're gonna need to serve yourself a few drinks to get through this one.",
            "review_score": "1"
        },
        {
            "review_text": "I want Jill to crush my head with her thighs",
            "review_score": "1"
        },
        {
            "review_text": "I don't usually review, but 1:acheivement, and 2: this is best game. (okay, maybe not the 'best game', but it's good and you should buy it! I mean, for a game to be 'the best game', it would in part depend on your subjective opinions, and due to that fact, everyone will have slightly different taste in what they consider the 'the best game'. But whatevs, I'm just here for the acheivement.)",
            "review_score": "1"
        },
        {
            "review_text": "A cute game about a cute girl making MANLY drinks. I spent a whole 12 hours beating this game, and I enjoyed it. The virtual wives are a solid 8.5/10 Sei is best one though.",
            "review_score": "1"
        },
        {
            "review_text": "Wow! Great game! Enjoyable story. Would recommend if you like this kind of game.",
            "review_score": "1"
        },
        {
            "review_text": "alma has nice breasts",
            "review_score": "1"
        },
        {
            "review_text": "I want to hold hands with Dorothy while getting money slapped by Stella",
            "review_score": "1"
        },
        {
            "review_text": "My experience with VA-11 Hall-A was a magnificent one. There's a lot going on for me right now, and sitting down to play this game, getting invested in the story and characters, having a phenomenal time mixing drinks, really helped me these past few weeks.   I actually got this game because of my favorite youtube reviewer comparing this papers please, and talking about some missed gameplay opportunities from that game not present in VA-11 Hall-A. Despite these thoughtful quips, the visuals and music from the video sold me on getting this game, and I'm incredibly happy with my purchase.  If you're a fan of visual novels, a fan of low pressure gameplay, or in need of a serious pick me up, get this game. In my opinion, it's worth every penny.   Thank you Sukeban games, thank you so much.",
            "review_score": "1"
        }
    ]
}