{
    "app_id": 448020,
    "name": "Share",
    "release_date": "2016-05-03",
    "developer": [
        "HFM Games"
    ],
    "publisher": [
        "HFM Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "Horror"
    ],
    "achievements": 0,
    "positive_ratings": 155,
    "negative_ratings": 47,
    "price": 0.79,
    "description": "In the backyard of the civilization, left by destiny without any hope, you'll find this house on the hill. It will become your shelter and give you everything you need. But then, the owners of the hill will come. And you will pay for this shelter.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/448020/header.jpg?t=1539186362",
    "minimum_requirements": "OS: Windows XP, Windows Vista, Windows 7 Processor: Dual core CPU @2GHz (Pentium D or better) Memory: 1 GB RAM Graphics: 2GB Video RAM - will work with less, but wouldn't look too good. DirectX: Version 9.0 Storage: 2 GB available space Sound Card: 100% DirectX 9.0c compatible audio device Additional Notes: Mouse, Keyboard",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "very creepy game.. so hard to solve,,, but also short stroy,,, we need share 2 !!! xD",
            "review_score": "1"
        },
        {
            "review_text": "I think it's just awesome indie horror, everyone should try this game!  Advantages +beautiful graphics +atmospheric environment  Disadvantages Nothing, if you like games similar to slender",
            "review_score": "1"
        },
        {
            "review_text": "NOPE! ...unless I'm missing a portal 16 minutes in which transports players to an entirely different game. Don't waste your money. Share is an interesting game to be sure. There are details placed in the environment that will make you look twice...but the atmosphere is not immersive, the goals make little sense, and it is easy to find yourself wandering in circles, wondering if you missed the content that is supposed to make this game awsome. This is a short, clumsy, lackluster experience with a little quarkyness on the side. You'll spend 14 minutes with dead face, trying to find the windmill, then 25 cumulative seconds saying 'The f*ck just happened?'",
            "review_score": "-1"
        },
        {
            "review_text": "I really tried but i couldnt play this game.          YouTube™ Video:  Share - A really disappointing indie game.... - Reppy&nbsp;",
            "review_score": "-1"
        }
    ]
}