{
    "app_id": 448280,
    "name": "Job Simulator",
    "release_date": "2016-04-05",
    "developer": [
        "Owlchemy Labs"
    ],
    "publisher": [
        "Owlchemy Labs"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "VR Support",
        "SteamVR Collectibles"
    ],
    "genres": [
        "Simulation"
    ],
    "tags": [
        "Simulation",
        "VR",
        "Funny"
    ],
    "achievements": 11,
    "positive_ratings": 1219,
    "negative_ratings": 189,
    "price": 15.49,
    "description": "In a world where robots have replaced all human jobs, step into the &quot;Job Simulator&quot; to learn what it was like 'to job'.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/448280/header.jpg?t=1543525145",
    "minimum_requirements": "OS: Windows 7 SP1, Windows 8.1 or later, Windows 10 Processor: CPU: Intel i5-4590 equivalent or better Memory: 4 GB RAM Graphics: Nvidia GeForce GTX 970, AMD Radeon R9 290 equivalent or better Storage: 1 GB available space Sound Card: N/A Additional Notes: VR ONLY!",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This game is a great introduction to VR, and it shows lots of potential, but it's definitely not worth $30. I played two of the four jobs which barely take around 30 minutes each to complete, and I had seen the other two jobs on Youtube, so I felt like I had pretty much experienced everything. I felt no attraction to replaying the game, and like many other VR games, you complete it too quickly to feel like the price tag was deserving. I can see why this game has such good reviews, seeing as most people received this free with their Vive purchase, but this game is definitely not worth $30. I would highly recommend it if the price was dropped to $15 or $10, which I can see happening in the near future.",
            "review_score": "-1"
        },
        {
            "review_text": "i stole the robber's hat   also sent an innocent woman with no recorded offenses to jail cuz im the best clerk   10/10 better than weed",
            "review_score": "1"
        },
        {
            "review_text": "Grabbed a robots glasses off his face, and sold it back to him... 40 times... 10/10 would recommend",
            "review_score": "1"
        },
        {
            "review_text": "  I dont know man. I cant tell whats real or not. But my boss says I havent been to work for a week, and yesterday I just got a promotion from him!  10110001/10  Would always get a job from job bot again!",
            "review_score": "1"
        },
        {
            "review_text": "  Today I took the glassess off my bosses face and threw a stapler at him. He did not take it as well as job bot.  This game is fun, lots of little details, albeit a bit repetitive. The room space VR makes for a very rewarding experience.  Controls are decent. Some interactions were a little tall for my kids to reach, but they made do.",
            "review_score": "1"
        },
        {
            "review_text": "A fantastic entry into VR! The humor is on point and the interaction with everything around you really shows how capable the VIVE can be. The biggest downside is that if you've seen walkthroughs of all four jobs online, you've basically seen the entire game. Still, a fantastic pack-in for the VIVE and a great showpiece to show off to others.",
            "review_score": "1"
        },
        {
            "review_text": "Vomited in a floating computer's  Soup, Soup, and Soup  soup. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "If you are going to show off your Vive to someone this is great game to do it. Easy to play and loads of funny moments. It was also great to find a Rick and Morty easter eggs in the game. Hopefully they add more than the 4 jobs but even with those you can have many hours of game play.   It is so immersive that I actually dropped my controllers a number of times trying to place them on a counter. I also tried to lean on a wall that wasn't there (for the record i stayed on my feet).   Favorite moment: pouring mustard into a customer's pipe.   I ran into a few minor bugs that required a reset but i'm sure they will be iron out in future updates.",
            "review_score": "1"
        },
        {
            "review_text": "This is a lot of lighthearted fun. The dialogue is loaded with satire and irony. The sense of space an immersion is the highest yet out of all 36 VR games that I own. This is a must-get if you really want to experience the immersive power of the Vive demonstrated fully.",
            "review_score": "1"
        },
        {
            "review_text": "Want more jobs! Also, perhaps expand the chef, adding more creatable foods made in simalair ways as the pizza and cake. Perhaps, they could be found with trail and error.",
            "review_score": "1"
        },
        {
            "review_text": "Love this game, love this game alot. I think though it's time that the develops start making more jobs for this and I would actually be happy to pay for new jobs. This is such an untapped game which I sppose on one hand is refreshing but with the VR scene still looking quite slim it would be nice for one of the big boys to either have a sequel or DLC.  Ideas: Fast Food (mcDonalds parody) Video Rental Store Vet Doctors (diagnosing, handing out medicine giving injections etc.. not surgeon simulator) Teacher Janitor Taxi Driver  I obviously think this is a game that should be bought.. but time for more please.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. MORE JOBS PLEASE!",
            "review_score": "1"
        },
        {
            "review_text": "My little cousins and kids LOVE this game. One of their top experiences so far!",
            "review_score": "1"
        },
        {
            "review_text": "  TL;DR This is a good game, I recommend it  pros: well optimized as of 7/19/2016 simple mechanics good for demoing to friends very fun polished, few bugs  Cons: Only ~ 1.5 hours of gameplay expensive for the amount of gameplay   This is a very polished Vr game that efectively uses HTC Vive's room scale capabilities. Job simulator is a good 'first' Vr game. I personally loved this game. I got the game for free (came with the Vive) and I don't think it's worth the $33 CAD it's listed for. Should you get this game? I would say wait for a sale then buy it asap, it's worth ~ $25 CAD  Specs: GTX 970, Core i3 4160, 8gb RAM, game runs 90 fps 100% of the time",
            "review_score": "1"
        },
        {
            "review_text": "  Surprisingly fun and addictive for a fairly short game. Really great way to initiate friends and family into the VR experience.",
            "review_score": "1"
        },
        {
            "review_text": "Best HTC Vive experience to date for me.  - Way more than just a tech demo - 4 different jobs to play, each with their own mini games and humour - Creative use of space for varying room sizes  If you want to test out your Vive and for some reason you didn't get this game with your Vive, buy it!",
            "review_score": "1"
        },
        {
            "review_text": "4.5/5",
            "review_score": "1"
        },
        {
            "review_text": "Really great game. It shows off what you can do with VR and it's increadibly fun to just screw around. Allthough it doesn't have a great deal of content it's replay value is great since the game is so fun.",
            "review_score": "1"
        },
        {
            "review_text": "So cool and funny! It shows the awesomeness of the HTC one more. It sure does bring back memory for us older folks that grew up with Window 3.1 :P",
            "review_score": "1"
        },
        {
            "review_text": "The best thing about this game is that it doesn't actually require a heavy PC. My GPU is a Nvidia GeForce GTX 650, and I still got about 90 fps. I'd recommend it to anyone who wants a Vive.  8/10 ign",
            "review_score": "1"
        },
        {
            "review_text": "My kids love this game.",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best intro into VR I've found. Perfect for first time players and especially groups. It's so much fun watching people play this as well as playing it yourself. Actual gameplay is fairly simple, but it's engaging, humourous and extremely silly.",
            "review_score": "1"
        },
        {
            "review_text": "One of the must-buy VR games. Absolutely amazing in so many ways.",
            "review_score": "1"
        },
        {
            "review_text": "I. Love. This. Game.  The feel is so near real. The small little details they add that most people would never find, but they're still there. I so hope more jobs come out and dlc, and all kinds. I love it.",
            "review_score": "1"
        },
        {
            "review_text": "Lots of silly, immersive fun. Recommended.",
            "review_score": "1"
        },
        {
            "review_text": "  solid 5/7, would mechanic again.",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun, and has a lot of character. It's a pretty funny way of experiencing VR, and doesn't involve shooting. FYI this entire game is based on the 'museum experience,' and therefore you are only doing missions and things while that BossBot is there. Personally I expected there to be a tutorial and then the 'real game,' but the real game is the -exceptionally long tutorial, lol. Anyway, yes the game is highly recommended, so give it a go.",
            "review_score": "1"
        },
        {
            "review_text": "Best interactive VR experience hands down.",
            "review_score": "1"
        },
        {
            "review_text": "  Great mini games, good use of virtual space. Lots of objects to manipulate with good touch detection. Liked the polish like being able to toss something through the basketball hoop in the office and having confetti shoot out if you make the shot. One of my favorite Vive experiences so far.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely loving this game. Good graphics and witty/comical dialog. Replay value: High.",
            "review_score": "1"
        },
        {
            "review_text": "  I work in a restaurant and Job Simulator let me do what I always want to do at work. Dancing to hot tracks, cooking perfect meals, make my customers happy, poison A. holes customers with uncooked food, throw burning hot food at customers that give attitude when I'm not at fault, and tell all the entitled people who wants a handout to f*** off!.",
            "review_score": "1"
        },
        {
            "review_text": "perfect game, and now that they added 'short human mode' my son beats me at staying longer immersed in VR :) honestly this is a must have game if you have kids, this beats any wii game. This is by far the best 'casual' (in non vulgar way) game of the VR space (by opposition to 'simple' movie like theBlu).",
            "review_score": "1"
        },
        {
            "review_text": "Sharon and I played for hours! great game",
            "review_score": "1"
        },
        {
            "review_text": "After finishing the core four missions (I haven't played with the extras yet), I recommend this game. I don't think it has much replay value but it stands as a shining example of VR at its launch. My wife and I laughed, played and had a good time with this game.",
            "review_score": "1"
        },
        {
            "review_text": "Lots of fun messing around in human jobs. My wife tried this as her first game in VR and had alot of fun. Very straight forward controls and funny stuff just happens naturally.",
            "review_score": "1"
        },
        {
            "review_text": "  For some reason, my kids really love this game (9yo boy and 5yo girl). This is their favorite game for the Vive and always ask to play it. As for me, it's not bad, although I prefer more action-oriented games.",
            "review_score": "1"
        },
        {
            "review_text": "Job Simulator is a game that I think is worth trying, but not at $40 or even its now lowered $30 price tag. It's not a bad game, and it has a few hours of amusement in it, but the fun of it comes more from interacting with the various items in each stage than actually doing the jobs most of the time. It's more of a novelty than a game, and while there's nothing wrong with that and it does a great job of doing it, I don't think it's priced to reflect that. If you get the game for free in the bundle you get when you currently buy a Vive then it's definitely worth playing, and I would definitely recommend it, but I don't think it's worth buying separately.",
            "review_score": "1"
        },
        {
            "review_text": "&lt;I BOUGHT THIS GAME&gt;  Great for showing new people the vive but for yourself the novalty wears off after 20 mins  20 minutes is not worth the £23 imo.   Just look at the other reviewer's game time - even those that loved it.  I would probably put it at £5 as a good VR experience",
            "review_score": "-1"
        },
        {
            "review_text": "Great game but ends too soon",
            "review_score": "1"
        },
        {
            "review_text": "  Kids love it and fun for adults too. Must play, its free!",
            "review_score": "1"
        },
        {
            "review_text": "I like throwing stuff",
            "review_score": "1"
        },
        {
            "review_text": "This is one of my favorite VR titles! Exciting gameplay mixed with fun and easy-to-learn controls, as well as decent graphics and few glitches make this one of my favorite games to play on the Vive. I would highly recommend this game to anyone who is into VR. I have a blast playing this game and am excited to see what else you guys work on! ",
            "review_score": "1"
        },
        {
            "review_text": "A fun, clean demonstration of what VR can do.  The game is clearly very cleverly designed to maximize what you can do - most sections are laid out so you never have to turn a full 360 degrees ( though you are capable of it), meaning you won't have to step over your chord. The game is fun and quirky, and easy for people of all ages to jump into and enjoy.  This game is a posterchild of what VR and the HTC Vive do, and for good reason.",
            "review_score": "1"
        },
        {
            "review_text": "Tried to close the microwave with my elbow. Shot paperclips at my boss. Set a customer on fire with a hot pepper. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "  Robotwoman sked me to donate for retiring Officemate, i grabbed inside my Trashcan and gave her a chewed up bubblegum but not before i duplicated it in the scanner.Had Fun.Wooud donate again.",
            "review_score": "1"
        },
        {
            "review_text": "If you are capable of playing this game without a smile on your face, you simply have no sense of fun.   This was my first game upon booting up my HTC Vive, and I already cannot wait to show it to other people. The experience is playful, surprising, and makes me want to go back and play some more.",
            "review_score": "1"
        },
        {
            "review_text": "Great bundled game with the Vive. After you finish the game you will probably never play it again.",
            "review_score": "1"
        },
        {
            "review_text": "Lots of humor and an easy intutive way to show off VR. Whatever you see you can interact with in a very natural way, reach out and grab stuff, open drawers and cupboards, push and twist switches etc. Throwing stuff feels like throwing stuff it is great. Would I pay 30 bucks (Canadian) for it? No. Luckily it came with the Vive. Not sure what the current market for this game is since until the Rift touch controllers come out everybody either has it already or cannot really enjoy it yet.  I want to recommend this game because I enjoy it even though it is short on content since I got it for free with my Vive but I cannot because of the price that others would have to pay. Once the price hits the 5-10 dollar range I could say it is worth it though.",
            "review_score": "-1"
        },
        {
            "review_text": "I'm sorry but this game is way too short for a 28 € price tag.  Seriously, only 4 jobs, all of them completed in around 30 minutes to 20 minutes.  I hope that this game gets more updates with more jobs, because witty and funny gameplay really isn't enough for a demo- lenghted game. I should have spent my money on audioshield instead.",
            "review_score": "-1"
        },
        {
            "review_text": "If you bought a Vive early and are eligible for this game free of charge, then by all means try this. It is a fun introduction to VR with occasional funny writing and a good level of interactivity. But I could not recommend paying anything more than about $5 for this title. It is certainly a novel experience but once you have tried it once there is no reason to try it again. It has neither the structured gameplay to call it a game, or the variability or flexibility to call it a sandbox. It will last you an hour at most and afterwards you will either want to delete it from your hard drive, or keep it around purely for demoing to others.",
            "review_score": "-1"
        },
        {
            "review_text": "  It's really no more than a physics sandbox. Don't take me wrong - the game is pretty fun if you have at least a sliver of imagination. It's definitely a great way of introducing the concept of VR to your friends and family. The problem is that it's very short (4 jobs, each takes 10-30 minutes to complete, depending on how much you screw around) and has practically no replayability. That would be fine if it wasn't for it's price (£22.99 at the time of the review). The only reason I own it is because it came free with the Vive - I'd definitely not recommend it at full price.",
            "review_score": "-1"
        },
        {
            "review_text": "The game is bugged, runs like crap. Thumbs down until bugs are sorted out.",
            "review_score": "-1"
        },
        {
            "review_text": "Looked great on the videos advertising, but I just couldn't get any fun out of this.  Feels like a tech demo, no real freedom you just do a mundane task once, perhaps get a giggle occasionally and then another mundane task.  ",
            "review_score": "-1"
        },
        {
            "review_text": "As someone who is unemployed, this will help me prepare to job",
            "review_score": "1"
        },
        {
            "review_text": "  I absolutely love playing this game. Even though I got this for free, I would have payed for it if I hadn't. I love everything about this game! It is so creative and funny. My only problem with this game is that unless you're cool with replaying the same exact scenarios in the game it's a one time use sort of game. If they added an endless mode and more jobs (right now they only have four) I would play this game nonstop, no joke. This is my first time writing a review so sorry if it's not as explained and detailed as you had hoped for.",
            "review_score": "1"
        },
        {
            "review_text": "  Really cool game. It really shows some cool stuff you can do with VR.",
            "review_score": "1"
        },
        {
            "review_text": "All I can say is.................I'M LOVIN IT!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Please expand on this game, will pay for DLC!",
            "review_score": "1"
        },
        {
            "review_text": "Really awesome interactivity of simple objects. The environment is very responsive and the humor is great. The gameplay is sort of weak, but it's mostly a show-off app for the Vive, not something you're gonna want to grind on.  I thought it was really cool.",
            "review_score": "1"
        },
        {
            "review_text": "I didn't expect that for a simple game like this, but this game is super fun, make me laugh all the time.",
            "review_score": "1"
        },
        {
            "review_text": "It is a comical VR game that is fun for kids and adults. I don't think its worth $29.99. Feels like an incomplete game or a mini game.  But it makes use of the HTC Vive very well.   It shows you the potential for VR games.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game to show what VR is to people. Its some short minigames in 1 game, The jobs are Office Worker, Chef, Car Mechanic and Store Clerk. Once you finish playing all these minigames/jobs it does get a bit boring. I would want maybe more jobs or an endless mode. Anyway, I do recommend this game but the price is a bit too big.   8/10",
            "review_score": "1"
        }
    ]
}