{
    "app_id": 448370,
    "name": "IS Defense",
    "release_date": "2016-04-19",
    "developer": [
        "Destructive Creations"
    ],
    "publisher": [
        "Destructive Creations"
    ],
    "platforms": [
        "windows",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Shooter"
    ],
    "achievements": 39,
    "positive_ratings": 1003,
    "negative_ratings": 63,
    "price": 4.12,
    "description": "„IS Defense” is a game set in politically-fictional 2020 – where the expansion of ISIS went out of hand. The player takes the role of NATO’s stationary machine-gun operator, deployed to defend the shores of Europe.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/448370/header.jpg?t=1461569613",
    "minimum_requirements": "OS: Microsoft Windows Vista (SP2) with DirectX 11 update (KB971512-x64), Windows® 7 (Service Pack 1) and Windows 8.1® - (64-bit only) / Windows® 10/ (64-bit only) Processor: 2.6 GHz Intel® Core™ i5-750 or 3.2 GHz AMD Phenom™ II X4 955 Memory: 4 GB RAM Graphics: NVIDIA GeForce GTX 460 or AMD Radeon HD5850 (1 GB VRAM) DirectX: Version 11 Storage: 4 GB available space Sound Card: Integrated or dedicated DirectX 11 compatible soundcard",
    "recommended_requirements": "OS: Windows® 7 (Service Pack 1) / Windows® 8 / Windows® 8.1 / Windows® 10/ (64-bit only) Processor: AMD Octa-Core / Intel Quad-Core processor running at 3.4 GHz (AMD FX X8 8350 or Intel Core i5 3570 or newer architectures are recommended) Memory: 8 GB RAM Graphics: AMD/NVIDIA dedicated with at least 2048MB of dedicated VRAM and with at least DirectX 11 and Shader Model 5.0 support. AMD Radeon R9 285 and NVIDIA GeForce GTX 670 and above are recommended graphic cards. DirectX: Version 11 Storage: 4 GB available space Sound Card: Integrated or dedicated DirectX 11 compatible soundcard",
    "reviews": [
        {
            "review_text": "In this game, you are Serbian Stronk, professional Kebab Removalist.  You are defending Europe from stink turkman and other ISIS  You have access to machine gun and anti kebab rocket launch.   Kebab comes in many waves. you tell them, 'no Bulgaria for you, go back'  But kebab he doesn't listen, he is too busy with the allah snackbar. so you tell him with many bullets instead.   It is very enjoyable game, I like to play it while wearing Adidas tracksuit and squatting with bottle of vodka.  I am hoping I get chance to defend Berlin in Merkelstan in a mod one day, perhaps even Cuckholm, Swedistan.   Game is made by based polandball developer.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "It's a casual game, a rail shooter, mowing down neverending hordes of bad guys until your own inevitable demise. A generation ago, this would have been a coin-op game. No, it does not have overly sophisticated graphics or anything; it just delivers on its premise, offering a few minutes of pure mayhem when you have a half hour of downtime to spare.  The only thing everyone obsesses on is the fact that the enemies are IS (aka ISIS or Daesh). I do not understand why this is controversial. If this same game had Nazis as enemies instead, it would have had zero controversy. Hundreds of games (and movies) feature Nazis as convenient, easily disposed of cannonfodder that the heroes may slaughter without guilt. Why is it different with IS, when these guys are equally as irredeemablly evil as the Waffen SS? You are tasked with holding off the worst of the worst of the worst that humanity currently has to offer. There is literally no force on earth more evil than ISIS at this time, is there? What is the controversy?",
            "review_score": "1"
        },
        {
            "review_text": "build a wall around europe and make ISIS pay for it",
            "review_score": "1"
        },
        {
            "review_text": "When you put into consideration this is an arcade 10$ game, it is great! Most negative review either don't take this into consideration or are just negative because of political correctness. In all fairness, the game itself is responsive, glitch-free and realy fun to play. It's not the kind of game you'll get 100+ hours of, but you'll enjoy the time you will be playing it.",
            "review_score": "1"
        },
        {
            "review_text": "IS Defense is essentially perfect. An old-school pure arcade shooter, it feels like it should have the big plastic machine-gun hanging off the front. Wonderful adrenalin-fuelled action, and just enough strategy to stop the game being repetitive. There's no story, no plot (beyond 'kill bad guys'), no extensive dialogue trees, just fluid, heart-thudding violence.  Marvellous stuff - a genuine breath of fresh air, When so many games are vast boredom simulators, this is the quintessence of video games, distilled to utter purity.   Thank you. ",
            "review_score": "1"
        },
        {
            "review_text": "And now I'm voting for Trump",
            "review_score": "1"
        },
        {
            "review_text": "IS Defence: ~~~~~~~~~  The year is 2020. North Africa is now under the control of IS, who is gathering a large army to launch the invasion of Europe via the Mediterranean Sea. NATO headquarters knows the exact locations of the launch, and is in need of courageous soldiers to stand against the invader until the end! Soldier, it is time to fight for the free world! Sign here to enrol!  IS Defence is an action / rail shooter game where you take control of a NATO soldier who is stationed on a vantage point with his machine gun, and you have to kill as many invaders as possible until your glorious death. This game has three maps available to you: The Sicilians Shores, The Spanish Harbour and The Croatian Mainland. You will have to beat the first map to unlock the second, and the second map to unlock the third. To do so you will have to eliminate a specific number of terrorists and vehicles.   At the start of a game, you will be stationary with your machine-gun, a rocket launcher and a certain amount of ammunition. You will notice two gauges on your screen; on the left is the support gauge and on the right your health gauge. Each time you eliminate an enemy (soldier or vehicle) you will see the left gauge going up and each time you pass a certain level, you will be able to call on your support team for assistance, which includes: supplies, infantry, artillery, airstrikes and helicopters. On the other hand, each time you get shot, or a suicidal enemy soldier manages to blow himself up at your vantage point, your right gauge will decrease really quickly until you see a black screen, which will mean that it’s game over! Also, you will acquire skill points in each map and use them to either upgrade yourself, your machine gun, your rocket launcher or your support calls. I really like the progressive difficulty throughout each map of the game. You will find that the first couple of waves will be nice and simple to eliminate, but then you will need to know the right support combination to stay alive as long as you can. It will become a fast and furious game, and you will have plenty of fun.   Graphically the game looks good, with great explosions here, there and everywhere. Good sound effects, too! In my opinion, however, the soldier’s animations could have been better.   It is a short game - you will probably unlock the other 2 maps within 3.5 hours but you will surely come back to it over and over. It is a fun game.   Positives: ~~~~~~~   - Good graphics - Good skills tree - Fast, fun and addictive gameplay - Achievements and trading cards  Negatives: ~~~~~~~~   - Only 3 maps available - Soldiers animation could have been better  IS Defence is a fun and fast rail shooter, it will keep you shooting for hours!  8/10  Key provided by developer/publisher for review purposes. Any opinions expressed are entirely my own!    EPIC “THE CPT FROGGY” REVIEWS UP NOW ON ZEEPOND, THE HOME OF THE ALMIGHTY FROG!   [www.zeepond.com]     FOLLOW THE CPT FROGGY CURATOR PAGE HERE  ",
            "review_score": "1"
        },
        {
            "review_text": "Yes. Yes. And a million times: YES!  Delivered by the developers of the probably most controversial game 'Hatred' comes their newest work: IS Defense. So what is it about? In case you haven't noticed already, the game is set in a unreal (yet scaringly possible) future where ISIS has taken over north Africa and is starting an offensive against Europe. Your job is to stop them, one Bullet at a time...  (TL;DR in the end)  First things first, I don't like rail shooters. I don't like them at all. But this game does not feel like a rail shooter, more like a first-person tower defense, and it's totally AWESOME!   PLOT:  Your only task in the game is to pop some Jihadists. How? It's up to you. Unlike other railshooters (even though I won't count IS Defense as one) you don't just click with your cursor across the screen, instead you're placed on a stationary fortificated hill with a Machine gun (unlimited ammo, but magazine size of 200 shots) and a Bazooka (you start with 6 shots, you get more via supply drops, I'll get to them later), which can turn around 360 degrees.  Along with your weapons, you are given a variety of point streaks (Supply drop, Infantry support, Artillery support, Air support and Helicopter support). They are all feeding from the same score pool, that means if you call in a support, you will maybe not be able to call in a different one.  While you're mowing down the islamist invaders, you gain XP, which gives your character level ups. At each level up you get one point, which can be spent in your skill tree (4 branches: Player, Machine gun, Rockets, support), which works like most other skill trees (get the lower skills to unlock higher ones, the higher ones cost more points).   MAPS:  The game is really hard in the beginning, but the more games you play, the stronger your character gets, the easier the game gets. Then you unlock the next map, which is harder and requires you to rank up higher to beat it etc. I've only played the first 2 maps yet and I have to say that the developers did great work with them. I was expecting the maps to be the same with just a different look, but they aren't. While the first map is an open beach, the second map is a harbor. Where the first map was feeling hard first because of the wide field the enemies were approaching from, you will miss this wide open field in the second map. The enemies rush out of several buildings, stand on the roofs and rush around the corner with their armored cars (yes, they don't just have Toyotas with Machine guns).   ENEMIES:  The enemies vary from regular infantry, infantry with rocket launchers, suicide bombers, Toyotas and armored cars (at least I have seen so far) Watch out for the suicide bombers tho. They're easy to spot (red clothing, suicide belt and running directly at you without a gun continously shouting in Arabic) as long as all is chilled, but when the whole screen is full of enemies, you suddenly see a Kebab infront of your face and the game is over. Regular infantry will also throw grenades when they come close to you and run away when they're on fire. The enemy vehicles try to (and WILL) run over your infantry, watch out for them. When you shoot the driver of a Toyota while the car is in motion, the car will go loose, may run over people, crash into a building, drive into the ocean and die or just turn in circles until it explodes from the fire. All in all, the AI is perfect.   POINT STREAKS:   Supply drops: A dropship will drop a crate with either health or rockets into the combat zone. Shoot the crate to get it. Upgrades increase the crate number or the contents itself (like 100% health regen). My suggestion: stockpile your crates so you can shoot the health boxes when you need them instead of calling a drop when you're low at health and die.  Infantry support: My favourite one so far. This steak calls in a group of friendly soldiers (marked with a blue diamond) to fight the enemies. Not only do they help you get more kills, they also distract the enimes from you, giving you more time to fight more enemies, reload, etc. My suggestion: Use as much as possible.  Artillery support: Covers the combat zone with Artillery. Impacts are random and they might (and WILL) hit your allies too. Also the standard one is really short. My suggestion: Upgrade to the longer lasting artillery and when you use it, call in the infantry after the shelling is over.  Air support: Call in jets that nuke (not really) the combat zone. More effective but more expensive than artillery. My suggestion: Use it when you can affort it.  Helicopter support: Calls in an attack helicopter that attacks anything hostile on the combat zone. Destroys Toyotas in the blink of a second and really takes some weight off your shoulders. My suggestion: Use it when there's heavy enemy activity.   GRAPHICS/AMBIENT  The graphics are great, as you would expect it from a 2016 game. The game is running great on High-Ultra settings for me, only having massive lags sometimes when ♥♥♥♥ hits the fan but it only lasts a short moment and continues fluently afterwards. The explosions are realistic, shells are flying across the screen, blood, gore and corpses everywhere (you can set the body count in the options, I suggest 'unlimited' for the ultimae Kebab removal experience. The vehicles behave very realistic (like stated in the 'enemies' section). The game is really packing and you wil feel the adrenaline rush through your body while you're defending Europe from the terrorist invaders.   MODS  I tested no mods so far because the mod support just came in, but I expect some great stuff from you guys.   TL;DR This is the ultimate fast-paced first-person kebab remover game in the world. Get it. GET IT NOW!",
            "review_score": "1"
        },
        {
            "review_text": "The game is actually pretty good, specially for 7$ also your supporting a good cause, save europe cause they can't do it themselves ;)  The game is made by polish devlopers who believe in nationalism much like the rest of their country, sadly that mind set is lost to much of the EU, give them your money, they deserve it way more than EA ;)",
            "review_score": "1"
        },
        {
            "review_text": "Awesome Rail Shooter! However, I can see how it can get bland if you are not into repeating stuff in games, but it should be obvious that this game is not about any story. Once you upgraded your stuff, you become a lot more powerful. It is also better to get some of the more expensive perks first for maximum effect.",
            "review_score": "1"
        },
        {
            "review_text": "SO FUN.  Great arcade game with amazing graphics. So many bullets, explosions, bodies, blood, and destructable mayhem flood your screen.  Well worth the asking price, I only wish it had more missions but very replayble non-the-less.  I like the fact you can upgrade your base and support units. I hope developers make more games like this. First person tower defense war games.  RAT-TA-TAT-AT-TAT-AT-AT-TAT!!!   ",
            "review_score": "1"
        },
        {
            "review_text": "Shoot muslims, defend Europe. What's there not to like?  Allahu Akbar this!",
            "review_score": "1"
        },
        {
            "review_text": "tl;dr at the end  Destructive Creations are the guys behind Hatred. They got some hate because of it's controversy. You were literally butchering everyone around you. Now, tell me, would any other studio dare to touch such a topic and make a game out of it? No? Well, Destructive Creations did, and I love them for it.  But we are here to talk about IS Defense, not Hatred. So let's start. What is IS Defense? It's a game set in fictional year 2020. ISIS became so powerful their expansion got out of hand. You are playing as a NATO MG operator and your mission is to defend different positions/shores of Europe.  Is it any good? Yes, it is.  Let's start with the price. 6,99€, £5.50, $7.99. Is it worth the price? YES! Come on, it's cheap, and it's good. Graphics. This game is using Unreal Engine 4. Does it look good? Well, you guessed it, yes! How does it work? Pretty good. Even on my old GTX 550 Ti it runs well. Gameplay. It's a on-rails shooter. You can't move, but you can rotate your turret, so the enemies are coming from every side, 360 degrees action. Sound design is pretty nice as well. The sounds are well-made. You also have upgrades which you unlock by killing enemies. They are really important and without them you probably won't win. The only problem with this game is, in my opinion, the AI. You can call in reinforcements and sometimes they will literally stand in front of you and block your view. Same with the enemies. They will just stand there like ♥♥♥♥ing idiots.  So basically, this game is very, very good. Especially for it's price. Like literally, you get around 15 hours of fun (at least that's how much i'll be expecting when i finish the game) and it's cheap as hell.  People may hate this game because you are killing MUSLIMS, and will call you a racist, but what they don't understand is that when they say that, THEY are the racists, not you. IS members are not only Muslims. Get your facts straight before saying something like this. So, people that call everyone that likes this game racist, please kill yourselves, because you are racists, not us.  That's it.  tl;dr Solid on-rails shooter with upgrade system for your character, your gun and special 'skills'. Cheap and worth it. Lasts for 10-15 hours. NATO against IS (Islamic State aka terrorists).",
            "review_score": "1"
        },
        {
            "review_text": "A good way to relieve the stress of the day. well worth the money. They just keep coming so you just keep shooting. Shoot a lamp post and watch it land on the bad guys more dead to add to your total and you used less rounds. As long as you keep them away from you you will be ok but watch out for the body vests.",
            "review_score": "1"
        },
        {
            "review_text": "Wolfenstien: Killing Nazis DOOM: Killing Demons IS Defense: Killing ISIS  Conclusion: Never repetitive.  The skills are awesome, the gameplay is non-repetive and a hell of a lot of fun, the violence is brutal, the graphics are gorgeous and most importantly of all, you get to kick ISIS' ♥♥♥! Destructive games could be the next Rockstar Games. And that's a good thing.  10/10 Now i'm crossing my fingers for a zombie spinoff. That would be awesome.",
            "review_score": "1"
        },
        {
            "review_text": "IS Defense makes arcade shooting great again.  It's not without its faults. The game is more in the leveling system than it is in score chasing. But the shooting and destruction is so good. It's what we THOUGHT we were getting with Just Cause's destruction and blasting.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a ton of fun!  It may be simple, but this is a kick-back and relax kinda game.   Definitely worth it.",
            "review_score": "1"
        },
        {
            "review_text": "For the price, I'm very happy. The game is exactly what it looks like in the video and screenshots. It's very simple. Blow the sh*! out of the enemy.   Put on some Burzum, load up the game, and kill 15 minutes and a lot of terrorists. Repeat. I'm looking forward to new maps and whatever else people come up with to kill. Fun little game, great devs.",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best arcade-style game made within the past ten years. Absolutely perfect.   10/10",
            "review_score": "1"
        },
        {
            "review_text": "Game everyone's been waiting for.  Update: This game is just all out ♥♥♥♥ing chaos when you've unlocked all the perks... ♥♥♥♥, calling air strikes never felt so good! Before anyone tells me I'm Islamaphobic, the quran is a ♥♥♥♥ ton more violent than this game and no, this game doesn't condone killing 'muslims' however the quran DOES endorse killing none believers... before calling me a liar, read the Noble Quran like I have... that's not saying ALL muslims are violent or terrorists, the HOLY Quran is much more civil.  This is slaughtering TERRORISTS with suicide vest and guns, not peaceful Muslims... more than ANYTHING it's a game.  Peace.",
            "review_score": "1"
        },
        {
            "review_text": "This is an awesome game, reminds me of some of the old school shooters.",
            "review_score": "1"
        },
        {
            "review_text": "Beach Head clone with beautiful graphics, destructible environment and amount of explosions that would make Michael Bay proud. Support system is great, upgrades increase strength and spectacularity of weapons to ridiculus degree. Waves of enemies attack in random sequences, and their numbers increase as player earns more upgrades, so it never gets too easy.  Favourite level: Harbor",
            "review_score": "1"
        },
        {
            "review_text": "Honestly if you ever played Beach Head. this is a fun time wasting hold the position shooter.  Game play is fun and hardly any bugs none in my play time and I have beaten it already and max skill point and its honestly still fun to play to see how long you can hold out.  For the 8$ price tag its worth it very much so.",
            "review_score": "1"
        },
        {
            "review_text": "I have to say I expect less of this game then I got off it. A stationary shooter nowadays may seem like a boring game, however, be fooled not! this game is action packed, and it can get very intense both in excitement and difficulty.   Graphics: 8/10  Sounds: 7.5/10 (nothing really stands out)   Gameplay: 8.5/10  Story: N/A ",
            "review_score": "1"
        },
        {
            "review_text": "A good terrorist is a dead terrorist 11/10",
            "review_score": "1"
        },
        {
            "review_text": "make war, not love!  And make a DLC, or a mod where we can shoot femen with ♥♥♥♥♥, thx!",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Would kill Scooby Doo again!  Action packed game, at max settings looks gorgeous, it really looks like a very expensive war movie with all the explosions, particles and smoke.  The downside is that it has very few levels, you have to do some grinding to level up your skills (not that bad though), but it works and more games like this one are really needed on steam.",
            "review_score": "1"
        },
        {
            "review_text": "IS Defense,  As the name says, puts you in a defensive position behind a fictional LMG. The objective of the game is as simple as it can be entertaining. Hold your ground as long as possible. This game is very similar to P.O.W., Operation Wolf, Vietnam Gunner, Beach Head etc. The genre is as old as computer gaming and it hasn't lost its glory. That is, if you like those kind of games.  So what is there actually to do? 1) Take out as many targets as possible before dying. 2) By destroying targets you gain round based and persistent experience points. 3) Persistent Experience points can be used to acquire permanent upgrades. 4) Round based experience points are used to call in power ups, or allied aid through soldiers, planes, arty and helicopters.  The presentation is more than adequate. The Sound effects and narration are good.  Final verdict: If you're offended by the name of this game then you shouldn't be on Steam, which is a western product, in the first place. Besides of that, IS Defense is a stationary turret defense action packed ride that delivers for its low price.",
            "review_score": "1"
        },
        {
            "review_text": "Short fun game where you get to mow down ISIS ♥♥♥♥♥♥♥s.",
            "review_score": "1"
        },
        {
            "review_text": "Beach Head 2016",
            "review_score": "1"
        },
        {
            "review_text": "Yeah, it's pretty simple and you don't do a whole lot besides sit there and shoot at things. But the game looks pretty/runs great on my machine, the reinforcement/support system is nice, and blowing up the little boats is REALLY satisfying. My advice is upgrade your machine gun as it makes the game way more fun when you a) don't have to reload every five seconds and b) can actually blow the ♥♥♥♥ out of things instead of pouring ammo into a truck and waiting years for it to finally blow up.   8/10, simple game without much variety but really, really fun.  P.S. I guess some people could view this game as offensive. But it's not like you're mowing down innocent Muslims and the game is telling you that Muslims are bad or something. The game makes it very clear that you're fighting ISIS only and if you think it's offensive to make a game about mowing down ISIS terrorists I think you need to adjust your definition of 'offensive.' It's basically like if someone made a game where you just shot Nazis. No one would have a problem with that, right?",
            "review_score": "1"
        },
        {
            "review_text": "Man I dont know what it is about this game but i love it. Maybe because for me it reminds me of almost an arcade style game. whatever it is I enjoy it. its pretty straight forward. you are a gunner and you kill people. pretty simple really. there is a skill tree for your weapons. but who cares mindless fun for everyone.",
            "review_score": "1"
        },
        {
            "review_text": "i love playing this game always wanted a game that lets u kill islamic terrorists",
            "review_score": "1"
        },
        {
            "review_text": "This game is a blast if you like the beach head games from 2000 you will love this, price to entertainment value is unbeatable, cheaper than going to a movie.  Roleplaye as an American, saving EU again, Merica Merica Merica!",
            "review_score": "1"
        },
        {
            "review_text": "It's okay for the cost. Worth more than a similarly priced fast food combo meal.   It's a simple yet challenging static defense game, which plays like it belongs in an old school arcade. No, it's not a rail shooter. This train ain't going anywhere unfortunately.  Pros:  Kill Islamic State. 'nuff said.  Pretty graphics, lots of fire and explosions. The smoke, mist, and vegetation obscuring the battlefield give it a realistic feel that makes you question if the daeshbags are coming. (get UAV skill to end this problem)  Gets challenging and strategic. You have to deal with flanking attacks, and balance your supply, infantry, artillery, airstrike, and chopper support. Decisions have to be made very quickly.  The real time leaders board that updates as you play. Good call.  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~  Cons:  Too short. There's only three levels.   AI is stooopid, even considering that they're daeshbags. Drivers will run over their own infantry, and crash into things. Vehicles don't move intelligently, they seem to just follow a set path and smash through anything in the way. Enemy and friendly infantry make no use of cover and concealment or even keeping one's head down.  There's only a few enemy types I've seen so far. Infantry, suicide bombers, trucks, humvees, and the three different landing boats. When you play your first game you'll see all of them. Nothing new to see through game progression except the two other maps.  Debris piles up and clutters the battlefield pretty badly. This is a good feature sometimes, but annoying when an enemy truck parks behind a pile of blown up vehicles and can't be hit. Also messes with enemy vehicle pathing. It looks silly when infantry are standing on top of a wrecked truck engulfed in flames and don't even notice.  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~  Wishlist:  More maps.  More enemy types. Tanks, rocketeers, car bombs, armored personnel carriers, etc. Make advanced infantry that throw grenades if they get too close.   Make it an actual rail shooter. Do convoy security. Have to protect the friendly vehicles in the convoy until they get to their destination. You could string along the missions and incorporate a light storyline instead of making them all a fight to the death. Ideally this entire game would be just an added survival mode feature while a campaign mode made the bulk of the game.  I hope you incorporate such into sequels/expansions.",
            "review_score": "1"
        },
        {
            "review_text": "Badass based game  ♥♥♥♥♥♥♥♥♥  14/88",
            "review_score": "1"
        },
        {
            "review_text": "a bit short but defently worth it for 6,66 ( ͡° ͜ʖ ͡°)  for some reason leaderboards don't seem to work for me , if anyone has a fix for it idd really appreciate it (tried reinstalling the game, turning the firewall on/off , looked if it's not blocked, ran it as a administrator)",
            "review_score": "1"
        },
        {
            "review_text": "OUT. ♥♥♥♥ING. STANDING. A feel that you are actually getting to do something about the muslims that are invading every European country and America. Kebab removal at it's greatest.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Five problematics out of five.  Deus Vult!  In all seriousness, this is a surprisingly polished game. There isn't a lot to it, structure-wise: you have three levels and four skill trees, and you use a machine gun, rocket launcher, and five different support abilities to destroy waves of attacking soldiers and vehicles. It's very reminiscent of classic arcade games, both in its structure and in its difficulty.  Its simplicity works in its favor, given how the game progresses. You aren't just completing a stage by defeating X waves of enemies and moving on to the next; your objective is to last as long as possible against an increasingly intense assault, with your eventual score ranked according to both your number of kills and the length of time you spent alive. At the beginning of the game, you're going to die early and often, but as you play, you rack up skill points which you can invest into persistent upgrades across attempts.  As you unlock increasingly powerful abilities, you find yourself able to last just a little bit longer each time, and there's a real element of challenge involved in learning how and when to use your support abilities as well as what to prioritize and when. The real challenge of the game is not to finish all three maps (which will happen pretty much no matter what, as 'finishing' a map is as simple as racking up a certain number of kills across your playthroughs), but to push yourself to see how long you can last. And you will eventually lose: like the recently released Devil Daggers, 'winning' just means getting further than anyone else before you bite it.  My main criticism is a lack of enemy variety: there are normal old soldiers, suicide bombers, technicals, humvees, and three types of landing craft (pontoons, and small and large troop carriers). I'd have liked to see more, different types of soldiers (engineers, grenadiers, machinegunners) or enemy air units. But for the price, and the amount of visual spectacle going on, this is an easy recommendation for a few hours of relaxing rat-a-tat.",
            "review_score": "1"
        },
        {
            "review_text": "Great game to pass the time and also good for the casual gamer. Has a good learning curve with a great challange. Graphics are great, and well optimized for lower end systems. If you were a fan of Beachhead back in the day, then relive the nostalgic classic with an updated touch. Recommended",
            "review_score": "1"
        },
        {
            "review_text": "Where most shooters have you fight Russians, WWII Nazis, or otherwise fantastical enemies (demons, aliens, private military companies, etc.), IS Defense calls out against a clear present danger: the Islamic State of Iraq and Syria. I commend Destructive Creations, my is that the Mainland level that takes place in an airfield is slightly bugged.",
            "review_score": "1"
        },
        {
            "review_text": "While it does little to eradicate the real IS it is always a nice complement. Feels good to erase this hate religion from the face of earth sending these cavemen rapists back to where they belong.",
            "review_score": "1"
        },
        {
            "review_text": "It's good.",
            "review_score": "1"
        },
        {
            "review_text": "Ben Garrison mod when?",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome!",
            "review_score": "1"
        },
        {
            "review_text": "Rail shooters are dead. Extinct. For a good reason. It's just an obsolete genre. Uninventive, boring, lazy. But somehow... Destructive Creations is trying to sell us one. This one is with a twist! Defend Europe from terrorism. A bit of controversy, to fuel the sales. It won't help. IS Defense is plain boring. Game developers didn't even bothered with designing proper levels. Every stage is just a survival with inevitable death at some point. You can't win. You just unlock next stage when you kill designated number of Islamist terrorists. Great design, no skill needed. You can just play the level over and over again... Eventually, you'll stack up the necessary kill numbers.... And next level. Same thing. Wow, you need to be such lazy to design such a bland mechanic...   On The top of that - shooting can be fun. For... Few moments. Explosions, overall mayhem - it's cool. For 15 minutes. Mostly after few minutes of gameplay the screen is filled with wrecks ., flames and dead bodies - it's hard to see something.Then suddenly you just die. Enemies just overwhelm you. Enormous fun.  Don't bother. Rail shooters are dead. IS Defense maybe is technically a decent product. But content-wise? Gameplay-wise? Lacking. Hollow. Old.",
            "review_score": "-1"
        },
        {
            "review_text": "First of a game where you shoot isis in droves...F!@#ing love it. Its similar to the old Beachhead games, but with better graphics, You'll get the warm fuzzies while playing this i know i did! If you like unapoligenicly shooting terrorists in the face and blowing them up from a bunker...then you'll love the hell out of this.",
            "review_score": "1"
        },
        {
            "review_text": "i like the game awsome the only problem is that there is no other lvls or even a zombie lvls DLC why not",
            "review_score": "1"
        }
    ]
}