{
    "app_id": 448400,
    "name": "Hidden Object 6-in-1 bundle",
    "release_date": "2016-03-16",
    "developer": [
        "Alawar Entertainment"
    ],
    "publisher": [
        "Alawar Entertainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Casual"
    ],
    "tags": [
        "Casual",
        "Hidden Object",
        "Point & Click"
    ],
    "achievements": 0,
    "positive_ratings": 82,
    "negative_ratings": 17,
    "price": 8.99,
    "description": "Following titles are included to this bundle: Cruel Games: Red Riding Hood: Kronville: Stolen DreamsPanopticon: Path of Reflections: Lake House: Children of Silence Collector's Edition: Other Side: Tower of SoulsMexicana: Deadly Holiday",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/448400/header.jpg?t=1479807441",
    "minimum_requirements": "OS: Windows XP or later Processor: 1.4 GHz Memory: 1024 MB RAM Graphics: 512 MB DirectX: Version 9.0 Storage: 5 GB available space",
    "recommended_requirements": "OS: Windows 7 or later Processor: 3 GHz Memory: 2048 MB RAM Graphics: 1024 MB DirectX: Version 9.0 Storage: 5 MB available space",
    "reviews": [
        {
            "review_text": "A small price for a very good bundle.   One of the game has collectible and achievement Great stories fo far. ( Played 4 of them) ",
            "review_score": "1"
        },
        {
            "review_text": "6 Hidden object games with actually interesting plots. Some of the objects and clues are a little hard to figure out but with enough patience and that magical 'Hint' button all is well.   - These games take approximatly 1-3 hours to complete a peice. - The stroylines follwe fairytales and folklore (which is done very well)",
            "review_score": "1"
        },
        {
            "review_text": "Good bundle of 6 Hidden Object games, all of them with good graphics and interesting (but not original) stories. Lots of locations, puzzles and HO scenes. Achievements are in-game only.",
            "review_score": "1"
        }
    ]
}