{
    "app_id": 448510,
    "name": "Overcooked",
    "release_date": "2016-08-03",
    "developer": [
        "Ghost Town Games Ltd."
    ],
    "publisher": [
        "Team17 Digital Ltd"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Local Multi-Player",
        "Local Co-op",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Casual",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Local Co-Op",
        "Local Multiplayer",
        "Co-op"
    ],
    "achievements": 12,
    "positive_ratings": 6653,
    "negative_ratings": 650,
    "price": 12.99,
    "description": "Overcooked is a chaotic couch co-op cooking game for one to four players. Working as a team, you and your fellow chefs must prepare, cook and serve up a variety of tasty orders before the baying customers storm out in a huff.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/448510/header.jpg?t=1551708588",
    "minimum_requirements": "OS: Windows 7 (32-bit) Processor: Dual Core 2.4Ghz Memory: 2 GB RAM Graphics: GeForce 8800 GT / AMD HD 6850 / Intel HD Graphics 4400 or above DirectX: Version 11 Storage: 750 MB available space Sound Card: DirectX Compatible Sound Card Additional Notes: Gamepads Recommended",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I played it with my wife... for 30 minutes... who hates when I play video games. She yelled at me for getting in her way in the kitchen.  9/10, would get yelled at again.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazingly fun, but why didnt you guys add online co-op? this game would be an amazing hit on steam if it had that and not just local co-op I mean its not to late to add it stil, and i recomend you do, since allot of people are friends with people *online*. ",
            "review_score": "1"
        },
        {
            "review_text": "Since I'm unable to give a neutral vote, I'll go for thumbs up.  The game itself is really fun; is a nice fast-paced cooperative where communication is the key between a good score and total chaos.  But there are few elements that make this game not worth 15 bucks, like controls that are a little cluncky and the campaign that doesn't last much. But, most of all, the fact that is local coop only kill the replayability.  To sum up:  It's fun and worth a try, but if found on sale (and if you have friends to play with!).",
            "review_score": "1"
        },
        {
            "review_text": "My boyfriend and i saw this game being played on youtube.. Instantly i bought it and so did it.. The people playing it were having so much trouble that it was painful to watch. So we played it together and have beaten everything with 3 stars.. even going back to it every couple days to play it some more.   - Would love to have it opened up to online play.. as its sometimes hard to find 4 people. - Would love a game editor for the game.. so we can make our own levels... - Would love more and more levels.. really i just want to play this all the time.. ALL THE TIME  More DLC.. More.. MORE XD..  Please.. i just want to cook ^_^",
            "review_score": "1"
        },
        {
            "review_text": "pros -  - fun, novel gameplay - perfectly suitable for two players, difficulty scales pretty well as you introduce more people than that - battle mode adds a little bit of replay value to campaign - campaign is a decent length for a co-op indie game (i beat and perfected in 6 hours) - frustrating but a well-crafted learning curve makes for satisfying experience  cons -  - i would have maybe liked a little more content coming from a game at this price point. i understand that it's obviously an independent production, but i eventually reached a point with my friend where the game became very easy. since i've perfected achievements, i don't see much reason to go back into the game. sort of shallow, but nothing that detracts too much from the overall game.  ",
            "review_score": "1"
        },
        {
            "review_text": "make a map editor for this game",
            "review_score": "1"
        },
        {
            "review_text": "Buy this only if you have a lot of friends with you nearby, but it still a good game, through...But I don't have a lot of friends, so I ask for a refund. They really need to add online multi-player mode or this would be a waste!",
            "review_score": "-1"
        },
        {
            "review_text": "Absolutely fantastic co-op game with fun gameplay and gorgeous graphics. Not great for singleplayer but definately worth it for playing with friends locally. One of the best games i've played all year.  Needs multiplayer online!",
            "review_score": "1"
        },
        {
            "review_text": "OMG So much fun!   McDonalds simulator with lava,ice, and pirate ships!  If making sandwiches while yelling at friends who are slow is your thing- You should play this game- or apply at Mcdonalds.  Me and my wife are getting a divorce though because she kept throwing out our cooked hamburgers after I did most of the work to make it.",
            "review_score": "1"
        },
        {
            "review_text": "I like the game so far but would love native online support! They don't need to host a server to do it if they can just add the feature that the host of the lobby can be the host the server it would dramatically improve the game. The game as it stands would be an awesome free game, also mobile game, but without the online features its probably not worth that much money but hey thats just my opinion. I will still recommend the game for just in case they add the online feature. I don't like using third party software just to play a game online with friends.",
            "review_score": "1"
        },
        {
            "review_text": "The purchase button is up there silly! :D",
            "review_score": "1"
        },
        {
            "review_text": "The only game I can play as well with my girlfriend, my friends or my colleagues.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a well made game that brings a new experience to gamers. Definitely recommend to anyone who is remotely interested in the game to play with friends.  Edit1:  Just beat the whole game and got all the achievements. It was pretty fun, and I got 12 hrs of gameplay out of it, which is satisfying. However, the story was dull; sometimes you'd select the wrong thing when interacting with counters, and some levels were strraight up infuriating.   But still, when you get to play this game with friends, it's a rollercoaster you want to take. It fun and you get a kick out of it when you watch your friend burn down his side of the kitchen.   Would recommend, but that isn't to say that this game can't use a bit more features. I would like to see an online mode for some competitive gameplay between my friends at home and others on the web. I would also like to see a sort of endless mode.",
            "review_score": "1"
        },
        {
            "review_text": "I think I've rolled off the car about 40 times with the raccoon in the wheelchair. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I have 3 mates to play with locally so the online multiplayer isn't a concern for me - Can see why people want it, but honestly this game thrives as a couch-multiplayer.  We've been playing it over our lunch breaks and after work and it's been a blast. Really easy to get into, fun art style, really inventive levels that show you just how much mileage you can get out of some well considered gameplay and modular assets. The first time you play some levels with unique mechanics really surprise your group, and the frantic scrambling gave us a lot of laughs. We'll be playing this one for a while.  Only gripes are that sometimes joysticks can feel 'stuck' in a direction even when not pushing the stick, and the pop-up icons over ingredients can overlap other ingredients if they're stacking vertically on screen.  Small quips aside, this game is really fun and greatly rewards co-operation and optimizing your flow (competitive maps are great too).  :D",
            "review_score": "1"
        },
        {
            "review_text": "Figured it would be local gameplay as per the trailer and gameplay preview I saw (nowhere did they feature online multiplayer). Was not really designed for single player in my opinion (having to control two characters). As for the game in local play: awesome! Had a lot of fun and definitly recommend it to anyone wanting to play with friends/loved ones/family!",
            "review_score": "1"
        },
        {
            "review_text": "Overcooked in my opionon is the BEST local Co-op game on steam! Not only is the game play addicting it also provides a reasonable challange for you and your friends to overcome. The game requires a high level of communication and co-operation that you don't find in many other games. I would definitly recommend this game!",
            "review_score": "1"
        },
        {
            "review_text": "UPDATE TO BELOW REVIEW: The devs came through and fixed the dead-zone issues and it feels like they generally tightened up the controls. Feels great now! Finally, I have absolutely no problem recommending this game. My daughter and I can now play local co-op without having to quit in complete frustration over our characters just walking off on their own while we are having a great time doing a run. Nothing ruins a game quicker than bad controls, and this game no longer suffers from that issue. Thank you, Devs!   (ORIGINAL REVIEW) I'd really love to recommend this game, but given the absolutely horrible control for this game with the most common controller used (360), I just can't. To make this even more frustrating, this is basically a game made primarily for couch co op. Why would a game of this type not have addressed this issue already? Get on the boards and you'll see legions with the same issues with controls. Mystifying. Nothing appears to be being done to address this issue. This game also requires precise movement and your character will just walk off in its own direction throughout the entire session on all controllers being used simultaneously. There are no dead zone options to adjust this available in-game. Such a huge disappointment, because it's such a fun game...absolutely ruined by horrible controls and apparent horrible support. Don't buy until this gets addressed. I'm skeptical that anything is currently being done to address this. Again, hugely disappointing.",
            "review_score": "1"
        },
        {
            "review_text": "Game is a blast if you are able to have 3 other friends in the same room to play, I feel this game is perfect for the steam link in my living room . Nothing like a little co. opp mayhem",
            "review_score": "1"
        },
        {
            "review_text": "This game gives you one easy questions to ask yourself to decide if you want the game or not. 'Do you have a friend to play with locally?' If yes then get this game and you will have a blast. If no, then go make a friend and buy this game and play with your new found friend.",
            "review_score": "1"
        },
        {
            "review_text": "Overcooked is a hilarious and fun game. Would recommend to anyone looking for a challenging and silly couch co-op!",
            "review_score": "1"
        },
        {
            "review_text": "The co-op multiplayer in Overcooked is great. The main reason I'm writing this review though, is to give props to the keyboard + controller support. The game has built in DS4 support and there's zero hassle to go into a local multiplayer game using a combination of keyboard and controllers. I just realized this is not a trivial thing to make possible, because I tried playing other multiplayer games and it is maddening to get this to work with most of them.  As far as the game itself, it's fun to frantically run around grabbing ingredients, chopping them up, etc. while screaming at your friend(s) to PLEASE GET ME ANOTHER POTATO AND OH NO WE'RE OUT OF PLATES PLEASE CLEAN SOME! While it can get tough, it's not too hard to go through the levels. If you want to get 3 stars on all of them though, that's a different story.",
            "review_score": "1"
        },
        {
            "review_text": "Haven't laughed this hard in a long time. And the first non-MarioKart game that my gf's asked to play again. Repeatedly.   Out of context, or for anyone listening to us screaming at each other 'I NEED MORE LETTUCE!' or 'DO THE BLOODY DISHES, I NEED PLATES!' must sound odd, but it's the only way to play it.   The art style is gorgeous, the music is whimsical and entirely appropriate.   And this is all the more fantastic when you realise it was made by two (count 'em, two) human males.",
            "review_score": "1"
        },
        {
            "review_text": "Hello! I know this game was recently released so there's going to be a few tweakings here and there. This game's cute and the objectives are awesome, sorta like cooking mama. I hope that you do make the cooking more complex, as just to finishing the dishes asap. Maybe adding mini games with the food, like 'gathering ingredients' race. Or something like that you know? And I hope that you will add a multiplayer (friends on steam invite) soon, because my friends and I bought this game, having the intention of playing together in mind! I know it will be a lot more popular once it gets these things in! Hope to see you update or reply soon!",
            "review_score": "1"
        },
        {
            "review_text": "*Second helpings please!*  Overcooked may be a simple concept, but it is tons of fun and quite challenging! Overcooked has a great atmosphere and my other-half and I were immediately hooked. It is by far the best Co-op we've played and we couldn't help but binge until we had finished the whole game (everything with 3 stars of course) in about 2 days play time (8.8 hours total - so not your average per day play time perhaps - I did say binge)!   That said I do have one negative comment regarding the game - and that is that there have been some minor glitches on a lava level; and we had a hard time on a glacier level (as well as a glitch) due to the player area being a bit smaller than the actual floating glaciers... other than that the game has played very well.  We look forward to challenging other friends in the verus (which we have not yet played).   So when is the expansion coming out?! We are seriously hungry for more!",
            "review_score": "1"
        },
        {
            "review_text": "Genious, absolutely! But without online connections its potential is about 50%. This game deserves more. all game modes are shouting for it. Dear devs, do yourself a favor and bring online mode to life. Your game will explode in any imaginable directions. Many people are waiting just for this mode and are holding back at the moment to buy this game ;) For example, i know about 6 people like that.  Dont let us wait too long and make your awesome game a PERFECT game :)",
            "review_score": "1"
        },
        {
            "review_text": "Great game when we can get it to work. For some reason it forces me to pick a second character even when I am playing with other people. Unless I have three friends playing with me, I aways have a lemon character sitting off to the side mirroring my movements and sometime hindering game play (picking things up when I do). As amusing as this sometimes can be, I haven't gotten very far because of it. I also hope that one day I will be able to play online with my friends. Getting everyone to my house at once for a game is a pain sometimes with conflicting schedules. Other than those issues, great game. If I can figure out how to stop it from forcing me to choose a second character it would be an AMAZING GAME. I'd reccommend it to anyone.",
            "review_score": "1"
        },
        {
            "review_text": "My brain. It hurts. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Hey this game looks fun, lets get some frends to play it. *an hour of screaming later* 10/10",
            "review_score": "1"
        },
        {
            "review_text": "this game made me want to kill myself when i played with my freinds. 10/10 would chokehold brother again.",
            "review_score": "1"
        },
        {
            "review_text": "This game has alot of Bugs, constantly cashing also couldn't even finish the last level because they didn't offer you a Pizza plate so ur stuck with a cooked pizza with out a plate so there for couldn't be finished.....",
            "review_score": "-1"
        },
        {
            "review_text": "Collapsed in tears laughing as my daughter failed to extinguish a fire that destroyed our kitchen.",
            "review_score": "1"
        },
        {
            "review_text": "This game is very hilarious! It isn't very difficult but you'll end running to anywhere and a bit stressed, but it's really fun. You can played with anybody and it is a good choice for you couch games library.  Best: - Really coop - Entertaining. Really funny. - A bit challenging. - You can share each gamepad with another player.   Worst: - Music, terribly repetitive. - A bit short campaing (around 45 stages). - Control by joystic. It's difficult select what you want (It's a part of the fun too). - Not adaptation to number of active players. Some stages are clearly design for 4 players and too difficult for 2 players.  Really good experience.",
            "review_score": "1"
        },
        {
            "review_text": "Now I know why Michelin-restaurant's crave that third star. Because it fulfils their dreams and just feels so damn good.  Buy it.",
            "review_score": "1"
        },
        {
            "review_text": "A great game for couples, a great game for team-building.  A must own for people who love playing co-op",
            "review_score": "1"
        },
        {
            "review_text": "Awesome and funny game, it can make you see (and also help) your team abilities. It'll be more cool though, if it had multiplayer online ; ) (just a though)",
            "review_score": "1"
        },
        {
            "review_text": "Fun and chaotic. Try not to scream at the wife too much or you might be sleeping on the floor. Great couch game. Definitely recommend playing with a controller. No issues / bugs yet. Hopefully dev keeps adding more levels in the future.",
            "review_score": "1"
        },
        {
            "review_text": "Play game. Eat pie.",
            "review_score": "1"
        },
        {
            "review_text": "It's a great game, but... ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ONLINE CO-OP! ????",
            "review_score": "1"
        },
        {
            "review_text": "I really hope for an update to this, as it is currently unplayable for me. There is no way to calibrate the controller sensitivity and because of this the little chefs run incessantly. I can't get the guys to stand still and chop. It's a shame because it looks like it would be a fun game.",
            "review_score": "-1"
        },
        {
            "review_text": "Overall, I was very unhappy with this game. Given the right parameters, the game could be exceptional but the requirments that need to be met aren't exactly accessible.   Even though this game is listed as a single-player game and technically offers a single-player experience, the single-player mode is horrible. When playing single-player mode, you have two chefs which you control and have to switch between by pressing the shift button. This makes the game basically impossible as it takes you two to three times longer to do any task (that is if you can even master playing with the wonky control mapping) and there are no adjustments to make the game more practical for a single-player. It's definitely a co-op game only but like others have said, unless you have multiple controllers or (PC) computers and people in your house that's not exactly viable either. They really should have opened this game up to online multiplayer. Also, I have both Mac and PC but all my friends seem to only have Mac with exception of a few... But they don't live close enough to play so... I basically bought a game I can't really play. I thought I'd at least be able to play single-player but it's just so badly done there's really no point in playing.  Pros: -Cute game -Great in co-op mode  Cons: -Not easily accessible (Mac users, online multiplayer) -Not even a half-hearted attempt seemed given to single-player mode functionality -Keyboard controls are horrid (no option to remap controls unfortunately) -Would need multiple computers and/or controllers in 1 house to play -Too expensive for a game with such limitations on its play",
            "review_score": "-1"
        },
        {
            "review_text": "As a Pastafarian I find this game appeasing.",
            "review_score": "1"
        },
        {
            "review_text": "Currently not multi-player.",
            "review_score": "-1"
        },
        {
            "review_text": "needs online multiplayer. Single player is just not fun and couch co-op is good, but could be much better. The game lacks 2 player keyboard as an option and online multiplayer where this game should have clearly gone after playing it, it makes the devs look frankly lazy that they didn't put a common parts of gaming into a game built on co-op.  don't bother with this game until online comes around, it's a waste of money, at least on steam, until then.",
            "review_score": "-1"
        },
        {
            "review_text": "Finished the story solo without trying to 3 star every map. I think I ended up about 3 stars off from completion before I made a new save to play with my husband. We finished the game with all the stars in about ~5-6 hours across two sessions. The only times we were really restarting to get 3 stars was when we kept falling off the ice then breaking down laughing.   The versus mode seems like it'd be great with a lot of friends to have competitions! Defintiely going to try playing this game with more people when I can!  While it's a really fun game, I wish there was a bit more to the story mode. Recommend you try and get it on sale. Despite the low price, it's a pretty short game to complete if you're any good at time management games.",
            "review_score": "1"
        },
        {
            "review_text": "Great Co-OP fun for all gamers, recomended 2+ players, though single players allows for use of 2 different characters. Great game all around!",
            "review_score": "1"
        },
        {
            "review_text": "Stellar game for its simplicity, and I love having a genuinely cooperative game to play with my girlfriend in the evenings. We've also managed to rally a full four player game a few times, and the chaos is something else. That said, the single player is a little lackluster, in that it's both extremely demanding and also a little clunky, in my experience.  One word of warning, if you intend to add additional players: make sure you have a controller for everyone. This game almost destroyed a relationship because our friends had to share a controller!",
            "review_score": "1"
        },
        {
            "review_text": "Really good game, reward team works and is very addicting.",
            "review_score": "1"
        },
        {
            "review_text": "Played co-op with girlfriend, Ended up solo.",
            "review_score": "1"
        },
        {
            "review_text": "really hard to play with no friends",
            "review_score": "1"
        },
        {
            "review_text": "Fun Couch Co-Op Game, Not fantastic for single-player. Also it helps to have at least two controllers.",
            "review_score": "1"
        },
        {
            "review_text": "Most couch coop fun I had in a long time. Slick controls, easy to pick up. Mastering 3/3 stars on every level can sometimes be tricky, but never unfair.  Edit: Ok, the last level (boss) is really getting on my nerves. Could not beat it with my SO till now.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game to play with friends on the couch",
            "review_score": "1"
        },
        {
            "review_text": "Game is great. Always pull this game out to play with friends and family and you can easily add controllers to play.",
            "review_score": "1"
        },
        {
            "review_text": "Thsi is definitely one of the best coop family games I've played in years! The gameplay is simple enough for school kids, and you can have four players sharing the same screen - we've actually did it, you just need enough game controllers for that.",
            "review_score": "1"
        },
        {
            "review_text": "I never thought onion soup would test my friendships this hard.  10/10 would throw soup in trash again.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game that truly shine in multiplayer, if you want an exuse to have an argument you have a very good one here! Money well spent and well done for the idea!",
            "review_score": "1"
        },
        {
            "review_text": "Very awesome game. Fantastic idea. Very fun to play.  I wish more games based on this idea come out.  Few feedback problems:     The last 4 levels is almost impossible to archive 3 stars on single player. Need patch     The last level lags alot.   ",
            "review_score": "1"
        },
        {
            "review_text": "One of the best local co-op games I've ever played. My girlfriend also loves it, and has only screamed at me two or three times while playing. 10/10.  (Please release more levels!)",
            "review_score": "1"
        },
        {
            "review_text": "Really fun and addicted game to play with friends. IF I HAVE ONE",
            "review_score": "1"
        },
        {
            "review_text": "My Wife and I love playing this together!!! Using a steam link with 2 controllers and it works great :D",
            "review_score": "1"
        },
        {
            "review_text": "One of the best couch co-op games i've ever played! HANDS DOWN! We've played this 3 days in a row on my lunch break. 4 player, 3 player, 2 player. Introduces you slowly to the mechanics, starts of simple then with every level throws in a new twist that tests your teamwork and co-oprdination! Re-playing levels is so much fun because each one is so well designed, that you can ace it by switching up your stratergy just a tad. What else can I say, this game is awesome. If you love couch co-op, this is a game for you!",
            "review_score": "1"
        },
        {
            "review_text": "This game will test relationships. Overall, Overcooked is fun game that is easy to pickup, but requires communication, coordination and dexerity to master.   Pros: -Couch co-op! -Great with friends and family -Appealing art and soundtrack -Funny characters and story  Cons: -Sometimes the controls feel too loose. You go to pickup or place an object and it won't register the way you think it should.  8/10",
            "review_score": "1"
        },
        {
            "review_text": "BEST COUCH MULTIPLAYER EVER!!",
            "review_score": "1"
        },
        {
            "review_text": "A great couch co-op game. Probably perfect for two players, but can play up to four. Had as much fun watching as I did playing.  Levels all have some unique element to them. Making no consistent strategy for how you need to handle the orders.",
            "review_score": "1"
        },
        {
            "review_text": "Controls can be a bit finicky sometimes but it's still highly enjoyable. Just note that although it's able to be played solo, I don't recommend because it is quite difficult and nowhere near as fun.",
            "review_score": "1"
        },
        {
            "review_text": "Chopped an onion for my wife. She said 'Where's the onion?' Told her I cut it up. In the meantime the soup caught fire and it turns out a rat took my onion. She now has custody of my children. I miss my wife. All for less than the price of a Dominos pizza. Do it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is super super fun! But a HUGE con to the game is their is no multiplayer option; and the devs stated 'We don't currently have plans to add online multiplayer but we're not writing it off'. They also stated 'the game was designed around the amazing experiencing of working as a team (or not!) with a group of friends on your couch'. This to me made me sad because I don't have the luxury of walking next door to my friend's house and playing this with them. And having both options of online and local is great because when my friends are in town we can all go scream on the couch, when their out at home, we can scream at eachother through a headset (which to me is totaly fun weather i'm with them or not). I just wish the game have an online multiplayer feature, so hopefully in the furture they will add it because this game is really great! 8/10 (8 because of no online) I would totally reccomend this.",
            "review_score": "1"
        },
        {
            "review_text": "It's a really fun game. I love to play it with my friends.  But there's a small question about the position of button in Chinese Input Method.  If we have two players to use the same keyboard, and one of them press shift to put / hold and the other press ctrl to cut, and then our input method will change into Chinese from English. When my input method changes, 'shift' will let characters stop moving.  I hope oneday we can custom the button we want or switch 'shift' to other buttons like ~ and L.  Thanks. ",
            "review_score": "1"
        },
        {
            "review_text": "fun game with a friend!",
            "review_score": "1"
        },
        {
            "review_text": "So adicting but so hard toget 3 stars in single player",
            "review_score": "1"
        },
        {
            "review_text": "Neat and fun game! Worked well with a gamepad and with coop.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best local co-op games that actually requires teamwork since Monaco.",
            "review_score": "1"
        },
        {
            "review_text": "What an awesome game. I have fought with my teammates then immediatley was happy with them. Great game to play with friends because it will stress everyone out and turn them on eachother. Would really like a multiplayer online though",
            "review_score": "1"
        },
        {
            "review_text": "Needs: • Online multiplayer • More variety • Workshop support  A nice surprise was not needing XPadder (or similar program) to use my SNES controller. All buttons were recognized correctly.   Online multiplayer  While this game can be played alone, it's most fun with more people. My friends and I enjoyed the chaos of working together, but our schedules keep us from playing it more often. The ability to play with friends over the internet would let me recommend this game more.   More variety  Each level, except the final one, consists of the following: 1. Four minute timer 2. One or two menu items  3. Complete the order tickets The game has a map where you pick a level, a lot better than a simple level list. The map is split up into sections that you discover as you progress. Each section has a gimmick for their levels. - Space: players are seperated by 'shuttles' that require coordination to send a player/ingredients back and forth - Lava: you can fall in, requiring a 5 second respawn; rock formations can change, seperating players/ingredients/stations - Trucks: players must wait for a truck to align with another truck to cross them, the stations/ingredients are seperated across trucks - Ocean: players are on a pirate ship; waves will rock the ship and shift stations, forcing players to swap roles (cooker becomes chopper) - Spooky: levels are dark, lightning and flashlights are required to see - Ice: slippery I think I'm forgetting a few and some sections have mini-gimmicks per level (like rats that need to be whacked or they'll steal food). As the game continued, we hoped there would be some greater variety. For example, in levels where you make soup, each soup requires 3 of a single ingredient to make. There's never: 2 tomato, 1 onion soup or double meat burritos (always rice with chicken or beef). What about levels with no elemental gimmick? Such as shorter timer levels that require team work to get orders out as fast as possible.   Workshop support  Letting players make their own content for the game and sharing it on the workshop would give this game so much more replay value. As it stands, you only need to replay a level a couple times before you can three-star it. Even without a modkit, players will find a way, especially since this is a Unity game.   ",
            "review_score": "1"
        },
        {
            "review_text": "Great little co-op game.  Only shame is that there's not much replayability after you complete the campaign with 3 stars all round.  Maybe will do it again with more friends at some point, but some extra challenge modes or an online co-op/vs mode would have been a great addition. Could still be with DLC?  Anyway still a very fun game that I highly recommend!",
            "review_score": "1"
        },
        {
            "review_text": "this is ♥♥♥♥ing crazy and amazing I CAN'T STOP PLAYING THIS!!!!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Good and challenging fun with friends &amp; family locally (same keyboard or controllers).   Very cute art style and good choice of music :)",
            "review_score": "1"
        },
        {
            "review_text": "I've only played a little bit but this game is very promising! Seems like an amazing couch coop.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best couch games of the year! Play it if you love hectic, frantic and burning tests to your relationships!",
            "review_score": "1"
        },
        {
            "review_text": "This game is so good. One of the best and most fun co-op experiences I've ever had. The more people you play it with the better. You will laugh, you will yell, you will fall off an iceberg. The devs are constantly adding new levels and characters which keep me coming back to play. This game is great, definitely a must-buy for and and all local co-op lovers.",
            "review_score": "1"
        },
        {
            "review_text": "Team work simulator or Shout at your friends simulator, either is fine.",
            "review_score": "1"
        },
        {
            "review_text": "great couch coop game, perfect to play with wife or girlfriend :)",
            "review_score": "1"
        },
        {
            "review_text": "It's a great party game with controllers. Not so fun if you're playing solo or with keyboard.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best couch co-op's ever.",
            "review_score": "1"
        },
        {
            "review_text": "The game is really fun when played with friends of family members! Can not be missed!",
            "review_score": "1"
        },
        {
            "review_text": "Hate your friends? No? If you want to, invite them to play this game with you. You'll hate them soon enough",
            "review_score": "1"
        },
        {
            "review_text": "  Probably the best party game made in the last 5 years. If you're looking for a game to unite every type of gamer in your life (and somehow manage to teach all of them something new about games), then this is your pick. Why? Incredibly varied level designs force everyone to learn each skill in the game, test strategies, and hone execution despite a lot of (predictable, not random!) chaos.   (Disclosure: I received a free copy of this game as a judge for a festival.)",
            "review_score": "1"
        },
        {
            "review_text": "This game will make you feel like a saint for not yelling obscenities at your loved ones.",
            "review_score": "1"
        },
        {
            "review_text": "overcooked is super funny me and my brother laughed a lot about it",
            "review_score": "1"
        },
        {
            "review_text": "A casual but competitive co-op game to be played on the couch. Can be challening but rewarding. Pretty easy to pick up and do well. Can change the controllers to control 2 people at once which is hard but gets you those few extra orders. Really enjoy this game and recommend it for 2 or more players.",
            "review_score": "1"
        },
        {
            "review_text": "very fun game but would be even better with a multiplayer part to play with randoms",
            "review_score": "1"
        },
        {
            "review_text": "Wonderful game for bonding,  every stage required different strategy to work together, the only problem is it local coop",
            "review_score": "1"
        },
        {
            "review_text": "What a wonderful game!  As all of the other reviews here say, this is great to play with the missus. Easy to pick up, hard to master.   The wife was sat there giggling, i was getting annoyed with her as she wasn;t concentrating, which made her laugh even harder.   We then worked out as few strategies, and started getting 2 and 3 stars. excellent, we are improving!   You can play 4 player with 2 controllers and the devs have ingeniously made it so you can use a twin stick controller, split it in half and use a stick each to control your chefs.  Its a bit tough at times, but thats the challenge.  The DLC is a little overpriced for what it contains, but its well worth it on the basis that the game is so enjoyable, and it simpply provides more.  The single player is a bit tough, but this game is a multiplayer game at heart, so i can forgive that.  If you want a couch co-op game that anyone can play. you NEED this game in your collection, non gamer and gamers alike can enjoy this game.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "By far one of the most thrilling Co-Op game I've played since a long long time ! Perfect for parties when you're drunk with your friends !  I've played this game entirely with my Girlfriend who's not a gamer at all and she LOVED it !   11 / 10 would feed the spaghetti monster again",
            "review_score": "1"
        },
        {
            "review_text": "Love this game, from my head, tomatoes.",
            "review_score": "1"
        }
    ]
}