{
    "app_id": 448580,
    "name": "Dead End Road",
    "release_date": "2016-07-08",
    "developer": [
        "DDD Wares"
    ],
    "publisher": [
        "DDD Wares"
    ],
    "platforms": [
        "windows",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Indie",
        "Racing"
    ],
    "tags": [
        "Indie",
        "Racing",
        "Action"
    ],
    "achievements": 0,
    "positive_ratings": 134,
    "negative_ratings": 17,
    "price": 1.99,
    "description": "Dead End Road is an atmospheric driving game, with a low-fi aesthetic and procedurally generated elements. Complete your journey to seek the assistance of the old witch at Dead End Road; Get there before daybreak and perhaps, just perhaps, you can escape this nightmare.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/448580/header.jpg?t=1479307798",
    "minimum_requirements": "OS: Windows 7 or better Processor: Intel Core 2 Quad Q8400 Memory: 4 GB RAM Graphics: NVIDIA GeForce GTS 450 or equivalent DirectX: Version 9.0 Storage: 200 MB available space Sound Card: Onboard",
    "recommended_requirements": "OS: Windows 7 or better Processor: Intel Core i5-3330 @ 3.00GHz or better Memory: 8 GB RAM Graphics: NVIDIA GeForce GTX 560 Ti or better DirectX: Version 9.0 Storage: 200 MB available space Sound Card: Onboard",
    "reviews": [
        {
            "review_text": "in this game's universe, no one knows how to drive properly. not even you",
            "review_score": "1"
        },
        {
            "review_text": "Great little game for $1.99. Make a request of the evil spirits, then drive around collecting items for the ritual while the spirits do their hardest to make you crash.  Atmospheric, sounds and the screens in towns remind me of alot of 90s horror games. Minimalist graphics, but it suits the game well.  Only cons are that for some reason both when in towns, and when the road turns red the game starts running really slowly. Only tried the Linux version, so it may not affect Windows users.",
            "review_score": "1"
        },
        {
            "review_text": "Worth £2. Driving in poor conditions between trading nodes before reaching the finish line. Atmospheric but I dont know how much replay value it will have. Seems to be a stress / hallucination mechanic. Hoping there are more updates to come. Nice little procedurally generated game.",
            "review_score": "1"
        },
        {
            "review_text": "So imagine this: you're driving in your car, being persued by dark beings dwindling your sanity through 4th wall breaking scares, while contending with Dead End Road's stressful game mechanics. You're all but money-less, your fuel is starting to get low, your car is about to break down, and yet, you're only a stop away from your destination. You're determined. You're hopeful. If you're cautious enough, you can make it. You know that. You can do this.   You then watch a ♥♥♥♥ing bird fly into your windshield, causing your car to break down. Your car is kaput because a bird flew into it.   Problem is, you could hardly see the thing coming because of the smoke coming from under the hood of your car, damaged from everything you've hit, but that ain't your fault, because some maniac has been going around, leaving all this miscellaneous ♥♥♥♥ out in the middle of the road, which is a pain in the ♥♥♥ avoiding because you want to stay in the middle of the road, since there's these ♥♥♥♥ing ♥♥♥♥♥♥♥s driving down the wrong lanes, but when you avoid them, you've now gotta avoid people and roadkill that suddenly, randomly show up 5 feet in front of your face, like the bird that finally destroys your car - the car that could've been repaired at a mechanic during your stop at one of the in-game towns, except you didn't have the money for it, because you blew it on fuel, which you could've gotten at the gas station right after your stop - the stop in which you bought car fuel from a local mechanic, had you known the game would've procedurally generated a gas station right after your stop.     Oh, and seriously, who's leaving all these trashcans and boxes out in the middle of the road? What sane person does that? It has to be the demons. It's too diabolical a ploy not to be the work of evil. I'm in a tunnel, and I run into a barrel placed right dab in the middle. I've never hated trashcans more. The boxes are bad, don't get me wrong, but they're stacked and somewhat easier to make out and thus, avoid. Not those god forsaken trashcans. They're small. They're uneasy to detect. They suck. The trashcans in Dead End Road are the worst trash cans in any form of entertainment, period.   Anyways, all in all, game's infuriating at times, but I love the atmosphere and concept, so I give it a solid recommendation.",
            "review_score": "1"
        },
        {
            "review_text": "I can understand why this game doesn't have checkpoints - it makes the drive a lot more tense, and it turns what would of been a short game with checkpoints into a much longer one.  But man ... maybe an OPTION for checkpoints would be nice? Or unlockable checkpoints? Like, you have to of beat the game OR died fifty times to unlock them?  Whatever, I digress ...  Fun game, worth all 299 pennies  8/10 wouldn't slow down for a baby stroller again",
            "review_score": "1"
        },
        {
            "review_text": "The things that frighten us the most are what we do not understand or comprehend. Dead End Road is a horror game and there is a monster, but the real terror lies in trying to make sense of what is happening around you.  Gameplay wise it's kind of a first person Oregon Trail. You have direct control of your car, while driving you need to be mindful of any obstacles in your path. There are town stops on the way to the final destination where you can manage your personal stress levels, your fuel and car's damage, buy upgrades for the car, and go to a pawn shop to buy the things you need before you reach the end. This is important, write what is needed down and what type you bought, as the town stops are handled similarly to Oregon Trail: Shops and items are randomly generated so you may end up screwing yourself if you haven't managed your funds or if you're missing an item before the end.  I fully recommend this; it's atmospheric, disturbing, stressful and also has its share of jump scares. Just the right amount of each element for an excellent horror game.",
            "review_score": "1"
        },
        {
            "review_text": "Really neat little horror. Especially for it's price.",
            "review_score": "1"
        },
        {
            "review_text": "Drive fast and die like a weenie!  Ok so I've been wanting a horror game that doesn't act super serious and rely on state of the art graphics to push its agenda. Dead End Road fits the hole for now. Plus it's cheap. Worth the 3 bucks.  Story: Eh / 10 You perform a SPOOKY ritual involving 33 meat balls.... Good job ♥♥♥. Now go drive your ♥♥♥♥ cadillac and gather some materials if you can even drive. The story isn't what you're here for. You're here for the gameplay, the ambiance of the world you're forced to watch pass you by.   Graphics: They make the atmosphere of the game / 10 So think Doom. Not the AAA game that came out. Doom 1. Flat sprites mixed in with 3D elements. Great blend if you know what you're doing. This game fits that bill. You're in a car and you're driving. The road and some people may seem sprite like, but there are other objects around you that are 3D and fit just the same. Go watch the trailer and that's mostly it GOOD DAY.  Gameplay: GOTTA GO SANIC / 10 I SWEAR IF YOU DON'T BUY THE TURBO MY NEXT DARK WISH IS GOING TO BE YOUR ♥♥♥♥ ON A PLATTER!  It plays just fine. It's responsive, doesn't lag. It works ok? Driving fits in with a I'M SCARED I GOTTA DRIVE feeling. Like being paranoid. So paranoind you stop by a town to get some cigarettes and then hang out in a dark alley where your car gets beaten by an angsty 13 year old. It's kinda neat.  Point of all my review rambling: '3 bucks is worth it / 11' - SpinalTap",
            "review_score": "1"
        }
    ]
}