{
    "app_id": 448750,
    "name": "Infinity Saga",
    "release_date": "2016-02-29",
    "developer": [
        "ArcticFox223"
    ],
    "publisher": [
        "ArcticFox223"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Casual",
        "Indie",
        "RPG",
        "Strategy"
    ],
    "tags": [
        "RPG",
        "Indie",
        "Casual"
    ],
    "achievements": 0,
    "positive_ratings": 18,
    "negative_ratings": 6,
    "price": 1.99,
    "description": "You play as Tetra, a teenage boy living his days out as an college student. Tetra meets Autumn; a girl he first met on a social networking site and has grown fond of. Tetra is invited over to Autumn's house for the first time for a date night. However, the two find out that they are out of Autumn's favorite chips.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/448750/header.jpg?t=1538527068",
    "minimum_requirements": "OS: Windows XP, Windows Vista, Windows 7, Windows 8.1, Windows 10 Processor: 1.6 GHz Memory: 1 GB RAM Graphics: DirectX 9.0 Compatible DirectX: Version 9.0 Storage: 1 GB available space Sound Card: DirectX 9.0 Compatible Sound",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This is a more classical type rpg for hardcore rpg fans. It has cute characters and awesome gameplay. From what I've played, the game is very funny and witty. It has that Final Fantasy/ Chrono Trigger charm!  I've not encountered any crashes or problems. The game itself runs very smooth. The music and sound effects are amazing and keeps you on your toes. I'm really glad I took a chance and got this. It's a steal at the price the developer is asking and I would recommend it to everyone who like a good challenging strategic RPG game!",
            "review_score": "1"
        },
        {
            "review_text": "Despite the negative critisism i believe this game is pretty good at least in my opinion.The combat is pretty nice and despite the waifu system this game has,all the character feel and play vastly different.The music really helps you get in the mood of the game.Humor is plentyfull in this game but feels a bit weird from time to time but can give you a good giggle now and then.Overall it's a pretty decent game with an overall good design and story.Also can get challenging from time to time. tl;dr Definetely worth three bucks",
            "review_score": "1"
        }
    ]
}