{
    "app_id": 448910,
    "name": "Axes and Acres",
    "release_date": "2016-04-07",
    "developer": [
        "BrainGoodGames"
    ],
    "publisher": [
        "BrainGoodGames"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Indie",
        "Turn-Based"
    ],
    "achievements": 15,
    "positive_ratings": 69,
    "negative_ratings": 16,
    "price": 6.99,
    "description": "Axes and Acres is a deep and engaging single-player strategy game designed to create exciting decisions every turn. The rules are easy to learn, but every turn can be played out in many different ways in order to farm, build and survive.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/448910/header.jpg?t=1471227681",
    "minimum_requirements": "OS: Windows XP or newer Processor: Support for SSE2 instruction set Memory: 512 MB RAM DirectX: Version 9.0 Storage: 60 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "These days it's extremely rare to see an original game design within the realm of video games. It's also hard to find elegant strategy games that are easy to learn and unfold their depth by the combination of relatively straight-forward rules. Axes and Acres delivers on both fronts!  The game resembles an economic solitaire board game, but uses the digital format to take full advantage of randomization (map, cards, goals, dice) to keep every playthrough fresh. All of the randomness happens before the player is making decisions though and can be mitigated in various ways, so it never feels unfair but more like a set of conditions you have to make the best out of every turn.   On top of that, the game uses a ranking system to dynamically adjust the difficulty to the player's skill every match. It's a feature far too few single-player games use.  All in all this is, so far, probably the most interesting game I've played this year.",
            "review_score": "1"
        },
        {
            "review_text": "I've had lots of fun playing this game! I get totally sucked in once I start playing and just want to keep going! I'm on a netbook and finding games that can fit on such a small screen and look so good is such bonus!",
            "review_score": "1"
        },
        {
            "review_text": "Fun puzzler. Not for everyone I suspect, but I've been enjoying it a lot. First hour or two in particular were bliss.   Suffers for lack of alternate game modes though, so while the increasing difficulty of ranked mode *could* offer a large amount of replayability, the fact that core gameplay doesn't change limits that appeal.",
            "review_score": "1"
        },
        {
            "review_text": " A Strategic Board Game",
            "review_score": "-1"
        }
    ]
}