{
    "app_id": 448980,
    "name": "The Divergent Series: Allegiant VR",
    "release_date": "2016-03-17",
    "developer": [
        "Wevr Inc",
        "Big Red Button Entertainment"
    ],
    "publisher": [
        "Summit Entertainment LLC"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "VR Support"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Free to Play"
    ],
    "tags": [
        "Free to Play",
        "Adventure",
        "Casual"
    ],
    "achievements": 0,
    "positive_ratings": 61,
    "negative_ratings": 34,
    "price": 0.0,
    "description": "Venture into the world of The Divergent Series: Allegiant in this immersive 360° 3D VR experience featuring an all-star cast from the feature film",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/448980/header.jpg?t=1458584777",
    "minimum_requirements": "OS: Windows 8 or newer Processor: i5 3.5Ghz Memory: 8 GB RAM Graphics: Nvidia 980ti or better DirectX: Version 11 Storage: 9 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Great experience. The character's action is pretty natural and fluent Although there are some performance issues...",
            "review_score": "1"
        },
        {
            "review_text": "A neat experience but my Overclocked 980TI had problems running this in a really low resolution -.-'",
            "review_score": "-1"
        },
        {
            "review_text": "Without a doubt the worst game I've played on HTC VIve so far. I would give it a lower rating if it was anything but free. The textures are horrid, the framerate worse, and the tracking is so bad you can't even fire your turret with any accuracy.   Pros:  You can check out Triss's ♥♥♥ up close and personal.  Cons:  The rest of the game.  2/10.",
            "review_score": "-1"
        },
        {
            "review_text": "This game has good graphics but it doesn't work. i couldn't get anything to work, and there was no help menu or controls to be found.",
            "review_score": "-1"
        },
        {
            "review_text": "A fun experience, though a bit buggy.",
            "review_score": "1"
        },
        {
            "review_text": "Loved it!! A glimpse into the future of VR Gaming. Sure, it has its issues but i would gladly pay for a game of this quality when they finally start making them",
            "review_score": "1"
        },
        {
            "review_text": "Great game, can't wait to see what the future holds for more experiences like this!",
            "review_score": "1"
        },
        {
            "review_text": "While it is free, I cant really 'recommend it' because it isnt built well for VR, and the game experience itself is uninteresting, there are much better free VR experiences out there.  Good: Nice models, grpahics, lighting etc. Its free. Well done on the hand models though, they are shaped like your real life hands holding the controllers, bravo! Its only 5 min :)  Not so good: Its fairly uninteresting to play, the acting (both voice and animations) is wooden, the script is nonsensical, the controls for the turret are awful, the shooting is boring. It requires 2.5*2.5 to play unnecessarily, replacing UI elements onto the same wall and allowing smaller play areas would have been smarter. It completely bugged out on me the first time I ran it while re-running immediately and it ran fine.",
            "review_score": "-1"
        }
    ]
}