{
    "app_id": 449040,
    "name": "Jesus Christ RPG Trilogy",
    "release_date": "2016-03-18",
    "developer": [
        "Wholetone Games"
    ],
    "publisher": [
        "Wholetone Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Free to Play",
        "RPG"
    ],
    "tags": [
        "Illuminati",
        "Memes",
        "Psychological Horror"
    ],
    "achievements": 0,
    "positive_ratings": 1043,
    "negative_ratings": 201,
    "price": 0.0,
    "description": "A Role-Playing Game where you can play as Jesus Christ and the Apostles in turn-based battles",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/449040/header.jpg?t=1519934956",
    "minimum_requirements": "OS: Windows XP/Windows Vista/Windows 7/8 Processor: 1.6 GHz Memory: 128 MB RAM DirectX: Version 9.0 Storage: 300 MB available space Sound Card: DirectX 9.0 Compatible Sound",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "  My antivirus just detected this as a Trojan virus",
            "review_score": "-1"
        },
        {
            "review_text": "A psychological horror for the atheists.",
            "review_score": "1"
        },
        {
            "review_text": "My 3rd cousin used to be atheist, in hopes to get him to see the other side I showed him the game, Jesus Christ RPG Trilogy, which is this game. At first he didn't want to play, refusing the offer. I eventually coaxed him to go into a closet with a laptop with only a steam account, with no money and only a copy of Jesus Christ RPG Trilogy with no internet connection. The closet was wet, dark, with nothing else except the laptop, that was charged by being attached to the wall, the outside of the closet soundproofed, 6 cans of Spaghettios, 12 Caprison Packets of limeaid flavour, 1 packet of unbranded candy, a copy of the holy bibel, and a framed picture of obama that was held onto the wall by tunsten nails. after he went inside the closet, I quickly confiscated his phone and electronics and locked the closet door. After that I went to the local Gamestone and bought myself a copy of Shrek's Carnival Craze Party Games and some Windex Cleaner Solution. I went back home and played some games. 3 Months later I went back to check on my cousin to see that my cousin had converted to Hinduism.",
            "review_score": "1"
        },
        {
            "review_text": "Basically pokemon mystery dungeon but you're ♥♥♥♥ing jesus",
            "review_score": "1"
        },
        {
            "review_text": "If you enjoyed the classic Tommy Wiseau motion picture 'The Room,' you will love Jesus Christ RPG!",
            "review_score": "1"
        },
        {
            "review_text": "I played this game on GOD-mode the whole way through!  Seriously, if you are looking to scrutinize the Theology of this game then I implore you to lighten up! The story and design are as simplistic as was Christ's manger.  Let's begin with the design.  The pictures all appear handcrafted as you can see in the previews. It rubbed me in a South Park-ish kind of way which gave me a few reservations because of the liberty South Park takes at ridicule. I kept an open mind because Christ Jesus had one of the greatest senses of humor... it says so in the bible!  Combat is unbalanced. While it was pretty funny to have sent over 320 pixelated enemies to He ll, it was way too easy to beat them and then level up. Enemies are so easy and so I was baffled when I accidentally tumbled apon a boss 'Mazda' and could do nothing. In fact, this made the game very stale, game play-wise.  Finally let us review the Story. At one time in history this story was told by the finest artists of Florence, Italy and funded by the great wealth of the Medici family. For such a great story it probably deserves the finest artists in the gaming industry, the smartest coders, the most intrepid lead designers and enough funding that would rival the bankroll of Bethseda Softworks, Eidos, or any other successful game company.  But same as in the story, God didn't bring a King into the world to be born on a lavish throne. He chose a simple manger with hay. He chose a bunch of dirty fishermen to build a Church for him. And in the case of this game's story, he chose a very very medocre game designer to tell the greatest story ever told! It was very sweet, it warmed my heart to Christianity all over again and I even said a prayer for the designer. For that reason I recommend the game.  Oh and did you notice the game was free?",
            "review_score": "1"
        },
        {
            "review_text": "It's a bit bare bone with excessive use of the same npc template and the lack of any original graphics (other than the characters) but on the plus side its quite easy, a bit entertaining, has some alright cutscenes made from scratch as well as the characters, and has some unique functions (jesus can't fight, sin based status effects, using 'spells' out of battle for other functions) I wouldn't really recomend this if you had to pay for it but with it being free its not that ad",
            "review_score": "1"
        },
        {
            "review_text": "Better than Skyrim will ever be",
            "review_score": "1"
        },
        {
            "review_text": "Going into these games I had little expectations. But man it got going quick. Before I played this game I was not a religious man at all. I started playing and oh fellers let me tell ya the story of Jesus H. Christ unfolded before my eyes in a way I did not think possible. Easily the best story game I have enjoyed. Yes, even better than Witcher 3 which I previously thought had the best story. Jesus Christ RPG Trilogy sets a bar never before seen. When ya first open up the game and try to play you will notice it is a bit hard to get into. But after you spend some time into it the same way Jesus did way back 2016 years ago the path comes to you and you literally feel like you are role playing Jesus Christ himself, our lord and savior. This game should be treated like the bible, and more so as Jesus' diary. You literally get to live his life and shape his legacy. It is fantastic, not even you could do such a thing in the Witcher 3. You will face some of Jesus' greatest enemies and even live out his famous 40 days fasting in the Judean desert. It is crazy immersive. You also get to help out some of the small towns and do such things as turning water into wine for a party they are hosting. There are so many little details outside of the main story, many more than the Witcher 3. I might stop playing the Witcher 3 game all together and commit my life to finding all the secrets and meanings and details in this game. Easily would get 10,000 hours out of it, way more than the Witcher 3 AND all of its DLC's. Overall, it is a great game I 100% recommend to anyone that is willing to invest the hours into learning about our lord and savior, Jesus H. Christ. Amen.",
            "review_score": "1"
        },
        {
            "review_text": "I wish more games would let you send enemys to hell...",
            "review_score": "1"
        },
        {
            "review_text": "Perfect game, I always come back for the cheap hookers. I mean I know you're not suppossed to sin but damn are the hooker cutscenes the best. and if you input the konami code you can discover that well lets just say Mary is no longer a virgin. Don't even get me started on the scene when you kill god. Now that was just the best. And if you put in the code Hitlerwasr3ich you get the special WWII ending and let me tell you the train driving scene is the best. (Spoilers) The WWII end sux cuz u kill urself because of the gas bill. 10/10- Like skyrim butt with Jesus.",
            "review_score": "1"
        },
        {
            "review_text": "This game is full of guns, action, cool kid cars, swearing, violence, and fun. This is a fun sandbox open world game with tons of loveable characters, great action, fun stories, I like to call it Saints Row V.",
            "review_score": "1"
        },
        {
            "review_text": "It's damn tough being Jesus.",
            "review_score": "1"
        },
        {
            "review_text": "It warms my heart that now ants too can learn about the Bible.",
            "review_score": "1"
        },
        {
            "review_text": "For a free game about Jesus, not that bad. A little grinding here, infinite money there, play as Jesus, Save the world... Get an Angel that can heal everyone and restore MP in and out of battle.. Classic RPG, which I love.  I'm torn between:  short and sweet and I liked it.  AND  sooo much more could have been done/shown.   Overall good free game with some Theological education.",
            "review_score": "1"
        },
        {
            "review_text": "Jesus Christ! This is one good set, went into it thinking this was just another typical MMO RPG, but oh lord was I wrong. My God, the level of startegy this game requires, it's harder than Hearts of Iron 4. Had the fear of God put in me all my life, now is my chance to put the fear of God in others.",
            "review_score": "1"
        },
        {
            "review_text": "&gt;Starts game &gt;There are more than one game &gt;Starts the first one &gt;Plays for 5 minutes &gt;Dies by a green demon and goes to heaven 10/10 would disappoint god again",
            "review_score": "1"
        },
        {
            "review_text": "This game made me truly believe in God, something that years of Catholic education could never do!!!!! it s som good!!!!!!!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Very gut game,   I enjoyed the cancer it gave to me and i treasure it every single moment i live, thank you for the trojan virus too! Amazing game  2/10 not enough marie nudes",
            "review_score": "1"
        },
        {
            "review_text": "⁧ ⁨",
            "review_score": "1"
        },
        {
            "review_text": "Probably the   best   game ever made.",
            "review_score": "1"
        },
        {
            "review_text": "Best game I've ever played. Killed people as Mary 10/10 would kill again",
            "review_score": "1"
        },
        {
            "review_text": "i recomend this game. bad roman soldiers wanted to do bad things to me :( i died",
            "review_score": "1"
        },
        {
            "review_text": "This game is literally impossible.",
            "review_score": "-1"
        },
        {
            "review_text": "You don't have to be religious to have a blast with this game!! I love the humor, the silly puns and jokes, and the graphics are amazing. Loved every bit of it. Never was too big into RPGs, but I will shout 'PLAY THIS GAME' on the tallest mountain. Hope you guys are able to continue making fun games like these ones :)",
            "review_score": "1"
        },
        {
            "review_text": "i lost like 3 times in the first 10 minutes then finnaly died fighting a roman guard  10/10 would exorcise again",
            "review_score": "1"
        },
        {
            "review_text": "This game is full of dank memes i rate this very highly on my gaming scale a solid 10/10 for me",
            "review_score": "1"
        },
        {
            "review_text": "Virusest. I could sue the creater. Couldnt I?",
            "review_score": "-1"
        },
        {
            "review_text": "&gt;Enemy goes to hell after a battle &gt;Says sorry and keeps wandering around the world if nothing happened  &gt;NPCs would kill a pregnant woman for a room  These are just some of the THOUSANDS of mistakes in this game. I'm an atheist, I might add. I played this game, knowing it would be a bad trip. But what I got in the end is one of the most HORRIFIC games I've ever seen witnessed.  Music: Has like 4 songs only that loop constantly. Aside, they just loop over and over again. The music is horribly composed, the chiptune instruments used to make the score are just high-pitched tones, with no distinct instruments. Not even a bass or a drum kit.  Story: I've only managed to get into Baby Jesus Christ RPG, but the story goes like this. Angel with an horribly modeled face comes, and makes mary get pregnant in 1 single frame. Then Joseph is INVITED to a census in bethleem, but, if he does not assist, he'll be killed wih everyone along his family. Because he'll be concidered a tax avoider with an offshore account in the Cayman islands.  Also, the governor of Syria is a massive stalker.  So you go to bethleem, fight guys who would kill a PREGNANT lady for a room.  Then you meet the 3 elve- I mean, 3 kings, and then I died.  GG",
            "review_score": "-1"
        },
        {
            "review_text": "WE ON THAT ULTRA LIGHT BEAM",
            "review_score": "1"
        },
        {
            "review_text": "I give the game a 9/10. -1 point because Harambe isn't in the game",
            "review_score": "1"
        },
        {
            "review_text": "no more, please no more... its too weird for my mind to comprehend",
            "review_score": "1"
        },
        {
            "review_text": "This better be the top review by the time I get back.",
            "review_score": "1"
        },
        {
            "review_text": "As a satanist seeking redemption I downloaded this game as a last ditch effort to save my soul. However this game's soundtrack mixed with frustrating gameplay turned me the furthest away from god I have ever been. You may be confused by the positive review on the game. But I am the happiest I have ever been with being a satanist after the torture of this game. So if your looking for a reason to become a follower play this game. It is the best shepard.",
            "review_score": "1"
        },
        {
            "review_text": "This game makes me question my life choices.",
            "review_score": "1"
        },
        {
            "review_text": "No nudity. No memes. No Illuminati. I want a refund.",
            "review_score": "-1"
        },
        {
            "review_text": "The tags for this game we're  Illuminati Psychological Horror Memes Nudity    best game 2016   10/10",
            "review_score": "1"
        },
        {
            "review_text": "wow this is the best rpg i have ever played in my life, i'd even say its better than the classics. truly innovative and id say this is what we need in more rpgs, hell, even modern video games! before this game i was failing in school, was depressed, and had severe drug problems, but now ever since i played this, my life has done a complete 180 and i am now a good christian! THIS GAME SAVED MY LIFE!!!! thanks jesus christ rpg trilogy for converting me! BEST GAME EVER!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "❄☟✋💧 ✋💧 ✈🕆✌☹✋❄✡ 👍⚐☠❄☜☠❄",
            "review_score": "-1"
        },
        {
            "review_text": "If you don't love this game you are going to hell",
            "review_score": "1"
        },
        {
            "review_text": "People writing negative revs don't get it at all. you shouln't take it seriously, it is designed as an endurance test: you win if you can't take the repettitive soundtrack for merely a second.  Playing this at 04:50 I feel so alive...",
            "review_score": "1"
        },
        {
            "review_text": "This is a sheet of game",
            "review_score": "-1"
        },
        {
            "review_text": "Are you some little girl/boy who doesent know our lord and saviour? Well then this is the game for you! Who needs 'plot' or 'charecter development' when you got jesus! Even though he never stops to take a bloody shiote who cares when you got jesus!  WARNING IF YOU HAPPEN TO BE: GAY, LESBIAN, ATHEIST, JEWISH, HINDU (etc), YOU ARE NOT FLUCKING ACCEPTABLE ♥♥♥♥♥♥!",
            "review_score": "1"
        },
        {
            "review_text": "I went in an atheist... I came out a Christian.",
            "review_score": "1"
        },
        {
            "review_text": "░░░░░░▄▀▀▀▀░░░░░█▄▄░░░░ ░░░░░░█░█░░░░░░░░░░▐░░░  ░░░░░░▐▐░░░░░░░░░▄░▐░░░ ░░░░░░█░░░░░░░░▄▀▀░▐░░░  ░░░░▄▀░░░░░░░░▐░▄▄▀░░░░  ░░▄▀░░░▐░░░░░█▄▀░▐░░░░░  ░░█░░░▐░░░░░░░░▄░█░░░░░  ░░░█▄░░▀▄░░░░▄▀▐░█░░░░░  ░░░█▐▀▀▀░▀▀▀▀░░▐░█░░░░░  ░░▐█▐▄░░▀░░░░░░▐░█▄▄░░░  ░░░▀▀There is no god▐▄▄▄",
            "review_score": "-1"
        },
        {
            "review_text": "Nobody ♥♥♥♥s with the Jesus!",
            "review_score": "1"
        },
        {
            "review_text": "Hey whats up guys adnin here to bleach youtr sfkodjgnvb GAyest GAme But love JEsus am I right boys in the home town????? Git Gud Scrub",
            "review_score": "-1"
        },
        {
            "review_text": "Mary and Joseph kept reminding me that I was God's bast ard child  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Let me say right off the bat that I'm not the most religious person out there... and that I've seen a lot of off the wall video game concepts... from things like the Binding of Issac to Conker's Bad Fur Day, from Shaq Fu to Grand Theft Auto, from NCIS to Lego Batman... like comic books, if you can imagine something, it can be done in the realm of games being created...  Which brings me... 'Jesus Christ RPG'...  Developed and Published by Wholeton Games, and released for Free on Steam just in time for Easter here in 2016... 'Jesus Christ RPG' is perhaps the most surreal concept I've ever seen...  In short... it's Pokemon mixed with elements The Bible... okay that's silly... more like Final Fantasy meets The Bible.  Yeah that is as surreal as it sounds... as you level up 'Our Savior' he learns how to do his miracles (turn water to wine, heal the sick, etc, etc).... and you battle 'demons' while finding your apostles... and also recruiting your part (consisting of Simon Peter, Mary Magdalene and Judus who joins you no matter if you like it or not)  The game is done on a turn base system, much like many other RPGs, you input your commands when it's your turn, there is some thinking involved to realize how to use everyone's abilities.  Controls are simple, you use the keyboard.... the arrow keys to navigate, enter to select menu options, the ESC key to bring up your inventory, save, status screens... and space bar to interact with objects and people.  However it's the surreal nature of the game that makes it worth playing, there is an actual in-joke about the language (namely that they didn't speak English back in Biblical times), and Mary being apparently an overly common name.  Since the game is free is worth checking out.",
            "review_score": "1"
        },
        {
            "review_text": "It's fun. Oh and it's free. So why not?",
            "review_score": "1"
        },
        {
            "review_text": "I don't know if this game is funny on accident or on purpose, but that doesn't change the fact that I laughed harder than I ever have playing a video game. Maybe it's because I'm Catholic.... ",
            "review_score": "1"
        },
        {
            "review_text": "Probably one of the hardest freaking RPG games I have every tried spent my money on. I took the baby jesus route, became virgin mary, tried going to another town, and died from a desert thief. Probably one of the best games I've ever played.  EDIT: THIS GAME IS FREE?!?!",
            "review_score": "1"
        },
        {
            "review_text": "incredible",
            "review_score": "1"
        },
        {
            "review_text": "Now I say that I have enjoyed the little time spent with this game. You should also enjoy it. 3/10 fight demons kbie",
            "review_score": "1"
        },
        {
            "review_text": "Ive played enough of this ♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "Best RPG games I've ever played. Loved killing them purple demons.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would pray again.",
            "review_score": "1"
        },
        {
            "review_text": "I once was blind but now can see... that this is the   best rpg game ",
            "review_score": "1"
        },
        {
            "review_text": "Was grinding and leveling up Virgin Mary and Joseph when my health was getting low. Decided to head back to town to heal. Go to Inn. Get told there are no available rooms. 10/10  Enjoyed the time I spent playing it.",
            "review_score": "1"
        },
        {
            "review_text": "basically Dragon Quest with not as good graphics and the monsters get a buff but hey, its a dollar so its pretty ♥♥♥♥en awesome for the price considering it is 100% free to play with no in game purchases 10/10 would buy again",
            "review_score": "1"
        },
        {
            "review_text": "This made me want to become a Minister.",
            "review_score": "1"
        },
        {
            "review_text": "'Beelzebub used Smelly Finger!' 'Disgusting!' 'Jesus Christ took 30 damage.'  10/10",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Jesus is here to save me again. -Isaac",
            "review_score": "1"
        },
        {
            "review_text": "wow 12/10, would get mary killed by bandits again",
            "review_score": "-1"
        },
        {
            "review_text": "Well it's a free version of the book ... JUST GET IT 420/360 WOULD NO SCOPE YELLOW DEMONS AGAIN",
            "review_score": "1"
        },
        {
            "review_text": "First of all, in terms of my faith, I don't really care what you believe unless it's not an excuse to hurt others.  As for this game itself. It's nothing special. It's an easy levels, hard bosses RPG and I wouldn't even recommend this game at all if it wasn't for free. And Personally, I'm a sucker for this kind of bad art and some of the jokes made me smile. I also really liked how they portrayed Hell in this.  Sure, the music is not great, the gameplay's repetive and not every joke works. But it's not hurting anybody. It's nice to have games that not only teach you about something you probably don't care about, but also lets itself be silly so we can all have a nice smile.",
            "review_score": "1"
        },
        {
            "review_text": "Ow my ears",
            "review_score": "1"
        },
        {
            "review_text": "The Book was Better",
            "review_score": "-1"
        },
        {
            "review_text": "One of those games that you really have to try for yourself, when you're bored and just browsing the free and cheap games part of steam. You can look in the sections for the awfully reviewed games, or the wonderfully reviewed games, and somewhere in between you'll find Jesus Christ RPG Trilogy.  Now, you might think to yourself, why exactly would I download this game? I'm not a religious person. I don't need to be indoctrinated.  The answers are very simple.  Do you want hardcore rpg gameplay, where the first thing that happens as soon as you step out of the first town is you are BRUTALLY MURDERED IN THE FOREST BY A PACK OF THUGS? That's not in the bible!  Do you want to recruit a band of disciples? Who doesn't like disciples?  Are you one of those people who likes to cure leprosy?   Do you want to control a character who *literally refuses to fight*?  Do you like chugging down wine in order to fight Lucifer and his demons to cleanse heaven of...   Well, you get the point.  The price tag is on point for the two nights of enjoyment I got out of this bizarrely compelling game. You expect some type of errors, or erratic gameplay, or something wrong with a free title, especially an RPG maker game, but there was never anything wrong.   You have to make decisions that require some thought, you get to baptize people. You even get to grind to beat up tough baddies. Do you really need anything else from an RPG?",
            "review_score": "1"
        },
        {
            "review_text": "i think this game is exact media to teach kids or everyone bout Christianity history,I just played the sequence where baby Jesus born and fighting demon in the end(i dont recall which part is this),and i dont find anything offensive,beside if you want to play this one you should be open minded or just leave this one. and surprisingly i love one of 8 bit soundtrack of this game,so its worth to try.",
            "review_score": "1"
        }
    ]
}