{
    "app_id": 449250,
    "name": "A Little Lily Princess",
    "release_date": "2016-05-19",
    "developer": [
        "Hanabira"
    ],
    "publisher": [
        "Hanako Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Visual Novel",
        "Female Protagonist",
        "Anime"
    ],
    "achievements": 9,
    "positive_ratings": 183,
    "negative_ratings": 13,
    "price": 10.99,
    "description": "Newly arrived at a boarding school in Victorian England, Sara Crewe uses her love of books and storytelling to build new relationships. But what happens to a fairy-tale princess when she loses everything?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/449250/header.jpg?t=1463680962",
    "minimum_requirements": "OS: Windows XP or later Processor: 1.2 Ghz Memory: 512 MB RAM Graphics: 1366x768 Storage: 150 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "EDIT: Oops, forgot to mention that my really short gameplay time is due to the fact that I played the beta quite a bit back before this game released on steam or even on their website.  The best and shortest way I can describe this game is that it is VERY precious. Might be the most precious game I've played.    Art &amp; Music ",
            "review_score": "1"
        },
        {
            "review_text": "A Little Lily Princess is a life simulation game based on the novel  A Little Princess . Those familiar with the novel will know what this game is about. The main character is Sara Crewe, a young girl (we don't really know what her age is so we can only guess) who arrives in England from India to attend an all girls boarding school. There, she meets a cast of characters and based on who you choose to have Sara interact with, she can form friendships or romance among six of them.   Although this is the second game published by Hanako Games based on a novel, I found this one to be more enjoyable than Sword Daughter. For one, as this is a life simulation game, there is an element where you choose to have Sara do certain activities (i.e., tutor, write in her diary, have a tea party) which will earn certain icons. These icons are needed to progress with various characters' paths. Despite this element, you don't need a walkthrough to successfully complete a path, as the game shows you what icons are needed to obtain certain scenes and such. Also, I found the writing to be more to my liking. Although I did find Sara to be naive at times (even after a certain event takes place), I liked taking on her character and seeing how she interacted with the others, even when she wasn't on certain characters' paths. Of course, the art (especially the CGs) and music were great and I really liked the ending song. (I suppose it's the genre that I like. XD) I enjoyed playing all of the paths as well although I did like some more than others. However, I'd say that I liked half of the paths I played and I was satisfied with the others. (For anyone who's curious, my favorite paths would be Becky's, Ermengarde's, and Jessie's.)  I would definitely recommend this game, especially for those who are fans of VNs, life simulations, etc. The story is very light-hearted although there is a bit of a serious element although it's more on the dramatic side than anything else. This is a game that young audiences can definitely handle. ^^",
            "review_score": "1"
        },
        {
            "review_text": "This is a cute visual novel game that is based upon A Little Princess. It mixes stat raising with several 'routes' which allow for various endings. It's a good read, and a nice addition to the VN category.",
            "review_score": "1"
        },
        {
            "review_text": "I overall enjoy this game very much. So I shall give a review for all people pondering to buy this game. (Note: I have not yet finished the game so I cannot give a full review as of now.)    Art and Appearence",
            "review_score": "1"
        },
        {
            "review_text": "Charming story and characters. It's fun to unveil the depth of each character.",
            "review_score": "1"
        },
        {
            "review_text": "I was really looking forward to play this, but..it's so boring. I like this kind of game and it's sad, when game which should be based on story, choices and good graphic has so few of it and nothing more to offer.  1) Story is very cheap, almost nothing at first half, than at second is very predictable. Actually the most of gameplay is about main character chit chatting and gossiping (and anything seems interesting in this conversations, but that doesn't mean that conversations are short, at the opposite you have to read lots of text). Whatever you do, the end is almost the same. They will be talking and talking...  2) That bring me to choices. Is this really the choice? Even if it doesn't matter on what I click? Yes, you have to collect some traits to unlock scenes whit conversations, but most of them needs very small amounts of them so you even don't have to think about it. Whatever you do, the end is almost the same and that makes you feel it doesn't matter what you do at the game.  3) Yes, story isn't the strongest part, but graphic is nice. So you can at least look at pretty pictures, no? Unfortunately, there are so little changes (for example every room of other pupils looks same - for all of them there is exactly same picture looking as hotel room without any personal thing even while game says something else) ...Why is main character wearing the same dresses as always when the story says she have the new ones? Even she don't have the ones on the picture?  Well...it's not bad game, but it doesn't worth it's price at all. It looks nice and if you like same sentimental stories you can enjoy it for some time. But don't expect it will keep you busy more than few hours. For me it seems like lost of money and time. Maybe it will be much more better while it will be just comics story without pretending it's something more.",
            "review_score": "-1"
        },
        {
            "review_text": "Very cute with some amazing writing. Completely worth a look if you enjoy visual novels.",
            "review_score": "1"
        },
        {
            "review_text": "A fantastic novel, and one of the best from Hanako Games. You play as possibly one of the sweetest and sincerely kind characters I've ever had the pleasure of reading about and playing as.  The story itself is well-written, as is every character that is introduced. The story has a fantastic balance of comedy, romance, and tragedy. I found myself teary-eyed and even weeping at certain portions of the game, and I can't say many games have successfully done so.  The romance is all female/female (yuri), but it is kept to a very light and cutesy level, and sexuality plays no part in any of the interactions with the characters. For this reason, anyone can enjoy this game and be moved by all that it has to offer.  I cannot recommend this visual novel enough. If you need something bright and cheerful, or just simple enjoyment, this is money well-spent.",
            "review_score": "1"
        },
        {
            "review_text": "This game is so very worth it!  There are no choices, per se. More, you choose who you will spend time with, and this determines the course of the story. The stat-raising is well implemented, and while I may be mildly annoyed with it at times, I feel it works. Stats are used to unlock scenes and continue the story.  Story: I've not finished yet, but the characters are wonderful and three-dimensional! The route I'm on has me feeling SO much! And Becky is... Becky is so much better than I could possibly deserve,",
            "review_score": "1"
        }
    ]
}