{
    "app_id": 449220,
    "name": "A grande bagunça espacial - The big space mess",
    "release_date": "2016-04-05",
    "developer": [
        "RMAL"
    ],
    "publisher": [
        "SouKing"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Casual"
    ],
    "achievements": 100,
    "positive_ratings": 639,
    "negative_ratings": 386,
    "price": 0.79,
    "description": "Hello everyone! Welcome to the craziest adventure of your lives! The fearless Waldisglédson will face creatures from space and find allies on his journey!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/449220/header.jpg?t=1476813258",
    "minimum_requirements": "OS: Windows 7 home 64bits or 32bits Graphics: DX9 features (Shader Model 2.0); in general, any board manufactured from 2004 should work. Storage: 2 GB available space Additional Notes: CPU: support for SSE2 instruction set.",
    "recommended_requirements": "Storage: 3 GB available space",
    "reviews": [
        {
            "review_text": "Horribly low-quality game. The subtitles don't line up, the controls are unintuitive and flighty, and the graphics are awful. The controls deserve especial mention. I press down when navigating the menu, and find my cursor has jumped 2-3 spaces. It's like the dev hasn't even heard of keyboard ramping. Press Enter to... Return to the level select menu? Huh? I accidentally skipped the horribly-paced tutorial and it won't let me return to it without restarting the game. Waste of 59 cents, waste of 18 minutes of my life. Not even going to bother with the cards unless this goes on sale for some embarrassingly low amount. I was expecting something ironically bad, but this is just bad.",
            "review_score": "-1"
        },
        {
            "review_text": "  Visually probably the ugliest thing on planet earth. If this 'game' was made as a gag, I certainly didn't get it. Idle it, get the cards, then hide it from your games library for eternity.",
            "review_score": "-1"
        },
        {
            "review_text": "  It's the worst scroll shoter I've played so far - quite an achievement. Don't rely on those reviews, most of them got it for free and they're happy it has cards.",
            "review_score": "-1"
        },
        {
            "review_text": "  One of the most random things put together and made it a game.  It's a bullethell game where you play as a motor bike in air, killing sea life (lobsters, sharks with lasers, not sure but I think I killed a whale). Some most random ♥♥♥♥ happens on screen and affter all the explosions go down you see around if you are still alive. It's on Portugese and it says that there is English translated but I couldn't find it.   Here is perfect description of my game expirience:  When I tasted alchohol for the first time age 11. For 0.99 it's worth it because there is a lot of crap on STEAM for more cash. Will try it again in few months maybe I will change my recommendation.",
            "review_score": "-1"
        },
        {
            "review_text": "idk man. I got this for free, the only reason is the cards, good gaming, ehm..",
            "review_score": "-1"
        },
        {
            "review_text": "  Not really recommended unless you want free cards.",
            "review_score": "-1"
        },
        {
            "review_text": "What notice And pure fantasy and you notice right away is a little game interesting that an arcade shooter and we say it is very style for kids but it's nice to play including the soundtrack",
            "review_score": "1"
        },
        {
            "review_text": "  Hey, this is somehow actually good and fun, even if not much quality is around. I won't make a full review for this, definately.   8.0/10 ~HUEHUEHUEHUEHUEHUEHUEHUEHEHUEHUEHUEHUEHUEHUEBRBRBRBRBRBR",
            "review_score": "1"
        },
        {
            "review_text": "  You can shoot googly-eyed sharks, artillery-shooting lobsters and giant robots with your flying motorcycle with frickin' lasersbeams attached to it's head..light. There's also a pirate, a flying pig, and an angry rooster. Oh, and you can learn some Spanish while playing.  Definitely not the best game. Definitely not the worst game you can get for this price. And I definitely want what the creators of this game were smoking.",
            "review_score": "1"
        },
        {
            "review_text": "  Good for free card. A 3D graphic is not bad. easy to play. I don't understand what point of this game. 5(+1)/10 plus 1 because of card drop.  This game is good for past time. But I graphic is Not cute!! :(",
            "review_score": "1"
        },
        {
            "review_text": "  A grande bagunça espacial - The big space mess is a sidescrolling shooter with a story that I can't for the life of me figure out. This game is weird, clunky and just plain stupid  Pros: -Weirdness and Portuguese kind of drew me into trying to figure out what the hell this is -Controls are not too bad  Cons: -The graphics are absolutely terrible, the animations and assets used are horrendous and feels like an early 2000's attempt at 3D graphics -Soundtrack and Sound Effects is awful -Cannot figure the game out and it makes absolutely no sense whatsoever -The 100 achievements for this game makes it even more ridiculous, as there is endless grinding in a pointless game  This game is one of, if not the worst game I have ever played. Stay clear and don't buy 1/10",
            "review_score": "-1"
        },
        {
            "review_text": "  2 words. Trading Cards.",
            "review_score": "-1"
        },
        {
            "review_text": "The controls are awkward, the game play offers nothing new and the artwork is all random. Looks like someone found a cache of gifs and spent a day making a really cheap game.",
            "review_score": "-1"
        },
        {
            "review_text": "  wtf? this game is a real ♥♥♥♥!",
            "review_score": "-1"
        },
        {
            "review_text": "  Plays like a very poorly made flash game than an actual game you pay for...",
            "review_score": "-1"
        },
        {
            "review_text": "The absolute BEST game I've ever played, 10/10. Worth buying.",
            "review_score": "1"
        },
        {
            "review_text": "Basically if you not have money to buy heroin and you belive that you are a flying pizza boy with a motorcycle this is deffinetly a game for you.    I rate it potato/black salami",
            "review_score": "1"
        },
        {
            "review_text": "  THIS IS WHAT STEAM NEEDED ALL ALONG! This game is a space shooter made with Unity and Blender, it has mind blowing graphics, awesome music and satisfying gameplay! Pick this up it's only $1, oh what's that you're poor? LOSER!!! Have fun missing out on this epic quest   THE BIG SPACE MESS",
            "review_score": "1"
        },
        {
            "review_text": "Cancer",
            "review_score": "-1"
        },
        {
            "review_text": "Gift this game to someone you hate.",
            "review_score": "-1"
        },
        {
            "review_text": "?",
            "review_score": "1"
        }
    ]
}