{
    "app_id": 449340,
    "name": "Serafina's Crown",
    "release_date": "2016-03-15",
    "developer": [
        "Woodsy Studio"
    ],
    "publisher": [
        "Thesis Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Visual Novel"
    ],
    "achievements": 25,
    "positive_ratings": 26,
    "negative_ratings": 10,
    "price": 5.59,
    "description": "Serafina’s Crown is a visual novel with elements of fantasy, adventure and romance. You play as Odell Perin, the newly-appointed regent of Darzia as she tries to solve the murder of the queen and a host of other domestic and international crises.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/449340/header.jpg?t=1458266830",
    "minimum_requirements": "OS: Windows XP Processor: 1Ghz Memory: 512 MB RAM Graphics: DirectX or GL Compatible Card Storage: 600 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Serafina's Crown is a visual novel where you take on the role of Odell Perin, a noble who has been away from the kingdom of Darzia but has suddenly been recalled to return upon the death of Queen Belatrix. As Odell is the natural successor of her noble house and is on the committee that will help decide the next king or queen, she has no choice but to return. However, upon her return, she finds herself suddenly thrown into the role of a temporary queen, as those on the committee (or what is called the Elite Duma) are all accused of either directly or indirectly having a role in the murder of the previous queen. Thus, the mystery of the murder needs solving while Odell must also manage the daily duties required of her position.  Although this is a visual novel, there are other elements such as a stat raiser which determines which noble house Odell can choose to align herself with. Also, Odell can choose to form romantic relationships with other nobles on the Elite Duma (and perhaps elsewhere) and she can get various powerups from those relationships, which can help her with the debates. Then there are the debates that the Elite Duma must have to decide of various issues. The debates are a mini-game in which how you win an argument depends on how closely you align yourself with a house, any powerups you may have acquired, and a bit of luck.   Now on to my opinion of the game. First, I liked the story. I like the concept of political intrigue and mystery and I liked playing on different paths, getting to know different characters and learning their motives. So I thought the writing was pretty good although I will point out that I found typos and so forth. This game could have benefited from having a proofreader check for these but hopefully, this is a point that the developer will make note of for future games. As to the art, I liked it although it's not in the anime style that's seen in many VNs. The only point I'll nitpick is that at times, I thought that the body sprites looked a bit off, such as when someone's nose looked weird. However, this is really a minor point. The music tracks were good and I liked how each of the main characters had his or her own track. I really liked the debate mini-game. I thought it provided a bit of a challenge, as they took place at the end of each chaper and I had to use whatever powerups I acquired to win.   Overall, I enjoyed playing Serafina's Crown and found it fun to play the various paths and so forth. As this is the sequel to Serafina's Saga, I would like to see Serafina's Saga make its way onto Steam someday, as I'd be quite interested to play it, too. Also, after having played the canon path (although it's not official, I'm pretty certain that it is but I won't say whose path it is), I believe that there is the potential for there to be a sequel as well and it'd be interesting if it ever comes to fruition. ^^",
            "review_score": "1"
        },
        {
            "review_text": "Its pretty good!  Recommended.",
            "review_score": "1"
        }
    ]
}