{
    "app_id": 449780,
    "name": "Jacob",
    "release_date": "2016-07-18",
    "developer": [
        "Duck Duck Zeus"
    ],
    "publisher": [
        "Centre For Longitudinal Studies"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Casual",
        "Free to Play",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Free to Play",
        "Indie",
        "Strategy"
    ],
    "achievements": 0,
    "positive_ratings": 19,
    "negative_ratings": 62,
    "price": 0.0,
    "description": "Jacob: an evidence-based puzzle",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/449780/header.jpg?t=1468918270",
    "minimum_requirements": "OS: windows 7, 8, 10 Memory: 1 GB RAM Graphics: 512Mb",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I wanted to give 'Jacob' a chance but I have two major problems with this game:   1. Presentation and Polish   I wouldn't advertise this as an addictive puzzle game, as it's certainly not addictive. The game suffers not only because of its gameplay but lack of general presentation. Everything just looks and feels pretty cheap and cramped together.    2. Show don't tell    The central thought behind the game is interesting but the game itself is really quite shallow. By telling you about the meaning behind the mechanics, the game looses its justification for being a game in the first place. If you rather want to write an essay about your scientific discoveries, you should do exactly that and not brute force making a game. Similar games with artistic/political intentions such as 'The Passage' follow a similar approach but succeed where Jacob fails: They don't go and tell you about their meaning in advance but let you experience it all through gameplay.",
            "review_score": "-1"
        },
        {
            "review_text": "If you want a lesson on poor game design, look no further. They even managed to screw up the scroll bar! Wow! If you want a lesson on income inequality, which is what this game weakly attempts to be, literally just google a definition of 'income inequality.' It'll be more informative, less preachy, and a lot easier on the eyes.",
            "review_score": "-1"
        },
        {
            "review_text": "Just Adont Cdownload Oit Byou'll thank me later",
            "review_score": "-1"
        },
        {
            "review_text": "This game is like giving birth to a kid with Down-Syndrome, it seems nice at first and then it gets really dissapointing after five minutes of playing with it. Climbing Ladders simulator 2k16",
            "review_score": "-1"
        },
        {
            "review_text": "Could have added stuff falling from the sky as if oppression was aiming for them (flower pots, bosses, wads of cash, cops), the higher socioeconomic class you are, the less oppressive objects would be thrown at you. When you successfully dodge them , then you can add more time (less time for the less fortunate). Maybe add some staircases that you though would go up but then turn upside down for no reason so you see that the decisions you take in life don't always end up in your favor.  Yeah, it's a not so good game but here are the challenges: - no very clear audible tones when you get to 10 seconds (louder pls) - No real instuctions (such as in life) - Confusing scrolling for the background screen. I had to end my turn with 14 seconds remaining because I couldn't scroll higher .... oh, maybe it's to keep us from becoming too 1% ??  It was not enjoyable, no lessons learned. Even with me as a low class 5 I managed to get to level 32 just with consistent work and concentration. I give it a 'meh'. ",
            "review_score": "-1"
        }
    ]
}