{
    "app_id": 449800,
    "name": "Attack on Titan / A.O.T. Wings of Freedom",
    "release_date": "2016-08-26",
    "developer": [
        "KOEI TECMO GAMES CO., LTD."
    ],
    "publisher": [
        "KOEI TECMO GAMES CO., LTD."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 18,
    "categories": [
        "Single-player",
        "Online Co-op",
        "Steam Achievements",
        "Full controller support"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Anime",
        "Action",
        "Gore"
    ],
    "achievements": 43,
    "positive_ratings": 2501,
    "negative_ratings": 479,
    "price": 49.99,
    "description": "An international hit anime &quot;Attack on Titan&quot; has come to Steam®! Battle is joined between the man-eating Titans and Eren and his companions. Experience the illusion of being in the anime, and controlling the flow of the story. The story from the anime, with a few original twists, is yours to experience!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/449800/header.jpg?t=1550182918",
    "minimum_requirements": "OS: Windows® 7, Windows® 8.1, Windows® 10 (64bit) Processor: Core i7 870 2.93GHz over Memory: 4 GB RAM Graphics: NVIDIA Geforce GTS 450 DirectX: Version 11 Network: Broadband Internet connection Storage: 25 GB available space Sound Card: DirectX 9.0c over Additional Notes: Pixel Shader 3.0 over 3D Accelerator chip , VRAM 1GB over",
    "recommended_requirements": "OS: Windows® 7, Windows® 8.1, Windows® 10 (64bit) Processor: Core i7 2600 3.40GHz over Memory: 8 GB RAM Graphics: NVIDIA Geforce GTX 760 DirectX: Version 11 Network: Broadband Internet connection Storage: 25 GB available space Sound Card: DirectX 9.0c over Additional Notes: Pixel Shader 3.0 over 3D Accelerator chip , VRAM 2GB over",
    "reviews": [
        {
            "review_text": "The best Spider-man Game I've ever played",
            "review_score": "1"
        },
        {
            "review_text": "While I admit that playing this with a keyboard is more of a chore than a game, if you have a controller and like the artstyle it's nice. Even better when it drops on next steam sales.  A good thing to spend the money you got back from refunding No Man's Sky.",
            "review_score": "1"
        },
        {
            "review_text": "This is a really fun game!  I'd recommend playing with a controller if you're thinking of buying it.",
            "review_score": "1"
        },
        {
            "review_text": "It's Attack on Titan-themed Dynasty Warriors, and it's is really damn fun. No seriously, It is really  really  fun.  So lets begin with the ODM gear and the combat mechanics.   It's been a long time since a game has gotten swinging from things right, in fact the only game I remember doing it properly would be Spiderman 2 on the PS2, but now I can add this game to that list. The ODM gear feels amazing and looks awesome and it gives a really nice sense of speed as you use it. It's very easy to get the hang of, too; you press X to fire your hooks and then all you need to do is point where you want to go and you'll go flying over there. Comparing this movement to the free Attack on Titan Tribute Game, it's not as in-depth or complex. For example, you can't aim precisely where the hooks go -- it's automated by the game and you can't fire only one hook, which I was a bit disappointed at, but it gets the job done. Also, you do need to have something nearby to hook onto, so if you find yourself out in the open you're not gonna have a good time. Thankfully though, you have an awesome horse and you'll be needing him a lot. He never falls behind even when you are moving at max speed with ODM gear, which is really nice and keeps the pace up.    The combat is nice and visceral, you press a button to lock onto a titan and then using the right joystick (Arrow keys for PC) you can target what part of the titan to anchor onto (Nape, left arm, right leg, ect). Pressing X fires out your hooks to that target (you can still strafe around them in this mode) then releasing the left joystick (or WASD) will bring you closer to that target to deliver your blow. You can take out all a titan’s limbs – taking out their legs will prevent them from running, take out their arms and they can no longer grab you – or you can just go straight for the nape if you want to, although the game does give bonuses to taking out limbs as some (indicated with an icon) may contain materials to use for crafting better gear. Cutting a titan’s limb or nape causes the game to go slow-motion for a brief second so you can see the huge amounts of blood that spews forth and drenches your character (also blocks your view) which looks amazing and the damage indicators help you to determine just how good your strike was. It all works together to create a really nice and incredibly satisfying combat system that goes as fast as you can input commands.  It feels really fluid and free-flowing – using the ODM gear to maneuver behind a large titan, engaging the lock-on mode and then hooking onto the neck, boosting at full speed towards it to deliver a single powerful strike to take down the titan down before disengaging the lock-on and then moving away from another titan as it reaches out to grab you – the speed of it gets my adrenaline pumping and it feels amazing!   Now that the combat has been covered, let’s discuss difficulty because you may have heard that this game is too easy.  This game really does make you feel like a badass but in the 5 hours of me playing it (On normal difficulty), I have yet to die once. I really wish that there was a harsher punishment for screwing up around titans, but the worst that happens is that you'll be grabbed and have to escape by button mashing and it's really easy to escape from. However, while I have never died, I have failed missions and objectives because while it does seem like the other soldiers are attacking titans, it appears they forgot all their training or are just scared out of their mind because I have never seen the AI 'C' Rank soldiers kill anything. So you tend to have to be everywhere at once and you need to prioritize between the objectives and when to resupply.  This gets the hardest in missions where you need to protect citizens because they couldnt run away from a titan if they had a entire month for a head start, and when they are scattered all over the map it gets really hard to keep them all safe, requiring you to be alert and sharp on your situational awareness, which is nice. I'd advise that you play on the hard difficulty if you want a challenge  Now lets talk performance, I run a GTX 970 with a i7 4770K (Overclocked) and I have only experienced one crash during my playtime which was when I was testing out the multiplayer. The performance is pretty good in most places, though the framerate does tank when several buildings are destroyed all at once but thankfully it never lags for too oftern because the rubble dissapears fairly quickly.  Some people find the control scheme to be a bit confusing. (With an Xbox 360 controller) A is to boost, X is to fire your ODM gear, B is to issue orders/resupply/mount and dismount, Y is attack, numpad for item selection, left stick is to move, right stick is for camera but when locked onto a titan it is to select what part of them to target, left trigger is to change the map mode while the bumpers and right trigger are absent from any commands (however if you dislike it you can rebind the keys in the options as you wish). One thing to note however is there is no mouse support at all, so use a controller if you can. The options menu is decent but apparently the game can't go above 1080p. It also asks you to play with Windows 7 compatibility mode which is amusing, but I digress, the game runs just fine for me.  Overall I find this game to be incredibly fun and I plan to get S rank in all the missions. Regardless of if you have watched the anime or not, I think that you'll find this game to be really enjoyable with its mechanics, one of the most fun games I have played all year and I can't see myself stop playing it any time soon.  Really fun, I definitely recommend it",
            "review_score": "1"
        },
        {
            "review_text": "Short no frills review: -Kill tons of Titans -Dynasty Warriors Style Combat -Chop limbs off of titans -ODM Gear works great -Use a controller -Game is like the anime -A lot of fun, but could use more character customization.",
            "review_score": "1"
        },
        {
            "review_text": "Gud game but u have to have a controller",
            "review_score": "1"
        },
        {
            "review_text": "Oh man, this game is so satisfying. I have to play it in bursts, because like some of the other reviews written here, the combat can become slightly repetitive. Cutting the arms or legs for extra resources and then having your team focus on the nape every time out can get a little... well, repetitive.  All in all, though, this game is fantastic. The voice acting is phenomonal, art style is fantastic and saving everyone under attack actually feels like it matters.   I thought 60 bucks would be a little steep for what I would get, but man, I'm glad I bought it. This game is great.",
            "review_score": "1"
        },
        {
            "review_text": "Overall this game is amazing. If you are a fan of the anime or manga, you'll love this. It follows the storyline perfectly and even has most of the anime scenes animated in 3D. However, as of writing this review multiplayer sucks. When you finally manage to get into a lobby (which is impossible half the time because it can't connect) you can't even do the mission before you get kicked or the game crashes. I hope this will be fixed soon but other than that, the single player is amazing. I would recommend using an XBOX 1 controller or PS4 controller. This game was definitely made for controller use. On the keyboard the controls don't really feel right. If you use the controller the button controls will be shown as XBOX controls, as the the game (and windows) was not set up for PS4 controllers. Just google 'How to set up PS4 controller for Steam'. In case you use a PS4 controller and you aren't aware of the XBOX controller: X = A, O = B, Square = X, and Triangle = Y. Pause is the giant button on the middle of the controller and options is emote. Other than that the controller are pretty much the same. I would absolutely recommend getting this game, if you're reading this before September 2nd there is a 17% off discount and it comes with the DLC. Hoped this helped.  EDIT: They have sinced fixed multiplayer and it is running just as smoothly as singleplayer.",
            "review_score": "1"
        },
        {
            "review_text": "I don't get why people are saying this is bad...The game is really good so far. The controls are a bit weird but you can change them.",
            "review_score": "1"
        },
        {
            "review_text": "It's basically an Attack on Titan themed Dynasty Warriors. It's fun, but can get repetitive pretty quickly. Camera is a bit wonky sometimes. And fighting titans in corridors can be extremely annoying, as you just can't hit what you want easily. Same problem when you fight more than one titan at the same time and they always run through your grappling hooks.",
            "review_score": "1"
        },
        {
            "review_text": "The game for most people works but I for one have not been so favorable. Until a fix comes for the instability of the game. I would consider taking a gamble on the game if your system can handle it.   Even if your system can then handle it you'd also have to go through the myriad of glitches and bugs that dwells within. Proceed with caution...   Otherwise the games content has been great so far from my friends actually playing the game! If you're a hardcore AOT fan that has been follwoing the content you'll definitely find that parts of the anime have been pulled and brought into the game.   The animation is top notch and each of the battles are very thought out and feels super refreshing when you can cut down titans. It's as if you are really part of the actual battling.  The only thing that I would point that would probably bother some people would be the repetition of side quests that one must do to progress further. This in itself could prove bothersome for most but if you can get over that then honestly the game is blast to play through.   The Co-op.. I cant say for sure but people who can get it working will probably find that it will be an enjoyable experience. For me personally, I can't vouch for that because of the buggy way it handles the co-op experience.   Overall, as said earlier if you can get through the hurdles that this port has, you'll find a phenomenal experience overall and the game itself will definitely cater to veterans and perhaps new comers alike. It definitely pays homage to the series that everyone has come to love!",
            "review_score": "-1"
        },
        {
            "review_text": "This game is yet another amazing creation thanks to koei entertainment it has the feel of both AoT and the Dynasty Warriors games (with which i love LOVE LOVE!!!!) currently only on chapter 2 but have been farming the side quests like crazy with Levi must say 12.2 hours straight and did not get bored or want to go away from the game (did for reasons of eating drinking and toilet needs) the only issue I have with this game is the multiplayer does not work but hopefully this will be looked at quickly.",
            "review_score": "1"
        },
        {
            "review_text": "Pros:  - great animation that is friendly to weaker PC's (which is why ps4 can handle it at 60fps) - Good and accurate following of the AOT storyline - AWESOME COMBAT SYSTEM that will really immerse you in the action - Music was ok? (not much to say there i was too busy cutting titans to notice) - FIGHTING TITANS AS A TITAN (EREN) WAS THE COOLEST THING EVER!!!! THERE WAS NOTHING COOLER THAN PUNCHING A TINY TITAN AND SENDING LIKE 2 OTHERS WITH IT FLYING HAHAHA!!!  Cons:   - (personal opinion) i think the whole needing to adjust which part of titan to attack before you actually attack thing is more of a pain than fun to me i hate having to slow down just to aim at nape i like RAPID TITAN GENOCIDE!!!!!! EREN STYLE!!!!!!!!  GAME RATING: 8/10  ill be honest i got this game from ebay for like 20$ and even though i was initially skeptical of it at first i have grown to like this game alot especially for the combat system! The combat system really makes you feel like a part of the action seen in the anime! As i fling around like spiderman with levi slicing titans up like salami i cant help but get really engaged in the combat and feel immersed into this wonderful universe. The story sure does seem to be going by quick though but even so, with how fun the combat is in this game it will be something worth playing over again in future and i certainly think they did good with the game considering how little story content is available with the anime.  EDIT: yea finished game story completely and really appreciated just how well they stretched out the rather small story from the anime it was a quick play but it is something i feel i will come back and play again as this game is quite fun and a bit challenging when trying to excel in missions",
            "review_score": "1"
        },
        {
            "review_text": "I was really excited for this game...I saw it come out on steam and got it right away and looked past all the downvoted comments about it. I thought 'Man the controls can't be that bad'..but I was wrong. At first it really isn't that bad...you can TRY to remap them but it doesn't seem to stick. The buttons are reveres on an Xbox controller, at least for me. The A button is the X button (but the dialog will still say hit X so you hit A instead...) and the B button is Y and vice versa. Also there isn't a PAUSE button...at least not for me. I've tried re mapping the button for it but it still doesn't work...the camera rotation while standing on the ground is just god awful you need to use the left and right triggers just to spin the camera to look at something when you aren't locked onto a target...I have no way to save because I can't open the damn menu to possibly hit 'Save' the game has crashed now about 3 or 4 times and I've had to redo an instance over and over because there isn't a save button. Each time I go to hit a titan the game crashes on itself. I've never refunded a game before...but in all honesty I want my 60 bucks back, I'll re buy it again maybe when the devs revamp these main issues...Other than that the game is stunning and the voice acting is great the story is accurate but it's really dissapointing that the game is barely playable. I even almost thought about hitting the check box to 'recieve this game for free' but the graphics on it are just too nice to ask for that, and the work that went into it is really enjoyable it's just the port to computer that messed it all up. So if you wish to get an Attack on Titan game...you might want to wait on this one until it MAYBE has some patches.",
            "review_score": "-1"
        },
        {
            "review_text": "Who was responsible for porting this game? using my 360 controller, X is accept, and Y is back. None of the essential command prompts for attacking, interacting, jumping, etc. are correct. It claims things like A=X. I've seen some pretty bad ports, this is one of them.   If you can get past this though, the gameplay is quite fun. My work around was to use the Steam controller in Big picture. Over 40 hours in, and i'm still enjoying myself. The timed side missions provide a great source of mild tension which motivates you to go as fast as possible. The extensive crafting oportunities begging to be discovered plays right into my list checking obsessions. I can imagine this game being a lot of fun for completionists.   As for the game, you are put in an open map with lots of enemies populating the area. From here, you are often presented with Green and Red markers on your map. The Red one is the main objective, and is required to complete the mission. This can make missions as short as 29 seconds if you are skilled enough.   The Green markers are timed side missions which will help you complete the main objective. These are entirely optional, and only really needed if you want to get the S rank, or to unlock the Dire Subjugations. Again, these are both optional, but performing Dire Subjagations and getting S rank gets you additional crafting materials and are tied to some achievements.",
            "review_score": "1"
        },
        {
            "review_text": "Wings of Freedom is exactly what I wanted in an AoT game, fast paces grapple hooking with a simple yet complex combat system, about the only things i would change are the lack of V-snyc (the game has a LOT of screen tearing) and the abillity to turn off voice chat for multiplayer, and actually working mulitiplayer. Other than a few preformace issues its well worth the money, the single player alone is choch full of stuff to do, loaded with an amazing story that goes past the anime version of AoT and has more side quests than ive ever seen in any game, easily surpassing even skyrim in stuff to do. My personal favortie part of Wings of Freedom in the ODM system, swinging around sclicing open titans feels amazing and the controls couldnt be simpler (you push a single button, thats it, its better than it sounds i swear) I've heard that crashes run rampant in this game but I've only ever had crashing issues in multiplayer, windows 10 is also not the best for this, but i made it work. Also, if you dont have a controller this game might not be the best, ive never tried to play it with a mouse and keyboard but I imagine it would be hell, also if you're not a fan of Japanese dialogue i would be catuois, as the game has only that, no english here mentlgen. I think its an amazing game that is loaded with content and has hours of fun, but might have some technical issues. for me personaly i give it a solid 9/10 they just need to add more video options, thats about it",
            "review_score": "1"
        },
        {
            "review_text": "EDIT:  Alright, I'm finally in game. But only once I bought a wired Xbox One controller for PC. It worked without a hitch (I originally was using an Afterglow PS3/PC wireless controller). The game is great, and while it may seem like something that'd get old, the combat is extremely satisfying. The characters feel like their original depictions and I don't care what anyone says, I love Armin, and his gameplay is actually quite fun. It's awesome to play through the original story, and I had to force myself to pull away for sleep.   I might say you need to know the anime for a fully satisfying playthrough, but it's fun either way. Then again, to each his own.   BUT:  The devs really need to fix the controller mapping issues. You shouldn't have to buy one particular controller or go through the hassal of downloading an extra program to make your controller MAYBE work to play.  ----------------------------------------- Original:  Firstly, I'd be the first to give this game a thumbs up, totally recommend it. But I can't, yet, because of the mismapping bug when it comes to controllers. The keyboard 'mouse' optimization is, from what I've heard, horrible, so it rather forces you to get a controller.   I was ok with this, seeing how excited I was to actually get to play this game, so I bought a ps3/pc controller. It works perfectly without hitch with all my other games. But then comes AOT, where the 'x' and 'a' buttons are switched, as well as the 'y' and 'b'.   Granted, I can sort of manage with these controls. But it's a lot more unintuitive than it would be, I can tell by just the way my fingers want to press when I tried to play. So, it just wasn't fun.   I tried multiple emulators and self fixes that ended up being more confusing and unhelpful than anything else for literally, hours, with no change. This should NOT be a hard thing to patch, and it shouldn't be something to patch in the first place. This game has been released for quite a while, and being released here, now, for full price, which such a stupid bug that I imagine could be very easily patched, is ridiculous and honestly very frustrating.   It's not even a matter of the type of controller, seeing as people with the full work up of controllers have reported the same problem. Sometimes trying with PS3/4 controllers that didn't work and Xbox One controllers that did when switched out, and vice versa.   I'm a rather patient person when it comes to this stuff, but this is just stupid. Patch it already.",
            "review_score": "-1"
        },
        {
            "review_text": "They said 'Full controller support' but my xbox360 controller didn't work properly. Terrible keyboard configuration and you can't use mouse for looking around.  Game itself is really good. I'm AOT fan and KOEI did a good job from this aspect i think.  If they release a patch for true 'Full controller support' i will change my rating negative to positive. If they don't, i will definitely want refund.",
            "review_score": "-1"
        },
        {
            "review_text": "The best anime game I've ever played, but wait for a sale if you're on the fence.  PROS:  It is very satisfying to use the 3d maneuver gear. It's not as skill-based as the fan-made game, but it looks and feels great. Cables actually have to attach to trees/buildings/titans in order for you to take off. Kind of like in spider-man 2 for the PS2.  Combat feels satisfying. Once again not very skill-based compared to the fan-made game, but you feel badass slicing titans up.  The story is just the anime, with something extra thrown in too. It took me 10 hrs to complete. Cutscenes are done very well considering it's an anime game. Voice acting is great too.  Multiplayer is kinda cool too. Adds some replayability.  Titans are very different from each other. Lots of variation. You might see the same titan once or twice, but not very often.  Graphics are very good too for an anime game.  CONS:  Game was a too easy, even while playing on hard. I would S-rank almost every mission without even trying, and died only once in the whole story.  Sometimes game bugs and titans just stare at you and/or clip into buildings/the ground.  Annie isnt aggressive enough.  Price is too much. Wait until it hits $30 or is on sale, if you are not a die hard Attack on Titan fan.   Oh, also use a controller with this game.",
            "review_score": "1"
        },
        {
            "review_text": "You pretty much finish the whole thing in 9 hours and there isn't really anything else to do except repetitive and grindy expedition quests. I can't say it's worth the price but it is worth it if you like the anime Attack on Titan, the combat was done well and everything feels right. But if you didn't watch the anime or didn't read the comics then the game would feel a little bit cheesy for you, and it certainly is a generic japanese action game like Dynasty Warriors or even monster hunter, with even less contents. I do recommend this game for its satisfying combat but do wait for discount and ask your friends to buy it too, it is way more fun playing with friends.  P.S. I started playing Battlefield 1 Beta one day after buying Attack on Titan and surprisingly I spent more time on Battlefield 1",
            "review_score": "1"
        },
        {
            "review_text": "once you get a hang for it its so much fun!!!",
            "review_score": "1"
        },
        {
            "review_text": "With only being 3 hours in, I'll come back and change this review if my mind changes.  *edit - 10 hours in and the game is still freaking awesome, absolutely love it. I will say make sure to play it on hard if you actually want a challenge and for goodness sake, get a controller. The majority (if not all) the bad reviews refer to the keyboard controls. I agree that the game should come with good K+M support, but don't let one bad aspect dampen your experience for an overall great game.   This game is tons of fun.  It's basically what you would get if you took the anime and:  -Kept the amazing story -removed 80% of the tedious inner dialogues -actually be the one jumping around and killing titans  That basically sums up my first 3 hours.   I am a bit annoyed at the lack of graphics options (no AA, VSync, and resolutions above 1080p) but with everything maxed out I stay pretty steady at 60fps, occasionally dipping down to 45, which is actually kind of sad for a GTX970, but I'm happy enough with it.  I haven't had any of the control problems that others have had, I use a standard Xbox 360 controller.  Assuming you have none of the issues others are running in to, this is a great game regardless of whether you have watched the anime.   This is basically the opposite of No Man's Sky: no hype, low expectations, awesome game.  Now if we could get a Claymore game . . .",
            "review_score": "1"
        },
        {
            "review_text": "Worth a buy for sure. The gameplay is amazing considering how easy it is to fly around switching targets and attacking without feeling like the controls are playing against you. Once you get the hang of it, you will be taking down Titans with ease. Great game!",
            "review_score": "1"
        },
        {
            "review_text": "After playing this since it came out I have chosen to write a review  A.O.T Wings of Freedom has been a rollercoaster of a game, one of koei's best in my opinion, They portray the anime's story very well without giving so much that you feel like you are playing the show. It sets you in a dynasty warriors like atmosphere working with teammates to clear the area of Titans, doing side missions, trying to get that Dire mission, and then finishing the mission.  Pros- Great gameplay, fast paced with no faults in controls (user error will have you blaming the game) Story is fantastic, a little short, but the endless coop makes up for that Great for people new to the series Grinding for materials have been fun, (not a fan of grinding usually) Everything the Anime's fans have wanted Coop hasnt been an issue to myself Slice the **** Out of titans  Cons- Titans limbs glitch, with the rag doll physics (not making the game unplayable) People complain about graphics and coop, but there have been fixes Some characters are so useless over the main 3 ARMIN IS IN THE GAME (Worst character in the game.....)  All in all the game has captivated me, a continues to shock me, i give it a  9/10   ",
            "review_score": "1"
        },
        {
            "review_text": "Awsome game, it didn't crash any time for me!!!  I completely recomend this game!!",
            "review_score": "1"
        },
        {
            "review_text": "The game is wonderful. It is very similar to the fan game but with more fluid controls. It's a little easier then the fan game but still very enjoyable. It has the whole story of the show in it which i really enjoy. It also contains a multiplayer although i havent had it work for me yet ",
            "review_score": "1"
        },
        {
            "review_text": "Too much ♥♥♥ 11/10",
            "review_score": "1"
        },
        {
            "review_text": "Enjoying swinging around chopping stuff. Only thing i can think that the game needs for me is better camera lock on yourself outsie of battle mode, mouse controlls being usable in game and in menu, and the option for cloud saves. Game controller works fine but i just prefer mouse controls personally. Other than that if you are a fan of the manga or anime, I think you'll enjoy this.",
            "review_score": "1"
        },
        {
            "review_text": "I started a new story mode game, then the tutorial begins in the training grounds, in a lucky strike i destroyed all the objetives by myself, so I thought, 'Oh! Eren can be the best indeed'. BUT! in the mission ending cinematic Mikasa still wining (all my efforts squandered).  10/10 The natural order of the universe continues, otherwise would explode.",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this with a caveat: you already liked Attack on Titan/Shingeki no Kyojin, either the anime or the manga. Is it an amazing game? No. Does it provide a sense of flying around slicing things to bits like Levi or Mikasa? Yes. Also provides a sense of faffing about and watching other people do the heavy lifting, if you play Armin.  On the flip side, if you don't know who Armin is or why he's simply weaker than the other characters, and don't care for whacking obese cannibal Ken dolls, this is probably not the game for you.  The port is of mixed quality. Multiplayer appears to have some weird crashing issues due to sloppy Steam voice interactions, many people (including myself) have had to use Xinput to remap controller buttons, and the game doesn't support resolutions past 1080. On the flip side, it runs smoothly (haven't noticed any FPS drops), once adjusted the controls suffer no input lag, and the graphics look better in play than in screenshots due to the speed you're usually moving around at.",
            "review_score": "1"
        },
        {
            "review_text": "First off, I'm a big fan of the anime series. That's why I had this game on my wishlist since it was released on Steam. But, it's just not a good deal at full price. I picked it up during the Steam Winter Sale when the price was at least a bit more acceptable. Since then, I've put in almost 3 hours of play time on it and I'm starting to feel not entirely satisfied with this game despite it being a pretty fun game so far.  Here's a few of the negatives that I've noticed thus far. These are things you may want to know before buying this game: - Upon starting the game for the first time in Windows 10, it asks to be put into Windows 7 compatibility mode. Great! So this game is not entirely compatible with the number-frickin-one OS in use on the planet. That's just frickin' awesome. Awesome programming jobs, devs!  - This game is a port of a console game (something I did not know and is not apparent from all of the info on it here on Steam). And, to top things off, it's not a very good port. There is ZERO mouse input accepted at all. All input is done by either keyboard or controller. So, you need a controller in order to really play this game smoothly as I hear the keyboard controls are somewhat awkward. You can tell that the porting job was done to very bare minimum standards.  - This game has game stopping bugs and it appears there's been no attempt to fix anything since Sept. 2016. Apparently, some crashes can be fixed on some systems using Nvidia GPUs by rolling back the driver to a specific version. It still doesn't make me feel any better that I should have to jump through those types of hoops just to get the game to work.  - This game has video issues. Apparently it doesn't like resolutions larger than 1920x1080. And there is a lack of ability to set some basic video options like Vsync which is a problem with this game. Those with Nvidia GPUs can force the game to use VSync through the Nvidia control panel.... again... shouldn't have to do that just to play the game normally, but it's just another one of those little things that you have to put up with if you really want to play this game.  Aside from all that, the game is still fun. I mean, taking down titans gets repetitive after awhile, and being only 3 hours in, I haven't yet experienced the grind that others have mentioned. So, that's what's been keeping me interested at least this long. Had it been any less interesting, I would have dropped this game an hour in and asked for a refund. But when it works, it is exciting and fun. So, I'm going to continue to recommend it for now, but that may change in the future depending on whether or not there are any additional issues that pop up.",
            "review_score": "1"
        },
        {
            "review_text": "If you love the Anime you HAVE TO play this game.  -------------------------------------------------- Levi OneLove ^_^",
            "review_score": "1"
        },
        {
            "review_text": "Very good game folows the story.  If you DON'T Own an Xbox One or Steam Controller The Controls are ♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "really nice game  nice action  nice idea  just wished that they put the same music on the anime but still nice music the game have",
            "review_score": "1"
        },
        {
            "review_text": "  Game is alot of fun and here is why! 1.It has beautiful graphic 2.Follows the storyline of the series 3.Great gaming experience AND 4.You can kill all those sons of bit*** and trust me you will enjoy it! ^^",
            "review_score": "1"
        },
        {
            "review_text": "Great game, I highly suggest getting a logitech controller if you don't already gave one. You'll enjoy the game much more!",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Fluid combat. Good and mindless fun.",
            "review_score": "1"
        },
        {
            "review_text": "Without those crashes, it would be perfect. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is more fun than any mortal sin has the right to have.  I hate how games like AOT and God eater arent advertised on steam, i saw both mere days before release and had no idea they would port it to PC.   I have a weak ish PC  i3 3.1 GTX660 2gb 8GB DDR 3 RAM  and the game runs smooth on max at 60 fps (dipping to 50 sometimes), the combat is fast fluid and really fun, if you liked traveling as spiderman you will love this although having to refull gas cans and restock blades breaks flow a little. The artists nailed to look and the game in both charater models and areas along with the origanl voice actors (no eng dub, i dont care but you might)  Id HIGHLY recommend a controller,im using a xbox one controller and have 0 issues with it.  The game has negative points, * must be played in window 7 mode * must use a controller * no eng dub * little graphical settings  all in all its a very solid game and port and i recommend it to any AOT fans or anyone looking to have a good hacky slashy fun time.",
            "review_score": "1"
        },
        {
            "review_text": "This game is Great, Awesome",
            "review_score": "1"
        },
        {
            "review_text": "For the game it is, I think it was really well done. The game is quiet repetitive, but there is a good amount of content in the game to keep you going for a while, can't expect much in a game that's based off nothing but attacking giant humanoids. The camera seems difficult to get used to at first, but once you understand the movement it is really easy to anchor to something. Movement is suprisingly quiet smooth and the right technique can have you soaring across the sky and slashing the napes of any opponent. The character selection and each personal skill is a nice touch allowing people to play as a brute, a defensive, or even a stratigic stand point. Really well done and would reccommend it to fans of the show and people who are just getting into it. I expect great things to come from the game as it progresses and as Season 2 is released.",
            "review_score": "1"
        },
        {
            "review_text": "from the hours i've played writing this, its a ♥♥♥♥ing great game. Thankfully i was already used to One Piece pirate warriors controls",
            "review_score": "1"
        },
        {
            "review_text": "Good controls, fun movement and combat, pure AoT mayhem. Great game to just go out and have some fun killing Titans.",
            "review_score": "1"
        },
        {
            "review_text": "The game is really fun if you like the anime than you'll like it even more. Its a fun but repetitive game I like the manga, anime, and now I'm in love with this game. If you dont have a Playstation or Xbox controller I don't recommend it. The keyboard mapping isn't good at all. If you have a controller you get used to the mapping of everything after the first few trainings and mission. I haven't had it crash on me or anything even while playing with a friend which is alot of fun just slaying a ton of titans with a friend or two.   Buy the game if you want to, don't let other people opinions persuade you to buying it or not. Yeah sway you to one direction more than the other but just do what you want if you want a fun but really repetitive game that has horrible keyboard mapping but has a nice feel on a controller go for it. If you like the anime and the manga and you want to slay a ♥♥♥♥ load of titans go for it. IF you cant stand that much gore there is an option in the settings to make it a lot less bloody for people who dislike it.   What I'm going to say is if you have some spare cash and you really like this anime go for it, play it for a little bit under 2 hours and see how it feels if you dislike it refund it you get your money back and you don't have to think about it. Its fun like really fun. ",
            "review_score": "1"
        },
        {
            "review_text": "Do not buy this game until you have a controller the keyboard controls are utter ♥♥♥♥ and I'm not joking.  I know it's a console port but if your going to put a game up for pc atleast make the controls usable for pc people with no controller, granted a controller isn't a lot of money but still.",
            "review_score": "-1"
        },
        {
            "review_text": "How do i say this... Its an amazing game. I recieved my ROG Asus laptop, fit with an NVIDIA GTX1070, with 16gb of ram, and it runs this game quite beautifully... I do of course have a few complaints. Ill get the weeaboo crap out of the way first. They dont use the OST from the show, and the 3DS game. The music of Attack on Titan is beautiful, and the last thing it needed was different music. Its not that bad though, as the music is very similar... but still, cmon guys. Second off, Titan Eren's roar is... eh... it could be better. it sounds too much like a 90's monster movie roar, that is obviously just a normal guy in a suit, trying too hard.   Now for the Technical problems. While a gaming laptop isnt the perfect system, this laptop is very beefy. The gtx1070 is one step below the 1080, which to my knowledge is the most powerful card made by NVIDIA. (correct me if im wrong. be nice, please.) Ive gotten quite a few frame rate drops, and blur problems. This game being kin to dynasty warriors, of course the sheer number of enemies and action on screen at any given time, is intense, so it really is just the game. If youre like me, you can slaughter huge numbers of titans very quickly, across several platforms. (Biggest AOT nerd ever, right here. js) While its possible on the PC version, this is one game that i by a very slight margin think the console version is better.   DONT PLAY WITHOUT A CONTROLER   Seriously. youll need one.  If youre batshit crazy for Attack on Titan, these problems are pretty small and shouldnt matter, but i dont reccomend this game for anyone without NVIDIA GEFORCE graphics power. I Have this on my work laptop and my desktop, and honestly, the ROG laptop is the only one that runs it competently.   Hopefully this review helps somebody. Overall its a good damn game. Especially if you like games like dynasty warriors, with huge numbers of enemies, and showers of blood. Happy slaying!  *Salute*",
            "review_score": "1"
        },
        {
            "review_text": "TAM also known as (True Action Mode) is where the real fun begins.  The combat is absolutely amazing, probably some of the best AI I've seen in gaming decades. If you loved the anime dive into the game you'll even get extra bonus episodes (to play) that go beyond the anime series.   I have alot of concerns with the game but I can see that this game is full of potential &amp; I just cannot get enough of the combat it's awesome &amp; has smooth gameplay. (Better with a controller)  If you can bite the grind &amp; make it towards TAM, the difficulty curve &amp; requiring groups for multiplayer is really challenging, I wish more people played this.  I may end up writing a review with my concerns but for now this is all I have time for.",
            "review_score": "1"
        },
        {
            "review_text": "i love this game so much it is amazing, like a dream that comes true!!!! there are so many missions so many things to do it never gets tired! level up the characters to gain skills, completing sidequests for funny cutscenes and even some costumes!  the maps are so detailed the titans are funny, deadly and sometimes even cute and don't mind eating your comrades.  i recommend this game to every attack on titan fan, it is an amazing experience you just have to try",
            "review_score": "1"
        },
        {
            "review_text": "Obviously, the first thing going through your mind is 'Is this game worth $60?' Maybe  But is this game worth getting when it's on sale? Definitely!  Attack on Titan the game is a fun game, especially for those that enjoy Koei's Musou games  Pros- - The game follows the premise of the anime, all the way to the end of the first season  - It does this very well, but of course changes a few things to give the player more to do - The gameplay is smooth and looks pretty good visually - The soundtrack is nice - The voice actors did a great job, like with the anime - Sandbox maps for maximum destruction! - The NPCs help in combat a fair bit (a lot more than the other Musou games) - Costumes and different varients of the 3DM (ODM)!  Cons- - Lacks Mouse Compatibility (irrelevant if using a controller obviously)  - Having the use of the mouse would only make the game easier in my opinion (camera control)  - Easily fixed by adjusting the Keybindings to your liking (my layout is kind of similar to a controller) - Small roster of characters to pick from, but this is understandable since it's the first game in the series - No one on Multiplayer  - Let's get more players into the game and go on a titan killing expedition! - DLC is kind of pricy  - No DLC characters",
            "review_score": "1"
        },
        {
            "review_text": "I was not lucky enough to get this game started. I get through all the menus fine and everything loads up so quickly, but actual gameplay is super laggy and slow. I have a 4gb Nvidia 970M graphics card, 8gb RAM, and an i7 and I've lowered all the settings and still can't get the game to run smoothly. I can get witcher 3 to run perfectly but this game stutters and lags, very choppy. I'm a big fan of the game so I'm just getting it on console.",
            "review_score": "-1"
        },
        {
            "review_text": "Spiderman meets ALL HACK N SLASH. Only thing that is missing is when you start the game you don't hear, 'Sie sind das Essen und wir sind die Jaegar!'  Please Fix this bug :)   10/10",
            "review_score": "1"
        },
        {
            "review_text": "I used the money i refunded no mans sky with for this. worth it",
            "review_score": "1"
        },
        {
            "review_text": "sweet game lots of fun little bugs nothing that ruins the game tho",
            "review_score": "1"
        },
        {
            "review_text": "Attack on Titan / A.O.T Wings of Freedom is a fast-paced action hack-and-slash that is addicting and satisfying.   Although the gameplay/mechanics never really change, there is something exhilerating about doing a backflip off of a horse and then pulling off a 1080 spin to cut the limbs off of a bunch of naked giants.   Pros: -Beautiful Graphics -Amazing Cut Scenes -Fast and Fun -Mikasa's Gameplay -Multiplayer Mode  Cons: -Short (But feels long due to the repetitiveness) -Awkward Female Titan AI -Poorly tells story (But that is what the show is for)  Buy this game if you're a fan of the show of if it's not full price. 7/10 - Fun Game",
            "review_score": "1"
        },
        {
            "review_text": "Spoiler: you kill titans.   This game was good, but don't play if you hate repetition. You kill titans endlessly, but you get to play Levi so it's all good. &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "without a doubt one of the best Anime games I've played in the last few years. Highly recommended for all anime fans!",
            "review_score": "1"
        },
        {
            "review_text": "Aside from the having crash to desktop issues in multiplayer (apparently due to the voice chat in game) and having to fiddle with the graphics settings to get a smooth framerate, it's a pretty solid game. The controls are good and the game gives you a great sense of flight when using the Vertical Maneuvering Equipment. Follows through the anime's story plus some epilogue.",
            "review_score": "1"
        },
        {
            "review_text": "Its what I waiting for all time.",
            "review_score": "1"
        },
        {
            "review_text": "my computer  i7-6700HQ 2.60GHz Ram8 GB NVIDIA Geforce GTX 960M isn't smooth  i couldn't do anything lolz please tell me why :(",
            "review_score": "1"
        },
        {
            "review_text": "this game is gud",
            "review_score": "1"
        },
        {
            "review_text": "Very good Game. As well, I recommend this game. Good graphics, gameplay, etc. No, the controls are good. Fun Game and you should buy it.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of my best games. If you like the anime you will most likely like this game a lot!!!!",
            "review_score": "1"
        },
        {
            "review_text": "This is one of my best games. If you like the anime you will most likely like this game a lot!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful and badass all at once. Adore AOT and absolutely love this game so far!",
            "review_score": "1"
        },
        {
            "review_text": "So if you are on the fence for buying this game, here is a little insight into the gameplay.  You learn how to play,  Its starts to be very easy,   You face Annie, and it gets harder,   its easy again and nothing is a challenge.  I wouldn't say that this game is worth the 59.99, But I had a couple of good days playing it before I got bored.",
            "review_score": "1"
        },
        {
            "review_text": "There is no mouse controle and the game will show you the controles with a controler  ig you are useing a controler then i recomend this game.",
            "review_score": "-1"
        },
        {
            "review_text": "on play to start the game, the game doesnt want to start, steam show that it's starting with green light letter then the game automatically close without even starting. better play imouto paradise",
            "review_score": "-1"
        },
        {
            "review_text": "How you get away with selling such garbage blows my mind.... clear example of how mindless fanboys will upvote garbage ports just because they liked the show.. I fear for the future of gaming when ♥♥♥♥ like this exists in 2016..",
            "review_score": "-1"
        },
        {
            "review_text": "i love the anime, i love the game. if you love the anime, you will love the game.",
            "review_score": "1"
        },
        {
            "review_text": "not working on GTX960m driver updated to this day, i7 47xx, win10, 16gb ram.. tried verify cache and win7 compatablity... im disapponted but please do a quick fix!",
            "review_score": "-1"
        },
        {
            "review_text": "Huge AOT fan! Very disappointed that there is no mouse support and my logictech controller doesn't work. The game is unplayable in its current state. Please add mouse support or controller support!",
            "review_score": "-1"
        },
        {
            "review_text": "I can only review the graphics bc I can't play gdi. Nice graphics and sounds are good.  I mean what's wrong with the control? Too many problems with the control and controller! My first problem is that x, y, a, b go wild, I can never follow the instructions told in the game and it's giving me headache trying to think what is what. Like x for a, y for b. Second problem is I can't use R to toggle between parts! I use Logitech Gamepad F310 that works well with every other games I have, and you know I just can't even finish the first mission given! Many people share the same problem, so I don't think my controller is the problem.  And I paid more than 1,000฿ to have this game, this is not fair.",
            "review_score": "1"
        },
        {
            "review_text": "If you're looking for a gaming experience that's fun, true to the source and with high replay value this is the game for you. The missions can be quite repetitive but it certainly can be looked over. Killing titans and making you feel like a bad a$$ is the true appeal of this game. Sharpen your blades and prepare for battle cadet!",
            "review_score": "1"
        },
        {
            "review_text": "this game soooo good but my pc spec soo bad   still i can play it with some fps drop",
            "review_score": "1"
        },
        {
            "review_text": "Controls are wacky asf. No mouse support to look around... On a pc..? Hello? With a controller the keymaps are inputting incorrectly + no D pad camera rotation. Do not recommend in its current state.",
            "review_score": "-1"
        },
        {
            "review_text": "It´s lagging evbery time and I have:  -i7 6700 3.40GHz -GTX 1060 -8GB RAM -Windows 10  Does anyone know how to solve this problem?",
            "review_score": "1"
        },
        {
            "review_text": "This game is great...ignore any bad reviews and buy while its on sale.",
            "review_score": "1"
        },
        {
            "review_text": "I know it says i recomend this,  but i dont...  there are no Prinnies, therefor this game is awful 0/10 - too few Prinnies, too many naked people.",
            "review_score": "1"
        },
        {
            "review_text": "This doesn't work with a keyboard.  Other than that, 10/10",
            "review_score": "1"
        },
        {
            "review_text": "VERY BAD GAME!  IT CRASHES AFTER THE TUTORIAL",
            "review_score": "-1"
        },
        {
            "review_text": "Team Levi",
            "review_score": "1"
        },
        {
            "review_text": "This is a great and fun game. I might have stayed up all night playing this xD",
            "review_score": "1"
        },
        {
            "review_text": "I absolutly LOVE this game, yet it runs so horribly on pc",
            "review_score": "1"
        },
        {
            "review_text": "Controller support is currently broken, with buttons being flipped for most people.  Not worth buying currently.",
            "review_score": "-1"
        },
        {
            "review_text": "I thought it would be a masterpiece ; the definitive game of attack on titan , but it isn't true : the animations , 3d models and the story are perfect , but it lags continually with monstous drop of FPS and there are many crash . I think it should not happen in a pc with : - CPU : intel i7 quad core 3,3 ghz -RAM : 16 gb  - GPU : 2gb please fix it !!!",
            "review_score": "-1"
        },
        {
            "review_text": "xbox 360 joystick will keep you rotate the camera until the world end.",
            "review_score": "-1"
        },
        {
            "review_text": "Will not launch, the launch box opens and closes endlessly without the game ever actually opening.",
            "review_score": "-1"
        },
        {
            "review_text": "I don't know what is going on with this, but this game needs a serious fix. This game is more demanding memory and graphics wise than any other game I own on PC, and this game is nowhere near the amount of quality and detail as those. I got all the graphics turned off and i'm barely managing 30fps on 720p.  As a comparison on more of my graphics hungry games, I run 60-120fps at 1080p or 4k, with them set at full throttle. I haven't seen issues on the console port, so you NEED TO FIX THIS GAME! Patch it, recall it, de-list it, whatever, but you need to do something about this crappy port.",
            "review_score": "-1"
        },
        {
            "review_text": "GOTTA SLASH'EM ALL~",
            "review_score": "1"
        },
        {
            "review_text": "This Game good it fun tbh BUT   why when i play Multiplayer i have to set my mic  to Stereo Mix this not good tho and i buy this game cuz i wanna play with my friend  and what about this game keep crash when i play Multiplayer",
            "review_score": "-1"
        },
        {
            "review_text": "wack toukiden is better than this",
            "review_score": "-1"
        },
        {
            "review_text": "As soon as i started to play it lagged and was not good for keyboard so i got my xbox 1 controler still lag restared my computer lag lag lag i tried to make it not lag but still lag",
            "review_score": "-1"
        },
        {
            "review_text": "Terrible port, terrible controls, frequent crashes. i'll give it a final rating of   Arkhamn knight PC port/An actual PC game",
            "review_score": "-1"
        },
        {
            "review_text": "  Impossible to play with a controller as the game doesn't recognize about 1/4 of the buttons.",
            "review_score": "-1"
        },
        {
            "review_text": "left stick isnt mapped. this game blows.",
            "review_score": "-1"
        },
        {
            "review_text": "HORRIBLE! totally broken!! it says to press A on a controller, but somehow that button is now X? and my Start button is somehow RT?? do NOT waste time on this, it's horribly broken!!!",
            "review_score": "-1"
        },
        {
            "review_text": "This game all in all is pretty good. The combat intially can be hard to get the hang of but once you get it you move with ease and fight gracefully. The AI is pretty good at supporting you and the story is decent. Its not worth sixty dollars but its not a waste of money.",
            "review_score": "1"
        },
        {
            "review_text": "Really good game. Only issue is that sometimes the game doesn't respond to RT on my controller to initiate a decisive battle signal. other than that its fun.",
            "review_score": "1"
        },
        {
            "review_text": "Dynasty warriors on crack, gets a little repetitive but is a hell of a good time.",
            "review_score": "1"
        },
        {
            "review_text": "I love the game, but please repair multiplayer it is really bugged . Crashes when I try to play .",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game especially when you are a fan of the anime.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome Game! I actually like the game better than the anime lol fast pace, Full speed all action! gameplay is freaking awesome! a must have",
            "review_score": "1"
        },
        {
            "review_text": "This game is a must buy if you are a AoT fan!  It feels like playing the manga/anime.  I have 20h played so far and not getting bored.  I have no complaints, this game awesome!  Some misc. stuff: Game plays amazing with steam controller. Check the community profiles! You have to limit the game to 60HZ or use VSync in order to have the main menu not bug out. It's just a minor inconvenience.  Enjoy!",
            "review_score": "1"
        },
        {
            "review_text": "A unique game that lets you whizz around like a flying monkey squirrel while fighting creepy man eating titans. It follows the original story very closely and even features all of the voiceactors from the anime while sporting a new awesome soundtrack. There are some rpg elements to it, characters level up unlocking new traits and during every mission you collect materials that can be used to upgrade or purchase new weapons. By the time you reach ng+, you'll wish you had better weapons - luckily there's also an Expedition mode that you can play solo or coop to get more materials.",
            "review_score": "1"
        },
        {
            "review_text": "Good game.  Somehow still dc during the co-op.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best games I have ever played. The story of attack on titan is presented nearly as well as in the anime. I recommend this game to every anime fan PLAY IT!!!",
            "review_score": "1"
        },
        {
            "review_text": "If you liked the anime then you'd like the game.  Takes a little bit of time to get used to the controls, but once you figure the button pattern it gets easy and a little repetitive.   Classic and good gear progression which might keep you playing. The single player only took about 6 hours of actual play time.  Not sure if it's worth 60 dollars for what it is, but the game is fun. I'd recommend picking it up on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely incredible game; really captures the 'Feel' of the action.",
            "review_score": "1"
        },
        {
            "review_text": "it is a great game and is fastly played howeveri would not recommend this game to a fps fan but for an anime fan this would be awesome!",
            "review_score": "1"
        },
        {
            "review_text": "Bad port, but very fun game!  Using a 4K TV, 4K isn't even supported, and the screen tearing is UNBELIEVABLE in full screen. Tried using Borderless gaming with my TV set to 1080p but BG doesn't even detect the game. Tried overriding DX Vsync using RadeonPro but that doesn't fix it by any means. Also tried lowering the FPS even down to 30 using RivaTuner but that just makes the tearing worse. I don't notice the tearing very often when I'm actually playing missions but it gets annoying when I'm between missions upgrading items, etc.  My 960m laptop has the tearing as well but it's not as bad. Nvidia's force vsync setting didn't fix it either. Though what's weird is that screen tearing on Optimus chips are usually diagonal. These are horizontal like dedicated desktop tearing, most games won't even start on my laptop's Intel GPU anyway.  If you're deciding to buy the game on a console, I HIGHLY recommend taking that route. If you're stuck with PC, I would wait until either the devs or someone in the community fixes these issues.  If you're having issues with wrong/missing button mappings, reinstall or try older drivers. That fixed my wireless Xbox One adapter when USB wired and my wired 360 controller worked just fine.",
            "review_score": "1"
        },
        {
            "review_text": "gameplay is fun as hell, definately worth it.   Controller is preferred but you can set up your keyboard perfectly as well   wasd and numpad 4568 for camera and works just as well  only thing they need to fix is the multiplayer voice chat is on 24/7 and sometimes it causes players to disconnect online",
            "review_score": "1"
        },
        {
            "review_text": "thay need to fix the co-op mode like the game but cant play co-op and it crashes all the time help ",
            "review_score": "1"
        },
        {
            "review_text": "This game is highly addictive, really well optimized, has really good graphics and even decent multiplayer. Would highly recommend to fans of the Anime and even people who aren't!",
            "review_score": "1"
        },
        {
            "review_text": "This game really makes you feel like you are apart of the action in the Anime. The cutscenes mimic the show, while the in-between intermissions where you talk to other characters is mediocore, but the act of slaying Titans is quite exhilarating, especially if you are a fan of the show.  I would recommend this game to anyone who likes the show, and to those who are curious about the series.",
            "review_score": "1"
        },
        {
            "review_text": "So Cool.",
            "review_score": "1"
        },
        {
            "review_text": "Addictingly fun, but you're going to need a controller though if you plan on playing the game. Worth it though if you're a Attack on Titan fan.",
            "review_score": "1"
        },
        {
            "review_text": "Little fat titan ate a soldier Killed little fat titan Got covered in blood  Had tons of fun   11/10 would kill little fat titan again",
            "review_score": "1"
        },
        {
            "review_text": "Unplayable in co-op right now. Tried for the last hour to play this co-op online with my sister and it keeps crashing within a minute of trying to play. Also, it seems like if you have a mic, this game automatically accesses your mic and initiates a voicechat in co-op that you can't disable. We even tried playing with our mics unplugged to see if the automatic voicechat was causing the issue and it still crashed. PATCH THIS!",
            "review_score": "1"
        },
        {
            "review_text": "*****WARNING****** watch season one of Attack On Titan before buying and playing this game MAJOR spoilers.  Besides that this is the best game i have ever played in my life it took 5 minuntes to get used to the controls and movement but i heard for some people they cant get full control hours into the game graphicly the game is also amazing. the story is based off of the show but when you play you will be more imbursed in whats happenening you will acually want to go back and save your teammate becuase you feel the obligation to do such.   11/10 Game Would Reccommend To People Who Have Watched The Anime",
            "review_score": "1"
        },
        {
            "review_text": "The story is pretty much exactly the Anime, which is good or bad, depending on how much you enjoy rewatching scenes (but now psuedo-CG!). It was skippable for me. But the gameplay is so fun, it more than makes up for anything. I accidentally replayed one of the missions and still had a blast re-playing it the whole time. I haven't had this fun playing a game for a long time. It's like the perfect mix of Spiderman, Ninja Gaiden and an Action RPG. It's exactly what I hoped an Attack on Titan game would be one day.",
            "review_score": "1"
        },
        {
            "review_text": "I love aot and i like the content of the game but you have too have a controller beacuse with the keyboard its to hard to play and the mouse dosent work for me. i have just over the minimum computer parts for this game and it still quite bad. it is a good game if you have a controller and have the good parts but if you dont dont bother.   I wish i could refund it.",
            "review_score": "1"
        },
        {
            "review_text": "i really enjoy this game.",
            "review_score": "1"
        },
        {
            "review_text": "I've got just under 4 hours in the game, most of it story mode, with a bit of time in the Survey mode. I will say upfront that I'm a huge Attack on Titan fan, and that has a big impact on my enjoyment of the game - part of the appeal is zipping around on the omnidirectional maneuver gear and playing out events like the Battle of Trost.   If I weren't a fan of the franchise, I would probably still be enjoyable for a bit, but very repetitive after a while. Really, taking down titans is very simple in itself, but the challenge comes from trying to be as effecient with your kills as possible so you can get the best rankings.   As many others have noted, playing this game without a controller is pretty much impossible. Hopefully at some point they path in better keyboard/mouse support, but until that time, I'm playing this on my Steam Link with a controller, and everything works great.   Overall, I definitely recommed this is you are a fan of AoT.",
            "review_score": "1"
        },
        {
            "review_text": "Other than the grind in-game, the story is great and follows the anime and manga. If you like the anime and manga or like great story-telling than this game i highly recommend.",
            "review_score": "1"
        },
        {
            "review_text": "If you watched the anime and made it one of your favorites, than this game is for you. It has the story line of the anime, (Battle of Trost, Female Titan Arc) and has the Survey Missions, simple missons that have you going from point A, to B, C, D and E to help your comrades and complete the misson, and if you complete all the missions you will get your sweet teaser for season two.  All in all, the gameplay is fairly simple, hook behind the titan, zip to him and slice him up, of course the game is going to get harder, forcing you to go farm for materials so that you can get better gear to advance in missions without breaking a sweat, but this turns very repetitive and you need to get materials from specific titans that only show up either once, or not at all.  The controls are messy when it comes to keyboard and mouse, controller is practically a must-need for a game like this.  Conclusion: The story is much like the anime, it's great and the cutscenes resemble the anime very well and the survey missions are best played with friends, to get as much fun as possible from them.",
            "review_score": "1"
        },
        {
            "review_text": "It's working well after a couple of patches. On it's first launch, this thing couldn't even detect my Xbox 360 controller and controls via Moga Pro / Moonlight Gamestream has its X &amp; Y and A &amp; B inverted  My Xbox 360 controller with a third party receiver (but installed with the Xbox 360 drivers) is working I could now write a proper review of this game now that I can play it properly.  So far, I'm still in Chapter 2, but so far, I'm quite enjoying this game. While it's not as complex as Fenglee's or Guedin's, the AI is quite capable, although, not difficult. There's some occasional bugs due to poor programming (poor draw distance of trees, crashing when switching audio, etc) as I understand that the makers behind this game isn't proficient in making PC ports, but so far, It's acceptable.  I'd give it a score of 'Bert-Bomb', at least until Guedin finishes his game.  Note: I'm eagerly waiting for Season 2 of Attack on TItan. I've also read until Chapter 85 of the Manga at the time of writing.",
            "review_score": "1"
        },
        {
            "review_text": "This game gave me crippling depression",
            "review_score": "1"
        },
        {
            "review_text": "This game is Awesome! fast paced and true to the series",
            "review_score": "1"
        },
        {
            "review_text": "Gets best score of all recruits taking out dummies Kills first titan 'I feel like I can kill all the titans!' From then on singlehandedly kills all titans Saves sister Saves friends Saves everyone Still called rookie and constantly abused by all R.I.P Eren Protagonist most in need of a hug.",
            "review_score": "1"
        },
        {
            "review_text": "The game seems like it might be interesting if you can learn the cancerous controls or get a controller to work i tried a ps4 and xbox 360 controller both plugged in and with emulators neither work for this game specifically but other games they do for example speed runner!  A long time later they finally added the ability to use my controler with the game and i can play it. Great game, Its fun slinging from titan to titan slicing their necks and saving humanity.",
            "review_score": "1"
        },
        {
            "review_text": "The game is fun, I enjoyed the 7 hours of it that I played.   But that 7 hours of gameplay is the problem, it's only 7 hours of gameplay, it took me 7 hours to complete the game.   Everything else in the game is really repetitive and you're essentially just doing the same thing over and over again, and it's not worth replaying.    Pros: - Mechanics are super easy and very fun. - Story follows the anime well, and the story in the anime is amazing. - Gear upgrading is easy and fun.  Cons: - Repetitive - Nothing to do once story mode is complete. - Not worth replaying. - Costs $60.00 for 7 hours worth of gameplay.   I would recommend this game if it was 15 dollars or less.",
            "review_score": "-1"
        }
    ]
}