{
    "app_id": 450060,
    "name": "Insane Decay of Mind: The Labyrinth",
    "release_date": "2016-05-06",
    "developer": [
        "GoManga Interactive"
    ],
    "publisher": [
        "IV Productions"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "VR Support",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "Adventure"
    ],
    "achievements": 50,
    "positive_ratings": 24,
    "negative_ratings": 22,
    "price": 1.99,
    "description": "Insane Decay of Mind: The Labyrinth is a first person horror game. You play the role of Katherine, a young girl lost in the eerie hallways of a building she believes to be her school.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/450060/header.jpg?t=1496148919",
    "minimum_requirements": "OS: Windows 7 Processor: Intel Core i5 4460 equivalent or greater Memory: 4 GB RAM Graphics: NVIDIA GeForce GT 430 (no VR) or GTX 960 (VR) or AMD Radeon HD 5670 (no VR) or R9 290 (VR) DirectX: Version 11 Storage: 10 GB available space Additional Notes: Requires Oculus Rift DK2, Oculus Rift CV1, HTC Vive Pre or HTC Vive to work in VR",
    "recommended_requirements": "OS: Windows 10 Processor: Intel Core i5 4590 equivalent or greater Memory: 4 GB RAM Graphics: NVIDIA GeForce GTX 750Ti (no VR) or GTX 980 (VR) or AMD Radeon R7 260 (no VR) or R9 290X (VR) DirectX: Version 11 Storage: 10 GB available space Additional Notes: Requires Oculus Rift DK2, Oculus Rift CV1, HTC Vive Pre or HTC Vive to work in VR",
    "reviews": [
        {
            "review_text": "Right now this is the only thing remotely close to a survival horror VR experience for the vive. And concidering the dev is still working on it; The price is phenomenal. When I first installed it I had some technical issues. However, my problems were swiftly patched by a new build and I was thrilled to redownload it.  I find it's best to play standing with an xbox controller. I've had some startling moments. And the whole atmosphere of the game is creepy as heck. I'd recomend this if you need to fill that horror hole in your Vive library.",
            "review_score": "1"
        },
        {
            "review_text": "OMG!!!! First time inside the maze was terrifying!! I could not move for fear! Everything around you suggests that an horrible monster can appear anytime!  Very very scary VR experience!!!",
            "review_score": "1"
        }
    ]
}