{
    "app_id": 450390,
    "name": "The Lab",
    "release_date": "2016-04-05",
    "developer": [
        "Valve"
    ],
    "publisher": [
        "Valve"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "VR Support",
        "SteamVR Collectibles",
        "Steam Leaderboards"
    ],
    "genres": [
        "Free to Play"
    ],
    "tags": [
        "Free to Play",
        "VR",
        "Action"
    ],
    "achievements": 0,
    "positive_ratings": 2926,
    "negative_ratings": 145,
    "price": 0.0,
    "description": "Welcome to The Lab, a compilation of Valve’s room-scale VR experiments set in a pocket universe within Aperture Science. Fix a robot, defend a castle, adopt a mechanical dog, and more. Still not sold? It’s free!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/450390/header.jpg?t=1510766272",
    "minimum_requirements": "OS: Windows 7 SP1, Windows 8.1 or Windows 10 Processor: Intel® i5-4590, AMD FX 8350 equivalent or better Memory: 4 GB RAM Graphics: NVIDIA GeForce® GTX 970, AMD Radeon™ R9 290 equivalent or better, Video Output: HDMI 1.4, DisplayPort 1.2 or newer Additional Notes: 1x USB 2.0 or better port also required",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "It's Valve, what did you expect?",
            "review_score": "1"
        },
        {
            "review_text": "Made me realize how much i need a half-life 3 right now",
            "review_score": "1"
        },
        {
            "review_text": "  The best VR experience at the moment – very highly recommended to try out this free demo by VALVE",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely Amazing! Valve's humor and great work shows again and again in this title.  Would love to have a full portal game next!  This is the game I start everyone out with, who is new to VR.",
            "review_score": "1"
        },
        {
            "review_text": "Made me realize how terrifyingly large the sun is.",
            "review_score": "1"
        },
        {
            "review_text": "Even before the updated that added endless waves, I spent more time playing with The Lab than I did almost every other VR game combined.  It's slick, it's polished, and oh right, it's free.",
            "review_score": "1"
        },
        {
            "review_text": "This game really should be the very first experience anyone has on a Vive that didn't try it out in the store or something. It's free, it's Portal (which as everyone knows is made by Valve, the co-creators of the Vive, so it makes perfect sense), and it has some of the most amazing visuals in any game ever. I've never really cared about visuals in games before, but, after standing on a photo-realistic Icelandic hillside and witnessing the cavernous interiors of Aperture Science in freaking virtual reality, I'm left speechless. Stop reading reviews and download this right now",
            "review_score": "1"
        },
        {
            "review_text": "Another quality free game from Valve. What more can you ask for?",
            "review_score": "1"
        },
        {
            "review_text": "This is the Wii Sports of VR.",
            "review_score": "1"
        },
        {
            "review_text": "  This is great! I really enjoy the humor as well as the games. I can't wait to see where VR is going!",
            "review_score": "1"
        },
        {
            "review_text": "This must be the best game for beginners. Both to learn the controls andd get used to VR.",
            "review_score": "1"
        },
        {
            "review_text": "Perfect introduction to the HTC Vive experience!",
            "review_score": "1"
        },
        {
            "review_text": "Wow. This is free? I very much recommend a download if you have the HTC Vive. A perfect introduction to the Vive and I was smiling the entire time. I've shown this to everyone to enters ths house lol.",
            "review_score": "1"
        },
        {
            "review_text": "I mean really, this is just the best VR experience going. Do eeet.",
            "review_score": "1"
        },
        {
            "review_text": "After playing a dozen titles, The Lab (specifically the Longbow game) is what I keep coming back to, and its what I have my friends play when I show them VR",
            "review_score": "1"
        },
        {
            "review_text": "An amazing VR experience, buy it now... Oh wait! it is free.",
            "review_score": "1"
        },
        {
            "review_text": "The lab is a Virtual Reality playground. If you've played Portal 2 it brings familiar faces and settings, but an entirely new experience. You'll understand what I mean when you try it. It's free, so you have no reason not to try it. It's an excellent game to lose a few hours in and test your new Vive.",
            "review_score": "1"
        },
        {
            "review_text": "I have to applaud Valve for making this. It's an excellent demonstration of the Vive's capabilities - and it's free! I especially like Xortex, the slingshot calibration and the bow castle defense. The experience bits are nice too, mainly the Secret Shop. Everything was bug-free for me too.  It looks great in the Vive and the Portal 'personality' of some things is awesome.  8/8, no h8.",
            "review_score": "1"
        },
        {
            "review_text": "I've only done a few things here, but when the friends come over to play, this will be one of the first games I have them start with. Great work by Valve's VR team.",
            "review_score": "1"
        },
        {
            "review_text": "Very enjoyable list of experiences and games. Probably the best free game you can get at release!",
            "review_score": "1"
        },
        {
            "review_text": "Aperture Science is back :) Free this time!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best Vive experiences you will have.  Lots to explore and hours of fun. All for free! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best 'games' to show off a Vive. It starts off with simple instructions on how to move and gives you a bunch of games to play. Each game showing off a feature of the Vive and VR Roomscale. Did you catch the game in the game? Try playing the arcade machine instead of grabbing the globe :)",
            "review_score": "1"
        },
        {
            "review_text": "This is why everything Valve touches is gold.",
            "review_score": "1"
        },
        {
            "review_text": "Very cool demo experiences all packaged into one neat package. Very cool how you switch between experiences by picking up the orbs and putting them to your face. Love the longbow and slingshot! Each demo really showcases what the Vive is capable of.",
            "review_score": "1"
        },
        {
            "review_text": "The absolutely essential VR introduction, I measure all games against it.",
            "review_score": "1"
        },
        {
            "review_text": "Valve did it again! This is probably the best game to start your VR experience with! Everything is spot on - the graphics is nice and the game-play is fun! The Archery mini game is a personal favorite.  I would like to see more VR games developed by valve ASAP!",
            "review_score": "1"
        },
        {
            "review_text": "Very polished intro to VR with some great minigames and experiences. Written with a ton of humor. Must have for a new Vive owner.",
            "review_score": "1"
        }
    ]
}