{
    "app_id": 450440,
    "name": "Creepy Castle",
    "release_date": "2016-10-31",
    "developer": [
        "Dopterra"
    ],
    "publisher": [
        "Nicalis, Inc."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "RPG"
    ],
    "achievements": 29,
    "positive_ratings": 93,
    "negative_ratings": 12,
    "price": 10.99,
    "description": "A conspiracy is welling deep within the stone walls of an ancient castle.The keep’s master is leading its denizens to construct a revolutionary new device made to move the world forward onto a new path of evolution.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/450440/header.jpg?t=1479426135",
    "minimum_requirements": "OS: Windows XP Processor: Dual-core processor (Intel Dual Core 2.0 GHz or AMD Athlon X2 5200+ 2.6 GHz Memory: 1 GB RAM Graphics: DirectX 9.0c compatible, PixelShader &amp; Vertex Shader 1.1 DirectX: Version 9.0 Storage: 80 MB available space Sound Card: DirectX 9.0c compatible Additional Notes: .Net FrameWork 4.5.1",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "A fun, highly novel sidescrolling RPG set in a cute fantasy world of anthropomorphic insects, backed by a chiptune score of the first water! Movement is modular, but you can choose smooth or instantaneous shifting, among other customizations. The give-and-take of classic RPG combat is interspersed with terrific little minigames, or 'duels,' that can get pretty tough, though you can choose to dampen the difficulty if you want -- but I would only do this as a last resort. Ever since I played  Undertale , I've felt that every turn-based RPG that does not involve tactical positioning should incorporate minigames like these; they make combat so much more dynamic if done well, and this game does them  extremely  well!  The game may be cute, but as you play through the chapters, you'll find that  Creepy Castle  has a pretty epic story and some heady themes to go with it -- like depression, the dubiety of psychopharmacological treatment for such, the search for meaning, and the need for companionship. I was very surprised to find all this in the game, and even more surprised that these themes are handled so deftly.    Creepy Castle  will appeal massively to fans of  Princess Remedy  and  Undertale , as it shares tonal and aesthetic similarities with those excellent titles, but it has a sparkling personality all its own. I love this game, and you should pick it up now!",
            "review_score": "1"
        },
        {
            "review_text": "Phew!   After a bit of a rocky start in the first story (I misread a clue), and beating it 6-7 hours later: I liked the game.  After putting... I guess, 18 hours in to playing all other stories (really, they're basically chapters), and unlocking a majority of the hidden content: I love this game.  Going in I was super biased. I'm a total sucker for games that look like they come from the Commodore 64 (or Speccy). Not to mention Metroidvania's are probably my favourite genre. So really, I was going to like this game no matter what. But I'm in awe at how much substance is here.   The later chapters are definitiley 'hard mode'. Other games would have done a New Game+. Creepy Castle contains practically a whole other game, 3 TIMES!!! It's almost like getting a sequel, and another sequel, and... you get the point. All in the same game.  I think a lot of people will compare this to Undertale. I haven't had a chance to finish Undertale myself, but from what I have seen the impression I get is Undertale has more wit. I don't care though. I loved Creepy Castle. It's everything I hoped it would be.  I'm super happy with this game. I hope you give it a chance.",
            "review_score": "1"
        },
        {
            "review_text": "This game has a ton of charm, and a ton of content, surprisingly. I've played for around 5 hours as of writing this review, and have only completed 2 of the scenarios, and I know there's at least 5 in total, with more to come, as I see the developers talking about a future 'Season 2'.   The combat essentially consists of typical rogue-like combat, in the sense that you and the enemy hit each other back and forth, however it often also has you play minigames during battle, which, if you win, will allow you to do damage to the foe without you taking any yourself. The minigames start off fairly easy, but having been getting harder and harder.   The story is super charming with a surprising amount of depth and worldbuilding, and the characters are adorable. If you dig the style at first glance I think you'll find a lot to like here, visually.   My only big complaints with the game is that the map doesn't help a whole lot, and that backtracking is a total pain in the butt. It's usually not forced, but it's hard not to want to backtrack when you just got that item that you KNOW gets you past an obstacle earlier on for a secret. Still, those are pretty minor flaws overall.  Recommended!",
            "review_score": "1"
        },
        {
            "review_text": "A game that throws you back into the times of 8-bit, throwing puzzles and addicting music right at your face for you to enjoy!",
            "review_score": "1"
        }
    ]
}