{
    "app_id": 450740,
    "name": "Mind Unleashed",
    "release_date": "2016-05-05",
    "developer": [
        "Frost Earth Studio"
    ],
    "publisher": [
        "IV Productions"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "VR"
    ],
    "achievements": 0,
    "positive_ratings": 19,
    "negative_ratings": 13,
    "price": 1.99,
    "description": "Mind Unleashed is a first person Sci Fi shooter game specifically designed for Virtual Reality. You are a robot that is trying hard to survive in a secret military base, inside a rocky mountain. Rocks and futuristic stuff will surround you in this epic challenge where you'll need to survive as long as possible, fighting hordes of robotic...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/450740/header.jpg?t=1526916924",
    "minimum_requirements": "OS: Windows 7 Processor: Intel i5 Memory: 4 GB RAM Graphics: Nvidia GTX 660 (No VR) - Nvidia GTX 970 (VR) or AMD equivalent DirectX: Version 11 Storage: 4.4 GB available space",
    "recommended_requirements": "OS: Windows 8.1 Processor: Intel i5-4590 equivalent or greater Memory: 8 GB RAM Graphics: Nvidia GTX 950 (No VR) - Nvidia GTX 980 (VR) or AMD equivalent or greater DirectX: Version 11 Storage: 5 GB available space",
    "reviews": [
        {
            "review_text": "This game is really fun, and for the price it's even better! It's not some 600 hour adventure game, but this is the best I've seen non-vehicle based shooting action handled in VR.   -Shooting feels great aiming with your eyes in combination with the controller--in the same way that streamlined motion controls can feel great on many console shooters, HMD+Stick feels great here.   -Having 3 classes to pick from with two unique skills is fun because it makes the same content play so differently (it just makes me want more!)  -The music is pretty good, though the rest of sound design is mostly generic feeling--not bad at all, but about what you'd expect.  I'd love to see more modes/classes/skills added, and hope that this studio makes more action-focused stuff like this!",
            "review_score": "1"
        },
        {
            "review_text": "   A First Person Shooter Action Arena VR Game",
            "review_score": "-1"
        }
    ]
}