{
    "app_id": 451000,
    "name": "Ember Kaboom",
    "release_date": "2016-06-03",
    "developer": [
        "Josh Koenig (Slashandz)"
    ],
    "publisher": [
        "Josh Koenig (Slashandz)"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Full controller support"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Platformer"
    ],
    "achievements": 0,
    "positive_ratings": 96,
    "negative_ratings": 16,
    "price": 2.09,
    "description": "Ember's a fox who loves adventure. Run, jump, and ride through 30+ colorful, fast-paced obstacle courses in a quest to get your missing soul back!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/451000/header.jpg?t=1467395775",
    "minimum_requirements": "OS: Windows 7 (64-bit) Processor: 2.3 GHz Intel Core i3 Memory: 20 MB RAM DirectX: Version 12 Storage: 200 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Do you like Mario? Then this cute little game is right for you! With 30+ levels, relaxing or sometimes heart-pumping music this game is worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "Ember Kaboom is a simple but satisfying indie platformer with a cute artstyle and responsive controls.  Ideal for younger children or casual platform fans,  :)",
            "review_score": "1"
        },
        {
            "review_text": "Dude. I got a lot of fun. Honeslty I got more fun than with most of today's games. Since it seems that every game made after 2006 its only there to make you rage (either no sense ultra difficulty, or bad since its roots). I got fun! thats something really hard to say now days!  I really enjoy when a game is good, when the developers focus on the game itself and not on minus things like the menus or the plot. Dont misunderstand me, I really do enjoy a good tale, but some videogames are not meant to have a great plot, but to be an excellent game itself.  The story is not good, at least in my opinion. I am an old school gamer; the main story is irrelevant (or has nothing to do) to a game to me. For whatever the reason is that you start your own adventure or journey doesnt matter, is the adventure itself what matters.  This game is the Atari Mario game port that never came out to pc (at least legally) since nintendow is busy checking its shekels. It really has that mario feel alike we all enjoy. But comparing the game to Mario Bros might be a little too much for the fans, so lets put that aside. The game is really good. I recommend for fun.  P.S. I want the soundtrack, and more levels if posible. Cheers.",
            "review_score": "1"
        },
        {
            "review_text": "Definitely recommend this game. Even if you arent a fan of platformers (like me) you will still love ember kaboom. Like the steam description says, it has an ultra-simple control sheme (there are literally 4 buttons) and is such a lovable little game with such a cute artstyle, you just cant hate. Though there is only about 2-3 hours of gameplay, I would say it's definitely worth the 5.49$",
            "review_score": "1"
        },
        {
            "review_text": "  Ember Kaboom is about a fox-girl named Ember who was in the forest and found someone who looked like he/she was in need, so Ember approached the person. After doing so, a piece of her soul is stolen and the 'person in need' is revealed to be a malevolent witch. Ember must find the witch and get the piece of her soul back or she will die.   This is a cute, fast-paced 'Mario-like' game. The controls are simple, the artwork is great, the sound is fun, the price is cheap and gameplay itself is enjoyable.  Although, like all games, this game has some downsides... It's a bit too easy. You can finish this whole game in about an hour or two if you do a speedrun. Also, the deceleration is annoying, too. For example: If you're flying quickly and have to go over something you have to stop completely, and hold SPACE. Overall, I'm enjoying this game and the price is fair. I recommend it as a fun, cute, time-killer.",
            "review_score": "1"
        }
    ]
}