{
    "app_id": 451520,
    "name": "theBlu",
    "release_date": "2016-04-05",
    "developer": [
        "Wevr, Inc."
    ],
    "publisher": [
        "Wevr, Inc."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "VR",
        "Simulation",
        "Casual"
    ],
    "achievements": 0,
    "positive_ratings": 837,
    "negative_ratings": 146,
    "price": 6.99,
    "description": "Experience the wonder and majesty of the ocean through a series of habitats and come face to face with some of the most awe inspiring species on the planet.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/451520/header.jpg?t=1517617172",
    "minimum_requirements": "OS: Windows 7 Service Pack 1 Processor: i5-4590 or equivalent Memory: 8 GB RAM Graphics: Nvidia Geforce GTX 980 or equivalent DirectX: Version 11 Storage: 4 GB available space Additional Notes: Wevr strongly recommends that your Power Plan under Windows Power Options be set to &quot;High performance&quot; or equivalent",
    "recommended_requirements": "OS: Windows 7 Service Pack 1 Processor: i7-5930K or equivalent Memory: 16 GB RAM Graphics: Nvidia Geforce GTX 980 or equivalent DirectX: Version 11 Storage: 4 GB available space Additional Notes: Wevr strongly recommends that your Power Plan under Windows Power Options be set to &quot;High performance&quot; or equivalent",
    "reviews": [
        {
            "review_text": "I finally buckled down and bought this for $9.99. I had been hesitating to do so, knowing that the amount of content that you get is very very small - especially considering that the whale encounter is free through transport. I don't regret the purchase, and won't be refunding it. You get maybe 10 minutes of total content outside of the whale experience, I didn't time it, but it wasn't a lot. It's two different scenarios, but both of them were definitely longer than the whale expeience, and just as stunning the entire time. Know going into this that you're not going to get a lot of content... but what content there is is probably the most gorgeous that exists on the vive thus far.   My one complaint would be that you can't just sit in the scenarios once they end, they go to credits and you have to select them again. I really wish the devs would implement either just an automatic repeat without credits in between with an exit button, or just an environment that you could sit in because the reef migration would be an incredibly relaxing way to spend an hour meditating.",
            "review_score": "1"
        },
        {
            "review_text": "My #1 game for showing off my Vive.",
            "review_score": "1"
        },
        {
            "review_text": "While the whale encounter gets all the media, The abyss is by far the most immersive in my opinion. not massively taken with the reef one but overall a fabulous experience and a great way to show off VR.",
            "review_score": "1"
        },
        {
            "review_text": "Video coverage here, text coverage below:          YouTube™ Video:  theBlu - VR Displayed - Virtual Reality - HTC Vive VR&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "  A perfect intro experience to VR. All the areas are stunningly beautiful. Most people talk about the whale encounter which is perfectly paced and powerful, the other 2 scenes are even better.  The reef starts out with some tropical fish, urchins, and a sea turtles. But soon enough you're surrounded in a cloud of thousands of jellyfish, some as big as a car! They even deform a bit when you touch them. The abys is too scary for some people. It starts in low visibility blackness with a flashlight among the remains of a dead whale. But there’s not jump scares and if you stick it out you’re treated to an underwater canyon brightly illuminated by bioluminescent sea life!  For passive VR it’s one of the most polished experiences out there. ",
            "review_score": "1"
        },
        {
            "review_text": "Well worth the money. Although the experiences are low in interaction they're very high on 'awe'. The Reef Migration scene especially actually brought tears to my eyes. An absolutely incredible experience. Looking forward to seeing more in the series!",
            "review_score": "1"
        },
        {
            "review_text": "totally incrediable, the whale one is the best. A must have demo.",
            "review_score": "1"
        },
        {
            "review_text": "Great for showing off your VR gear!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome experience bit short but definitely worth it. Only con is that sometimes the small fish go through eachother other than that this is one of the first things to show family and friends.   Looking forward to more.",
            "review_score": "1"
        },
        {
            "review_text": "This is fantastically well done, albeit not much content. But the price is right. It's beautiful, immersive, and easy to get lost in. The haptic feedback of 'squishiness' with the jellyfish has delighted several people I've demoed this to.  ",
            "review_score": "1"
        },
        {
            "review_text": "All three experiences are breathtakingly beautiful.   Even though I've owned all of the developer kits from Oculus over the last few years I think I experienced 'presence' for the first time with this experience. This was while sitting at the bottom of the ocean in the Luminous Abyss deep sea episode. The darknewss and murkiness of the water adds to the believability of the whole experience. Crawling along the floor with my dive torch to investigate an Angler Fish in an underwater cave was pretty awesome. The torch even triggers phosphorescent algae!  Does anyone know where the pictures you take when using Inspect Mode are stored on the local drive? I want to email some of them to some friends.  Can't reccomend this enough.  All three experiences are breathtaking.   Even though I've owned all of the developer kits from Oculus over the last few years I believe I experienced 'presence' for the first time with theBlu. This was while sitting at the bottom of the ocean in the Luminous Abyss deep sea episode. The darkness and murkiness of the water adds to the believability of the whole experience. Crawling along the floor with my dive torch to investigate an Anglerfish located in an underwater cave was one of the best things I've experienced in VR. The torch even triggers phosphorescent algae!  Can't recommend this enough and can't wait for the next instalment.",
            "review_score": "1"
        },
        {
            "review_text": "I purchased the Vive with little interest in purely experiential content. But I also purchased a VR rig in large part to evangelize the cause, so I wanted some lower key things to introduce people to the experience.  Surprisingly, between this and three bundled games the headset ships with, The Blu was the most visceral, emotional, and awe inspiring for everyone I showed it to, including me.  The sense of wonder, beauty, and utter presence generated by this experience is the perfect introduction to the world of VR.  If it's a choice between going and seeing a movie or getting this, put this in your library and let it be the first foray your friends and family make into the virtual.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the most amazing VR things. I just finished playing it and I'm sitting here totally stunned. More of this please. I'll pay.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the most amazing VR things. I just finished playing it and I'm sitting here totally stunned. More of this please. I'll pay.",
            "review_score": "1"
        },
        {
            "review_text": "This experience is amazing. Totally worth it. I plan to use this to introduce just about everyone I know to VR and the kind of intense presence you can get. All three experiences in this are astounding. It's not really a game, but it really is amazing. Highly recommended!",
            "review_score": "1"
        },
        {
            "review_text": "Great VR experience. It's short and not very interactive or 're-playable', but it's almost always the first 'game' that I show people to demonstrate VR -- because it's memorable and has a great sense of presence (The Encounter).  Seems like it should be free, but anyway, $10 is not too much given that it's probably the only VR experience that I show to *everyone*. It's a great (arbeit short) example of the potential of VR, and why people love it.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful. I'm using this on my 'demo reel' when showing off VR to friends. No danger of them hitting something while waving their arms about. I'm pairing it with an under water 360 video, Shows the difference between the two technologies. Well worth the money to me.",
            "review_score": "1"
        },
        {
            "review_text": "For the majority of the early adopters, the Blue was our first VR experience. It’s not something you play often, but it is a must have when you are introducing others to VR.",
            "review_score": "1"
        },
        {
            "review_text": "really nice to see the reactions of my friends when they meet the wale..",
            "review_score": "1"
        },
        {
            "review_text": "awesome experience for vive, kids and adults love it!",
            "review_score": "1"
        },
        {
            "review_text": "Well crafted and beautiful experiences! They are short, but wonderful, and great for letting people try VR for the first time.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely incredible VR experience. The graphics are stunning and really show what can be achieved in VR. I would definitely recommend to have this game in your library as the first go to app to show others what VR really is. Plus, there is nothing quite as good as hearing girls scream with the first sight of the giant whale.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the first titles I purchased for the Vive and am really glad I did. This is the perfect experience to show to people who are just trying out VR. Nothing too complicated. Just enjoy the beautiful, immersive environments. I hope that more experiences are added later.",
            "review_score": "1"
        },
        {
            "review_text": "Totally worth it. I think the best experience on VIVE.  Thanks to the team !",
            "review_score": "1"
        },
        {
            "review_text": "A really great demo to show people what VR is all about if they are not 'gamers' or can't move around much.  Everyone I've shown has liked it, especially the super impressive whale experience.  I look forward to more from these guys.",
            "review_score": "1"
        },
        {
            "review_text": "Incredible!!!!!!!, although it is a short experience.",
            "review_score": "1"
        },
        {
            "review_text": "Screenshots don't do this game justice. It's just a fantastic VR demo that will have you constantly standing in your play area just staring in awe. Very well done!",
            "review_score": "1"
        },
        {
            "review_text": "Dont rely on the Demo.  This is so awesome as a showcase.  Graphics are fantastic on all 3 experiences and my 3 year old son loves going underwater to try and touch the fishees.",
            "review_score": "1"
        },
        {
            "review_text": "Each experience showcases something different:  -Whale Encounter gives you a sense of scale -Reef Migration is relaxing and beautiful -Luminous Abyss is mysterious and tense with a beautiful ending  Great experience to show people who are new to VR.",
            "review_score": "1"
        },
        {
            "review_text": "Only recommendation is that its gorgeous and really cool.  I want a guarantee from the developers that they will deliver a ton more content for the 10€ we paid.  this is 10-15 mins content for 10€ and that is the ONLY NEGATIVE,   In my Vive it runs well and is a little interactive.",
            "review_score": "1"
        },
        {
            "review_text": "Breathtaking visuals! Relaxes me. Please develop more relaxing games like this.",
            "review_score": "1"
        },
        {
            "review_text": "Update may have stopped the third clip from starting. Not sure why it wouldn't load this time, only difference is the update. Very impressed, the immersion level is amazing, everyone who I've had try it gets shocked a bit as it does feel like your underwater. For $10 I am hoping we see more from future updates, I have an R9 390 AMD gpu and 4.5 ghz i5 but still get some dropped frames, graphics are impressive indeed but would expect smoother play through as your basically witnessing more than interacting. Would I spend $10 again knowing the content included and guarantee we will see more in the future, definitely, without the possibility even known, well then I don't know. Wouldn't refund it though, it is great to show the Vive off.",
            "review_score": "1"
        },
        {
            "review_text": "The price is high for just 3 scenes. It should be a 4.99 price tag. If they added more content i'd be ok with 9.99. The reason i bought it was because its a good introduction to show people VR",
            "review_score": "1"
        },
        {
            "review_text": "This is an awesome intro to the VR world. Definitely recommend getting it to show friends the kind of top notch VR experiences that are out there. I was initially a little disappointed about how quick the whale experience one was but the other ones are much longer with some really neat moments in them. *edit* After having a number of people over to try the Vive, I've actually found the shortness of the whale experience to be perfect as the intro to VR for VRgins. So...even though I was initially a little disappointed, it's actually great haha...",
            "review_score": "1"
        },
        {
            "review_text": "Very impressive. Amazing atmosphere and animation of the underwater critters. Only disappointment was the whale scene. It was so short I get the feeling they rushed it to get it on steam as quickly as possible. The other scenes are great but the whale is basically unbelievably short to the extent you feel disappointed/annoyed.  ",
            "review_score": "1"
        },
        {
            "review_text": "Its short but OMG it is amazing. It is such a great showcase piece for VR. Having an 80 foot whale in your living room is a remarkable experience. I actually got a bit scared in the dark segment. (I have a fear of deep dark water LOL) I highly recommend this experience. You will be in awe!",
            "review_score": "1"
        },
        {
            "review_text": "This is a tech demo that your average person will 'Get' and serves as a good intro to VR. If you plan on demoing VR to people (do it!), then you want this in your collection.",
            "review_score": "1"
        },
        {
            "review_text": "That whale was so big I made nightmares about it. The presence was astonishing, I love it.",
            "review_score": "1"
        },
        {
            "review_text": "15 minutes worth of content, but totally worth it - this will be the first thing I load up when showing VR off to friends",
            "review_score": "1"
        },
        {
            "review_text": "This is not actually a game. If this was not VR then it would be nothing but a movie. And actually extremely short movie. However it is an exciting VR experience. You stand there, the things happen around you. You decide where to look. You can even make a step or crouch to get a better view. If you wanted to see the difference between 3D movie and Virtual Reality movie then this makes an excellent example.  The only problem I have is that is really short. While I do not regret the money I admit that the 'performance per dollar' is bad.",
            "review_score": "1"
        },
        {
            "review_text": "At first glance some may dismiss this as an expensive tech demo but to do so would be a huge mistake. This group of experiences have very high production values and are are without a doubt worth the entry price. At least one of these habitats will be used in every HTC Vive demo I run. Ultimately theBlu is one of the most immersive introduction options available and doesn't need users to tackle complex interactions or explanations, this is perfect for tech newcomers. I only recently found time to try Luminous Abyss and this is arguably the most impressive yet. I truly hope that Wevr produce more experiences like this in the future. If you are reading this review and have the PC specification required then don't hesitate... Thanks for the memories Wevr",
            "review_score": "1"
        },
        {
            "review_text": "Not very interactive, but a GREAT first VR experience.",
            "review_score": "1"
        },
        {
            "review_text": "I use this 'game' to initiate new Vive/VR users. It is amazing and well worth the 10$. Not much replayablility but incredible none the less. I hope they continue to add more, I would love to come back for more!",
            "review_score": "1"
        },
        {
            "review_text": "Graphically good. Content short  Played for under 5 mins and while it was fun. It's not worth the price",
            "review_score": "-1"
        },
        {
            "review_text": "there are far better things to spend your money on than this if you want 'something to demo vr to other people with'   as everyone said, way overpriced. should have been $1.99 at most.  put on the helmet and look around for 3 minutes.",
            "review_score": "-1"
        },
        {
            "review_text": "If this game was free it might be worth it, but not likely! Don't Buy.",
            "review_score": "-1"
        },
        {
            "review_text": "For the amount charged this game offers no replayability passed sharing it with your friends with 'LOOK WHAT MY VR CAN DO.' It does offer a great taste of VR, but the graphics are not impeccable, and the content is EXTREMELY limited. This should be a &lt;$5 purchase as it has up to an HOUR maximum, absolute maximum to offer.",
            "review_score": "-1"
        },
        {
            "review_text": "boring",
            "review_score": "-1"
        }
    ]
}