{
    "app_id": 451670,
    "name": "War Birds: WW2 Air strike 1942",
    "release_date": "2016-03-18",
    "developer": [
        "HGames-ArtWorks"
    ],
    "publisher": [
        "OtakuMaker.com"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Casual",
        "Indie",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Simulation",
        "Action",
        "Casual"
    ],
    "achievements": 0,
    "positive_ratings": 37,
    "negative_ratings": 26,
    "price": 2.79,
    "description": "War Birds is a 2.5D World War 2 air combat game, with impressive 3D warplanes and beautiful 2D environments.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/451670/header.jpg?t=1479895380",
    "minimum_requirements": "OS: WINDOWS XP / WINDOWS VISTA / WINDOWS 7 / WINDOWS 8 / WINDOWS 10 Processor: Any 64 or 32 bit processor Memory: 1 GB RAM Storage: 280 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "   War Birds: WW2 Air Strike: 1942 Review - Rating: 7.3/10  ",
            "review_score": "1"
        },
        {
            "review_text": "Terrible game, not well written in terms of dialong or story, just not fun. Don't waste your money.",
            "review_score": "-1"
        },
        {
            "review_text": "This simulate game is about world war two air combats planes which fight in many missions with a smooth and realistic graphics. Mainly in the main menu area you have a few interesting things to watch like sergeant aircrew, hanger, stats, shop.   Sergeant Aircrew: which mean when you will be promoted by highter rank, you will receive salary and unlock new function. special skills (canon, maneuver, double rockets, bombing, air strike, turbo, mass blitz, rocket). Once you get gold you can buy endurance, speed upgrade, ammunition, armor, fuel, radar, weapons, etc.   Hangar: mean you can buy 4 types planes except one is for free. Also there have his functions or what contain each plane choosen. Also you can see his customization and description which is very detailed.  Stats/combat: you can see your and each detailed progress done of the entire game.  Shop: you can do more strong your planes by upgrading parts and misc using your gold.   Controls: is very huge and varied with multiple weapons to use that can be changed in input tab just before you open the game. This part is very recommended because there is a popup link which explain you everything in a pdf manual. Enough say that it contain pictures which teach you everything of his functions in map,etc.  Options: sound and music are great. Have two type camera perspective and orthographic.  Once you enter in campaign mode you will see and face the missions but just before starting there is a play briefing which contain three types of difficulties pilot(give you 300 gold reward), fighter(give you 300 gold reward) and veteran(give you 500 gold reward). You start with a single warplane which is very limited so you will need to gain lot of gold to buy better warplanes and for increase your weapons and upgrades to face many types of air, ground and naval enemies. The rest is predictable and fun.   Since i'm not finished the game yet i'm still addicted and enjoying a lot. Also more than a simple game is rich and very descriptive in the meaning of learning real history which i have learned things unknown. If you plan play an world war 2 game and don't know what to do this is your chance and try it, you won't be dissappointed. I rate this 95% Recommended.",
            "review_score": "1"
        },
        {
            "review_text": "The game is ok.",
            "review_score": "1"
        }
    ]
}