{
    "app_id": 451870,
    "name": "Nighttime Terror VR: Dessert Defender",
    "release_date": "2016-04-04",
    "developer": [
        "Mark Schramm"
    ],
    "publisher": [
        "Mark Schramm"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "VR Support"
    ],
    "genres": [
        "Casual",
        "Indie"
    ],
    "tags": [
        "Casual",
        "Indie",
        "VR"
    ],
    "achievements": 0,
    "positive_ratings": 10,
    "negative_ratings": 6,
    "price": 3.99,
    "description": "Nighttime Terror: Dessert Defender is an expanded version of the award winning VR game. Fight your way through six unique levels and defend your desserts!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/451870/header.jpg?t=1466585824",
    "minimum_requirements": "OS: Windows 7 SP1 64 bit or newer Processor: Intel i5-4590 equivalent or greater Memory: 2 GB RAM Graphics: NVIDIA GTX 970 / AMD R9 290 equivalent or greater DirectX: Version 11 Network: Broadband Internet connection Storage: 532 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "For some reason, I always expect everything to be in first person in VR. Well, this game is more of a 3rd person top down view. Well, maybe not top down, because you can change where you're watching the game at any time.  Anyway, so this is sorta like a tower defense game, except It seems like you start out without being able to buy any towers at first. Your character (a wizard type guy) instead runs around trying to protect the cake from being eaten by cute tiny bunnies. He does this by  violently killing  all the cute fluffy bunnies...they in turn will try to kill you. Eventually you get enough coins to buy a tower, and the starting tower is pretty weak. You'll still be doing most of the killing, only now while you're in range of your tower you'll have a bit of backup.  So anyway, there's several levels and modes and making it through each one unlocks something else. Survive 3 waves of attacks on the cake and you get some kind of upgrade and then you can try to beat the 'powerup' mode where it drops powerups on you and you run around trying not to get swarmed by bunnies for as long as possible.   The first powerup they give you is a fireball. Sounds like it'll really be awesome right? Well, it basically allows you to set an enemy on fire and do Damage over Time (DoT) instead of doing damage per each shot. It'd be nice if the fireball set multiple enemies on fire either via area effect or if they could set fire to adjacent bunnies but I didn't see that happen.  There really was no reason for this to be a VR game. It's neat to be able to see the action in the game from any angle as if you were a giant controlling the action from on high, but it doesn't benefit the gameplay really. You could have left it as an isometric 3D type graphics and it would still be the same game pretty much.  Things I liked about this game:      It's a tower defense game.     When you earn money for killing enemies you can pick the coin up in two ways, either by reaching over with the controller and grabbing it manually or by walking your character over it. (this is probably the only reason for it to be in VR)     The powerup frenzy mode is kinda fun, since it's sort of like a survival mode     The graphics are OK, though I remember the first level looking kinda dark   Things I didn't like about this game:     They don't give you much options for towers in the opening level.     It's 5 coins for the first tower and so you're pretty much spending a lot of time defending without a tower before you can even afford to build one (between waves)     Your fireballs are limited and don't really do enough damage to make it worth using.     I'd prefer to use a mouse and keyboard for Tower defense over the Vive controllers.   Overall the game just didn't really grab me and make me excited to play it again. It's probably a decent enough game, but I would probably be happy playing this in a 'torchlight' type view instead of in VR. It feels like there's not enough reason for it to be a VR game. It's VR to jump on a bandwagon and not because there's something about this game that couldn't be done without VR.",
            "review_score": "-1"
        },
        {
            "review_text": "It's really more of a top-down shooter game than a tower defense one. The developers should have focused on one genre instead of failing at both.",
            "review_score": "-1"
        }
    ]
}