{
    "app_id": 452340,
    "name": "Ian's Eyes",
    "release_date": "2016-09-01",
    "developer": [
        "Sindie Games"
    ],
    "publisher": [
        "SOEDESCO Publishing"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Adventure",
        "Puzzle"
    ],
    "achievements": 0,
    "positive_ratings": 46,
    "negative_ratings": 22,
    "price": 6.99,
    "description": "First days at school are usually tough, but they can be even tougher if you’re helping a blind 8-year-old boy named Ian who doesn't know the terrifying dangers that lurk around in every hallway. You play as North, Ian’s lifelong canine companion. Can you help him escape alive?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/452340/header.jpg?t=1472753093",
    "minimum_requirements": "OS: Windows 7 Processor: Intel® Core™ 2 Duo 2.4 GHz Memory: 4 GB RAM Graphics: NVIDIA® GeForce® GTX260 Storage: 2500 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I really enjoyed Ian’s Eyes, it is a mix of old school Resident Evil camera game with a very difficult one, which gives you an amazing feeling when you can go through a tough puzzle.  Now I will analyze it in depth.  First of all, the game design is strongly immersive, you really can feel how your bonds with Ian are growing while you go into the story. Also the learning curve is accurate to a game like this, the challenges presented to you are balanced with the possibilities that North and Ian can do. The first part is quite easy but when you get further in the game… wow, it can make you angry when you did everything as planned and then a little red hairy zombie girl surprises you in a corner, I hate those ones.  When you see the game in an artist way, the feeling that you are in the 80’s comes easily, those “Tim Burtonish” style with all the posters as easter eggs from nice movies makes you empathize with the game. The zombies are well treated and you can easy know who is who when they come to kill you. The school is a nice place to see when it has not a lot of zombies, after that, some places are scary to hell (again the zombie girl lying in the bathroom). Ian and North make a nice couple and they seem to belong to each other in every way possible. The animations are well made and suits fine with each of the characters, one of them that I like the most were the animations of North pulling and pushing the box, those were nice and fun to watch.  The game is fully enjoyable and has no big bug issues, it has some minor sound time fixing in the kinematics but the rest comes fluid as water. When you think that you were killed by a bug remember that, it is just you being not able to do it right.  To sum it up, Ian’s Eyes is an experience that I will recommend to every person. It has difficult and perfectly timed puzzles (other way you die), nice art, catching story and charming characters. You should buy this game if you like all that!  Finally, I am eager to see what Sindie Games will do in the future, they begin with a brilliant game.",
            "review_score": "1"
        },
        {
            "review_text": "  I recieved Ian's Eyes in a giveaway and couldn't wait to play it. This game is a LOT of fun, especially if you like things that are both cute and creepy. The gameplay is pretty simple and the story is easy to follow, so you never feel lost as to what to do next. 10/10 recommend to anyone looking for a casual game with a cute design and unique story.",
            "review_score": "1"
        }
    ]
}