{
    "app_id": 45300,
    "name": "Wings of Prey",
    "release_date": "2010-01-08",
    "developer": [
        "Gaijin Entertainment"
    ],
    "publisher": [
        "Gaijin Entertainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Partial Controller Support"
    ],
    "genres": [
        "Simulation"
    ],
    "tags": [
        "Simulation",
        "Flight",
        "World War II"
    ],
    "achievements": 45,
    "positive_ratings": 314,
    "negative_ratings": 148,
    "price": 6.99,
    "description": "Wings of Prey is based around the large-scale aerial combat and ground military operations of World War II. Players can participate in some of the war’s most famous battles piloting fighters, battle planes and bombers across a range of thrilling missions.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/45300/header.jpg?t=1447352823",
    "minimum_requirements": "OS: Microsoft Windows XP SP3 Processor: Intel Pentium 4 3200MHz Memory: 1 GB Ram Graphics: NVIDIA GeForce 7600 256 Mb DirectX®: 9.0c or higher Hard Drive: 10 Gb free disk space Sound: DirectX compatible",
    "recommended_requirements": "OS: Windows XP SP3, Vista, Windows 7 Processor: Intel Core 2 Duo 2400 MHz Memory: 2 GB Ram Graphics: NVIDIA GeForce GTS 250 512 Mb or higher DirectX®: 9.0c or higher Hard Drive: 10 Gb free disk space Sound: DirectX compatible with support 5.1",
    "reviews": [
        {
            "review_text": "I am not marking this review as negative for the game itself. I enjoy playing it.  I am marking this review negative to warn the masses about the DLC. It can't be used, Yuplay are no more and although Gaijin have taken the rights, the WOP launcher still wants to connect to a YUPLAY account.  The DLC can not be used witout being looged in to a Yuplay account, which now is impossible.   Valve need to either remove the DLC from thier store post-haste, or strip WOP of the now defunct Yuplay DRM and add Steamworks so the DLC is playable. Otherwise I have to go to Gaijin website and buy the game + DLC again just to play the DLC I bought on Steam in the first place, and can't use.  Let the Buyer Beware, the DLC is currently a scam!",
            "review_score": "-1"
        },
        {
            "review_text": "I'm not a flight sim guy but after 20-30 hours of training, I was able to figure out how to take off, fly, prevent my plane from stalling, get a plane out of a spiral, and actually destroy a few enemie planes...and then land (usually) - WHILE PLAYING ON SIMULATION MODE.  Good fun but you need to put in the time.  I recommend for someone looking for a sim but anyone looking for an arcade game, go elsewhere. This is not for you.",
            "review_score": "1"
        },
        {
            "review_text": "Brief summary of Wings of Prey: A 'Holywood' flight combat sim. Looks and sounds great, exciting to play, but lacks in mission design, AI and flight model.  +Lots of missions and planes. +Great visuals. Variety of day/night and weather conditions. Nice effects: glare, cockpit scratches, damage (bullet holes, damaged ailerons, broken gauges etc.). Cockpits look great. +Immersive 5.1 sound.  -Some of the missions in the campaign are frustratingly difficult. Some are bugged (e.g. objectives not triggering correctly). -Stalls are a bit unrealistic. -Poor documentation: Some things are never explained, like how the I-16 engine will die if you pull negative Gs, or how to use propeller pitch and radiator. -Haven't played MP, but looks like online is basically dead.  ~TrackIR is a big advantage, both for watching your six in dogfights and for spotting ground targets. ~Joystick (preferably HOTAS) is a must. Gamepad or keyboard+mouse won't cut it.",
            "review_score": "1"
        },
        {
            "review_text": "Wings of Prey is a lot more accessable than the IL-2 series and allows you to get into the game and action alot more quickly.  WoP features a ton of highly detailed aircraft that include cockpits, plus missions / gameplay spanning many combat theatres to match. There is plenty to do here in single-player, plus standard online multiplayer modes are included as well. I've gotten 100+ gameplay hours out of WoP so far.  However compared to its rivals, there are a few things lacking, notably no mission editor so you are limited beyond the missions offered and there have been some issues with multiplayer recently as support has been dropped in favour of its multiplayer-oriented sequal  War Thunder .   Despite this WoP is a really great title and frankly if your into WW2 flight games you shouldn't pass up on this (even for just the single-player), however hardcore simulation fans will fill more at home sticking with the IL-2 series.",
            "review_score": "1"
        },
        {
            "review_text": "This can be scaled to play with arcade controls or flight sim controls. I played it arcade style with joystick and really enjoyed it. Lots of content here, graphics look great, flying is fun as hell.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing attention to detail, custom options to set difficulty from arcade to ultra realistic, fun online game modes and fantastic co-op gameplay IF you buy the Wings of Luftwaffe Add-on. World War II air combat pilots will be proud.",
            "review_score": "1"
        },
        {
            "review_text": "Impossible to log to  yuplay.org . worst than real uplay. most of features are blocked due to yuplay",
            "review_score": "-1"
        },
        {
            "review_text": "Good fun, a very good easy to play flight game.",
            "review_score": "1"
        },
        {
            "review_text": "Nice WWII Combat flight Sim! 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game if you love flying!",
            "review_score": "1"
        },
        {
            "review_text": "love this game, could be realistic",
            "review_score": "1"
        },
        {
            "review_text": "Even though it says I've played 117 hours I've never actually managed to log into the game. When I try to play it it tells me to register. When I try to register it tells me there's a Server Error and do I want to try registering again.   I've just given up trying now....   ",
            "review_score": "-1"
        },
        {
            "review_text": "Only for gamepad pilots.   Time for a change, time to play this game with flight-peripherals. And? No fun. Throttles are delayed on my Joystick and Hotas. Gamepad throttle works fine.  Edit: T16000 &amp; CH pro throttle",
            "review_score": "-1"
        },
        {
            "review_text": "Total peice of ♥♥♥♥. Unrealistic and ♥♥♥♥ing covered in DRM and specialty remote connection required ♥♥♥♥♥♥♥t.  Never buy it.",
            "review_score": "-1"
        },
        {
            "review_text": "Incomplete controls (cannot get the Hat on my thrustmaster hotas X to trim aircraft). Buggy Missions that dont end or cant be completed.",
            "review_score": "-1"
        },
        {
            "review_text": "nothing works ♥♥♥♥ russains",
            "review_score": "-1"
        },
        {
            "review_text": "Very fun sim, intense.  Beaten only by IL-2 Sturmovik.",
            "review_score": "1"
        },
        {
            "review_text": "I had fun with this game but I can't imagine how I have nearly 400 hours playing it!",
            "review_score": "1"
        },
        {
            "review_text": "Oh I love this game........Take a bit of mucking around to get it working now a days but once you do its fun.. Flight model to suit all skills and moods is great as somtimes i cant be bothered with simulation mode so the arcade model backs it off enought to have fun to go shoot down z germans. GFX are great for its age, online is dead so if you want that get War Thunder buy same makers. Missions are good and for most part enjoyable.  UPDATE: Ok so i got sick of the YuPlay pop up to register crap so re bought the game DRM free from Gaijin site.. then thought if i copied the files and exes into Steam version then i keep progessing my steam game. IT WORKED both versions use same game saves anyway and now no stupid pop up crap from YuPlay. Mulitiplayer is gone they push you towards WAR THUNDER for that but off line game is nice and solid and i do enjoy they ambiance of WoP",
            "review_score": "1"
        },
        {
            "review_text": "If you like ww 2 aerial figts this one is for you.Amazing graphics,realistic ww 2 plane models,very accurate too.Few modes to try like arcade(most popular to play),and very realistic(hardest to play,very few menaged to get there).Good multi,smooth runing game.Overall one of my fav from this genre.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic flight simulator game, once you get over the initial setup (which includes registering the serial number at  yuplay.com...)  Awful voice acting, but everything else is excellent. The controls (once remapped to a controller) worked great. Combat is exciting and challenging.",
            "review_score": "1"
        },
        {
            "review_text": "So pretty but so baggy online...",
            "review_score": "1"
        },
        {
            "review_text": "This games super realistic and cool + awesum",
            "review_score": "1"
        },
        {
            "review_text": "Air combat game with attractive graphics and easy enough for average gamer not sim freak.  Should be a lot of fun, but is let down by the mission design. You're at the controls of an aircraft and looking forward to enjoying flying it, but the missions force you to dash through and complete objectives very fast, with little margin for error. Who tested this?  For example in one AI skirmish mission you're up against a ME190 but you'll have 1 pass at it before it races past and if you now need to turn you won't catch it before it leaves the map. Game over.  Another mission I repeated many many times without completing in the time space, and found many other players online stuck in the same mission.  Overall a wasted opportunity. Avoid or try it out in a sale.",
            "review_score": "-1"
        },
        {
            "review_text": "Any campaign that tells you 'you failed to carry out your orders' or... 'You took too long'   then just STOPS the mission dead....   (just after you`ve shot down your TENTH messerschmitt and jussssst when you`re beginning to enjoy it....)  aint worth a carrot imho.   This IS worth buying for Flying around in the training mode (as you can choose any aircraft to fly in), -&amp; it`s worth buying for the nice graphics .  It`s not too anal about realism and you won`t fall out of the sky each time you let go of the stick to scratch your nose either.  But forget the campaign, it`s just too snotty and annoying to be enjoyable. Nobody likes being interrupted and having the controls taken away from you just when you`re pew-pew-pewing a jerry fighter......  recommended. (Very Begrudgingly, seriously that timer sucks ♥♥♥)...  BTW j.f.i. This has crappy YUplay attached to it which keeps running even after you exit the game unless you kill the process..  I despise third party managers like yuplay, GFWL and Uplay, they add nothing but inconvienience and hassle, take up resources and generally spy on you.... Avoid if you don`t want to deal with all that ♥♥♥♥.",
            "review_score": "1"
        }
    ]
}