{
    "app_id": 453680,
    "name": "MiniGolf Mania",
    "release_date": "2016-03-25",
    "developer": [
        "Road Turtle Games"
    ],
    "publisher": [
        "Axis Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Local Multi-Player",
        "Shared/Split Screen",
        "Partial Controller Support"
    ],
    "genres": [
        "Casual",
        "Sports"
    ],
    "tags": [
        "Sports",
        "Casual",
        "Mini Golf"
    ],
    "achievements": 0,
    "positive_ratings": 36,
    "negative_ratings": 16,
    "price": 0.0,
    "description": "Grab some friends and step up to the tee as you putt your way through nine unique and challenging holes in MiniGolf Mania!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/453680/header.jpg?t=1552435629",
    "minimum_requirements": "OS: Windows 7 32-Bit Processor: Dual Core 2.0 Ghz Memory: 2 GB RAM Graphics: 1 GB VRAM DirectX: Version 9.0 Storage: 2 GB available space",
    "recommended_requirements": "OS: Windows 7/8/10 64-Bit Processor: Quad Core 3.0 Ghz Memory: 4 GB RAM Graphics: 2 GB VRAM DirectX: Version 9.0 Storage: 2 GB available space",
    "reviews": [
        {
            "review_text": "8 Minutes! That is what this is! It's a reasonably well done 8 minutes! Controls well etc but it's way too short to justify the price tag of £1.99!  Iv'e read other reviews and seen this described as a demo and I am enclined to agree.  Sorry but I can't recomend it because I do not think it is really a full game and don't think it should be sold as such! ",
            "review_score": "-1"
        },
        {
            "review_text": "meh, no multiplayer and only 9 holes is pretty boring, and the power ups make no sense if playing single player except for the 'stop', unless there's multiplayer which there isn't.. and who gives two ♥♥♥♥♥ about local co-op aka split screen.",
            "review_score": "-1"
        },
        {
            "review_text": "So they're either the devs of Minigolf Adventures, or this is an homage to it.  Either way, devs? Please increase the price, so that you can afford to spend more time building levels.  Solid, worth more than $3, and the only downside is the tiny course selection.  There are 3 things that 3D Ultra did better, though: - Your power meter is too precise. Take out the notches, because they make the courses too solvable. - Click-through ball-settling, please! - Deserves more content, and it'd be worth paying more money to get it.",
            "review_score": "1"
        },
        {
            "review_text": "Super fun! Can't wait for future updates",
            "review_score": "1"
        }
    ]
}