{
    "app_id": 453720,
    "name": "Last Will",
    "release_date": "2016-08-29",
    "developer": [
        "LizardFactory"
    ],
    "publisher": [
        "LizardFactory"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Online Multi-Player",
        "Online Co-op",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Puzzle"
    ],
    "achievements": 50,
    "positive_ratings": 98,
    "negative_ratings": 37,
    "price": 5.99,
    "description": "Your deranged and mysterious Grandfather is dead, and in his last will and testament, he gave his entire fortune and mansion to you. But on one condition. You have to visit his mansion and collect the riches for yourself. But once the front door shuts behind you, you realize that this is no easy task...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/453720/header.jpg?t=1550570734",
    "minimum_requirements": "Requires a 64-bit processor and operating system OS: Windows 7 Processor: Intel Core2 Quad Q8400 Memory: 4 GB RAM Graphics: NVIDIA GeForce GTX 560 1GB / Radeon R7 250X 1GB DirectX: Version 11 Storage: 2 GB available space",
    "recommended_requirements": "Requires a 64-bit processor and operating system",
    "reviews": [
        {
            "review_text": "If you like escape rooms, this game is for you! It's a really great idea to implement multiplayer. Paired best with a nice chardonnay and a few friends. I will say that the controls could be a little tighter in certain puzzles, but I'm excited for the content the developers will add. Adding extra lanterns in multiplayer would be nice, some rooms are really dark even with lamps on.  7/10 - Nicely renovated from original escape room games. Awesome in multiplayer.",
            "review_score": "1"
        },
        {
            "review_text": "love it its got me stumpped a few times",
            "review_score": "1"
        },
        {
            "review_text": "  I personally really love this type of puzzle game, but this one really takes it to the next level.  If you like a game like ROOM you'd absolutely adore this one. I loved it in the alpha and beta tests, and it's only gotten better.",
            "review_score": "1"
        },
        {
            "review_text": "great simple puzzle game. looking foward to the other chapters.",
            "review_score": "1"
        },
        {
            "review_text": "  i likede it, it was fun playing with my frinds. but i do like puzzels",
            "review_score": "1"
        },
        {
            "review_text": "Was initially excited about playing a co-op puzzle game and found that the first episode didn't disappoint. Episode 2 and 3 did not follow episode 1 in quality, unfortunately, and with the numerous bugs and generally repetitive/easy puzzles it has since lost its initial allure. Will probably play it to completion since I already own it though..... With time, when bugs have been sorted, and rooms are filled out, this game may improve but for now it's descended into meh.",
            "review_score": "-1"
        },
        {
            "review_text": "  I would like to thank the developer Lizard Factory for supplying me with a key for the game and also for joining me and Lord Crocosquirrel on an interview and helping us and Zaxtor 99 and Dragnix out on a stream of this game.          YouTube™ Video:  Review the Developer: Lizard Factory and Last Will&nbsp;",
            "review_score": "-1"
        }
    ]
}