{
    "app_id": 453960,
    "name": "Envy the Dead",
    "release_date": "2016-09-12",
    "developer": [
        "Kazakov Oleg"
    ],
    "publisher": [
        "Kazakov Oleg"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "RPG",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "RPG",
        "Strategy",
        "Simulation"
    ],
    "achievements": 21,
    "positive_ratings": 134,
    "negative_ratings": 60,
    "price": 0.79,
    "description": "Envy the Dead is zombie survival roguelike, in which you are leading group of unique, randomly generated characters through destroyed lands, infested with zombies.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/453960/header.jpg?t=1478063003",
    "minimum_requirements": "OS: Windows® 8 (32/64-bit)/Windows® 7 (32/64-bit)/Vista Processor: Dual Core Processor Memory: 1 GB RAM Graphics: 128MB Video Card with OpenGL support DirectX: Version 9.0 Storage: 2 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "could be so much better. lotsa potential though. you know this genre\\type of zombie game.  Escape the city with so n such people. random \\ selected start off one end of city, go to other end. along the way you scout, scavenge, learn skills etc. lotsa random events as you progress.  I don't get why the last screen shot in the steam store page of this product shows a nice grid like set up. as the game is nothing like that at all. its RTS in battle mode.  RTS mode is funky. can't quick camera to anybody (double tapping their icon etc) but at the least it lets you select them no matter where they are, to move within your current camera field of view  another thing about RTS, the baricade \\ trap system is also weird. little to no boundary per baricade, trap set down. so you could almost stack as many walls \\ traps on a single area.  Walls, depending how you put down baricades, they will be slightly overlapping one another so that you don't have any gaps. despite this sometimes a zombie will push through despite my baricades 'overlapping' and will get at the guys behind.   also error\\bug i've noticed. At the end of a battle, if you had people healing each other before the last enemy is killed. they will continue to heal target ally for 100% hp as long as you don't accept the battle results.  suggestion for dev. battling no matter what difficulty tends to be short n sweet. makes it very hard to attempt to salvage \\ search throughout the battle. Perhaps make it so that if you didn't search everywhere during the battle you only get a small fraction \\ % of it (excuse is such n such got broken while fighting) whereas you'd get the 100% whatever if you had people searching\\looting during battle.  for Night time, allow flashlights \\ fires or something to be crafted. fires could be used for torches \\ traps too!  for leveling up stats. if you say 'putting a point in this statistic raises damage output of melee... gun etc' then let it be reflected when you equip weapons on them! i don't want to see a guy with 10 stats on gun and see the same starting pistol still does '2.0 damage' !!!  be nice to resize the UI since after getting 4+ survivors their icons start to take up the left side of my screen.  You cannot organize the people in anyway. so you get them in whatever random order you save them \\ they join you \\ start the game off with. i would love to have reorder the people so that all my melee people be the first numbers of the group then shooters etc...  If you have a guy with a shield equipped. and for some reason click on another shield. you suddenly lose a shield :( had 2 shields. lost one that way.  and when people die. you don't get to recover the things on them. or cannabalize. that would be a neat idea. (oh boo hoo morality issues)",
            "review_score": "1"
        },
        {
            "review_text": "Envy the Dead is a game that I recommend because: - it is a method to banish boredom - it has a good price - it has strategy - it is RPG - it has zombies - it has trading cards  Enjoy!",
            "review_score": "1"
        },
        {
            "review_text": "Not worth the dirt on my shoes, sorry. Let me explain, What you see in the trailer isn't real not even worth $0.49. What you really get is 8 survivors who are EXACTLY the same. Anyway don't buy this unless you like wasting money. No wonder it's $0.49.",
            "review_score": "-1"
        }
    ]
}