{
    "app_id": 453990,
    "name": "Mibibli's Quest",
    "release_date": "2016-08-04",
    "developer": [
        "Ryan Melmoth"
    ],
    "publisher": [
        "Ryan Melmoth"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Platformer"
    ],
    "achievements": 0,
    "positive_ratings": 44,
    "negative_ratings": 1,
    "price": 4.79,
    "description": "Mibibli's Quest is a retro-style surrealistic platformer game. Join Mibibli as it blasts his way through over 20 crazy and eclectic levels! Conquer caves, dance through raves, wander the suburbs, and blow up eggs... travel through time and explore your nightmares along the way!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/453990/header.jpg?t=1470331092",
    "minimum_requirements": "OS: Windows 7 or later Processor: 2.5 GHz Memory: 500 MB RAM Storage: 100 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This game is awesome! The gameplay is top tier, the music is amazing, and it makes you laugh. This game deserves to be right up there with other great indie games.",
            "review_score": "1"
        },
        {
            "review_text": "I played this game before it came on Steam, and it is amazing. It is a great game for people who like games like Mega Man and Shovel Knight, with really good level design and fantastic music.",
            "review_score": "1"
        },
        {
            "review_text": "An ACTUAL retro inspired game. You know those games you see that are 'retro inspired,' but it's just some procedurally generated zombie survival lazy pixel art game? This game is none of that. Mibibli's Quest feels like i'm playing an actual NES game. Great chiptune music. Level design you'll remember, (whether you like it or not, this game will force you to learn the levels to a tee.) It has the element of NES difficulty, the stages themselves are only a couple minutes long, but the difficulty makes it longer. However, every death feels like your fault. The only level I could remember with mechanics that made me feel like it was the game's fault was Digitaland. Screw Digitaland.  All in all, great game if you like retro inspired games, a kickass chiptune soundtrack, and a good challenge.",
            "review_score": "1"
        }
    ]
}