{
    "app_id": 45400,
    "name": "Fortix",
    "release_date": "2010-04-14",
    "developer": [
        "Nemesys Games"
    ],
    "publisher": [
        "Nemesys Games"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Leaderboards"
    ],
    "genres": [
        "Indie"
    ],
    "tags": [
        "Indie",
        "Casual",
        "Fantasy"
    ],
    "achievements": 12,
    "positive_ratings": 802,
    "negative_ratings": 69,
    "price": 0.99,
    "description": "Can you reclaim your ancestors’ land? Evil forces have taken over the once fertile land of Fortiana. You are the only one who can storm the castles and claw it back from the hordes of dragons. Experience a new type of strategy and arcade game. Fence off parts of the battlefield to corner your enemies.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/45400/header.jpg?t=1447353028",
    "minimum_requirements": "Operating system: Windows XP SP2Processor: Minimum 1GhzMemory: Minimum 512MbHard disk space: 110MbVideo: DirectX 9.0c Compatible video card with minimum 64Mb memorySound: DirectX 9.0c Compatible sound cardDirectX&reg;: 9.0c",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": " Fortix  Rating : 7/10  Great casual game where you have to steal land by drawing lines from the edges. Makes you play 'just one more round'. Not that long, but fortunately there is ... Fortix 2 which is even prettier \\o/",
            "review_score": "1"
        },
        {
            "review_text": "Fortix is a fun casual game. Use your mouse or keyboard and draw a path to cover up the map. Within your box you can kill dragons/bats and take down towers. Or you can collect arms within your drawn box to activate catapults to take down the towers. This game is super simple, but can get extremely difficult if you play on the impossible difficulty level. Worth a play, especially since it can easily be found for a cheap price. Definitely worth the time spent and I recommend if you like these types of games.",
            "review_score": "1"
        },
        {
            "review_text": "this game... has... Impossible difficulty. and this game... has... an achievement: Finish the game on Impossible difficulty.  I've finished it, yay xd Recommended &lt;3 (y)",
            "review_score": "1"
        },
        {
            "review_text": "This game has a special place in the history of Steam, being the cheapest game available. It has also special place on SteamGifts and in my heart!  The gameplay is simple but surprisingly addictive. You are a knight, tasked to capture enemy forts on a map. You conquer land and anything placed on it simply by drawing a closed line around it, but there be dragons and enemy towers out there to get you. As long as you don't leave the borderline, you're safe though - until time runs out!  You owe it it to yourself to try hard and earn the right to play Fortix!  For what it's worth, it's fun!  Once achievements are at 100% completion however, which isn't extremely hard, you may not feel much incentive to play it further, especially if you own Fortix 2. Unless you are into leaderboard and want to beat me :) Make no mistake, though - it is actually challenging to earn a really high score. Maps have a time limit, so this is not a matter of simple grinding for more score.",
            "review_score": "1"
        },
        {
            "review_text": "Very entrtaining. Its like playing with a rattrap but without go pain =)",
            "review_score": "1"
        },
        {
            "review_text": "Originally bought number 2 on special and decided to try the original. Love them both. Yeah the prices are low but the gameplay quality isn't. Both Fortix one and two are enjoyable games",
            "review_score": "1"
        },
        {
            "review_text": "A novel little casual action puzzler. Short but well worth the price.  - Skinny from the Fat B*stard  (curator link) ",
            "review_score": "1"
        },
        {
            "review_text": "At first I thought this game was some boring strategy game, or something along those lines (Let's face it. I'm a pessimist if a game is so cheap) but, well. A friend ended up gifting it to me, and I thought 'What the hell, let's see what it's like.'  I was pretty impressed. The game is hard to describe. It's like those old cell phone games where you control a curser, and have to make squares, and dodge random enemy things.  That being said, it's not for everyone, and a lot of people probably don't even remember before smartphones were around.  In short, it's a short, sweet, and simple game that appeals to me, and brings back nostalgia from back when I was a little kid with a tiny Sony Ericsson phone the size of a matchbox playing a game EXACTLY like this whilst waiting for the train.",
            "review_score": "1"
        },
        {
            "review_text": "Fun little game, definitely worth picking up! Nothing groundbreaking, but an enjoyable monster and tower hunt nonetheless.",
            "review_score": "1"
        },
        {
            "review_text": "Sairaan hyvä peli. Meaning: This is a very good game. Its a remake of a classic C64 game, which had no name (or at least the c-casette didn't have a label). We called it The Vinyl (fin. Vinyyli). Very simple game, but hard to master.",
            "review_score": "1"
        },
        {
            "review_text": "This game truly worth it's price, and also gives Steam Trading Cards, you're a knight going around the edges of the map which is a safe zone, you need to go inside the map in polygons with 90º angles and then go back to the edge to cut/slice the zone to invade it avoiding enemies, and this to capture all the map piece by piece. To just pass the game without beating records you need like 50 min, but this time is fully enjoyable, for a game that costs 99 cents it has a lot of things that some trash around here haven't being ten times or even more expensive.",
            "review_score": "1"
        },
        {
            "review_text": "a good game and a good time waister game..",
            "review_score": "1"
        },
        {
            "review_text": "Very good for wasting time around!",
            "review_score": "1"
        },
        {
            "review_text": "cool",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Would buy on sale again to earn money from cards again.",
            "review_score": "1"
        },
        {
            "review_text": "Fortix is an fun take an an old arcade game, I used to play a version of the old arcade game on my gameboy. It's just what you need if you're looking to use up a bit of time on 'brain free' entertainment. The later levels get challenging enough that you have to put a decent amount of thought into them but they come at the right part of the game.",
            "review_score": "1"
        },
        {
            "review_text": "An old gaming mechanic. Great to kill a couple of hours. Not a magnum opus of gaming, but serviceable. 7/10",
            "review_score": "1"
        },
        {
            "review_text": "A fleeting joy, but a joy nonetheless, is the best way to describe Fortix, which seems to be the combination-lovechild of an beginner's art project and beginner's programming project. While the art is interesting enough and carries what it needs to carry, you aren't going to be entranced, and the gameplay, while a bit repetitive, offers enough challenge to keep you on board for long enough to at least finish the game's achievements and receive the three offered card drops. The game offers two control schemes, keyboard or mouse, each with it's own advantages, which is an interesting and not-often-seen twist. The game offers standard option controls including windowed mode (always a plus) and the ability to mute the in-game music, which you will most likely be doing after it loops the third time. The gameplay is difficult enough to match each mode of play from easiest to hardest, with the hardest being worthy of the title. The game offers bonuses to be roped-off and captured in order to gain short-lasting special abilities such as a temporary speed boost, temporary halting of cannon fire, or the killing off of one of the infuriating dragons. The level designs vary and offer up a challenge as you gain access to higher levels. Be careful not to lose all of your lives, though! In levels with multiple castles to capture you have to restart from the first castle in that level if you run out of chances. For the price, I recommend picking up the game, for the trading cards and easier-than-usual achievements. While you won't be returning again and again as if the game is a nasty habit, it is highly worth being a quick guilty casual-gaming guilty pleasure.",
            "review_score": "1"
        },
        {
            "review_text": "Best game EU 10/10 much story such depth wow graphics ",
            "review_score": "1"
        },
        {
            "review_text": "At this price you have no excuse to not have it!",
            "review_score": "1"
        },
        {
            "review_text": "This game has no business being so fun and addictive. Great little puzzle game.",
            "review_score": "1"
        },
        {
            "review_text": "A fun (and cheap) way to while away a few hours.",
            "review_score": "1"
        },
        {
            "review_text": "Better than Call of Duty: Ghosts",
            "review_score": "1"
        },
        {
            "review_text": "really wonderful game reminds of some old game on old siemens phones",
            "review_score": "1"
        },
        {
            "review_text": "Cheapest game on Steam and I'm acutally pleasantly surprised it doesn't suck.",
            "review_score": "1"
        },
        {
            "review_text": "This game... Everyone knows this game Everyone loves this game Said to be the Game of The Millenium by some of the communities (Yes, Steamgifts, that's you) Try it, but be aware that your life won't be the same after",
            "review_score": "1"
        },
        {
            "review_text": "For $.99, you can't go wrong. It's this game where you sort of conquer bits of the board by quickly running across and marking your territory. It doesn't sound very appealing, and the game is pretty short, but I found it amazingly entertaining for what it was. Give this a shot, I guarantee you won't be disappointed! You get a crazy good feeling of 'phew!' everytime you capture a few dragons, grab a part of the fortress, and avoid being hit in one good territory jump!",
            "review_score": "1"
        },
        {
            "review_text": "this game is ♥♥♥♥ 10/10",
            "review_score": "1"
        },
        {
            "review_text": "For 99 cents, you can't go wrong with Fortix. It guarantees at least a few hours of fun if you like these kind of casual puzzle/arcade games. I'd recommend the sequel as well which is also currently on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Fun little Qix clone set IN MEDIEVAL TIMES! Now that the sequel's out, this one's only 99¢ and well worth every penny :D",
            "review_score": "1"
        },
        {
            "review_text": "Took me 11 hours to get all the achievements. Wisely spent time",
            "review_score": "1"
        },
        {
            "review_text": "I haven't really played it but it makes a great game to unlock your account with at 99 cents.",
            "review_score": "1"
        },
        {
            "review_text": "You're a knight, and you square off territory to occupy it, and then its yours.  7/10",
            "review_score": "1"
        },
        {
            "review_text": "Just Started Playing and its awesome. A little bit glitchy on win 7 64 bit with flickering textures, but its managable.",
            "review_score": "1"
        },
        {
            "review_text": "This game, controlling the Knight Fortir(Fortix) is probably one of the best games out on steam. Time to time, I keep to wonder, why does it have such a ridiculously low price? Gameplay memorises childhood games, well built levels and UI scenario. Absolutelly stunning!",
            "review_score": "1"
        },
        {
            "review_text": "I like this game. I also hate this game. But overall I like it. It does not necessarily take long to finish the levels. But if you want to spend more time you just go and beat the impossible difficulty. Achievements keep up the motivation.  Fortix may be described as a capture-the-map game in which the player has to capture certain areas of the map. This is done by venturing into the uncaptured map and basically fencing off a part of the terrain. Once both ends of the fence are connected to your baseline (initially surrounding the playing field) you claim the area inside. Movement is restricted to vertical and horizontal and fencing-off may be interrupted by a number of hazards of increasing difficulty (and annoyance ;) ).  If you, for whatever reason, remember the Game Boy game Qix you know the basic mechanics of Fortix. And if you enjoyed the former you will probably enjoy the latter, like I do.  What really annoyed me on the harder difficulty was that I couldn't always clearly determine whether I had started fencing off. Since part of the fence to-be-build is hidden under the player I often stepped of the baselline and got attacked without ever realizing the danger I had put myself in. Keeping enemy reactions in sight is hard when you are concentrating on inching by some tower fearing you will miss the baseline again and die. I sort of like the way you are stopped when you run into a corner but I'd much rather prefer a more direct control over when to step off the baseline. Fortix 2 has running which incidentally keeps you on the baseline - both by holding CTRL - a technique similar to what I have in mind. I'd like to have a key like SHIFT that I have to hold to be able to step off the baseline, also canceling the stopping technique. I could also imagine releasing SHIFT would result in the player returning to the closest point on the baseline. Although I understand that not having that return mechanism may be a deliberate decision in order to keep the overall difficulty of the game at a decent level. At times I thought it might be useful to have a key for making the player backtrack on the current fence - a move almost impossible to make after taking the first corner.  As I said before, I recommend this game as I do its sequel which I will continue to be furious with now.",
            "review_score": "1"
        },
        {
            "review_text": "A nice fun little game. I would recommend this.",
            "review_score": "1"
        },
        {
            "review_text": "8/10 A good game that's worth more than 99 cents. Original, and fun. The gamplay has annoying aspects but in a way these actually add to the game in a good way (in a way). Doesn't take up much space and boots up quikly. The game definitly has replay value.",
            "review_score": "1"
        },
        {
            "review_text": "A pretty good way to waste some spare clock cycles. I do recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Fight dragons.",
            "review_score": "1"
        },
        {
            "review_text": "Straightforward and fun game to kill the time.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game. Definitly worth .99. It is worth $3. Very Very good Very Very interesting.",
            "review_score": "1"
        },
        {
            "review_text": "A slice of old skool fun for only £1. Harking back to the coin-op classics Amidar and Tron, this is a 'close off areas of the screen as you go' kind of game that is both simple in its execution and challenging to play. Very addictive and now with five Steam Trading Cards to collect (only five? a very easy way to level up!), this is an absolute steal! Look out for Fortix 2 as well!",
            "review_score": "1"
        },
        {
            "review_text": "Great game with steam trading cards. Brought back found memories of etch a sketch as a kid using a piece of technology like that before I even knew what you could do with a computer 23 years ago. I could image playing this game in a turn by turn fashion like that without the real time occurrence that this game offers.",
            "review_score": "1"
        },
        {
            "review_text": "Remember the old game Qix? The one where you had to make boxes in the play area without the weird line being touching your line before the box was complete? This is that game.  Just replace the weird line beast with dragons and cannons, and place the setting in mid-evil times. There is enough variety in the maps (i.e. location of the attacking cannons) to keep things interesting. Toss in a few powerups that pause time, etc, and it makes for a fun game for when you have a few minutes to spare.  Graphics 6/10 Gameplay 9/10  Steam Trading Cards are a nice little bonus (and makes the already cheap game price even cheaper)",
            "review_score": "1"
        },
        {
            "review_text": "Fun minigame that plays very much like using the Etch A Sketch to take over the map.",
            "review_score": "1"
        },
        {
            "review_text": "Short, cheap and has trading cards. An ok puzzler",
            "review_score": "1"
        },
        {
            "review_text": "At this point, the only thing you need to know about Fortix 1 is not to bother with it. Though it might seem trivial to complain when it only costs a dollar, the fact of the matter remains that with the release of Fortix 2 (which includes all of 1's levels) the original has been made completely obsolete and redundant.  Not that it was particularly worthwhile to begin with. With only a dozen or so strongholds to defeat, most of which comprise but a single level, Fortix is over before it feels like it's even started. The different difficulty settings do nothing to create replay value, only increasing the speed of enemies and lowering the generous amount of extra lives you receive, as the game is very easy even set on impossible.  In short, even having gotten it for free, I feel cheated to have wasted my time playing Fortix. The level designs are terribly dull and the presentation so basic and repetitive that the it amounts to being little more than a glorified flash game or demo. Save your dollar, or better yet find it a friend and get Fortix 2 instead. It provides the better experience through and through, and although I think the core gameplay of Fortix is rather enjoyable itself, this is simply an extremely poor representation of it that serves no purpose but to take up space in your Steam library.",
            "review_score": "-1"
        },
        {
            "review_text": "Remeber Qix? this is Qix. If you like Qix and want to play it with a mouse, try Fortix. I don't really want to give this a thumb up or down but I don't have a choice. I personally didn't find it very engaging so thumb down.",
            "review_score": "-1"
        },
        {
            "review_text": "This game sucks, don't buy it.",
            "review_score": "-1"
        },
        {
            "review_text": "Mother f*** sux",
            "review_score": "-1"
        }
    ]
}