{
    "app_id": 454070,
    "name": "Boundel: The Second Era",
    "release_date": "2016-11-14",
    "developer": [
        "Eren Aydin"
    ],
    "publisher": [
        "Eren Aydin"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Leaderboards"
    ],
    "genres": [
        "Indie",
        "Massively Multiplayer",
        "RPG"
    ],
    "tags": [
        "Massively Multiplayer",
        "Indie",
        "RPG"
    ],
    "achievements": 21,
    "positive_ratings": 165,
    "negative_ratings": 116,
    "price": 0.0,
    "description": "This is the time of guilds, wizards, warriors, blacksmiths, tailors, scribes, alchemists, woodworkers, animal tamers, brewers, traders, traitors and murderers. The Second Era begins!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/454070/header.jpg?t=1547824069",
    "minimum_requirements": "OS: Windows 7 (32 or 64 bit) Processor: Dual Core 1.66 GHz or equivalent processor Memory: 3 GB RAM Graphics: 512MB - NVIDIA GeForce 7600 GT, ATI Radeon X1800 or higher DirectX: Version 11 Network: Broadband Internet connection Storage: 2000 MB available space Sound Card: Yes",
    "recommended_requirements": "OS: Windows 7 (32 or 64 bit) Processor: Quad-core Intel or AMD CPU 2.0 GHz or equivalent processor Memory: 4 GB RAM Graphics: 1 GB NVIDIA GeForce GTX 260 or higher; ATI Radeon HD 4890 or higher DirectX: Version 11 Network: Broadband Internet connection Storage: 2500 MB available space Sound Card: Yes",
    "reviews": [
        {
            "review_text": "It's worth the five bucks! (three, for me - got it on sale). It's not the best game I've ever played, by any means, but is a perfect game for chilling while I watch TV or unwind after work. Think of it like 3D Diablo or Diablo 2. You're just wandering around randomly generated terrain, killing monsters to get loot and gold and make yourself powerful enough to kill stronger monsters. Terrain gen is decent. Controls are stodgy, with an active aiming system for the combat that's just a bit clunky. Lots of mounts, and apparently includes a taming system. Gear's fairly varied, all shows up on your character, and looks pretty good. No class selection, so there's freeform character building. Enemy models are good. Animations are a bit weak. You can play singleplayer, which I find delightful.",
            "review_score": "1"
        }
    ]
}