{
    "app_id": 454100,
    "name": "Dungeon Escape",
    "release_date": "2016-05-27",
    "developer": [
        "Alexey Roenko"
    ],
    "publisher": [
        "Alexey Roenko"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Platformer",
        "Action"
    ],
    "achievements": 51,
    "positive_ratings": 375,
    "negative_ratings": 108,
    "price": 2.79,
    "description": "Challenging 2D platformer with simple graphics and great chiptune soundtrack.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/454100/header.jpg?t=1553687963",
    "minimum_requirements": "OS: Windows 7, 8, 10 Processor: 1 GHz Memory: 1 GB RAM DirectX: Version 10 Storage: 116 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Pretty fun small platformer nice for a couple of weekends.  +Trustable controls - the most important part for the platformer - no delays between button press and jumps, you jump all the time the same height etc, so you only rely on your skill. You have no walljump here but you have double jump as a compensation. +Mediocre difficulty - trailer and screenshots may force you to think that this is some supermeatboy level platformer, no it's way easier, i wasted like 4 hours to complete half a game without sweating much (well levels getting harder the more you advance, so maybe last levels will be way harder) +Visuals and sounds - a lot of monsters, characters, traps and sounds are very simmilar to super meat boy ¯\\_(ツ)_/¯ at least they are not bad +Steam achievements are pretty straight forward - 1 achievement for completing every single level :) +Cards - the game is pretty cheap so with cards its even cheaper +Translations - it has translations for something like 20 different languages :O -OST - songs are nice, but there is no much of them, they are playing on the loop, so after an hour or two they repeat themselves like 5 times, and you are getting bored by them.  In short - this game is value for money stuff, good to kill some time, specially if you like platformers",
            "review_score": "1"
        },
        {
            "review_text": "  Hello, just got this game (for free) today. Played through a bit of it and made a video.          YouTube™ Video:  Let's Play Dungeon Escape #1 Death is Around Every Corner | Challenging Platformer!&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "It is slightly good game about jumping over the obstacles and killing enemies by jumping. It is similar to super meatboy. There are several 'troll' moments like in cat mario and some people, for example me, might not like this moments, but if you´ll use some guide, you can complete these levels easier and I can see, that the developer reeds people´s reviews and helps with problems. So finally I can recommend this game, you can buy much worse games for much higher prices.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun game until it changes from a hardcore super meat boy-ish platformer to a game that only increases difficulty with hidden traps and cheap shots.",
            "review_score": "-1"
        }
    ]
}