{
    "app_id": 454190,
    "name": "Cubicolor",
    "release_date": "2016-03-18",
    "developer": [
        "Moltenplay"
    ],
    "publisher": [
        "Moltenplay"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements"
    ],
    "genres": [
        "Casual",
        "Indie"
    ],
    "tags": [
        "Casual",
        "Indie",
        "Puzzle"
    ],
    "achievements": 3,
    "positive_ratings": 114,
    "negative_ratings": 11,
    "price": 1.59,
    "description": "Cubicolor is a minimalist puzzle game. The rules are simple: Match the color patches on the board and reach the exit, all on one single path. The game gets harder as the levels progress, always accompanying you with soothing piano tunes.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/454190/header.jpg?t=1459795712",
    "minimum_requirements": "OS: Windows Vista SP2 Processor: x86 (32-bit) or x64 (64-bit) CPU Memory: 256 MB RAM Graphics: GPU supporting OpenGL ES 3.0 Storage: 100 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "  “Believe you can and you are halfway there.”    Cubicolor is a 2-D puzzle game developed and published by the company Moltenplay.    Pro &amp; contra:    + Intuitive puzzle mechanics combined with decent graphics.  + Around 48 levels with increasing level of difficulty. + Piano music fits the pace of the game.    Summary:    Overall, Cubicolor represents a relaxing, minimalistic puzzle game that can be enjoyed within 2 hours. On higher levels it gets quite challenging, but it does not overstay its welcome.   Recommended for achievement hunters and puzzle enthusiasts.     Achievements:    Estimated time for 100% completion: +2 hours  Singleplayer achievements: 3 Multiplayer achievements: none",
            "review_score": "1"
        },
        {
            "review_text": "An one hour lunch time game! Short and sweet. Enjoyed it alot!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome puzzle game! i like it alot. It has a nice design (simple in my opinion but thats exactly what makes it so great!)  It's worth the money :D m8 i r8 8/8 for gr8. ",
            "review_score": "1"
        },
        {
            "review_text": "  You have a board of squares with a cube in a starting position. Placed around the board are coloured + signs and coloured squares. You have to choose a route for your cube around the board to intercept each + followed by the square of the same colour. Once all the coloured squares are cleared you must get to the exit square. As you pass each square it falls away so you can't pass it again and the whole board gradually disappears. There is only one possible route and at the end of the level there is little, if anything, left of the board.  It can be played with one hand, using only up/down/left/right keys, Del to reset and Enter to move to the next level. Generic background piano music, like many other puzzle games. It almost sounds like someone practising their scales.   Difficulty",
            "review_score": "1"
        },
        {
            "review_text": "With 48 levels this game will be a breeze for the intermediate puzzler. Nice design and concept. More levels would be grand.",
            "review_score": "1"
        },
        {
            "review_text": "the game is well priced for what it offers - an enjoyable short game where every level is a more difficult variation of the first. if you are a fan of puzzle games, i would mostly recommed it at its current, cheap offering. while i desired more challenge and more complex gameplay that expanded upon the game's core mechanic, it is still decently fun for what it is and a ok way to waste an hour",
            "review_score": "1"
        },
        {
            "review_text": "This is a nice game, 3 sets of levels and is quite short, under 2 hours to complete and was fun. Maybe would be nice to have a workshop for replayability and more levels but is fine as it is.",
            "review_score": "1"
        }
    ]
}