{
    "app_id": 454570,
    "name": "I Am Caligula",
    "release_date": "2016-03-25",
    "developer": [
        "Seraphim Creations"
    ],
    "publisher": [
        "Seraphim Creations"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Indie",
        "RPG",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Indie",
        "Strategy",
        "RPG"
    ],
    "achievements": 0,
    "positive_ratings": 33,
    "negative_ratings": 20,
    "price": 0.79,
    "description": "Follow the real life events of the late Roman Emperor Caligula and his dear sweet sister Drusilla during his short reign. You will explore Rome and deal with the senate while living the life of an Emperor.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/454570/header.jpg?t=1467658895",
    "minimum_requirements": "OS: Microsoft Windows XP/Vista/7/8 Processor: 1.6 GHz or faster Memory: 1 GB RAM Graphics: 1024 x 768 pixels or higher desktop resolution Storage: 300 MB available space",
    "recommended_requirements": "OS: Microsoft Windows XP/Vista/7/8 Processor: 2.0 GHz or faster Memory: 2 GB RAM Graphics: 1024 x 768 pixels or higher desktop resolution Storage: 300 MB available space",
    "reviews": [
        {
            "review_text": "Well.. i was given a key of this game by the developer but like always I never let those things effect my review.  I Am Caligula follows the mad Emperor, Caligula, along with his sister, Drusilla.  Since i know a bit history and i know he didn't rule Rome for long and was mad...  This game didn't change the fact he is mad. So it ended up being a weird negative energy filled game that fast forward though this person's mad life in 96 minutes for me. You could probably blaze though it faster if u know where u going at the begining.  It's rpg maker game and It does have a level and equipment system along with items. There is even a smith to improve your main character's spear.. problem is.. you can probably finish this game in less then 20 fights that none of the usual rpg charm is untilized...  here is what i told the developer in chat.  wany1981: 1. wany1981: pick a back story that's fun and enlighting with positive energy. wany1981: 2. wany1981: whether it's historical or fictional wany1981: make sure you have enough plot and character development wany1981: setup a story walkthough yourself wany1981: 3. wany1981: have a world map and have every town and city far away.. and make use of each location in plot to make them relevent.  wany1981: 4. wany1981: voice acting is fine.. and uncommon plot such as brother love sister is fine.. just.. don't over do it wany1981: 5. wany1981: more planning.. more content before you release game.. u have to make sure it's ready.. wany1981: bad rep is a killer  Right now .. i cannot recommend this game at all.. 3/10 would be my rating for this game. And I hope developer can improve on it to make a better game.",
            "review_score": "-1"
        },
        {
            "review_text": "*I received a copy of this game for review purposes.  Overall the game is on an interesting subject. I believe it could use some polish but it works fine with the RPG Maker engine. Occasionally it seems content is still being added to the game. Feels like more guidance could be used on where to go personally.",
            "review_score": "1"
        },
        {
            "review_text": "(OOC Post and Review here. Let me say this right now. This game isn't for everyone. I Am Caligula, I played this game back on Itch and i was one of the Beta Testers for it to. I gave Lato Feedback on it and even found a Game Breaking Bug that he didn't know about to before it came to Steam. Back then, the game wasn't as good as it was now. It didn't have many of the Cut Scenes that it does now. Lato really did try his hardest with this game with adding things into it and all.  As for the story and what people are saying, it does follow Real Life events of Caligula. A lot of people are calling it an Incest Sim, but the truth is if you Google it, Caligula really did have a Relationship with his Sister. That is actual history of the Emperor. Now I'm not going to lie and say that he did add some Fantasy Elements to the Story, but he did it to flesh out the Characters and give them some back story. Read the Wiki page on Caligula and then play this game to see how Accurate it is. You'll find out a lot of the things in the game are accurate. Caligula was one of the most Insane Emperor's ever back in the Roman Empire.  As for the Graphics and Sprites, a lot of it was hand made and drawn by an Artist. A lot of work did go into that. Some of it was Default things, but not much.   The Sounds and Music really does go with what is happening during the time. Sometimes it's hard to find the right music for an area of a game, but this one flows well given the length of the game.  As for Combat, you do have to do a bit of Grinding in it before moving on to the next area. Not much, but a bit. The combat isn't that hard to go through and figure out.   As for the Navigation in the game, you just have to talk to people like in ever RPG game and Explore. It's not hard to figure out what to do next or where to go.   Bottom line is it's not a game for everyone, but i do reccomend it and for people to give it a try before bashing it. I've played my Fair Share of bad RPG Maker games and I will be completly Honest. I've played a lot worse than this. Games where no effort was put into it at all and use nothing but Default Sprites and Assestes. At least Lato did try with this game and that is something. So please, before you give it a Neg Review, at least remember the points I've laid out in this Review and try it out with an open mind.)",
            "review_score": "1"
        },
        {
            "review_text": "  I Am Caligula   is a rather interesting RPG game with lot of historical elements. It talks about the life of Gaius Julius Caesar Augustus Germanicus, an enigmatic character who managed to fight the powerful Roman Senate, and who attributed a series of dark events.  If you are interested in history and you fancy RPG games, give it a try. It's cheap (0,99 USD), has voices, CGs, and you will learn real history.  Recomended!",
            "review_score": "1"
        }
    ]
}