{
    "app_id": 454730,
    "name": "World Of Undead",
    "release_date": "2016-07-22",
    "developer": [
        "ZK-Tech"
    ],
    "publisher": [
        "ZK-Tech"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Online Multi-Player",
        "Online Co-op",
        "Steam Achievements",
        "Partial Controller Support",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Action",
        "Indie",
        "Strategy"
    ],
    "achievements": 10,
    "positive_ratings": 3,
    "negative_ratings": 5,
    "price": 3.99,
    "description": "Fast and Action packed First Person Shooter with Tower Defense Game MechanicsPlay the Campaign cooperative with up to four friends or check out our new and exciting asymmetrical Game Mode &quot;Attack and Defense&quot;",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/454730/header.jpg?t=1469312349",
    "minimum_requirements": "OS: Windows 7 Processor: i3 Memory: 4000 MB RAM Graphics: Geforce GTX 660 DirectX: Version 11 Network: Broadband Internet connection Storage: 4500 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Refund pending,  This is the first game I have ever refunded on Steam, so I am not a serial refunder. I tend only to play coop games or TD games nowadays, so this game seemed to tick all the boxes. I was ready to buy another 3 copies for my regular weekend LAN session but after trying out single player I realised it would not be acceptable to my buddies. This game needs serious work before release.  I'm not going into gameplay issues here because I didn't try it long enough to become qualified to talk about gameplay. The game needs interface work before it is release-worthy.  First off, the mouse cursor disappeared at the screen where you need to check your screen brightness. I tried it windowed and full-screen, same result: no mouse. Unless you click the proceed button you can't proceed. There IS a mouse, you just can't see it, so you have to move the invisible mouse around like a palsied drunk hailing a cab, clicking all the time before you can move to the next screen.   Then comes a brief terrifying introduction which reminded me a little of a fistful of dollars, where 64 peeps got offed in the opening credits. Except this time it is YOU being offed. After this mouthwatering little tidbit, I proceeded to try the first mission.  No key bind options. Unless they are carefully hidden out of sight. So you have to guess which keys are used for movement etc, fortunately for some they are the default WASD. I say for some, I am dyslexic and cannot use those keys. Plus no reverse mouse. So no game for me.  In conclusion, a promising looking game which NEEDS crucial interface work before it is released. The author has spent all his time on the gameplay and graphics, and none on the interface. This is essential before you can seriously put this out into the real world. I'm hoping that this game receives further work on keybindings, mouse and interface. I would most definitely like to repurchase and re-review.",
            "review_score": "-1"
        }
    ]
}