{
    "app_id": 454890,
    "name": "Project Starship",
    "release_date": "2016-04-05",
    "developer": [
        "Panda Indie Studio"
    ],
    "publisher": [
        "New Reality Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Co-op",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "Casual"
    ],
    "achievements": 17,
    "positive_ratings": 361,
    "negative_ratings": 66,
    "price": 0.79,
    "description": "Project Starship is an arcade bullet-hell with random mechanics. No match will ever be the same. Who will you be? Garret or Gwen? Will you save the world from the mighty cthulhu?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/454890/header.jpg?t=1522155012",
    "minimum_requirements": "OS: Windows 7 Processor: Intel i3  2 Ghz Memory: 1 GB RAM Graphics: 1GB Dedicated Storage: 100 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Project Starship is one of the best games you can get for $1. although I usually don't like arcade shoot em ups, I really like this game. but it has a few small problems. but none of them stop this game from being one of the best games for such a cheap price.  PRESENTATION:  Project Starship's presentation is really good.the effects are nice , the character designs are okay. but where it really shines is in the music department. the soundtrack is really good and memorable. the enemy design and variety is also good. the special effects are nicely done and have that retro feel. Sound effects are pretty good too.  GAMEPLAY:   The Gameplay is really nice and simple. but I was disappointed that there was no difference between two characters during gameplay. the enemy variety is good and the boss battle was good too. but the easy mode is a little bit too easy because you get the powerups too easily. While the hard mode is a way better experience. it would have been better if there was a normal mode. but since the game is new , it might receive an update adding these things. the powerups are varied and also have a different feel to each of them and work well. the game also feels intense thanks to so many enemies on screen. The mad events are also really nice and hard.  VERDICT:  Project Starship is one of the better indie games available for a Dollar. the gameplay is nice and the soundtrack is great. although I would have like a few more characters and a better difficulty setting For such a cheap price you cannot go wrong with this one.",
            "review_score": "1"
        },
        {
            "review_text": "-Action -Cool Soundtrack -A lot of shining things = Project Starship, the game that will destroy your mind! 10\\10",
            "review_score": "1"
        },
        {
            "review_text": "A simple but fun shmup with a Cthulhu by way of Crayola art style.  Super cheap and well worth a go.",
            "review_score": "1"
        },
        {
            "review_text": "It's a pretty good game, not bad for the 49 cents I got it for. Although I do have some issues with it, a few of the enemies feel badly designed, and the projectiles (Or the hitbox) are bigger than they look. Especially the unkillable ones that take up 80% of the screen/completely block your bullets.",
            "review_score": "1"
        },
        {
            "review_text": "Game is nothing special, but i can't complain to much since i got the bundle for 8 cents. Can find same or even better games on newgrounds. Not sure how a game of this quality made it to steam. Unless you can get for 8 cents or free i say pass.",
            "review_score": "-1"
        },
        {
            "review_text": "my eyes! was this game made in Microsoft Paint?",
            "review_score": "-1"
        },
        {
            "review_text": "  Nice little retro arcade-bullethell with pixel graphics and lots of flashing objects.",
            "review_score": "1"
        },
        {
            "review_text": "Without the 'Slow-motion button' this game would be impossible to play.   Be aware that some of your left hand fingers will be going through minor pain by playing this game!!!",
            "review_score": "1"
        },
        {
            "review_text": "Despite having very simplistic graphics, it works just fine for the genre. The problem is there is no sound at all. I won't play it ever again tbh, but it's far better than the vast majority of lowcost steam segment.",
            "review_score": "1"
        }
    ]
}