{
    "app_id": 455110,
    "name": "Pertinence",
    "release_date": "2016-03-25",
    "developer": [
        "Not Magic"
    ],
    "publisher": [
        "Not Magic"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "Adventure"
    ],
    "achievements": 14,
    "positive_ratings": 24,
    "negative_ratings": 9,
    "price": 2.79,
    "description": "Pertinence is a top-down adventure with minimalist graphics that explores various puzzle and action mechanics. The goal of the game is to freely explore rooms in a grid layout while collecting as many &quot;alloy&quot; as possible. These will unlock new areas and abilities.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/455110/header.jpg?t=1468758083",
    "minimum_requirements": "OS: Windows XP DirectX: Version 10 Storage: 600 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Very challenging and sometimes confusing, but its pretty good. The room named 'More Frontiers' is awful though...",
            "review_score": "1"
        },
        {
            "review_text": "I'm not really sure whether to recommend this game or not; it's definitely much more action-y than puzzle-y (at least in my opinion). Several of the rooms require perfect or near-perfect timing, and most of the puzzles either require a large amount of precision themselves, or are based on trial-and-error, or are extremely easy. If that's your thing, then go for it. If you're looking for something in the style of Legend of Zelda, however... I'd recommend looking elsewhere. I, personally, didn't really enjoy it much, so I've marked it as thumbs down, but that's mainly because it just wasn't what I figured it would be.",
            "review_score": "-1"
        }
    ]
}