{
    "app_id": 455340,
    "name": "Warhammer 40,000: Armageddon - Da Orks",
    "release_date": "2016-08-18",
    "developer": [
        "Flashback Games",
        "The Lordz Games Studio"
    ],
    "publisher": [
        "Slitherine Ltd."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Cross-Platform Multiplayer",
        "Includes level editor"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Warhammer 40K",
        "Turn-Based"
    ],
    "achievements": 0,
    "positive_ratings": 24,
    "negative_ratings": 15,
    "price": 14.99,
    "description": "In Warhammer 40,000: Armageddon - Da Orks, a new turn-based strategy game, players will lead the Orks against the Imperial forces of the Armageddon Steel Legion and Space Marines from a variety of Chapters, under a scorching sun, through hostile ash wastes, and in the shadows of gigantic Hive Cities.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/455340/header.jpg?t=1551113644",
    "minimum_requirements": "OS: Min Spec:  Windows Vista/7/8/10 Processor: Intel P4/AMD Athlon XP or better Memory: 1 GB RAM Graphics: 256Mb DirectX 9 Compatible Graphics Card Storage: 1 GB available space Sound Card: DirectX Compatible Sound Card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Now i don't normally write many rewievs, but here goes.  I am a big fan of the warhammer universe and have played countless of titles therein.  The idea behind this game is fantastic. It is a standalone expansion to the previous title Warhammer 40k Armageddon, this time from the orks perspective as the title indicates. To list up the good, this game offers immense strategical depth, you can sit for hours trying to learn the different units and what will work best together as your 'core' army. The developers have tried to put you in the position of the ork side in the second war of armaggedon. This means that you play almost the same maps as ork instead of the imperium of man.  Now orks are supposed to be a horde race that overwhelms you. I say supposed because when you play as the empire, you will be overwhelmed. There is a 'somewhat' increased unit cap in the orks, but where as the empire you actually played against superior numbers with supreme technology the developers have taken shortcuts for the sake of 'challenge'  This game gets the thumb down from me because the premise is flawed. you will NOT play with superior numbers. instead you will play with inferior numbers and tech. You are supposed to be on the other side of the conflict, so the same scenarios where you struggled to get some good tech support units, now the empire fields only lategame supreme tech in massive waves.   This brings me to the poor ai, the units transfer exp from map to map, so it becomes very important to preserve your good units. This can easily be accomplished by placing squigs infront of your tanks. The ai will target your squigs( kind of pigs) with their titans before engaging your tanks. This breaks all kind of immersion in the game.  Summary: For the sake of 'challenge' the developers spam high tech units that makes you feel like the empire suddenly has become 10x bigger and more teched. This game receives thumbs down from me mostly so that the developers will stop taking shortcuts and break immersion for the sake of 'challenge....",
            "review_score": "-1"
        }
    ]
}