{
    "app_id": 455400,
    "name": "PAC-MAN 256",
    "release_date": "2016-06-21",
    "developer": [
        "BANDAI NAMCO Studios Vancouver",
        "Hipster Whale",
        "3 Sprockets"
    ],
    "publisher": [
        "BANDAI NAMCO Entertainment"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Local Multi-Player",
        "Local Co-op",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "Arcade",
        "Casual"
    ],
    "achievements": 10,
    "positive_ratings": 811,
    "negative_ratings": 81,
    "price": 3.99,
    "description": "PAC-MAN 256 is the maze that never ends. But the Glitch is coming for...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/455400/header.jpg?t=1539273721",
    "minimum_requirements": "OS: Windows XP Processor: Intel i3+ or equivalent Memory: 1 GB RAM Graphics: Nvidia 8800, Radeon HD35xx, Intel HD 4000+ DirectX: Version 9.0c Storage: 100 MB available space",
    "recommended_requirements": "OS: Windows 7+ Processor: Intel i5+ or equivalent Memory: 2 GB RAM Graphics: NVidia 560+ or equivalent DirectX: Version 9.0c Storage: 100 MB available space",
    "reviews": [
        {
            "review_text": "Pac-Man 256 is inspired by the Level 256 Glitch that appears in the original Pac-Man game. When one reaches level 256, the right half of the maze bugs out as a result of the game trying to spawn 256 'fruit' in the bottom right corner. Regardless of the level being impossible to complete, the maze is traversable.  In Pac-Man 256, not only will you be doing the same thing on Pac-Man, but you must escape from the Glitch at the bottom of the screen that's trying to kill you as well, all the while trying to get a good score. Each of the ghosts has its own pattern, so you'll need to memorize which ghost does what in any given situation. There are also additional features, such as a Pac-Dot chain, Ghost Chains greater than 4 ghosts, powerups that help kill off ghosts, and a leaderboard that records your top scores.  Pac-Man 256 can be brutal at times, but the replay value is worth the price. And this is unlike the mobile version of the game: Credits are removed, no advertisements, and no upgrade wait times are big perks when compared to the mobile version. If you're still unsure, give it a try on mobile if you can.",
            "review_score": "1"
        },
        {
            "review_text": "Out of nowhere this just came along and turned what was originally a pretty mediocre, IAP ridden mobile game with crappy touch controls (WTF plays ANY kind of Pac-Man with swipe controls to begin with?) into one of the most fun games I have played this year thus far. Get this, then get your friends and family to get it and have a fantastic time competing with each other on the leaderboards. Removing the IAP garbage and adding full controller support has catapulted it to the heavens. And just when things could not get any more fun or entertaining for $4.99, they went and added co-op couch multiplayer for up to four people at once! The great thing about this multiplayer too is that instead of competing against each other you are helping other as a team to accumulate your high score. It is perfect to play with your kids.  As a Pac-Man fan since the very beginning of his existence, I cannot recommend this enough. I will even go as far as saying that I am enjoying it more as a pick up and go game than DX just for its more laid back approach.  5 Blinky's out 5!",
            "review_score": "1"
        },
        {
            "review_text": "'Is This Game Worth It's Price Tag?' is the question I'm guessing that you are asking..  My answer.. If you love Pac-Man, if you loved the old school Pac-Man then 'YES!' is my answer to you. Obviously, if you are looking for an FPS shooter or a deep story drive RPG, then you need to look elsewhere, lol.. just sayin'  I streamed the game when it first launched on Steam after purchasing it myself... You can that hour long stream right HERE:          YouTube™ Video:  Pac-Man 256 - A New Pac-Man Steam Game! ..Is It Worth Your $5 USD?? LiveStream!&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "A solid as hell videogame on its own, paying homage to the true arcade experience, whilst blending 21st modern videogame mechanics with its perks and loadout system. The game is really really fun if you have another player too, though it is limited to local co-op as far as I am aware. There isn't really much else to say about this game; it's PAC-MAN, and if you have never played PAC-MAN, then this would probably be a good start for a newcomer.",
            "review_score": "1"
        },
        {
            "review_text": "A new twist on a simple classic. Never-ending Pac-Man mazes are surprisingly fun. Coupled with a RPG-styled leveled power ups, there is a tinge of depth to Pac-Man now that FEELS like it belongs.  The game loads fast and plays fast, and is very simple to understand and get into. Kid friendly in content and learning curve. And so far (3+ hours in), it's been glitch free as well.  If you like old school arcade games, its worth every $5.  ",
            "review_score": "1"
        },
        {
            "review_text": "Super addictive fun. Would recommend this game highly that likes a quick arcade game with lots of achievements and bonus items. Most enjoyable game I've played n a while.",
            "review_score": "1"
        },
        {
            "review_text": "Extremely addicting game, don't stop playing it ever.",
            "review_score": "1"
        },
        {
            "review_text": "Great fun.. Played this a while back on my phone and enjoyed it.. but it's far better on my laptop using keys to play (I will play with my arcade stick when I go back home - I hope it is compatible). Pac Man 256 is very addictive and keeps you coming back for just another go. While it can never match the original or Pac Man CE DX+ (one of the best games of all time) it's still a fantastic addition to the franchise and for only 3.99? Bargain!!! Grab it!",
            "review_score": "1"
        },
        {
            "review_text": "Pac-Man is back...  And better than ever! Take the classic Pac-Man and mix it with an infinite dungeon crawling, points-collecting style and BAM!  Best Co-Op game I've played in awhile... Even my girlfriend (who isn't too much into games) loves it.  And for the low price it's even more attractive!!!",
            "review_score": "1"
        },
        {
            "review_text": "Rarely have I encountered a game I am so drawn to.  The mechanics mirror the original and the new content comes in the form of characters, power ups and level variations.  I play this 2 and 3 player with friends a lot.  It's in my top 5 right now and I expect it to be one of those stupid simple classics that will stay legendary forever.  It's like Pizza, Spaghetti, or Steak - so stupid simple and brilliant all at the same time.",
            "review_score": "1"
        },
        {
            "review_text": "A very cool take on the classic arcade game. The new power ups are awesome and add new twists to the overall game play. Highly recommended, even if you are not a fan of the original.",
            "review_score": "1"
        },
        {
            "review_text": "Not only is it fun, it works wonders entertaining small children. Thank you HW!",
            "review_score": "1"
        },
        {
            "review_text": "Very very fun.  Local multiplayer is a big plus. if you have people over that want to play this game, you really don't have to explain much: 'It's Pac Man'  Tip: Do the missions and save all your coins. Upgrade Fire, Pyro, laser, and optics. Save the rest for the higher powerups.  ",
            "review_score": "1"
        },
        {
            "review_text": "this is a cool version of the pacman arcade, I tell what you get in the pros skip this text if you don`t wanna know more about other cool pacman tittles, the first thing that comes in my mind when defining pacman 256 a good game is first place gather which other games we have available in this franchise to compare to, in that case I would consider pacman dx+ and pacman 1, with dx+ you get a amazing soundtrack and a very futuristic gameplay that might be too much to pacman 1 die hard fans, and if you buy pacman 1 in 2016 you will can have a bad time dealing with the extremelly hard dificulty of the original, but than you have this another great game in the franchise called pacman 256 where you don`t get a very dedicated soundtrack like in dx+, or the confusing maze of the original but you gotta love everything else about it  +awesome powerups like tornado and stealth +pickup and play +cold death, this one have no bullet time like dx+ !!  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Multiplayer is a blast &amp; really easy to pick up for any age or ability.",
            "review_score": "1"
        },
        {
            "review_text": "It's pacman, with yet another twist. What's not to love about it? Get it, you'll love it. It's fuc***** pacman man. Just do it. Give pacman your fuc*ing money now.",
            "review_score": "1"
        },
        {
            "review_text": "It's a glorifed flash game but considering the sale price, I got my money's worth.",
            "review_score": "1"
        },
        {
            "review_text": "A fantastic little arcade game. It's fun if you have someone to play ti with in multiplayer, plus you unlock new powerups faster. On its own it does become a bit of a grind, but hey, anything for that 100% completion rate right? It is however a great take on an old classic and the fact that you have to keep moving forward without turning back makes you calculate teh timing of collecting powerups and the exact paths that you need to take in order to progress. All in all for this price, I would definitely recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "I played this for about two hours. Its addictive, its fun, but its free on phones, and vastly inferior to Pac Man Championship Edition DX.   PAC-MAN 256 is a Pacman interpretation of Crossy Roads. Pacman must navigate an RNG maze with ghosts with new behaviors exclusive to 256 (Pinky is still the biggest threat though.) Behind Pacman is a wall of 8-bit glitchy cacophony that swallows everything up. You rack up points primarily from dot combos, which max out at 256, hence the name. Furthermore, an assortment of powerups is gradually collected for your arsenal, which replace traditional power pellets and which you can optionally equip.  The pace is frantic and fun like Crossy Roads, but I hope you don't care about score, because 256 is basically at the mercy of RNG. Occasionally very tight dual lanes will generate with no escape. Your dot combos are occasionally broken by areas where the dots simply stop for no reason. The worst offender of them all is the camera. THE CAMERA! IN A PAC MAN GAME! The camera is centered around PAC man no matter what, limiting your view of whats ahead, and what awaits you when you use the side warps to stay alive.  Children will like this, I know I do, but they could get it free on their phone, and for a more finely tuned experience, CE DX is the superior alternative.",
            "review_score": "-1"
        }
    ]
}