{
    "app_id": 455490,
    "name": "Don't Die Dateless, Dummy!",
    "release_date": "2016-03-21",
    "developer": [
        "cupholder"
    ],
    "publisher": [
        "cupholder"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Stats"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Simulation",
        "Adventure",
        "Indie"
    ],
    "achievements": 4,
    "positive_ratings": 40,
    "negative_ratings": 27,
    "price": 1.99,
    "description": "Choose your route carefully and win the heart of a special girl or you might end up a level 30 wizard! Will you walk the path of a changed man or will your magical powers be unleashed?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/455490/header.jpg?t=1458610844",
    "minimum_requirements": "OS: Windows XP and up Memory: 256 MB RAM Graphics: DirectX 9.0c capable gpu Storage: 150 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Should be free. It's funny but lacks contents.  There are 3 different endings, each time the game will take you about 10 minutes to finish. I was trying to take different paths, but they made little to no difference in the end.  Gameplay is basic visual novel, where you read a part, answer some questions which defined how the story continues.   Even for visual novel, this is way too short. One playthought takes about 10 minutes, when you read everything. So you could beat it 100% in less than an hour.  With more content, if it was lenghtier I could recommend it. But the way it is, I can't recommend paying to play it.",
            "review_score": "-1"
        },
        {
            "review_text": "The choices' effect on getting a good ending or a bad ending appear to be arbitrary. There is no way to determine which choice is right because the 'right' choice is whatever the developer wants it to be instead of what makes sense. You can play through and get a bad ending, then play through again with the opposite choices and still get a bad ending. If you enjoy making random choices until you stumble on the right combination to get a good ending then this might be for you. It's probably better to forget about this and go talk to some real girls in real life.",
            "review_score": "-1"
        },
        {
            "review_text": "Had some laughts but it was too short, should be free.",
            "review_score": "-1"
        },
        {
            "review_text": "Meh, not worth the asking price. Boring, slow, too easy to become a Wizard.",
            "review_score": "-1"
        },
        {
            "review_text": "You're a wizard, Harry! Level 30 to be exact. 10/10",
            "review_score": "1"
        }
    ]
}