{
    "app_id": 456810,
    "name": "Zombillie",
    "release_date": "2016-04-29",
    "developer": [
        "Forever Entertainment S. A."
    ],
    "publisher": [
        "Forever Entertainment S. A."
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Casual"
    ],
    "achievements": 16,
    "positive_ratings": 134,
    "negative_ratings": 50,
    "price": 3.99,
    "description": "Help Zobillie reach the legendary meat farm. A long road ahead: a 90 complex levels full of puzzles and traps.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/456810/header.jpg?t=1461965313",
    "minimum_requirements": "OS: Windows 7 Processor: Dual core from Intel or AMD at 2.0 GHz Memory: 1 GB RAM Graphics: nVidia 320M or higher, or Radeon 7000 or higher, or Intel HD 3000 or higher DirectX: Version 9.0c Storage: 1 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I got it about an hour ago and I love it. It's a puzzle game, and really long one too, much like the classic snake game, with extra stuff to increase the difficulty. It has a difficulty system that can change it up if you find it too easy (or too hard, you know...). There are twenty-four different floors in just the first level, out of three. The down side of it is that you have to collect a certain amount of hearts to go to the next floor or to the next level. This can make it a bit redundant, but, if you like puzzle games, you won't mind. The graphics are good and has it's own charm. I was impressed with everything this game has to offer and, again, I've only played it for about an hour. Now, the price is a little rough, unless you use hundred dollar bills to blow your nose, but not any worse than most Indie games(because, you know, they need to eat). I ,personally, had a coupon from making a badge for it and scrounged up the last buck twenty-five, but, if it's on sale, I'd recommend buying it.",
            "review_score": "1"
        }
    ]
}