{
    "app_id": 45700,
    "name": "Devil May Cry 4",
    "release_date": "2009-12-22",
    "developer": [
        "Capcom"
    ],
    "publisher": [
        "Capcom"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Full controller support"
    ],
    "genres": [
        "Action",
        "Adventure"
    ],
    "tags": [
        "Action",
        "Hack and Slash",
        "Character Action Game"
    ],
    "achievements": 0,
    "positive_ratings": 1620,
    "negative_ratings": 144,
    "price": 15.99,
    "description": "Devil May Cry® 4 immerses gamers in a gothic supernatural world, where a new protagonist clashes with a familiar hero. As the new leading man, Nero, players will unleash incredible attacks and non-stop combos using a unique new gameplay mechanic, his powerful &quot;Devil Bringer&quot; arm.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/45700/header.jpg?t=1550020915",
    "minimum_requirements": "OS: Windows XP Service Pack 2 Processor: Intel 4 Pentium processor or better Memory: 512 MB Graphics: NVIDIA GeForce 6600 series or better Hard Drive: 8GB of free space",
    "recommended_requirements": "OS: Windows Vista Processor: Intel Core 2 Duo processor or better Memory: 1GB Graphics: NVIDIA GeForce 8600 series or better Hard Drive: 8GB of free space",
    "reviews": [
        {
            "review_text": "The best DMC game on steam currently since DMC3's port was godawful sadly, This game can probably run on a potato the engine is so lightweight and if you have a system to max it out, it looks glorious and runs at constant 60fps, I would say get a controller though, but you don't NEED one i just prefer it. The combat has a lot of potential mostly with dante and his on the fly style switching, decently challenging including a PC exclusive mode Legendary Dark Knight mode that spawns in hordes of enemies that isn't present on the console version for obvious reasons, overall a good buy.",
            "review_score": "1"
        },
        {
            "review_text": "I paid $5 for Devil May Cry 4 and it took around 13 hours to finish on Devil Hunter mode. I used an Xbox 360 controller the entire time. I wouldn't say I did great, but I still got to the end with some frustration. I'd say I highly recommend this one.   I've never played a DMC game before. The closest I got was  X-Blades  and that...wasn't really a good representative of the spectacle fighter genre or whatever it's called. This review is probably better aimed at people new to the series like I was.   The game is a third-person action title. Apart from solving some simple puzzles, DMC4 largely revolves around fighting groups of mooks and large bosses, often in a “room locks, kill everything to proceed” format. Nero's gameplay involves using a mix of his gun and sword for regular combat, but he has a unique feature in his Devil Bringer arm for heavy but slow attacks or for bringing an enemy/yourself closer or to evade some attacks. Dante's gameplay involves on-the-fly swapping between his four stances along with changing his ranged and melee weapons. Nero's playstyle felt easy to use for a newcomer like me, and Dante felt pretty advanced though I still did fine without really using his full potential.   DMC4 is the kind of game that rewards you for learning its systems and playing well. You're graded at the end of each mission on time taken, Style points, the percentage of Red Orbs found, and any modifying bonuses or penalties like using no items or dying and continuing. Higher ratings give more Proud Souls which are spent to unlock new abilities or weapon combos or the like. You can also refund spent Proud Souls to tweak or completely remake your build between missions or at the Divinity Statues scattered through the environment. Time taken is self-explanatory, and Red Orbs are found in the world and are dropped by enemies, and these are spent at Divinity Statues for consumable recovery items or permanent boosts with no refund option.   As for Style points, one of the series' features is its high risk Style system. By avoiding damage and attacking enemies with strings of combos, your Style meter will raise and increase in rank. Getting hit will knock you down a couple of ranks, and using your guns to play it safe won't impress anyone. It's a largely optional feature, but apart from the rewards mentioned above, it does feel awesome to work up to a high rank and keep it going.   There are a total of seven difficulty levels though you start with two. For what I played being “normal” level, it was still pretty tough, though I imagine it'd be a cakewalk for veterans. Apart from the unlockable standard hard and very hard, there are a couple of different ones where both you and the enemies die in a single hit, where only you die in a single hit and the enemies don't, or one where enemies spawn in fairly large packs as shown in some of the screenshots on the Steam Store page. There are other things to unlock on the collectibles side, like the Gallery entries or in-game achievements, and there are Secret Missions hidden away with bonuses for those who can complete them.   Overall, I enjoyed DMC4 despite some annoyances like having to fight the camera a couple of times, or bosses that were a chore to kill. I probably won't pick it up again anytime soon, but I left the game on a high note at least. The game ran incredibly well on my rig in DirectX10 mode and I think I only saw less than 60 frames maybe once the entire run. There's a lot of replay value if you like the idea of harder challenges or just want to get a better score. This version of the game tends to be cheaper than the Special Edition, though that obviously has more content and features in its favor.  ",
            "review_score": "1"
        },
        {
            "review_text": " Devil May Cry 4  is an action hack and slash fantasy game. It is renowned as quite challenging (with solid AI and bunch of difficulties), therefore, a simple button mashing won't be beneficial. In addition to fighting, there are also some puzzles to solve and a good plot to enjoy:   Story  itself is a sequel to  Devil May Cry 3  but fully understandable even if you didn't play previous games.  Summary  of the story in one sentence: Nero goes out on a hunt to kill Dante, a half demon who's presumably a murderer, just to find out who's the real threat to mankind. It has a little bit of everything: action, drama and comedy, thus, making it a really enjoyable ride.  During the playthrough you get to play as both  Dante  (easygoing, sarcastic and calm guy) and  Nero  (impetuous and naive kid). They have a decent weapon arsenal and skill diversity but plays similarly. The character swap happens as you progress halfway through the story but the main issue here is that as soon as you get to play as Dante you must complete the same path that Nero did. Only backwards with few additions here and there. This turns into a bigger problem when you have to kill the same boss for the third time throughout the game. It shows laziness and lack of creativity from developers. Another thing that I really loved is that demons (especially bosses) have a very unique design and differ in their abilities. Accordingly, you're bound to adapt and learn how to deal with them.  The biggest disappointments for me were controls, the menu and the most of all, absurd camera angles. These problems greatly reduced my enjoyment while playing but nevertheless the positive aspects strongly outweigh the negatives and I'd recommend this game to everyone.   7/10",
            "review_score": "1"
        },
        {
            "review_text": "DMC4 is a fun hack-and-slash romp, with two distinct styles of play. As you progress through the various levels and difficulties, you slowly accumulate power, and become something akin to a ♥♥♥♥-talking, pizza-eating badass. And by akin to, I mean that's exactly what you become.   There are two characters in DMC4, each with their own style of play- you play as Nero for the first half of the game, and the overall series protagonist, Dante when he is incapcitated.   Nero uses his demonically-enhanced arm, the  Devil Bringer  to pull off most of his special moves, which mean most of them are grappling moves. These range from just slamming a common foe to the ground to tossing and flinging a boss through the air. In addition, he wields his sword- the   Red Queen  - and his revolver- the   Blue Rose . Each can be charged for more powerful attacks.  Dante is a more versatile character from the time you get him, wielding three weapons at the beginning and gaining four (well, five) as you progress. Each weapon has it's disadvantages and advantages (Gilgamesh is slow, but strong i.e) and can further diversify it's moveset with the use of  Styles - which allow you to further customize how Dante plays.  If I have any complaint, it's that some of the button prompts have been unchanged from their original console release.",
            "review_score": "1"
        },
        {
            "review_text": "Personally, I enjoyed the game a lot, the combat does feel a tad stiff, but it tends to keep you on your toes. The game is a bit easy, but there are ways to make it harder. The added difficulty is somewhat artificial though, as it adds more enemies and makes you take more damage. They constantly reuse the same enemies, bosses, music, and even areas. If you fall into a habit of reusing the same combos, it will definitely start to feel stale. All in all, it's a good game, but does suffer from laziness, as I expected more assets and variety.",
            "review_score": "1"
        },
        {
            "review_text": "I usually don't like these kind of games, but I loved DMC4. Great story, dialogue, setting, characters and cutscenes, which really make the game for me.   The fighting is kinda fun also, but wasn't the unique point, that stood out for me",
            "review_score": "1"
        },
        {
            "review_text": "Fun Hack and slash action game with a good story",
            "review_score": "1"
        },
        {
            "review_text": "Why didn't I start playing this earlier?  Fantastic port (re plays and runs without a hitch on PC).  Get your controller out and get comboing 'smokin sick style'",
            "review_score": "1"
        },
        {
            "review_text": "Not the best DMC game, but still good. Being able to switch between styles instantly on Dante allows for some crazy combos. Shame you can't play as him for half the game though.",
            "review_score": "1"
        },
        {
            "review_text": "Honestly I dont have anything bad to say about this game. It looks great, the cutscenes are amazing, and the gameplay is fantastic. It is more for a controller though which is completely fine, some games are like that. I started to play through it but kept restarting because in my mind I wasnt going fast enough. This game would be amazing for speedrunning and I might try to learn it.",
            "review_score": "1"
        },
        {
            "review_text": "Not the best DMC game, but still good. Being able to switch between styles instantly on Dante allows for some crazy combos. Shame you can't play as him for half the game though.",
            "review_score": "1"
        },
        {
            "review_text": "This game is good but I expected it to be better. I thought it'd be like DMC 3 but with updated graphics and properly ported to the PC. Granted it looks great and actually works but there were no moments that made me grin with delight like in DMC 3. Most of the game you are playing as Not-Dante. I don't know why they made the new character and then made him just a supermarket own brand rip off of the character you actually want to be playing as. The level design is disappointing, you go through one way as Not-Dante and then back again as Dante. There are some really cool weapons but you have no choice with Not-Dante and you don't get much chance to use Dante's weapons before switching back to Not-Dante. One bit particularly annoyed me where (unless I was doing something wrong) you could not get past a hall of lasers if you had not bought the correct upgrades. Overall however I would recommend this over DMC 3 because it is fun and it actually works on the PC.",
            "review_score": "1"
        },
        {
            "review_text": "Gothic elements mixed with intense stylized combos and a variety of methods to kill. Juggling, faceplanting, and impaling enemies on their own weapons and body parts is addiciting and satisifying as all hell!  There's also a classic love story quickly driven to the save the princess from the demon castle filled with devotion to cause, denial of rescue, and resurging determination.  All this bundled together with a hit of playful bad@$$-ary clashed together with punk attutide.  Swords, guns, and demonic powers are at your seemless disposal.  Oh, and did I mention you get to play as Dante, the King of won't take your s*** but you'll get to take mine?  Also, the controls work quite well despite being ported from Console, seems they learned their lesson from DMC3",
            "review_score": "1"
        },
        {
            "review_text": "Best PC port I've ever played. If you love challenging stylish-action games, this is so for you! Total blast from the past!!",
            "review_score": "1"
        },
        {
            "review_text": "Omg this should cost more than it looksi love the detail keyboard controls no mouse needed!!! The graphics are so amazing and i got a medium good Computer Radeon HD 6490 Gosh so amazing no lag Love this Game Keep it up!",
            "review_score": "1"
        },
        {
            "review_text": "Devil May Cry 4 takes upon a new character under the name of 'Nero' who is a 'Devil Bringer' in his own right. What starts out as the typical storyline for Dante to take over, Nero takes upon that role to perish the hellish creatures arising into the world. This is a great hack/slash game and I would give it to anyone who's got a decent graphics card and processor to handle it.",
            "review_score": "1"
        },
        {
            "review_text": "First off, this version of the game has been made obselete by the Special Edition, which has more playable characters, a couple new modes and more content for your buck. That said, I happened to buy this before the Special Edition came out...and I'm actually surprised that they released an updated version of this game in 2015, because some parts of it are dated as hell. All the standard tropes of PS2-era Japanese action games are on full display, ranging from fixed camera angles, obscenely annoying special missions, arbitrary puzzles (this was always Devil May Cry's schtick though) and a story that's like reaaaaaallly anime, and not in a great way (also Devil May Cry's schtick, with the exception of the third game).   But the actual meat and potatoes of DMC4, the stylish combat, is still really good. You've got a crapload of weapons, including my favorite - the Pandora, a transformable suitcase that changes into 666 different types of gun - and switching between Dante's styles or using Nero's devil arm on the fly to throw foes is grand. Only thing is, I would've liked the game more if it had just starred Dante, especially because Dante's levels are a backtracking paltry amount compared to Nero's. Nero reminds me too much of a Final Fantasy protagonist, and part of the joy of DMC is watching Dante take the ♥♥♥♥ out of everything because he knows he's an outrageous demon hunter. Nero just doesn't have that flamboyance, and I get that he was created to draw new players into the series, but because his design is so similar to Dante, you can't help but compare the two. Dante always comes out on top...so it's like, what was the point of putting Nero in there at all?  Anyway, still a solid game, though DMC3 remains the king of the pre-reboot titles.",
            "review_score": "1"
        },
        {
            "review_text": "go buy it at once!",
            "review_score": "1"
        },
        {
            "review_text": "Very very nice game.",
            "review_score": "1"
        },
        {
            "review_text": "Very very nice game.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game! Every gamer should play it!",
            "review_score": "1"
        },
        {
            "review_text": "Strongly suggest a controller for this game, keyboard is rough but nonetheless, the games amazing.",
            "review_score": "1"
        },
        {
            "review_text": "[Pay no heed to this play time. Trust me, I've played a lot more than what's shown.]  While not quite reaching the perfection of DMC3, DMC4 still stands as one of the best of the genre. The tight gameplay, great music and unforgettable characters make this game very worthwhile to pick up if you're a fan of the genre.  First off, this game looks gorgeous. The environments are very beautiful, and the setpieces are marvelous. The characters themselves look very good, even though they don't actually look too realistic. For a 6 year old game, the visuals definitely still hold up to this date. Also, this game can run perfectly even on mid-range rigs (my 820m could run it at a smooth 60fps all the way, although at 720p).  The gameplay is what really makes this game shine. The controls are very tight, whether you're playing on a gamepad or with a keyboard (gamepad is infinitely better, but keyboard is still great if you're used to it. If you're not, it won't take long to get a grip on the controls, trust me). You never really feel like deaths happen on the game's end, and not on yours.   While hacking your way through the smaller enemies is great, the bosses is where this game is at its best. Recognising their patterns and acting accordingly is what it's all about, and it feels seriously good if you manage to pull it off. The gameplay distinction between Nero and Dante is also very good. Both have upsides and downsides, and I can't really choose favourites. Dante is so fun because of his different weapons and styles, and Nero is so much fun because of his Devil Bringer, and the many uses it brings with it. Who you'll like more is all up to you to decide.  The only real downside is how Dante's side of the story is a literal backtrack of Nero's story, down to fighting the exact same bosses. This bogs it down quite a bit, as there is a lot of missed potential here. However, fighting these bosses again with a different playstyle does feel fun and refreshing, so that makes up for it a bit.   All in all, this game is seriously great. Learning it may be easy and quick, but mastering it to get to the higher difficulties is very difficult and very fun. Pick it up if you like these games. You won't regret it. At all.",
            "review_score": "1"
        },
        {
            "review_text": "This. Game. Is. Epic. The battle mechanics are extremely fun and the graphics are excellent. The only issue I found is that the story is kind of short. This game is definitely worth the buy",
            "review_score": "1"
        },
        {
            "review_text": "Nothing but a good time, how could you resist?",
            "review_score": "1"
        },
        {
            "review_text": "It's Devil May Cry. You're a big dude with white hair and a big sword. But this time there's TWO big white haired dudes. The combat is mostly the same as in DMC3 but now you can change styles mid-fight.",
            "review_score": "1"
        },
        {
            "review_text": "better than the new DMC",
            "review_score": "1"
        },
        {
            "review_text": "Outstanding, a bit confusing. But you start to adapt more. Make your quest to get that Super Dante, and Super Nero.",
            "review_score": "1"
        },
        {
            "review_text": "THE TIME HAS COME AND SO HAVE I",
            "review_score": "1"
        },
        {
            "review_text": "Alright ♥♥♥♥♥es first steps first turn off your speed hacks and get ready with your X-Box 420 controller because this game is about to get ♥♥♥♥ing real. Turn that difficulty up to its highest and flip that fedora on because you're going to need to do all the ♥♥♥♥ing quick scopes you can in the next ten minutes. Holy ♥♥♥♥ is this game hard, but It's alright you got your hoes to help you out since you'll be button mashing 360 quick-scoping all those ♥♥♥♥♥♥ demons. oh baby a triple, quad, deca, holy ♥♥♥♥ you're god like, bow down to the DMC king. everyone surrender your Doritos and Mountian Dew we've got the Pros in the house.  Buy the game ♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "DMCCCCC Best action game ever,never get bored of story line And a very good monster with so nice graphic 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Great game",
            "review_score": "1"
        },
        {
            "review_text": "This DMC is about as good as being crushed to death by marshmellows with hard tips. Nom nom nom.",
            "review_score": "1"
        },
        {
            "review_text": "This is game! ",
            "review_score": "1"
        },
        {
            "review_text": "The Devil May Cry franchise has never failed. This is my favorite one &lt;3.",
            "review_score": "1"
        },
        {
            "review_text": "Definitely the best Devil May Cry game in the original series. They've perfected this genre, and although there are minor gameplay issues, its nothing that totally detracts from the game, because it keeps you wanting more. The story is decent enough to drive the game along, but the Graphics are amazing, even after playing it so long after its release. The detail and fluid action animations are just mind blowing, and downright gorgeous (especially if played at 120FPS on a 120Hz Monitor!). If you like action games with a bit of a challenge, this is a great game to pick up.",
            "review_score": "1"
        },
        {
            "review_text": "Doesn't bring a whole lot new to the DMC series but a fun entry nonetheless. Nero isn't the most pleasant protagonist but he's tolerable and the game is pretty fun. Devil Bringer is an enjoyable feature but the fact that Nero lacks the tricks that Dante has means that fighting enemies you can't use devil bringer on is irritating, and going through the levels as a character without devil bringer (Dante) is a bit simplistic since you can't do any of the platforming/puzzle solving bits. Overall though a solid game.",
            "review_score": "1"
        },
        {
            "review_text": "The funny thing about the Devil May Cry series is that it's a revered action franchise that only has three good games in it. 1 has great gameplay but rubbish everything else, 2 was terrible, 3 was the pinnacle of the series, and the recent reboot DmC: Devil May Cry was just abysmal. 4 is another good entry of the series, and while it doesn't reach the heights of 1 and 3, it's still an extremely fun specatacle fighter with some great bosses and gameplay, but far, far too much repition.",
            "review_score": "1"
        },
        {
            "review_text": "Have an xbox 360 / PS3 controller? Get this game if you like the DMC series! (not really worth playing with a mouse and keyboard).",
            "review_score": "1"
        },
        {
            "review_text": "The best game in the World!",
            "review_score": "1"
        },
        {
            "review_text": "As you can see i don't have much time on this game, but i have just recently completed the whole game. But between DMC 5 and DMC 4 they are very different, these are the only two i have played so far but i have to say i like DMC 5 better, to me its more fun and it makes more sense for DMC to be that type of game and it felt like it worked better than the style this game takes. But still this game is very good i just find the other one more action packed i should say and it ended up being more satisfying. i also liked the style of DMC 5 better too, i like how its a modern style rather than gothic and i like the young dante best he was cocky and funny as hell.(i also hate nero he's like a dante wannabe, dante is way better)    Result: 8.5/10  I'd reccommend this game any day",
            "review_score": "1"
        },
        {
            "review_text": "Ok so I finished this game after devil may cry 3, gotta say its epic game hard, flashy moves, and cool new character Nero :O.  Buy it!!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing. Seriously. No joke. I ♥♥♥♥ing love this game. There are even mods for this damn game. This game is 6 years old and is still one of the best hack n slash games to ever exist. ♥♥♥♥ing fantastic. If you liked ANY of the previous games, or the new one, get this ♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "Just a nice game!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best character action games ever made, I personally prefer DMC 3 but this game is a very close 2nd. I wish I could just use Dante the whole time though.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, game port, great everything. This is far better than DMC3, and the DMC3 port is pretty terrible.",
            "review_score": "1"
        },
        {
            "review_text": "textbook definition of good action game",
            "review_score": "1"
        },
        {
            "review_text": "MY ARMY COMES FROM DEEP WITHIN BENEATH MY SOUL BENEATH MY SKIN AS YOU'RE ENDING I'M ABOUT TO BEGIN MY STRENGTH IS PAIN AND I WILL NEVER GIVE IN",
            "review_score": "1"
        },
        {
            "review_text": "outstanding but would be better with two buttons fo sword combos alone ",
            "review_score": "1"
        },
        {
            "review_text": "action incarnate",
            "review_score": "1"
        },
        {
            "review_text": "Very good but not as good as DMC",
            "review_score": "1"
        },
        {
            "review_text": "You only need to beat the first half of the game because the second half of the game is going backwards through the first half as a different character.   10/10 I &lt;3 lazy game development.",
            "review_score": "-1"
        },
        {
            "review_text": "boring if you don't have a controller",
            "review_score": "-1"
        },
        {
            "review_text": "Bought this one, along with DMC3 special edition. Waste of any money spent in it (dollar or euro)... DMC3 key binding with none-us-layout keyboard is quite impossible to figure out. DMC4 has similar issues. If it is that hard to get proper key bindings for a game, so people cannot even start to enjoy it, better to avoid buying it and warning people to stay clear... beware of buying CAPCOM nice price stuff while not owning a standard (US-)keyboard and having to possibility to change bindings....",
            "review_score": "-1"
        },
        {
            "review_text": "1. It's not possible to change the resolution (It's fixed to 1080x720) 2. Menu (and subtitles) are in german. No way to change it to english",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this game expecting some mindless hack-and-slash fun but instead I was running around with nothing to fight most of the time. Instead, you spend a bunch of time trying to figure out how to grapple to that platform, pushing around cubes to unlock a door, searching some bland castle for orbs to unlock some skills, or just back-tracking trying to figure out where you are supposed to go next. There was very little to keep me interested for very long. This game plays like a mediocre early PS2 era game. For $5 you could do worse, but if you have a backlog don't bother with it.",
            "review_score": "-1"
        },
        {
            "review_text": "I enjoyed this game for about 30 minutes (with a gamepad,without it not a chance.) but after that it just felt so repetitive and boring. I now understand while people consider this game to be so terrible.",
            "review_score": "-1"
        },
        {
            "review_text": "This little ♥♥♥♥ walked into MY dmc game and pretended they were the main character. I dunno who let this kid in, but the only cool thing he ever did was sneeze and accidentally block a fire cat-man's sword. Put him back in the cage with reboot dante. I'll be here, playing the latter section of the game, with dante, on the ps3 where I actually played this.",
            "review_score": "-1"
        },
        {
            "review_text": "Starting out Devil May Cry 4 is my first hack-and-slash game, and I have to say I loved it. It's a great way to introduce newcomers into the world of Devil May Cry and the hack-and-slash genre, while keeping the more experienced players engaged. (tl;dr at the bottom) I have to say for this being a somewhat older game it still holds up great in comparison to some of the newer games compainies are pumping out left and right. The story is easy to follow even for people who haven't played the previous games. I myself didn't have access to a controller at the time I bought this game but the keyboard controls aren't actually all that bad. I would recommend if you plan on playing on higher difficulties you may want to get a controller, it will make everything much easier.  Environments are well deisgned but repeated in the second half of the game which can be on the side of tiring. The battle system really makes you feel like you're in control of whats happening, especially with the power of Nero's devil arm. The characters are well rounded with great voice acting, along with the character designs themselves. The optional missions are also a great addition, letting you upgrade your characters even further, or to give a change of pace from the story. With the many different difficulties it gives it great replay value.  tl;dr  If you want to cut some demons apart with a giant, flaming sword this is the game for you. It's fun, straight forward, and fast paced. Hope you don't mind backtracking for the last half of the game. 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "The player will assume the control of 5 different female ninja characters. The more they are damaged by enemies, the more their clothes are torn off. The game also features erotic elements that use the features of the Nintendo 3DS system such as stereostopic 3D, 3D cleavage along with 3D images of other body parts. Senran Kagura will feature character designs from Nan Yaegashi and scenario work from Yukinori Kitajima.",
            "review_score": "1"
        },
        {
            "review_text": "So, for people that haven't play this game which I personally imagine there is not a huge gamer without passing through this serie. Devil May Cry 4 Is and will be one of the best part of the franchise in which they gave new characters, new story and a whole new teories related to Nero, but for this game if you really are a huge fan of the franchise is highly recommended but for new fans or new people this game have one of the most horrible bases when changing character to Dante on chapter 12 you can see how the people is absurd on the programmation cause you see the exact same level and to put it rough the exact same bosses with a little increase of difficult, its just horrible how Capcom made that mistake caus who doesn't like when dante has an enormous amount of weapons and how they made it to create more combos, this game doesn't support the greatest re-play cause the only characters or costumes you can actually unlock is the Super version of this characters so for new people i recommend passing throught the entire franchise and come to see this game and how well they executed this game but as the same way how they dropp it down with dante part of the game",
            "review_score": "1"
        },
        {
            "review_text": "Pros - Great combat system, Dante is the same and Nero has an interesting system. Dante isn't an emo either  Cons - back tracking (granted, i'd have played the game through as Dante regardless) to a huge degree, camera is poor at best  i'd recommend it on sale, picking it up with DMC 3 in the bundle especially. Its a great game, if only more time went into new levels rather than just making Dante do all of Neros levels backwards i really would be so much happier with this. Pulling off awesome combos is very satisfying though",
            "review_score": "1"
        },
        {
            "review_text": "Es pretty good, could run this on a toaster.",
            "review_score": "1"
        },
        {
            "review_text": "great game.",
            "review_score": "1"
        },
        {
            "review_text": "Great game! The cinematics are awesome. Different ways to build your character. Good storyline. Lot's of different combos. So far, you are able to use the character Nero only. Would be great to use different characters. But still, very good game.",
            "review_score": "1"
        },
        {
            "review_text": "Its is a very good game.  One of the funestest games i played in a while.",
            "review_score": "1"
        },
        {
            "review_text": "one word... EPIC the new 'DMC' also can`t compare to this epic game",
            "review_score": "1"
        },
        {
            "review_text": "Cool stuff.",
            "review_score": "1"
        },
        {
            "review_text": "this game is like doing really good cocaine and then when you are almost finished with it your mom takes it away from you  screw you mom",
            "review_score": "1"
        },
        {
            "review_text": "A great action game, easily the best game in the DMC series, except for maybe DMC3 ultimate super edition (whichever one came after where they fixed the awful) or the first one. Has a great cast full of memorable laughs and badass moments, not to mention has a soundtrack that consists of some actually pretty good music (boss tracks mostly.) Definitely recomemend to everyone to check out Nero's super nice snatch. Overall Rating: 10/10",
            "review_score": "1"
        },
        {
            "review_text": "ummm ok... its DMC4... must i say more? i mean its a beautiful game, the story is great, and the action is intense, just an all around great game, and the fact that you play as Nero AND Dante, is just great, i mean two completely different characters and one has four different play styles in one. very good, and suprisingly high replay value",
            "review_score": "1"
        },
        {
            "review_text": "Oh, Capcom. You had me at 'fire demon bossfight.'",
            "review_score": "1"
        },
        {
            "review_text": "I love gameplay styles like this one.",
            "review_score": "1"
        },
        {
            "review_text": "grab an enemy, slash and stab them with a freaky combo, smash them into the ground, and boom.. you got SSS for being handsome :D  but too many cutscene here, and the game seems monotone and kinda boring until, at least, dante showed up and being playable..  everything is going crazy here... grab the game fast, hold your breathe, and play your very own style of slashing demons and toads(?).. you can fight a toad as a boss and grab his tongue 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Fun, frenetic action.",
            "review_score": "1"
        },
        {
            "review_text": "1 of the best games i have played yet  i playd it on my brothers xbox  it was on sale on steam and i had to have it  GO BUY THIS NAO U GET TO KICK DEMON ♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed it for a combat action game. Lots of bosses and interesting levels. The basic monsters however fall short of intereting. I just dominated everything except some of the bosses. Pretty good platform combat action game. If you like the old school 3D - First generation action games, then this is a step up from those.",
            "review_score": "1"
        },
        {
            "review_text": "Although the voice acting is under average, this is a very satisfying blade-em-up with some nice graphical options and touch-ups for the PC. Recommeded if you can snag it under $15.",
            "review_score": "1"
        },
        {
            "review_text": "Great game",
            "review_score": "1"
        },
        {
            "review_text": "This is way more fun than I thought it would be. I was a big fan of DMC1 and 2. DMC3 was okay, but lacked some of the awesomeness of 1 and 2. Playing this brought back memories of 1 and 2 (I think the mechanics were tweaked and fine-tuned towards the originals) and despite the newer protagonist, the gameplay is still solid, challenging, and most of all: fun.",
            "review_score": "1"
        },
        {
            "review_text": "Best series/game ever. I love the story, the graphics and the combat. It is a blast playing and is very addicting. BUY IT NOW!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Fast pace and stylish. Best Devil May Cry yet.",
            "review_score": "1"
        },
        {
            "review_text": "Get creative, get crazy, have fun. An amazing port of a great game.",
            "review_score": "1"
        },
        {
            "review_text": "Devil May Cry 4 is a decent game. But, in my opinion it's not a GREAT game. The first devil may cry game I actually played was the latest reboot (which I thought was friggin awesome!' I hear a lot of people trash on the newest dmc but relish dmc 4 and other before but I think the reverse is true. Now, it's a good game; don't get me wrong.   Lots of puzzles and god of war type actions more puzzles and less action than god of war( not that that's bad just an observation) Several different characters in the game, I found them to severely lack in depth. You will finish the game not knowing much about any of them. The action is good, graphics are crisp, soundtrack is decent, fun boss battles, decent puzzles. (Spoiler), you have to play pretty much through all the levels that you beat (all over again) in the 2nd half of the game.  I'd give the game a 7 out of 10, if you want to play a devil may cry game(for the first time) I would buy the latest one. This one was fun, but it defintely was not exceptional.   ",
            "review_score": "1"
        },
        {
            "review_text": "Bestest gaym evyr. Me recymend",
            "review_score": "1"
        },
        {
            "review_text": "Finally returned to this and played to completion. It probably helped my experience that I knew what I was getting into and was aware of the criticism about reusing levels and bosses throughout the game. This felt on the easier side of things when I finished it on Devil Hunter mode, but that just may be because I've played and completed every other game in the series (except for 2, cause that was awful).   I did feel as though the weapons didn't have quite as many moves and abilities as DMC 3 or DmC, but I got used to it as the different weapons for Dante are varied enough to make things interesting.",
            "review_score": "1"
        },
        {
            "review_text": "I actually think Nero is cool",
            "review_score": "1"
        },
        {
            "review_text": "This game didn't age at all. I am playing it even after all these years. Music, plot, gameplay - everything is near perfect.",
            "review_score": "1"
        }
    ]
}