{
    "app_id": 45710,
    "name": "Dark Void™",
    "release_date": "2010-01-22",
    "developer": [
        "Airtight Games"
    ],
    "publisher": [
        "Capcom"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Adventure"
    ],
    "tags": [
        "Action",
        "Adventure",
        "Third-Person Shooter"
    ],
    "achievements": 0,
    "positive_ratings": 218,
    "negative_ratings": 230,
    "price": 6.49,
    "description": "Dark Void™ is a sci-fi action-adventure game that combines an adrenaline-fueled blend of aerial and ground-pounding combat.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/45710/header.jpg?t=1550019857",
    "minimum_requirements": "OS: Windows XP, Windows Vista or Windows 7 Processor: Intel 2.4Ghz or AMD 2.0Ghz Memory: 1 GB RAM Graphics: GeForce 7900 or Radeon HD 3850 series DirectX®: DirectX 9.0c / Shader 3.0 Hard Drive: 10 GB free Sound: DirectSound Compatible",
    "recommended_requirements": "Processor: Intel Quad Core 2.66Ghz or AMD Phenom X4 Memory: 2 GB RAM Graphics: 9800 series or ATI 4800 series",
    "reviews": [
        {
            "review_text": "I'm actually pretty upset about this game not being playable. I had a copy of it for PS3 a few years ago, and it was mildly entertaining to fly around. The story isn't great in the least bit, but it has fun aspects to it. Well due to 3rd party DRM, I can't even play the game I purchased for nostalgia. 0/10 do not buy unless you plan on throwing away money.",
            "review_score": "-1"
        },
        {
            "review_text": "If I pirate a game that i bought, illegal? Because that seems to be the only way to play said game.",
            "review_score": "-1"
        },
        {
            "review_text": "Very enjoyable game.  Great graphics + physics  Great story and voice actors  Can't get my head around that Metscore  Gem of a Game, one of my favorite games this year and it's 4 years old.  Can't beat a good ol jet pack....  Roll on DV2. I wish",
            "review_score": "1"
        },
        {
            "review_text": "Do not waste your money on this game, do not get sucked in by the two dollar deal. the fact that it is still up on the store while there are so many cases with the CD keys not being active is appalling. Steam needs to take this off of the store until Capcom gets their stuff in order and fixes the game. They should not be aloud to receive money for a broken product that they offer no service to fix. I want my money back!",
            "review_score": "-1"
        },
        {
            "review_text": "A game that is under-estimated! I maxed the graphics on my GIG heavy PC, played the game on my wall through projector; WELL, the results are good! They were wanting to make a film out of this with a few HARD HITTING names interested! Let's say so much, THEY liked it - so your curiosity MAY be stoked. It is SO good! I think I would'nt be dismayed with a sequel to this game! It's 3rd person, Nikolas Tesla is in the game (hello history). The story is deep enough for more-as I said earlier a sequel is welcome from my side! How does it play? Sometimes like a blend of SNIPER ELITE V2 or/and JUST CAUSE 2, only fantastical sci-fi (aliens in jungles with air-combat from ww1 and sometimes a little bit of the feel of TOMB-RAIDER [one of her weapons-the ak-47 like rifle] )!   Game on!",
            "review_score": "1"
        },
        {
            "review_text": "If you're looking for a shooter to play, I wouldn't recommend this game.  How ever, if you're a fan of somewhat campy scifi B movie plot lines, and or just enjoy jet packs I'd say give it a go if you can get it cheap (i got it at around 3 bucks).  I set the diffculty to low, and just jet pack punch people in the face to once shot them, and enjoy the somewhat cheesy story.   I'll give it a 6/10. Not a great game by anymeans, but if videogames had an equivalent to 'popcorn flicks', this would be in that caterogry. Enjoyable if you know what you're getting into.",
            "review_score": "1"
        },
        {
            "review_text": "Nathan Drake is William Grey with a jetpack since Nolan North voiced them both. Dark Void deserves a higher metascore.",
            "review_score": "1"
        },
        {
            "review_text": "What the heck Valve, just bought the game because I heard it was amazing from back on the console, and yet i can't even open the game because my product key doesn't even work properly.  Fail/10 Never buy this game.",
            "review_score": "-1"
        },
        {
            "review_text": "What are a surprise this turned out to be! One of those underrated hidden gems you come across once in a while. Well worth your time.",
            "review_score": "1"
        },
        {
            "review_text": "As for many others - read the posts in the discussions - the securom activation code given by steam doesn't work. Connecting securom server for manual activation via SSL failed multiple times. This is a situation which seems to be going on for quite some time without Steam or Capcom doing anything about it. What do you think of a company selling knowingly a broken product to their customers ?  After many failed attempts to activate the game I tried again today and look and behold the key worked . So I change my review from negative to positive accordingly. Looks like an amazing game from my first impressions.",
            "review_score": "1"
        },
        {
            "review_text": "continually crashes to desktop, controls are also buggy when it manages to run. Unable to change resolution without crashing. Pretty much unplayable and a total waste of money.",
            "review_score": "-1"
        },
        {
            "review_text": "NEUTRAL REVIEW  Interesting concept. Fun flight mechanics. Lackluster gunplay and story.  This is my recollection from playing the game on consoles ages ago, but it's pretty clear. It shines in all the areas where it tries to be different. Akin to something like Fracture, it doesn't shine when it needs to do simple mechanics.  Don't think 'it'll be fine, it's cheap'.  Don't waste your money on this SINGLE PLAYER game unless you know you're going to play it a lot. Don't buy it at all unless it is on sale for a couple bucks, because it just isn't much more than average.",
            "review_score": "1"
        },
        {
            "review_text": "CD key Does not work, Capcom wants me to jump through hoops to play something I paid for. Don't buy it just live the life of a pirate for a pirates life is free",
            "review_score": "-1"
        },
        {
            "review_text": "Horrible, horrible game. Stay away at all costs, dont even pirate it, its not worth the space it takes on your storage drive.",
            "review_score": "-1"
        },
        {
            "review_text": "Unfortunally I cannont recommend this game.  The game is not bad, it's actually not half bad, but I couldn't play through it all because it was simply to boring. It's a take cover and shoot game and this is the only fighting mechanic in the game and it is also the only thing that does not change throught the game. I can't explain it but it is simply boring. If you can get it tho for like 1$ go for it, it has something, but don't expect to play the whole thing.  Unforntually no, I do not recommend this game, 2/10.",
            "review_score": "-1"
        },
        {
            "review_text": "Very antiquated, very outadated, hard to get working.",
            "review_score": "-1"
        },
        {
            "review_text": "Horrendous. The 2D 'Dark Void Zero' is leaps and bounds better than this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Whenever i manage to fix one thing a new thing pops up ...",
            "review_score": "-1"
        },
        {
            "review_text": "If this game was a woman, it would be one that promised you the world, then let you down.  LIKE ALL WOMEN SOB SOB SOB",
            "review_score": "-1"
        },
        {
            "review_text": "I can't even start the game, my CD key is invalid",
            "review_score": "-1"
        },
        {
            "review_text": "It takes half of a clip to kill each enemy. Who thinks that is fun? Not worth $2.",
            "review_score": "1"
        },
        {
            "review_text": "First of all, let me make it clear. this is a good game. But I don't recommend this game as I feel that it's not value for money.  Pros: -Good game -I like the storyline -Good flight combat -Good graphics, considering that it's a 2010 game  Cons: -Game is too short (finished the game in 6 hours) -Games of much potential, though it seems that the developpers did not fully utilise the potential available -Limited variety of weapons available -Limited amount and variety of enemies  Verdict: The $9.99 price tag is probably not worth it. Get it during sales instead.",
            "review_score": "-1"
        },
        {
            "review_text": "Are you F^*%ing Kidding me? After trying to solve this invalid key issue, I jumped back on here to see if it was some type of compatibility problem just in time to read the list of 'Do not purchase this game through Steam!' reviews. Thanks for for just taking our money. That's awesome...Let me sell some broken Sh*t around my house to get my $1.99 back. What a rip-off.",
            "review_score": "-1"
        },
        {
            "review_text": "How can I write a review when I am not even able to play the game. It wont launch.",
            "review_score": "-1"
        },
        {
            "review_text": "I never got the chance to play it because the serial number isn't on SecuROM servers. After I emailed both Capcom and SecuROM, I waited a long time for them to respond. At least Capcom support told me they are forwarded my issue to those who can solve it (ancient greek gods, I suppose, because they never solved). After that, silence. Don't buy it. You will never make it work.  Update: Finally, after a month or so, Capcom bother to activate my code so I had a chance to play it. The game is not that bad as I saw in some reviews but have a lot of flaws that will drive you crazy. I gave it 5/10 or 6/10 but I still can't recommend it in 2015.  Too late, too many flaws.",
            "review_score": "-1"
        },
        {
            "review_text": "Where can I start with this game... This game's gameplay and short campaign would be great on a device like the Playstation Vita, but on stationary consoles and PCs, this game just doesn't cut it. The gameplay is poor with bad controls and dull weaponry. It has a very bland 'Main Character is voiced by Nolan North and he isn't playing Nathan Drake' basic feel to it. The main selling point, the 'Rocketeer' look and badass looking jetpack are ruined by just how bad the flying is handled and how easy it is to die by crashing withought a 'God Mode' cheat enabled. There is hardly any story to be had here, and to save you time and money, the girl dies at the end. Don't buy this bad game. 5.2/10.",
            "review_score": "-1"
        },
        {
            "review_text": "Do not buy this game. Like the others, my key doesn't work and the Steam suport answer is 'talk to capcom...'.  Look the the forum, the capcom's official announcement about this is 'we’re currently looking into the cause of this issue and how to best resolve it. As soon as we have more information on that front, we’ll update you all.'. that was in January... 4 months ago...  ",
            "review_score": "-1"
        },
        {
            "review_text": "This game does not work, if you check the forums in October last year people were having problems getting it running, 6 months later Steam has done nothing to fix it.",
            "review_score": "-1"
        },
        {
            "review_text": "ONE OF THE MOST UNDER RATED GAME EVER. This game is amazing once you get the controls down. I do recommend you get a controller to play this game. Its like a sci-fi Uncharted Drakes fortune. same character actor as Nathan Drake. You get to fly UFO and a jetpack.  Once you get your jetpack which in about the 3rd level you start to get these decent sized sandbox areas you can fly in. Use these areas to practice flying. Really get it down. You need a controller. THIS IS IMPORTANT Clicking in your joysticks alous you to quickly flip your flying in the other direction. Also learn how to break when you are flying and when to boost up.    Once you get the flying down you have these sandboxes with UFO bases around a open map. There are UFOs flying around drying to shoot you and other human survivors. You can fly up to these UFOs, Latch on to them mid flight. do a easy quicktime event. Dodge the turret on the UFO. Rip open the cockpit. Blow the pilots head off. Hop in his UFO and fly around. It is freaking awasome when you know how to do it and no other game does it like this. Also you fly up into floating enemy bases and blow them out of the sky.   There are some Bosses. Even Huge ones that you can climb on and take out similar tot he way you take out a UFO. Also The cover and fighing is just like uncharted. grenades and everything.  The game is Sci Fi and takes black in the burmuda triangle. I Think it has very good story. Illuminaty snake people ancient history. it is really cool.   If you like uncharted and you Love sci-fi you owe it to yourself to buy this game if it is on sale.  Just get the flight controls down. Get the Flying cover controls down you will have a blast like no other. I really wish they would make another one of these games. 10/10 It came out when the PS3 was first released so dont exspect it to look next gen but it looks good. just as good as the first uncharted game.      Edit: just read all the bad reviews. I bought the game years ago when the DRM worked fine and when i reinstal i never have any issues. Besides the really bad DRM this is a great game.  Edit. I guess the DRM issue is fixed. Good stuff!",
            "review_score": "1"
        },
        {
            "review_text": "Contrived activation process always terminates, this is junkware, do not buy it.",
            "review_score": "-1"
        }
    ]
}