{
    "app_id": 457480,
    "name": "Domino Sky",
    "release_date": "2016-04-05",
    "developer": [
        "Russpuppy"
    ],
    "publisher": [
        "Russpuppy"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Casual",
        "Indie",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Casual",
        "Indie",
        "Simulation"
    ],
    "achievements": 15,
    "positive_ratings": 204,
    "negative_ratings": 32,
    "price": 2.79,
    "description": "Domino Sky is a physics based game where you place and topple domino pieces to solve puzzles. Free build mode also available.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/457480/header.jpg?t=1459861575",
    "minimum_requirements": "OS: Windows 7+ Processor: Dual Core Processor Memory: 2 GB RAM DirectX: Version 9.0c Storage: 400 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Super fun! Well executed unique concept. And who doesn't like playing with dominoes?  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Wow. The only reason I found this game was through crafting a few Steam Badges and getting a Coupon for this game. Now, to be honest, the games they give coupons for are not so great. But, I do always look at the games I get coupons for. This game, casually look at the trailer, looks like a fun little indie game, decide to get it for $1.99. I download it, takes around 2 minutes, and launch it.In the launch, it asks me what graphics and resolution I want. That's a plus. I choose my settings, BOOM! Play the first few level, very simple, a good game to chill out to with some great music choices. Btw, I know I'm a terrible reviewer :P  PROS: ~Simple Concept ~Steam Achievments ~Steam Badges ~Very Nice Music ~Has Different Skins for your personal enjoyment ~Great Price ~For the price, a very good amount of levels ~Steam Achievment pictures are nice for showcases ~PHYSICS BRO!? ~Just Quality in all aspects  CONS: ~So far (a few hours into the game) I have not found any problems in the game.  Thanks for reading my review! Have a good day :)",
            "review_score": "1"
        },
        {
            "review_text": "+great smooth graphics +as enjoyable as playing with dominos in real life +not made by EA +does not require Uplay  over all 5/7 would use overused bad memes while playing with dominos again",
            "review_score": "1"
        },
        {
            "review_text": "This game is probably what you will expect it to be from the trailers.  Very fun relaxing game with 2 modes  #1.Campaign #2.Freemode  The campaign is made well and does get progressively harder as it should. No issues with the amount of levels presented as the game is such a low cost.  Freemode is great if you want to just build whatever you want and watch dominos fall. However I think that the developer should add more tools and things that you can place in this mode as it does feel quite restricted at the moment.  Also, I am having an issue where I am not getting any acheivements on my Steam profile even when I should. But this is only a minor issue for me I don't really care about it too much.  Love the addition of Steam trading cards for this game, all the more reason for people who want to rank up on Steam to buy it.  Overall, for the price of the game. You can't complain :D  7/10",
            "review_score": "1"
        }
    ]
}