{
    "app_id": 457550,
    "name": "Bigscreen Beta",
    "release_date": "2016-04-28",
    "developer": [
        "Bigscreen, Inc."
    ],
    "publisher": [
        "Bigscreen, Inc."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Online Multi-Player",
        "Cross-Platform Multiplayer"
    ],
    "genres": [
        "Simulation"
    ],
    "tags": [
        "VR",
        "Simulation",
        "Utilities"
    ],
    "achievements": 0,
    "positive_ratings": 975,
    "negative_ratings": 127,
    "price": 0.0,
    "description": "Bigscreen lets you use your PC desktop in VR. Watch movies with friends in a virtual movie theater. Play your favorite PC video games on a huge screen. Hangout in social VR chat rooms. Participate in weekly 3D Movie Nights, VR LAN parties, and other events.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/457550/header.jpg?t=1550099601",
    "minimum_requirements": "Requires a 64-bit processor and operating system OS: Windows 7 Processor: Intel i5-4590 Memory: 8 GB RAM Graphics: NVIDIA GTX 970 / AMD 290 equivalent or greater DirectX: Version 11 Storage: 1500 MB available space",
    "recommended_requirements": "Requires a 64-bit processor and operating system OS: Windows 10 Memory: 16 GB RAM Graphics: NVIDIA GTX 1060 or greater Storage: 1500 MB available space",
    "reviews": [
        {
            "review_text": "Highly recommendable!   It's a virtual LAN for you and your friends around the country/world whether they have an Oculus Rift or an HTC Vive!   Everyone get's their own customisable screen and there's a big screen up front if you want to share your screen with others in the room. Positional audio means it feels more natural when people speak - I look forward to the customisable avatars.  If you can set it to high quality then it does 1.5x rendering which looks better than Virtual Desktops standard rendering. My main display is 2560x1440 so everything I run is that resolution and with the 1.5x in BigScreen games and videos look really good.  I like the Virtual Appartment - in particular the balcony and living room but I'm not sure I'm a big fan of the space/planet environments.   So far it's been a smooth experience. I have loaded up a game (Fallout 4) on my screen while in multiplayer and it was flawless! Listening to people that joined my room was very clear and the positional audio helped know who was talking seeing as we all have one standard avatar at the moment.  I just wanted to say it's well worth getting - especially seeing as it's free :)  I have just noticed that the screen and room/environment settings aren't saved when you exit. It would be nice if they were as once you get your optimal/desired size/curve it would be nice to keep it  Also currently you can't share desktop audio... hopefully that will be implemented very soon.",
            "review_score": "1"
        },
        {
            "review_text": "Went into a room with a very chatty american, wrote in notepad that i was touching myself to his voice.   Watched his head lean in and read it.  He quit instantly",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would watch Game of Thrones naked in bed again.",
            "review_score": "1"
        },
        {
            "review_text": "First of all This is Great, i love it!!! single and lan alike, just sit and chat to someone on the other side of the world :-) Just need to add sound so other people can hear what im watching on the big screen if they wish.   2nd - this game tells you the specs and what is required, this is a rating of the game so if it says it wont work on windows 7 or cardboard then that has nothing to do with the game. why dont i just downvote apple or windows 10 because i cant run them on my android phone.   3rd - Developers your amazing keep up the good work.",
            "review_score": "1"
        },
        {
            "review_text": "Hi man! I just wanted to let you know that this is AMAZING! At first I was: ok this is funny. But at the moment that I entered the Multiplayer Loby I was like: OMG...this is revolutionary!! To be in the 'Same room' as others and be able to comunicate with them is just amazing!! Wow once again very nice work man!",
            "review_score": "1"
        },
        {
            "review_text": "I LOVE IT!!!! Send a beer to the developers!!!",
            "review_score": "1"
        },
        {
            "review_text": "My mom told me there is no free lunch....I tell her she is wrong...  This is so much better than Virtual Desktop...",
            "review_score": "1"
        },
        {
            "review_text": "  This app is FANTASTIC, better than the Oculs one IMHO, but there's a BUT: it uses A LOT of CPU. In my system - i5 4670k@4.2 GHz -, it uses about 50% of the CPU.  Should they solve this problem (I'm using the BETA verision) it'd be great.  EDIT: in ver. 0.2.0 Alpha CPU usage is reduced to about 25%",
            "review_score": "1"
        },
        {
            "review_text": "This is really good. Lots of interesting environments and everything works well to create a VR experience that allows you to enjoy all your 3D and 2D content. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Works great with HTC Vive. The social aspect is pretty crazy! Tip: If you play a game, make sure Vsync is on.",
            "review_score": "1"
        },
        {
            "review_text": "Using this with my ghetto vr headset; Nexus 6p, Shinecon VR heatset, and Riftcat. This program is amazing even with my super ghetto setup. Just using a desktop in VR and watching videos on a seemingly giant screen in the middle of space is such a cool experience. I couldnt imgaine how great this must be with an actual headset with a video quality that doesnt look like minecraft.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most useful environment utilities I've seen. I look forward to cleaner steaming and shared audio",
            "review_score": "1"
        },
        {
            "review_text": "It's pretty nice to be able to watch things on an Imax screen. Althought screendoor really starts to show itself when you make the screen too big. and no, no 3d pronz",
            "review_score": "1"
        },
        {
            "review_text": "Great for watching porn on an Imax sized screen.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing! Once I got it to work (just had to disable Avast ,looks like it will get sorted soon) I just loved it . Great environments and customizations. Had a chat and tested stuff online with some other people and it was truly cool stuff! Could definitly see myself having a VR lan party in this.",
            "review_score": "1"
        },
        {
            "review_text": "Please fix the whole 'a htc vive or oculus rift is required' loading screen. I have had headset and controllers all working and inside the chaperone area, controllers off, headset inside and outside the chaperone area etc... trying to get this to load. I can come right out from another vive game, sit in my chair and it tells me I dont have a vive. I got it to work 1 time but not since. What is the trick? I still recommend the program because of what I think the future holds, but for now, it isnt doing much for me.",
            "review_score": "1"
        },
        {
            "review_text": "Best free 3D porn viewer out there.",
            "review_score": "1"
        },
        {
            "review_text": "Really cool concept and well executed. Need decent internet if you want to stream your desktop to others in HD, which I do not have :(",
            "review_score": "1"
        },
        {
            "review_text": "Great game, Fun to play.  Lack of customization. Also it shows my 2nd monitor and not my primary and there is no way to change which can be a huge privacy issue to some. Waiting for sound capability in online, and the ability to switch screens. On top of that some brightness/contrast/gamma/color/etc settings would be great. But for free I would highly reccomend!",
            "review_score": "1"
        },
        {
            "review_text": "This has totally swung my use of my vive as a gaming platform to just a better space to compute inside. I'm VERY excited to see this move forward and become more feature rich because it's an amazing way to access your computer.",
            "review_score": "1"
        },
        {
            "review_text": "big screen is all you need, however the voice controls in virtual desktop are great as well, especially if you do a lot of movie watching, the ability to ask the time is usual in that regard!",
            "review_score": "1"
        },
        {
            "review_text": "Great for viewing content and hanging out, Free alternative to Virtual Desktop",
            "review_score": "1"
        },
        {
            "review_text": "This is with over 130 hours my most used VR application by far and I haven't even tried the multiplayer option yet. It's great as a monitor replacement and the beta features are helpful for playing the 3D movies that I can't play in Whirligig (only useful for regular SBS or OU - not 180° or 360°). In case devs are reading this I have one improvement request: Please add brightness settings. It would be helpful to reduce the overall brightness when reading or browsing the net since white backgrounds are just too bright after a while. If possible however implement a filter that dampens the brightness in a nonlinear fashion (darkening bright areas much more drastically then already dark areas).",
            "review_score": "1"
        },
        {
            "review_text": "This is the killer VR app you've been waiting for. Hang out, collaborate, or just watch movies with friends across the world.",
            "review_score": "1"
        },
        {
            "review_text": "I have not played multiplayer yet. Just the recently added support for 3D SBS and 3D OU is worth trying it out.",
            "review_score": "1"
        },
        {
            "review_text": "A brilliant tool that allows you to experience your desktop in VR to play any game on a big screen. The customizability allows you to change the distance and screen size along with the option to have a flat or curved screen.The only issue that I have with it is that I have to blindly reach for my mouse or keyboard when I let go.",
            "review_score": "1"
        },
        {
            "review_text": "Although the Vive does provide a desktop mode, this game does a much better job of it. Definitely worth the $0.00 (Not to mention the storage space).",
            "review_score": "1"
        },
        {
            "review_text": "Love it! Honestly better than virtual desktop and free!",
            "review_score": "1"
        },
        {
            "review_text": "  This is ♥♥♥♥ing mindblowing with friends, holy ♥♥♥♥. Everything about this app is absolutely amazing, my only complaint is I cant put on a movie and throw it on the TV to watch with friends (Audio doesn't play for everyone, but maybe thats my error)",
            "review_score": "1"
        },
        {
            "review_text": "Great! The virtual desktop works really well, and there is something amazing about just hanging out with people chatting while watching movies or playing games.",
            "review_score": "1"
        },
        {
            "review_text": "TL:DR - The coolest VR app I've ever experienced.   I spent 45 minutes hanging out with complete strangers in a virtual environment and felt completely comfortable, and walked away feeling like I had new friends. Such a cool way to share a VR experience with other people. Most impressed by the ability to sit in a big home theater and watch one person stream a video. Once they get the audio stream working, this is going to be such a huge time sink for me! I can't wait to hang out with friends across the world and play games, watch videos, collaborate on projects, have meetings, you name it! This is fantastic. If you have a VR headset, you owe it to yourself to get in this and try it.",
            "review_score": "1"
        },
        {
            "review_text": "Really great idea and even better execution. You can watch movies/TV shows with your headset, and you can hang out with people while you do it.  Just get it",
            "review_score": "1"
        },
        {
            "review_text": "No support for windows 7, Soooo, 48.7% of desktop users can't use this... Fortunately 1.78% (Windows 8) and 22.53% (Windows 10) can use it, so I guess that's something. (Stats as at 30 Oct 16)",
            "review_score": "-1"
        },
        {
            "review_text": "Nice idea, but the performance on Nvidia surround setup is abysmal (at 5760x1200). Would probably work if I disabled it, but I can't be bothered.",
            "review_score": "-1"
        },
        {
            "review_text": "A great concept in theory, but I don't have any friends who would use it.  I'm talking of Windows 10, of course. A shame this doesn't support any good OS.  ",
            "review_score": "-1"
        },
        {
            "review_text": "Hi how to take a screenshot while i'm in the app? It doesn't allow me to take screenshots using trigger and system.",
            "review_score": "1"
        },
        {
            "review_text": "There's a lot of software that does this out there, but this one is FREE (at least for now?) and does it very well.",
            "review_score": "1"
        },
        {
            "review_text": "This app is pretty damn cool, honestly. I have a really bad internet connection which kind of limits my experience, but I can imagine the amount of fun having this fired up with my friends and just have a laugh and chat while watching each other's screen.",
            "review_score": "1"
        }
    ]
}