{
    "app_id": 457520,
    "name": "Moustache Mountain",
    "release_date": "2016-03-31",
    "developer": [
        "Nauris Amatnieks"
    ],
    "publisher": [
        "Nauris Amatnieks"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Casual"
    ],
    "achievements": 15,
    "positive_ratings": 77,
    "negative_ratings": 36,
    "price": 1.59,
    "description": "A young moustache enthusiast goes on an adventure, to climb the highest flying mountain in search of a magical moustache gel!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/457520/header.jpg?t=1460213211",
    "minimum_requirements": "OS: Windows XP Memory: 512 MB RAM Graphics: 256mb DirectX: Version 9.0c Storage: 300 MB available space Additional Notes: Internet connection, for global leaderboards",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": " Super Moustache Man and the quest for the magical moustache gel   TL;DR:  Moustache Mountain  is a short but challenging platformer.  In  Moustache Mountain  you play as a jumpy, athletic guy who has a moustache (that sound oddly familiar?) and a simple quest: go onward and reach the top of the mountain. Graphics are indie-minimalistic but fine at that, and the funky 8-bit-like music fits the game like Super to Mario.  Gameplay is simple enough. Each level is just one screen and your job is to reach the right side of it. To do this you may run (with a constant pace as there is no boost), jump, climb and wall-jump all the while avoiding traps. Initially I thought there might be some secret areas or collectables in the hard-to-reach parts of the levels, but alas, it really boils down to reaching the other side of the level.  Controls are slick and work perfectly. You can play with either keyboard or controller (I used the latter). The only shaky thing is the wall-jumping that only seems to work when moving towards the wall at the same time as you jump, which is inconvenient when you have to try and jump to an overhanging ledge but matters little when you just want to climb. In comparison the movement mechanics are almost the same as in e.g.  Super Meat Boy  or  A Walk in the Dark .   Nooo, not the spikes!",
            "review_score": "1"
        },
        {
            "review_text": "I enjoy the programing gameplay on this platformer. Quiet short but but very fun to reach the end and even multiplayer witch makes it even better to challenge and practice with friends.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a 1000/1  Basically, you go up a mountain but YOU HAVE A MUSTACHE!                                THAtS it",
            "review_score": "1"
        },
        {
            "review_text": "Moustache Mountain is a small platformer featuring a total of 15 single-screen levels (with a couple of variations each), a few different simple mechanics to avoid and... well, not much more. The level design is bland and almost every sprite seems to have been copied and pasted between the stages. There's a single audio loop soundscoring the entire game. Expect about 30 minutes of game play to beat the game and about two hours if you want to clear all the achievements. Even at the low price point of a couple of Euros I think it's a mediocre value proposition at best. I can appreciate the art style but that's about all the game has going for it.  If the developer adds a bit of additional content I might revisit my rating but for now there is no way that I could recommend this game.",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ this game.Its boring and has the worst soundtrack i have ever heard in my life.",
            "review_score": "-1"
        }
    ]
}