{
    "app_id": 457820,
    "name": "Outrage",
    "release_date": "2016-04-06",
    "developer": [
        "Astronomic Games"
    ],
    "publisher": [
        "New Reality Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Indie",
        "RPG",
        "Adventure"
    ],
    "achievements": 41,
    "positive_ratings": 78,
    "negative_ratings": 44,
    "price": 2.79,
    "description": "Outrage is a short cyberpunk dungeon crawler. You manage a team of vigilantes and must undertake various missions in the city to strengthen your team and your cause in order to bring a powerful enemy to justice.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/457820/header.jpg?t=1505857242",
    "minimum_requirements": "OS: Windows XP or above Processor: Intel Pentium 4 2.Ghz or above Graphics: Minimum 640x480 Desktop Resolution Storage: 500 MB available space Sound Card: Stereo Sound",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Surprisingly fun RPGMaker game! Not much text to read or get eye strain. Just simple elements, north/east/west/south movement choices on small maps, and simple battles. I liked the special actions for each character and ammunition cost that added some depth to battles, but wasn't overly complex. I liked the mission choice &amp; rewards too, and the optional aspect to add more team members. You can only have up to 4 active in battles, but you can have more on the bench. It isn't too hard or frustrating, can save &amp; load easily, and played easily on an xbox360 gamepad. The game does have resolution choices if you go to the 'system' menu item (press B to bring up menu). However it wasn't pretty stretched to full screen on my 47' TV. But I was happy playing in the default resolution in a window, which didn't strain my eyes for once. Where Space Pilgrim gave me a headache, this was a pleasure. This is the first RPGMaker game I actually liked.",
            "review_score": "1"
        },
        {
            "review_text": "It was an outrage that I bought this.   Game crashes constantly!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_score": "-1"
        }
    ]
}