{
    "app_id": 457960,
    "name": "Holopoint",
    "release_date": "2016-04-04",
    "developer": [
        "Alzan Studios, LLC"
    ],
    "publisher": [
        "Alzan Studios, LLC"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie",
        "Simulation",
        "Sports"
    ],
    "tags": [
        "Sports",
        "Action",
        "Indie"
    ],
    "achievements": 14,
    "positive_ratings": 607,
    "negative_ratings": 60,
    "price": 10.99,
    "description": "Holopoint is pure archery madness. Fight your way through waves of responsive targets, samurai, and highly dangerous ninjas - all while drawing, nocking, and shooting your arrows as quickly as possible.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/457960/header.jpg?t=1550762621",
    "minimum_requirements": "OS: Windows 10 Memory: 8 GB RAM Graphics: GTX 970",
    "recommended_requirements": "OS: Windows 10 Memory: 16 GB RAM Graphics: GTX 980",
    "reviews": [
        {
            "review_text": "One of the first VR games I played on the Vive and oh my what a game. I shot a box, the box shot me back. A few shouts of 'I'm mufukin Legolas' later and I'm breathing hard, sweating and thoroughly entertained. Scores of enemies lay shattered at my feet. Arrows embedded in the walls, the ceiling and floor.   My wife thought I looked dumb shooting invisible arrows straight up at the ceiling while kneeling and swearing. I didn't. I felt like I looked awesome. You will be ducking, kneeling, spinning, nocking, shooting, nocking, shooting until you fall over.   Oh ya I did get the headset chord caught around my foot so watch out for that. Also there was bullet time when bullets and things get a little too close to your face (which is awesome)   This game, it's awesome.",
            "review_score": "1"
        },
        {
            "review_text": "(HTC Vive) I've played a lot of VR games so far, and this is my favorite. Awesome gameplay, awesome price tag and awesome cardio because you jump around like an idiot (atleast me ^^). Bow and arrow feel pretty natural and after a little confusion in the first 5 minutes ingame everything works out perfectly. Something I liked to have known before playing:   • If you shoot the boxes straight in their center they don't shoot back.  • You can shoot the projectiles that are flying towards you.  • On the right side you can see your lives (scoreboard) as candles.  • Check out the BETA: Steam-&gt;Holopoint-&gt;Settings-&gt;Beta In case if you are wondering how I made the bulletpoints: ALT -&gt; NUM7   Hardware:  • Asus STRIX R9 390 8GB  • AMD 8350   • 16GB RAM Corsair  • MSI 970 Gaming Motherboard  • No OC   Game runs smooth over 90fps (Windows 10).",
            "review_score": "1"
        },
        {
            "review_text": "Bought it, played until I missed the chaperone and dove into a wall.   The game is simple but incredibly engaging. Definitely worth the money",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome! And definitely a workout. The only thing I needed to get use to is the way putting arrows on the bow. It is a vertical gesture of the remote, rather than the horizontal gesture from the 'Long Bow' mini game inside The Lab. I do find the horizontal gesture more satisfying, it feels like you are using two figures to cook the arrow lol.",
            "review_score": "1"
        },
        {
            "review_text": "I'm a long time Oculus user but this game is what convinced me room scale is it. Vive has done well!   Holopoint is an exhilarating game which will have you working up a sweat in no time. Your muscles will be sore!   My only complaint is that it’s easy to get so into the game, you may jerk your cords out of the PC.   Bonus - the price is right!",
            "review_score": "1"
        },
        {
            "review_text": "This game makes me feel fat and unhealthy. But boy do I ever feel like a badass when I shoot the bullets the cube shoot at me.    This is one of the few VR games that I suggest to buy right from the get go. It's intense, makes you sweat a lot, makes you feel like Robin Hood. But, if you're unhealthy like me, you'll realize how unhealthy you are. And it might make you a little disappointed in yourself.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome awesome awesome. This game really gets you moving, and gets pretty challenging in the higher waves. I've enjoyed more than a few jump scares when turning around and seeing a holo about to hit me, so keep that in mind. This game will teach you to manage your room space and cord very well.  The arrows feel great, and as I read somewhere else, you can't help but feel like legolas/hunger games/ etc. It's very fun!",
            "review_score": "1"
        },
        {
            "review_text": "This game starts off a little slow and zo kind of wonderrf if it was a waste of money. Then once I started getting the hang of the mechanics and got past wave 10 I really started to enjoy just playing it. The shooting, ducking and watchinge for attacks from 360 degrees makes this game both fun and exercise. It has become the primary place for my exercise routine.",
            "review_score": "1"
        },
        {
            "review_text": "Tl;Dr: Probably fun for someone who haven't shot a real bow, but for some who has it's way off  I wish I would love this, but I don't. It feels so unatural. I used to shoot at homemade humanlike targets set up in the fields behind my house almost everyday as a teenager. I got custom to shooting the bow and how to do it efficntly. And this games translates it so bad to VR.   I kept hitting my Vive a lot in the begining since on a real bow you usually pull the arrow fairly close to your face. This became frustarting fairly quick. when I stopped pulling it towards my face it felt unutural how far to the side I had to pull it. Also my hands felt positioned incorrect no matter how I moved them.  I'd like to see an otpion to calibrate, bow postion, string postion, draw hand position according to where the controlers are. The same for the quiver. Since I personally find belt quiver superior to back quiver, and I am not the only one when it comes to that.  BUT, the rest of the game seems well fleshed out for an early VR archercy game.  This game is probably really fun for people who haven't shot a real bow before or are good at adapting to 'an odd way of shooting a bow'",
            "review_score": "-1"
        },
        {
            "review_text": "I love this game. I loved Longbow but it was just a taste. This scratches the VR Archery itch much better. I don't ever write Steam reviews, but this one compelled me to do so. The first time I hit level 10 and the guys started charging at me I was so surprised I was yelling and freaking out. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Okay so I decided to buy this again after refunding it since hearing the bow and arrow were like the lab now. After finding the settings (not obvious) I was able to try it out and it's closer, but not there yet.  There are too many small things that stick out as just a little lazy to me and I have trouble looking past these things to just enjoy the game. I do not recommend this currently if little things bother you.   I will update my review once I see some of these small things fixed. Like smooth arrow loading like in the lab (it's still not there yet, something feels off.. but I give them credit for trying.) You can't load the arrow into the string without pulling the trigger is what I mean by this. I also did not enjoy having to constantly reach by my ear to grab an arrow and the haptic feedback also did not trick my brain like it did in the lab.  The cord gets twisted really fast inis game, so then you have to unwind the Vive after one session.",
            "review_score": "-1"
        },
        {
            "review_text": "A great title at a great price point. A simple idea well executed , lots of matrix style dodging and really good tracking / mechanics on bow and arrow options and scales well with my constantly changing room scale.  updated - keep coming back to this game - wow what a workout! I now think this is a showcase Vive title , two weeks later and I just had the best VR experience I think I've had to date. Coming home from work and having an archery workout in the dojo!",
            "review_score": "1"
        },
        {
            "review_text": "My favorite Vive game. You get good exercise and can see yourself getting better at it.",
            "review_score": "1"
        },
        {
            "review_text": "Controls feel really bad. the bow is always locked for its direction to the hand the main controller is held in. it doesn't rotate in relation to the other hand like it should, so aiming feels wrong. This ruins the game.",
            "review_score": "-1"
        },
        {
            "review_text": "I just wanted more of the awesome archery minigame from 'The Lab', but this game is not that. This game is a small, boring minigame where you dodge an endless number of strange energy balls, and the behavior/feel of the bow is completely different from The Lab.  Also, I apparently can't get a refund for it, so now I'm stuck with it. Blech",
            "review_score": "-1"
        },
        {
            "review_text": "My legs hurt from all the dodging. This game will work you until you want to lay on the floor, and it's fun doing so.  That being said, I wish the draw distance for the bow was longer, as I have long arms. The draw on the bows in QuiVR is much more satisfying, but it doesn't require even half of the movement. This really is a room scale archery game; just be careful not to wrap yourself up in the cords. ",
            "review_score": "1"
        },
        {
            "review_text": "must have vr game for anyone who enjoyed 'Longbow' in the lab.  Great tracking precision and extraordinarily smooth on GTX 970 &amp; i5-4690",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing. No other VR game is this intense.",
            "review_score": "1"
        },
        {
            "review_text": "After awhile in 'The Lab - Longbow' I end up seeking for something more with archery. I can say Holopoint is a perfect archery VR game to start off with. Especially with that price, you couldn't ask for more!  When I first started out, I had expected the standing targets would simply vanish. They don't. Each standing target will fire back at you once killed. When I progressed further I experienced new targets. Moving toward me to slice my head. Encountered a rare few targets that threw shirukens at me in incredible speed.  The boss battle is exciting to keep you moving and dodging around her shots and have to aim carefully to her weakpoint.  Pro: -Beginning waves give you good understanding of game mechanics. -Sharpens reflexes, reaction speed, awareness (highly recommend headphones) -Mid to High waves will keep you under pressure of overwhelming targets -Rewards your slight of hand and streak kills (without missing) with fire arrows -Option to start differnet waves by 5. (Max option is the 25th Wave) -Lot of replayabilty  -Global Leaderboard to push yourself further  Cons: Warning for players that love to move around: -I have smacked my controllers together a few times. Under pressure of massive targets. -Hit my VR twice to pull my arrows quickly from my quiver. -After awhile, realize targets have specific spawns in each wave -Some panic / spook moments of target right next to you when you turn. -Can't really hear each footsteps distance, only the floors creak and armor rattling. -Don't play too long or else feel the sweat on your VR sweatpads for an hour to dry up.",
            "review_score": "1"
        },
        {
            "review_text": "This game is the best alternative to squats.  10/10 Would accidentally exercise again.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely worth every dollar. I'd have paid more in fact. Who knew my favourite VR game would be an arcade style, repetition based game. Super responsive, if you've played the bow and arrow mini game in The Lab, expect much much better controls. Feels all too real. Fantastic, buy it now if you're after a game where you fight for a higher score every round and don't mind a good workout!  PS - Letting an unfit mate play this isn't a great idea without a sweatproof face cushion. I have learned this the hard way.",
            "review_score": "1"
        },
        {
            "review_text": "The game is fu.... amazing. I never did that much sports before. But the only problem is every time I enter Level 14 I get three hits out of nowhere and lose the game before even enemies can spawn. That happens everytime even when I start from level 1. Anyone got an idea what that could be?  But without this it's a perfekt game if you like arrow shooting and I can recomend it.",
            "review_score": "1"
        },
        {
            "review_text": "Tons of fun and a damn good workout!",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing. Must buy!!!!!!!!!!!!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "While looking for new things to try on the Vive, I've heard *so* many comments of the form 'This game doesn't look like much, but give it a try.' So, so much this.  I loved trying out theBlu and getting a first sense for the whole VR thing. And then trying out The Lab and seeing how interacting with VR worlds could seem natural and just... real. But they both felt like the type of thing that would be more useful for 'Hey, you have to check *this* out' when friends come over, rather than any sort of lasting experience.  And then there's this little $8 game. Even though it requires a high-end PC and an $800 headset thingie, it somehow reminds me of some of the very first video games, in a very very good way. It's just pure gameplay. There's no gimmicks, no plot, no nothing, just you and a high score list, but the gameplay is so damn *fun* that that's all you care about.  As (many) other reviews on the interwebs say, yes, it does in fact make you feel like a badass. When you duck underneath a cyber-samurai's sword swing while drawing back your bow to take out another one off to the side, yeah, you feel ridiculously cool. And that's because Holopoint just strips away everything and somehow makes you feel you're *there*. It is so viscerally satisfying.  A couple of things that could impact your Vive's livelihood. First, after playing this for 15-20 minutes, I started to sweat a bit. Which hasn't come close to happening with any other VR thing I've played. Maybe a little bit with the (similarly simple but beautiful) Space Pirate Trainer, but not to this degree. So you might get some damp (and eventually stinky) Vive foam.  Second, as a few other reviews point out, you move around a *lot* in this game. I've yanked the Vive's cable from its little dock with my feet three times now. And I've pulled out my earplugs an equal number of times. It's frantic, and you pivot around constantly. Plus, ducking and weaving and dodging out of the way. I did find that after playing for an hour or so, my brain started to somehow process where I was in the real world while paying attention in the virtual world, and things got a little better. I found myself raising my feet, anticipating where the cord would be. Or turning counter-clockwise after turning clockwise a few times to untangle the cord. And I also found myself relaxing a bit and being less spazzy overall after playing for a while, which also helps.  I kind of expected that VR games would give me the whoas, and be really cool things to show off to friends. I had no idea that some $8 launch title would also fall into that rare category of game where if I have 10 free minutes I'll go fire it up, thinking 'OK, time for just one round...' This game does that.  ",
            "review_score": "1"
        },
        {
            "review_text": "You duck, you dodge, you draw, you lean to the side to avoid a bullet, you shoot. It's becoming frantic, they're getting close. You're going so fast your arrows have literally lit on fire. You're hot and sweating, you're almost to the end of the wave. And then, as you pivot to take out a humming square that's about to shoot, your Vive's power connector yanks out of the box because you've been spinning around so much that the tether is all twisted. You lost.  That was my biggest enemy in this game, stepping on the cord, getting the cord tangled, unplugging the cord because all the slack was taken up by twists. Even my earbuds managed to get caught and pull out of my ears once. The game is fantastic, it's one of my favorite experiences so far. But it really shows off the limitations of the Vive's cabling. Maybe it's just me, maybe other people have a pulley or something to keep things organized.  But in the first twenty minutes of any session, when there's slack in the cord and you're not sweaty, it's a ludicrously fun game. A few other games have 'dodge' mechanics like this, but those other games make your hitbox so large that you can't dodge all that well (they have block mechanics too, usually). This one has no block, you can only dodge; and the dodging is very precise - you only need to move your head half a foot to the left and a bullet will miss you. It feels right, it's satisfying, and it's worth the experience.",
            "review_score": "1"
        },
        {
            "review_text": "Intense and fast paced archery game",
            "review_score": "1"
        },
        {
            "review_text": "A bit difficult for newbies to pick up, so not one you can really pull out to show friends the HTC Vive.  However, I really like it, and once you get the hang of the controls and get comfortable with the gameplay, it's very fun and has a good amount of replayability. Makes you feel like a total badass once you start getting good at it.",
            "review_score": "1"
        },
        {
            "review_text": "An incredible game, and a great workout. The controls feel natural and within minutes I felt in the zone, whirling around and firing off arrows while executing dodges.  Cheaper than a gym membership and a lot more fun!",
            "review_score": "1"
        },
        {
            "review_text": "It starts slow, but builds up well. Keep going to lvl 10-15 before you give up... ;)",
            "review_score": "1"
        },
        {
            "review_text": "Can't stop going back to this game! The dodging, weaving, and ducking to avoid the targets death throes is just amazing! You're constantly moving, constantly firing! A very well done VR experience!",
            "review_score": "1"
        },
        {
            "review_text": "FUn, dodging feels like a good workout(at least more than what I'm used to). I don't know of it's just me but the bow seems...high I guess. Awkward to get used to, like the feel of how the labs bow mechanics work more, but this feels like a better workout.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazingly fun! I can't explain the feeling of jumping all around your room, dodging and shooting. My only complaint is the bow machanics. You should be able to aim with the bow hand and arrow hand combined. I hope that gets improved. Even as of now, this game is a must play for the Vive.",
            "review_score": "1"
        },
        {
            "review_text": "Fun Game! Although it is an archery game, some throwing knives would be nice!",
            "review_score": "1"
        },
        {
            "review_text": "I do not think I have sweat so much while in the Vive! Holopoint is definitely not for those looking for a relaxing virtual reality experience. What it does offer, is a fast paced archery arcade game that tests your reflexes and endurance. While it left me with several rug burns from avoiding all the projectiles, I would have to give the game a thumbs up. I would definitely put it at a lower price for the amount of content in the game though. If it comes on sale, I would definitely buy it.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome fun but it is the devil when exposing the limitations of a wired headset. My wife an I probably pull the cords out 2 or 3 times a night playing this game due to the constant fast movement required. Good thing I guess, that the HTC Vive was designed to pull out without damage, but even still it is a real annoyance (not to blame the developers of the game, more the design of current VR headsets).  Good exercise anyway. Woke up with a sore right shoulder and neck though!",
            "review_score": "1"
        },
        {
            "review_text": "Just spent 30 mins playing it. One of the best VR games I've played.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game! I feel like a ninja! Absolutely worth the price!   As the levels progress, you really get moving - this is proving to be a great cardio experience.  I can't wait to see what the dev does with this. Huge potential. Just played the latest dev version and the two handed bow control is a great addition (makes the bow/arrow behave like the archery game in The Lab).  Get this game now! ",
            "review_score": "1"
        },
        {
            "review_text": "Simple. VR and so much fun.",
            "review_score": "1"
        },
        {
            "review_text": "Of all the Virtual Reality games I have in my library, this is hands down the favorite of most of the people I know, myself included. The controls are very intuitive... boiling down to simply knocking the arrow with the trigger, drawing, and releasing the arrow by releasing the trigger. Move in room-scale to dip, duck, and lean to avoid enemy fire. The intensity of this game is currently unmatched! You will break a sweat. You will love every second of it. Holopoint is played at the start and end of every VR session. Often times my friends will stop playing a game, after having exhausted it, and come back to holopoint again and again.  Gameplay Breakdown: You are in a dojo and your room-scale play area is a mat. You can not leave the matt. Enemies will spawn in 360 degrees around you. You must shoot them with your bow while dodging their counter-fire by dipping, ducking, and moving about your play area. Very simple control scheme and solid bowplay.  Pros: +Most solid archery I have played yet. +Hitboxes are perfect. +Nonstop balls to the wall action with a very pleasing difficulty curve. +It's so intuitive you're garunteed to understand it immediately. +Immense replayability.  Cons: -I can't really think of anything? Is being too intense a con? It's not a relaxing game. If you have a sports injury or are otherwise disabled this title is probably not for you. -I get tired and can't play this game all day.",
            "review_score": "1"
        },
        {
            "review_text": "Really addictive, and you get great exercize while playing.",
            "review_score": "1"
        },
        {
            "review_text": "Make sure to check out the settings menu first, because you can adjust how aiming and arrow gripping work. Once you have it right this game will make you feel like Hawkeye and Neo had a baby and that baby is you.",
            "review_score": "1"
        },
        {
            "review_text": "Incredible game with ton of replay value! In comparison to Space Pirate Trainer this game is much more hectic and requires 360° of movement. This game can also be a real workout while evading incoming projectiles. Only downside is that sometimes if you turn too much the cable gets tangled and can lead to pulling out the cords from the link box, however, the HMD will be fine.",
            "review_score": "1"
        },
        {
            "review_text": "A lot of fun and a great value.  Make sure you have enough room to move around.  Only minor thing I would change is the way the arrow comes out of your quiver - would prefer it be like the arrows in The Lab - Longbow demo.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely fantastic until you trip over the cable",
            "review_score": "1"
        },
        {
            "review_text": "My headset's facepads are a soaked sponge.  10/10 would sweat again.",
            "review_score": "1"
        },
        {
            "review_text": "I never do reviews but for this game Im going to. I love this game, I played 30 mins and was sweating. ( I only weigh 120 and dont sweat easily) I was dodging stuff so hard I was on my back at one point and another point i spun my head so fast my heaset turned sideways (needless to say its tighter now) I also switched to using earbuds before playing this because my heaset didnt stay on well enough for space pirate trainer. Also my left shoulder is killing me.... I'll be back tomorrow for more.",
            "review_score": "1"
        },
        {
            "review_text": "This archery game is challenging and actually builds up a sweat. It's also fine to play in small / standing room situations, lots of spinning, ducking and shooting.",
            "review_score": "1"
        },
        {
            "review_text": "While Holopoints look alot of rudamentary compared to similar titles, such as Space pirate simulator; SPT is a light warmup compared to what you will encounter in Holopoint.  You starting with shooting at cubes... Sounds boring right? Not as simple as it sounds. The moment you hit one, it retaliates and shoots back as they shatter. And if you leave them around for too long... they also shoot. This goes on with every increasing amounts and eventually you simply cannot hit them all before one shoots without you hitting it first... and thats when things change radically and new types of enemies start relentlessly be thrown, a suprise after another. And no, there are no shields, so no turtleing, and you have to dodge all the projectiles.   Thats when things get really interesting and accuracy becomes very important.   And its not just Point and shoot, you have to use both your hands to align your shots at your target, and coordinate with the other to reach the quever. You will feel even more bad *** when you manage to hit multiple targets in a row.  I highly recommend this to anyone that the space to go side to side in, and has the physical fitness to play it: but do pull off some practise on turning with the head set on. There is a danger of getting tangled with the headset if one keeps turning a single direction. The game is really intense, and at its price, fully worth it.  My current feedback: - It could use more variation in the music played back,  - Arrows do not seem to be able to be used as a thrusting meelee weapon. - Could use a vibration queue indicating that an arrow has been grabbed from the quever - What is the indication of what health is remaining for player?",
            "review_score": "1"
        },
        {
            "review_text": "Great game",
            "review_score": "1"
        },
        {
            "review_text": "Insanly intense and fun, and sport. Yes it's sport!",
            "review_score": "1"
        },
        {
            "review_text": "Has some motion sickness, but this game is the most extreme workout on VR so far I've been sweating starting from Wave 3. Guess I need some diet",
            "review_score": "1"
        },
        {
            "review_text": "What a workout! This is proper fun fitness.",
            "review_score": "1"
        }
    ]
}