{
    "app_id": 458000,
    "name": "March of the Living",
    "release_date": "2016-04-20",
    "developer": [
        "Machine 22"
    ],
    "publisher": [
        "Creaky Corpse Ltd"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Adventure",
        "Strategy",
        "Indie"
    ],
    "achievements": 14,
    "positive_ratings": 365,
    "negative_ratings": 119,
    "price": 11.39,
    "description": "Roguelike-like inspired by FTL and popular zombie fiction. Guide a group of survivors to a rumoured safe haven.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/458000/header.jpg?t=1478024238",
    "minimum_requirements": "OS: Windows XP+ Processor: Intel Pentium Dual Core T4400 2.2 GHz Memory: 2 GB RAM Storage: 600 MB available space Additional Notes: Minimum resolution: 1280x720",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I am torn on this game.   On the one side I love zombie survival games with scavenging and trying to keep alive in a setting where all the odds are stacked against you. The world is nicely presented through the writing, allthough, in not too long you will start to see events play out that you've experienced before and it starts to feel a bit dry. I also love that there's contextual use for certain items and skillsets for the other survivors should you happen to have the appropriate ones with you.  On the other hand, it's easy to grow tired of the unceasing slaps that the game doles out to you when the dice do not fall in your favour, and yes there seems to be quite a bit of dice rolling behind the scenes in this game. At one point I had two survivors who were both starting to feel the wear of travelling and needed to rest. When you're in a city you can search for a safe space to rest in, which sounded like a good idea at first. The catch is that when you search for a place like this you run the risk of running into zombies, but I thought little of it as I had only met zombies rarely while doing this.  First attempt I ran into seven zombies. With two survivors and little ammo left I decided that it wasn't really worth the trouble and fled. The game decided that doing this was to be punished by losing my other survivor. Even though the zombies only appeared from one side of the screen. You can never flee an encounter without risking loosing one of your partymembers or loose gear. Aside from the events where the game asks you if you want to approach something, it is never an option to refrain from combat with the undead without some kind of repercussion, which I find forced and ridiculous.  Searching for a second time led my main guy into a gaggle of five more zombies, which at that point I HAD to flee, which lost me my best weapon. Searching for a place to rest a third time ALSO led me into a group of undead, but at this point my main guy was so tired of trying to find a place to rest he simply died of fatigue on the spot.  Aside from that I've had survivors instantaneously die from hunger right after travelling because the health meter takes a hit immediately if you allow the hunger meter to fill up, instead of gradually taking damage after it's filled, which would avoid those annoying events alltogether.  Or the events where you roll the dice and either things go well or you get to nominate one of your party to either take a slight hit or get fatally wounded. An example of this is an event where you come across a point where a road has been blocked by a fallen tree and loads of cars. You get three choices in this event; Navigate between the cars, climb over the fallen tree or skip the whole issue alltogether and go through the woods.  Having played a good few zombie games and seen a rather large number of zombie movies I figured moving in between the cars would be bad as there would most likely be undead still strapped in the car, and climbing over the tree sounded like an event where one of the survivors would fall off. So I headed into the forest to go around. No dice, it was full of undead. So I decided the tree was the least dangerous of the two remaining options. The survivors I sent up and over promptly fell off the tree and hurt himself. In a second game I came across the same situation and decided to go for the cars. And Lo and Behold, there was a zombie hidden among the cars who grabbed my survivor and bit him in the foot, incidentially the same guy who fell off the tree in the previous example, so maybe he was just a plain unlucky guy.  I wouldn't mind these outcomes so much if there was a hint towards how successful either of these actions would be in the text, but no such luck. The game throws the dice behind the scenes and either saves you or dooms you in the process.   Luckily, the survivors, aside from the few paragraphs you get about them when you initally meet them, turned out to be pretty faceless up and until where I've played so far. This meant that everyone in the party aside from the main character, served as risk sponges, item mules and a means for safety in numbers. I'd have loved for there to be little snippets about the characters in your party and how you get along with them, the partymembers weighing in when something happens, ANYTHING just to have some kind of impact when the random dice decide that someone needs to die.   In short, if you like the idea of a decently written, bit style zombie survival game where you travel from point to point like in FTL, with arguably somewhat shallow mechanics and random numbers deciding 'yes' or 'no' outcomes, you will probably like this game.   I on the other hand found the game not quite my cup of tea for the reasons described above.",
            "review_score": "-1"
        },
        {
            "review_text": "A serviceable game that is as described, a mix of FTL and The Walking Dead. But it is a mixture of the basics of both, could have been more, and may be too short for its price.  The game follows FTL in the sense that every destination node you reach would have a random event, and like FTL, it is randomized and can be good or bad. As you journey through the nodes you have to make decisions to keep yourself alive and reach your final destination.  And obviously the game follows The Walking Dead because it has zombies, guns and scavenging. Scavenging takes place in a town node where you can scavenge 5 buildings, police station, hospital, drug store, grocery and apartments.   Along the way you may be able to recruit new people. You have to manage your team's hunger and fatigue. The more people you have, the more food they have to eat, but there is strength in numbers.  Combat is simple but considering there are only so many ways to kill zombies, it does its job and there is no need to make it as complex as FTL. There are 4 main weapon types, melee, pistols, shotguns and rifles. Each gun have different firing modes such as a slower but more accurate shot which instantly kills enemies.  Unfortunately, the game also has the shortcomings of The Walking Dead. The game is short and one character takes about 2 hours to complete. All 4 characters would take about 10 hours. And like the Walking Dead, the game focuses more on story, and so doesn't have as much replayability as FTL. But unlike the Walking Dead, the story in this game is merely ok and cannot rival the well-written Walking Dead.  The game is serviceable but may not be worth the full price due to how short it can be. Currently it feels like an idea with the basics down, but hasn't been fleshed out yet. But at a higher discount, it may be worth your money.",
            "review_score": "1"
        },
        {
            "review_text": "Okay in all honesty, this game got me addicted fast. I am almost finished with the game in a short period of time. I have played this game for 4 hours straight yesterday and havnt had any regrets. It was a bit confusing at first, died many times but once you get the hang of it its pretty easy imo. I wasnt going to review the game until I finished it but honestly I am enjoying every second of it. I have to be honest, I did buy it so I can recieve free stuff from another game, but it was so worth it. The graphics can get annoying at times but overall not that bad. Download and install was very quick and easy. Gameplay smooth and obviously not graphics heavy, but it doesnt matter because I knew what this game was going to be like before buying it. Overall I would give this game a 9/10, I think its a bit too pricey for a FTL like game. Other than that it would be 10/10 if it was cheaper. I am kind of curious/excited if the makers are going to implement more guns and a co-op option, because it would be so much more fun with friends playing. But all in all great game and love the story line.",
            "review_score": "1"
        },
        {
            "review_text": "Game could use a little more polish. It is fine and plays as you expect. I didn't encounter any bugs or anything. But it just isn't enoguh to keep me interested and the crude UI/graphics/maps make it not super plesant to play.  if you are really into this sort of game I would definitely try it, but it is not a must have game.",
            "review_score": "-1"
        },
        {
            "review_text": "Game is pretty fun, however these are some bugs that I have found which make the game a little less fun.  - The playable character Ana has the 'Nurse' trait, so she adds +1 to all medical items, except the First Aid Kit for some reason. - Sometimes I get hit with some bad RNG (like, facing 6 zeds in the first block and I'd rather not spend that much ammo that early on) so I restart a new campaign, but the game will bug and doesn't let me click on the map or escape out of the game, forcing me to alt+f4. - When trading with the farmer for food, he'll ask for ammo, but if you didn't get a good look at your ammo count before traveling to the selected node, you won't know how much ammo you have. And if you decide to not trade with him because you wanted to see how much ammo you had, then you won't be able to trade/barter with him at all because the option isn't there. I mean, when you are trading with anyone else, the barter option always shows up, except for the farmer.   This last one isn't a bug, but the scavenging percentages in towns seem very skewed. There was an instance where I had only 11% chance to proc a zed attack, so I thought I'd be safe. Nope, got hit with zeds. The next scavenge trip was 10% to proc a zed attack -- got hit there to. Then my last attempt before I said 'F--k this,' it was also an 11% to proc a zed attack, and what do you know, I proc'd it. Not sure if the numbers are lying and are actually higher than what they seem to be, but it seems unreasonable to get hit 3 times at only 11%.   And now I have a few questions for the game: Sometimes certain decisions result in a Smiley-Face or a Frown-Face. Is that supposed to keep track of you notoriety? I understand that    once you reach Willington (I think that's what it's called), that people will judge you on your decisions, but how do they know? Were they there to see you make a bad decision? I don't understand what the point of it is, really, because at the same time, if you don't play selfishly, then the NPC's will try to kill you, f--k you over, steal from you, etc. So why implement a thing where it's nearly impossible to survive without being judged with a morale system?      ",
            "review_score": "1"
        },
        {
            "review_text": "Decent game. Retro graphics which is pretty neat. Combat needs some tweaking. It's not as easy to survive as you would think.",
            "review_score": "1"
        },
        {
            "review_text": "  While I do recommend this game, I do it through gritted teeth.  This game will give you a 'rip your hair out' rage factor level. Even on easy, I couldn't beat this game after I thought I had a pretty good understanding and got all the way to the final stretch. Once those fast walkers get thrown in, it's ♥♥♥♥ing game over. You mine as well pour yourself your favorite alcoholic beverage cause this game will make you reach for it... and still it manages to be fun with the pixelated graphics appeal and quirky story writing (though the latest DLC sounds like a 4-year old wrote it.)",
            "review_score": "1"
        },
        {
            "review_text": "Great game for those survival and zombie game-type players. DEFINITELY RECOMMENED THIS GAME!!! At the beginning, yeah it was a bit hard but I've gotten use to it. IF u havent gotten this game BUY IT NOW, If you can afford it.",
            "review_score": "1"
        },
        {
            "review_text": "this is a pre good game, i bought it, thinking this might be a hit or a miss.  Was a Big hit, been at work thinking of strategies to win. its a hard game but i kinda like it that way, more challange means more feeling of reward when you overcome that challange. Recomand this game to anyone that loves old hard Retro games :D",
            "review_score": "1"
        },
        {
            "review_text": "Loved the game, it's really great! It's a bit hard, but at the same time, I think the difficulty is balanced and once you get a hang of how the mechanics work, it's really enjoyable!",
            "review_score": "1"
        },
        {
            "review_text": "I love this game, like damn one game is never the same with how much scenerios there is...like come on i wish there was more helpful guides and missions along the way. needs more food options but so far im addicted. Dave thanks for making this game its a great way to remember the 80-90s gaming. keep it up!",
            "review_score": "1"
        },
        {
            "review_text": "This game is one of the coolest pixel games I played in a while, id recomend this to anyone interested in these type of games.",
            "review_score": "1"
        },
        {
            "review_text": "hi its zombie desetroyerr off dead frontier after purchaseing this game i have found it really good takes time to get used to buy really good game reccomend it to anyone ;)",
            "review_score": "1"
        },
        {
            "review_text": "Great Game, very fun just is a little hard to play at first, p.s its jphuzzy Kind of a pain when you go half-way threw and still haven't found any food.  But 8/10 Rating. Really enjoy it :)",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game for $15, worth every penny. Very addictive and entertaining, and quite difficult so if you enjoy challenge you'll love it. Music is great, graphics are retro and very well done. The controls are also better than I expected, combat is dynamic and occurs in real time. Would definitely recommend picking it up",
            "review_score": "1"
        },
        {
            "review_text": "I'm hooked! I love the story, the feel, and just pretty much everything. It's a perfect zombie game to me :D",
            "review_score": "1"
        },
        {
            "review_text": "March of the Living - a perfect way for gamers to get a pixelated dose of Walking Dead'esque zombie adventure, complete with simplified survivor &amp; resource management, combat that reminds me of Mugsy's Revenge on the Commodore 64, music that seamlessly adds more layers and mood based on your surroundings and progress, and a tonne of scripted events that will ensure each play-through is completely different.  With a limited variation of enemies (ranging from zombie X, Y and Z, with occasional gun toting humans), you will sink into a groove that works and find lack of reason to deviate from this groove. Still, it's is somewhat satisfying (assuming you are not frustrated by the requirement of frequent pauses in order to issue commands to your squad of desperate survivors). In addition, the ever present threat of infection will throw tension your way when the slobbering zombies get within arms reach of your characters, as nobody wants to have to continuously heal people who's health degrades with each passing day.  A good option for those who love zombies (obviously), and would like to partake in long, event driven adventures through a blood &amp; zombie soaked land, where Karma can be a ♥♥♥♥♥ for those who must make dismal decisions if they wish to survive. Completing the game with specific characters will unlock additional ones, all with their own individual story to tell and missions to complete, forcing a decision between trying to maintain and feed a large group who can fight hordes effectively and carry more items, at the risk of noise generation and higher food consumption, or sticking to a small squad that needs less to eat, but may lack the fire-power or carrying capacity needed to survive later.  Having completed it with the starting character, I will wait a while before booting it up one random day to play the rest, as it is a good filler game for those days you're unsure what to play. It is not the type you want to purchase if you're looking for something to last you extended periods of time. Despite a few minor quibbles, there's no way I can say it wasn't worth the purchase, or that I won't happily revisit the game in the future.",
            "review_score": "1"
        },
        {
            "review_text": "A great game to play. At first I didn't think I would make it far or be able to befriend some people. One thing I did notice though, more people means tougher survival, more ammo to be used up and more food. Though surprisngly food wasn't too much of a problem, just Health Items and Ammo. Despite the pixilated quality its a nice game to play. For sure I'm going to put more time into this and see if I can change many new things I ran into. Heck some events even made me feel guilty and sympathy for other characters. Overall, great game to play and this completely puts your skills to the test.",
            "review_score": "1"
        },
        {
            "review_text": "good single player game, nice that you can pause it during gameplay. I was on a plane for 13 hours and when I did play it, everything seemed fine. Not many bugs/glitches and its similar to the old school Oregon Trail, the random events are pretty slick as well. I still have alot to learn about the game, but I will definatly come back to play it again!",
            "review_score": "1"
        },
        {
            "review_text": "This is a pretty nice game!  I'm doing a Lets Play of it  here . (Also kind of a first impression.)   Pros",
            "review_score": "1"
        },
        {
            "review_text": "Loads of fun i have not had since FTL and Convoy !  This one has got too be the hardest of all 3 in my Op, Map is bigger then FTL and all hell can break loose in seconds lol.  Also when you get a team going make sure to not put them all to sleep at least keep 1 on watch -_- Duh just lost every one to a horde that non heard comeing . Worth every penny folks This ones a keeper !",
            "review_score": "1"
        },
        {
            "review_text": "I like zombie games, this game has delivered with its unique combat style and story. Keep it up!",
            "review_score": "1"
        },
        {
            "review_text": "Very addictive. Very frustrating. Like that fact you have to discover for yourself the way to play.",
            "review_score": "1"
        },
        {
            "review_text": "I have tried various strategies for surving in this game but no matter what approach I take, I can never get further than the third sector. I visit every city possible and don't take uneccesary risks but at the end of the day it is all up to RNG and the RNG in this game will slap you in the face over and over and over and over. I get that rougelikes are supposed to be hard and I have no problem with that. I likea challenge just as much as the next guy but I shouldstill feel like I am ableto actually beat the game. In FTL, I knew when things were goingw rongit was because I messed up somewhere. In this game, that is not true. When things go wrong it isn't because I messed up, it's because I get attacked by zombies every five seconds and never get back the resources I have to waste fighting them.    Don't get me wrong, this game can be fun but I just feel like I am constantly being screwed over time and time again. I don't feel like i can beat this game and I've already had quite a few runs, 75% of them go to crap within the first couple of minutes because I keep getting attacked by hordes of 4-5 zombies every time I want to travel.  I will continue to play this game but I think there needs to be some balancing done before I would reccomend the game to anyone.",
            "review_score": "-1"
        },
        {
            "review_text": "A solid game. Being an indie visual novel developer, I liked the atmosphere and the various choices that are presented to you thorough the game (and are many, so far I never found a duplicate scene!). The real-time pausable combat it's also well done, and it's frenetic. It's not an easy game, but for those who play this kind of game is definitely a plus. As others have said: it is really FTL meets Walking Dead. My only minor nitpick is the map that could have been more polished but it's not like it's so important anyway. Thumbs up!",
            "review_score": "1"
        },
        {
            "review_text": "Impossible on Normal.  Too Easy on Easy.   I would rather my money back thanks.   Shame as this game has a lot to offer...but like so many cheap games nowadays...no save game slot...and just a very frustrating experience rather than a decent well made game.",
            "review_score": "-1"
        },
        {
            "review_text": "First impression: Loving it so far, definately aspects of ftl you can pick up on right away, but in a zombie scenario. The random events are pretty cool and sometimes they just make you go 'oh god what have i done'. Looking forward to see how it goes after i finally beat it on greg(i learned the hard way to play on easy mode for now). Dlcs and additional updates could add some cool stuff, and i think i saw a modding tutorial on the discussion board which could open up some cool stuff.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing just needs a save point so that you dont have to start. Other than that, its amazing",
            "review_score": "1"
        },
        {
            "review_text": "nice game. looking forward to playing it more!",
            "review_score": "1"
        },
        {
            "review_text": "Nice basic art style. Reminds me a little of Lone Survivor. The story decisions I had to make frequently gave me pause, as there is always a chance of getting badly hurt no matter how innocuous the situation at first seems to be. The tactical fights started off small but in time can get rather pitched and frantic, and I don't even have a full party gathered yet. A good 2D game if you want some excitement in your combat. Only a couple hours in and I'm eager to see how the character tales progress.",
            "review_score": "1"
        },
        {
            "review_text": "My latest 'end of game diary' read:  'Day One  I should have stayed at home'  That is all.... I didn't do so well!  It's an interesting game, other reviews say it all, so this is just to give the game a little more positive, which it deserves!",
            "review_score": "1"
        },
        {
            "review_text": "Still has some bugs that need to be delt with. One in particular that annoyed me was the game getting stuck at the end and me being unable to continue.",
            "review_score": "-1"
        },
        {
            "review_text": "i want free DF credits so its super awesome totally dig it free creds Neil",
            "review_score": "1"
        },
        {
            "review_text": "This game is painful. I started so many campaings, dying a dozen times on the 3rd sector. I really like the game, but at some point all the joy was gone, and it started to get stressful. I just wanted to beat it to be ``free``. So I made it to the end and yes, I got frustrated with the ending -at least the ending I got- after almost 21h playing trying to get the good ending (if there is one) - what I saw sucked. Don`t get me wrong, I really like the game, but I think the mechanics are often times unreasonable, even unfair. I recommend this game, but honestly I`m not planning to play again.  To be fair, for one developer, this game is incredibly welldone. I really hope he keeps going.",
            "review_score": "1"
        },
        {
            "review_text": "Fun and definitely a challenging Game that comes with a nice story, like The Walking Dead, each choice or decision you make has consequences. This game will test your judgment when zombie apocalypse happen in real life. Are you a Kind person, Naive Person, Greedy Person or a Mad Person etc.? Over all I like the game. Great work to the maker of this game.",
            "review_score": "1"
        },
        {
            "review_text": "I really want to like this game, I really do. I'm just having a really hard time really caring about the characters and the plot when I cant get to the next objective in the first place. I mean I get that the game is supposed to be like the Oregon Trail, but god damn. The game starts off with you meeting your first quest relatively quickly and to get to part two, you literally have to pray to RNG because it's two map screens away. I've only gotten about half way in the second map and I died to bandits.   I'd feel like I would be okay with this game if there were shorter check points, but for the moment I just find this game more and more frustrating to play. Especially because there's a lack of logic behind any of my choices. Maybe you shouldn't open that russling box but you MIGHT get food, you MIGHT get infected, or you MIGHT get nothing. A sole random number generator implemented in the back end of the game determines fate and I personally don't find that fun at all.",
            "review_score": "-1"
        },
        {
            "review_text": "I first played this game I felt a bit of confusion with steps going to play this game but after I try many times I find a way to play this game  a pretty good game pretty exciting and interesting pastime balanced with price thanks admin  I waited tingal Motl implant hehehe",
            "review_score": "1"
        },
        {
            "review_text": "Not enough content to play this game over, very unpolished",
            "review_score": "-1"
        },
        {
            "review_text": "boring",
            "review_score": "-1"
        },
        {
            "review_text": "Though I love the idea of an FTL-style zombie survivial game, this game suffers from three main drawbacks.  First, the combat isn't fun. On top of being a generally boring design, multiple aspects of the combat make it difficult to get the survivors to do what you want them to do. For example, let's say you get in a fight with 4 basic zombies and 4 strong zombies (faster and more deadly, and thus should be prioritized). Your survivor will try to shoot them in the order they appear in the HUD, which is usually basic zombies first, followed by strong zombies. If you specifically command the survivor to shoot the first strong zombie (#5 in line) and he kills it, he will then default back to shooting the first basic zombie (#1), forcing you to pause and repick his target every single time. When you have 3 survivors and it is not clear who is targeting what, it becomes a madhouse where more than half the fight is spent paused ensuring they are shooting the things you actually want them to shoot.   Second, the zombie apocalype narrative is often poorly executed. Frequently, it is clear that the developers had a specifc functional result in mind for a scenario, but failed to attached a believable storyline/theme to it. For example, the developers wanted a situation where you have the option to fight an unspecified number of zombies to get a random reward. The scenario they come up with for this involves your survivors happening upon a building and having a guy tell you that he will give you a reward up front if you will go an kill a group of infected for him down the road. In reality, what idiot in a zombie apocalypse would agree to fight a bunch of infected without asking 'hey, what's this reward you are going to give me? I'm not gonna go fight a zombie hoard if all you are gonna give me is a pack of matches.' The game is absolutely rife with these kinds of situations, and it completely destroys your immersion with the narrative.   The final problem is an extension of the second, namely that the poor scenario writting leads you to incorrect assumptions about how they will turn out. For example, I got to the final location in the game and needed to get by some infected. Before this scenario, all of my survivors were fed and well rested. One of my survivors suggests she scout ahead, another suggests we get a car, and my last option is basically to bum rush the zombies. I have my survivor scout ahead, but she doesn't come back. I wait for five hours, but she doesnt return, so I give up on her. Now, you'd think that my survivors might have been able to rest or at least take shifts in the 5 hours of safety that I spent waiting, If not, you'd think I would now be given the option to take my other survivor's suggestin of finding car. At the very least, you'd think I'd have the chance to rest up and eat something before bum rushing the zombies, given the 5 hours I've already be able to wait with no danger. But no, I am forced to immediately charge the zombies with all of my remaining survivors exhausted and starving. I have not played March of the Living since.  All in all, its not a bad game and there is fun to be had, but you have to be willing to put up with some notable issues.",
            "review_score": "-1"
        }
    ]
}