{
    "app_id": 458060,
    "name": "Drusilla Dreams",
    "release_date": "2016-04-22",
    "developer": [
        "Seraphim Creations"
    ],
    "publisher": [
        "Seraphim Creations"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Casual"
    ],
    "tags": [
        "Casual",
        "Visual Novel"
    ],
    "achievements": 0,
    "positive_ratings": 23,
    "negative_ratings": 24,
    "price": 0.79,
    "description": "The lovely Drusilla has overthrown her brother Caligula, and has become the Empress of the Roman Empire! Drusilla Dreams is a short yuri style visual novel about the loving relationship between Drusilla, and her favorite slave Lucca.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/458060/header.jpg?t=1466951547",
    "minimum_requirements": "OS: Windows XP, 7, 8 Processor: Pentium III 800 MHz Memory: 512 MB RAM Graphics: DirectX or OpenGL Compatible Card DirectX: Version 9.0 Storage: 300 MB available space",
    "recommended_requirements": "OS: Windows 7 Processor: Pentium IV 1 GHz Memory: 1 GB RAM Graphics: DirectX or OpenGL Compatible Card DirectX: Version 9.0c Storage: 300 MB available space",
    "reviews": [
        {
            "review_text": "Do you have a fetish for: - incest - master/slave romance - default Ren'Py UI - 'tell, don't show' storytelling - poor grammar and spelling - basic scripting errors - content updates in which the developer insults reviewers instead of actually fixing the problems with the game?  If so,  what the ♥♥♥♥ is wrong with you  you might enjoy this! Otherwise avoid. It's not even bad in a funny way, just incompetent and irritating. I only bothered to read the whole thing because it's just 25 minutes long. The only positive is the character art; I hope I can see some more of the artist's work in a better visual novel.  EDIT: And now the developer has banned me from the Drusilla Dreams community. Wonder how many other negative reviewers got the same treatment.",
            "review_score": "-1"
        },
        {
            "review_text": "best game i have ever played 9/11 but to be honest: not my proudest fap..",
            "review_score": "1"
        },
        {
            "review_text": "Drusilla Dreams is a short VN that takes place after the events in 'I Am Caligula' with a few different endings. There's some pretty nice art, and a few Yuri themed scenes, which is always good in my eyes. A nice story, with nice art. Nice job! Definitely worth the money! I mean, for 99 cents, you can't go wrong, there's not much to lose! Go ahead and give it a try!",
            "review_score": "1"
        }
    ]
}