{
    "app_id": 458380,
    "name": "Gahkthun of the Golden Lightning Steam Edition",
    "release_date": "2016-04-15",
    "developer": [
        "Liar-soft"
    ],
    "publisher": [
        "MangaGamer"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 18,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Nudity",
        "Adventure",
        "Visual Novel"
    ],
    "achievements": 0,
    "positive_ratings": 51,
    "negative_ratings": 3,
    "price": 29.99,
    "description": "Lightning crackles in the sky. A lone man hovers, overlooking The Academia. His name is Nikola Tesla, the one who will set this land right. With one assistant at his side, he shall face the council, overthrow the shadows in control, and rescue the unwitting students.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/458380/header.jpg?t=1529044460",
    "minimum_requirements": "OS: Windows XP Processor: Pentium Ⅲ- 1.0GHz Memory: 256 MB RAM Storage: 4 GB available space Sound Card: DirectSound PCM Compatible",
    "recommended_requirements": "OS: Windows Vista or Better Processor: Pentium Ⅲ- 1.0GHz Memory: 1 GB RAM",
    "reviews": [
        {
            "review_text": "This VN is very lengthy compared to most of the current VNs on Steam and I believe that it is worth the price. (10-30 hour category on VNDB but it personally took me 20 and I consider myself a fast reader.) I purchased this back in December when it came out on Mangagamers website. This steam version is uncut and retains all the original scenes. This VN has a very slice of life episodic feel to it, going from chapter to chapter covering the two main characters dealing with different people in the steampunk themed academy. The narration has a very 'prosey' feel to it.  If you don't feel like you're enjoying the VN by the time you get to the first swap to Teslas perspective (With the dog) this is probably not the VN for you as I had been sold on it by then.",
            "review_score": "1"
        },
        {
            "review_text": "uncensored 10/10 great story.",
            "review_score": "1"
        },
        {
            "review_text": "UPDATE: I've finished the VN and changed my review to reflect this.  Gahkthun of the Golden Lightning is written in a style that seems a bit like Shakespeare. It's very dramatic and ponderous, to the point of being pretentious in many scenes. What makes this laughable is that the novel takes place island school run solely by students---the hero is a transfer student and the antagonists are members of what is essentially the student council. The odd, pretentious writing in no way matches up with the anime tropes the story is littered with. It wants to tell its own story (which seems decent enough by itself), be artistic, and do some sort of weird high school/college anime thing all at the same time. For me, it just doesn't work.  Apparently there are other visual novels set in the same universe where some of the characters featured in this one are introduced, and I feel like my understanding of the story suffered for not having read them. Neon Scalar, the heroine of Gahkthun, is actually well-written and endearing, and by the end of the novel, most of the antagonists have been fleshed out. There are a lot of interesting elements in play--super powers, steampunk, borrowed historical figures--but in the end, it just doesn't deliver a satisfying experience.  Having read the entire novel, I don't feel it is long enough or interesting enough to warrant a purchase. Unlike many VN's, Gahkthun of the Golden Lightning does not offer multiple routes and there is really no reason to read it more than once.",
            "review_score": "-1"
        }
    ]
}