{
    "app_id": 458470,
    "name": "Grim Legends 3: The Dark City",
    "release_date": "2016-06-02",
    "developer": [
        "Artifex Mundi"
    ],
    "publisher": [
        "Artifex Mundi"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Casual"
    ],
    "tags": [
        "Hidden Object",
        "Adventure",
        "Casual"
    ],
    "achievements": 36,
    "positive_ratings": 348,
    "negative_ratings": 26,
    "price": 6.99,
    "description": "Hunt monsters in the gothic city!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/458470/header.jpg?t=1530538889",
    "minimum_requirements": "OS: Windows XP, Windows Vista, Windows 7, Windows 8 Processor: 2 GHz Memory: 1 GB RAM Graphics: 256 MB VRAM DirectX: Version 9.0b Storage: 2 GB available space",
    "recommended_requirements": "OS: Windows XP, Windows Vista, Windows 7, Windows 8 Processor: 2.5 GHz Memory: 2 GB RAM Graphics: 512 MB VRAM DirectX: Version 9.0b Storage: 2 GB available space",
    "reviews": [
        {
            "review_text": "For years now, I chronically see Steam friends playing these mysterious  Artifex Mundi  games, which is a specific brand (if you will) of HOG (hidden object games). While at first glance, this genre seemed too casual for me, but boy I was wrong.   I get it now.   After my experience I can say two things:  1. Yeah, this game is fairly 'casual', BUT 2. Man-oh-man it is addicting and sooo butter smooth to play    Grim Legends 3: The Dark City  is  very  polished, and definatley keeps you clicking.  The time flies. The storyline is a cool fairy-tale esque affair, and the puzzles are just difficult enough to keep me interested - yet never make me rage. There is something very rewarding about going through this. While this genre will never be the staple of what I play, I definately appreciate it and think highly of how well-crafted it is.   Essentially, this title is a series of closely related minigames that you solve as you experiece a great story.  Some are run-of-the-mill hidden obect games, BUT alot of this reminds me of classic point-and-click adventuring (without a character physically moving around the screen). You have an inventory and use it to solve puzzles.  Definately a great atmosphere.    Pros:  +Highly polished game with stunning atmosphere and engaging story +Very rewarding puzzle solving that is a bit addictive +Easy to get into +If you haven't tried one of these, you owe it to yourself to pick one up when there is a deep sale   Cons:  -Definately a casual game, but great for just kicking back and enjoying the experience   Get one on sale, and I bet you will find yourself smiling and really enjoying it. ",
            "review_score": "1"
        },
        {
            "review_text": "Grim Legends 3 is a very well made hidden object casual adventure game. There are quite a few points that I'd like to mention though.  First of all I'd like to say that while this game has a very intense and interesting atmosphere it simply doesn't fit well in the Grim Legends series. The fairytale theme from the first two games is completely gone and this just feels odd as the third part of that series. That doesn't make the game any less fun to play though.  The presentation is great and almost as good as in the first Grim Legends game. There are a few scenes when the characters aren't 3D rendered and instead use the moving 2D image technique that don't look great. This being sad most of the game just looks fantastic and especially the animation is really well done. The music and voice acting is flawless and both fit the atmosphere of the game very well.  The story is interesting and quite dark. Both the pacing of and the few twists in the story are great. I'd say that the story is one of the best in any Artifex Mundi game.  The mini-games are at last not repetitions of the same mini-games in older Artifex Mundi games. All the mini-games feel new and for the most part are very well made. Sadly the hidden object scenes aren't as amazing as in other Artifex Mundi titles and for my taste there were too many FROGs and 'find x of the same item' kind of scenes. Still those parts of the game are fun and don't ruin the game.  The last thing I'd like to mention is that some of the achievements in this game are quite hard to get. This isn't bad, but the one that requires you to finish a hidden object scene in under 20 seconds might be a bit too harsh. I had to replay the game a few times to memorize one scene and then execute it perfectly to get that achievement.  Overall it's a great game and I can recommend it even for the full price. If you really liked the fairytale scenario of the first two games and don't like darker scenarios though, you might want to wait for a sale.",
            "review_score": "1"
        },
        {
            "review_text": "Great story and puzzles! I love the mix of mini-games in it, this is one the first Artifex Mundi games where I wasn't disappointed that there wasn’t a skip the hidden object puzzles with a mahjong or other puzzle game. These we're really well done! Hope there can be more in the Grim Legends world!",
            "review_score": "1"
        },
        {
            "review_text": "A well-made casual point-and-click adventure. It's somewhat short, and also light on hidden-object scenes and puzzle mini-games, but all the content that's there is terrific. It especially shines in terms of storytelling: there are characters you can get to know, watch develop and get entangled in dramatic webs.  I was a bit surprised by how good it was, considering that the first two entries in the series were quite mediocre. But the “series” is just marketing malarkey: the games have almost nothing to do with each other and can be played separately.  Note that this game has achievements that are legitimately difficult to obtain. That's rather unique for this genre of game.  I would also like to thank the developer for supporting Linux.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent story, graphics and music!! Great mini games. I highly recommend this game to others!! Enjoy!!",
            "review_score": "1"
        },
        {
            "review_text": "Excellent story, graphics and music!! Great mini games. I highly recommend this game to others!! Enjoy!!",
            "review_score": "1"
        },
        {
            "review_text": "An alright HOG to play. You will be playing as Sylvia trying to hunt and get rid of demons. Also your memory is gone from something that happened to u before. During the process together with your mentor u will also be fighting the big bad demon.  I'll be very honest I didn't like this HOG that much. The first Grim Legends is much better. I then like the second one. For some reason this Grom Legends just feels wayyyyyyy to different than the last two  At least the voice acting is very nice, the music was nice as always, the BG was nice, animations are nice, and the art is just amazing. Also lots of cool different things were introduced in this HOG. U actually can combine ur items in your inventory. You can examine ur inventory items to see if that item needs to be disassembled to be used with another item. There is magic fighting in this game. Also some objects u can rotate to look at another side so u can examine the object.  Also this HOG has bonus content in which I really enjoyed playing.   I guess my biggest problem with this HOG is that it just felt really different than the other two. Also I feel like this game was rushed. An example like there should of been more scenes with the doctor. I forgot his name. Would of been cool to see the doctor more involved in the game. Also because I really liked the bonus content I really wish it was much longer too.  I would be rating this a neutral review if there was a neutral rating.",
            "review_score": "1"
        },
        {
            "review_text": "These are all very well done, but I think too similar to one another, in terms of gameplay. There are a lot of repeated puzzles in particular. In terms of plot this one is so different I'm a bit at a loss as to why it is part the 'Grim Legends' series. The first one had a vaguely fairy tale/Angela Carter feeling to it. The second was the fairy tale of the Seven Swans. This one has nothing to do with fairy tales but seems more inspired by steam punk. At first it was a welcome change, but as I played I found the story a bit irritating. You play a girl with amnesia fighting against people whose sins have opened them up to being possessed by other dimensional monsters. But your own story is rather non-existent throughout the whole thing. Also the moral seems to be a bit based on Pandora's box. The boy in the story causes all of the trouble by investigating the occult and not submitting to the natural order, which is a point of view I've always taken as being anti-science.  Still the game is smooth as ever and about as good as a hidden object adventure can be. As always I wish the logic puzzles were harder versions of the same puzzles. Scaled difficulty there would be very nice.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty, pretty cool puzzles, pretty lame story.  If you're in it for the puzzles, I would totally recommend it to you. But if you're in it for a good story, move along.  Neat Things:  * The graphics kicked it up a notch in this game. Lot's of cut scenes.  * Everyone in the order gets the same uniform. That almost inappropriate top buttons undone for men and women alike. This matters a lot to me.  * The puzzles and the themes to them were really cool. Everything fit into a theme (even if it was overhanded at times; like the hospital) and pleasing to the eye. * Soundscape was pretty good. Voice acting was better than usual in this series.   Meh Things:  * What unrealistic battles! There wasn't a time penalty for not acting quickly enough (maybe there is on super hard?). But I can't believe an enemy would just let me sit there and awkwardly pattern match.  * The plot. Was dumb. It had potential at first, but then it just derailed in a bad way. And the ending just made me sit back and think: 'did I really just sit here and play this game for this ending?'  * The side story. There was perfect potential to side story whatever thing that made the heroine lose her memories (like, idk did she get sick? Was she injured in the line of duty? Fall off a building?? I'll never know!), instead we got something dumb. It's a theme with Grim Legends to have bad side stories. Well, their not *bad* there's just something that's obviously so much cooler and interesting, and every time we get something that is disappointing. * This herione. Isn't that smart. She doesn't prepare well, or think ahead. I don't know if it's because she lost her memories (and that's where she got her accent from?), but, this girl.",
            "review_score": "-1"
        }
    ]
}