{
    "app_id": 458420,
    "name": "Last Heroes 3",
    "release_date": "2016-04-01",
    "developer": [
        "Warfare Studios"
    ],
    "publisher": [
        "Aldorlea Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie",
        "RPG",
        "Strategy"
    ],
    "tags": [
        "RPGMaker",
        "Adventure",
        "Strategy"
    ],
    "achievements": 0,
    "positive_ratings": 34,
    "negative_ratings": 12,
    "price": 2.09,
    "description": "Enjoy another classic 16-bit RPG from Warfare Studios of Vagrant Hearts, Ashes of Immortality and Valiant fame, and embark on a quest with Amelia and Roland as they make new friends, experience dreams, and discover their destiny.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/458420/header.jpg?t=1535991830",
    "minimum_requirements": "OS: Windows XP/Windows Vista/Windows 7/8/10 Processor: 1.6 GHz Memory: 128 MB RAM Graphics: DirectX 9.0 Compatible DirectX: Version 9.0 Storage: 100 MB available space Sound Card: DirectX 9.0 Compatible Sound",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Alright, so we're not in massive innovation of the genre territory here, but like the previous two parts of Last Heroes, it's a nice, basic RPG with minimal grinding/tedium and an enjoyable story. This one, like the others will last 6-8 hours so you don't have to commit half a month to it. My only gripe is that every time you start a new part/game in the series the characters start right back at level 1 with no gear or money from the previous adventure and no explaination as to why. A shame really as it means there's no incentive to develop the characters any futher than needed to beat the final boss as you know it's all going to be for naught when Last Heroes 4 comes out.",
            "review_score": "1"
        }
    ]
}