{
    "app_id": 458560,
    "name": "Plastic Playground",
    "release_date": "2016-04-18",
    "developer": [
        "Tomorrow Arts"
    ],
    "publisher": [
        "GP Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Multi-player",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Free to Play"
    ],
    "tags": [
        "Free to Play",
        "Action",
        "FPS"
    ],
    "achievements": 0,
    "positive_ratings": 49,
    "negative_ratings": 102,
    "price": 0.0,
    "description": "Plastic PlayGround is a fast paced, team based, LAN multiplayer first-person shooter. In PPG you play as everyones favorite toy only this time you get to run, jump, jetpack, grapple, and fly. The goal is to capture as many control points as you can while eliminating and evading hostile toys from the enemy team.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/458560/header.jpg?t=1461159873",
    "minimum_requirements": "OS: Windows 7+ Memory: 8 GB RAM DirectX: Version 11 Network: Broadband Internet connection Storage: 2 GB available space",
    "recommended_requirements": "Memory: 16 GB RAM",
    "reviews": [
        {
            "review_text": "Rub your ballsack on a barbed fence Jump into a pool of sharks butt naked Slide a hot forged ingot across your face Stick a lighter in your @sshole Wear a meat belt in a pitbull store Jump headfirst into a 2 ft pool  But please  Dont play this game",
            "review_score": "-1"
        },
        {
            "review_text": "Worst game",
            "review_score": "-1"
        },
        {
            "review_text": "It wont let me play it when I downloaded it.",
            "review_score": "1"
        },
        {
            "review_text": "  This game was free and I still feel ripped off !",
            "review_score": "-1"
        },
        {
            "review_text": "It will not let me click any of the beginnining icons(join,host). I tryed any times but this continues pls help.",
            "review_score": "-1"
        },
        {
            "review_text": "  i installed the game but after all i think it isn't a trojan virus at all first of all sorry if it is i played it but the only thing was you have to play the waiting game after that i have a hp computer i do not have a alien ware yet and plastic playground was only just lagging so much i had to shut down the computer and that was it just a ordinary game i think i mean i think its lagging because most all you guys should say yes i mean i looked at it for the trailer on steam it looked pretty nice after all i mean yeah its a good cool game it was lagging so much and plus i even have 1 terabyte harddrive in the laptop i need more ram i can't do that so anyways okay",
            "review_score": "1"
        },
        {
            "review_text": "i feel like this game came out when it wasn't fully ready yet. its allright though it deosn't seem so bad if only you could actually do something... (either the servers dont work or theres none.",
            "review_score": "1"
        },
        {
            "review_text": "Connect Through player hosted servers?? Yeah this game is dead already....",
            "review_score": "-1"
        },
        {
            "review_text": "Well, tbh i thought this was going to be an average fps to have some fun until the game itself died, but I guess it just did the moment it was released. First, it took like 1 or 2 minutes on my computer to load, idk why. Then, when the game finally loaded, I tried to join a game, but I couldn't click the menu options, so I quit, and started the game again, and the same problem happened. When I got to click a single option, it was like christmas, and the problem was that the resolution of the game was bigger, so I had to drag the mouse at the bottom of the screen to click.  When I got to 'join' a game, I was expecting the game to have less than 12 players or some per server, but there weren't any servers... The last thing I did was to play alone, just to see the game itself, and it was a little bit like I was expecting, just a 'Little' bit... The sound effects are average, the music is boring, controls... well, okay-bad, and the jetpack is awkward to use. Funny thing, I was lagging in the menu, but not in-game. Don't get it until they do something, or at least when it's playable, and there's people to play with, not more, just some, because there aren't any.",
            "review_score": "-1"
        },
        {
            "review_text": "I stepped on a lego.",
            "review_score": "-1"
        }
    ]
}