{
    "app_id": 458510,
    "name": "Zombie Pinball",
    "release_date": "2016-06-21",
    "developer": [
        "Shine Research"
    ],
    "publisher": [
        "Plug In Digital"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Casual"
    ],
    "tags": [
        "Casual",
        "Pinball",
        "Arcade"
    ],
    "achievements": 11,
    "positive_ratings": 19,
    "negative_ratings": 18,
    "price": 3.99,
    "description": "In Zombie Pinball, you will have great fun by smashing zombies !",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/458510/header.jpg?t=1519902936",
    "minimum_requirements": "OS: Windows XP + Processor: 1 GHz Memory: 1 GB RAM Graphics: Direct9 compliant DirectX: Version 9.0c Storage: 500 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Well I just wanted to put a few things out there for people looking to buy this game...  I spent a little over an hour with the first table, which was fun but not at all what I was expecting. The table itself is fine, and there is 5-6 mini games you can activate by hitting targets. The physics feel super floaty... the balls themselves sound and feel more like you are playing a pachinko machine filled with glass beads. I say this because the first table has at least 4 differant seperate multiball modes and you can trigger them all at the same time. Ten+ glass beads shooting (floating) all over the place while on fire (yes on fire with trail effect) is exciting but not what I have been used to playing on FX2 or Pinball Arcade. In how it compares to actual pinball I would say this is the lowest of the pinball games I own.  Some of the rules language is a bit strange. The first challenge is 'Validate 10 lanes'  There seems to be a score bug occasionally and the scoreboard is local only for now from what I can tell. The real stinker for me is the lack of changeable options. I have not figured out how to change my flipper and launch keys, as in there is no setting on the menu (the default is the left and right arrow keys). Not mentioned anywhere in the game either so you kinda have to press keys to figure out what is what lol.... lame. (Enter was table shake, and space was launch). Another thing that irritated me was the fact that all but the first table are locked. You must earn enough points to unlock the next table. Maybe I dont want to play the same table 20-30 times in a row? Pinball just seems a strange game to content lock table variety down.  I know it just launched, and its super cheap... but it FEELS like a tablet game to me. If you are totally fine with that and want some semi mindless pinball lite gameplay then grab it. I DO like it I just don't know how often I will play it when there are so many other options with leaderboards and tournaments. Maybe in the future they will add more options to customize keys.   ",
            "review_score": "1"
        }
    ]
}