{
    "app_id": 458630,
    "name": "Political Animals",
    "release_date": "2016-11-02",
    "developer": [
        "Squeaky Wheel"
    ],
    "publisher": [
        "Positech Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Local Multi-Player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Indie",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Simulation",
        "Strategy",
        "Indie"
    ],
    "achievements": 28,
    "positive_ratings": 84,
    "negative_ratings": 30,
    "price": 10.99,
    "description": "Political Animals is an election campaign simulation game set within a world populated by corrupt crocodiles and meritocratic mice. In a political contest where corruption is always around the corner, can you win without getting your paws dirty?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/458630/header.jpg?t=1517322730",
    "minimum_requirements": "OS: 7 Processor: min. 1.8 GHz Memory: 2 GB RAM Graphics: Nvidia Geforce 820M DirectX: Version 10 Storage: 1 GB available space",
    "recommended_requirements": "OS: 7 Processor: min. 1.8 GHz Memory: 4 GB RAM Graphics: Nvidia Geforce 820M DirectX: Version 10 Storage: 1 GB available space",
    "reviews": [
        {
            "review_text": "I'm a huge fan of the Positech-published strategy games that have come out in the last couple of years. During the Steam Summer Sale, I purchased Democracy 3, which was a little too accurate and frustrating when it came to political simulators. Every path I took seemed to end in death.  I am happy to report that this is a much more cheerful political simulator. Croccy may be a cutie, but don't be fooled by his appearance. He will bribe, scandalize, and steal away your voters to make sure that you don't win. Of course, my chosen candidate, Panda, could have done the same, but I guess I'm just one of the few honest politicians left. :P  If I had to complain about one thing, it's that I haven't figured out how to make the reporter point out any of my opponent's scandals, but that's probably user error. Otherwise, there are multiple ways to win over votes for multiple playstyles. I just wish it were multiplayer so that I could play it with friends!",
            "review_score": "1"
        },
        {
            "review_text": "'This contractual ♥♥♥♥♥♥♥t has to end!' - My Preacher campaigning in Texas",
            "review_score": "1"
        },
        {
            "review_text": "GOTTA LOVE THIS NEW TWIST IN RTS GAMING.",
            "review_score": "1"
        },
        {
            "review_text": "MAKE AME- AUTUMN ISLAND GREAT AGAIN VOTE BULLDOG 2016",
            "review_score": "1"
        }
    ]
}