{
    "app_id": 458710,
    "name": "Kingdom Rush Frontiers",
    "release_date": "2016-07-25",
    "developer": [
        "Ironhide Game Studio"
    ],
    "publisher": [
        "Ironhide Game Studio"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Tower Defense",
        "Strategy",
        "Indie"
    ],
    "achievements": 84,
    "positive_ratings": 2504,
    "negative_ratings": 109,
    "price": 6.99,
    "description": "Command your troops through an epic (mis)adventure as you defend exotic lands from dragons, man-eating plants, and ghastly denizens of the underworld -all with flashy new towers, levels, heroes, and more goodies to help you crush your foes in this Fantasy Action Tower Defense game!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/458710/header.jpg?t=1481830109",
    "minimum_requirements": "OS: Windows XP Service Pack 3 Processor: Dual Core CPU Graphics: OpenGL 3.0 compliant with 512MB of video RAM. Storage: 1500 MB available space",
    "recommended_requirements": "OS: Windows 10 Processor: Dual Core CPU Graphics: OpenGL 3.0 compliant with 1.0GB of video RAM. Storage: 1500 MB available space",
    "reviews": [
        {
            "review_text": "   If you think I missed something in my review feel free to tell me      Kingdom Rush: Frontiers",
            "review_score": "1"
        },
        {
            "review_text": "Kingdom Rush Frontiers continues the story that ended in the original. After Vez'nan demise, evil mage Lord Malagar gets his hands on Vez'nan's staff and steals powerful Hammer of Ages. You, unknown hero, have a task to retrieve it before Lord Malagar can use it for his evil plan. That proves to be a difficult job as you are chasing him across the desert, jungle and underground caverns. During your journey, you are gonna encounter new, powerful enemies but you will also get help from (unexpected) allies.   KRF's gameplay isn't any different from original. There are 15 levels with 3 game modes - Campaign, Heroic and Iron. Also, there are 3 difficulty options - Casual, Normal and Veteran. Completing levels will grant stars that can be spent on upgrading towers and spells. Using Hero during levels will make him more experienced and you can use that experience to make him more powerful.   Downside of KRF is that there is no checkpoint or fast forward system thus making game a bit tedious on multiple replays but it's balanced by having relatively short levels and plenty of easter eggs.  Fun gameplay, interesting story and upgrade system makes this journey worthwhile of your time.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing. Hope they will add in Endless challenge",
            "review_score": "1"
        },
        {
            "review_text": "Kingdom Rush Frontiers improves on its previous installement in many ways , including level ups,level designs, more variety, new Heroes etc.  Kingdom Rush was one of the best Tower Defense Game, and this one is no different on any scale.",
            "review_score": "1"
        },
        {
            "review_text": "This game.... This game... You need to play this game! So much like the ipad version but way better! Way better! Way better graphics! Way better everything! yeah! play this game! It so much fun!  At least try it!  :P I rate this game 10/10 ",
            "review_score": "1"
        },
        {
            "review_text": "Kingdom Rush Frontiers...  Is one of the best, and most balanced Tower Defence Titles I've played. The story is expansive but not overwhelming. Each difficulty level builds upon the last furthering you to hone your skills and manage your tactics...  Overall a solid buy in my opinion. If your into Tower Defence games this is worth a go.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing. Impossible stop playing once you start start",
            "review_score": "1"
        },
        {
            "review_text": "I beat the game countless time on Armor Games, was awaiting the Steam release to beat it once more.  The port so far seems very good and runs well, that's all I really cared about since I knew what I was expecting content wise.   It's one of the best Tower Defense I've ever played and it's a very addictive game plus the art style is very good, I really recommend it to anyone who is interested, it's worth it.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game you guys should add 20 wave levels.",
            "review_score": "1"
        },
        {
            "review_text": "nice main game, not too easy and not too hard, great variety in units and towers, only the humor was better in the first game",
            "review_score": "1"
        },
        {
            "review_text": "Kingdom Rush Frontiers: Great game or the greatest game?  Without the doubt one of the greatest games ever made!  You will be happy that you went out and finally bought a copy and kicking yourself for waiting this long...  Not only that, but as with Kingdom Rush it delivers coundless hours of immensely satisfying gameplay that never disappoints even a single bit.  And best of all they also have excellent mobile version as well that you can play on the go...  Final Sure: Sure To Please  Now we wait for Kingdom Rush Origins...",
            "review_score": "1"
        },
        {
            "review_text": "I have been playing this game on my phone for a long time now and the game is great but 10$ isn't really the ideal price since you can find this game for free on browser. I don't mind spending money for one of my favorite games but this game should be 5$. It is worth it since it doesn't have microtransaction and you get access to all the heroes after purchasing the game.",
            "review_score": "1"
        },
        {
            "review_text": "塔防中的經典!  Great game and without any further DLC or character need to purcahse.",
            "review_score": "1"
        },
        {
            "review_text": "Just when you thought the best Tower defence game couldn't get any better, it did !",
            "review_score": "1"
        },
        {
            "review_text": "Great tower defense game,very fun and balanced!You get alot of heroes that are very powerfull and soon there will be new elite lvls that are just awsome(currently they are on mobile version only) all this content will be added for free with updates next few months.Worth 10 dollars!",
            "review_score": "1"
        },
        {
            "review_text": "Waiting for Origins",
            "review_score": "1"
        },
        {
            "review_text": "Has a long a relplayable campaign.  Needs an endless mode.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 no ♥♥♥♥♥♥ microtransactions like the phone version.",
            "review_score": "1"
        },
        {
            "review_text": "About ♥♥♥♥ing time!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome art style. Awesome gameplay. Awesome music. Awesome game.",
            "review_score": "1"
        },
        {
            "review_text": "Best strategy game i have bought so far",
            "review_score": "1"
        },
        {
            "review_text": "sheeeeeeeeeeeeeeeeeeeeeet ♥♥♥♥ing glad I didn't play the ♥♥♥♥♥♥ mobile version (I still played the Origins though XD). Love me them keybinds....the screen and the smoooth HD quality to this. ♥♥♥♥ YA!! Thanks Devs!!!! You'll all enjoy this!!!!! Oh.....and it's 60 FPSsssssss delicious~!~!~!",
            "review_score": "1"
        },
        {
            "review_text": "The last level makes this game not fun. It's one of those fake difficulty things where the system just cheats because the programmers couldn't balance the game correctly.",
            "review_score": "-1"
        },
        {
            "review_text": "Hello everybody. You know, I'm not a big fan of tower defence games. Why did I bought this game? Looking at the high ratings I thought that this game has a soul. But after careful consideration of the game, I realized that this is only pitiful semblance of TD maps for Warcraft 3. No soul, no graphics, no atmosphere. Now I'm sure that the soul lives only in such masterpieces of oldschool like warcraft. At this point I could complete the review, but I want to ask one question for all readers:   Why you encourage unscrupulous developers and buy these games? Oh, sorry - 'games'. Very funny and sad to watch how the parodies of Warcraft maps (which are disguised as the original games) sell for huge amounts of money... Why are tens of millions people play DotA and other MOBA games? Why do they pay for these games, if they can just download a free map for Warcraft? Honestly, I don't understand this foolishness... And not so much foolishness, how much a complete lack of morals. Ask yourself a simple question: Will you develop a game, if you knew that it subsequently stolen piece by piece, and everyone will forget about you?",
            "review_score": "-1"
        },
        {
            "review_text": "The Kingdom Rush series is tower defense perfection",
            "review_score": "1"
        },
        {
            "review_text": "Got all the stars Enjoeyd the well crafted and detailed tower defence experience  Amazed at the animated visuals and all the refrences  Played with all heroes (shatra has the best instakill ability in the game) Upgraded everything  Saved the kingdom from giant lobsters  And  Got fully satisfied for the price i paid   Its definetly worth buying. Stop thinking about it just purchase the game if you are reading this review!   My only complain is that some stages are way too simple. For example even at veteran difficulty you can beat level 7 just by placing two barracks near the end (for the the matriarch spiders) and the rest full archer with crossbow forts and the rapid fire upgrade   Also i really hope you bring the missing content with new updates and make origins available at steam! I am loking forward to your future creations! ",
            "review_score": "1"
        },
        {
            "review_text": "This most of the good bits of Kingdom Rush.  Watch out for the last boss level, the game cheats by zapping your towers and if you play normally you'll run out of gold.  The newer levels provide welcome fun",
            "review_score": "1"
        },
        {
            "review_text": "This is a great TD game, the fact that they will be giving us free 'expansions' for months to come doesn't make me love the developers any less, that's for sure!   WIthout a doubt worth the 10 euro they ask.   8/10",
            "review_score": "1"
        },
        {
            "review_text": "A very nice game and well worth buying. I especially enjoyed the latter stages in the bas game. The first expansion is excellent: clever, different and challenging (not to mention the beautiful graphics). This is definitively one of the best Tower Defense games around.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing TD game, Definitely in top 5 of all time.  Pros - Better hero mechanics - no OP heroes, different heroes require diff. play styles, I seldom use the same hero for every stage.  Cons -  No survival mode (I mean endless waves) Easier to beat stages (even in veteran difficulty) than in KR 1. (But this can essentially introduce beginners to this series, then fans of this game who require a challenge can play the KR 1.  Definitely worth buying for the free heroes, graphics and game stability overall. ",
            "review_score": "1"
        },
        {
            "review_text": "Really Good Loved the game 100% well made but if your a developer reading this add more content. Theres alot in it but a little more :)",
            "review_score": "1"
        },
        {
            "review_text": "Everything you loved from the original Kingdom Rush shows up in Frontiers, plus much more.   The insanely addictive Tower Defense game is back! Ironhide brings you the same great art style, defense mechanics, new and old tower upgrades, a plethora of new enemies, AND to spice things up, we have unique Heroes to command on the battle field.  Now, I've read a couple reviews which put the Hero system in a negative light. Personally, for me I really enjoyed it. Honestly, I played with one hero the whole time. Mirage, which is a clone creating, thief type Hero. Now, let me tell you that each Hero is very unique with their own pros and cons. I gravitated towards Mirage because her abilities matched my playstyle. I also messed around with the Wizard, the Alien dude and the final Dragon that you get. Ultimately, always coming back to Mirage. The Heroes are here for you to test and have fun with, not to be over whelming on the battlefield, which they are not.  Kingdom Rush is my favorite Tower Defense game and it's my favorite game to just pick up and play for 20 minutes or so at a time.   We will also be receiving FREE MONTHLY UPDATES. Yup. Ironhide is one of those game developers that  gets  it. The last week of each month we will receive two new heroes and a new campaign. This game is loaded for only $10. Well worth the price.  The game itself takes around 12 hours to complete. If you want to collect all the stars so you can fully max out your traits, then you'll be putting a bit more time into it. I'm at around 25 hours as of this review and I'm coming close to 100% completion of the base game.   I can't recommend this game enough! It's truly a gem.",
            "review_score": "1"
        },
        {
            "review_text": "Nice plot, great character development, divers, replayability aswell as stunning graphics. Another pro is you can play this onehanded.",
            "review_score": "1"
        },
        {
            "review_text": "Still one of the best tower defense game series I ever played! Super smooth, well balanced and a lot of fun! I'm really happy about the fact that Ironhide finally decided to also create a Steam version for/of this gem! Hopefully they'll do this for their third Kingdom Rush game as well. We'll see. Keep fingers crossed. ;-)  PS.: Don't mind my official playtime. Had the game open in the background for a while.",
            "review_score": "1"
        },
        {
            "review_text": "one of the best mobilte to pc ports - redesigns I have ever seen. Don't be fooled by the fact that it exists on mobile as well. As hardcore pc gamer with a disgust for bad ports, whichever way but most especially towards pc can say with confidence that this game is one of the best.And as far as tower defense go, you love em or hate em, this is more bloons than defense grid style, but fun heroes,good replayablity, and sometimes some serious ***kicking :) just like it should be",
            "review_score": "1"
        },
        {
            "review_text": "  The Kingdom Rush series produces some of the best tower defence games ever, and this one is a great example of that",
            "review_score": "1"
        },
        {
            "review_text": "Solid defense game. Each level is different so that it doesn't feel like a grind.",
            "review_score": "1"
        },
        {
            "review_text": "As someone that isn't necessarily fond of the tower defense genre, I think Kingdom Rush Frontiers is an absolutely fantastic game. It's fun, it's intuitive, and it's challenging. Each level presents itself with brand new layouts, themes, and enemies. One notable feature that I personally find quite fun is the fact that you can sort of take control of a 'Hero' that can fight for you along with your defenses. There are currently 16 heroes to play as in the game, all with their own unique set of stats, skills, and visual characteristics.  Overall, Kingdom Rush Frontiers has a pretty good amount of content for its price tag of $10.     ",
            "review_score": "1"
        }
    ]
}