{
    "app_id": 459160,
    "name": "Allods Online My.com",
    "release_date": "2016-06-03",
    "developer": [
        "IT Territory"
    ],
    "publisher": [
        "My.com"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "MMO",
        "Steam Trading Cards",
        "In-App Purchases"
    ],
    "genres": [
        "Free to Play",
        "Massively Multiplayer",
        "RPG"
    ],
    "tags": [
        "Free to Play",
        "Massively Multiplayer",
        "RPG"
    ],
    "achievements": 0,
    "positive_ratings": 196,
    "negative_ratings": 101,
    "price": 0.0,
    "description": "Allods Online is a massively multiplayer online role-playing game, set in the fantasy space opera universe of Sarnaut. It is the fourth opus of the Rage of Mages series which started in the mid-90s, conquering the minds of millions of gamers around the world.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/459160/header.jpg?t=1552995987",
    "minimum_requirements": "OS: Windows XP SP3 Processor: Intel Pentium Dual-Core 2.6 GHz or Intel Core 2 Duo 2.66 GHz Memory: 3072 MB RAM Graphics: nVidia GeForce 8800 GT 512MB, Shader Model 2.0, 1366x768+ Network: Broadband Internet connection Storage: 16 GB available space",
    "recommended_requirements": "OS: Windows 7 / 8.1 / 10 Processor: Intel® Core™ i3 3.4 GHz Memory: 6144 MB RAM Graphics: nVidia GeForce GT 320 1024MB, Shader Model 2.0, 1600x900+ Network: Broadband Internet connection Storage: 24 GB available space",
    "reviews": [
        {
            "review_text": "Short version: Avoid this game. It is a cash grab. If you want a decent free to play game, try Rift or WildStar.   I have played Allods since beta and watched it go through more than one publisher. This was a great MMO with a ton of potential. I use the word 'was' because it's obvious Allods glaring problems have not gone away.   This game is not free to play. Not if you want to do anything past about level 20. In order to progress and do anything in PVP or PVE, you need to spend money in the cash shop. The game throws cash shop perks at you from level 5 and it's very clear that anything to get ahead will require money.   Let's say for a moment it does require money. Hey, everyone has a business to run. That's fine. But, there have been many people who estimated that you need to spend in excess of $1,000 (USD) in order to get what you need for your character. The words 'money grab' don't describe what this game has become.   The population is low. Very low. You won't see a lot of other players around in lower level zones. You will see plenty of spammers, though.   The game also has no option for PVE after level 20. PVP is open after that and it's not very much fun. In order to level through certain areas, you need to have cash shop items and a high level to 'escort' you.",
            "review_score": "-1"
        },
        {
            "review_text": "I strongly recommend this game...but only if you play on the subscription server (that has no cash shop, no pay to win, where the game truly shines). Otherwise, don't waste you time on this game, the free to play server although it's populated, it's extremely pay to win, not worth it. Subscription server is amazing and this game is very well made, with nice graphics, nice soundtrack, solid lore/story. By the way, Steam make things harder for subscription server since it doesn't tell you how to actually subscribe, it doens't have a way to buy subscription from the steam store. You must create a character on free to play, and after tutorial you hit 'Y' to buy crystals on cash shop, use this to buy sub.",
            "review_score": "1"
        },
        {
            "review_text": "Play on the P2P server. It's low pop but community is great and is growing. No gimmicks, no P2W, no BS... just a good MMO. It's about $8.50/month too so just over half the cost of WoW",
            "review_score": "1"
        },
        {
            "review_text": "Dont worry about my in game hrs, I played this for yrs before it came to Steam. Allods online is a great free MMORPG. Lots of content , not a huge grind and beautiful lands to explore and huge cities to wander in tons of quests and the Devs and Community are amazing. Its free give it a try. If you like MMO`s you`ll love Allods online..",
            "review_score": "1"
        },
        {
            "review_text": "great lore, mechanics, graphics and ingame content, +++++",
            "review_score": "1"
        },
        {
            "review_text": "tried again after a long time... its still just, just dull..",
            "review_score": "-1"
        },
        {
            "review_text": "this is plastic you think its good and find out its real crap",
            "review_score": "-1"
        },
        {
            "review_text": "it nice game fun to play but there is a small problem it not balance between the two races",
            "review_score": "1"
        }
    ]
}