{
    "app_id": 459170,
    "name": "Discovr™ Egypt: King Tut's Tomb",
    "release_date": "2016-04-11",
    "developer": [
        "Discovr Labs"
    ],
    "publisher": [
        "Discovr Labs"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Casual"
    ],
    "achievements": 5,
    "positive_ratings": 25,
    "negative_ratings": 18,
    "price": 0.0,
    "description": "Discovr Egypt takes you into the ancient tomb of King Tutankhamun using the HTC Vive, where you can not only learn about some of the rich history surrounding his legacy, but also uncover his treasures.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/459170/header.jpg?t=1463095004",
    "minimum_requirements": "OS: Windows 7 SP1, Windows 8.1 or later, Windows 10 Processor: Intel® Core™ i5-4590/AMD FX™ 8350 equivalent or better Memory: 4 GB RAM Graphics: NVIDIA® GeForce® GTX 970, AMD Radeon™ R9 290 equivalent or better Storage: 400 MB available space Sound Card: Yes Additional Notes: Requires HTC VIVE",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "this is definitely a steal for $2. Treasure hunt is a lot of fun, although I almost knocked over my desk trying to reach for all the gold in time. Discovry mode is really chill, but not much to do after you've listened to all the info narration. The coolest part is definitely the coffin itself its very detailed.   This game i better if you have a bigger space since you have to walk a bit to reach some treasure pieces and some of the teleport points are tricky. If your like me you'll be tempted to use the teleport laser as a lightsaber. Overall definitely worth the price for getting to turn your living room into an ancient tomb.",
            "review_score": "1"
        },
        {
            "review_text": "a really impressive demo, I like the way that I can walk around a look at so many details. I have been showing this to multiple people and they have all been pretty impressed by the same things that I have noted.   I would like other tombs and parts of pryimid to expore, I can see this being made into a real interested way to learn and explore new places.",
            "review_score": "1"
        },
        {
            "review_text": "I can't really begrudge them the £1 something I paid for the game but be aware this is more of a very early proof-of-concept for educational VR, not an actual market-ready experience.   There are about five different info points that play a little soundbite about the item you're standing next to, but some obvious low-hanging fruit is missing - who built the tomb? Why? What were the egyptian beliefs about life, death and the afterlife? What's the significance of the dog-headed Anubis figures? Who were the pharaohs and what was their role in egyptian society?  In practical terms the time spent on the treasure hunt section would have been better used to provide much deeper educational content. If people want to play a game on their Vive, this isn't going to be the title they reach for - so why spend time and resource developing it? The flashlight is too dim, making it very hard to get an idea of the full grandeur of the room you're stood in. I'd like to see higher quality textures and many more items added to the tomb.",
            "review_score": "-1"
        }
    ]
}