{
    "app_id": 459940,
    "name": "Deer Man",
    "release_date": "2016-04-15",
    "developer": [
        "Red Mount Media",
        "Antarsoft"
    ],
    "publisher": [
        "Red Mount Media"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Captions available",
        "Partial Controller Support"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Adventure",
        "Exploration"
    ],
    "achievements": 4,
    "positive_ratings": 204,
    "negative_ratings": 77,
    "price": 1.59,
    "description": "Deer Man is a short Interactive Storytelling experience. You play as Jacob's memory, where you will have an incredible encounter with Deer Man &amp; the dark side of his love for the wildlife. If you love animals, this is for you!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/459940/header.jpg?t=1521811215",
    "minimum_requirements": "OS: Windows 8 (64 bit) Processor: Intel Core i3 Memory: 4 GB RAM Graphics: Intel(R) HD Graphics 4000 Storage: 900 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Im actually somewhat upset. The gameplay and environment were beautiful in their simplicity, but I cannot like the story. As a hunter, I have the depest respect for wildlife and this game guilts that way of life. I understand that not evey hunter is moral but this game made every hunter out to be a villian.",
            "review_score": "-1"
        },
        {
            "review_text": "A very nice small game being a mix of Year Walk, Moon Sliver, Home is Where One Starts and such. The graphics are minimalistic and seem lacking at first, but one gets used to them pretty quickly. What is really lacking in this game is its length. I am not relating here to the $/hour ratio, but to the story itself. It seems to use the smallest amount of words and elements possible, while it could really benefit from elaborating - the immersion would be more powerful, not just superficial. Still, might give you the chills if you're into those kind of games.  There is one detail, one minor part of the game which shows that the devs might achieve a real success in the future:    The scene in the end where you walk close to and between the deers. Although not afraid of you, they still are wild animals and you see it in the delicate cautious movements they make once you get closer to them - this is done perfectly [/spoilers]  ",
            "review_score": "1"
        },
        {
            "review_text": "This game is so beautiful! It's very short (20min) but totally worth it.  Recommend for those who want to chill, plus, the message is so simple but beautiful!   Congrats! Love it.",
            "review_score": "1"
        },
        {
            "review_text": "I played the non VR version. The game doesn't have bad ideas, it has some interesting moments/situations but it fails to transmit anything on the most dramatic parts and what it has to tell is simple and at some point predictable in my opinion, a proof of concept more than a game. It is not a dissaster, it deserves to exist but I can't recomend it.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is too short. It's too confusing to figure out what to do and where to go. There are 2 points in the game that if you make one mistake, you have to start the whole chapter again. There is nothing continuing to explain what the deal is with your uncle, the leg sticking out from the grave, and Emily. Also, the ending felt very rushed and the character's motives at the end are very rushed and kind of lame. The game is probably the most disappointing game I've played.",
            "review_score": "-1"
        },
        {
            "review_text": "A beautiful and simple story about the protection of wildlife and the love for it.  An overall inspiring message, gameplay wise: it takes a while to figure out what to do in the first chapter, however I didn't mind this since the atmosphere within the game is pleasant and intersting to walk arround in. It's a slow and short story, no too complicated 'puzzles', just a simple story, but I enjoyed every minute of it.  Overall 8/10, I would definately re-play it at some stage to relive the atmosphere.",
            "review_score": "1"
        },
        {
            "review_text": "A very pretty, and sometimes eerie, short story with a lovely soundtrack and gorgeous visuals, I really enjoyed it.",
            "review_score": "1"
        },
        {
            "review_text": "It was a short game, but had a good story. I think it was worth the two dollars,",
            "review_score": "1"
        },
        {
            "review_text": "While I like the art style, atmosphere, and narration, the story is too sparse to carry any real weight. Some plot elements feel like they come out of nowhere because of little development, and others seem to go nowhere, feeling hardly connected to the story at all. The world is tiny, and the game suffers for it. While the atmosphere is nice, a game this reliant on story needs better plot development and more substance than a campfire story.",
            "review_score": "-1"
        },
        {
            "review_text": "wish there were more games like this one. wish big companies make games like this so we can play longer than deer man. everything was perfect but playtime was short like 15 minutes but that's what it is. this is an indie game afterall and thanks to its developers. i dont get all these bad reviews arrgh.",
            "review_score": "1"
        },
        {
            "review_text": "The Deer Man gets straight to the point without seeming too short or too long. The atmosphere, the music, the story plays well with eachother to make a great game. In a sense, this game would not have the same impact if it was an hour long. The end does seem to be rushed due to the shortness, but if you get past that it's fine.  The only critisim I have is part of the story. The origin of the Deer Man should have been a hunter that hunted for sport or one of those who only hunt to get their antlers and leave the corpse. This would have made more sense with what lead him to become Deer Man. Him trying to provide food for his family that is trying to survive and stopping to brings you to think what happened to his family (Did he abandon them? Did they survive?). If Deer Man was a hunter for sport or only killed for antlers would have made the impact more affective and the origins wouldn't bring the obvious consequences that could have happened (and can explain why he turned his way quickly better).  As antlers were added, and an achievement is dedicated towards collecting all 20, the antlers on the last chapter will be the hardest! The only thing I have a problem with is that the anters are the same color as the cottage, which causes the player to have a difficult time to notice unless it was by accident (like I did). I do appreciate you don't have to get all in one playthrough.  I recommend this game as it is worth to pay a couple bucks. If this developer decides to make more games, I definetely will check them out.",
            "review_score": "1"
        },
        {
            "review_text": "When I start the ganme the camera just looks up and to the left, so I can't play. If any one can help that would be cool thanks",
            "review_score": "1"
        },
        {
            "review_text": "I wish there was a way to post these comments without a tumbs up or thumbs down ... but anyway.  I just really wish this game would have been tagged with a 'scary' or at least 'dark.' It was really creepy ... too creepy for me. That said, if that's what you like, go for it. It just wasn't my cup of tea ...",
            "review_score": "-1"
        },
        {
            "review_text": "Recommending this game is hard. It's like a final project that was done last minute. It hits all the criteria, barely.   Graphics- It's a $2 game.  Audio - It's a $2 game. Story - It's a $2 game. gameplay - It's a $2 game.  Why I don't recommend it, They ask for money and give you: -Black on white is an easy color scheme to make the game look polished and artistic, It's half-♥♥♥♥♥. - The game crashed after every chapter, or if I leave my computer for more than a couple minutes. - The writing is something out of creative writing 101. It has a plot arch. The character sort of has struggles and development. But, it's FAR from proficient. -The music is pleasant. Again, far from skilled.   Conclusion, and my main thought.  If you are going to ask people for money, your product should be professional. The game crashes; the product doesn't even work. The art was not thought out farther than what must be included. And the overall message of the game is juvenile and unprincipled. If you want to have a message and ask for money, then your message needs to be thought out, researched, vetted, and profound. If you want to say “please be kind to the animals” make your game free, or send out a f*****g post card.    ",
            "review_score": "-1"
        },
        {
            "review_text": "idk why everyone hates this game, the story is great even if its only 30 minutes long and the soundtrack provides an eerie ambiance like no other. it's great, 10/10 would play again/recommend",
            "review_score": "1"
        }
    ]
}