{
    "app_id": 460160,
    "name": "The Leisure of Grisaia",
    "release_date": "2016-05-17",
    "developer": [
        "Frontwing"
    ],
    "publisher": [
        "Frontwing USA"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Sexual Content",
        "Adventure",
        "Casual"
    ],
    "tags": [
        "Visual Novel",
        "Sexual Content",
        "Anime"
    ],
    "achievements": 0,
    "positive_ratings": 223,
    "negative_ratings": 21,
    "price": 1.99,
    "description": "This side story to &quot;The Fruit of Grisaia&quot; is a character-driven visual novel featuring some of the same characters. This time, it's Michiru who takes the lead role in this slapstick comedy. A laugh-out-loud side story detailing the Mihama girls' school hijinks.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/460160/header.jpg?t=1522228517",
    "minimum_requirements": "OS: Vista Processor: Intel Core 2 DUO equivalent or higher Memory: 1 GB RAM Graphics: 1280×720 DirectX: Version 9.0c Storage: 350 MB available space",
    "recommended_requirements": "OS: Windows 7/8.1 Processor: Intel Core 2 DUO equivalent or higher Memory: 2 GB RAM Graphics: 1280×720 DirectX: Version 9.0c Storage: 350 MB available space",
    "reviews": [
        {
            "review_text": " Pros  1.Great artwork 2.Funny Story with sexual humour 3.Nice soundtrack and ending theme.   Cons  1.No animation in this VN 2.Too short(can be finish in 40minutes) 3.Not worth the price dev ask for.   My conclusion and verdict:  Would I recommend The Leisure of Grisaia? As a huge fan of the Grisaia series it would go against my nature to not recommend The Leisure of Grisaia. Its short and it is cheap based on Steam DB it is only at $2.99 USD though do note that this particular visual novel may not last you any longer than 1 hours. But for the price it is extremely worth it for sure. Of course giving this a miss will not affect the main story line at all. 5/10  get this game on deep discount if you can,but please never pay the full price(you will regret it if you do) Note:i get this game around 60cents on winter sale discount at my region steam store page.",
            "review_score": "1"
        },
        {
            "review_text": "Having loved The Fruit of Grisaia, I bought this game knowing it would be way shorter but I still wasn't expecting it to last only 50 minutes. Good thing it only costs 2.99€ but that still seems a bit overpriced for me. Overall I enjoyed the game, it was refreshing to see every character once again but I'm kinda disapointed that Yuji didn't make an appearance. Michiru is still getting hiariously dissed by every other girl, Makina still doesn't chew her words and I laughed many times during these short 50 minutes. I was expecting way more, but I'd say the game was good. Good translation quality, I don't remember seeing any weird sentences.",
            "review_score": "1"
        },
        {
            "review_text": "-Finished in about 30 minutes or so. Bit of short to my liking. Then again I played the main game before this so I guess it is given. However it is funny 30 minutes, if you are slightly into perverted humor. Reminds a bit of the common route you got in Grisaia.   -You don't really see Yuuji on this one. But you get the somewhat cute and shy Yumiko, bold Sachi, bottle blond (clown) Michiru, the cutest Makina. Amane is also at the end but she isn't taking as much part into the activies.   - Game included 6 cgs or so and steam cards. You get nice chance of getting some decent anime backgrounds. I feel like Grisaias icons tend to be bit too small tho.  ",
            "review_score": "1"
        },
        {
            "review_text": "Grisaia literally being my favorite VN series, I actually started to tear up a little the moment I saw the title screen. It's been a while since I've gotten to read Grisaia in my own language and I got really emotional for a moment.Though, this is short I really, really enjoyed seeing Michiru interact with people on her own again. The part with Amane was especially nice to me since I don't believe you get to see those two alone ever in the other games just having a casual conversation. But, anyway, I really loved this and being the person I am, would've paid more even if I knew how small it was.",
            "review_score": "1"
        },
        {
            "review_text": "As a fun, little side story, this, 'game,' is worth the few dollars if you like the Grisaia series. However, if you're thinking that this is a game where you're going to spend a couple hours playing, you would be mistaken. This, 'game,' is really a very small side story that doesn't give the player anything more than 45 minutes of their favorite character(s) from Grisaia. This truly should be a DLC to the main The Fruit of Grisaia game instead of a complete, separate game. But if you have a few dollars to spend and you're really bored, this will definitely fill an hour of your life with some funny stuff.",
            "review_score": "1"
        },
        {
            "review_text": "Good translation by a Frontwing team, similar to Keostl and Sekai Project's excellent job on Fruit. A few mispellings here and there, but great work overall. Note - will probably want to have already played Grisaia (or at least started it) to fully enjoy this side material.  Story mainly revolves around Michiru, Makina, and Sachi. Yumiko and Amane also show up. Takes place after Yuuji comes to Mihama Academy, but he does not appear.  Length is a little under an hour. Leisure is similar to Fruit of Grisaia's common route in tone (comedic). Only real problem is that I wish they kept the font from Fruit's release. Also had one crash within 30 seconds of starting the story that fixed itself after relaunching.  Some sexual themes/humor, but no actual sex scenes.  Interface is essentially the same as Fruit's.   Overall, a nice short story worth a fistful of change if you like Grisaia and need a little helping while Rakuen/Eden finish up translation.",
            "review_score": "1"
        },
        {
            "review_text": " *PLEASE BE WARNED THAT THIS GAME IS EXTREMELY SHORT*",
            "review_score": "1"
        },
        {
            "review_text": "It's one of the worst filler ever.  I don't really understand how this *game* can have a good feedback. Cranky caracters talking non-sense for 40 minutes. No gameplay, no choice. Big engine for nothing. It's the same caracter as the anime, seem the same but they just forget all the deepness. This just show off silly caracters without any thinking around *hot topics*. No interresting story here.  If you buy this, turn you brain at *off* and laugh... if you can.",
            "review_score": "-1"
        },
        {
            "review_text": "Genre: Visual Novel (Kinetic = no decisions, player influence) This game is for: fans, people who like sexual jokes ( ͡° ͜ʖ ͡°)  Watch out, fanboys, this is an honest review. Do not read on if you want to downvote this review simply because I downvoted the game.   Bought and played this mainly due to the price of the main game 'The Fruit of Grisaia' and thought this tiny thing would get me excited for the main game. The Leisure of Grisaia is a very short visual novel without decisions, and therefore, no multiple endings, which gives you roughly 60 minutes of content. Being an additional chapter to the base game, the 2,99 proved to be very painful for me. In relation to the main game this is still cheap, but hey, man, please, it could have been a bit longer. The story centres on the free time of the main characters from the base game and their quest to create a new sport. All in all, the idea is decent and the jokes are fun sometimes, however, they can become a bit tiring since there're so many and the humour seemed forced to me at certain points. You can expect a hot closet scene and a lot of ♥♥♥♥♥ references - no idea if this is the case in the base game as well.  In a nutshell, I decided not to refund this because I wanted to support the developers. I'm not sure if that was a good decision in the end, but I've got this now. I'ma buy the main game on sale, but the Leisure of Grisaia has definitely not got me excited for the main game.   Sadly, the value for the fans isn't enough to give this a thumbs up in my opinion. Fans will buy this anyway, but you've been warned.",
            "review_score": "-1"
        },
        {
            "review_text": "i mean not gonna lie its lewd and if you like lewd and girls then i guess this game is for you.Personaly i felt like it had an awkward aura but some bits were funny soo...",
            "review_score": "1"
        },
        {
            "review_text": "If you enjoy the characters of the Grisaia series, then you will certainly enjoy this little spin-off.  The novel itself only lasts about 30 minutes, but it is filled to the brim with inside-character jokes that adds a little more personality to the already flushed out cast of the Grisaia series.  This release was handled entirely by Frontwing themselves, which was a pleasant surprise considering Sekai Project is handling everything else regarding the Grisaia series.  My suggestion? If you've played the Grisaia series and want to help support Frontwing in their future endeavours, then purchase this novel.  If you haven't played the Grisaia series, I suggest you avoid purchasing this; as most of the context and character values would be out-of-context and you will not understand the character tropes as well as you should.  If you haven't played the Grisaia series but you purchased this anyway... then I hope you enjoy this silly little visual novel and strongly recommend checking out the rest of the novels in the series. They're much more serious than this would leave you to believe.",
            "review_score": "1"
        },
        {
            "review_text": "Its just an small filler to your base Fruit of Grisaia. With a nice song for ending and background. Coming back to content 45 minutes of scenes showed up basicly on store page. If you want to experience crazy day with all Mihama girls then check it. Silly likeable stuff.",
            "review_score": "1"
        }
    ]
}