{
    "app_id": 460580,
    "name": "Star Chart",
    "release_date": "2016-09-05",
    "developer": [
        "Escapist Games Ltd"
    ],
    "publisher": [
        "Escape Velocity Limited"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Simulation"
    ],
    "tags": [
        "Simulation",
        "VR",
        "Space"
    ],
    "achievements": 0,
    "positive_ratings": 10,
    "negative_ratings": 10,
    "price": 6.99,
    "description": "Star Chart is the ultimate Virtual Reality experience: your very own Planetarium! Explore the solar system and night sky in a beautiful and accurate real-time simulation.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/460580/header.jpg?t=1473076837",
    "minimum_requirements": "OS: Windows 7 Processor: Intel Core i5 equivalent or greater Memory: 4 GB RAM Graphics: GeForce GTX 460 / Radeon HD 6770 or equivalent DirectX: Version 11 Storage: 450 MB available space Sound Card: n/a Additional Notes: A Vive or Oculus Rift and recommended spec PC required for VR",
    "recommended_requirements": "OS: Windows 10 Processor: Intel Core i5 equivalent or greater Memory: 8 GB RAM Graphics: NVIDIA GTX 970 / AMD R9 290 equivalent or greater DirectX: Version 11 Storage: 450 MB available space Sound Card: The best you can get ;) Additional Notes: A Vive or Oculus Rift and recommended spec PC required for VR",
    "reviews": [
        {
            "review_text": "I was expecting a VR Star Chart which is one of my wishes for a long time now. Unfortunately, at least in its current form, this is NOT what I was expcting for the ff reasons:  1) Constellation overlays in 'Earth Sky' mode is distracting-- and there is NO WAY to view the sky 'raw' without these overlays as you gaze at starfields 2) No representation of 'ground'-- it shows the sky in 2 halves of the celestial sphere-- with NO OPTION of blocking out the 'lower half' which you cannot see 3) The night sky is so damn BRIGHT!! No immersion of being in a field viewing a starry sky on a dark dark night 4) No option for setting location or of setting time or of actually showing the night sky move as time passes  I suggest the devs go see 'Stellarium' for PC-- and convert some of that apps feature to VR in Star Chart. Maybe it will be worth for me to re-buy it by then. But, right now, this is a lost opportunity to be a serious tool for the 'arm chair' VR astronomer.",
            "review_score": "-1"
        },
        {
            "review_text": "Very disappointing - if i knew how to get my money back I would  Frankly this product is a long way from fulling the requirements of a VR planetarium   The Solar system demo provided free in 'The Lab' demo is graphically superior and more fun  Do not waste your money on this in its current form",
            "review_score": "-1"
        }
    ]
}