{
    "app_id": 460850,
    "name": "Allumette",
    "release_date": "2016-10-13",
    "developer": [
        "Penrose Studios"
    ],
    "publisher": [
        "Penrose Studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Partial Controller Support"
    ],
    "genres": [
        "Casual",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Casual",
        "VR"
    ],
    "achievements": 0,
    "positive_ratings": 443,
    "negative_ratings": 15,
    "price": 0.0,
    "description": "Allumette tells a story about love, sacrifice and a deep bond between a young girl and her mother.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/460850/header.jpg?t=1476389190",
    "minimum_requirements": "OS: windows 7 Processor: Intel i5-6400 / i5-4590 or greater Memory: 8 GB RAM Graphics: NVIDIA: GTX 1060 / GTX 970 / GTX TITAN or greater. | AMD: RX 480 / R9 390 / R9 290 or greater DirectX: Version 11 Storage: 2 GB available space",
    "recommended_requirements": "OS: windows 10 Processor: Intel i5-6400 / i5-4590 or greater Memory: 8 GB RAM Graphics: NVIDIA: GTX 1060 / GTX 970 / GTX TITAN or greater. | AMD: RX 480 / R9 390 / R9 290 or greater DirectX: Version 11 Storage: 2 GB available space",
    "reviews": [
        {
            "review_text": "Just what I was hope VR would be used for. An awesome cross between cgi and claymation. It's a simple 'experience' but I think it's an area that VR is going to be great in.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic experience! The intro was very creative, and the story even better. VR Storytelling done right.  ",
            "review_score": "1"
        },
        {
            "review_text": "Neat little storytelling experience, feels like a glimpse into the future technology wise. I wonder if this form of movie-style entertainment will have it's breakthrough some day, it really is a new style of telling stories to the audience.",
            "review_score": "1"
        },
        {
            "review_text": "Another great example of an enjoyable VR animation experience that lets you view a stop motion animation style story from within the artist created world. I find being able to move around and getting up close to the action a unique experience that can't be duplicated in any other entertainment format. Nicely done animation, art direction and music that is worth your time and being free the price is certainly right. Would love to see a Laika stop motion film presented this way but seated would be perferable for a longer story. So much potential in VR entertainment.",
            "review_score": "1"
        },
        {
            "review_text": "Very touching VR short movie. The fact that it's free makes it a must-get.",
            "review_score": "1"
        },
        {
            "review_text": "brings a new dimension to story telling. these type of titles take VR into new areas most of us never even considered when we bought our VR headsets",
            "review_score": "1"
        },
        {
            "review_text": "7/10 - Interesting experience.",
            "review_score": "1"
        },
        {
            "review_text": "Such a lovely experience the little people are so cute I thought this was really good. Especially for free!",
            "review_score": "1"
        },
        {
            "review_text": "A fantastic little gem!!  And it's free. Lovely story, great art and music.  Loved it and I know a few little ones that will love it too.  Don't miss this!! Good games are great, of course, but when I watch and interact with a piece like this it makes me realise what VR can be all about and what it can achieve.  Well done devs!!",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful and free experience. It's based on a classic story about a girl who is freezing and lighting her matchsticks.",
            "review_score": "1"
        },
        {
            "review_text": "Sweet animated story, no motion sickness (since there's no movement of the player.) As others have said, its one of the best looks at what storytelling can accomplish with VR. Worth the time to download and watch. I almost feel bad that it's free (at the time of release).",
            "review_score": "1"
        },
        {
            "review_text": "Great short vr film. Definitely worth the free download. It's a cool, new, and unique experience considering traditional films are flat. Room scale is such a great tool for experienceing a story.",
            "review_score": "1"
        },
        {
            "review_text": "When I bought the Vive, I didn't realise there was going to be so many experiences like this. I really liked Allumette. The only fault I can find was the ending.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful. The solidity of the cartoon characters in VR made the story even more affecting. I do hope other storytellers take up this 'tabletop' style. I'll be happy to pay for their next production.",
            "review_score": "1"
        },
        {
            "review_text": "This is an adorable little no-dialog story about a girl and her mother. Very short, but very powerful emotionally. It is of course not a 'game' in the sense that you don't do anythig other than observe, but that is more than enough. I would actually love to see feature length full room vr movies like this in the future, could be a cool concept.  My only real gripe about this title is the scenes that take place on the bridge, everything else is smooth as butter, every other vr title I've played runs fine, but once it gets to the bridge area it becomes a little laggy and jittery, almost to the point of motion sickness. Maybe it's just me.  Other than that, if you have a headset you should check this out. It's free so why not?",
            "review_score": "1"
        },
        {
            "review_text": "A lovely story in three dimensions. It has some graphical issues though. I'm not sure if it was hardware limitations.  It sucked me right in. It's a floating city in the sky and sometimes when some prop would fall off the level, I tried to catch it, then realising I was just watching a movie. A free and pretty good example on how VR stories could be told.",
            "review_score": "1"
        },
        {
            "review_text": "A movie short film in VR.",
            "review_score": "1"
        },
        {
            "review_text": "More like this please, the vr was put to good use enriching the storytelling in a satisfying way.",
            "review_score": "1"
        },
        {
            "review_text": "A very well made short that was fully immersive. I truly felt for these characters and was emotionally drawn into the story from the first frame. I can't wait to see this company's next project. I highly recommend Allumette to anyone wanting to experience what Virtual Reality can do with immersive movies.",
            "review_score": "1"
        },
        {
            "review_text": "Crisp and stunning visuals, but the unnecessary voice acting (Hmm ? Hmm ! Hmmmmm ??) deters from the experience and the pacing needs work. I didn't finish watching it because of these two things, but would be willing to give it another try if it was edited. I sincerely hope this helps.  [edit] To be more precise : I read that the total playtime is about 20 minutes. As far as I am concerned I think I lost interest somewhere around the 5 to 10 minutes mark.",
            "review_score": "-1"
        }
    ]
}