{
    "app_id": 460910,
    "name": "A-Gents",
    "release_date": "2016-04-20",
    "developer": [
        "phime studio LLC"
    ],
    "publisher": [
        "phime studio LLC"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Local Co-op",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Pixel Graphics"
    ],
    "achievements": 17,
    "positive_ratings": 96,
    "negative_ratings": 23,
    "price": 3.99,
    "description": "A-Gents is the squad of highly trained operatives and bounty hunters. Join Sean and Emma in this dynamic, non-stop-action game. Storm the compounds of contraband dealers and smugglers around the globe, and collect goodies.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/460910/header.jpg?t=1525879445",
    "minimum_requirements": "OS: Windows 7, 8, 10 Processor: Dual core 2.3 GHz Memory: 1 GB RAM DirectX: Version 9.0 Storage: 200 MB available space",
    "recommended_requirements": "OS: Windows 7, 8, 10 Processor: Core i3 @3.2 GHz Memory: 2 GB RAM DirectX: Version 9.0 Storage: 200 MB available space",
    "reviews": [
        {
            "review_text": "A-Gents is a great shooting game, the game has a number of roles can choose. The game has a variety of weapons can be used, such as assault rifles, grenades, explosives, knives variety of weapons to choose from.   The game has many tasks can be carried out, task of the game in some houses there are hostages, and you can use dynamite to blast the house, to rescue the hostages really great success. In particular task, you can in the helicopter use submachine gun fire, really feel great.   This is a pixel action and shooting game, the operation is very easy to use. Hope that future updates can add more new roles, it would be great, I love this game :)",
            "review_score": "1"
        },
        {
            "review_text": "This game has made my dream come true. When i was a litle kid, my parents told me that i can be anything i want. I wanted to be a Rambo, but all of my childhood friends said that's just a dream and will never come true.  But u know what? Screw them, I became Rambo in this game and i like it.  Pros : -Can kill barrels. more barrel kills, more score. YEAH -Reflect grenade by shooting them -Deflect enemy bullet by shooting them -Dream Come True -Huge dynamite AoE  Cons : -Need more characters  11/10 would be a Rambo again",
            "review_score": "1"
        },
        {
            "review_text": "Simple and fun game that can be played for a few minutes to an hour. The levels are unique and fun, with cool music to get you pumped. The graphics are great, especially the satisfying kill animation. The characters and weapons you get are okay-ish but can be improved, since both the characters and weapons just play alike. Other than that, fun game.",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        }
    ]
}