{
    "app_id": 460940,
    "name": "Father´s Island",
    "release_date": "2016-06-21",
    "developer": [
        "Homegrown Games"
    ],
    "publisher": [
        "Homegrown Games - a HRMC Label"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Adventure",
        "Horror"
    ],
    "achievements": 0,
    "positive_ratings": 29,
    "negative_ratings": 18,
    "price": 3.99,
    "description": "Father´s Island is a mystic, surreal visual novel / playable B-Movie in a 3D open world, with hundreds of buildings, structures and relics, wildlife and strange machinery. Combining dense atmosphere with mystery, horror &amp; exploration!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/460940/header.jpg?t=1540845089",
    "minimum_requirements": "OS: Windows 7, 8, 8.1 or 10 - 64bit required Processor: I5 min. 2.6 GHZ or better Memory: 6 GB RAM Graphics: Nvidia 950 or better DirectX: Version 11 Storage: 8 GB available space Sound Card: DirectX compatible",
    "recommended_requirements": "OS: Windows 7, 8, 8.1 or 10 - 64bit required Processor: I7 3.5GHZ or better Memory: 8 GB RAM Graphics: GTX 970 or better DirectX: Version 11 Storage: 10 GB available space Sound Card: DirectX compatible",
    "reviews": [
        {
            "review_text": "As a Gameguru user myself, I was very excited to play Father's Island. First thing I noticed was the very calm and nice atmosphere. Tons of work have been put into this game. You can see that at every corner. As far as the story goes - it was definitely a surprise. I like the voice of the character and the one liners he throws at you. Some scenes are quite disturbing - all I say is 'the sheep' There are multipe endings wich are very different.   The cutscenes are pretty interesting and I like them! The Performance has been improved now and I can say I got 25+ fps at least. That's okay for me, because I know that most part of it is engine related. On the other hand, we have a huge island, filled with insane amount of detail. What I noticed as well are the awesome hills and mountains. I know how the engine works, and I was really impressed with the way the mountains are made. Overall, the game looks pretty nice! Definitely keeps me motivated to see more and explore further.  At the bottom line, I can say that this game has:  - Very nice environment and much detail.   - A very cool music system wich I never saw before. It switches dynamicly. The music itself is very nice and calm.   - Great atmosphere. It really makes me feel that I am on a huge, lost Island, in the middle of nowhere.  - surprisingly deep story. I wasn't expecting much at the beginning, and it turned out to be pretty cool story, that even makes sense!  - Only bad thing are the performance issues ( wich have been improved since my last session ), and other technical issues like greenscreen after loading, wich forces you to restart the game and wait another couple of minutes to load.   Overall, I totally recommend this game. Take a cup of tea, coffee or like me, a nice hot chocolate and enjoy this game.",
            "review_score": "1"
        },
        {
            "review_text": "Fathers Island is one of the weirdest games you will ever play. A relatively short game in which you can look forward to an evening full of weird tales, odd characters, insanity and ...strangely relaxing gameplay.  The game is offensive to many and that is what makes it so adorable! There is no place its afraid to go and while the story may be delivered in a minimalistic way, it manages to hold your attention. If you have no idea what this is: Picture an exploitation movie version of 'Dear Esther'... less introspective and elegic drama and more bestiality!  Do note that this is a 3d adventure and not a shooter like previous homegrown games  Just try it! Its currently 5 bucks...so you won't have to make any tough choices like 'Do I get this game or a hooker' as you do with every new EA release...you dirty ♥♥♥♥♥♥♥! :D   ",
            "review_score": "1"
        }
    ]
}