{
    "app_id": 460920,
    "name": "Steep™",
    "release_date": "2016-12-02",
    "developer": [
        "Ubisoft Annecy",
        "Ubisoft Montpellier",
        "Ubisoft Kiev"
    ],
    "publisher": [
        "Ubisoft"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Online Multi-Player",
        "Steam Trading Cards",
        "In-App Purchases",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Sports"
    ],
    "tags": [
        "Sports",
        "Open World",
        "Multiplayer"
    ],
    "achievements": 0,
    "positive_ratings": 7802,
    "negative_ratings": 2603,
    "price": 25.99,
    "description": "Ride a massive open world across the Alps, where the powder is always fresh and the run never ends. Defy and master the mountain alone or with friends on skis, wingsuits, snowboards and paragliders. Record and share your best stunts.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/460920/header.jpg?t=1544441189",
    "minimum_requirements": "OS: Windows 7 SP1 or Windows 8.1 or Windows 10(64 bit versions) Processor: Intel Core i5 2400S at 2.5 Ghz or AMD FX-4100 at 3.6 Ghz Memory: 6 GB RAM Graphics: GeForce GTX 560TI or Radeon R7 260X DirectX: Version 11 Network: Broadband Internet connection Storage: 25 GB available space Sound Card: DirectX® compatible sound card with latest drivers Additional Notes: SUPPORTED VIDEO CARDS (at time of release): NVIDIA GeForce® GTX660 or better, GeForce® GTX700/900/1000 series, AMD Radeon R9 260X or better, AMD Radeon R9 300 series, Fury series. Laptop versions of these cards may work but are NOT officially supported. For an up-to-date list of supported chipsets, please visit the FAQ for this game on our website: <a href=\"https://steamcommunity.com/linkfilter/?url=http://support.ubi.com\" target=\"_blank\" rel=\"noopener\"  >http://support.ubi.com. PERIPHERAL SUPPORTED: Windows®-compatible keyboard and mouse required, optional controller",
    "recommended_requirements": "OS: Windows 7 SP1 or Windows 8.1 or Windows 10(64 bit versions) Processor: Intel Core i7 3770K at 3.5 Ghz or AMD FX-8350 at 4.0 Ghz Memory: 8 GB RAM Graphics: GeForce GTX 970 or Radeon R9 390 Network: Broadband Internet connection Storage: 25 GB available space Sound Card: DirectX® compatible sound card with latest drivers Additional Notes: SUPPORTED VIDEO CARDS (at time of release): NVIDIA GeForce® GTX660 or better, GeForce® GTX700/900/1000 series, AMD Radeon R9 260X or better, AMD Radeon R9 300 series, Fury series. Laptop versions of these cards may work but are NOT officially supported. For an up-to-date list of supported chipsets, please visit the FAQ for this game on our website: <a href=\"https://steamcommunity.com/linkfilter/?url=http://support.ubi.com\" target=\"_blank\" rel=\"noopener\"  >http://support.ubi.com. PERIPHERAL SUPPORTED: Windows®-compatible keyboard and mouse required, optional controller",
    "reviews": [
        {
            "review_text": "The game was fun for an hour. Definitely not worth £40. Also, I found out after buying the game that there is no offline mode. So if you have sub-par internet, you can't play. I made the mistake in not checking, but for a game to not have an offline mode for the price it's at is really bad. It is actually advertised as having singleplayer on the store page, which is misleading.  I don't recommend this game if your internet isn't very good.   EDIT: To be more clear, the game is really fun in smaller doses. If you play a lot in one sitting, it'll get boring. The animations and the graphics are all really good. The map is also really great, too.  What ultimately let it down for me is that it has no offline mode, so if your internet isn't so great, you'll be disconnected and can't play. Games like Skate allowed you to play offline by yourself so I'm not sure why I'd need an internet connection to play this. THAT'S why I DON'T recommend it.",
            "review_score": "-1"
        },
        {
            "review_text": "super relaxing game snow boarding down a mountain jumping off cliffs and wondering how many of these falls a human would not survive.",
            "review_score": "1"
        },
        {
            "review_text": "Gorgeous game. Extremely fun with friends. Zero loading screens.",
            "review_score": "1"
        },
        {
            "review_text": "Very fitting name given the price of the game.   It's fine and fun, but ultra repetitive. Make no mistake, the only difference in the different types of way to go down the mountain are in terms of speed, otherwise, it's a pretty shallow experience.   Skis- Really fast Snowboard - pretty fast Wingsuit - average speed Parachute - ridiculously slow  I gave it a good shot but after a little more than an hour I could feel that this was going to be one of those games that after the initial buzz wore off, I'd never go back to it again.   BTW, ran at a solid 60 FPS, with everything maxed and shadows on low (I always set shadows to low in every game) and I have a very average AMD 8320, 8gig ram and a Geforce 1060",
            "review_score": "-1"
        },
        {
            "review_text": "It's skate 3 but snow",
            "review_score": "1"
        },
        {
            "review_text": "Steep is my dream snowsports game. Being an experienced skier myself I was immediately hooked when I bought this game.   Pros: Amazing graphics Amazing Music  Funny voice actors Great Gameplay Challenges... Love them! Story  Cons: Can be glitchy at times Price  Personally I think that the 60 USD I paid for this game is worth it, however I can expect others to not get its money worth, if it drops to 40, get it. Steep can get repetitive, however players can easily avoid this by constantly exploring new locations around the mountain, its all unique!  Overall Steep is an amazing snowsports game that is hard to put down, theres just so much to explore and it has me hooked, easily one of my favourite games on steam and I don't say that lightly  9/10",
            "review_score": "1"
        },
        {
            "review_text": "Outside of the time shown, I've also played in two betas. The closed beta at the start of November, and the last open beta a week or so ago.  While I can certainly argee with the comments about the game not being worth the full price tag, it's a decent enough title to just blow an hour or two on. Either to attempt the runs left by the developers, or to just unwind and chill out or go as mental as you want.  The controls are a little confusing if you're coming off titles like the SSX series, and the G-Force system makes the later trick based challenges a pain given the seemingly random nature of it, but outside of that and a bit of practise, you can pull off some pretty epic jumps.  The only real down sides I can think of right now, outside of the price, is that I don't agree with the hard limit of four players to a lobby, if the lobby system is even working. I spot the odd player or two spawning somewhere near me, and then they either vanish, or spend most of the ten minutes I can see them 10k meters away. Add to that and the need to physically be need them to invite to the party, and I seriously question why Ubisoft did it this way. There also seems to be a few issues with inviting friends, but I cannot comment on that due to no-one else playing this.  Overall, I'd wait for a price drop or more content before pulling the trigger. It's rare enough for games like this to come out on the platform, and Steep certainly is worth trying, outside of a few questionable design choices.   I mean, currently your only other option is SNOW. And I don't think I need to explain the differences there, do I?",
            "review_score": "1"
        },
        {
            "review_text": "Not worth the 60 euro's. I would recommend buying this when it is in sale.",
            "review_score": "-1"
        },
        {
            "review_text": "I really don't know how to feel about this game  on one hand, it's beautiful and fun to explore and generally just pretty cool  on the other hand, it really shoves 'haha sports' ♥♥♥♥ in your face and the trick system and momentum feel super ♥♥♥♥ing weird  music is aight some of the time  overall unless you're interested in exploring a snow covered mountain i wouldn't recommend buying it until it's like 30 bucks or something  but if you want that then i don't think there's pretty much any other options that are pretty like this so uh go for it",
            "review_score": "1"
        },
        {
            "review_text": "  I can only imagine the snow. Steep gave me a haven to experience it. It's the best gift ever. :)",
            "review_score": "1"
        },
        {
            "review_text": "Been looking for a game like this for years Thank you ubisoft",
            "review_score": "1"
        },
        {
            "review_text": "its cool, i love it",
            "review_score": "1"
        },
        {
            "review_text": "Well lets talk about Steep,  I totaly love this game. Its amazing! Im do skiing and snowboarding in real life thata why this game is a perfect fit for me. I dont have this many hours in the full game because i just bought it but they are gonna count up. The gameay is really smooth with some little bugs that are rlly funny to see.  Pros: Huge map Enough customization  Fun/hard challenges You can group with friends Alot of level unlocks Good graphicd  Cons: Its always online The people u meet dont stay for long unless they group uo with you  Well i hope you want to buy this game aswell. If you do feel free to add me.on steam to ride some white powder togheter. And i wish u all a nice day.",
            "review_score": "1"
        },
        {
            "review_text": "I really like this game. The machanics are good, and I enjoy exploring the mountain. I see myself playing this game often in short bursts. Highly recomended.",
            "review_score": "1"
        },
        {
            "review_text": "This is a wonderful, resfreshing, fun, and long-lasting game. But it has a select Audience: extreme sports video game enthusiasts. And it requires an open mind in regards to learning a new controller/control paradigm. (Once you get it, its very fun and intuitive.) If you are Ok with those 2 comments, the price will be well worth it -- I promise.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome... love the deer head!",
            "review_score": "1"
        },
        {
            "review_text": "I learned that skiing can be accomplished on my chair, sitting down, in my house.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing. The graphics are great and all the sports are so fun to play (except mabey paragliding). If you have friends who have this game, it will be even more fun. The challenges are hard but rewarding and the items that you can unlock make you want to grind the game even more. The only thing that I would say bad about the game is the price. I would say if they made it £29.99 then lots more people would be willing to get it straight away. But that shouldn't be a problem soon in a couple weeks since the price will probly go down in the Christmas Sale.  This is why im giving this game a nice 9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "It's beautiful and a ton of fun, I wish it had more variety though and some actual parkish areas rather than just a huge mountain range. Would recommend it only if you very much enjoy games like Skate.",
            "review_score": "1"
        },
        {
            "review_text": "I was skeptical about this game after reading tons of mixed reviews but ultimately am glad I bought it. It starts out very basic and I started to get bored until I explored more and started to understand the Gforce and physics involved. They kind of throw you in the game without too much direction at first. Most importantly this game is NOT SSX and is NOT trying to be. SSX = Tony Hawk type of game with endless tricks and ultra combos. This game is more on the Skate side of things. It has that stiffer feel that skate has and you need to time your spins and flips, because of this it can be both very challenging and rewarding. Overall I would reccomend this game but also try to buy it on a sale because of course there is a season pass to charge you more.",
            "review_score": "1"
        },
        {
            "review_text": "best extreme sports ever love it have a lot of fun, specially with friends",
            "review_score": "1"
        },
        {
            "review_text": "This game is absolutley stunning! The game itself is beautiful when it comes to the graphics and the gameplay brings me back to the days of Skate. Highly reccomend if you are looking for a fun casual game to past the time while you shred some slopes or glide down the side of a mountain.",
            "review_score": "1"
        },
        {
            "review_text": "  Fun game and really beautiful  Unfortunatly there are some issues that need to be fixed and if i wouldn't enjoy the game so much i would not recommend this now to the main point of this entire post.      Pros+  It has a big and wide area to explore and go to.    It's realistic when it comes to the stunts itself and the graphics are beautiful.    The mountain is highly detailed.   Cons-      From time to time it can be very buggy    The gravity fails in the game sometimes and keeps pulling you to either left or right (and sometimes into a mountain)    With that said the game mechanics are poor    Sometimes when i try to join my friend it fails on us sometimes even though we play with different people.     Paragliding is kinda boring and broken.    What could be improved~  Well you could start with the game mechanic first and and then fixing all the bugs because it is extremly annoying.  Then i would love to see a DLC with snowmobiles and mountain climbing, it would bring more fun to the game and i've seen a lot of people suggesting this.  I can't really come up with something more but iif i do i'll edit this.   // L  ",
            "review_score": "1"
        },
        {
            "review_text": "The 'skate' of the the winter lands. I thoroughly enjoy the wingsuit parts and the snowboarding / skiing part. I wish there was grinds and jibs included in the game but beside the added technicals they can add later. They made a stunning product. The game is undeniably beautiful on ultra settings. The only thing I can really call out for a flaw is the UI occasionally will go ape ♥♥♥♥, make sure you have the graphics drivers up to date.",
            "review_score": "1"
        },
        {
            "review_text": "I played for a few weeks, and i loved it. Now it won't launch. Crashes everytime I try to launch the game.  Looks like I am not the only one having incompatability with graphics cards.  Ubisoft customer support is so bad that he told me to try it in 'offline mode' LOL there is no offline mode, i wish there was. The email followup then told me that people with Radeon or Nvidia(everyone) are having problems so you should remove the Radeon or Nvidia hardware from my computer to solve the problem. HAHAHAHA Ubisoft is so out of touch, why do they even release games on PC if they dont even try to be compatable with the most common graphics cards that are in every computer.  Getting a refund soon if it doesnt get fixed, but thats not what i really want, I want my game back!",
            "review_score": "-1"
        },
        {
            "review_text": "Im having a lot of fun with this game. Ive got about 100 hours played on SNOW. SNOW is extremely fun, but I feels this game will offer just as many hours of fun that I had in SNOW. SNOW took me roughly 20 to 30 hours to get the mechanics down pretty smooth and true, its hard to do the same with this game due to the spin restriction if you do not have enought air for the trick. Turning it off helps, but dtill have restrictions. All in all, good game",
            "review_score": "1"
        },
        {
            "review_text": "Been looking for something like this for quite some time now. And at last someone created something thats instead of doing it good, making it great. The open world, the challenges and the diffrent sports, its hard to stop play! Only thing i think is negativ, i really would see a splitscreen option, since my better half and i want to play together on the tv for example, now we have to do it one at the time and that sucks a bit tbh! otherwise best game so far in this genre!",
            "review_score": "1"
        },
        {
            "review_text": "Perfect chillin game. This piece is SENSATIONAL, just buy it and the season pass. It is one of the best games that Ubi EVER made. Plus it is the first time for Ubi server to actually work.   HOWEVER, if you hate to ski, buy Rainbow 6 Siege instead.",
            "review_score": "1"
        },
        {
            "review_text": "Its really good",
            "review_score": "1"
        },
        {
            "review_text": "Great Fun To Play Open World Extreme Sport Game",
            "review_score": "1"
        },
        {
            "review_text": "Steep is a phenomenal game. The gameplay and the mechanics are amazing and very fun and satisfying. Also the game looks amazing on pc. I max it out on my GTX 1070 and get over 100 fps. Ubisoft really stepped themselves up for this game. Many PC ubisoft games in the past have been ♥♥♥♥ but not this one. I give it a solid 8/10, nice job Ubisoft.",
            "review_score": "1"
        },
        {
            "review_text": "After playing the alpha and beta and each version of the game improving on the last I am not dissapointed by the full release. Steep is a euphoric game, and can be enjoyed however you want. The feel of going downhill is awesome and the feel going downhill very fast is even more awesome! Paragliding around mountains and using updrafts to reach unexplored locations is sublime and is a welcome change of pace (plus you can then wingsuit back down the mountain and do it all over again!).  The trick list is a bit limited however the variety of sports avaliable makes up for it and the scenerey you ride over is always changing so you never have the same ride twice. As others have said, it feels a lot like Skate 3 so if you enjoyed that game then you know a lot of what to expect.   Only issues I have with it are occasional physics engine glitches and non-game play issues such as wanting a continuous soundtrack rather than having it restart every time you restrart a challenge. But these are very minor complaints compared to the fun I have had so far!  ",
            "review_score": "1"
        },
        {
            "review_text": "Snow, fun, mountains, what else do you want?",
            "review_score": "1"
        },
        {
            "review_text": "you can dab in this game  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful game, beautiful physics, relaxing af, great multiplayer, lots of missions, friggin amazing graphics and runs so smooth. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "the controls are absolute murder for me... game still quite impressive and attractive",
            "review_score": "1"
        },
        {
            "review_text": "Wanted to like this game, really, really badly. I spent $40 on this, only to have it refunded before my half hour came up. Yes, my point may be invalid because i didn't have much time with it. However, I couldn't get through it. The controls are clunky and all you're doing is going down a hill the entire time. There's nothing in this game that really grabbed me. Yeah, I could've done more research and waited to get longer in the game, but I didn't really want to play it anymore. I hate games that you have to force yourself to play. This would have been one of them for me.  I'm sure others would like this game, but it's not for me.",
            "review_score": "-1"
        },
        {
            "review_text": "Beautiful game, beautiful physics, relaxing af, great multiplayer, lots of missions, friggin amazing graphics and runs so smooth. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Ragdoll physics are amazing. Character customization is alright. Controls are very good but not amazing. Exploring the map is a little easy and map lacks detail for it's rather small size.  Wingsuiting:9/10 Snowboard:8/10 Skiing:7/10 'my favorite but buggy' Paragliding is pointless and boring.  8/10 I love this game.with my heart but still not nearly perfected  ",
            "review_score": "1"
        },
        {
            "review_text": "Yeah! This is our place, our time and our world for the taking!!!",
            "review_score": "1"
        },
        {
            "review_text": "Ragdoll physics are amazing. Character customization is alright. Controls are very good but not amazing. Exploring the map is a little easy and map lacks detail for it's rather small size.  Wingsuiting:9/10 Snowboard:8/10 Skiing:7/10 'my favorite but buggy' Paragliding is pointless and boring.  8/10 I love this game.with my heart but still not nearly perfected  ",
            "review_score": "1"
        },
        {
            "review_text": "Sonny Bono's How Not To Die Simulator 2016.  But seriously, a large bulk of the challenges in this game require you to dodge and maneuver through patches of trees which require more than just quick reflexes. It borders on the need for psychic abilities.  When it comes down to it though, that's just the beginning of a list of design flaws that this game has. It's amazingly polished, has a ton of content, and really looks like a $60 game on the surface, but when you start to dig in, you realize that the frustrations do not make it worth even half that amount. Some of the challenges require you to get from point A to point B with no set time limit. However, if you find yourself missing a certain line, get ready to walk (and make sure to tell your family to start dinner without you, because it's going to be a while).  If you're also coming into this game looking for a fine-tuned freestyle experience, look elsewhere. Steep is very obviously aimed at people just looking for the thrill of the ride and the exploration. Tricks are very simplistic and do not have a good enough amount of variations. If you're looking for a freestyle snowboarding experience, you're much better off going with Mark McMorris Infinite Air . It's definitely much less polished than Steep and has a fraction of the content, but at the end of the day, the snowboarding just feels so much better. Put both games at the $20 price point, and I'd gladly take Infinite Air over Steep any day.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is awesome but sadly was only able to play once . It now crashes everytime I try to open it. Hopefully you guys can help me soon.",
            "review_score": "1"
        },
        {
            "review_text": "A serious contender for GOTY. Steep also has the potential to save gaming from dying.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a lot of fun to start off. The game is fantastic for skiing, snowboarding, and squirel suit flying. Something that people may not enjoy as much in this game is paragliding. At first when playing the game i didnt really enjoy that aspect either but the more I paraglided the more I enjoyed it because they have some chalenging fun chalenges for paragliding. Overall is the game worth $60? If buying this game for that amount of money don't do it go on sale but if its within your disposable income I would reccomend it if you in any way like snowboarding games because steep takes those genres to the next level. Also the sound track for the game in really good. You can easily space out and relax for hours at a time just messing around in this game.",
            "review_score": "1"
        },
        {
            "review_text": "There's just nothing to do. Going down the same hill, jumping off the same cliff. Plus the spins and flips are auto controlled and those are the only tricks you can do besides grabs.",
            "review_score": "-1"
        },
        {
            "review_text": "Very fun with friends, just riding or trying to hit them on the ground with your wingsuit.  Gotta say i have missed a good snowboard game ^^",
            "review_score": "1"
        },
        {
            "review_text": "This game if fun for the first 4 hours then it sucks.",
            "review_score": "-1"
        },
        {
            "review_text": "I'm SOOOO glad this turned out to be awesome. I played the beta and was instantly hooked, I prayed that it would stay the same when this got released.  Awesome graphics, simple handling controls (for me at least), challenges are great for improving tricks and handling.  Just walking on foot is enjoyable too, makes you appreciate the view.  If you're into any sorts of sports game, you should give it a try.",
            "review_score": "1"
        },
        {
            "review_text": "If you like winter sports, this is the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "i may not have played it mutch but i really like the game alot, this is a reccomend for all of you!      (sorry for my bad english im not english)",
            "review_score": "1"
        },
        {
            "review_text": "wait till the physics engine is fixed and it will be worth the 60$ right now its not even worth the sale's price of 40$, i did play in the open beta but from that to launch its almost the exact same, with the exact same problems, the only new stuff seems to just be the other mountains with their routes.",
            "review_score": "-1"
        },
        {
            "review_text": "Yo buy this ♥♥♥♥ing game bros its totally rad. But seriously skiing/boarding and wingsuit is amazing, can't wait till vr support is added, I want to make all my friends sick////muahahahahahaha",
            "review_score": "1"
        },
        {
            "review_text": "While the game is stunning in visuals and sound design, it lacks in content, consistency, and overall enjoyment.  Exploration:  For a game that encourages the player to explore, the exploration and freeroaming is extremely tedious. The fastest mode of transportation is you wingsuit, but there are only so many places you can launch from. However, your faster ways to move can only move you downwards. To climb a slope, you have to use the paraglider or just walk. The paraglider still confuses me because it seems you have to find updrafts in specific places to boost you upwards, and there is no way to find these other than just mindlessly floating around until you run in to one. The walking is the most controllable of the five sports, but is insanely slow. Like, I know, running in snow is tiring and hard to do, but when the only way to ge to where I want to be is walking, I'd rather not be moving at two miles per hour.   Rocks: The rocky bits of the mountains are extremely annoying. While on the snowboard, even standing still on a bit of rocks will make you fall over. This places you in an endless cycle of falling over until you hold tab to try again. This means, even if you've been exploring for thirty minutes straight on your board, the game will plop you right back to the last time you switched sports. You also cannot transition from snow to rock while walking, and vice versa. This means if you flop and land on a patch of rocks, you cant just walk over and climb off, you have to slide off on you snowboard and fall over just to get off of a pebble you got stuck on. Oh, and you want to try again after that whole situation? Nope, the game will send you right back onto that rock, because you switched sports, remember?  Menus: The menus could do with some redesigning. The mountain view is difficult to navigate with all the places the cursor locks on to, and the view angle changes every time you open the menu, so it is very disorienting. It took me about twenty minutes to figure out how to view my replay for a manditory mission. I was also about three hours into the game before i realised that you could actually customize your rider.  Missions: There are some interesting missions called 'Mountain Stories' that I actually enjoyed, because they have a quick little story and a unique prize at the end. There was one mountain story where you had to ride around and smash these little snowmen who would taunt you the whole way through, and at the end, you recieved a neat little evil snowman mask. Also, I should mention, there are four different 'classes' of rider you can become. Pro Rider, Freestyler, Bone Breaker, and Explorer. You must complete missions specific to that class to level it up. My favorite type of mission by far are the Bone Breaker missions. They are very unique and interesting while remaining fun and difficult. The wingsuit Bone Breaker missions mostly consist of flying through small caves and tunnels with multiple twists and turns. These missions are very difficult, but you dont get frustrated because any time you fail, you know it is of your own fault. The game isn't screwing you over in any way, you don't succeed due to you own capabilities. Pro Rider and Freestyler missions, on the other hand, are difficult because of your lack of control. If you are riding down a steep slope and hit a tiny bump, you go flying off into the air, and will most likely miss the next checkpoint, forcing you to restart the entire mission. The actual ramps in the game entirely destroy any momentum you had before you hit the ramp. They function more as speed bumps than anything else. Most of the time to complete these missions, you have to resort to getting off of your snowboard and walking through the checkpoints yourself.  Checkpoints/'Level' Design: As I explained previously, the tiniest bumps in the earth will rocket you off into space. So, in a mission that requires speed and pinpoint accuracy, why are they all so bumpy? When the mission requires maximum control over your rider, the bumps make your rider do little jump after little jump, removing your ability to turn, making you miss the checkpoint, and restart the mission entirely. May I also add that these mission are extremely long and tedious, and one little slip will send you flying down the slope past all of your objective while you do your best to slow down. (Also, if you manage to fall over on any kind of slope, the ragdoll will fall all the way until it runs into a flat surface, and once it's there, it may continue to roll along being propelled by some unknown force, completely ignoring friction.) Okay, back to the checkpoints. Your next checkpoint is only revealed to you once you pass through the point before it, and when you're rocketing down a mountain at insane speeds, you hardly have time to react before you blow past it. Checkpoints are little spheres that you have to pass through the center of (no, you can't just touch it, you have to be entirely engulfed and then some) for it to count. This means it is very easy to zoom past over, or even through it without the game counting the checkpoint. There is, however a beacon that appears above the sphere to give a very vague idea as to where the point is. But wait! sometimes you find yourself in a little ravine where you can't see the beacon at all! You make a wrong turn to where you assume the next point will be, and whoops! You have to do the whole thing over again. A fix for this would be a minimap. Just a small little minimap that points you to the next checkpoint along with the beacon and sphere.  Leveling/Content: I have played about twelve hours of this game as of now, and I am level 22 out of 25. I have discovered all the lines that I could want to ride, and played all the challenges that didn't frustrate me to the point of quitting. Twelve. Hours. It may seem like a long time in text, but to me, playing the game, felt like about thirty minutes of casual playing. You may argue that, 'there's so much left to explore at the base of the mountains!' but where's the fun in that? It's not like it's gonna be some intense underground tunnel that leads to a huge slope with heaps of huge jumps and ramps. It's going to be a nice little group of cottages where you stop for a second and say, 'Neato,' before sliding off down the slight decline that the base of the mountains is.   Okay. Now, I know I just ranted on and on about what I don't like about the game, but overall I still had a good time. The game was beautiful with great sound design and song choice, and just boarding down a slope with no objective is calming and can even be rewarding. But, for the amount of unfair difficulty and bugginess and frustration this game has given me, it simply is not worth the cost of a full price game. It provides short lived wonder and beauty followed by grinding and inconsistency and frustration. I can not say that I recommend purchasing this game. ",
            "review_score": "-1"
        },
        {
            "review_text": "The game would not start for me. I could see it pop up in my task manager, stay for about a minute, and then nothing. I contacted ubisoft support and did a fresh install of my graphics card drivers which did not fix the problem, but their next suggestion was to check every single program that runs at start on my computer. Sorry, but no. I don't run anything unusual on my computer that would interfere with this game launching. I checked my programs against Steam's list of frequent offenders for trouble with launching games and did not have anything on the list. A game from an AAA game developer should run properly 'out of the box', so to speak. I also strongly resent being forced to download Uplay. I've already requested a refund.",
            "review_score": "-1"
        },
        {
            "review_text": "Pros- Beatiful Open World Different Sports User customization Some challenging Races Multiplayer  Cons- Limited Tricks Controls are F*cked Gets Repetative  Biggest Con- F*CKING UPLAY  Great game, but I feel like there isnt all that much to do. More of a scenery based game.. Not worth the 60 dollar price but I would get it on a sale for 30.. But you need Uplay soooo actually 10",
            "review_score": "1"
        },
        {
            "review_text": "thumbs up",
            "review_score": "1"
        },
        {
            "review_text": "would be a fun game, but i only got to play about an hour and a half when i closed the game and now it just crashes when it tries to load. i am above the min required at a fx8350 8gb ram and a r9 270x.",
            "review_score": "-1"
        },
        {
            "review_text": "IF YOU ARE NOT FAN OF THIS TYPE OF GAMES OR JUST GOREGEOUS GRAPHICS DONT BUY THIS GAME! I think people should see that. But anyways from what kind of this type games there are its the best with gorgeous graphic and awesome choice of songs.",
            "review_score": "1"
        },
        {
            "review_text": "it crashes all the time for me, i start it..... and then it crashes...",
            "review_score": "-1"
        },
        {
            "review_text": "Was si excited to ride some mountains while I cannot do it IRL. And after about 15 mns the game just cut out in the middle of a gameplay cause my internet had disconnected. Say what???  No option to disable online functionnalities cause, I will quote the Ubi admin on their forum : 'We think the social aspect of steep is a major part of the game and the ability to interact with, play with and challenge other players is one of the core aspects of Steep. Exploring a world like Steep alone would be very lonely after a while D: So an online connection is necessary for playing the game right now. Hope that answers your question! '  IT SURE DOES NOT UBI. I just paid top bucks for a solo game i can't even play with my crappy internet.  Never again will I buy Ubi game.",
            "review_score": "-1"
        },
        {
            "review_text": "very nice gameplay,, but why seem like error when do a mission or free walk the word missing?? cant see the objective mission,, my file game error or this patch problem??",
            "review_score": "1"
        },
        {
            "review_text": "Pretty bad in my opion the controls are still clunky and unrefined. the timing is off for anything related to tricks. the paragliding is at best a cheep afterthought. if you lose connection during the tutorial it breaks it and wont allow you to continue. and to tie it all together uplay kept having random little pop ups that made the game lose focus. i have requested a refund and will be telling my friends not to buy this game.",
            "review_score": "-1"
        },
        {
            "review_text": "On Second day of game play. This game is fun. I love the snowboarding especially. BUT it crashes every 30 minutes or even more frequently on BOTH of my PC with different configurations. Both machines are of higher speced than the recommended specs. No fixes yet. All drivers are up to date.  NOTHING is worse than the game crashing all in a sudden while you are shredding and doing the stunts or while you are about to win a race.",
            "review_score": "-1"
        },
        {
            "review_text": "Very unrealistic and glitchy around rocks.  Pros: -cool idea -good soundtrack -always in god mode &lt;--- but no risk so never mind   Cons: -seems like no effort was put into game -can see under world when you wipe out -is buggy around rocks -can't hike -can't fast travel to places not spotted -muliplayer is weak -fast travle glitches -no personalisation -can only be a hippie dude (no women) -player grunts a lot -the guy that talks to you always says stupid things -tell you that you are good even when you suck -its $40 on sale as of Dec 31, 2016 -can't skip intro -graphics suck for 2016-2017 -jumping is bad -not at all close to any of these sports -no risk  Do not spend your money on this!!! even though the thumb nail is cool!!",
            "review_score": "-1"
        },
        {
            "review_text": "Bought the game , and for some reason I can only use Russian and simmplified Chinese languages . Amazing 12 language support I'd say . Started the game , it cant fit my screen resolution , and there is no way to fix it , had to disconnect my second monitor to attempt again , nope nothing changed . I've just requested my refund .",
            "review_score": "-1"
        },
        {
            "review_text": "it doesent work he stays in startup and then crash",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ing ♥♥♥♥ game dont buy it. It crashes evry ♥♥♥♥ing time. DONT BUY THIS.   // ♥♥♥♥ you Ubisoft",
            "review_score": "-1"
        },
        {
            "review_text": "I like skiing quite a bit. I thought this would be fun. However, the jump mechanics are completely broken. You come zooming up to a hill (big or small) and you barely takeoff when you hit the hill. Its almost as if your stuck to the snow. Not sure why they'd do this but definitely *not* fun.",
            "review_score": "-1"
        },
        {
            "review_text": "Uplay is Aids",
            "review_score": "-1"
        },
        {
            "review_text": "So this game I don't know what its like to play as I have not even been able to play it yet. And am thinking of asking for refund soon. I am getting the DE-014-01 connection issue.  And cant seem to find what is wrong. Don't buy this game is my advice for now. Until they fix their s**t...  ",
            "review_score": "-1"
        },
        {
            "review_text": "unless you have an xbox/playstation controller hooked up to your PC, it's not worth it.",
            "review_score": "-1"
        },
        {
            "review_text": "Did not get me going at all. Im dissapointed. controls are heavy and not fun.",
            "review_score": "-1"
        },
        {
            "review_text": "The best snow sports game I've palyed since the legendary N64 1080. The snow simulation coupled with the huge open world map makes this a sort of Alpine GTA. THere's a great feeling of control as you slice through the powder, and that's very like 1080. The slopes seem to be devoid of other players right now, but as the reviews come in, these should start populating. I'm already looking forward to the season packs!",
            "review_score": "1"
        },
        {
            "review_text": "The last time I played a snow sports game, it was SSX on my old gamecube. I'm not really into sports game usually, but this one is an exception.  For me, Steep is a great game.  The graphics are impressive even without maxing everything out. I didn't encounter any really bothering glitches/bugs, and it runs well.   The gameplay is also quite good, the controls are easy to get and, I think, fine, at least for people who don't go skiing or snowboarding every week-end and who want to control every flexion/inflexion and force on the snowboard. I also find that difficulty and fun are truly well balanced.  But what I love even more, is that this is immersive af.  After 5 hours of gameplay (and I'm not going to stop), I've only encountered minor bugs, which I think will be fixed soon, like in the next patch.  For example, when I customize a rider, play and log off, the outfit will get reset the next time I'm going to play. You don't lose progression, just the outfits are reset to default. Same for the audio preferences (music style, playlist, etc ...) Minor bugs.  So, despite few minor bugs, I would highly recommand this game if you want to relax and have fun in the end of the day or with your friends. Especially if you like immersion, speed and snowy mountains ^^.  If you think it's too expensive, well, wait a few weeks or for some sales and you're good to go. If you think it will feel empty and boring, well, I think it's subjective, but for me it's absolutely not empty and boring. Huge map with tons of different places, challenges, cliffs ... when man, a simple ride feels really really good.   That said, I'm sure you just have to check the discussions and you will find the exact opposite of my review.  Well, that's normal, it's all kind of subjective after all and it depends of what you expect from this game.  Hope this review helps.         ",
            "review_score": "1"
        },
        {
            "review_text": "Loving it so far, definitely worth the 'steep' price.  There are some stuff that needs ironing out, but overall, no other game available offers the experience that Steep does.  7/10.  Also, DONT HOLD FORWARDS while you jump haha. Makes you stick to the edges. Once I stopped doing this, what a game changer.",
            "review_score": "1"
        },
        {
            "review_text": "An exhilerating and sensational piece of work, a word of warning though, you will lose many hours in the blink of an eye. Probably best to let your family know when you're playing, you don't want to be reported missing after all!  Superb game.  A+",
            "review_score": "1"
        },
        {
            "review_text": "I like the game Ubisoft needs to fix the Gforce thing when i barely fall down about a foot or two it goes down half way. The other thing is the rocks seem sticky when u jump on them.",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant. This game is truly beautiful, breathtaking, exciting and rewarding, There are no limits for what you can do, and you have the ability to create your own content. I love it.",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant. This game is truly beautiful, breathtaking, exciting and rewarding, There are no limits for what you can do, and you have the ability to create your own content. I love it.",
            "review_score": "1"
        },
        {
            "review_text": "Very interesting Fun game my friends.  1:starts up game 2: falls off board 3: cries myself to sleep",
            "review_score": "1"
        },
        {
            "review_text": "Ubisoft Annecy has crafted a gorgeous-looking winter sports game with a strong foundation of exploration, enjoyable gameplay and a feast of events to unlock. What it hasn’t done is create a pathway through that game that will keep you playing through to the end. Despite the variety of events and sports the action and scenery grows repetitive, while some minor issues keep on cropping up. The result is a game that’s close to brilliance, but not quite close enough.   3.5/5",
            "review_score": "1"
        },
        {
            "review_text": "Ubisoft Annecy has crafted a gorgeous-looking winter sports game with a strong foundation of exploration, enjoyable gameplay and a feast of events to unlock. What it hasn’t done is create a pathway through that game that will keep you playing through to the end. Despite the variety of events and sports the action and scenery grows repetitive, while some minor issues keep on cropping up. The result is a game that’s close to brilliance, but not quite close enough.   3.5/5",
            "review_score": "1"
        },
        {
            "review_text": "Glorified walking simulator with great graphics. Got it through the winter sale, still felt ripped off (considering i also bought other games during this period). thankfully steam refunded my copy despite 2 attempts on my side, now i can use the money to buy other games instead",
            "review_score": "-1"
        }
    ]
}