{
    "app_id": 461230,
    "name": "Dashy Square",
    "release_date": "2016-04-25",
    "developer": [
        "Kastriot Sulejmani",
        "Logan Gerrol"
    ],
    "publisher": [
        "KasSanity"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud",
        "Includes level editor"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "Music"
    ],
    "achievements": 124,
    "positive_ratings": 159,
    "negative_ratings": 18,
    "price": 2.09,
    "description": "Dash, jump and fly your way through epic levels with rhythm-based gameplay!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/461230/header.jpg?t=1530132030",
    "minimum_requirements": "OS: Windows XP Processor: 2.0+ GHz Memory: 512 MB RAM Graphics: OpenGL 2.0+ Support Storage: 70 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Amazing game! :D Fu*king lot of refferences: Geometry Dash (3/4 refferencers are from this game lol xD) Ratchet and clank Jak and daxter Twitch,Yt, and more internet memes etc. Youtubers charracters! - Merg, evw, riot and lot more :D  Game is very similiar to Geometry Dash and Impossible game, but not bad game! :D",
            "review_score": "1"
        },
        {
            "review_text": "This game is beautiful, great gameplay, graphic, and songs. I like this game. 10/10 And developer, can you released russian language, i just do not really know english, now i write whis the help of Google translator. Thank you in advance.",
            "review_score": "1"
        },
        {
            "review_text": "This game is so much fun, really easy to learn and then extremely addictive! I highly recommend it :)",
            "review_score": "1"
        },
        {
            "review_text": "its great",
            "review_score": "1"
        },
        {
            "review_text": "I love this game so much! You should totally get this game if you like geometry dash! I bet this is gonna be a new fav!                                                                ╚═( ͡° ͜ʖ ͡°)═╝ ╚═(███)═╝ ╚═(███)═╝ .╚═(███)═╝ ..╚═(███)═╝ …╚═(███)═╝ …╚═(███)═╝ ..╚═(███)═╝ .╚═(███)═╝ ╚═(███)═╝ .╚═(███)═╝ ..╚═(███)═╝ …╚═(███)═╝ …╚═(███)═╝ …..╚(███)╝ ……╚(██)╝ ………(█)   I like chickens...",
            "review_score": "1"
        },
        {
            "review_text": "This game is fairly good, since it's a GD copy. I personally enjoy it, but there are things that need to be improved. Overall, i would reccomend this game to others. i can play this for 'SOME' time, but its not a game i can play for hours on end. overally i give it a 6/10.",
            "review_score": "1"
        },
        {
            "review_text": "i do not like this game at all i would not recomend using your money for this",
            "review_score": "-1"
        },
        {
            "review_text": "Well, I paid about £0.22 for this game as part of a bundle.  I did not get my moneys worth.  It is a truely terrible game with zero gameplay value. A shameless ripoff of Geometry Dash, a game that uses about the simplest gameplay mechanic it's possible to have and it still manages to fail at it.  For the love of god, do not buy this game, if you want a fun game that isn't Geometry Dash but in a simillar style (perhaps because you already have Geometry Dash) give Bit Trip Runner / Bit Trip Runner 2 a try, they're a lot of fun. This isn't.",
            "review_score": "-1"
        },
        {
            "review_text": "Amazing and very fun i really do recommend this game just give it a chance and i hope you'll like it! :D",
            "review_score": "1"
        },
        {
            "review_text": "pretty decent love the music and gameplay that goes with it cant wait till lvl editor see what lvls people have to offer overall great £1.99 game",
            "review_score": "1"
        }
    ]
}