{
    "app_id": 461360,
    "name": "Thorne - Son of Slaves (Ep.2)",
    "release_date": "2016-08-26",
    "developer": [
        "Thorne Games"
    ],
    "publisher": [
        "Aldorlea Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie",
        "RPG",
        "Strategy"
    ],
    "tags": [
        "RPGMaker",
        "Action",
        "RPG"
    ],
    "achievements": 18,
    "positive_ratings": 70,
    "negative_ratings": 8,
    "price": 2.89,
    "description": "Play as the infamous mercenary known as &quot;The Crow&quot; in a decayed and corrupt world, find your way out of chains and get paid for your contract, in this enthralling Action-RPG with high production values.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/461360/header.jpg?t=1535992343",
    "minimum_requirements": "OS: Windows XP/Windows Vista/Windows 7/8/10 Processor: 1.6 GHz Memory: 128 MB RAM Graphics: DirectX 9.0 Compatible DirectX: Version 9.0 Storage: 300 MB available space Sound Card: DirectX 9.0 Compatible Sound",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Thorne - Son of Slaves (Ep.2) This is an action rpg in the classic style that has been beautifully done, featuring a great story, game mechanics with an easy learning curve, interesting characters all around, excellent supporting music, and gorgeous graphics.  Gameplay mechanics are a bit different (real time combat), but with only a minimum amount of time and with the in-game help you will pick up the system being used with ease, and be on your way to explore the world. And careful exploration is a must to reveal the clues of the interesting, cleverly laid out puzzles, and picking up the treasures that are plentifully distributed throughout the game. Search everywhere to find the many clues that drive the plot you never know what you'll find, whether it be health items, accessories that you will find. The game features a small but nice soundtrack. In the end Thorne - Son of Slaves is pretty good for its price and I’m looking forward for the next parts of this series.",
            "review_score": "1"
        },
        {
            "review_text": "  Right off the bat, Thorne - Son of Slaves tosses you into the action, in a sequence right out of an old SNES game, where Thorne has to chase down some baddies on  freaking horse back  while avoiding obstacles and attacks. If you've ever played any sidescroller, like the Indiana Jones Trilogy, or Donkey Kong Country, you know what I'm talking about. And that's only the  first  fight. That alone makes this game worth it's purchase, just for that bit of innovation.  Yes, it is a sequel, and yes, it is an RPG Maker game. And it's one of those rarest of creatures, in that it's pretty good despite both those knocks against it. Combat is more Link To The Past-ish than your standard RPG, taking place in real time, with sword slashes and range weapons, desperate attempts to heal, and strategically maneuvering around the battlefield, trying to bottleneck enemies and deal with them one on one.  The story continues the adventures of the mercenary Thorne, also called the Crow, as he does one last job for the Duke. I won't say more beyond that, but suffice it to say, 'one last job' never turns out to ever be, 'one LAST job.'  The graphics sit somewhere between Final Fantasy VI and Terranigma, in terms of detail, with some lush forests and impressive light effects that change depending on the time of day. I thought it was a nice touch that the windows that were flooded with rays of sunlight in the day, gave off only a diffused white glow at night. It might seem small, but the devil's in the details, and most developers wouldn't have bothered. Hell, I probably wouldn't have. The towns are appropiately town-ish, if that makes any sense, and the caves have the right level of cramped claustrophobia, making it necessary to take it slow, scout ahead, and plan your attack, otherwise you will find yourself on the wrong end of a much larger enemy.",
            "review_score": "1"
        },
        {
            "review_text": "The good game made in RPG Maker. After purchase of 1 part I waited for continuation. And no wonder the 2nd part is excellent, as well as the first",
            "review_score": "1"
        }
    ]
}