{
    "app_id": 461380,
    "name": "A Princess' Tale",
    "release_date": "2016-05-20",
    "developer": [
        "Warfare Studios"
    ],
    "publisher": [
        "Warfare Studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Adventure",
        "RPG",
        "Indie"
    ],
    "achievements": 0,
    "positive_ratings": 17,
    "negative_ratings": 12,
    "price": 3.99,
    "description": "What happens when the fate of the world falls into the hands of the most irresponsible bubblehead to ever trip over royal birth? Play this 16-bit style old-school RPG and find out!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/461380/header.jpg?t=1524326079",
    "minimum_requirements": "OS: Windows XP/Windows Vista/Windows 7/8/10 Processor: 1.6 GHz Memory: 128 MB RAM Graphics: DirectX 9.0 Compatible DirectX: Version 9.0 Storage: 200 MB available space Sound Card: DirectX 9.0 Compatible Sound",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Another old style rpg from Warfare finds our heroine (Princess Calliope), her bodyguard, a mercenary, and a bohemian outcast forming a party to save the world from destruction by an ancient monster(s) that awaken every 1,000 years to destroy humankind.  All the details as to what is happening are laid out in this straightforward tale that takes you to the far corners of this ancient kingdom. Along the way, there will be battles with assorted monsters, secets to discover, exploration to do, lots of items to find or buy, and numerous problems to solve. Old style 16-bit rpg experience that is very nicely done.  All these games, for me, are perpetuated by the story, and this one is clever with a lot of humor. The art is nicely done, particularly in the battle scenes. Music is very good ---- fits what is going on. NPCs offer just the right amount of help, and add to the exposition (and humor) of the tale. As I indicated, there is lots of exploring to do, and you can search carefully or speed along as you prefer.  There is a system of buttons that is used that increase various stats as you go ---- get the 'lucky' buttons for everyone.  It's a solid game that fans of the old 16-bit rpgs should look into for sure.   ",
            "review_score": "1"
        }
    ]
}