{
    "app_id": 461500,
    "name": "Omega Agent",
    "release_date": "2016-05-04",
    "developer": [
        "Fireproof Games"
    ],
    "publisher": [
        "Fireproof Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Full controller support",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "VR"
    ],
    "achievements": 0,
    "positive_ratings": 30,
    "negative_ratings": 8,
    "price": 2.99,
    "description": "Strap into your very own nuclear-powered jetpack and blast into the skies of Omega Island, a volcanic sea enclave converted to a vast, intricate super-spy training facility.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/461500/header.jpg?t=1462355380",
    "minimum_requirements": "OS: Windows 7 Processor: Intel i5-4590 Memory: 8 GB RAM Graphics: NVIDIA GTX 970 / AMD 290",
    "recommended_requirements": "OS: Windows 7 Processor: Intel i5-4590 Memory: 8 GB RAM Graphics: NVIDIA GTX 970 / AMD 290",
    "reviews": [
        {
            "review_text": "Great game..shame about the sickness.  I really wanted to love this. Flying around in a jetpack in VR..I mean, who wouldn't want to do this?  The game itself is pretty cool, even the freeflight mode has you searching for briefcases and solving little puzzles to get your blueprints..but after approximately 15 minutes, I suffered that pretty bad nausea feeling from playing this. I suffered a tiny bit playing Dreadhalls and noticed that any game where you're playing with a joypad and have to use the right control to move your direction, the nausea begins.  I had this on the Samsung Gear VR and played it quite a bit and it didn't bother me as much as when I tried it on the Vive. I played it whilst sitting, thinking that this would help with any disorientation but the sickeness was there even after approx 1 hr.  Really disappointed as I really want to love this..but I ended up getting a refund :(  Recommended but if you are prone to sickness..you'll probably suffer. God help the people playing the Oculus with a joypad..urrggh.",
            "review_score": "1"
        },
        {
            "review_text": "This is so awesome ..... thats all you need to know  Not played long but......  Simply a must buy just for the VR experiance alone.  Jet packs are ideal for motion in VR and its a seated Game for a change.  Xbox controller only but it works great and feeels intigrated......even the misses took too the skys for the first time and landed safely.  She thought it was awesome too..  Ps neither off us had issues with motion sickness....just look where you going untill you climatise to the sensation of jet pack flight.  Update: I got slightly motion sick when i tried to fly through the rings shaped like a cross, they had to be negosiated quickly...this really was to much to take at the speed the task needed to be done.   If i fly smoothly .... I have no issues.",
            "review_score": "1"
        },
        {
            "review_text": "This game made me want to hurl after about 10 minutes. Also, the world is not very detailed, and is small.",
            "review_score": "-1"
        }
    ]
}