{
    "app_id": 461820,
    "name": "Legionwood 1: Tale of the Two Swords",
    "release_date": "2016-05-10",
    "developer": [
        "Dark Gaia Studios"
    ],
    "publisher": [
        "Dark Gaia Studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Full controller support",
        "Steam Cloud"
    ],
    "genres": [
        "Casual",
        "Free to Play",
        "RPG"
    ],
    "tags": [
        "Free to Play",
        "RPG",
        "Casual"
    ],
    "achievements": 0,
    "positive_ratings": 110,
    "negative_ratings": 16,
    "price": 0.0,
    "description": "An epic free-to-play RPG that captures the spirit of the classics of the SNES era.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/461820/header.jpg?t=1538989233",
    "minimum_requirements": "OS: Microsoft Windows XP or better (32 bit or 64 bit) Processor: Intel® Pentium® 4 2.0 GHz or equivalent processor Memory: 512 MB RAM Graphics: Intel GMA series or better DirectX: Version 9.0 Storage: 80 MB available space Sound Card: DirectSound-compatible sound card",
    "recommended_requirements": "OS: Microsoft Windows 7 or better (32 bit or 64 bit) Processor: Intel® Corei3 2.3 GHz or equivalent processor Memory: 1 GB RAM Graphics: Intel HD Graphics series or better",
    "reviews": [
        {
            "review_text": "It's free, I mean it is free!! Seriously, there a lot of RPGMaker games charging money with lesser content. But this one gives the player 20+ hrs of old-school JRPG style gameplay. I really enjoyed my time with Legionwood 1. The story, while a bit weak in the beginning really got to me after a while. Battle system itself was very nice. However, what I really liked the most was the open class leveling system. Once a character levels up, you will get 10 AP which you can distribute freely on your character, making him/her a mage, fighter, tank etc...and the best is that adding AP to raise stats is not a final commitment. At any given time you can remove spent AP and redistribute it on other stats. This gives room for lots of experimentation. Now it has to bit admitted that the game is not without it's flaws. One particular annoying fact is the apparently fixed number of steps until the next random encounter happens. This can become a bit of a chore once your party is well levelled and you just want to get to the end of an area. But it's nothing too annoying to keep you from playing.  Overall I recommend this to anybody who likes old-school style (or like me RPGMaker) games. It's free and there is no reason to not give it a shot!!",
            "review_score": "1"
        },
        {
            "review_text": "  I like this game. No rush, just turn based fun. Just like it says, it reminds me of some old JRPGs, like the ones on the SNES.  It is easy to control. The introduction guides you on everything.  I use the keyboard. Z, X, Arrow Keys and enter.  Check it out! ",
            "review_score": "1"
        },
        {
            "review_text": "I don't quite often play games from RPGMaker. I have only played the horror games which is great by the way. Well, this game is kind of good. I know I haven't played this game alot but the first hour is kind of fun. I don't quite see why people say this game is hard and difficult. I found the enemies in the first dungeon be really easy. Well, I think why because I actual bought some equiments before I got there. I think it's best do to that. Most of you say that they though the beginning equiments be enough but maybe had a tiny rough with the first dungeon. This game actually reminds me of old school JRPG's which you could find on the SNES. Overall, this game is great and I hope the game would get better when I further progress. If you like the old Final Fantasy's (1-6) then I recommend that you should give this a try.",
            "review_score": "1"
        },
        {
            "review_text": "Old School feel, reminds me of being a kid again. Controls could use some work or make the keypad make since when trying to change.",
            "review_score": "1"
        },
        {
            "review_text": "The ♥♥♥♥♥iest game EVER!! I never know who is the ♥♥♥♥♥iest game, but now I know! The voice acting is SO SO BORING, when you escape from an discussion your beard will grow and probably you will die, and the gameplay is more terrible!!! DON'T INSTALL THIS GAME! AND YOU WILL BE HAPPY!",
            "review_score": "-1"
        },
        {
            "review_text": "I Can't believe one dude made this. Felt like a fairly polished RPG from a bygone era",
            "review_score": "1"
        },
        {
            "review_text": "i know why people complains getting black screen after meet seirno at magris academy after his dialog ' what! is that ...'  either  use 5 people on party using tacticial tome   or   need to talk to all people in academy.  i faced that black screen but restart and load my save game then go back, i reduce my party to only main character alone and talk to all people then talk to seirno, after that i dont receive any blackscreen",
            "review_score": "1"
        },
        {
            "review_text": "Just started the game and I love it already. I did encounter two bugs right off the bat. First was the button used for back or to open the character menu somehow was disabled I'm reinstalling the game in hopes of fixing this problem. Second was when I would load my game from the main menu it showed the character names as the defualt even though I changed their names in the beginning, that isnt a big deal but the first problem I had could possible ruin the game for me if this happens periodically. But this game is amazing and its free!!! What more could anyone ask for!!!",
            "review_score": "1"
        }
    ]
}