{
    "app_id": 461840,
    "name": "Zenge",
    "release_date": "2016-04-12",
    "developer": [
        "Michal Pawlowski"
    ],
    "publisher": [
        "Hamster On Coke Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Casual",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Puzzle",
        "Casual"
    ],
    "achievements": 1,
    "positive_ratings": 2325,
    "negative_ratings": 100,
    "price": 0.79,
    "description": "Relaxing puzzle game, telling the story of Eon through gorgeous art and music.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/461840/header.jpg?t=1519962126",
    "minimum_requirements": "OS: Windows 7 Processor: Intel i3 Memory: 1024 MB RAM Storage: 160 MB available space",
    "recommended_requirements": "OS: Windows 7 Processor: Intel i3 Memory: 1024 MB RAM",
    "reviews": [
        {
            "review_text": "8.9/10 - Amazing, Tranquil, Challenging; an Innovative Puzzle Game!  I've wanted this game for some time; so I figured what the heck throw down the 99 cent retail price and check it out. I was blown away! The vibe, art and challenge were all on point! I don't know what the overall theme of the story was but it didn't detract from the experience at all.   There are 70 levels that have different challenges and objectives every 10 levels or so. I would buy the sequel in a heartbeat. I felt almost guilty only paying a buck; this is one of the extremely rare cases when the developer really undervalued their work! Regardless Thank-you!  Overall, It's a Slam Dunk! Only 99c for 70 pleasing levels!      Accidently Reviewed",
            "review_score": "1"
        },
        {
            "review_text": " Briefly:  Zenge  is a short but elaborate synthesis of a puzzle game and art show with organic learning curve.   Alien beige landscapes, mysterious puzzle pieces and relaxing music,  Zenge  looks enchanting. It's also an excellent puzzle game for its short length.   Trick or treat!",
            "review_score": "1"
        },
        {
            "review_text": "Okay, I just beat this and honestly, it was probably the best 71 pence I've spent in a long while.  The thing that drew me to the game was the art style, I won't lie, I bought this game based on the screenshots a lone - I didn't read the description, or the reviews. I went in expecting a puzzle game similar to Hook, and to be honest that's not far off of what I got - an exceedingly polished, aesthetically pleasing, no-pressure puzzle game.  It took me 70 minutes to beat - which when combined with the price paid, well exceeds the standard '£1 to 1 hour' rule that so many people seem to hold in such high regard - which personally I don't, if I enjoyed the experience then it was probably worth the price. Of course, it's a puzzle game, so YMMV - I could imagine people beating this in a solid half hour, or even taking several hours to never beat it.  While it's not an excessively or inherently difficult puzzle game, it does require some decent spacial analysis - although some people will be pleased to hear that it seems to be impossible to 'trap' yourself and be forced to restart a board. I didn't manage to do that in any of the levels, although I did restart a few purely because I need to work something out from the beginning - that's just how my mind works when solving problems.  If you're looking for a chill experience, with some wonderful art and music, with a little bit of story thrown in - I'd say go ahead and drop the sub-£1 fare for entry here and just have an hour of no worries or distractions, just solid puzzle solving fun.",
            "review_score": "1"
        },
        {
            "review_text": "Brief but pleasant little puzzle game. Introduces new mechanics the whole way through and combines them all to make for some pretty interesting puzzles by the end. Not too difficult, there was only one puzzle where I was stuck at all, but it's relaxing. There's a vague story told through the pictures you form but I'm not really sure of all the details, there's a nice journey effect going on though. The music's also pretty nice. For a dollar you can't really go wrong honestly, it took me about 75 minutes in total to play through front-to-back.",
            "review_score": "1"
        },
        {
            "review_text": "I bought the game on a whim, since it was so cheap. I plowed through it in a couple of sessions, and in the end I was left with an overwhelming feeling of...  'Meh. It was alright, I guess.'  There's  nothing technicly wrong  with this game. The art is beautiful. The music is soothing. The puzzle mechanics are nice, varied and used in different ways.  But in the end, I spent less time thinking about the puzzles than I did executing the needed actions. I was hardly ever actually stumped. Rarely did I notice having made actual mistakes. Most of the time I was just plowing forward with either obvious moves or educated guesses.  But do note, the above may be a  positive  for you. The mechanics are introduced well and the difficulty ramp is smoot. Also, the puzzles seem to be designed in a way that you can easily work your way to the solution step by step. I've also played a lot of puzzle games, so you may find these puzzles more challenging than I did.  But I was just left wanting just a bit more challenge.",
            "review_score": "-1"
        },
        {
            "review_text": "Calming music and straightforward mechanics. Puzzles are interesting, but simple enough that you'll never feel stuck or frustrated. This is a good game if you are looking to just relax and unwind for a while.",
            "review_score": "1"
        },
        {
            "review_text": "Zenge is a very well done, relaxing and fun puzzle game. It starts easy and simple by sliding puzzle piece's into their position of an outline. As you progress, new mechanics and more challenging puzzles are introduced, such as sliding the pieces in a much more complex way by turning ,flipping, minimizing, teleporting and unlocking colored lines to be able to move pieces. When you finish each puzzle, it becomes a picture of beautiful artwork that is meant to tell a story. Good, cheap, relaxing fun!",
            "review_score": "1"
        },
        {
            "review_text": "Fine puzzle solving game with fantasic, beautiful scene. The puzzles are not related to the story (just like most of the puzzles in Professor Layton series), but they're interesting and do not take long to solve. In fact most of them are like cutting and folding paper, which reminds me of games in my kindergarten. I mean, just imagine how fun they are. Music is perfect, except there's only one piece of it and you'll get a little bored listening for too long. Aaand for the story, well, actually I didn't quite get it so there's not much to share with you, but I think it is a story about an adventurer losing his way in a new world and making new friends who send him a helping hand...? The game has a 1-2 hrs playthrough and this time may be shorten if you are a skilled puzzle-solver. There's one thing I'm sure about: that you will definitely enjoy it and won't regret buying it. I'm giving 8 out of 10. [Sorry, not a native English speaker so there may be some mistakes.",
            "review_score": "1"
        },
        {
            "review_text": "Good value for money, but don't expect anything awesome. It's a really simple puzzle game. Good time waster, not a challenge.",
            "review_score": "1"
        },
        {
            "review_text": "If I was describing this game to a friend, I would probably use the word 'nice'.  It's minimal and easy on the eyes, you never really need a tutorial as the mechanics are simple enough and the icons are pretty self-explanatory. New mechanics are introduced with a very simple puzzle with a logical progression to more complex uses. I would call this good, intuitive design overall.  Puzzles are not frustratingly difficult or mind-bending, just require some focus, fantastic for (as was my personal experience) those mornings where you're still feeling a litte hazy from a lack of sleep so don't want anything that requires too much brainpower, but need something to get your brain started for the day.  Total playthrough time for me was just over an hour and a half, and for the tiny asking price it's definitely worth the money. Very well done, pleasant experience, thank you Michal and Konrad!",
            "review_score": "1"
        },
        {
            "review_text": "This game is magnificent, I like their way of telling the story. The art work is amazing, so is the calm soundtrack. Wish it was longer too   Cards and emoticons maybe? would def buy 10/10",
            "review_score": "1"
        },
        {
            "review_text": "a really great sliding puzzle game, one of my new favorites actually, with beautiful artwork and excellent music. no timers or other restrictions, very relaxing. not sure why it's priced so low, even if it only takes a couple hours to complete, so there's really no reason not to pick it up.",
            "review_score": "1"
        },
        {
            "review_text": "challenging game with good music",
            "review_score": "1"
        },
        {
            "review_text": "One of the best puzzles I've played in a long time. The soundtrack is also great and add an unique flavor to the game.",
            "review_score": "1"
        },
        {
            "review_text": "This is simply a beautiful and relaxing short puzzle game, that i adored playing",
            "review_score": "1"
        },
        {
            "review_text": "Deceptively simple, but the puzzles are very fun to do and become challenging at a good pace! The sound and music and the artwork just add on to an already good gameplay!",
            "review_score": "1"
        },
        {
            "review_text": "Wonderful game, great for playing while at work.",
            "review_score": "1"
        },
        {
            "review_text": "I read about it very briefly, that it was meant to be a relaxing and engaging experience, and it being super cheap decided to try it.   Well, I should have watched videos of gameplay prior I suppose, as:   -The music isn't particularly soothing. Yes, I know, subjective and the vast majority of people love it but it isn't Hammock or Artesia when it comes to helping you wind down.  -The 'story piece by piece' was a series of perhaps five images (didn't make it past that) that I could not decipher and were as engaging as lint.  -Gameplay is puzzle solving, in essence problem solving. This is most of what I do at work and as it didn't appear attached to any particular feeling of escapism in my case it was like coming home to go to work.",
            "review_score": "-1"
        },
        {
            "review_text": "Excellent! A good difficulty curve. Pretty graphics. I like especially that the last puzzle is a deconstruction.",
            "review_score": "1"
        },
        {
            "review_text": "I really liked the puzzles and found it to be very calming. The mechanics were fun and a level could be difficult without totally stumping you. Played it during study breaks and finished in less than 2 hours of playtime, but I think if you gave it a break between playing (a few weeks/months), you could probably enjoy playing the puzzles again. If you were looking for an engrossing puzzle game, this might not be it, but I found it a lot of fun.",
            "review_score": "1"
        },
        {
            "review_text": "Cute little puzzle game with nice puzzle ideas, music and interesting story telling.",
            "review_score": "1"
        },
        {
            "review_text": "If you like puzzle games, Zenge is for you. It gives you 70 puzzles where you have to move pieces to their right places and in the right angle. Its all controled by the right mousebutton. The game has nice graphics, pleasant music and nice puzzles. The puzzles start out easy and gets increasingly more difficult. From time to time it introduce a new concept where you have to learn the new ability.  The game took me a few hours of pure fun and I would recommend it any time to anyone who likes puzzle games (also see my other reviews if you like this kind of game). I give it a 9/10. I would have given it 10/10 if it was not for some minor details where it could improve: It could be nice with a random puzzle generator so you can play it forever. Also some kind of counter and statistics telling you how far you are and maybe a little helpscreen telling about any new feature, and finally maybe some achivements?  Recommended - 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Art/Graphic: 5/5 Music: 5/5 Gameplay: 3/5 (Puzzles are a little bit too easy) Innovation: 4/5 Achievements: 4/5 (easy 100% but only 1 easy achievement)  Overall 4/5 For $0.99 it is a solid 5/5",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic logic, very relaxing music and beautiful pictures, absolutely worth the money! Hopefully there is more to come? I'm wondering if the pictures got mixed up a bit in order though, somehow I'm loosing the narrative between quite some pics?",
            "review_score": "1"
        },
        {
            "review_text": "Nice little puzzle game to spend a couple hours",
            "review_score": "1"
        },
        {
            "review_text": "Awesome puzzles and beautiful story. Also, love the music. It made me want more. This game is great! If you love puzzles and low prices buy this game now! :D",
            "review_score": "1"
        },
        {
            "review_text": "A really beautifully designed game with a rather low level of difficulty. Zenge is more a piece of art than a hardcore puzzle game. With its soothing soundtrack, it is perfect to play in between. In my opinion, the 99 cents are well spent on Zenge and will give you a nice experience for a net playtime of roughly an hour or so.",
            "review_score": "1"
        },
        {
            "review_text": "This is the first time I've reviewed a game here on Steam..only because Zenge is so freakin awesome! I'm an artist so I'm always into visually stimulating games and find the real good ones are rare..well..this game I downloaded this morning and have already raved reviewed it two people for them to check it out! The beautiful imagery tells a story..the puzzle itself is easy yet super addicting and does get challenging..I'm only about a halfway through and I'm already regretting the end! I don't know about the replay value as I haven't finished it yet and am not sure if I would go through the same puzzles again..I certainly hope there will be many more chapters to come!",
            "review_score": "1"
        },
        {
            "review_text": "Nice game. Puzzles are easy, but it doesn't matter much. Pictures are beautiful, pretty and cute. Too bad there is no gallery. It's quite Dixit-like, not amazing but relaxing. Puzzles can be frustrating because of some non-obvious mechanics, but it's not a big deal, simply slightly annoying sometimes. It costs less than 1 euro, if you like (small) challenge, you should buy it.",
            "review_score": "1"
        },
        {
            "review_text": "A great puzzel game with nice music and interesting mecanis. The price is a geat deal for a decent 2h of casual gameplay !",
            "review_score": "1"
        },
        {
            "review_text": "This game has a very unique style and a lot of gameplay content for the price. After completing each puzzle a piece of art from the author is revealed. I found this to be an interesting idea which also offers an extra level of content. The difficulty is mild and a good place to start for someone who is just getting into puzzle games.  Didn't have any real gripes with this game from what I can remember.  Completion time: 2.0 hr  Great choice for $0.99",
            "review_score": "1"
        },
        {
            "review_text": "Good game for rainy evening.",
            "review_score": "1"
        },
        {
            "review_text": "Delightfully simple puzzle game with intuitive solutions and nice difficulty progression. Translate, rotate, flip, teleport and scale pieces into place following predefined paths. The beautifully zen gameplay reveals art panels that tell an abstract story set in an appreciably vague surreal world. A dollar well spent.",
            "review_score": "1"
        },
        {
            "review_text": "A good puzzle game with great music and even a nice story to go with it, definitely worth more than the price the dev is asking for. Looking for more of there games in the future.",
            "review_score": "1"
        },
        {
            "review_text": "Reveal a magical story behind jigsaw puzzles with relaxing music and interesting gameplay, totally worth the price.",
            "review_score": "1"
        },
        {
            "review_text": "This is actually a great game, it gets a bit challenging at the end which makes it better.",
            "review_score": "1"
        }
    ]
}