{
    "app_id": 461910,
    "name": "Forge of Gods (RPG)",
    "release_date": "2016-05-06",
    "developer": [
        "Panoramik Inc"
    ],
    "publisher": [
        "Panoramik Inc"
    ],
    "platforms": [
        "windows",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Multi-player",
        "MMO",
        "Steam Achievements",
        "Steam Trading Cards",
        "In-App Purchases"
    ],
    "genres": [
        "Free to Play",
        "Massively Multiplayer",
        "RPG",
        "Strategy"
    ],
    "tags": [
        "Free to Play",
        "Strategy",
        "RPG"
    ],
    "achievements": 58,
    "positive_ratings": 2082,
    "negative_ratings": 600,
    "price": 0.0,
    "description": "Join the action in this highly addictive multiplayer card strategy RPG “FORGE OF GODS”! Collect and train as many monsters as you can to assemble the greatest team and burst through hordes of enemies in thrilling, addictive and fast-paced game!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/461910/header.jpg?t=1516806570",
    "minimum_requirements": "OS: Windows 7 Memory: 2 GB RAM DirectX: Version 9.0 Network: Broadband Internet connection Storage: 450 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "  This game feels more like it belongs to a Mobile App than something that should be on Steam.  I've played and seen similar games within the Mobile App stores; this game in particular seems to have a combination of systems utilized: The fusion/max-level bonus evolution system found in multiple card game RPGs, and the battle system is reminiciant of the 'advancing army' style of play. This style of gameplay isn't as common as other types of games within the Mobile market, but it is present.  That's about as much good I can say, however. There's definitely many more bads to goods to this Steam App:  When I played the game, the game felt a bit laggy while controlling my characters or navigating the menu. I don't know if it's my OS that caused this, but it very quickly got irritating.  The UI doesn't feel modified for a PC. Often, I have difficulty selecting the unit that I want to move, which doesn't help considering the already-present lag. When I try to click a unit above another, I'll end up selecting THAT unit instead. There's also grammar and font issues, as well, which is something one SHOULD fix when porting a game from the Mobile market.  Finally, when I tried closing the window with Alt+F4 or the corner button, it instead kept bringing me to the Gem Purchase menu. I get that the game is free-to-play, but this seems like a very underhanded move, especially when all I wanted to do was close the game. This part here was the nail in the coffin towards my feelings about this game; it felt less like a legitimate attempt at a good game and more like an attempt to desperately harvest money from players.",
            "review_score": "-1"
        },
        {
            "review_text": "I was suprised to see a F2P with high ratings, I thought I'd give it a go... I would only presume at this point the casuals who like to call themselves gamers have dominated the reviews system.  Once you get imposed with effectively an energy bar (can't play without the energy(meat)) it becomes a waiting game. The game is constantly screaming 'BUY ME' with it's rediculous in-app purchases  The UI is clunky, there's not much in the 'Settings' department. Until you've done the tutorial you can't escape the intrusive popups to explore options or other areas of the game (such as settings) and even then, once the tutorial is over, the intrusively unhelpful tips keep popping up. The game doesn't stop reminding you about the tutorial or tips in this fashion, such as 'double click to see stats and more information' - yet try to do this over say an item or your ranking icon and the story is entirely different.  After 2 hours, I have nothing to do but grind earlier levels to find the cards I need, mashing space-bar or facing the possibility of buying an item that effectively auto-bots for you, some top-notch gameplay right there.  Frankly, this seems like a mobile game or Facebook converted game... Quick buck, little entertainment or replay value - which is a shame, quite frankly I found this game concept quite promising at first. Should keep this tripe off Steam/PC platforms. This is the perfect example of a money hungry and quite frankly destructive F2P model game, that not only degrades itself but the value of the 'F2P' label.  Developers should really play their own games before they release them - derp.",
            "review_score": "-1"
        },
        {
            "review_text": "Grindy free-to-play trash. Plays like it belongs on a smartphone or tablet. Has more than 5 seperate currencies for doing various things. Lots of RNG and creature evolving and leveling up but you can also buy any creature for real money if you're found it once so that doesn't mean much.  Game has two difficulties; practically plays itself, and 'come back when you've grinded some more'. You can use real money to buy powerups to get through a level if you like but why waste money on this worthless cashgrab?  3/10",
            "review_score": "-1"
        },
        {
            "review_text": "Just another pay-to-win game. Do not waste your time nor your money.  The gameplay is addicting in the beginning, but becomes fastly repetitive and boring. You will need to buy a lot of summon spaces, as you get a lot of monsters in every playthrough.  Auto-play, cash-based pvp, grinding, and 10 grades of rarity. Yes, 10 grades! They're trying to make you open your wallet at all costs.  The RPG part ends in the levelling system. Not really a good story and you don't really have the feeling that you're making any progress in the game, as everything is just fully automated.  Definitely, do NOT play this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Very good and addictive game :) Doesn't cost anything so try it maybe you'll like it ...",
            "review_score": "1"
        },
        {
            "review_text": "At the first sight the impression about this game was not clear, but after couple hours I loved it. Graphics looks like mix of Heroes 3 and Disciples 2, but with unique atmosphere which I like. Combat has RPG and strategy elements. The main goal of the game Is collect, improve many different creatures and find the best setup for PVE/PVP opponents. Exploring world, we complete challenges, open new different sectors, collect creatures and ingredients for their improvements. It's so cool, that in this game we can create guilds for cooperating with other players, fighting in guild wars and farming raids. That's why I want to play this game everyday, there are a lot of different gameplay features.    For me, it's not a 'time killer', because you play such games from time to time. Forge of Gods is the game, which you can easy start to play and don't need to play it 24/7 to be on top, there are a lot opportunities in this game and I like to play it with friends",
            "review_score": "1"
        },
        {
            "review_text": "I have played this game about 98 hour until now (3 week maybe), at first it seem like a game 'pay to win' but actually the summon method is random, so if u have 100$ u may still not stronger than a 3 week player, anyway the pack to 'pay' cost too hight (to not buy them). I feel it's similar to the game summoners war on mobile, lucks and efforts still the main.",
            "review_score": "1"
        },
        {
            "review_text": "Hello there, since this is a free to play game ( and a pay to win one ) my review will be on just my time playing.   1) Story is meh, most of it honestly people will end up skipping past.  2) Monsters or troops, meat and potatos of the game, good lot to choose from ( but again P2W)  3) Musics not bad at all, I have heard worse.  So in a nutshell its a good game, give it a try it is free to try out. Works a little like most phone or facebook apps, the feel of it being on steam seems to be left out some how.  Crashes happen often for me but singled out around when I click the pvp windows or move to and from friends list.  My advice is save your gems the green diamonds! Do not waste them on the stupid little purple and blue boxes you get that tease you with 5 troops is a crap shoot. I wish some one told me how bad they were, I opened a 100 gem one and got the 1 guy who was uncommon and none of the 4 others who were IV ranked.  Game could be a lot worse, like owned by Disne.... Good Luck.",
            "review_score": "1"
        },
        {
            "review_text": "  fun, gems are cheap and easy to get.",
            "review_score": "1"
        },
        {
            "review_text": "Yea nicelly done although its another game like most of its kind but wow! Removing energy system and allowing players to actually grind (if that is true) then yeah.   Get that energy/food bar out of there DEVs or else im gonna downvote and make u gimme goodies!",
            "review_score": "1"
        },
        {
            "review_text": "This is actually a very fun game, it is somewhat challenging and you can have friends! The thing is, I have no friends... :'(  So, like when you... reach Rank 5, add me... My code is: FQVWWH  If you do, I will too... OK? Thanks m8's. x(",
            "review_score": "1"
        },
        {
            "review_text": "  Game is pretty darn decent, make sure to check it out cuz *IT'S FREE* so why not :D",
            "review_score": "1"
        },
        {
            "review_text": "Great time waster, very enjoyable. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Fun so far and freeish.",
            "review_score": "1"
        },
        {
            "review_text": "Very bad need to click go many times and waste of money to buy Gems .  What a WASTE IM TELLING YOU :(",
            "review_score": "-1"
        },
        {
            "review_text": "i has got all the DLC for free instead of Spring Ruch Pack   it nice game so who want to get the free DLC just write in google Freesteamkeys  enter the first website and browser for the DLC   if u dont found them then u should cheak the website everyday   maybe they come :skullgirl:",
            "review_score": "1"
        },
        {
            "review_text": "its a fun game. I dont know if its just part of steam or not you do get refunded the stuff you bought on the game when you reset buy going to the settings what made me like the game more when i missed up and need it to reset knowing how to do stuff.",
            "review_score": "1"
        },
        {
            "review_text": "mobile ported piece of ♥♥♥♥. I'd played it at one point, grinded my ♥♥♥ off a bit, hadn't touched it for months by now i think, or close ot months. Got a code, punched it in, decided to check it out again, says i was flagged as a cheater made me delete the account. I never cheated. tempted to now , though. but the game isn't worth spitting on. pass this up and play something else.",
            "review_score": "-1"
        },
        {
            "review_text": "Definitely like playing this game to kill time. It's a 'pay-to-win' but it's really easy to have fun with.",
            "review_score": "1"
        },
        {
            "review_text": "Great RPG Game!",
            "review_score": "1"
        },
        {
            "review_text": "Great game, not pay2win and very fun    UWKWQE add me for more fun!",
            "review_score": "1"
        },
        {
            "review_text": "So far it's ok; but like most F2p games I suspect it will get more and more grindy and annoying.",
            "review_score": "1"
        },
        {
            "review_text": "This game is horrible, it's pure pay 2 win. Don't bother, it's not even worth downloading despite its small size. It's like downloading a beggar.",
            "review_score": "-1"
        },
        {
            "review_text": "A nice little game which makes you wanna come back every day. Would be horribly p2w if not for Infernal War Pack and other packs being given away constantly (it really helps in the start).",
            "review_score": "1"
        },
        {
            "review_text": "Nice relaxing game. A bit on the P2W side, but fun to play even without spending money. Add me to friends for free gems/meat &gt; JFODXP.",
            "review_score": "1"
        },
        {
            "review_text": "Pros: getting lots of monsters to be on your team, can place monsters where you want,   Cons: this is a pay to win game, if you dont buy gems, be prepare to get you butt kick and struggle all the way. It is best to buy the beginners pack, which incude a 7 star level 5 dragon and a 6 star level 4 lion, and lots of gems to get another level 5-7 monster. This starter pack can beat anyone who plays and dont want to waste any money. i am level 10 and will loose easily to a level 3 with this starter pack. The dragon can hit 2 spaces and it is super strong, and the lion can hit only one space, but it is super strong too and it can heal itself from attacks. anyone come near those 2 will die in one hit. also with this pack, you can beat chap. 1 and 2 with ease.   I still play, add me: jjqkwb",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Would play again. (lol) I love this game started playing for 10 minutes can't stop playing anymore.I have 4 DLC's they helped me a lot.",
            "review_score": "1"
        },
        {
            "review_text": "This is an interesting game from a certain point of view. I enjoyed playing it, does have a special graphic and great game mechanics, the overall sound is good. Keeps you entertained and satisfied.",
            "review_score": "1"
        },
        {
            "review_text": "play a lot had fun even spent some cash but new update suck and to much bug aura dont work properlie on not all work monster dont always attack boss are overpower raid take to long when your hight rank proression is slow i had a great time but to much issue whit the game pile up",
            "review_score": "-1"
        },
        {
            "review_text": "Unoptimized grind-fest ported from mobile with clumsy, touchscreen-based, interface. Gameplay is your typical click-upgrade-wait-repeat. Graphics was ported along gameplay so expect to see huge pixels everywhere. I would suggest you to grab mobile version. It fits better to controls scheme, and its gameplay suits usual circumstances when we play on mobiles. Beside all of that game itself will keep you occupied for some hours if all you are looking for is to tap screen. Game is free so if you are bored to death this will give you some kind of questionable entertainment.",
            "review_score": "-1"
        },
        {
            "review_text": "Nice game which makes you wanna come back every day.",
            "review_score": "1"
        },
        {
            "review_text": "Feel free to explore the game! :D Oh yeah when you're leveled 5. Don't forget to use the my code : XGWAJJ for extra creature :steamhappy:",
            "review_score": "1"
        },
        {
            "review_text": "Unbelievably addicting. 8/10   I keep meaning to get through my other non-free steam games.... and then chucking several hundred hours into this instead, wtf self.  Fantasy TBStrategy meets MMORPG! The guilds are really friendly, the competition is fun, and each unit is creative and *just* challenging enough to be both a pain in the butt, but really really fun. Add friends for promos, follow them on twitter or FB, make sure you try at least once a day and you'll find yourself completely addicted too.  Add guilds and steam list friend codes for extra bonuses ;) And check out the facebook or twitter for even more promos!  The one 'downside' is that you are expected to know how to do this from the getgo. While it starts off very easy, there's no real tutorial and only hints for directions. -&gt; TIPS 101! You can and SHOULD move your pieces around, do not keep them static in between turns. You can speed it up, but UN-SPEED to move your pieces around. Splash damage is great for going through levels, and REPLAY LEVELS, you'll want to grind XP as much as possible! Going through a map without losing anyone (or using your revives) will get you 10 bonus meat -&gt; but the meat counter refills with time, so always make sure to have some used!! If you get meat from friends/guild quests/ETC. save it for when you really need it, and everytime your main hero levels up, the meat counter refills, so never use juicy meat/hearty meals just before leveling up. Also you can never ever EVER have enough gold, so don't waste it, and don't be afraid to hoard it for later. YOU WILL NEED IT. And ONLY use your fruits to fuse with units you use a lot and plan to use a lot. They're expensive, don't sell well, and are pretty hard to obtain.  REALLY fun game, Have fun!",
            "review_score": "1"
        },
        {
            "review_text": "so good and fun and is easy",
            "review_score": "1"
        },
        {
            "review_text": "Well it's not a bad game tho but some can get bored of it pretty fast since you don't have the ability to play 24/7 without waiting for your meat to recharge {  Meat  =  Energy  =  Heat  = Whatever  Chance  is called in another games}. Since it's a MMo game That means that no one can hack it since all the data are stored on the  Game's Server  So all the other players are legit   If there that means that I haven't figuered out how lol  . If you are into this type of games then I recommend it to you it's perfect. If you are not I'll still gonna recommend it to you lol you must try it. At some point u gonna need to spend a lot of money on DLCs so you can stand a chance to survive. But untill that point you gonna enjoiy it.  Edit: I've reached that point and uninstalled the game lol.",
            "review_score": "1"
        },
        {
            "review_text": "A lot of peoples said:'P2w, mobile game on pc, etc..' but, I never saw a free game with a great development team, support and care with players like this game. It's a hard game sometimes, but, even if u don't spend one coin, u can be a good player, only need dedication and time. Some peoples want to be strong in one week, in this game, even if u spend $1000 dollars, u won't be strong so fast, then I say that it's not a P2W game.   Great Game.  ",
            "review_score": "1"
        },
        {
            "review_text": "Its a nice game! If any takers, my I.D. is : VHRPHG",
            "review_score": "1"
        },
        {
            "review_text": "  This game is well worth trying out for Free. It's a great little time waster that you can play a fair bit of without ever spending a dollar. And if it does grab you... the paywall is yet another VIP tier based one. Not worth paying, only play it for free.",
            "review_score": "1"
        },
        {
            "review_text": "WaitForPlay in PayToWin Game. U don't need more information about this game. 0\\10$ in dev purse.  'Жди чтобы играть' Самая утомительная и кретиническая система взымать деньги из игроков - это вынуждать их платить за то, что они хотят играть в бесплатную игру. При таких раскладах проще купить любую платную игру в том числе ММО, требующие единоразовой оплаты. Вангую, игра умрёт из-за низкого онлайна т.к. вливать тысячи долларов в мобов, при этом не имея возможности играть столько, сколько хочешь - ни один вменяемый игрок не станет. Более того, в игре, где ПвП нет, хотя разработчику очень хочется верить в то, что оно есть. Да и сам донат был бы не так остро необходим, если бы игрокам дали возможность играть столько, сколько они могут(или хотят). Хотя стоп, это ведь значит, что разработчик перестанет получать деньги! Примитивное мышление наглых, бессовестных кидал.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a mobile port, done relatively poorly (there's lag sometimes, color depth looks like 16-bit), and the choice of Comic Sans font for literally everything is catastrophic.  A good time waster nonetheless. Can't honestly recommend since there are better ones out there though.",
            "review_score": "-1"
        },
        {
            "review_text": "Eh, the style is wierd, but it can bepretty nice",
            "review_score": "1"
        },
        {
            "review_text": "★ ★ I dont like farming games.  -----=====(QUICK INFO)=====-----  ★ ★ ★ ★ ★ I had massive fun playing the game, it felt great in every aspect of the game.   ★ ★ ★ ★ Good game, it did many things right, you should play it.   ★ ★ ★ OK game, not the best but not bad at all, you can skip it if you have better games.  ★ ★ Bad game, you shouldn´t play it.  ★ Garbage, don´t waste your time. ",
            "review_score": "-1"
        },
        {
            "review_text": "  For a free game I can't be to harsh on it but jeez.... ok let's just get this over with. Before I talk about this games pros and cons I'm just going to say that if they improve the gameplay I may, MAY, play it again :3  Pros- &gt; It's free and doesn't take long to get the hang of, &gt; A quest system! I love quests! &gt; I like it that you can check what the enemies stats are while in a battle &gt; There are multiple characters to pick at the beginning, giving variety to the play styles  Cons- &gt; The intro video doesn't tell you ANYTHING interesting about the game. &gt; I thought the quests would be decent, but they're REALLY not. &gt; The music might as well be wake me up inside ear ♥♥♥♥ &gt; The music is muffled, making it very unconfortable to play levels slowly &gt; The tutoriel kinda ends quickly and leaves you in the dark for a while, giving you blinds tips every few minutes, &gt; Ok ok ok, wtf is up with spiders, like seriously its difficult to get through the third/fourth level with them against you &gt; Your character/any of your people can be countered EASILY &gt; 'Collected' souls seem to be able to flee, how are they collected if they're going to flee?  But the thing that bugged me the most, was not the music, not the ads begging for you to spend some of your money (don't), but the thing that made me stop playing the game was the tutoriel. The tutoriel might aswell just give you the first level, show you where you can see our army outside of battle and then leave. It COMPLETELY defeats the objective of a tutoriel. Also, by the time you get to the end of the fourth level, all of your army members get either one shot by the mobs at the first wave, or deal NO damage what so ever, let alone the giant just ♥♥♥♥♥♥ you like there's no tomorrow.  Now, like I said it's a free game, so you cant say it's a waste of money, however it was a waste of my time, just clicking the 'go' button about 1000 times, please if you are considering to atleast try this game out you need to be calm at the beginning otherwise you won't get anyway (without buying anything with real money)  ~I hope this review helped you (if you actually read it)",
            "review_score": "-1"
        },
        {
            "review_text": "Done with this one. ♥♥♥♥ing feed to the top with this drop rate I have been trying to get monsters for my warlord evolution for a week and you need whole bunch of them and I wasn't lucky to get the lowest one for entire ♥♥♥♥ing week and game do this to me I Say ♥♥♥♥ you game you wasted enough of my time. LOWEST ♥♥♥♥ING MONSTER and it is only beginng you need two of them to make another than you need two more of them and one evolve specific monster egg or slime and another have nothing to do woth others at all just to ♥♥♥♥ with you and that is only one other one with the same mosters only diffirent color adding a system where you have to wait before you can replay levels and stupidest catching system I ever encountered I tried to be patient one week is my longest I can give to a F2P game.",
            "review_score": "-1"
        },
        {
            "review_text": "Good Content I love it Good DLC's also a great time killer",
            "review_score": "1"
        },
        {
            "review_text": "Forge of FUDS, so desperate they're giving half-arsed DLCs to pin the game in your library.",
            "review_score": "-1"
        },
        {
            "review_text": "Horrible mobile-style game. Typical 'guided' tutorial while spoiling the player with rewards to get them hooked, then putting up gem/energy/pay walls. This has been done thousands of times in recent years. Games 20 years ago had more imagination and identity.",
            "review_score": "-1"
        },
        {
            "review_text": "F2P my ♥♥♥... you have to either buy food (in-game time) with real money, or wait around (as food slowly restocks) in order to play this game... what a load of...",
            "review_score": "-1"
        },
        {
            "review_text": "lmao this game, if you use cheat engine you get banned 10/10 would vote down again",
            "review_score": "-1"
        },
        {
            "review_text": "Fun game for a casual type and a great time killer",
            "review_score": "1"
        },
        {
            "review_text": "After spending almost 300 hrs playing this game I believe I've gained a greater understanding of the finer working for this game. If you have no prior knowledge to games that use the fuse and evolve mechanisms you might find yourself at a great disadvantage. I'll simplfy things by simply saying seek and save evey Elite unit you can. In the long run only the Elites are worth Evolving, and do yourself a favore and find out what units max beyond tier VI. Get yourself into a guild ASAP!! It's vital to be able to collect as many units as possible to be of any use in the game. If you simply want to play the story map I'm sure you could be done within a month maybe two. I don't understand the reviews that state they couldn't play for more than a couple hours each day. In the beginning if you do your leveling right you'll have your food totally restored and can continue to level through the map. I never ran into an issue of not having enough food until the higher levels. So yes strategy is a must in this game. But let's not get ahead of ourselves. Luck is a big factor also. Instead of trying to fashion an Army I simply worked with what they gave me. I spend very little time farming for the sake of reborning a unit, to obtain what I want. I will reborn units to make units that I have a lot of simply to raise them up to a higher Tier. The game uses food and you have to give a number of food to run a mission, usually 20. You have flames that limit the number of attacks you can conduct for PVP. The food takes some time to replenish the flames are much faster.  I nearly gave up on this game a month ago. It was starting to feel like a lot of work. So much farming to bring units up. To cut back on farming time I buy more space for my army. In the beginning we was receiving a lot of gems (in game currency, you can purchase these but they are very expensive). Yes like any Pay 2 Win game we have our fare share of Whales. But they all seem to fall into the #1 guild and never seem to bother us. We usually land in #4 spot. Okay so I don't buy gems but I do buy the premium deal for 4.99/ month this gives me 40 gems a day wich I save to buy space for my army. I'm currently at 290 spots and next Friday space is half off I will buy and additional 50 spaces. This allows me to farm more effectively.  One more thing there is something that we have no control over that is the percentage of Elite and Rainbow units we can receive from farming or simply leveling up. And for those who cry about not having enough food to keep leveling really don't understand the mechanics of the game. If these percentages fall to low, as I stated first and for most the only units worth keeping are Elites!! Then you should back off and allow the percentages to replenish.   WolfRuddle is my Guild. I'm Uncanny. Sorry I don't know my code off hand or I would include it. But honestly I don't need the additonal units for simply inviting a friend. But I am very active and constatly update my friendslist to take on those who are just as active and cutoff those who have fallen behind.  I started on day one of the release date for Steam. It takes a tremendous amount of time to be effective in this game. That or a whole lot of money... About $1000 would buy you a very kick ♥♥♥ army, anything less and it might not be worth putting any money into it at all. Unless you want to play all the time then the 4.99/ month is the best deal. You can upgrade the 4.99 to 9.99 and enjoy double the benefits for a month. Do yourself a huge favore and pay the 4.99/ month!! Some of these guys have been playing for a couple years while it was in Beta phase so don't be suprised to see an army that is worth $1,000's. If you was to try and complete with that army from day one it would take so much money to get it.  In reveiw: SAVE EVERY ELITE YOU GET IN THE BEGINNING! LONG RUNNER TIME SAVER BUY LOTS OF SPACE FOR UNITS!! PAY THE 4.99/ MONTH. JOIN WOLFRUDDLE!!",
            "review_score": "1"
        },
        {
            "review_text": "Great, well planned game that you don't need to spend to compete. Just be prepared to spend a lot of time playing. I see some reviews that complain that to be very top you have to spend to win, but the game does a good job of not having you compete again players those spenders. The very top guild is probally all spenders but anywhere you be a part of",
            "review_score": "1"
        },
        {
            "review_text": "very nice i enjoy it so much",
            "review_score": "1"
        }
    ]
}