{
    "app_id": 462030,
    "name": "BitRay",
    "release_date": "2016-04-20",
    "developer": [
        "Riviysky"
    ],
    "publisher": [
        "Riviysky"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Casual",
        "Indie"
    ],
    "tags": [
        "Casual",
        "Indie",
        "Puzzle"
    ],
    "achievements": 0,
    "positive_ratings": 360,
    "negative_ratings": 132,
    "price": 0.79,
    "description": "BitRay is a simple puzzle game in which your task is to destroy all the red cubes, and do so all the white appeared on the platform.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/462030/header.jpg?t=1529886480",
    "minimum_requirements": "OS: Windows® 7/8/10 Memory: 512 MB RAM Graphics: Video card must be 256 MB or more and should be a DirectX 9 DirectX: Version 9.0 Storage: 40 MB available space",
    "recommended_requirements": "OS: Windows® 7/8/10 Memory: 2 MB RAM Graphics: Video card must be 512 MB or more and should be a DirectX 9 Storage: 40 MB available space",
    "reviews": [
        {
            "review_text": "Fairly short game, one of those times where I'd neither recommend it or otherwise, but negative seems more appropriate.  Pros:  -Nice, simple design -Some challenging puzzles -Only .99 USD   Cons:  -Very short -No saves (Claims it's too short to do that) -Very repetitive music (Restarts upon level start, level restart..) -Blocks falling in front and behind the platform, even though it's a flat game (Maybe they could implement that in a BitRay2, 3d!)  Overall, an okay game for on sale / obtained in a bundle, or blowing a buck on a little challenge.",
            "review_score": "-1"
        },
        {
            "review_text": "  No save function. Everytime you start it you need to start over.",
            "review_score": "-1"
        },
        {
            "review_text": "  Wtf there are a lot of levels, the game is great and all, but there's no save function. That's as if every time you launched farmville you started again with a lvl 1 farm",
            "review_score": "-1"
        },
        {
            "review_text": "An okay time waster. The levels slowly get harder and new objects are added as you progress.",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun little game. It's sort of like reverse Jenga, where you have to leave only a certain block. To spice things up, some blocks have special functions that chnage the gameplay. Although it has no save feature, the game only takes about 30 minutes to complete. Quick and easy fun when bored.",
            "review_score": "1"
        },
        {
            "review_text": "  This game is simple and calming but takes some stratagy. Get the game yourself it is worth it :D",
            "review_score": "1"
        },
        {
            "review_text": "  Ugh, I know it's cheap, but there were more complex games for free in flash in past. This game is a bit weird - although objects are 3D, our view is 'side' 2D, it still can go 'farther' or 'closer' to us and fall off platforms.  Music very repetetive - it starts playing every ♥♥♥♥♥♥♥ level. Buggy - it says ALL whites must be on platform which is not true. Short - less than 30 minutes of gameplay. No cards. Not really much anything.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a key to my stress levels IVE NEVER BEEN GLAD ENOUGH TO KILL MYSELF PLAYING THIS GAME DO NOT BUY THIS GAME I MADE A MISTAKE CUZ OF THIS HOE SO DO NOT DO WHT I DID STAY AWAY FROM THIS GAME 🔪🔪🔪🔪🔪  Thanks Have a nice day :)",
            "review_score": "-1"
        },
        {
            "review_text": "  This game is lacking a save button, but it doesn't really matter since it takes 20 minutes to beat. It was pretty fun though, so it's worth playing if you got this for free. There's some better use for the money though, if you're looking for low budget games.",
            "review_score": "1"
        }
    ]
}