{
    "app_id": 462130,
    "name": "Momentum",
    "release_date": "2016-08-11",
    "developer": [
        "Projectile Entertainment"
    ],
    "publisher": [
        "Projectile Entertainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Indie"
    ],
    "tags": [
        "Indie",
        "Physics"
    ],
    "achievements": 29,
    "positive_ratings": 14,
    "negative_ratings": 5,
    "price": 6.99,
    "description": "Overcome obstacles and subvert gravity in this difficult 3D physics-platformer. Race against time as you rotate 3D labyrinths to navigate through them. Reach a zen state of mind through challenge, focus, and atmosphere.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/462130/header.jpg?t=1482618785",
    "minimum_requirements": "OS: Windows 7 Processor: AMD Phenom II X2 555 / Intel Core i5-430M / ~ 2GHz Memory: 2 GB RAM Graphics: GeForce GTS 450 / Radeon HD 6770 DirectX: Version 9.0 Storage: 500 MB available space Additional Notes: The above has merely been an estimate, but a demo is available if you're concerned.",
    "recommended_requirements": "OS: Windows 7 Processor: AMD Phenom II X4 945 / Intel Core i5750 / ~3GHz Memory: 2 GB RAM Graphics: GeForce GTX 670 / Radeon HD 7990 DirectX: Version 11 Storage: 500 MB available space",
    "reviews": [
        {
            "review_text": "  I havn't played enough hours of the game, or progressed far enough along to create an 'actual' review on my youtube channel.  (youtube.com/c/guylogicgaming)  But i felt the need to at least give you my first few hours of impressions.   ...aaaaand... it's boring with sub par controls.   Now again, it might pick up later, but after playing about hte first ~20 or so levels i was mostly frustrated at the game and it's constant need to irritate me with the controll scheme. The idea of dual Ball movement and 'world' movement is cool, but the added notion of hte camera and world movement being tied into viewport really messes with your precision.  Now, while the game does bring in SOME variety in levels, they come in slow and slower. the first 15 or so levels are all 'floating maze in sky above city backdrop' and are about as interesting and compelling as watching paint dry.   So based ony mfirst 2 hours of gameplay, this game has mostly frustrated me due to it's controlls and absolute blandness in aesthetic.   but hey... It's HARD and DIFFICULT so you'll turn it of every 15 minutes to calm down when the ♥♥♥ of a camera screws with you again.",
            "review_score": "-1"
        }
    ]
}