{
    "app_id": 46260,
    "name": "Star Wolves 3: Civil War",
    "release_date": "2010-03-02",
    "developer": [
        "Elite Games Team"
    ],
    "publisher": [
        "1C Entertainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "RPG",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "RPG",
        "Space"
    ],
    "achievements": 0,
    "positive_ratings": 312,
    "negative_ratings": 89,
    "price": 3.99,
    "description": "Large-scale battles have become a vestige of the past, depleting resources of conflicting parties. Settled space, where welfare and order had reigned, has become a cemetery for dead ships which is flooded with pirates and adventurists.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/46260/header.jpg?t=1553175419",
    "minimum_requirements": "OS: Windows XP Processor: Pentium IV 2.0 GHz or AMD 2.0Ghz (Single Core) Memory: 512 MB Graphics: nVidia GF FX5700 or ATI Radeon 9600 with 128MB VideoRAM DirectX®: DirectX 9.0 Hard Drive: 5.5 GB Sound: Sound card compatible with DirectX 9.0",
    "recommended_requirements": "OS: Windows XP/Vista Processor: Pentium IV 2.8 GHz; or analogous AMD (Single Core) Memory: 1 GB Graphics: nVidia GF 6800 GT or ATI Radeon 1900XT with 512MB VideoRAM",
    "reviews": [
        {
            "review_text": "Has BG/ BG2 pause system , but in space! Mothership acts as floating base for up to 6 fighters. ♥♥♥♥♥♥♥♥s of tech and pilot RPG elements. Kinda buggy save alot, lots of text so you may have to read, short story. As a saving grace it has a huge solor system with lots of factions and infighting.",
            "review_score": "1"
        },
        {
            "review_text": "this game is one of my oldest favorite   there are many different endings the stories goes to different paths  sometimes, it is hard and this game is not sutiable for relaxing players but it has its own unique gene and style  if you are a thinker, this game is for you",
            "review_score": "1"
        },
        {
            "review_text": "One of the best tactical RPG Space Sims ",
            "review_score": "1"
        },
        {
            "review_text": "This is a beautiful game, full of exploration, weapon/fighter/equipment/capital ship variety and garnished with awesomness.  Yes, it could be better, but it's for YOUR safety.   If it was a little more sandbox-ish and open-ended, with some sort of random-mission generation to add more variety, maybe some sort of transport/capital ship auction house, it'd make this game the best tactical space sim ever. I even *like* the voice acting.   However, if they *did* put these things in, you'd lose friends fast. They'd ask you to come out, but this would mean less time playing SW3, so you'd make excuses not to, and eventually the calls and messages would stop. Then you'd forget to drink, eat and sleep, and eventually you would die.",
            "review_score": "1"
        },
        {
            "review_text": "pretty nice scifi RPG / mini-homeworld like hybrid. but i came to a point where i could not finish a mission, and the savegame didnt work either so i quit. russian raw jewel with bugs.",
            "review_score": "1"
        },
        {
            "review_text": "A cool, almost great, game rendered unplayable by bugs and badly written everything.",
            "review_score": "-1"
        },
        {
            "review_text": "such wolves, much game, wow",
            "review_score": "1"
        },
        {
            "review_text": "gameplay 4/5 storyline 4/5 graphics 4/5  overall 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "How to star wolves 3: 1.Get in and play the tutorial OH WAIT THERE IS LITERALLY NO ♥♥♥♥ING EXPLANATION ON HOW TO PLAY THIS PIECE OF UTTER ♥♥♥♥ 2.REALIZE YOUR MISTAKE 3.UNINSTALL THIS GAME 10/10 would buy again",
            "review_score": "1"
        },
        {
            "review_text": "This is the developer's only game on Steam. And it's a 1C game, which means it's a half-finished product of a handful of well-meaning Russians. This just doesn't compare well to X-universe games. And it has mouse-click-based space travel? Wtf?",
            "review_score": "-1"
        },
        {
            "review_text": "Dont buy this crap game it sucks!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "This is THE BEST space strategy game I have ever seen. It' allows for colossal replayability value because of a multitude of storyline decisions, has very cool ship &amp; gear customization, nice mechanics, immersive combat and a very intriguing storyline. Trust me, I have seen all worthwile space games in the last decade+ (check my gamelist), there is nothing that even comes close to this, even EVE. If you like it try out previous Star Wolves games for the sheer story and gameplay. Worth a LOT more than its price",
            "review_score": "1"
        },
        {
            "review_text": "Super great game one of my top 10!!!! I wish they'll relase 4 soon.",
            "review_score": "1"
        },
        {
            "review_text": "Ok, I bought the 1c Space game pack on sale for 6$ and this game kind made it worth it. I did not really like Space rangers HD, or the UFO series, only this I really liked. (Parkan 2 was a decent game) I sort of like the story, but it is WAY TO LINEAR. I found myself wanting to do one thing, when I was forced to do something else, I felt very restricted during it. Space seems empty, rarely ever encountering anything (Mods helped). I Haven't beat it yet, but so far, the only voice acting is just from the start (and possibly the endings) I get very little editing to my character, not even a simmple gender or race to choose from, I am automaticly just some guy, who I can't customize. Now the missions in these games are repetitive, fly to this zone, fly to this zone, fly to this zone, kill someone, rinse and repeat throughout the entire game so far. And guess what, if I don't do what the Game wants me to do in a certain mission or two, I AUTOMATICLY DIE IN A CUTSCENE. Like... WHAT!? Like here is an example, generic pirate lady and I have to set sail to some system to get an ID change on our ship, if I stray off to a small station, just to change my current weapons, since the starting ones sucked, I GOT INTO A IMMIEDITE CUTSCENE OF DEATH. Combat is ok, trading sucks, not much explanation of how the game works, Tutorial does a crappy job. Kinda hard to make money unless you are doing a mission. Pirating doesn't seem to get me into really ANY trouble and I make some side cash off it, good job government, I get away with pirating, RIGHT NEXT TO YOUR GOSH DARN BASE...! The graphics are ok, kinda edull for a 2010 game, the game feels more like a 2004-2007 game. It could really have more diplomacy features and more interactive non-linear gameplay. Also, for some reason some MASSIVE SHIPS at shipyards are completely free, got a huge alien destroyer free of charge for no reason at all. Doing this though made the game stop working. So after floating around for a little while with it, I got a deathscene of death again. The game is much better then other 1c Space games, But I don't recommend it to newcomers of the genre or even experienced members, hard-core members at best. Not much exploration either, all the systems feel the same and junky. And I just want to point out one little, last thing before I end the review that really, REALLY BOTHERS ME ABOUT THIS GAME. When attacking Government officials that have threatend to fine you if you don't, move away from a portal after a little bit, you are still fined... I mean, I was talking to a friend on steam, just came out of a portal and guards threatend to fine me if I didn't move out of the way for other people, so I blasted them away with my cannons, YET I AM STILL FINED!? 6/10. 7/10 with improvements added, highly doubt that will happen though. Buy it if you really are a sci-fi stategy or Star wolves Fan, also, get it on a sale.",
            "review_score": "1"
        }
    ]
}