{
    "app_id": 462780,
    "name": "Darksiders Warmastered Edition",
    "release_date": "2016-11-29",
    "developer": [
        "KAIKO",
        "Vigil Games"
    ],
    "publisher": [
        "THQ Nordic"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure",
        "RPG"
    ],
    "tags": [
        "Action",
        "Adventure",
        "Hack and Slash"
    ],
    "achievements": 43,
    "positive_ratings": 5250,
    "negative_ratings": 933,
    "price": 19.99,
    "description": "Deceived by the forces of evil into prematurely bringing about the end of the world, War – the first Horseman of the Apocalypse – stands accused of breaking the sacred law by inciting a war between Heaven and Hell.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/462780/header.jpg?t=1536302874",
    "minimum_requirements": "OS: Windows 7, Windows 8, Windows 10 Processor: Intel or AMD Dual Core CPU Memory: 4 GB RAM Graphics: DirectX 10 Feature Level AMD or NVIDIA Card with 1 GB VRAM DirectX: Version 11 Storage: 36 GB available space",
    "recommended_requirements": "OS: Windows 7, Windows 8, Windows 10 Processor: Intel or AMD Quad Core CPU Memory: 8 GB RAM Graphics: DirectX 11 Feature Level AMD or NVIDIA Card with 1 GB VRAM DirectX: Version 11 Storage: 36 GB available space",
    "reviews": [
        {
            "review_text": "This game was epic when it came out 2010 And it was epicer when it came out 2016.",
            "review_score": "1"
        },
        {
            "review_text": "Darksiders Warmastered Edition is a game that I recommend because: - it is a method to banish boredom - it has a good price - it is a good RPG - the graphics are good - it has action - it is third person - it has trading cards  Enjoy!",
            "review_score": "1"
        },
        {
            "review_text": " I have played this game before it was cool!",
            "review_score": "1"
        },
        {
            "review_text": "  I liked this game before but it's amazing! And it was just a gift! I like it very much. I hope some day the other two Horseman may come to reunite as two other games. I suggest it for everyone who like brutal fighting against the Evil.",
            "review_score": "1"
        },
        {
            "review_text": "  Thank you everybody at THQ Nordic! This remaster looks and feels great to play.   I'm not going to go into depth about the game (it's Darksiders, it's a modern classic, You should absolutely do a playthrough and then play the sequal) Initial testing getting 95fps everywhere and couldn't be more pleased with the results and graphical tweaks.  Honestly if only this game came out a day earlier you would of been a shoe in for a Steam award nomination.",
            "review_score": "1"
        },
        {
            "review_text": "  Very cool and looks great , and it was Free ! -Thanks",
            "review_score": "1"
        },
        {
            "review_text": "I played this SO many times on the 360 and now I've started it on my laptop. So far the remaster is great. Runs nice and smooth and with the higher resolution it's even more beautiful!  If you love Joe Madds wonderful and exuberant designs - then this is a must buy. (They are utterly over the top but make perfect sense within a game world where EVERYTHING is over the top!) The characters and locations are truly beautiful with a wonderfully singular art direction. It's as near to playing a Joe Madd comic as it's possible to get.  If you love Zeldaesque game design where your progression is linked to finding new items and abilities, unlocking new areas and enemies - then buy this. (Every single stage shows you something new and exciting, letting you try new skills and methods of traversal. It never runs out of ideas, even managing to throw a portal gun into the mix!) It will last quite a while too, as there is an awful lot of content to discover.   I played it with a 360 controller and I think thats really how it's meant to be played. If you love games that have that invisible 'quality', that wonderful sensation that makes it just feel 'right' to move around in then this is a must buy. The controls are fluid and fun, with War, the player character feeling chunky and full of 'heft'. Every single blow and dodge is a joy to pull off no matter how many times you mash the buttons.  The only downside I can find is the story. It somehow manages to be both painfully simple and overly complicated. Everything is a cliche and seemingly written for a thirteen year old. It's a bad mix of catholic fairy story and invented trash that never quite comes together. Think the worst White Wolf 'world of Darkness' campain mixed with the post it notes from the set of an episode of Supernatural. Yes, it really is quite that bad.  Yet thankfully that small blemish never stopped me from falling in love with this game. (and its sequel!) You will have a blast with this game! It's beautiful to look at, stylised and inspired, fun to play, with a load of great ideas and mechanics taken from different games and genres, it has bucket loads of content and ideas and all obviously made with care, love and a lot of joy.  Buy, buy, buy!",
            "review_score": "1"
        },
        {
            "review_text": "  Love this game, still great",
            "review_score": "1"
        },
        {
            "review_text": "WARNING TO AMD USERS The developer released a patch to fix most AMD problems, play the game at your own risk but it should be fixed for the most part  Essential Purchase Recommended Buy it on a sale Avoid at all costs   I finished this game already on a binge play offline, the rest has been on a new game with the steam interface FINALLY fixed What it did right Warmastered Edition completely re-renders the cutscenes, offers higher quality textures, and not as nearly enough problems as the Deathinitive Edition offered and fixes the Steam Overlay bug that a lot of users had been experiencing, at least for the most part; you may run into it yourself, so try running the game as administrator.  The Problems As it stands now, the warmastered edition has problems with (and each problem will be crossed out as it's fixed): - No Steam Controller, and Limited Official Controller support - Limited widescreen support with 21:9, etc. - Audio Problems: Syncing, Subtitles, Cut-Outs - Crashing in certain areas (Check the forums for reports by other users as I never had this problem) - Some achievements are broken for quite a few users, such as Slayer - Importing Saves causes them to become corrupt (test on latest version of Darksiders) And that's about it really, achievements are able to be earned, steam trading cards are able to be distributed, and it'ss had a better launch than Darksiders 2's remaster by Gunfire.  The Conclusion It's worth a look, any previous owners of darksiders that've owned the game BEFORE the 29th gets it for free, and It's another excuse to dive back into the world of Darksiders as War.",
            "review_score": "1"
        },
        {
            "review_text": "  I like it, not noticing much difference, the optimisation is horrible, even with the 8gb GPU I'm getting 15 to 30 fps and on some levels full 60 and down to 35.....This needs to be fixed. I can run other games that are more demanding at Ultra everything and get fluid 60fps, this game not so much.  Either way it was a free upgrade for me since I own the original.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Finished this game on the XB360 years ago. This remastered version is even better, runs at 60 fps and looks beautiful. Huge props to the developer, THQ Nordic. This is how you do a proper remaster on PC. Although I received it for free since I had the original version, this game is easily worth $40. Highly recommended!",
            "review_score": "1"
        },
        {
            "review_text": "  Nothing new to speak of in this version of the game content wise, but Darksiders has never looked prettier, and is still the better more focused game of the series and one of my favorite games of last generation.  I just wish they added a way to replay the one off rail shooter and 3rd person shooter sections without just having to keep a seperate saves for them.",
            "review_score": "1"
        },
        {
            "review_text": "I'm not big on writing page after page on games, so I'll keep it short.  Just finished (re)playing Darksiders (2nd run, with the Warmastered Edition) and Darksiders II (never finished that one before). Just an amazing games series, even though the gameplay is completely different.   Where Darksiders is more a (mostly) linear platform puzzle hack &amp; slash, Darksiders II has more RPG elements to it, with side quests, free roaming and buying and selling of (upgradable) gear. The gfx style is spot on and the story really entertaining. The voice acting also probably couldn't have been better...  Finally: I find it VERY disappointing that parts III and IV (Strife / Fury) will probably never be released :-(",
            "review_score": "1"
        },
        {
            "review_text": "  upboat for free gam",
            "review_score": "1"
        },
        {
            "review_text": "Good old hack and slash. It was that simplicity and the interesting puzzle solving from the good old days. No fancy graphics no fancy dialogue. Just plain solid gameplay.   Some of the camera angles are kind of awkward but can be easily gotten used to after a while. *note. there will be some bugs with the cursor (aim mode on PC). Hope they fixed it*  Overall, I loved it and get to really kill some rage by spilling virtual blood. Super satifactory to kill stuff in this game.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games ever made, it has a very compelling story and the artwork is very unique and together they create a very impressive game!",
            "review_score": "1"
        },
        {
            "review_text": "  I see people with AMD gpu's complaining, i dont know if its patched but it works fine on my HD7850.",
            "review_score": "1"
        },
        {
            "review_text": "So far, great hack and slash gameplay and cool setting. Recieved it for free which is a bonus. One downside is very patchy performance on my system 90fps in someplaces sub 20fps in others, i've heard its only on amd gpus so hoping for a patch or driver update to fix.  Edit: Fps Issues Fixed.",
            "review_score": "1"
        },
        {
            "review_text": "  I was already playing the original Darksiders a few years ago and loved it. This remaster is the modern edition this game deserves. It's got nice HD grafics and better shaders, and it is running flawlessly on modern systems. Unfortunately they didn't change some silly GUI buttons that obviously made it to the PC version because it was ported from consoles, what has been used with controllers only. For example in your inventory you can't click on the map-button, you need to click on the arrow buttons until the map button gets highlighted. But you get used to it and the controls of you character with keyboard and mouse is just fine, there is really no need to buy a controller to enjoy the game! :)  If you don't know the game yet but you like to play action-adventures and this comic art style (I personally think it is just awesome!) you should not miss this gem, go and buy it now! ;)  If you already were playing the original Darksiders on consoles and are looking forward to play the game again on high definition grafics, you also could consider to buy this one as well. However in that case I'd probably wait for a sale so you don't feel like you bought the game twice. The primary changes seems to be rather only on the optical side plus Steam trading cards and cloud save support and obviously some technical fixing that are behind the scenes.",
            "review_score": "1"
        },
        {
            "review_text": "  Performance fixed! thank you.  GTX860m.",
            "review_score": "1"
        },
        {
            "review_text": "Gameplay, history, graphics, voice acting are great! but if you expect to beat the game on APOCALYPTIC mode in order to get the archivement you should expect some dark souls insanity!",
            "review_score": "1"
        },
        {
            "review_text": "Very ORIGINAL story, very intriguing ideas. I wish they put more backstory/lore in the game though. Still a plus. Combat looks really cool due to many combos and the fact that you have to always be moving. Boss fights are kinda lame, I needed a walkthrough on about half of them because it’s often not that straightforward. Now that I know the developer’s style though, it’s still a plus. Great, deep dungeons. I hated having to go back through everywhere for newly-reachable loot each time I got a new ability though.  Overall, very worth it (especially because I got it on sale). I am moving onto Darksiders 2!",
            "review_score": "1"
        },
        {
            "review_text": "Great Hack and Slash combat and interesting lore. The warmastered edition looks nice and sharp and support resolution up to 4K. Not your typical straight forward action game. Fair warning, this game has some very hard old school and time consuming puzzle to figure out if you're the type to want and figure out on your own. One particular area toward end game will really test your patience and smarts. Overall for $5 this is a must play for any action gamer. Pick it up during a sale. Very underrated compared to god of war series",
            "review_score": "1"
        },
        {
            "review_text": "  Good game, now with some better visuals. Received it for free, not sure why maybe because I owned the original or because I own darksiders 2 deathinitive edition aswell.",
            "review_score": "1"
        },
        {
            "review_text": "  I liked this game. Its story is great, its visuals are good.  However it's full of ♥♥♥♥ing glitches. 2 times i had to re-do 2 hours of progress because I glitched through some wall or because an objective failed loading.  When I was nearing the last boss (The Dark Throne level) i glitched through a blue barrier, and a checkpoint saved there for me.  Now I can't get passed the barrier and thus can't continue my game. Ininstalled that ♥♥♥♥ as soon as I figured out there was no way back. I'm not going to re-run through all those puzzles and fights again.  4/10. Glitches ruined the ♥♥♥♥ out of it.",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty smooth so far, havn't ran into any bugs hitches with framerate. Great remaster, great play, great game.",
            "review_score": "1"
        },
        {
            "review_text": "  This remaster is an remarkable posture for Nordic to be 'new THQ'  Colorful tone replace the formor dim image is really makes my eye comfortable.  anyway keep working THQNordic, looking forward you bring more exquisite games for world.  by the way, the next two section of Darksiders should have no one else but Joe Madureira to be the main art director!!!",
            "review_score": "1"
        },
        {
            "review_text": "This game is a blast to play!!!  10/10- T0X1C",
            "review_score": "1"
        },
        {
            "review_text": " It's like a Zelda game that can't decide on what it wants to be.",
            "review_score": "1"
        },
        {
            "review_text": "  Really fun game,cool moves,lots of destruction. 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "  the game is just awsome! got it for free coz I had the original, what to say? better graphics, smoother gameplay and amayzing story. shourlly give it a try. for me this game is classic. :)",
            "review_score": "1"
        },
        {
            "review_text": "this game run on AMD vga like scrap , my xeon 1231v3 + R9 380 only have 30-50 fps 1080p in this game ... and some time drop &lt;20fps .... , pls fix !",
            "review_score": "1"
        },
        {
            "review_text": "for FFS both Darksiders II Deathinitive edition and Darksiders Warmastered are in the same HAVOK engine from 2012 and older which uses double the power from CPU for PHYSX if u remaster this games made in HAVOK engine at least use the newer HAVOK engine which halfs the resources from the CPU for PHYSX!!! I'm big fan of Darksiders franchise but this is not the way u remaster games thats why they still have poor frame-rates.. -.- DO SOMETHING ABOUT IT..",
            "review_score": "1"
        },
        {
            "review_text": "  I liked the original a lot and this version just makes it even greater.",
            "review_score": "1"
        },
        {
            "review_text": "Short background between me and this game, I haven't played the standard Darksiders game, and I have only completed the game on Normal mode.  So, the cons of the game are • horrifically confusing storyline • ridiculously easy enemies (didn't have to block too often) • not a lot of character development or storlyline/plot twists • characters themselves are pretty bland • control scheme is a bit clunky (unless you use a controller like I did) • enemies are modeled after one another, but each one is slightly more difficult • a few bosses felt like overpowered enemies, and not actual bosses (if that makes any sense) • disappointedly small amount of weapons to use  Pros • diverse and colorful landscapes/scenery • impressive inspiration for the universe the game takes place in (heaven and hell with man in between, and the charred council as mediators between heaven and hell, with the horsemen as keepers of the peace that the Charred Council has created), although it feels rather... 'shallow'; not a lot of depth, lore, or explanations of anything. • a broad range of abilities to traverse around the world • sequel before Darksiders 2 (duh)  Additional notes: there are a LOT of puzzles towards the end, so don't worry if you get stuck at one point. They don't require much of you to overcome. Not a lot of thinking outside of the box, more like being aware of everything in the area first so you don't just look in the same place expecting for all the answers to be there. Also, this game has a TON of hidden items around the map, and it's a pretty big map with a lot of hidden areas. Most of those are only reachable when you have the required ability  Overall: this game I expected a bit more out of, but I was sort of let down. But in the end, it wasn't that bad of a game. The only thing I didn't like about the game was that it really didn't have a lot to pull you in to the world, and the storytelling was poor. Would I play this game again? Probably not. It's one of those games I would play just so that I know what to excpect from the sequel.",
            "review_score": "1"
        },
        {
            "review_text": "Runs great and looks great!",
            "review_score": "1"
        },
        {
            "review_text": "I should be able to run the game with no difficulty, acording to the system requirements, but somehow I have to lower the settings to the point where the textures look like Wolfenstein 3D. My PC can run The Witcher 3, Overwatch and Batman Arkham Knight super smothly. At least make the original game available for those who bought the remaster if you're not gonna fix it.",
            "review_score": "-1"
        },
        {
            "review_text": "  The game itself is fantastic, i played on the Xbox 360 years ago and loved it!  Running the game using a 390x gcard and its just a stuttering mess, getting about 5-15 fps.  I hope this is fixed soon as i loved this game and would love to have another playthrough on it.",
            "review_score": "-1"
        },
        {
            "review_text": "It can be fun at times, but I found the combat to be very clunky. Compared to something like Devil May Cry/God of War/Metal Gear Rising Revengeance, this felt frustrating and mediocre. The setting is unique and I liked the Legend of Zelda-esque dungeon that I played through, but the clunkiness of the combat killed my desire to play.",
            "review_score": "-1"
        },
        {
            "review_text": "Okay so the game finally looks alright and supports controllers. But it's still a carbon copy of Devil May Cry with more annoying platforming. Go buy DMC instead",
            "review_score": "1"
        },
        {
            "review_text": "Game is crashing in every cutscene. Runs fine though, but I don't really wanna skip every cutscene in the game. Will recommend once this is fixed.",
            "review_score": "-1"
        },
        {
            "review_text": "Played it 6-7 years ago on xbox and loved it This PC version is unstable",
            "review_score": "-1"
        },
        {
            "review_text": "Pathetic. I can run the Witcher 3 at 60fps, but this games gets 14-15. Absolutely unplayable until it's fixed. I'll change my review when they patch it.",
            "review_score": "-1"
        },
        {
            "review_text": "The worst game I've played it so complicated and worse",
            "review_score": "-1"
        },
        {
            "review_text": "Dated graphics and boring, generic gameplay that can be found in any F2P JRPGMMO.",
            "review_score": "-1"
        },
        {
            "review_text": "Just finished the Warmastered Edition and it was a really fun ride!  Well worth the money with really smooth gameplay and only one crash a day after it came out.  The story can lag in a few places where you spend more time solving puzzles than shredding foes but otherwise a lot of fun fights with cool weapon combinations.  Thoroughly enjoyed it!",
            "review_score": "1"
        },
        {
            "review_text": "  Great remaster. Would highly recommend to anyone who's a fan of hack'n'slashers.",
            "review_score": "1"
        },
        {
            "review_text": "  War, one of the four horseman. What a great remaster and so happy that it's free to gamers who own the original Darksiders. Constantly getting 95 FPS on my GTX 1080 along with great audio sound. Very fluid gameplay. I did play this years ago on console and it still one of my favorite hack and slash games. Thank you THQ Nordic!",
            "review_score": "1"
        },
        {
            "review_text": "This is what a Remaster should be. Keeps the style, sharpens it up to 1080p, and is 60 frames a second. Might not be as big of a jump as what you'd see on consoles, but hot damn it's Darksiders.",
            "review_score": "1"
        },
        {
            "review_text": "  A much needed and deserved PC port fix and visual touch-up of this future classic. The game combines elements of early 3D Zelda with God of War, resulting in an epic journey through a post-apocalyptic world filled with witty writing and tight puzzle'n'slash gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "  A much needed and deserved PC port fix and visual touch-up of this future classic. The game combines elements of early 3D Zelda with God of War, resulting in an epic journey through a post-apocalyptic world filled with witty writing and tight puzzle'n'slash gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "Played this for about an hour so far, and experienced one crash.  As far as the game itself, I have never played the Darksiders series, but this game is pretty fun. Reminds me a bit of God of War, but with it's own style. The graphics are very nice.  Playing on an Nvidia 965m.",
            "review_score": "1"
        },
        {
            "review_text": "New to the franchise but this game is very enjoyable. Started Darksiders 2 a few days ago then saw this remaster was $4 today. Going to play this one before 2 now. Clearly I was missing out on an awesome series.",
            "review_score": "1"
        },
        {
            "review_text": "  All issues with AMD seem to have been fixed! Alright, the game gets a full recommendation from me now. I'll update this review later with more detail after I re-play this masterpiece.",
            "review_score": "1"
        },
        {
            "review_text": "*UPDATED REVIEW POST PATCH*  Initially there were some pretty severe performance issues for people with AMD cards but the developers have been great, in constant contact via the forums and worked non stop to release a patch to fix the issues which (for me at least) has been fixed!  Darksiders is a great game and this edition is as fantastic as I remember it being and then some, well worth a revisit!  It was disappointing that the product didn't work for me on release but I cannot fault the staff at Kaiko for the promptness of their response. Good job guys (y)  *The only minor issue I suffer now is the audio in game custscenes is a little off but it's not too bad*",
            "review_score": "1"
        },
        {
            "review_text": "Fun, Comicbook, Puzzler, Zelda Any of the above are what your looking for in a game grab this.   THQNordic continue to update there back catalog.    Originally posted by  THQ Nordic  :",
            "review_score": "1"
        },
        {
            "review_text": "Unplayably poor performance on amd cards. Running a r9-380x and I dont get better than 15 fps in the openeing. PLEASE FIX!!!!!!   Following recent patch, all issues fixed. Perfect 60 FPS plus. Thank you so much for the quick fix!!!!!!!!!!!!!!!!!!!!!!!!!!  Great Game",
            "review_score": "1"
        },
        {
            "review_text": "An old game from 2010, but a pretty good one.  It's an action game where you battle hordes of demons and a few dumb_♥♥♥ angels to get your powers back . The fighting moves are pretty slick and non-button mashing type! You have to time them well to chain combos togheter. The fighting is very well made and top notch.  Positives: - Fighting is really good - Nice graphics even for today - Sound is great - Level of difficulty are well done (easy is easy, normal is normal and hard is tought) - Puzzle challenges are fun, a bit challenging but not too much to pull your hairs out - You can improve your insane weapons, get new ones and a boatload of new abilities and powers and whatnot  Negative: - The story is non-sensical. A bit original which is a shame because there are so much potential and it's wasted because it looks like they cut big scenes that explained the story. In fact, they cut anything that explained anything of the war.  Rant-time: - The game is great and someone had a pretty good idea that they stole from somewhere or wrote the start of, then they got laid off or couldn't continue writing or something. The story is pretty stupid when you start thinking about it a little. It's the classic battle between angels and demons, but then a third party called the burning council or such c.r.a.p meddle in and sent the 4 horsemens of the apocalypse to paddle the angels and demons bottom. And what does this tremendously powerfull council want? NEUTRALITY!!! They want the angels and demons to kiss and make up and stop their war and the human world is offlimit for them. No other explanation is given for this. WOW!  - Then our hero who is War, one of the 4 horseman, get summoned to earth before the apocalypse. And he starts beating on angels and demons, because that's all he is made to do. Seriously, this guy has no reason for existing, no will but to keep the balance and very few lines that he says in all of the game. Robots have far more emotions than this guy. And wha'ts pretty funny is that the burning council remove all his powers from him because they accused him of going to earth before the apocalypse. He tells them that he was summoned there, but they don't even believe him. I guess demons are more trustworthy than your guy that existed for millions of years and never failed you and do nothing else but obey your orders! WOW. It's like the dev just brainstormed and said ♥♥♥♥♥♥♥ it, we'll just invent a bull.sheet reason to remove all his power so the game can actually exists! And thats what they did! - You don't even know what powers you lost until you get them back. Seriously, i stumbled upon a room somewhere and BOUM! Big ninja shiruken throwing thingie just like in naruto for god sake! I can totally see war using that ninja weapon, it's soooo like him! The guy shakes the ground with each step that he takes. Instead of shadow step, i think he has earthquake steps or something... ;-) - You fight a badass little boss sometime who sits on a horse with fire in his steps. You don't say anything, you don't wonder 'hey i know that fu.c.king horse' and then when you kill the guy, the horse just ram you a couple of time for now reason and then BOoM! magico magik bang bang youre sitting on your long lost horse, Ruin! If that's not pretty stupid script writing, my gawd. It's almost like we're back to the scripts we had in nintendo 8 bit days (The 80ies). - Don't get me started on how stupid the angels are in this game. The demons are their cunning evil selves that we are used to and honestly i don't understand how all the universe hasn't been conquered by demons in that game because it's not the angels who are stopping them! There is an angel woman, the angel boss on earth it seems, who stubbornly want to kill you because she believes you killed her mentor/lover Abadon. There was a scene at the start where she was there when he was taken by the big bad ♥♥♥ demon, in front of her and that's the last she seen of him. But yeah she comes after you all the time and send her angels to get slaughtered for REVENGE! Is she blind or something? She just saw the big demon crush her lover but she accuse you somehow? Why (Not explained)? And the angels have done ZERO thing to stop or even slow down the demons. There are no more humans on earth, the whole place has been converted to a hellscape and i don't know what the angels are doing, but it seems very little. I did love how black hammer, the old one, called them: pigeons! 'Get outta my yard before more pigeons come sh.eet all ovar the place!' Yep, pretty good picture of the angels right there and what they do. Just like pigeons!!! hehehehe - Honestly i think the whole story is just a trolling us big time ",
            "review_score": "1"
        },
        {
            "review_text": "They patched it, it's perfect end of.",
            "review_score": "1"
        },
        {
            "review_text": "  The graphic is really nice in the eye, and I always favor War more than Death, so this is like a christmast gift for me.",
            "review_score": "1"
        },
        {
            "review_text": "Now with 20% more Delicious! :)",
            "review_score": "1"
        },
        {
            "review_text": "  Nice graphics good game",
            "review_score": "1"
        },
        {
            "review_text": "Just finished the Warmastered Edition and it was a really fun ride!  Well worth the money with really smooth gameplay and only one crash a day after it came out.  The story can lag in a few places where you spend more time solving puzzles than shredding foes but otherwise a lot of fun fights with cool weapon combinations.  Thoroughly enjoyed it!",
            "review_score": "1"
        },
        {
            "review_text": "In all fairness it doesn’t take much to understand this game:  * take Zelda environmental puzzles and overall feeling of progression / scavenge hunt  * add God of War gameplay antics specially when killing baddies (including the bloody bloody boss executions but with much less arbitrary crappy button presses)  * spice everything up with a distinct Meteroid approach to areas and what it takes to access them as well as backtracking to open new ones with new found powers (very very cool and specially useful ones mind you)  * dress it up with Apocalyptic catholic inspired Nordic mingled aesthetics (people and monsters are freaking HUGE in this game, just take War as an example… dang shoulder pads Oo)  With all of that you have what I’d have probably considered in 2010 as the quintessence of a perfect game. Fast forward to 2016 and much what we touted as perfect mechanics before have been superseded by much better ones but the thing is, this game had many things seemingly ahead of the curve back then and what I’d call bad practices of mid 2000s games are far and few in between and even when they do make themselves apparent the forgiving auto-save lessens the burden considerably.  With all of that in mind, I can't recommend the game enough because in the end, I'm having a blast playing it and what else can I ask of a game?!",
            "review_score": "1"
        },
        {
            "review_text": "I like the old one but I love the remaster",
            "review_score": "1"
        },
        {
            "review_text": "Great job from ThqNordic, this is what i call the 'Remaster'. The good old Darksiders is now returns with amazing graphics and details. ofc its size is bigger now, but its definitely worth. The resolution, lightings, very improved cutscenes, no stutter, high fps, better colors... If u ask me, just buy it whether you played it before, or not.",
            "review_score": "1"
        },
        {
            "review_text": "Very good game, loved it when it came out, still love playing it again, it is a darker version of modern Zelda games but with more back tracking if you want to 100%, a must buy if you like Zelda, Devil May Cry, or other hack n slash puzzle games",
            "review_score": "1"
        },
        {
            "review_text": "Playing it again now on Apocalyptic! The upgraded visual is so satisfying! Still waiting for Strife and Fury! Come on , Horsemen!  ",
            "review_score": "1"
        },
        {
            "review_text": "do u want draksiders 3 ........ yes  than buy it nowwwww  but to the new guy this game is geart  a hack and slash game with greart story  ",
            "review_score": "1"
        },
        {
            "review_text": "Quick sentence summary: Just play the damn game it's fun as hell and worth the money Serious people: In the 32 hours or so I put in I enjoyed this game very much so. The remaster is brilliant and looks good, honest to god the only thing I hate is the difficulty but that's just me being bad, definitely worth the money and very fun you know when you not hating yourself against bosses, at the time of writing this I'm 26 hours into Darksiders II(which is better then this game but only because I'm biased and more of a true RPG guy) I'm playing the second game on Deathfinitive difficulty which is hardest out of 4. This game is what it's advertised as a hack and slash game , it is done extremely well despite being a definite Zelda clone, that's fine though it's like a mature legend of zelda",
            "review_score": "1"
        }
    ]
}