{
    "app_id": 462910,
    "name": "Poly Runner VR",
    "release_date": "2016-04-18",
    "developer": [
        "Lucid Sight, Inc."
    ],
    "publisher": [
        "Lucid Sight, Inc."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Full controller support"
    ],
    "genres": [
        "Casual",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Casual",
        "VR"
    ],
    "achievements": 0,
    "positive_ratings": 50,
    "negative_ratings": 13,
    "price": 0.0,
    "description": "PolyRunner VR is an addictive, high-quality experience that tests your skills against an other-worldly, ever-changing landscape rather than testing your ability to maintain control of your stomach. This engaging virtual world offers more interesting, challenging terrain the further you progress.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/462910/header.jpg?t=1461103842",
    "minimum_requirements": "OS: Windows 8, Windows 10 Processor: Intel i5-4590 equivalent or greater Memory: 400 MB RAM Graphics: NVIDIA GTX 970 / AMD 290 DirectX: Version 9.0 Storage: 180 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "No motion sickness. It was fun and could lead to a great game.",
            "review_score": "1"
        },
        {
            "review_text": "Honestly, a pretty terrible game for VR",
            "review_score": "-1"
        },
        {
            "review_text": "Poly Runner VR; played with Occulas Rift.  game itself is an endless runner, ship flys forward, and you control only left and right to dodge oncoming objects.  VR lets you tilt your head to move left and right, rather then the keypad on keyboard. Visuals in VR are nice, but over all its a very simple game that give you about 20 mins of fun.  6/10",
            "review_score": "1"
        },
        {
            "review_text": "recommend is an understatement. this game is everything i everything i ever wished for in a game. on mobile there are thoushandsof them but none i can control. then find this. thinking: 'cool looking VR game, but is probably not that good' i try is. and can't stop. absalutly incredible. one of the best VR games out there. summary is: graphics great; gameplay great; only improvment would be upgrades and a store and stuff.",
            "review_score": "1"
        },
        {
            "review_text": "  Simple, but works well. And it's free so quite yer whining.",
            "review_score": "1"
        }
    ]
}