{
    "app_id": 46290,
    "name": "Theatre of War",
    "release_date": "2010-07-09",
    "developer": [
        "1C Entertainment"
    ],
    "publisher": [
        "1C Entertainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Cloud",
        "Includes level editor"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "World War II",
        "RTS"
    ],
    "achievements": 0,
    "positive_ratings": 116,
    "negative_ratings": 86,
    "price": 2.79,
    "description": "Command a special task force composed of different kinds of units, including tanks, APCs, field guns, mortars, various infantry regiments and will also have an opportunity to call for artillery and air support.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/46290/header.jpg?t=1553173028",
    "minimum_requirements": "OS: Windows XP SP3 Processor: 2 Ghz+ Pentium 4 or Athlon XP Memory: 1 GB RAM Graphics: A dedicated video card with full OpenGL 2.1 support (starting from GeForce 5700/Radeon 9600) DirectX: Version 9.0c Storage: 4 GB available space Additional Notes: The game is not guaranteed to run on integrated graphics and laptops",
    "recommended_requirements": "OS: 64-bit Windows 7 and later Processor: 3 Ghz+ Intel or AMD chip Memory: 4 GB RAM Graphics: A dedicated video card with full OpenGL 2.1 support (starting from GeForce 5700/Radeon 9600) DirectX: Version 9.0c Storage: 4 GB available space Additional Notes: The game is not guaranteed to run on integrated graphics and laptops",
    "reviews": [
        {
            "review_text": "Excellent game to play, especially at the price now. Challenging strategy, not for those stupids though",
            "review_score": "1"
        },
        {
            "review_text": "If you like RTS but want something FAR more realistic (think Combat Mission). This is the game for you. I haven't seen any other game come close for realism than this. No building, no pretend physics, just pure war.",
            "review_score": "1"
        },
        {
            "review_text": "This game wants to be realistic and it is, but is boring and tedious too.",
            "review_score": "-1"
        },
        {
            "review_text": "The game is good I love it, however with this poxy unescapable mod making the game sucks ♥♥♥♥ big time, in the german normandy campaign you buy troops you dont get in battle and half you in game troops are missing also with 3 yes 3 AA guns you cant even shoot down attacking aircraft, of the bonus missions there are 7 soviet 2 german 2 american 1 french 1 polish missions five of the soviet are in russian so there is no way to know what the ♥♥♥♥ you are supposed to do,the main gripe is you cannot play this version of the game without the mod it wont allow you to do so, if I wanted a ♥♥♥♥ing MOD I would have downloaded it from MOB DB.",
            "review_score": "-1"
        },
        {
            "review_text": "waste of money wont even work",
            "review_score": "-1"
        },
        {
            "review_text": "Don't buy it, got the infamous error 3 trap.",
            "review_score": "-1"
        },
        {
            "review_text": "Too hard to beat Germany as Poland. Very unrealistic.",
            "review_score": "-1"
        },
        {
            "review_text": "Its kinda difficult to complete a mission on the hard difficulty setting (yeah I know) but for different reasons.  Your tank crew cannot repair any damaged modules, so if you get your tracks blown off then good bye mobility. Same goes for guns. It happens a lot as well. Your guys suck as well so you need to be good.  Otherwise I have no idea what to say..  Hardcore realism based playerbase will enjoy it I know.  I moderately did because of the reasons mentioned above.",
            "review_score": "1"
        }
    ]
}