{
    "app_id": 463710,
    "name": "Puzzle Galaxies",
    "release_date": "2016-04-29",
    "developer": [
        "Evermore Game Studios"
    ],
    "publisher": [
        "Sometimes You"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Casual",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Casual",
        "Puzzle"
    ],
    "achievements": 0,
    "positive_ratings": 81,
    "negative_ratings": 38,
    "price": 0.79,
    "description": "Puzzle Galaxies is a groundbreaking puzzle video game similar to games like Bejeweled and Candy Crush. You must match jewels stored in a space station in a manner similar to Bejeweled, but there's a twist - there are enemies that will come by and try to take matching jewels on you!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/463710/header.jpg?t=1551211003",
    "minimum_requirements": "OS: Windows XP SP3 / Vista / Windows 7 / Windows 10 Processor: 1.7 GHz Processor or better Memory: 1 GB RAM Graphics: Nvidia 6800 or 7300 or better, ATI Radeon X1300 or better DirectX: Version 9.0c Storage: 50 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I wanted to like the game, for less than a buck, how can you go wrong after all. In truth, the 'enemy switching gems' kind of mechanic is interesting, but it gets old VERY fast. I'm quite glad when I see the 'harder' fast enemies, since at least they will drop the gems more quickly. I kept hoping the game would get more interesting with time, but all that happened was more gem types, very slight variations on enemies (neat, an even faster fast grabber) and more waiting for them to drop the gems so I could switch them.  To it's credit, the game is well made, seems quite reasonably done, and has some inventive mechanics that build well on the core. However where it fails for me is the core mechanic simply isn't interesting, and while the additional mechanics serve to make it more difficult, those same mechanics simply slow down the rate I blow through the levels and don't introduce any challenge beyond thoughtless frustration. Puzzle games are supposed to be frustrating because I _should_ have been able to figure out the solution (within a time limit, move limit, etc.) but this is simply frustrating while watching the clock run down waiting for the enemy to drop the last piece in place for me because it's the only location left to drop one.  Note, there don't appear to be any game breaking bugs, for example I kept waiting for enemies to pick up another gem when I had it effectively beat, thus prolonging the level even further. It never happened, nor did the enemies clash with each other at any point in terms of gems picked up to make an unwinnable condition within the timeframe. The mechanics are solid, the AI appears well done and well tested, and the mechanics for what they are appear fully fleshed out. It's simply not something I'd recommend given the lack of depth or interest in the core mechanics themselves.",
            "review_score": "-1"
        }
    ]
}