{
    "app_id": 46370,
    "name": "Rig n Roll",
    "release_date": "2010-07-09",
    "developer": [
        "SoftLab-NSK"
    ],
    "publisher": [
        "1C Entertainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Cloud"
    ],
    "genres": [
        "Simulation"
    ],
    "tags": [
        "Simulation",
        "Driving",
        "Singleplayer"
    ],
    "achievements": 0,
    "positive_ratings": 165,
    "negative_ratings": 175,
    "price": 3.99,
    "description": "Players will step into the shoes of a young man in the year 2014 as he arrives in California to pursue his dreams of road domination and capture the Californian cargo transportation market. There are miles of highways to conquer and cities and towns to reach as he becomes the greatest trucker on the highways.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/46370/header.jpg?t=1553175738",
    "minimum_requirements": "OS: Windows 2000/XP/Vista/7 Processor: Intel Pentium 4 2,4 GHz RAM: 1.0 Gb Video Card: NVIDIA GeForce 5700 or ATI Radeon X800 with 128 Mb, DirectX 9.0 compatible Audio Card: DirectX 9.0 compatible HDD: 10 GB free space Direct X®: 9.0с",
    "recommended_requirements": "OS: Windows 2000/XP/Vista/7 Processor: Intel Core 2 Duo 3,0 GHz RAM: 2 GB Video Card: DirectX 9.0 compatible, NVIDIA 8800 or Radeon HD 3870 with 256 MB or higher;  Audio Card: DirectX 9.0 compatible HDD: 10 GB free space Direct X®: 9.0с",
    "reviews": [
        {
            "review_text": "Look at this as a simulator and you'll be let down. Looking at this as a truck-themed arcade game, and you'll praise:  • An amazing map - no prefabricated undersized intersections. The bespoke highways are properly scaled and a joy to drive on. You can do more than 30mph without tipping over. The map itself is huge - takes several hours to cross despite higher speeds and straighter roads than ETS  • You can see your hired drivers on the road as they work, and join them in competitive jobs  • A far, far, far more detailed truck diagnostics system than other games. Worn brake pads grind against the discs and degrade braking performance. Panels get beat up, the engine runs like crap.  • The truck upgrade system is excellent and features things like side and rear mounted cameras to cover blind spots.  • Cops (could be a con for some!)  • Nice side-missions, help out hitchhikers if you want, pick up extra jobs from cafés or over the radio  That isn't to say this game is without flaws. The iffy handling and dodgy physics are geared to racing, not driving. There are competitive jobs where you are pitted against other drivers to race cargo to its destination (very unrealistic). There are also truck races and out-of-this-world missions to complete, too.  In summary, don't look at it as a sim and you will be able to forgive its shortcomings. Go for a race or forgive the iffy handling and go for a really scenic drive.",
            "review_score": "1"
        },
        {
            "review_text": "not a bad game dose not work well with XBOX360 controller but its still a giggle getting to a police chase in a 18 wheeler best controller setup is to use the keyboard i would give this game 5/10 at the moment it is in weeklong deals so i would recomend it as it cheap but if you want a realy good trucking game euro truck simulator 2 but as an arcade type trucking this is a cool game to own hope you find this helpful",
            "review_score": "1"
        },
        {
            "review_text": "Nice features for a truck simulator, such crashable trucks, and graphics. But the camera and controls really sucks. The physics are also lame. This really killed the game.",
            "review_score": "-1"
        },
        {
            "review_text": "Get 'Euro Truck Simulator 2 (Or 3)', it is ALOT better then this game.",
            "review_score": "1"
        },
        {
            "review_text": "Great (:",
            "review_score": "1"
        },
        {
            "review_text": "If i had a pet turd, i would name it after this game.  Poor UI Poor Cameras Average sound Poor optimisation on old and new ahrdware Lack lustre gameplay, with mindless AI cars",
            "review_score": "-1"
        },
        {
            "review_text": "A heart warming adventure that gets you right up with the characters and makes you feel their feels. It makes me cri everytim",
            "review_score": "1"
        },
        {
            "review_text": "ITS ♥♥♥♥ING REALISTIC ♥♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "The greatest game of 2010. Such high quality graphics and detailed scenarios.  10/10 would play again.",
            "review_score": "1"
        },
        {
            "review_text": "TRY TO STAY AS FAR AWAY AS YOU CAN!!! DON'T EVEN BE ON THIS GAME PAGE!!! FLEE! FLEE WHILE YOU STILL HAVE A CHANCE!!!",
            "review_score": "-1"
        },
        {
            "review_text": "Serious bugs/issues with the graphics and police, if you want a trucking game, go buy 18 Wheels of Steel. This merely has graphics and ease, no challenge, nor realism.",
            "review_score": "-1"
        },
        {
            "review_text": "This is not the trucking game you want to add to your collection, even when it came out, a bland and boring truck sim with no road traffic, driving rules, or even a reason to have you play it even if someone gives it to you.",
            "review_score": "-1"
        },
        {
            "review_text": "Pros : Neat and big map, Nice trucks, Good driving experience with a steering wheel.   Cons : Terrible AI..By Terrible..I mean OVER THE TOP TERRIBLE, The Storyline SUCKS, Game mechanics SUCK...In certain deliveries you have to race different truckers..Isn't peaceful at all.   My rating : 5/10..Not bad, Not good.  Euro Truck Simulator 2 would be a better choice if you are looking for a truck simulator.",
            "review_score": "-1"
        },
        {
            "review_text": "anyone want to trade for somthing else?",
            "review_score": "1"
        },
        {
            "review_text": "anyone want to trade for somthing else?",
            "review_score": "1"
        },
        {
            "review_text": "Semi truck drifitng, coal rolling, 104 mph simulator.",
            "review_score": "1"
        },
        {
            "review_text": "Don't purchase this game if you are looking for a truck sim. Just purchase American Truck Simulator instead. If you are looking for a casual arcade style trucking/racing game with a story then I'd recommend this. The things I like about this game is that there are real truck models used for example, Kenworth, Freighliner, Peterbilt, Western Star, etc... The damage mechanics are more detailed than in ATS, and the truck interiors are also detailed. The graphics however is a major negative, but then again this game was released in 2010.",
            "review_score": "1"
        },
        {
            "review_text": "if u put time in to the game u will see most these people are not playing any hours to lern or no the game well to make a point. if they had played long they would had seen there iS A GPS stystem u have to buy for your truck then u will no were to go. all and all its a hell of a great game even if it cost a 100$ noing what I no about the game I would had payed and amount of cash for it",
            "review_score": "1"
        }
    ]
}