{
    "app_id": 46380,
    "name": "Reign: Conflict of Nations",
    "release_date": "2010-07-12",
    "developer": [
        "Lesta Studio"
    ],
    "publisher": [
        "1C Entertainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Cloud"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Medieval"
    ],
    "achievements": 0,
    "positive_ratings": 36,
    "negative_ratings": 44,
    "price": 2.79,
    "description": "Reign: Conflict of Nations allows players to have a well thought-out and historically accurate system of building and assigning labor forces in cities, a large selection of scenario-based and random missions, an expansive and realistic technology tree, more than 150 types of military units and elaborated graphics and animations which brin",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/46380/header.jpg?t=1553175804",
    "minimum_requirements": "OS: Windows XP/Vista Processor: Intel Pentium 2.4 GHz or similar Memory: 512 MB (768 Mb for Windows Vista) Video Card: NVIDIA GeForce 6600 or ATI Radeon X650 with 128 MB, DirectX 9.0 compatible Audio Card: DirectX 9.0 compatible HDD: 2 GB free HD space",
    "recommended_requirements": "OS: Windows XP/Vista/7/8/10 Processor: Intel Pentium IV 2.4 GHz, AMD Athlon 64 2800+ or Intel Pentium 1.8Ghz Dual Core and higher Memory: 1 GB (2GB for Windows Vista) Video Card: NVIDIA GeForce 7800 or ATI Radeon X1800 with 256 MB, DirectX 9.0 compatible Audio Card: DirectX 9.0 compatible HDD: 2 GB free HD space",
    "reviews": [
        {
            "review_text": "Unforgiving, but pretty good. Git gud at it or die trying",
            "review_score": "1"
        },
        {
            "review_text": "decent enough ....",
            "review_score": "1"
        },
        {
            "review_text": "+ Idea  - Very poor user interface - Bad tutorial - Overcomplicated - ...",
            "review_score": "-1"
        },
        {
            "review_text": "Gameplay: 3/10 Graphics: 1/10 Story: 4/10  Which most sucks i dont know, ♥♥♥♥♥♥ graphics or overdetailed story or unnecesarily complex game mechanics. Long story short; 'not worth to play'",
            "review_score": "-1"
        }
    ]
}