{
    "app_id": 463980,
    "name": "Solitairica",
    "release_date": "2016-05-31",
    "developer": [
        "Righteous Hammer Games"
    ],
    "publisher": [
        "Righteous Hammer Games"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Indie",
        "RPG",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Indie",
        "RPG"
    ],
    "achievements": 27,
    "positive_ratings": 161,
    "negative_ratings": 28,
    "price": 6.99,
    "description": "Solitairica takes RPG combat and challenging roguelike progression to a fresh new place—the world of solitaire! Using a variety of magical items and powerful spells, battle your way through a horde of ever-changing enemies and defeat the horrible Emperor Stuck.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/463980/header.jpg?t=1507354898",
    "minimum_requirements": "OS: Windows Vista SP2 Processor: 1.8 GHz, Dual Core Memory: 2 GB RAM Graphics: Nvidia 8800, ATI 2900, or Intel HD4000 DirectX: Version 9.0c",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Fun for a bit until you realise how bad the randomness of the cards is.. losing matches when the opponent has one card left just because you have spent 5+ rounds getting utter junk to play. 5 hours of gameplay is really just repeating the start of the game over and over because of the nature of the game.",
            "review_score": "-1"
        },
        {
            "review_text": "Easily one of the most fun Solitare/RPG mash ups I've ever played. Worth every penny and been playing it since launch.",
            "review_score": "1"
        },
        {
            "review_text": "Well, I know it's not helpfull but this is a great game for puzzle, solitaire and rogue-like lovers.  Hope many people will buy it and sees its greatness.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun and adictive little game. I always loved solitaire but this one add some cute twist to it. I recommend this game to anyone and it also work great on a tablet. Sorry for my english. :)",
            "review_score": "1"
        },
        {
            "review_text": "This is a fantastic casual game! Yes it has randomness. Because it's basically solitaire. You know, that game where you randomly shuffle a deck of cards to play? Don't let that scare you off. If you want a nice game where you can use a little strategy and a little luck to kill some time, this is the one for you. It has decent graphics and humor to boot. I love it!",
            "review_score": "1"
        },
        {
            "review_text": "Incredibly polished game with a good sense of humor, and enough complexity to give it lots of replay value.",
            "review_score": "1"
        },
        {
            "review_text": "If you're looking for a fun casual game, you can't go past Solitairica!   It's your basic golf Solitaire with basic RPG elements thrown in - collecting power, casting spells, enemies that can attack, etc. Add in some basic rogue-like elements (each game is a run of enemies, culminating in a final boss) and this is a winner. Pick it up if you see it on sale, and you too will be after just one more run... just one more run...",
            "review_score": "1"
        }
    ]
}