{
    "app_id": 464400,
    "name": "Bounce",
    "release_date": "2016-11-30",
    "developer": [
        "Steel Wool Studios"
    ],
    "publisher": [
        "Steel Wool Studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Casual"
    ],
    "tags": [
        "Casual",
        "Puzzle",
        "Indie"
    ],
    "achievements": 15,
    "positive_ratings": 34,
    "negative_ratings": 0,
    "price": 10.99,
    "description": "Bounce is a VR physics-based puzzle game for HTC Vive and Oculus Touch. Players are tasked with helping their playful robot companion, D1G-B, bounce, sling, shoot, and roll his way through an increasingly complex labyrinth of rooms on a galactic spaceship making his way to his final destination.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/464400/header.jpg?t=1491270510",
    "minimum_requirements": "OS: Windows 8 Processor: Intel i5-4590 or greater / AMD FX 8350 or greater Graphics: NVIDIA GeForce GTX 970 / AMD R9 390 DirectX: Version 11 Storage: 9 GB available space",
    "recommended_requirements": "Graphics: NVIDIA GeForce GTX 980 / AMD R9 390X",
    "reviews": [
        {
            "review_text": "I'm updating my review after ending the game: I spent 7hrs to finish it, the duration depends on how good you are in solving the puzzle (I'm averagely good in such kind of games). From global charts, I could be the third one to end the game... not bad considering than from Steamspy there are almost 1000 owners and the game is out from a week :)  Bounce is an awesome physic puzzle. Not only is super polished, with extremely sharp edges and lot of shaders: it's made with style. Animations (unfortunately mostly noticeable in the spectacular ending) are wonderful, those robots looks like a Pixar short, cute and expressive. The soundtrack is also real good, with a main theme and lot of variations.  The game itself offers 50 levels, with a nice progression: almost 10 level to learn basis, then it start to grow in difficulty and dimension level by level, introducing new obstacles and scenery. It's a very long and challenging game, not just for VR standards.  For puzzle lovers with a VR device capable of roomscale and handtracking, this is a must.",
            "review_score": "1"
        },
        {
            "review_text": "Bounce....this game is ADDICITING as hell. Honestly I bought it because I wanted to play more Portal and this was the closest thing I could find for puzzles. This game is great and you actually have to use your brain a bit to get the ball from point A to point B. Try it out you won't be let down!",
            "review_score": "1"
        }
    ]
}