{
    "app_id": 464620,
    "name": "Siralim 2",
    "release_date": "2016-08-12",
    "developer": [
        "Thylacine Studios"
    ],
    "publisher": [
        "Thylacine Studios LLC"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Indie",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Indie",
        "Pixel Graphics"
    ],
    "achievements": 608,
    "positive_ratings": 391,
    "negative_ratings": 29,
    "price": 11.39,
    "description": "Siralim 2 is an old-school monster catching RPG. Summon and customize hundreds of creatures to fight for you as you battle your way through endless dungeons. Find rare treasure and use it to upgrade your castle, empower your creatures, craft powerful artifacts, learn new spells, and much more.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/464620/header.jpg?t=1511313437",
    "minimum_requirements": "OS: Windows 7 Memory: 4 GB RAM Graphics: 128 MB Storage: 200 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Compare and Contrast: Siralim 2 and No Man's Sky  + They both have procedurally generated levels. - Only one of the games features actual gameplay in said generated levels.  + You can acquire monsters in both games. - You can actually do things with the monsters in only one of them.  + They both came out on the same day. - Only one of them is actually in a playable state at launch.  + They're both considered indie games - One of them responds to comments and questions almost instantly, going as far as to personally fix someones glitched save via email.  Siralim 2 is a gem. I highly recommend anyone thats a fan of old school rpgs, monster collecting, or completely customizable games to give it a try. It was worth it at full price, it almost feels like stealing when it's at a discount.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a mixture of Pokemon and Monster Rancher, with all limitations and petty conerns of reasonable balance thrown out the door. Monster traits include things such as 'Upon dying, 50% chance of reviving with full health.' This can cause crazy interactions and synnergy, and when you include artifact customization (Including the ability to equip an additional one of those crazy character traits) and spell gems, it's insane. But it's balanced because the enemies A) scale infinitely and B) have crazy powerful things too.  However, ultimately this is a game about grinding. Making small goals and progressing to personal benchmarks. If you need tangible story progression in order to have fun, this game is not for you. Otherwise, it will last dozens and dozens of hours. Good stuff.",
            "review_score": "1"
        },
        {
            "review_text": "Never played a monster hunting game besides the current Pokemon Go, but I've been playing RPGs since the 80s. The 96% positive reviews speak for themselves. If you like retro, turn based RPGs you really can't go wrong here. Just be careful not to gamble away all your resources with the Dwarves.",
            "review_score": "1"
        },
        {
            "review_text": "I usually can't get into most 2d RPG games, they always feel a bit to repetitive and the content is pretty dull. However, so far even though I had to flee the first boss like 5 times and I spend way to much time on each Realm, I still like this game a lot. I would recommend this game if you have even the smallest interest in RPG games.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, I did not expect so much content! First the graphics made me think its the generic 2D RPG game made in gamemaker, dont let it fool you. I rarely buy games in steam and never even reviewed any of the ones I bought, but in this case the combination really fun game and an active developer just gave me the urge to do it.",
            "review_score": "1"
        },
        {
            "review_text": "Basically the best Shin Megami Tensai game I've ever played.  I you like RPGs with lots of exploration, deep character customization, complex drop-down menu combat, not bogged down by any of that tedious 'story' nonsense, and find grind relaxing rather than tedious, this is for you.  ",
            "review_score": "1"
        },
        {
            "review_text": "If you enjoyed Pokemon and Disgaea in your past, and have the time to devote to something equally as big, this is a very solid pick. If you let yourself get into it, the return on investment will be near infinite.  Active updating and supportive devs also doesn't hurt :)  Only complaint I could have is a seeming lack of DirectInput support, but the extremely simple controls make that a rather trivial matter.",
            "review_score": "1"
        },
        {
            "review_text": "Great retro game, devs are crazy supportive and patch stuff near off the bat. Very positive, and brings a great feeling of nostalgia.  P.S. TO EVERY LUFIA FRANCHISE FAN: YOU NEED THIS, TRUST ME.",
            "review_score": "1"
        },
        {
            "review_text": "JRPG style game, with simple graphics but deep gameplay. Grindy like a Nippon Ichi game, and just as fun. If you want a game that you can put hundreds of hours along many years, this game may be it. Works best as a fallback game when you get bored with the 'game of the moment'. It has a LOT of systems and mechanics. From those takens for granted like crafting and cooking to a 'Item World' system like the Disgaea series. The artifact system is very, very, interesting, and keeps you coming back.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely one of the best rpgs i've played this year, if you're a fan of pokemon and earthbound I DEFINITELY RECOMMEND THIS GAME.  WHAT ARE YOU WAITING FOR?!?!? BUY THIS GAME ALREADY!!!!! DID I MENTION THE KICK ♥♥♥ MUSIC?!?!?",
            "review_score": "1"
        },
        {
            "review_text": "Final Fantasy: Mystery Dungeon",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good but not worth 15€, I'll pick it up again when it's on a sale. Great game if you like endless grinding to kill some time! Graphics are awful but not a hinderance to the gameplay in the least.",
            "review_score": "1"
        },
        {
            "review_text": "If you like collecting and breeding monsters, buy this game. If you like turnbased fighting, buy this game. If you like dungeoncrawly grinding, collecting pixel loot, and min-maxing your creatures into little godlets, buy this game. And if you like randomly generated loot that could be super, game-breakingly awesome, and the occasional randomly generated mob monster that could literally be impossible for you to kill, buy this game.  Also, Siralim 2 is a nice upgrade from Siralim (1). Upgrade to 2 if you liked 1, but I definitely wouldn't suggest buying Siralim 1 in addition to 2, as they are very similar games, with Siralim 2 having more content and some of 1's rough edges sanded off. In Siralim 1, what eventually drove me away was the repetition in the dungeon worlds and the odd sameness of the monsters, because they only had like one unique characteristic and limited customization. Siralim 2 has improved by giving you more realms, more things to do in the realms, and making your creatures, rather than you, cast the spells. So, your team does a lot more different things, and there's more opportunities for them to be uniquely awesome. Meanwhile, there's lots of things to collect, upgrade, improve, and loot.  Basically, if you saw the trailer and got little hearts in your retrogamer eyes, buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "A very fun game, and interesting mix between procedurally generated Dungeon Crawlers, Pokemon and RPG's. Build up your own base, gather materials, and gather a really huge amount of monsters that each have their own breeding combinations, From the current combinations I have I can see there's atleast 1000+ different monsters in the game.  That said, the game is basically a grindfest. The different dungeons each have their own little differences in enemies, materials and sidequests, but nothing hugely varying, so every time you go out you' still be doing the same thing over and over. I'm still having fun with it though, I'm not really playing hours on end, but I usually play a couple of floors, lasting between 20 - 40 minutes, and continue another time. But again, even though it's grindy, still really fun to play, I love these kinds of RPG's.  The only negative point is the UI and the way you get information. The UI is really oldschool, and in most cases still functions well, but in battles it can be really annoying because you can get a status effect in battles, but you have no way to even know what it does. 'Your minion just got Blight!' 'Sounds bad, what does it actually do? You can only find that info in the library outside of battle... :V'. It's a bit of a pain to navigate through a lot of menus to actually get the info you want.  That said, fantastic game, definitely a recommendation!",
            "review_score": "1"
        },
        {
            "review_text": "A great game that almost never gets old",
            "review_score": "1"
        },
        {
            "review_text": "Although it does suffer from the age-old RPG problem of walking-around battles that are way too easy (to the point of tedium), I love everything else about this game. There are lots of different systems and lots of ways to customize your pets, including breeding them and equipping them with spells and gear. You get to construct your base and gain favor with deities and craft powerful artifacts!  That said, I'm giving it a thumbs-down because I've found I spend way, way, WAY too much time engaged in trivial battles with trash encounters. Not only do these feel like time-wasters, they do nothing to teach you the tactics you need to know in order to fight the bosses. When the developer adds 'Turbo Mode' because he recognizes how boring the combat is, you know there's a problem. Until these encounters are made more interesting, I cannot recommend this game.  And please don't bother leaving a comment explaining why my OPINION is 'wrong.' I didn't enjoy tthe game, and it took more than 2 hours to get past the so-called 'tutorial' stages to be able to judge it. So now I'm stuck with the game, and the game is stuck with my negative review. Deal with it. Fanboi bullying will be deleted immediately.",
            "review_score": "-1"
        }
    ]
}