{
    "app_id": 46500,
    "name": "Syberia",
    "release_date": "2011-05-19",
    "developer": [
        "Microids"
    ],
    "publisher": [
        "Microids"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Casual"
    ],
    "tags": [
        "Adventure",
        "Point & Click",
        "Puzzle"
    ],
    "achievements": 0,
    "positive_ratings": 2092,
    "negative_ratings": 260,
    "price": 9.99,
    "description": "Join Kate Walker as she travels to remote locations and time periods in this timeless voyage to discover her true destiny.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/46500/header.jpg?t=1554900806",
    "minimum_requirements": "OS: Windows XP/Vista/7/10 Processor: 1GHz CPU  Memory: 512MB Hard Disk Space: 1.2GB Video Card: DirectX compatible graphics card with 128 MB memory DirectX®: 9.0c Sound: Sound card with DirectX 9.0c support",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Are you annoyed by Kate's slow pace? Do you want to smash your face against your monitor every time you have to go through a long distance twice, or thrice, because of some minor mistake? Are you interested in being able to admire the beautiful scenery without losing five minutes for no reason? Rejoice, there is a way to avoid all that! We are proud to present you the 'double click'! Double-clicking is for you! Double click the sh!t out of everything, make Kate run and enjoy this beautiful game.  Brought to you by someone who discovered far too late in the game that Kate can run!   -I love this game. It stood the test of time. I think I enjoyed it more than when I first played it back in 2005, but it might be because of that double-click thingie.",
            "review_score": "1"
        },
        {
            "review_text": "Steampunk style point-and-click with really nice graphics (just remember it was made in 2002) and fantastic voice acting (one of best I've ever heard in an adventure game).  Village mysteries, steampunk factories, amazing airships and intricate automatons - all this explored by young New York lawyer, Kate Walker.  'Syberia' has some shortcomings, namely some annoying unskippable animations (like stair or ladder climbing) and it is quite linear, but the story is so great I would definitely recommend it anyway!  GRAPHICS: 8/10 AUDIO: 9/10 GAMEPLAY: 7/10 STORY: 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This is one of those games that is hard to take a break from. You want to know what's next in the story. Well written and entertaining.",
            "review_score": "1"
        },
        {
            "review_text": "This game has beautiful artwork, the story is great. It might be dated and some people might find it tedious, but really, I love it. Recommend to get Syberia II as well for one continuous story.  I just found out there are steam cards for this game so I have an (extra) incentve to play it again :)",
            "review_score": "1"
        },
        {
            "review_text": "Syberia 9 / 10  A Point and Click Adventure in which you play as Lawyer Kate Walker travelling to oversee the final take-over of a toy factory in Valadilène, France. Travel with Kate and uncover the missing people and parts to the story, solve puzzles in this steampunk world and ride the train to finish up this Fantastic Adventure in Syberia.  I played this on Xbox in 2002 and again when it was released on Steam. then I replayed Syberia II. The Rumor is that Syberia III is coming out this year.... I will play entire trilogy in order if this be true.  Smile : )",
            "review_score": "1"
        },
        {
            "review_text": "A pretty cool adventure game. Interesting characters and settings. However, you'll be running through empty hallways within these settings multiple times. Honestly I wouldn't shy away from a walkthrough to cut down on all the pointless running around, but at least it's pretty to look at.",
            "review_score": "1"
        },
        {
            "review_text": "Summary: Syberia is a point-and-click adventure game with a good story and nice characters. The puzzles are logical, but also not challenging. The main flaw is the very slow pace of the game and the lack of any way to speed up the main characters movement. Only play if you have a lot of patience.  Long Story: This recommendation comes with a very big caveat. Syberia is an old-school point and click adventure with none of the modernizations that make those games easier to play. No fast-travel at all (not even dubble-clicking to immediately change scene), no way to see interactionable items except hovering over them or indicating which paths you can take. Steam says it took me about 10 hours to finish Syberia, but I would estimate that maybe 1½ hour was spent on puzzles, another 1½h on dialogue and the other 7 hours were spent on watching the main character run around or climb stairs. There are a lot of stairs in Syberia and you will climb them all. There are also a lot of travel frames that you have to get through to get to places with interactable items. They look very nice, but it is still a bit of wasted time.  This means that you should only play Syberia if you have a lot of patience for the incredibly slow pace of the game. If you have the patience, the game rewards you with very nice set-pieces, good dialogue and a nice story. You play as Kate Walker, american lawyer, sent to finalize the sale of a toy factory, only to find the owner dead of old age and the heir missing in the far north of Siberia. Walker starts off as a somewhat unlikable character (lowest point is probably asking a handicapped kid to pick up an oar for her because it is wet and icky), but has a chance to grow throughout the game by overcoming problems and meeting weird people.   The puzzles are mostly logical. The difficulty lies more in spotting items and finding all locations that are available. As soon as you have the items and know which locations are available, it is very easy to know what to do. So if you're looking for a challenge then Syberia is not the game for you.  I am recommending Syberia because I liked the story, the settings and the characters. However, it would be a far superior game with the ability to quickly move from scene to scene and some indication of which paths are available. As it is, it is an incredibly slow game that you need a lot of patience to play.",
            "review_score": "1"
        },
        {
            "review_text": "One of the point&amp;click games whose developer spent too much energy creating locations and fall into the error of making the player walk unnecessary lengths between puzzles. Regardless this small inconvenience and the kind of melancholic atmosphere, the story is interesting, beautiful and structured so it feels that our journey through Europe is a life and perspective changing experience.  I recommend to everyone who don't mind the long strolls.",
            "review_score": "1"
        },
        {
            "review_text": "The game wouldn't start and kept coming up with a 3D engine error. I felt cheated by my new broken game, even if I did get it really cheap on a sale. Then I found a very useful guide in the community hub addressing the issue, and I could finally play the game. So if you encounter this same problem, there is an easy solution. The game is just getting a bit too old.  Also, mouse right click lets you skip dialogue, and mouse left double click lets you run. Save yourself some time.  It's a very old point-and-click game, so I didn't expect much from it and I didn't get much out of it, for the first few hours at least. It starts off very slow story-wise with lots of puzzles and it slowly, slowly builds up to a kind of good story. Back tracking, unconvincing voice acting, corny story, a few vague puzzles, and bizarre leaps in logic are a few of this game's bad points. The ending is an unrealistically, feel-good, follow your dreams sort. This game definitely isn't for everyone, but I enjoyed it in the end. Please do not play this game if you dislike mammoths.",
            "review_score": "1"
        },
        {
            "review_text": "old game, awesome story, oldfashion handling but as an adventure gamer this is one of the better adventures worth playing! thumbs up!",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely beautiful piece of art. Despite it is as linear as possible, I completed it several times - just to taste the story. Kind, warm story about power of human imagination, and about ordinary person becoming extraordinary, finding 'true existence' through taking dream of a genius as her own.",
            "review_score": "1"
        },
        {
            "review_text": "Despite its age, this game is surprisingly good!   Though this game is presented as a puzzle game, it's rather an exploration game. It's all about exploration and storyline. You might even say that it's more of a graphic novel than an actual game. But it's a good thing.  The fascinating story, beautiful landscapes and great music will give you the right taste of the Age of Steam. Although the actual events take place in 2002.  I'd give 10/10 for this game, but main character's pace was just a little bit too slow sometimes, therefore my overall rating is 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "To be honest, I was surprised just how much I enjoyed this game. It is a well crafted world filled with amazing imagery and great imagination. The story draws you in and the puzzles and slowly unravelling story makes it all the more compelling.  The main drawbacks would be the sometimes illogical puzzles (one involving a paddle for instance) and the constant back tracking. However, the overall experience is worth it.   Give this game a shot!",
            "review_score": "1"
        },
        {
            "review_text": "Get it! Had a physical copy back in the days, when it was released. Awesome story, awesome art, first and only 'point and click' games that I ever liked.",
            "review_score": "1"
        },
        {
            "review_text": "Get it! Had a physical copy back in the days, when it was released. Awesome story, awesome art, first and only 'point and click' games that I ever liked.",
            "review_score": "1"
        },
        {
            "review_text": "Enjoyed the game and it brought so much memory to me playing the game in the past. The story along with the puzzles are made well done. Must have game!  Pros good designed atmosphere, architecture and mechanisms good riddles cute story line  nice videos   Cons N/a",
            "review_score": "1"
        },
        {
            "review_text": "I can't believe I didn't hear more about this game before I decided to play it. It really deserves to be a well known classic, alongside The Longest Journey.  The world of Syberia is similar to ours, but slightly different, in its possessing intricate automaton inventions. There are many things to admire in this game, such as the details in the character and background animations, the absolutely gorgeous environments, and the creativite plot and settings. You can definitely feel the love and effort the developers put into the game. It's hard for me to describe one of the best things that Syberia does well... but I'm going to try: the world it creates is not exactly exciting, but rather relaxing in its wonderment. The atmosphere is calming and whimsical. There are no death screens, no way for you to mess up or have to start over, just you exploring a rich world. Although it might not be big on action, Syberia definitely has a lot to say. Throughout the narrative as Kate changes, the game tells both her and the player that you are capable of much more than you think. The game will move you at parts, if you let it.  Keep in mind there is a sequel to this game, so some issues are left unresolved, but I feel that even without a sequel, the themes and character arcs of this story work well, even standing alone.  A few things that detract from the game are the inability to make Kate move faster during some animations like walking up stairs which makes backtracking irritating, some difficult puzzles that you might need a walkthrough for, and interactive items that are sometimes easy to miss. I highly recommend using a walkthrough if you get stuck to prevent the hair-pulling frustration of combing over every pixel on the screen to find something to help you progress the game. (I don't like using walkthroughs myself, but I had to bend in this case.)   However, these things ultimately do not take away from how much the world will enthrall you, and how much you won't want to leave when the story ends. Pick up this game if you're looking for a calming point and click adventure to help you unwind.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best series ever!",
            "review_score": "1"
        },
        {
            "review_text": "Really nice and old school. Get captured, but be prepared for trouble with your GF ; ).",
            "review_score": "1"
        },
        {
            "review_text": "It is as if Alice’s Adventures were set in a decaying clockpunk Wonderland. The story follows Kate Walker as she travels to Europe to finalize the sale of an old automaton factory, only for her to become completely engrossed in the pursuit of adventure as she travels Europe through the life left behind by the mysterious legal owner of the factory. Ultimately it is a story about the choice between a comfortable yet mundane life, or an uncertain but adventurous one.  The puzzles make sense in their own surreal way (speaking as someone who often needs to consult walkthroughs for games like these, I figured most things out by myself), the decaying world is beautifully detailed and provides a certain sense of nostalgia, the clockwork inventions are endlessly fascinating (although not always very realistic) and the characters seem to have leapt straight from a Franco-Belgian comic.  My only negative is that the world at times feels a bit TOO abandoned and could have benefited from having a few more characters sprinkled around.",
            "review_score": "1"
        },
        {
            "review_text": "Love Syberia and love Kate",
            "review_score": "1"
        },
        {
            "review_text": "Really enjoyable adventure game",
            "review_score": "1"
        },
        {
            "review_text": "This is a classic adventure written by Benoît Sokal. You might not heard of him, but he is one of the best Comic authors. This was his stint at creating an interactive fiction story. Be prepared to go on a journey full of wonder. From a technical point of view, the voice acting is still great, but the graphics might be a let down. The puzzles are for the most part obvious although you have the occacional pixel hunt. Not that you have to look for clues that way, but the interface is a bit clunky. You might like Syberia II as well, but although that one has better puzzles, it was the lesser immersive story of the two.",
            "review_score": "1"
        },
        {
            "review_text": "one of the best games that i have played",
            "review_score": "1"
        },
        {
            "review_text": "Never a protagonist on an adventure game caught my heart as Kate Walker. Syberia can be described as a very straight forward story that spans for about 10 -12 hours and dont bother to bump the player experience with intricated puzzles, everything here is simple but at the same time well put to created a fluidy experience that focus on the narrative.",
            "review_score": "1"
        },
        {
            "review_text": "An adventure game done in the same style as Grim Fandango. This really pulled me in. Excellent and detailed setting, intriguing story, some humor but not to the level fo Grim and some novel pieces like a wind up train.  If you're into steampunk (or similar) or a post apocalyptic setting (lots of derelict sort of stuff) it's worth getting this.",
            "review_score": "1"
        },
        {
            "review_text": "Not having played a puzzle/adventure game since Myst, I am finding Syberia a good challenge, since gettign back into the genre. I like that is not too easy, but it is not too frustrating.",
            "review_score": "1"
        },
        {
            "review_text": "With the passing of time, you realize what are the real gems among the video games of the past, and take advantage of the new versions (renovated) and the bargain prices to get these again...  And so... what better than play again the masterpiece of Benoît Sokal?  One of the most inspired games of all time: dreamy, melancholy and funny at the same time!  And I look forward to Syberia 3...",
            "review_score": "1"
        },
        {
            "review_text": "This is a classic point and click with a bit weird puzzles but if you look past that you'll find a game with exceptional written story.",
            "review_score": "1"
        },
        {
            "review_text": "pretty good adventure game",
            "review_score": "1"
        },
        {
            "review_text": "First of all, I love point &amp; click adventures. I'm rather forgiving about errors in these games, simply because I enjoy playing them in general. But this game... I simply couldn't continue playing it.  I also love steampunk, so a game that combines both should be perfect for me, right? Right?  Well... it says I played this game for 4.6 hours as I write this. And while I certainly love the environment and the art of the game... I can't enjoy the game itself. Why? Because the one word that describes this game best is: 'boring'.  First of all, everything seems to take forever. You slowly walk from point to point, from scene to scene, and you just wish you could somehow fast forward. This gets particularly annoying if you have to cross like 4-5 screens (one of them may be a scrolling screen), just to get from one hotspot to another.  Second, the dialogues. They are long and tedious, and more often than not, nothing helpful is being said. You ask about one thing and they tell you that you don't need to know about that. Then you ask about the other and they tell you, you must first know the one thing you were told earlier that you don't need to know about it.  SPOILERS  Third, the story. You're a lawyer, travelling to a remote village to finalize a purchase deal for a factory. Does that sound exciting? Yeah, certainly does. You learn that the owner of the factory died shortly before you arrived, and struggle to still buy the factory for your client. Couldn't they think of a more exciting story?  Fourth, the phone calls. You witness random phone calls from Kate's mother, work colleague, boyfriend/fiance (amazing that she actually has signal in such a remote place) and learn about their relationships and stuff. As far as I can tell, this has absolutely NOTHING to do with the story. It's probably supposed to add depth to the character. But was this really necessary?  Yes, I know, the game is old, 13 years by the time of this review. But that is not an excuse. There were great games before 13 years ago. There were great point &amp; click games before 13 years ago. Look at the old Lucas Arts games. Indiana Jones, for example, was released 23 years ago, by the time of this review. And it was great. I played it over and over again.  This game, however... is just tedious. And boring.",
            "review_score": "-1"
        },
        {
            "review_text": "For the adventure gamer, there may be no better game than this. I can't believe I never played it until 2013. Syberia hits it out of the park, though I would ONLY recommend this and its sequel to adventure gaming fans.",
            "review_score": "1"
        },
        {
            "review_text": "It has a very unique art style and a moving story that keeps you guessing until the end.",
            "review_score": "1"
        },
        {
            "review_text": "I found Hans",
            "review_score": "1"
        },
        {
            "review_text": "I didn't really like this game. I know that some people loved it, but to me it was basic point and click busy work game where you had to guide bunch of morons around that could not turn a key. Main inventor couldn't even read. Game had very dated graphics and one NPC Oscar was anoying as hell. If I would have a choice I would not recover his legs or hands and let him stay where I found him. Skip this game ... not worth your time.",
            "review_score": "-1"
        },
        {
            "review_text": "Huge flaw #1: While *most* of the time your cursor will change to indicate interactable objects, there are many cases where the cursor doesn't change at all. To find necessary objects requires clicking on every pixel on every screen. Some may say 'but you know you're supposed to click there because it has that interesting contraption clearly displayed', but there's garbage beautifully strewn everywhere in the game's scenery. There's no way to beat the game without bruteforce or gamefaqs.  Huge flaw #2: It takes forever for Kate's lethargic slow body to move anywhere. You can sometimes run by double clicking, but even the running is too slow and her animations are interrupted by things like stairs, doors, and small inclines, all of which cause Kate to halt and ponder each step for precious seconds while she lumbers her way inch by inch. And even if you manage to get the game to run in windowed mode, the game will pause if you alt-tab. So you can't even browse the web or play another game while waiting for Kate's prodigious girth to waddle across town.  Flaw #3: The characters are annoying and unlikable. Especially when a dozen times per chapter you are interrupted by Kate's ringing cellphone and a meaningless conversation from her mom or boss or boyfriend or some other jerk you don't give a rat's posterior about.  Don't buy the game, watch it on youtube, or get a spare bundle key from someone who can't find someone to unload their misery on.",
            "review_score": "-1"
        },
        {
            "review_text": " Syberia takes 'casual' to the extreme",
            "review_score": "-1"
        },
        {
            "review_text": "This game has very good story.",
            "review_score": "1"
        },
        {
            "review_text": "Puzzles have no alternate solutions, interactive elements are sometimes small and easy to miss, and area transition points can be hard to spot. This isn't really a game so much as a movie/book that lets you click around until something happens. Too bad it's such a drag, because the atmosphere and story are both really solid.",
            "review_score": "-1"
        },
        {
            "review_text": "Good graphics, challenging puzzles, captivating storyline. What I didnt like about this game - lots of sections where you could walk to the edge of the screen, but there was no sign of that from the mouse (meaning it only lit up in certain spots telling you to go there but not in others), you had to figure it out yourself and that got me stuck a few times not knowing where to go. Also, there were a lot of sections to walk thtough that were pointless. Couldn't pick anything up, couldn't do anything in them. They were jus there for graphics and when you are running back and forth trying to figure out a puzzle thats a pain. I like challenging puzzles but some of the puzzles were insane and there was no hint option or anything which I also didn't like. Wouldn't play the series again.",
            "review_score": "-1"
        },
        {
            "review_text": "i have played a couple hours, now it will not work, SUCKS, no one will help Miridan4 or Steam, it will not even let me ask for help.. Cmon steam what the heck is going on?? help.. May never buy another game from Steam.......",
            "review_score": "-1"
        },
        {
            "review_text": "it's a piece of complete ♥♥♥♥.  I think personally the creators should put there hard work somewhere else instead of a poopie game like this  ",
            "review_score": "-1"
        },
        {
            "review_text": "Well, seems like a good game. BUT, I can't really seem to play it, have tried many suggested 'Fixes' which get me almost to a title screen. Waste of seven dollars, but happens I guess.",
            "review_score": "-1"
        },
        {
            "review_text": "Played and finished the game on Mac and can't say I share the excitement of the majority reviewers:)  The problem with the game appears to be the Mac version that is notably different from the original PC release. It is like playing the game on extra easy difficulty with no real puzzles making it an interacting story rather than an adventure game.  ",
            "review_score": "-1"
        },
        {
            "review_text": "I found this game rather boring. There are just too much sites were you have nothing to do other than pass through. The puzzles are very straighforward. And there isn't this eagerness to get things done, very little motivation.",
            "review_score": "-1"
        },
        {
            "review_text": "Awful game. I use two monitors and if you accidentally clicked outside the primary screen then it glitched and turned black. Also it is not a w.a.s.d move pattern you have to click where to move and it is just not much fun. I only bought the games becuase they were like 3 dollars total, and it is a complete waste of my money... I dont even have the games installed anymore, they are just in my library because I cant fully delete them. I am talking about both Syberia, and Syberia 2 ",
            "review_score": "-1"
        },
        {
            "review_text": "One of the BEST adventure We played in the family. Beeautiful atmosphere and plot. Amazing panoramas. Absolutely worth it (both 1 and 2)",
            "review_score": "1"
        },
        {
            "review_text": "A dated but lovely point-and-click adventure.  First thing to know is that you can double-click to run. That took me about 2.5 hours to figure out, and I felt very stupid afterwards.  Environments are quite pretty, and the overall atmosphere is well-constructed in each scene. You spend a lot of time exploring examples of dilapidated glory. But for all the quiet ruin, the characters that inhabit it are surprisingly fun. Kate, the lead, is actually kind of a jerk (mostly for gameplay reasons), which I find hilarious.  Gameplay is smooth, and interactions are clear. My only complaint is that Kate takes stairs like she's worried about breaking a hip. Play this if you want a nonviolent, low-pressure but engrossing adventure and a unique story to explore.",
            "review_score": "1"
        },
        {
            "review_text": "Bought this in the sale a while back and didn't know what to expect, when I read that this was a 2002 point and click game my first thoughts wern't that great but having played through the game I can say that this one caught me off guard.  The story and level design in this game was unique enough to catch my eye and made me want to continue, despite some of the sections being a backwards and forwards trek through the same areas.  The puzzles weren't to difficult to figure out and the game itself isn't too long I'd say   Syberia is a nice game for those who can still play a game that doesn't have modern graphics and  I really enjoyed playing Syberia and would recomend it (especially if it's ever on sale again) but probably wouldn't play through it again anytime soon, however I will be sure to try out It's sequel.  My overall rating: 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Great game. It has a good history.",
            "review_score": "1"
        },
        {
            "review_text": "Miss the old richly filled storys in an point and click setting? If yes, than this is really a game you should play.  Played it a long time ago when I was just a kid. I really don't know how I was able to figure the puzzels out back than. It really is a rich and rewarding storyline.",
            "review_score": "1"
        },
        {
            "review_text": "It takes a lot to impress me to the point of leaving a review, but this game was wonderful.  From the scenery to the cutscenes, from the characters to the playstyle, I absolutely adored this game. It's beautiful, in both setting and execution. I can't believe it's as old as 2002.   I played it for six hours straight and I was so, so disappointed when it ended. Once the credits had rolled, I tried continuing the game just to make sure there wasn't more. That can't be it! She's finally found him! She's hopped back on the train! They're off to the snowy depths of Syberia to find this tribe and solve the mystery of the mammoth figurine! RIGHT?!  The story is very linear, though, so it'll be a while before I play it again. I wish I'd been able to stream it, though. People need to be made aware of how wonderful this is. Alas, I was unable to play this game on my PC because, for all my Googling, I could not get past the 'The 3D rendering engine could not be initialized' error. So I had to play it on my Mac and goodness knows there aren't any good streaming programs for that!  Wonderful tale, wonderful characters, wonderful voice acting. I wish a place like this truly existed.  Cons: At times, moving around was a bit clumsy (like when the camera angle did a 180 and you were trying to move fast and you ended up going back a screen). That's it.  Edit: Oh. OH. There's a sequel! Scratch what I said before about the ending! It's all good now!!",
            "review_score": "1"
        },
        {
            "review_text": "The plot in this game is very unique and the details the storyline includes really drew me in. Typical click and point puzzle solving that is fairly easy to solve but still has some challenge. Good set and character design but has gameplay that is a bit shorter than average.   If you like a unique storyline and click and point puzzle solving games this one is not bad but save a buck and buy it on sale or as part of a value package",
            "review_score": "1"
        },
        {
            "review_text": "I played this entire game a long time ago off Steam and it was really fun to play it with my Daughter there too.   And I'm playing it again.  Great game adventure, not too hard but towards the end I needed a walkthrough for when you make a drink at this strange maching bar, haha. actually a walk through doesn't hurt for any of these game does it? :) Anyways a really cool story with really cool looking locations and fun things to figure out.",
            "review_score": "1"
        },
        {
            "review_text": "Very good game,highly recommended",
            "review_score": "1"
        },
        {
            "review_text": "[Win7 Fix Included](Edited)  This was a wonderful game; I remember playing it years ago when it was first released!  I own the physical media, but it was slightly scuffed and wouldn't install, and seeing as how both Syberia 1 and 2 were available as a package purchase on Steam for $2.99 USD I decided to just go that route instead.   Unfortunately in my experience, Syberia 1 does not function at all on Windows 7 Pro 64-bit. Syberia 2, however, works just fine.  As of this post I'm running a Core i7 6700K 'Skylake' proccessor with a Titan X 'Pascal' GPU on DX11 with 32GB of memory. I have not tested this game under Windows 10 with DX12.   I scoured the internet looking for solutions to the problem and was not successful in getting the game to work at all, despite following through with many recommended fixes. The only solution I have yet to apply to the problem is running it under an emulated environment like VMware.  In conclusion, despite how wonderful this game is, I cannot recommend Syberia 1 unless you plan on chucking it on a legacy system. In fact, I wasn't even able to review this game initially because I had not passed the 5 minute mark for Steam reviews because it wouldn't work.   After the game crashed, I kept it suspended in memory for 5 minutes just so I could write this review. :(  EDIT: GREAT NEWS   For me to get this game to work, I had to create a 'player.ini' file with the text '800 600 16 0 BaseCMO.cmo' (no quotes) inserted into the file. Then I placed the file into my Syberia directory under '\\steamapps\\common\\Syberia' Then I had to reduce the resolution of my monitor to 1920x1080 from my native resolution of 2560x1440. After that it worked just fine in windowed mode. Thanks to someone on the GoG forums for the fix ...can't remember the name o.o",
            "review_score": "1"
        },
        {
            "review_text": "Used to have this game when I was younger, and despite all those years that have passed its hasn't lost its charm. Syberia is a beatiful journey and experience, which puzzles really make you think and the hand-drawn backgrounds and overall design of the game are really beatiful. I would gladly recommend Syberia and its sequel to anyone who is a fan of the old school adventure point-and-click games.",
            "review_score": "1"
        },
        {
            "review_text": "In one word, this game is charming. Visually beautiful, always interesting, and so full of life, Syberia is one of those games that sticks with you long after you've played it. The people are as colorful and interesting as the environments, even the minor characters you don't need to speak with have distinct personalities. The attention to story-telling detail of this game shows that the makers truely cared about what they made. Typical of the point-and-click adventures of that time, there are moments where you are left waiting for a character to run from point A to point B, and sometimes details can be overlooked and cause frustration, but it does not manage to detract from the beauty and heart of this game. Besides, the game is old enough now that there is a plethora of walkthroughs to pick from for when you get stuck. If you want an adventure and like getting lost in the charm of an old world, this game is for you.",
            "review_score": "1"
        },
        {
            "review_text": "Classical point-and-click Adventure - reminded me of the old LucasArts titles. Charming!",
            "review_score": "1"
        },
        {
            "review_text": "Love this game it sends me back to my childhood when it was new game on the market. It have great story which is very well made and told. You are eager to see every next location when you go through the game because you are forced to expect everything and anaything at the same time.  Highly recommended for anyone who loves great adventure game and isn't too much depending on high-tech graphic. But on its time this game had very well made effects and graphics indeed.",
            "review_score": "1"
        },
        {
            "review_text": "It could give a Problem with Anti-Virus Programs. Allow it, or you can't play the game.",
            "review_score": "1"
        },
        {
            "review_text": "Overall score: 9 out of 10  For me an adventure game is not about gameplay or graphics, it's about story and puzzles. Syberia was launched in 2002 and I first played it when I was still in Highschool. During my first playthrough almost 10 years ago, I found the puzzles to be somewhat difficult, but in the present I find them to be quite easy, and I'm not saying that because I've already played the game, cause honestly I didn't remembered a single thing from my first playthrough. In my opinion the lack of difficulty that I've experienced in the present is due to the fact that I've got more experienced with solving puzzles and because I think that with the age you see things differently, more logical. Returning back to the game, the story is quite good, although the characters seem too polite in my opinion even when confronted with dangerous situations, the puzzles are interesting and can be somewhat difficult for someone new to the game, the graphics are nice, the gameplay and audio are good, overall this is a good adventure game. It's hard to recommend it for a young person that is used with the HD graphic games of today, but for someone that has already played classic games, especially adventure games, I strongly recommend it. Looking forward to play the second part. ",
            "review_score": "1"
        },
        {
            "review_text": "Bought this game randomly just for the fun of it. Yeah, I do that sometimes, it's not even my genre. But wow, I got myself a piece of gold here. I am not much into the Point'n'Click genre as said, but it is good to know that there are games like this which convince me to actually poke my head below the surface (poor metaphors, yay. no seriously wtf did I just write there).  Well, technically and graphically, this game is... well. Just keep it's age in mind, it's from 2002 yo. But considering that, these backgrounds are just WOW. Probably some of the prettiest and most detailed I know of (operative word is 'I'). Cought myself acting up to take a neat screenshot here and there.  The gameplay is quite slow paced, like in most of the genre's games (I guess; me lacking experience here) - But sometimes I could strangle Kate for her unbearable stair-walking behavior (JUST CLIMB 'EM DOWN ALREADY ahh, wrong side of the train again FML), just saying. The puzzles are mostly comprehensible and challenging enough so that even a beginner like me can solve them just by thinking. No actual brain- or logic breakers here (I still had to take a walkthrough four or five times, but mainly thanks to my own stupidity). The items are mostly located at logical places, the solution may be even located just next to the keyhole where it should be by logic. I like this!  The story is really intense for what I have felt. I actually felt the necessity to accomplish Kate's mission in the first place and solve the problems not for the problems' sake, but to finally get to that damn Hans. Just like Kate, over the time I really got involved into the story behind the automatons and their creators (I inhaled EVERY document - including Anna's wole diary). I can't remember being confused about details that I didn't catch - simply because I did NOT miss out on anything. This is a rare event in more gameplay-driven games like shooters - maybe I should play more games of this kind; or play games in my native language more often... on the other hand... ugh, still prefer the original voices. German localization sucks in most cases. anyway B2T   Long story short: I had tons of fun playing it and figuring out the ways through the story. It became one of these games I enjoyed putting 14 hours of my precious free time into without regrets. The end came a bit sudden for my taste, but the story does not end there; and some day I WILL get myself the sequel(s), definitely. I can just highly recommend this game to whoever is looking for an involving, story driven experience with an interesting setting - and maybe, like me, having never touched Point'n'Click before.  And if you are really, REALLY not interested into that genre AT ALL... Man, still give this one a try. I did, too.  PS: Maybe it is just me, but I think I had some sound issues on Windows10, which (I am sure of) weren't there on Windows7. Some of the sceneries had almost no sound at all. But if that's in the game: a little minus for sound design ;D",
            "review_score": "1"
        },
        {
            "review_text": "Magnificent history! Great point and click game, with a beautiful story and many puzzles. Recomend this game to fans of Point&amp;Click and fans of games with great storys.",
            "review_score": "1"
        },
        {
            "review_text": "For ambience, mood, and setting, this is an easy recommendation, although it favors its overall presentation over anything resembling intricate puzzles or real dialogue tree negotiation. The deliberate pace creates a feeling of suspended time... time that allows you to soak in the static environments (at best, nearly on par with FFVII) and and the initially creepy aesthetic of Voralburg's automatons.   There are adventure titles with better stories, and you'll find yourself rushing through the straightforward logic of many of the imbroglios Ms. Walker's finds herself in, but as the end credits roll, Syberia still lingers like a well-directed film.",
            "review_score": "1"
        },
        {
            "review_text": "Syberia isn't a game for adrenaline junkies. But for those who are interested in beautiful graphics, outstanding story, best soundtrack, and awesome everything. Then Syberia is your game.",
            "review_score": "1"
        },
        {
            "review_text": "A fantastic and immersive experience. I highly recommend playing with headphones.   If you grew up in the era of point-and-click adventures then this will be right up your alley.",
            "review_score": "1"
        },
        {
            "review_text": "It's the good shiit, loved this shiit back in 2002, love this shiit in 2016, will always love this shiiit.",
            "review_score": "1"
        },
        {
            "review_text": "Though a little tricky sometimes and a little arduous at others, the story and atmosphere of Syberia are truly amazing.  The whole journey from Valadilene to ever-further east locations- each strange yet alive with its own spirit- is storytelling I have not seen and enjoyed in a game for a long time.  And the ending is just...fantastic. Because the story doesn't stop there, and I look forward to Syberia II.   So, if you don't mind some point-and-click material, holding up a mysterious but intriguing setting, then I would recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "Hi! This is one of the top games ever to exist. The setting in this ridiculously immersive game can make a grown man believe there is magic in the world.",
            "review_score": "1"
        }
    ]
}