{
    "app_id": 465170,
    "name": "Crime Secrets: Crimson Lily",
    "release_date": "2016-07-14",
    "developer": [
        "One More Level"
    ],
    "publisher": [
        "Artifex Mundi"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Casual"
    ],
    "tags": [
        "Hidden Object",
        "Adventure",
        "Casual"
    ],
    "achievements": 24,
    "positive_ratings": 165,
    "negative_ratings": 62,
    "price": 6.99,
    "description": "Stop the mysterious killer!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/465170/header.jpg?t=1530538694",
    "minimum_requirements": "Минимальные: ОС: Windows XP, Windows Vista, Windows 7, Windows 8, Windows 10 Процессор: 2 GHz Оперативная память: 1 GB ОЗУ Видеокарта: 256 MB VRAM DirectX: Версии 9.0b Место на диске: 2 GB",
    "recommended_requirements": "Рекомендованные: ОС: Windows XP, Windows Vista, Windows 7, Windows 8, Windows 10 Процессор: 2.5 GHz Оперативная память: 2 GB ОЗУ Видеокарта: 512 MB VRAM DirectX: Версии 9.0b Место на диске: 2 GB",
    "reviews": [
        {
            "review_text": "Ok, so I am hooked on hidden object games, and I do not really mind if they are a bit short if the price is right. The games from Artifex Mundi usually are within my comfort zone when it comes to complexity and price, but this said, I think that Crimson Lily stands out in a negative way, mainly because the many poor translations. For instance: the item list states 'bowl', and the item I needed to find was a 'bow'. This go on and on throughout the game, and pretty much ruins an otherwise decent hidden object game.",
            "review_score": "-1"
        },
        {
            "review_text": "I love these types of games, but unfortunately this template is my least favorite. The voice acting is terrible, and the game is too easy even on the hardest setting. Graphics are not comparable to the better Artifex Mundi games, they do not look very clear.",
            "review_score": "-1"
        },
        {
            "review_text": "A mediocre casual point-and-click adventure that won't wow you, but is still quite playable.  There's a story in it, but it's poorly told, with characters that don't make much sense and that are hard to relate to each other. It doesn't help when it seems that the voice actors are more bored than you are.  There are the usual hidden-object scenes and puzzles, all easy and unoriginal.  Still, the game's graphics are polished and fit well with the atmosphere. It's not a bad way to spend a couple of hours.  Finally, thank you so much, devs, for supporting Linux!",
            "review_score": "1"
        },
        {
            "review_text": "Crime Secrets: Crimson Lily is a collaboration between One More Level and Artifex Mundi. Many of the mechanics, sound effects, and puzzles are borrowed by the 9 Clues series, and I'm sorry to say it's in a way that just isn't as well done.  The game has an unfinished quality at times due to places where the vocals and text don't match up, don't make sense, and/or have timing issues. Even worse there are places where the text for items doesn't match the actual item, such as a bowl that is actually a bow, a pen that is actually a pencil, and a glasses case that is actually just the glasses. The story also lacks cohesion and is sloppy in a way that's often confusing. These flaws end up making the places where the gameplay has the typical hidden object puzzle adventure game idiosyncrasies more apparent and annoying. For example, fire extinguishers are useless if you can't get to them. A crowbar would totally be the best tool to open a stuck can of paint. Music and sound effects that don't fit – for example, using sounds that are clearly dogs for wolves – round off the unfinished feel.  I still am giving this game a recommend for those who are devoted Artifex Mundi fans like myself. For those new to the genre, there are many better titles to choose from.",
            "review_score": "1"
        },
        {
            "review_text": "This is a very short HOG. The story....its fun. I mean there is this killer and you are his prisoner every few minutes. Anyway, as most HOGs have a silly story it doesn't matter. So what about the gameplay? Its very very easy. A few times there is a little confusion because of missspelled objects, but most pictures have so few objects that you shouldn't have a problem with it. Could I recommend it? Not for the asked price. If you can get it for 1 - 2 € buy it.",
            "review_score": "-1"
        }
    ]
}