{
    "app_id": 465750,
    "name": "Tank Battle: North Africa",
    "release_date": "2016-07-12",
    "developer": [
        "HexWar Games"
    ],
    "publisher": [
        "HexWar Games"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Hex Grid",
        "World War II"
    ],
    "achievements": 18,
    "positive_ratings": 14,
    "negative_ratings": 3,
    "price": 6.99,
    "description": "Take command as the British Commonwealth and U.S. forces fight the Germans in the North African theatre and lead your battalion to victory in challenging tactical battles.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/465750/header.jpg?t=1468346602",
    "minimum_requirements": "OS: Windows Vista/7/8/8.1/10 Processor: Intel Core 2 Duo or AMD equivalent Memory: 2 GB RAM",
    "recommended_requirements": "Memory: 2048 MB RAM Graphics: Discrete graphics with 256 MB or more VRAM",
    "reviews": [
        {
            "review_text": "If you enjoyed 'Tank Battle 1944', or the 'Battle Academy' series for that matter, then you'll have to add this to your library. With 'Tank Battle: Pacific' no doubt to come, it's a turn-based strategist's Golden Time.  Incorporating additions made to previous HexWar games, with a zoom feature now added the battles are turn-based and the decisions played out in real time. With HD graphics improving on the looks from the IOS version, the game tackles the rugged and sand covered battlefields of North Africa in 1943. With an 8 part tutorial, the game depsite being a mobile port, which is now a common and sometimes popular choice it, feels more like 'Battle Academy' than simpler titles such as 'Frontiline: The Longest Day' or'Road To Moscow'. The maps are just smaller, and the AI not perhaps as viscious even on Hard. It will give you a challenge, though.   Just don't go expecting 'Panzer Corps', 'Unity of Command' or a remake of 'Steel Panthers'.  As with the previous title 'TB: 1944', the game focuses on one front, the North African front where the USA and Great Britain fought the German Afrika Korps (as did our boys, the ANZACS who usually always get left out, but proudly adopted the intended insult with the German label 'Rats of Tobruk'). While you may at first think you have quite a strong force to take the objectives, you'll be often surprised at having 3 Panzer III's suddenly arriving to block you from three sides. That's Rommel for you, not a cheating AI. Then again, you will often have off-map air and artillery support so it all balances out.  The graphics are seviceable, with my only gripe being the Allies having their units 'painted' in European green (even tan and blue would have been more historically authentic, even if it were only the British who sometimes used that scheme). Might help distinguish Axis from Allies, but if you're a history buff you'd do that by looking at the unit up close. Besides, your units are highlighted with each term. Still, a monor gripe.  The price point is right, and if you are in the mood for a strategy/tactical turn-based game and have any interest in this period, and don't want to spend the extra dollars Slitherine/Matrix demands for it's titles. Then again, if you are totally opposed to mobile ports, which is a bit strange in this day and age (move with the times, or stand still in the past) then it won't be for you, no matter the quality.  If though, like me you enjoy mobile ports like this that fill that important niche where games lasting no longer than 15-20 minutes fit well with real life demands...grab it.  EDIT: I really don't understand people rating reviews as 'funny' when they aren't especially. Weird!",
            "review_score": "1"
        }
    ]
}