{
    "app_id": 466500,
    "name": "35MM",
    "release_date": "2016-05-27",
    "developer": [
        "Носков Сергей"
    ],
    "publisher": [
        "Носков Сергей"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Indie"
    ],
    "tags": [
        "Post-apocalyptic",
        "Atmospheric",
        "Survival"
    ],
    "achievements": 20,
    "positive_ratings": 2113,
    "negative_ratings": 873,
    "price": 5.99,
    "description": "Post-apocalyptic story about two travelers who set out on a long journey in the wasteland, left by people after the global epidemic.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/466500/header.jpg?t=1556101177",
    "minimum_requirements": "OS: Windows XP / 7 Processor: Intel Dual-Core 2.4 GHz Memory: 3 GB RAM Graphics: NVIDIA GeForce GTX 275, GeForce GT 520, GeForce 8800GT DirectX: Version 9.0 Storage: 3 GB available space",
    "recommended_requirements": "OS: Windows  7 Processor: Quad Core Processor Memory: 4 GB RAM Graphics: NVIDIA GeForce GTX 960, GeForce GTX 560 DirectX: Version 10 Storage: 3 GB available space",
    "reviews": [
        {
            "review_text": "FIRST IMPRESSIONS:  I. Poured the gas into a railroad cart. It's somewhat reminiscent of Metro, but instead of shooting radioactive mutants, I'm shooting pictures with my 35mm camera. And no, it's nothing like Pokemon Snap. However, for a game I had little to no expectations of, I can say I'm pleasantly surprised and constantly catch myself thinking that it's pretty decent for being developed by a single person.  And now I'm off the cart and into a new area that can only be described as quintessentially 'russian', my friend whose name I have yet to hear marches onward towards our first encounter with other humans. This is where they introduce game mechanics similar to Telltale Game's Walking Dead series, e.g. timers and button mashing. It's obviously not there to create a challenge, rather it serves as an instrument to the game's atmosphere, narrative, stream of consciousness, or whatever you want to call it.  Something that I keep encountering when I'm playing this game, or in one example, while I was on a short little mission to fill up a bucket of water outside in the dark, is a sense of dread that's not unlike that of a horror game. But what makes this unique over any of those games is that there's this prevailing sense of dread in certain moments, and it's mostly derived from I think is fear of the unknown. Everything about the game is mysterious, from its Russian origin, the shoddy translation, slow paced gameplay, it's all so silently overwhelming. And that's incredibly clever. I think that sums up what this game is to me. It's clever and it's obviously the summation of many hours of love and diligence that only a one man production effort can possibly accomplish. It's not polished, it's doesn't make your eyes pop out, at least not yet. But it's a GAME, whatever that means, and it's interesting and original, despite being yet another post-apocalypse game.  t.b.c.",
            "review_score": "1"
        },
        {
            "review_text": "35MM is set in Russia, During a post-apocalyptic time. You start your journey with a friend of yours, i'll admit now. During the start of the game, iv never wanted to kill a companian/hope they would die more then your friend in this game, but now, i actually enjoy very much how the game is.   It may be seen as slightly slow for certain people, but in my opinion its not for the fast paced gameplay, its for the Journey itself. The Atmosphere is really what wins it for this game, its amazing. Truly. Its spooky, its creepy, its dark, the atmosphere is also maybe depressing? in a way but a good way infact, but that is what makes it what it is. The way you walk around the towns, woods, wasteland with your companion slowly, has a depressing feel. It makes you feel as if you were the one walking in what has happend with a friend.   10/10",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, Id definitely recommend it if you like atmospheric games. If you do choose to buy it, the begining was a bit boring and slow in my opinion so keep that in mind if you run into that.",
            "review_score": "1"
        },
        {
            "review_text": "It is the most Russian game I ever bought.  Russian graphics Russian game mechanics Russian story Russian depression More Russian than S.T.A.L.K.E.R and Metro and CSGO together",
            "review_score": "1"
        },
        {
            "review_text": "I'll just start off by saying this game is worth the money BUT the game has a couple things I'd like to bring up. For one when you start the game like I did for the first time I couldnt read anything because it was all russian in the menu lol. If you can navigate your way to the settings and change this to english ( that is if your english of course ) then you'll be set from there. Two the game doesn't give any hints to where you should go or what to do other than a quick sentence you hope you heard the first time around and even that still kind of was hard to go off of in a couple points in the game. Other than that really the game is great and looks good too. It will def. keep you on your toes and at other times just have you relaxed and compelled to explore around and see everything. It has a good story to keep you wanting to see what happens next. Def. worth playing and trying out if your into a this type of game.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great low budget game. It has potential but is not throwing it away like many others do. It's very interesting and scary. I don't wanna spoil anything so ill make this short. The only thing i don't like is the optimization. It could be better.",
            "review_score": "1"
        },
        {
            "review_text": "Glad I never saw the 'walking simulator' tag before buying as I would have probably skipped this. However there's definitely more to it than that. Yes, there is quite a lot of walking but there are other elements to it such as looking for supplies in empty houses/buildings, getting chased, and some combat. It's no Stalker game, but as far as atmosphere, it is certainly there and very reminiscent. I would highly recommend it for that last point if you did enjoy the Stalker series.",
            "review_score": "1"
        },
        {
            "review_text": "Short documentary film about indie-developer Sergey Noskov from Russia («The Light», «The Train», «35MM») — with english subtitles Короткометражный документальный фильм про инди-разработчика Сергея Носкова из России («Свет», «Поезд», «35MM»)         YouTube™ Video:  Sergey Noskov: DOCUMENTARY&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "the graphics are beautiful and the atmosphere really just pulls you in",
            "review_score": "1"
        },
        {
            "review_text": "Its good...i enjoyed it...but...but...it doesnt even started and it was already over..... :(",
            "review_score": "1"
        },
        {
            "review_text": "What is 35mm?  Genre: first person exploration game with fps elements Setting: traveller trying to find his family in a post-disease Russia Difficulty: 3/10 --&gt; basically nothing difficult, but shooter passages are a bit clumsy Length: 3-5 hours for a single playthrough, up to around 15 to get all achievements Mode: singleplayer campaign Similar games: Can't name any, sorry ;)   The positive aspects:  - very chastened atmosphere - sets a fitting tone - landscapes and locations rich in variety - 'side-quests' (achievement stuff) to do along the main path   The negative aspects:  - that game is awfully dark. I had to brighten up my graphics card to see a thing - needless shooter passages with apparently only a single hitbox - low walking pace; sometimes you have to wait several minutes before your partner arrives to let the game make progress - superficial items and inventory management - story and backgrounds are not fully revealed and explained    Result (and summary for those who have no time reading):  Although 35mm has some downsides, it is worth taking the virtual journey. Being a rather slow, actionless exploration game, the depressing atmosphere and tone of the game make it quite an enjoyable experience.  If you're interested in those kind of games - give it a try!",
            "review_score": "1"
        },
        {
            "review_text": "This game reminded me somehwat of the film 'The Rover'. It's a very minimalist story driven game. Not without its flaws but overall I found it to be excellent with some incredibly tense moments and serious atmosphere. Would definitely reccommend it to fans of post apocalypse games.",
            "review_score": "1"
        },
        {
            "review_text": "Best game I ever played 10/10 Best story telling and acting is amazing. You can campare the story to the last of us . The gameplay and mechanics are out of this world there is no dull moment. The game will keep you on the edge of your seat. Best combat i ever encountered in a pc game. A must have for all pc gamers out there!!!!",
            "review_score": "1"
        },
        {
            "review_text": "After changing the lauguage to english I noticed in the bottom right hand corner that there was the word 'okey' instead of the word 'okay'... Would rate game 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "Nice realistic post apocalyptic atmospheric game with good graphics. howerer game need still work. Get out here stalkers!",
            "review_score": "1"
        },
        {
            "review_text": "Nice realistic post apocalyptic atmospheric game with good graphics. howerer game need still work. Get out here stalkers!",
            "review_score": "1"
        },
        {
            "review_text": "First of all, the game did pretty good with graphics. This was not a 'survival' type game, nor was it a crafting based game. The story could have been a little better, but it was okay for a $13 game. There is little direction in game, but it may be what they were going for. You can see some gameplay at my YouTube channel.  Gameplay Video:         YouTube™ Video:  35MM Gameplay | Walk-Through Ep.1 | Where's the Bucket?!&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "This game needs to meet DayZ. They need to talk about something, Go to a dinner or something. Watch some movie or whatever. Get to know each other. Grow fond of each other. Got to some quite place and have sex in the end. Sex needs to be done without condoms. As if condoms weren't even invented. So there could be a baby. A nice little boy. A beautiful baby boy. No homo.",
            "review_score": "1"
        },
        {
            "review_text": "Very atmospheric game! There is some moments, that need to update, but game is very good.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great. I love the detail and story line of the game. The ending is sad but it is good. The people who made this has put a lot of effort into this game and it paid off.",
            "review_score": "1"
        },
        {
            "review_text": "This game does a lot of things really well. I can safely say that this game is one of the most well done indie games I've played in a while.",
            "review_score": "1"
        },
        {
            "review_text": "I liked this...",
            "review_score": "1"
        },
        {
            "review_text": "Check the Video. I've played 30 minutes of the game and the 'Mate' is sooo slow and you have no clear objective in in the game so its alot of exploring and 'guessing' you way to your objective           YouTube™ Video:  &nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Be wary of the bucket.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Geat Russian Post-Apoclayptic game!  Alot better than most American post apoclaytic games with their exaggeration of the disaster situation in the storyline and the usual spicing with addition of zombies and nukes as the cause. 35mm actually takes you on a realistic outlook on an apoclayptic world scenario where it shows there something more to surviving than it looks to be.",
            "review_score": "1"
        },
        {
            "review_text": "Hi guys, I've found this 35mm very much interesting and so I decided to play it.   Screens and Trailers was great, a travel of emotions inside the abandoned towns of mother Russia... but... there is a problem, a very big problem:  Maybe the author of the game was testing the Unity features, maybe the wargames teach us that when you have been Hit everything becomes 'blurred' and you lose the focus...  Well, ignore totally the screenshot, but you will play all the game without a clear image! A continuous pulsating blur will disturb the screen, because 'you have to eat' or 'you have to heal'. Well, when you will get a (sporadic) food and you will eats, the screen will return normal, but for 2 or 3 minutes, then again blurring the focus on and off.  Did I forgot something? I've tried every graphic setup switch but nothing..  After 2 hours like this I've decided to wait for un update that remove this unopportune thing. The effect is heavy annoying and after a while I've lost my patience.  Sorry guy, game unplayable. Differently my review was good.  Lord Hol Napult's experience: 0*/10  *visual Blur effect",
            "review_score": "-1"
        },
        {
            "review_text": "It was actually pretty at the beginning, the concept, atmosphere everything was so nice and the sounds were really relaxing, but I'm in BOR now and stuck probably forever and I just raqe quit just because an unkown creature have plantet a trip mine through a door where there are ABSOLUTELY NOTHING to protect, game is too unrealistic that it has nothing to do with 'surviveing' you have to eat 10 cans each 5 mins in order to see 'normally' otherwise you'll see the entire game blurred and all those atmoshpere is gone till you find at least 6 cans or something, and search however you want wherever you want, you just can't find anything, so devs were like; HEY GUYS LET'S MAKE AN AWESOME ATMOSPHERIC GAME WITH 0 OPTIMIZATION AND MAKE THE GAMEPLAY ♥♥♥♥.  I'm just ♥♥♥♥ing going crazy right now I'm sooo glad that I got the game with discount, trust me, it'll seem so nice in the beginning but after 2 hours you'll be like 'WHAT THE ♥♥♥♥ IS THAT TRIP MINE DOING THERE IN THE MIDDLE OF NOTHINGLES?!!?!!! AND HOW THE ♥♥♥♥ AM I SUPPOSE TO SURVIVE IF I NEED TO EAT 9043466346357234234 TIMES IN A DAY??!?!?!?!  GOD I HOPE I COULD REFUND IT I'M SO ♥♥♥♥♥♥ OFF.  And the worst thing is, when you die because of a trip mine wich is unknown to how to be gotten there, the game throws you back to beginning of the game and you be like 'okay fine, I can run through the whole place again and get to the place where I've been' lol no you can't, after 3 min of periodically running, you'll act like you ran marathons with 9000000 km/h for 48 days, yeah I'm not joking try it yourself if you want!   **IF YOU HAVE A LOW AMOUNT OF MONEY. DO NOT BUY THIS GAME!**",
            "review_score": "-1"
        },
        {
            "review_text": "In short: Starts out great. Ends up giving you cancer.  Awful quicktime events, awful forced combat, awful puzzles, awful hunger/health mechanics that turn an atmospheric experience into a speedrun. Looks pretty if your standards for graphics are 'half life 2'.  But hey, the first hour or two are actually decent, despite of all of the above. Just don't expect anything beyond that.",
            "review_score": "-1"
        },
        {
            "review_text": "Janky audio bugs, stiff animations and dull uninspired gameplay make this boring as hell. Stick with S.T.A.L.K.E.R. or Metro.",
            "review_score": "-1"
        },
        {
            "review_text": "FOV is fine, and mouse sensitivity goes very low. This is good. The bad part is the headbob. Even with headbob disabled in the menu, the player still wobbles around like he's had about 12 litres of vodka. I've been able to play for about five minutes, and then had to stop because I felt like I was going to barf. Motion sickness is still very much an issue with this game.  Hopefully the dev will update the game with a solution. I would like the player to stand completely still when at rest, and when moving, not sway back and forth.",
            "review_score": "-1"
        },
        {
            "review_text": "I'm trying to think of positive things to say about this game, but honestly I can't.   First, you can't remap the key bindings, which is a big deal for me as I don't care much for the traditional WASD controls.   Next, the graphics are, to be blunt, bad. I'm not the kind of guy that needs the latest &amp; greatest graphics --in fact, I still fire up Doom1 &amp; Doom2 from time to time --but in a game like this where there's not much else to do but look at the inexcusably bad graphics as you slowly plod along, it's inexcusable. There are much better looking games that are much older, and the animation is some of the most unimpressive I've ever seen --especially the dog you run into early on in the game.   Speaking of slow, your character moves stiffly and slowly --more slowly than I do in real life. You can sprint, but only for a while before you run out of breath. So far, this mechanic seems to serve no purpose.  Additionally, nearly all the time I spent in this game was spent basically doing nothing except trying to diving which direction the game wanted me to slowly plod toward, and then waiting for my excruciatingly slow AI companion to shuffle over towards me. Also, he gives a long and uninteresting speech in a barn which is not skippable, even if you've already heard it before because that's where you left off yesterday.  Did I mention this was yet another 'mystery disease wipes out most of mankind' post-apocalyptic game? Haven't we had enough of those lately? At least they usually come with some zombies to liven things up...  Really, the rest of my complaints fall under the game basically being inscrutable: * You can interact with things using the 'E' key, but there's little to indicate what you can interact with. The engine seems picky and inconsistent over whether or not you've got an item centered on your screen to interact with, even when you're butted firmly against it and have it dead center. Items will apparently highlight a bit to indicate you can hit 'E' to do something with them, but even this feature works sometimes and not others.  * There is an inventory system, which also seems to serve no purpose.   * You can pick up food, but it doesn't seem to do anything. You can also pick up batteries which don't seem to do anything.   * You have a camera that you can take pictures with, but again... this doesn't seem to actually do anything.   * You have a knife that doesn't seem to do anything except cut some threads on door handles, and even then it seems to behave like it passed ponderously through thin air rather than actually striking something.  * Did I mention having to guess where your pokey companion would like to plod along to, and waiting for him there?  * Hey, it's night. Your vision is darkened and worringly blurry. Do you need to eat something? Is your health low? Do you even have health? No way to tell.  * Some doors you can open, with some fiddling around with positioning. Except that one. Or that.  * Do you need to climb this ladder that obviously leads to a roof? Can you even climb a ladder? Just keep fiddling with it and find out! (hint: you can't)  * Go get some water from a well. We all love fetch quests! Especially when you're moving like a 90 year old with a glass hip. You'll eventually find the well through trial and error, but oops! You need a bucket! Guess what: it was the bucket you found 30 seconds into this stage and TRIED to pick up, but because the 'use' system is buggy, your 'E' key didn't do anything with it, and since there's no indication what's something you can 'use' and what's just static mesh, you decided it must just be another static decoration like most things in the game.   ...and at that point, I uninstalled.",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this for £3 during a sale, I would say it was worth it, but not worth £9.99.  TL:DR A very basic short game, basic controls, no UI, no settings for keybindings/graphics/sound, very little to interact with in the game. But some levels were creepy and fun.  YOU CAN NOT SAVE IN THIS GAME.   You have to complete a level entirely before you get a checkpoint, and when you die you go back to that checkpoint, this is the biggest downside to this game.  ------------------------------------------------  There are some levels in this game that were pretty cool, but you have to play for over an hour or more before anything really interesting happens.  I have no idea what the camera is useful for, I have no idea why reading some things or playing an instrument makes the screen glow, I had no idea there was different endings, but I will probably not play through all the boring levels just to get a different ending.  I thought this was a survival game, but it is not, you have food and medical supplies but they both just increase a 'health bar'.  There is no survival elements to this game, you can die a couple of times through the game from enemies or traps, but other than that you don't need to do anything to survive...  The story is pretty basic, some dialogue and some diary entries you can find around the levels but it is all badly translated Russian to English.  All the dialogue is in Russian with subtitles, which I have no problem with.  The animations are pretty basic, you are given items that have very few uses, once you get a gun you have litterally only 2 encounters where you need to use it.  The game ended without resolving anything, I was expecting to meet up with my partner who I had left behind to turn a switch off, but instead I reach a town where you can explore a bit but reveals nothing and you finally get to a room where you just sit at a window and the game ends...  Very bad ending to the game, story left unfinished, areas of the game I wanted to explore but couldn't because of litterally being on some rails...  Over all I am a bit disapointed in this game but a bout an hour of gameplay in the middle was interesting. I left the game running all night because there is no way to save progress, that's why I have 10hours of playtime. I basically spent 3hours in game and most of that was running about trying to activate things to progress.",
            "review_score": "-1"
        },
        {
            "review_text": "I thought the game looked promising at first glance so I gave it a try. As a Youtuber I respect all games wether they are horribly made or not, someone put time into it for whatever reason. As for 35MM, if you are looking for any kind of excitement or engaging gameplay you will not find it here. I hate to say it but I would not reccomend this game even to the most avid of story driven gamers. 3/10",
            "review_score": "-1"
        },
        {
            "review_text": "I really wanted to like this game. Unfortunately, there are some issues that keep it from being worth the effort. Keys are not rebindable, there is no FOV setting, and the headbob/FOV combination is sure to make anyone sensitive (like myself) motion sick pretty quickly. The game defaults to Russian, which is fine, but expect to dig around a menu a bit to discover where to set the game to English. Once you do, expect to be reading some of the most poorly localized subtitles I've seen in a long time (there is no English voice over).  If there is an interesting story to be uncovered in this game, I certainly wasn't willing to subject myself to the gameplay and visuals for more than 45 minutes to find out.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is extremely slow. Nothing happens for quite a while. When something finally happens then it still feels slow and boring. I would not recommend this game unless you want a slow game with almost no action.",
            "review_score": "-1"
        },
        {
            "review_text": "DON'T BUY THIS GAME IF YOU ARE NOT RUSSIAN!!! It is developed in russian. The interface is russian. The sound is russian.  It is not even possible to change the interface language without problems, because you cannot understand the options. And when you were able to change it, you do not know the keys to control the game, because you cannot change the key settings, and there is no manual.  I even requested a refund for the very first time.",
            "review_score": "-1"
        },
        {
            "review_text": "20 minutes of walking for a poorly animated bear. This is a disaster of a ♥♥♥♥ing game.  20 minutes of walking in a boring forest, it's Unity so it isn't even pretty, and 20 minutes of walking and doing LITERALLY NOTHING for running away from a bear.  Who the ♥♥♥♥ thought it was a good idea to make a game about those boring parts they cut out between the interesting parts in post-apocalyptic games, the part where they walk around and are silent the entire time. At least put in some good dialogue in there but frankly I was too un-♥♥♥♥ing-interested in the game to continue.  ♥♥♥♥ this piece of ♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "I have never seen anything like that, the quality of the game is simply stunning. All these game assets were downloaded from some website with free 3d models and textures, all these sounds recorded by the author in 32 kbit/s in his bathroom. All character animations are comparable in terms of quality with Uncharted 4, I believe they all were captured from the author's mother in the same bathroom where he recorded sounds, and perhaps they have even been recorded at the same time. The dialogues are written by some fen addict who thought something like: 'this is how real men talk on my block.. before they start giving each other head'. In the game the main character has a 'friend' and the first thing that the game does to introduce him is that it shows you that he is a full degenerate with partial paralysis of the legs and all your further adventures will be only in endless waiting for your new barely walking buddy.  The most funny thing is that this apocalypse does not support screen resolutions higher than 1080p. Mankind has never seen a game with such a performance, and with so many so beautiful pixel on your screen.  Anyway, the game is better than new Doom.",
            "review_score": "-1"
        },
        {
            "review_text": "A friend of mine told me that this is a must have game, so I bought it during the summer sale. Now, when my suffer from playing this 'game' is over, I suggest him to play this 'game' too, otherwise he will be no longer the friend of mine!!!.",
            "review_score": "-1"
        },
        {
            "review_text": "That was a painful 36 minutes. Your friend doesn't keep up, the map loads small areas that you can walk around in with cinematics between each section, and npc movement doesn't seem very smooth. I personally refunded the game, and don't think it's worth $13.00. I didn't even want to play after I saw the first 'zombie' think in the hospital. I got chased by a fat bear that ran into trees constantly, then I had a flashback about a hospital.",
            "review_score": "-1"
        }
    ]
}