{
    "app_id": 466800,
    "name": "The Dope Game",
    "release_date": "2016-05-30",
    "developer": [
        "CoaguCo Industries"
    ],
    "publisher": [
        "CoaguCo Industries"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud",
        "Stats"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Simulation"
    ],
    "tags": [
        "Casual",
        "Adventure",
        "Simulation"
    ],
    "achievements": 26,
    "positive_ratings": 135,
    "negative_ratings": 33,
    "price": 1.59,
    "description": "To escape the city of Starkham and start your new life, you get your friend Preston to set up a meeting with the local loanshark, Sweaty Mike. After foolishly borrowing $2,000 to start your fledgling drug dealing career, you embark on a timed mission to sell as many drugs as possible throughout the city.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/466800/header.jpg?t=1545631804",
    "minimum_requirements": "OS: Windows 7 Processor: AMD or Intel Graphics: OpenGL 2.1+ Capable Sound Card: Not necessary but you'll miss out on the music Additional Notes: An okay memory or notepad",
    "recommended_requirements": "OS: Windows 7, 8, or 10 Processor: AMD or Intel Graphics: OpenGL 2.1+ Capable Network: Broadband Internet connection Sound Card: Pretty much any Additional Notes: A good memory or spreadsheet app",
    "reviews": [
        {
            "review_text": "Great drug slinging simulator. 100% worth the $2 I paid for it.   You get to hoard cocaine and sell it for millions after slaughtering countless cops and watching your hired thugs bleed out in front of you. All before subsequently hiring more meat to feed to the pigs as payment for your terrible life choices.  Shank your loanshark. Rob a bank and fill the teller full of bullets. Run from the cops. Buy low, sell high. Recieve a grenade to the chest for critcal damage. Watch as you cough up blood all over your ill-earned shoes and fall back into a sweet peaceful slumber.  10/10   ",
            "review_score": "1"
        },
        {
            "review_text": "You one of those 30+ plus gangstas that played Dopewars in the 90's on win98 or os8? Yeah?  Buy them ludes (the epitome of The Dope Game), and get some cheap free time.  Use them, and with the proper mix (DLC's and updates), this could turn into blow (10/10). Play E40's 'Choices' in background for +1 decision making.",
            "review_score": "1"
        },
        {
            "review_text": "The Dope Game is a drug selling simulator wherein your goal is to make it to the end of X amount of days without getting arrested or killed. Ultimately, you need to make enough money to pay back the loanshark who lends you two grand to get you started on the righteous path to selling all kinds of substances, anything after that is fair game to spend as you like.  I'm not even sure why I bought this title. The most obvious reason that I can think of, is that it's a throwback to the old web-based drug dealer games that my friends and I used to play during computer class in high school. Somehow, believe it or not, this game is actually less interesting than the web-based version that I used to play; it didn't even have any fancy pictures. This one does, however mediocre they may be. I still haven't figured out why you seem to play as the Unibomber, either.  The gameplay is basic. You travel around different parts of the town, and you buy and sell various illegal substances. Each time you travel, an entire day passes despite the fact that you take the bus there. If you're smart, you buy when the prices go low and sell when they're skyrocketing. The catch is, not all substances show up every day, so you could potentially be stuck with 40 hits of Ecstasy for days; even longer if the price doesn't flip in your favor. Lucky for you, the creepy old hooker hag on the bus usually has some insider wall-street drug information. Sometimes you run in to trouble with the law, or groups of gang members. These events could lead to either your arrest, death, losing a portion of your money, or losing some/all of your drugs.  There are some stores scattered about town; the loan-shark, gun store, hospital, and bar. Each have a rather cliche character running the joint. Sometimes a random guy will approach you on the streets to sell you a new backpack, so that you can hold more drugs. If you're feeling especially violent, once you have enough money you can purchase a weapon and then go on a murderous rampage if you so desire.  With that, there is honestly not much more to say about The Dope Game. Once you've survived for the initial 15 day period, you can go back for 30, 45, etc, as they unlock through progression. It's fairly easy to cheat the game by just buying Ecstasy when it's at an all time low, selling at a high, going and paying back the loan-shark, and just traveling on the bus until the days are done. The gameplay is dull and uninteresting even for what it is, the artwork is painful to the eyes, and the music is drab. Just go seek out old web-based versions of this same concept, and you'll have a better time.   Rating:  1.0/5.0  - It's Bad.",
            "review_score": "-1"
        },
        {
            "review_text": "it does what it intends to do. if you ever played drugwars you know what to expect. if not, it's a fairly simplistic concept. You buy low and sell high. the biggest challenge is getting to know the price range of drugs in order to turn the most profit. there are small events and RNG based outcomes but the meat of the game is the repetitive cycle of buying and selling. I recommend it because of it's low price, but don't expect anything major.",
            "review_score": "1"
        },
        {
            "review_text": "YES YES YES YES YES!!!dope!!! FINALLY!!!  Back in the day we had *^**wars.exe and now we have this! THE DOPE GAME is a beautiful graphic representation of the window excel game I once loved.  Recommend with three thumbs up. total boner for this.  *Navi* [\\'Listen\\' to that lady on the bus... she is smarter than most people you\\'ll ever meet in life....]  The drugs dont appear in the same spot in the listing, Everything appears to be all RNG(ed?). which leads to harsher and longer time spent making dope deals. ^this is an obvious key to strategy tho     sidenotes: (i may be too intoxicated to realize) Hotkeys instead of using mouse?? which leads to controller support?!?!   ",
            "review_score": "1"
        },
        {
            "review_text": "For those that played the old Drug Wars game, this is a nice update on the concept. That said there is PLENTY of room for improvement.  1. The gang of guys with baseball bats should be combatable, if I have 5 goons and a chain gun you cant tell me I would run and lose things while I did it. I don't care if the odds are 10 to 1. I have a chain gun...nuff said. Dropping things every time a gang of ultra deadly baseball bats shows up is dumb as ♥♥♥♥.  2. The market system is not even as good as DW's was. A lot of times a product you pick up you might have to hop 4-5 sections of town to find it even on market again and normally thats not for a profit when you do finally get it again.  3. Dialog is used up entirely in your first 30 day run normally, some variation would be rather nice.  All in all not a bad game for the price, you get a good deal of entertainment for $2 but it could definately be improved to keep people a bit more interested.  If anybody knows of a drug dealer that loses product and money as often as you do in this game I would like to know that person. Because they would be a good friend to have and what not ;D",
            "review_score": "1"
        },
        {
            "review_text": "Simple mechanics, yet somehow addictive. I played the original version countless hours. This is one of those games you can easily use to fend off that ever-lurking horror of boredom",
            "review_score": "1"
        },
        {
            "review_text": "I'm hooked! It's a pretty solid trading game for under $2. Don't really know what the haters thought they were entitled to at that price point, but I certainly feel like I got plenty of entertainment value for my money.  The only problem is going to be dealing with the withdrawls while I'm at work...  UPDATE: After putting in a few more hours, I do want to say to the devs that the longest game (I think it's 320 days) needs some serious balancing of the 'events' that trigger when you travel between cities late in the game. The last 100 turns or so you have a cop jumping on you 95% of the time which makes it impossible to actually trade any dope. Since trading is the whole point of the game, this takes a lot of the fun out of it and makes the late game much more of a grind. PLEASE DO SOME BALANCING OF LATE GAME EVENTS!!! Overall, I still recommend the game.",
            "review_score": "1"
        },
        {
            "review_text": "So I have got to say that this game isnt bad. It has a good concept and a good price. But as you play, the game appears to be very easy. I mean the first time I played I traveled somewhere and immediatly got arrested even though I wasnt hold durgs but whatever. But after that I won 4 times in a row in less that an hour. I mean I guess it got a little challenging but it was too easy for me. I could literally just go from one place to another, buy the cheapest drug in abundance, sell it in an expensive area, put all money in the bank, and wait it out. And BOOM you win. But one thing that really bothers me is that it seems more like a flashgame. It doesn't seem to be a game that would cost money. Also once you get the hang of playing this game, it gets repetitive. Going back and forth and getting a bunch of drugs and selling them and win. This game seems more like a slightly strategic time waster. But the characters kind of make up for this game. I recommend this game to the people who just want to spend their money on a flashgame or just want a time waster.   PROS -   - Good Concept - Decent price - Good Time Waster - Characters  CONS -   - Gets Easy - Gets Repetitive - Seems More Like a Flash Game  I would give this game a 6/10. ",
            "review_score": "-1"
        },
        {
            "review_text": "game is fun but july 19th they just patched in 'limited to 60 fps', now i know this game doesnt really need more than 60fps but everything looks better at 60+...",
            "review_score": "1"
        },
        {
            "review_text": "One of the stiupidest games ever and is clearly a great commentary on the state of this world... ITS F&amp;%*ked.",
            "review_score": "-1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        }
    ]
}