{
    "app_id": 467210,
    "name": "Evo Explores",
    "release_date": "2016-05-16",
    "developer": [
        "Kyrylo Kuzyk"
    ],
    "publisher": [
        "Kyrylo Kuzyk"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements"
    ],
    "genres": [
        "Casual",
        "Indie"
    ],
    "tags": [
        "Casual",
        "Indie",
        "Puzzle"
    ],
    "achievements": 8,
    "positive_ratings": 272,
    "negative_ratings": 17,
    "price": 2.79,
    "description": "Explore impossible geometry and optical illusions!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/467210/header.jpg?t=1463419450",
    "minimum_requirements": "OS: Windows XP SP2+ Processor: 1.4GHz+ Memory: 512 MB RAM Graphics: Shader model 2.0 DirectX: Version 9.0 Storage: 200 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "A bit easy, short. But well executed, pretty, and good enough for such a small price.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing spatial puzzle game! Money well spent :)   Highly recommended!!!",
            "review_score": "1"
        },
        {
            "review_text": "  Fun mined games, nice colors and smooth music while you try and figure the Harder puzzles. 5/5 Cashews [Great fun little game to pass the time]",
            "review_score": "1"
        },
        {
            "review_text": "very well made game, could use improvement in some areas but overall well executed game, if you like puzzles that are easy and hard at the same time, buy this.",
            "review_score": "1"
        },
        {
            "review_text": "  This is a cool puzzle game where the objective is to manipulate the environment in Escher-style configurations. The art style is pleasant and the color palette is nice and mellow. Overall, a lot of good things can be said about the design of Evo Explores and it certainly deserves more shine. In short, the game is well put together. My only gripe is the main character - I think there isn't really enough personality there to draw you in. In fact, the environment and geometry of the puzzles are so much more interesting, that they totally overshadow any story or characters. I got it as a gift from a friend (thank you!) and it was certainly a pleasant surprise.",
            "review_score": "1"
        },
        {
            "review_text": "A very nice and short game. Would like to see more levels. Maybe a Evo Explores 2?",
            "review_score": "1"
        },
        {
            "review_text": "So I played this as part of Kongregate's weekly challeneges for badges... And I found it to be much like Monument Valley. I wasn't surprised to learn that Monument Valley was the inspiration. The game is beautiful, and very ambient. If they ever decide to do some DLC, even just the soundtrack, I WILL buy it.",
            "review_score": "1"
        },
        {
            "review_text": "Mind bending puzzle game with really nice mechanics - Escher would be totally proud!  Maybe a bit short - if you have a bendable mind - but i totally enjoyed this Indie-Gem.  Also - not standard and very cool:  - lots of translations - usage and crediting of  freesound.org  \\o/ - scrollable credits  Very much looking forward to maybe more levels or an editor or something. The ending leaves this very open, so i sure have hope :-)",
            "review_score": "1"
        },
        {
            "review_text": "This game would make the artist M.C. Escher proud as this game shares similar optical illusion styles. I find this game unique and entertaining.",
            "review_score": "1"
        }
    ]
}