{
    "app_id": 467390,
    "name": "Approaching Blocks",
    "release_date": "2016-06-03",
    "developer": [
        "Dymchick1"
    ],
    "publisher": [
        "Dymchick1"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Casual",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Casual",
        "Singleplayer"
    ],
    "achievements": 16,
    "positive_ratings": 167,
    "negative_ratings": 89,
    "price": 1.69,
    "description": "Play and study foreign words! Try dodge from blocks. When you loss, showing words in a foreign language. To complete each level hold 100 seconds. First two levels are quite simple, but starting from the third, it will be hard.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/467390/header.jpg?t=1478029368",
    "minimum_requirements": "OS: Windows 7 Processor: Dual core from Intel or AMD at 2.0 GHz Memory: 4 GB RAM Graphics: nVidia GeForce 8600/9600GT, ATI/AMD Radeon HD2600/3600 Network: Broadband Internet connection Storage: 300 MB available space Sound Card: DirectX Compatible",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Playing it for the first time, the first stage feels so fresh and interesting. Felt good getting the first stage achievement.  As it goes on to stage two and three, it begins to start feeling dreadful.  Looking thru the discussion only to realise the questioning achievements involve switching the language to designated Russian (Quiz). Becomes more dreadful trying to complete the game, and trying to randomly pick the answers to fit the achievements criteria.  Truthfully, learnt nothing of the language for the quiz.  End of session and completing the game. I feel myself in a daze. Little sense of achievement felt.    A twenty-five cents game with a coupon.  ",
            "review_score": "-1"
        },
        {
            "review_text": "Good game, kinda like smash hit and falling Fred, both mobile apps... Still quite fun, learn a bit of Russian while your at it and fail ,a lot, hard game and good game.",
            "review_score": "1"
        },
        {
            "review_text": "Very Hard and Fun :D good to play vs friends",
            "review_score": "1"
        },
        {
            "review_text": "Bought this game because i had a coupon. Wasn't expecting too much. This game is however quite entertaining and requires concentration. I found it to be a good release. However the keyboard controls are quite twitchy, so I'd recommend using a controller. Also one of the pros of this game is that there are achievements and they are quite easy to earn. Easy game to get a perfected game (achievements) into your profile. However, some of the translations for the language part are kinda wrong. ",
            "review_score": "1"
        }
    ]
}