{
    "app_id": 467360,
    "name": "Off-Peak",
    "release_date": "2016-10-21",
    "developer": [
        "Cosmo D"
    ],
    "publisher": [
        "Cosmo D Studios"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Partial Controller Support"
    ],
    "genres": [
        "Adventure",
        "Free to Play",
        "Indie"
    ],
    "tags": [
        "Free to Play",
        "Indie",
        "Adventure"
    ],
    "achievements": 6,
    "positive_ratings": 811,
    "negative_ratings": 138,
    "price": 0.0,
    "description": "You're stranded at a cathedral-like train station in the near future, searching for a ticket out of town. Explore the secret passageways, interact with strangers, dig for records, and get hypnotized by the soundtrack – a batch of original music courtesy of the band, Archie Pelago.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/467360/header.jpg?t=1481037801",
    "minimum_requirements": "OS: 7 Memory: 4 GB RAM Graphics: Video card with 512MB or greater VRAM DirectX: Version 11 Storage: 750 MB available space Sound Card: Oh Yes",
    "recommended_requirements": "OS: 10 Memory: 8 GB RAM Graphics: Video card with 1gb or greater VRAM Storage: 750 MB available space Sound Card: Oh Yes",
    "reviews": [
        {
            "review_text": "Long story short,  Off-Peak  is essentially a Unity acid trip.  Play as a faceless protagonist and piece together a torn up ticket in an attempt to leave the train station. During this you can become a thief or not steal at all. Pandak Pannay (Marcus) acts as if he's some emperor of a train station, so.....I....don't really know what to say there.... But he enslaves giants apparently....I think.  The experience is short as well as it should take you less than an hour from start to finish to beat the game. The assets look good, the gameplay is decent, and it's a free game you can 100%. The avant-garde charm seems to appeal for the weird artsy types and will come off as creepy for everyone else. In the end, all I could do was furrow my brow and utter the word 'What...?', which accurately summarizes this game.   5/10  ....What...? ",
            "review_score": "1"
        },
        {
            "review_text": "Interesting game, play while high.",
            "review_score": "1"
        },
        {
            "review_text": "It tells a nice complete story without shoving it to your face. Atmosphere, music and artworks are great and consistent. Some interesting encounters too. There is not much interaction with the world, but even that is coherent and wrapped up nicely. Actually it felt like quite a memorable comic book.",
            "review_score": "1"
        },
        {
            "review_text": "This little gem is the most delightful game I've played in a long while. It was spectacular. The cathedral like subway station with all it's weird mysteries and surprises brought on a surreal, almost magical quality that made the exploration extremely immersive. It'll require multiple playthroughs to make head or tail of all the events that transpired and their meaning but that fact that I really want to play it again means the game is a good one.   2 special mentions. The artwork and the music. Both were engaging and amazing, especially the music, I'm a fan!",
            "review_score": "1"
        },
        {
            "review_text": "Love the artwork and music. Simple yet immersive story. Good job devs.",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "If you like visiting art galleries, psychedelics and David Lynch movies, then this game is for you.  The soundtrack was better than the music in most modern, triple A games.",
            "review_score": "1"
        },
        {
            "review_text": "It's quick, simple, and very enjoyable. I would definitely recommend giving it a playthrough or two especially since it's free",
            "review_score": "1"
        },
        {
            "review_text": "for some reason I thought this was a horror game it's not,it A great free game it is extremly short, free and extremly weird and random. Using the camera with a controller may require some adjustments to the camera sensitivity",
            "review_score": "1"
        },
        {
            "review_text": "I spent a lot of this game hoping for it to end while I was playing it, but when I reflect on it after finishing, I think that was only because it succeeded in an uncomfortable and very bizzare narrative that it was trying to portray. The soundtrack is very neat, the art that's put up on a lot of the virtual walls is rather thought-provoking, and while the ending is very ambiguous, it leaves a lot to think about. Plus, it was pretty fun eating every cookie and pizza in the game.",
            "review_score": "1"
        },
        {
            "review_text": "Its a intresting game to say the least was fun to play wish it was better optimized",
            "review_score": "1"
        },
        {
            "review_text": "a rollercoaster of emotion.",
            "review_score": "1"
        },
        {
            "review_text": "Really enjoyable, trippy experience.   Takes less than an hour to complete, would love to see a longer game made by these guys.   Music is excellent too. Recommended!",
            "review_score": "1"
        },
        {
            "review_text": "Best game to play while on drugs/10",
            "review_score": "1"
        },
        {
            "review_text": "Hell yeah, played it while high.",
            "review_score": "1"
        },
        {
            "review_text": "Really trippy, great game.",
            "review_score": "1"
        },
        {
            "review_text": "This game CHUGS. Even on the fastest settings, this game (which has graphics on par with grim fandango) gives a whopping 5fps. My computer can run dragonball xenover at 60fps, and that game doesn't even let you lower the settings. I run skyrim at 60fps with over 100 mods, including a number that increase the resources used on graphics. This game should run as smoothly as mcpixel, yet for some unknown* reason, this ps1 quality game lags more than a triple a game from a year or two ago.  *Not entirely unknown. It's made in unity. I don't think there has ever been a game made in unity that runs well.",
            "review_score": "-1"
        },
        {
            "review_text": "Unfortunately this is a short game, glad it was free.. I played it for 10 minutes. And then the game was over...To bad... I don't think its worthy to play this...",
            "review_score": "-1"
        },
        {
            "review_text": "I don´t know why, but the game doesn´t detect my '+' key, which is necesary in order to improve mouse sensitivity :/ Furthermore, the game lags horribly and goes slow.",
            "review_score": "-1"
        },
        {
            "review_text": "I decided to give it a try when i saw the game was free and the reviews were good. First of all, the game is too short and there is no story at all. You are just collecting parts of the train tickets for no reason at all. Though game has a good atmosphere, very mystique. I played it a couple of times thinking maybe i was missing something. They say graphics are good, nope! They are maybe ok, textures and animations are bad. And the dialogues in the game are meaningless, and random. However that being said, i really liked the soundtrack! Especially the one that play immediately after you took the stairs down to the train station lobby. Overall, what i can say is that, Off-Peak is an overrated free game, with a good soundtrack. Don't waste your time on this game, there is not story at all. But if you gonna play it only takes like 15mins or so...",
            "review_score": "-1"
        },
        {
            "review_text": "That's it?",
            "review_score": "-1"
        },
        {
            "review_text": "Not my cup of tea, for sure. This game is like a hipster's wet dream. It's full of obscure musical references, gourmet pizza talk, the appreciation (and lack thereof) of vinyl records, the preparing of ramen noodles as an artform and the style of music I used to hear at an artsy bar that my trumpet-playing, fedora-wearing friend used to drag me to full of awkward girls with dyed green hair who spent the entirety of their stay on their laptops and drinking coffee. Oh, and there's a guy who runs the train station like a warlord of some sort with a pet cow that he strokes while sitting on a throne overlooking the train station. It's all a bit much. At least it was free and some people might like the music but not my style at all. Can't recommend, I'm afraid.",
            "review_score": "-1"
        },
        {
            "review_text": "How to play this game   1. never download in the first place done  If you didn't do one then  2. uninstall  3. never speak of it again  4. 3 can be broken if you here you friend say they're going to download it and tell them NO!",
            "review_score": "-1"
        },
        {
            "review_text": "I played this game for a little bit, but then... They used the F word... I am disappointed... Oh well...",
            "review_score": "-1"
        },
        {
            "review_text": "Very interesting little game, I look forward for more projects form the makers.",
            "review_score": "1"
        },
        {
            "review_text": "Okay, this is gonna be really long... So, let's start at the very beginning  If you don't want spoilers, 'cause I recommend this, don't read on. This might get a bit spoil like.    I get into the game, and turn around, to see this creepy, disproportionate guy sitting on a bench. He says something, and the game decides to throw a 'click to continue speech' text in my face. I click through all of it, giving it careful reading, and begin to think, 'alright, this is a kind of annoyingly long dialogue.' After taking forever to get through it, not much of a fault really, just my patience.. Anyway, I keep walking, the game tells me that sometimes I have to listen in on conversations... And I come to people that seem to be starting a revolution. Alright, now let's STOP. Now, for what I'm about to say, I understand that this game is a sort of experience. It's not a really meaningful story game, and you just click and look at stuff. But never in the game, except for a certain one part of the game that I won't say... I don't wanna spoil this too hard, but no one ever references what happened backward in the experience. Alright, that's my little piece. So, after I listen in on this, I walk into the big building, find a piece of the ticket.. Alright, let's get less spoily, and just talk about the game here. This game managed to break my mind and make me feel like I'm in some sort of utopia. Throughout the game, I was completely thinking 'what...' Which is good. It was fun. I was expecting a bit more out of it, like half an ant more, but, the ending left me satisfied. Now, also, throughout the game. I was hoping for this game to become a big thing and for there to be a satisfactory theory about it... Doesn't matter, anyways. So, I should probably say that at the end of this, I closed out the game, and I gave myself a minute... To think 'whoaaaaahhhhhh....' I took a really long exhale. I haven't even processed this yet. This game isn't perfect, even though, to me, it feels near perfect. Although, I do kinda wanna stress the long dialogue problem I mentioned before... It's a bit annoying, and at least once, I found myself walking away from a guy because it was too long. Anyway... Yeah. Great game... 9/10. As far as recommending this to someone.. I'd recommend you do this when you have like thirty minutes of time, or if you have more. And I recommend you do this at a time where you're prepared to pay close attention. If you've got more time, which I guess I don't, then explore more than I did. Again, 9/10",
            "review_score": "1"
        },
        {
            "review_text": "A very strange and interesting game with wonderful music and an intriguing world to explore. A great short game. If you haven't, definitely give it a try.",
            "review_score": "1"
        },
        {
            "review_text": "this game is different from the others and this is what makes it unique in a good way of course .... you can finish it in 20 min but this doesnt really matter as long as the games is free ... the overall experience was quite good ..... if you are bored and have nothing else to play on your steam count then i advise you to take a look at it .....:) ",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would rob people of pizza again :D 420/10 would eat pot cookies again :D",
            "review_score": "1"
        },
        {
            "review_text": "Loved this. The music, the art, and the vibe have value well beyond the $0 price tag conveys; a highly recommended experience.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing! Such a chilled out, but a bit edgy in a good way experience. Fantastic music. Highly Recommended. Roll a fat one and enjoy : )",
            "review_score": "1"
        },
        {
            "review_text": "Trippy, short, great music, surprisingly engaging",
            "review_score": "1"
        },
        {
            "review_text": "I think this game was a great game for people who like a like a short but GREAT game and unusual but fun....... any ways I would recomend it for any one with an hour or an half. I liked it and I hope you do if you get it. :)",
            "review_score": "1"
        },
        {
            "review_text": "really intertesting. the sound design is amazing!",
            "review_score": "1"
        },
        {
            "review_text": "This is very good game 11/10 would play again.        KeK",
            "review_score": "1"
        },
        {
            "review_text": "This is a really nice and well developed game! I love the music and awesome story (I ate and stole pizza and a lot of stuff so now I'm off to the Circus XD) Thank you for making this game!",
            "review_score": "1"
        },
        {
            "review_text": "Short, but strange",
            "review_score": "1"
        },
        {
            "review_text": "ok i got to say that was the weirdess 30 min of my life i thinik.....  this game is short but it feel u just enter another dimension or something or maybe took too much LSD lol all in all this game is short,free,easy and trippy   its worth going true the adventure  props to the maker of this game :) it shows that to be a good game it doesnt have to last 200hrs still i love my 200hrs + game but you get my point   i recommend it to anyone am i back in the real world now ????",
            "review_score": "1"
        },
        {
            "review_text": "The game is trippy, the music is fun, and the story makes little to no sense whatsoever.  10/10 would trip balls again.",
            "review_score": "1"
        },
        {
            "review_text": "Well its ok to have fun for an hour but thats it... like the creators said, its just an exploration game... i just finished and now unninstalling it... not much to do really.",
            "review_score": "1"
        },
        {
            "review_text": "30 minutes of pure awesomeness. A great soundtrack, epic enviroment, and all around general weirdness. Best of all... IT IS FREE. Worth your time in more ways than one.",
            "review_score": "1"
        },
        {
            "review_text": "  Off-Peak",
            "review_score": "1"
        },
        {
            "review_text": "This game is like a bizarre dream you would have after spending a day in a postmodernist art gallery. Definitely recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Literally one of the best free games I've ever seen.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome little game. You can really tell the creator took his time with everything here.   I beat it once and will defeintely play through again.",
            "review_score": "1"
        },
        {
            "review_text": "I feel like i've just done all the hard drugs at once 10/3",
            "review_score": "1"
        },
        {
            "review_text": "Very intriguing art piece. Pretty short, but entirely unique. Has a surreal art style, with objects out of proportion and a decidedly philosophical tone. Ten/ten would eat pizza again",
            "review_score": "1"
        },
        {
            "review_text": "Leaves you with more questions than answers. Very weird but somewhat interesting. Ending makes no sense. Pretty damn buggy but at least the music is somewhat enjoyable. I'd say give it a go considering it's free.",
            "review_score": "1"
        }
    ]
}