{
    "app_id": 467850,
    "name": "METAGAL",
    "release_date": "2016-05-22",
    "developer": [
        "RetroRevolution"
    ],
    "publisher": [
        "RetroRevolution"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Pixel Graphics"
    ],
    "achievements": 22,
    "positive_ratings": 79,
    "negative_ratings": 35,
    "price": 2.79,
    "description": "Help the young cyborg-girl Meta , in her battle against the evil &quot;General Creeper&quot; who kidnap her creator and her sisters! Collect new powers in order to face the advanced levels, in this fun and furious ,...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/467850/header.jpg?t=1552405812",
    "minimum_requirements": "OS: min Windows XP Processor: any processor with more than 1ghz (even less) Memory: 1 GB RAM Graphics: any card DirectX: Version 10 Storage: 19 MB available space Sound Card: any card",
    "recommended_requirements": "Sound Card: any card",
    "reviews": [
        {
            "review_text": "You already know what you're in for when looking at this, right? Like Legend of Dark Witch (another highly recommended Mega Man-like Run n' Gun for super cheap) this is a basically a gender swapped Mega Man. It's a retro-style run n' gun platformer pitting your mechanized heroine against a bunch of Android 'Gals' vs. Mega Man's various dude Robot Masters (excluding MM9's Splash Woman). Unlike Dark Witch, which adds in it's own ideas (like a Gradius style upgrade bar) this one sticks to the MM formula pretty much exclusively. But it does pretty well!   Visually it looks fantastic; the pixel art here and the color palette used is as good as, or better than, genuine SNES/Genesis/Amiga quality. The chibi character art really evoke cute, Japanese sidescrollers from the era. The quality of the chiptunes is great too. Controls are absolutely on point. They're super responsive and tight; it feels great with a 360 controller. The levels are very well designed, with areas being themed around various classic MM stage hazards like timed drop platforms, flame throwers and conveyor belt sections. Once you defeat the four main Gals and move onto the levels beyond, they even start making great use of your powers! See a wall you seemingly can't get passed? Fire the black hole-thing at an enemy on the other side to switch places and warp over there! See a gap that's too large for a dash jump? Jump anyway, then use Magma Gal's Flame Dash to cross to the other side! A ladder you can't reach? Shoot out your Mines, then jump on them to use the explosion to give you a boost! It gets REALLY GOOD once you have all these powers; the levels know that, and are designed thusly.   Meanwhile, enemies are positioned in ways and combinations that almost resemble an 'action puzzle'; they'll shoot bouncing projectiles to get you to move to certain safe spots or you'll be able to perfectly take them out one-at-a-time from certain vantage points. It's just like the good old days! Speaking of, the difficulty is tuned to be 'NES Hard'; really difficult, but never impossible and rewarding when conquered (and able to be more speedily conquered after you get it down). Sit there and watch patterns, try different weapon &amp; ability combinations, or die and learn from failures when you try again: you WILL make progress... most of the time.   There are *some* issues that affect the difficulty. The timing windows on some of this stuff is absolutely brutal (particularly the fullscreen flame throwers in the second half of Magma Gal's stage and the explosive, timed platforms on Buster Gal's stage), enemies respawn THE SECOND you leave their 'screen' (there's definitely places you can stand still that will cause them to continuously fly in from the edge of the screen, one after the other. Kind of good for grinding, but awful for combat where you have to maneuver in the air while jumping).  EDIT: The developer is doing a good job currently of patching and otherwise updating this game constantly. Issues I had a week ago (I previously mentioned no way to change the controller config here) are no longer here! Meanwhile, the balance on things seem to be constantly tweaked for the better. I definitely have to give a shout-out to the devs for continually polishing this up!   In the end, I just have a tiny issue with everything. Namely, the music compositions are a little repetitive (they all seem to be variants of the same song to me). But this game is $4 so I know its petty to bring up. What's here sounds good, but it bares mentioning anyway.   That's it. Every other little issue I had is now gone :D  -- Overall, it's definitely recommended if you're looking for a cheap Mega Man style run-n'-gun retro action game. This is an extremely well-crafted little game and definitely provides the fun and challenge you're looking for. This title could absolutely go for $10 and it would put some other games in that price range to shame. RetroRevolution has a quality game here for the price of a sandwich at Burger King. I hope this isn't the last we see of Meta Gal :)",
            "review_score": "1"
        },
        {
            "review_text": "A good mega man fan game, but theirs one problem. The controls for keyboard play is horrible! Best play this game with a controller. I haven't beaten this game yet but until I get a controller, I can't beat this game.",
            "review_score": "1"
        },
        {
            "review_text": "Quite Hard, But I like it. Boss theme could be better though.",
            "review_score": "1"
        },
        {
            "review_text": "This game brings back memories of playing Megaman in my youth. I was using the keyboard at first however I quickly switched to an XBOX One controller and would certainly recommend some sort of gamepad. Beyond that, I've had fun with it. Several of the levels are quite challenging!",
            "review_score": "1"
        },
        {
            "review_text": "I\\'m only a casual fan of the Megaman series, so I thought I\\'d give this game a try. The handles aren\\'t superb, so I hope they plan on fixing that. Also, as an English teacher, please fix the dialogue text. It pains me to read it.  Despite all that, I\\'d still recommend it if it\\'s on sale.",
            "review_score": "-1"
        },
        {
            "review_text": "I'm no stranger to 'Megaman-like' games, as I pratically cut my teeth on a copy of Megaman 2. This being said, I want to like this. I see a lot of potential in METAGAL, but the controls do need some more polishing. The overall feel of the game is like an NES emulator running at a higher speed than usual, making simple things like dash-jumps and even attacking while jumping a chore. The visual style is retro, which is part of the charm of these types of games. The music... I can't say I played long enough to fully comment on; the controls and/or 'speed' of the game made me want to quit playing.  As the game is now, I can't say I'd recommend it, but as a work-in-progress, I'll be looking forward to seeing what new updates bring. I'm hesitant to give this a simple thumbs-up/down rating, seeing as how I want to see this game bloom into something amazing, but I'll change it when/if it becomes better. ",
            "review_score": "-1"
        }
    ]
}