{
    "app_id": 468050,
    "name": "The Last Time",
    "release_date": "2016-09-09",
    "developer": [
        "Big Cow Studios"
    ],
    "publisher": [
        "Big Cow Studios"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Captions available"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Point & Click"
    ],
    "achievements": 0,
    "positive_ratings": 110,
    "negative_ratings": 3,
    "price": 2.79,
    "description": "The Last Time features the narrative depth and emotional impact of a modern adventure title, delivered with the graphical style and game mechanics of a classic point-and-click. Play as Jack Glover, a frail old man who must come out of retirement to face his demons.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/468050/header.jpg?t=1474798244",
    "minimum_requirements": "OS: 7+ Processor: 1.7 GHz Dual Core Memory: 2 GB RAM Graphics: NVIDIA GeForce GTX 260, ATI Radeon 4870 HD, or equivalent card with at least 512 MB VRAM Storage: 600 MB available space Sound Card: DirectX Compatible Sound Card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Musics pretty good and i've only had one playthrough. I'm really looking foward too the next few though, it took about an hour and a half. Story has a lot of interesting moments i really liked and i laughed a good amount of times. Very cheap which definitly makes it worth the price and im happy to be one of the first to purchase this game.",
            "review_score": "1"
        },
        {
            "review_text": "Great game with a great story!",
            "review_score": "1"
        },
        {
            "review_text": "A charming, tightly written mystery. It's short but doesn't feel lacking, especially for the price. Solid pacing; the brevity suits the material. Obstacles/puzzles are very easy and never frustrating.",
            "review_score": "1"
        },
        {
            "review_text": "Hooked from start to finish! Awesome pixel art and soundtrack with a great branching story line, definitely going to give it another playthrough to see how the other choices pan out...  Looking forward to seeing from Daniel and Big Cow Stuidos!",
            "review_score": "1"
        }
    ]
}