{
    "app_id": 46830,
    "name": "Ironclads: Anglo Russian War 1866",
    "release_date": "2011-06-21",
    "developer": [
        "Totem games"
    ],
    "publisher": [
        "Strategy First"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Naval"
    ],
    "achievements": 0,
    "positive_ratings": 9,
    "negative_ratings": 17,
    "price": 34.95,
    "description": "Russia sought to seize control of Constantinople. The city controlled the Black Sea straits, an important economic and strategic point of the Black and Mediterranean Sea. This area was the cause of constant conflict with Britain, which was concerned about her Mediterranean interests.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/46830/header.jpg?t=1447353827",
    "minimum_requirements": "OS: Windows XP SP2 / VistaProcessor: Pentium 4 / Athlon 1.1 GHz or betterMemory: 512 MB RAMGraphics: 128 MB GeForce 6600 / RADEON 9600 or betterDirectX&reg;: DirectX 9.0C Hard Drive: Sound: DirectX Compatible/16-bit Sound PCI",
    "recommended_requirements": "OS: Windows XP SP2 / VistaProcessor: Pentium 4 / Athlon 2.4 GHz or betterMemory: 1024 MB RAMGraphics: 256 MB GeForce 7600 / RADEON x1600 or betterDirectX&reg;: DirectX 9.0C Hard Drive: Sound: DirectX Compatible/16-bit Sound PCI",
    "reviews": [
        {
            "review_text": "This game seems like an awesome idea... and given a bit more development, it would be.  As it is, it feels utterly generic and horribly limited.  There were literally dozens of classes of warship in service within the British Royal Navy in the year 1866. It was a unique time, filled with unique vessels and amazing variety. The ships here are few in number and similar in characteristics. A little more inclusion would have given so much more flavor! The Russians... well, their navy was a bit more limited, but they also had some interesting vessels. The game engine is very simplistic with few options for action. The time complession is completely inadequate for the vessels and their speed of advance. The AI is almost intelligent as Vice-Admiral Sir George Tryon and has an annoying tendency to ram any moving object nearby... particularly when they are flying the same colors. At least the gunnery is historically accurate; gunners cannot hit the broadside of the enemy ship unless they are &lt; 100 yards away.  All in all, it was worth less than the $3 or so I paid for it.",
            "review_score": "-1"
        },
        {
            "review_text": "Got it for free in an indy pack. Huge POS.",
            "review_score": "-1"
        }
    ]
}