{
    "app_id": 468700,
    "name": "NVIDIA® VR Funhouse",
    "release_date": "2016-07-14",
    "developer": [
        "Lightspeed Studios™"
    ],
    "publisher": [
        "Lightspeed Studios™"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Casual",
        "Free to Play"
    ],
    "tags": [
        "Free to Play",
        "Casual",
        "VR"
    ],
    "achievements": 45,
    "positive_ratings": 441,
    "negative_ratings": 107,
    "price": 0.0,
    "description": "Step right up to VR Funhouse and enter a virtual carnival full of fun and games. Be an archer with flaming arrows. Test your skill shooting skeet targets blasted from a cannon. See how many moles you can punch, whack, and much more.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/468700/header.jpg?t=1472746664",
    "minimum_requirements": "OS: Windows 7 Processor: Intel® Core™ i7 4790 or greater Memory: 8 GB RAM Graphics: GeForce® GTX 1060 6GB DirectX: Version 11 Storage: 5 GB available space",
    "recommended_requirements": "OS: Windows 10 TH2 Processor: Intel® Core™ i7 5930 or greater Memory: 8 GB RAM Graphics: GeForce® GTX 1080 DirectX: Version 12 Storage: 5 GB available space Additional Notes: For maximum performance, it's recommended to have 2 GPUs with one in dedicated PhysX mode.",
    "reviews": [
        {
            "review_text": "Best graphics I've seen so far in VR. Runs well on my 970.",
            "review_score": "1"
        },
        {
            "review_text": "This is worth checking out, but each game is in a set order so to get to the cool ones you have to get past the 'yeah yeah, PhysX! Yay!' ones. I didn't like the feel of their archery game. I didn't care that much for the 'fill the clown's mouth so the balloon pops' game... I'd even say their whack a mole is kinda lame (mostly because it kept telling me 'NO HOVERING'... ♥♥♥♥ you game... don't tell me how to have fun!)  The only game I really really enjoyed was the cannon/skeet shooting game...Most everything else is just a demo for nVidia PhysX in VR and not a fun game in disguise...  Also disappointing was the fact that I couldn't run it in highest mode... it said I needed SLI to do that  Anyway, it's a fun little demo but don't expect to spend a lot of time in here. Just show it to your friends so they'll ♥♥♥♥ their pants and want to buy a vive too.... ",
            "review_score": "1"
        },
        {
            "review_text": "This is awesome! Runs perfectly fine on low settings on my GTX 970. If you have a Vive, give this a shot, it's a lot of fun.",
            "review_score": "1"
        },
        {
            "review_text": "This is just like The Lab where its a dedicated Wii Sports type of game to show the capablities of the tech, which in this case is VR lol.   All the minigames are very fun and can be completed in a minute or two. This does show what VR can do from a graphical standpoint and hopefully it will be more accessible for people to afford VR to with how demanding these titles are.   The game is very well optimized honestly from running on 2x 980 Ti in SLI playing on max settings and there was only one point I noticed that I was dropping frames was during the flaming arrows. But throughout everything else the game was well optimized that I didn't feel wierd at all.   Conclusion: So far this is the best VR tech demo to show what can be achieved with VR and ends up being a series of very fun mini-games. And plus... its free! What is there to argue with something thats free after you spent how much to play this game in the first place... -_-  Rating: 10/10",
            "review_score": "1"
        },
        {
            "review_text": "If compared to other tech demos this one looks very weak.",
            "review_score": "1"
        },
        {
            "review_text": "grateuse of phisics",
            "review_score": "1"
        },
        {
            "review_text": "Claims to need a GTX 10 series card but works fine on medium settings for me with a 980TI OC with I7 6700K  My GPU monitor shows around 70% usage on medium settings, Graphics are excellent and the game is fun..... for around 10 mins!   Worth a download simply because its free",
            "review_score": "1"
        },
        {
            "review_text": "A tech demo showcasing Nividia's new VRWORKS tech along with some Gameworks features, that allows you to play a couple of games, and it's pretty fun heck it's even free so it's defiently worth a download, specially if you have two gpus and want to see how VR SLI works. I don't really get the hate from AMD users and people who find this boring, it's free so it doesn't hurt at all. You're not wasting any money here so what's your point? Although i did get some problems like blurryness even when using the supersampling method, this might be due to the new techology such as multi res shading causing it so that's the only minus. Otherwise higly recommended if you've got a Nividia GPU in the 10 series.  2x GTX 1080s i7-4790K",
            "review_score": "1"
        },
        {
            "review_text": "Short but entertaining. Great graphics!",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this because it's free, but Pierhead Arcade is better.",
            "review_score": "1"
        },
        {
            "review_text": "The graphics look incredible and it handles flawlessly. Excellent game and I'm excited that they just added the workshop. Can't wait to see what people come up with!",
            "review_score": "1"
        },
        {
            "review_text": "This is how you render good VR.",
            "review_score": "1"
        },
        {
            "review_text": "The recommended specs say to have '2 GPU's'. There shouldn't be an apostrophe there, because it is a plural.  Edit: They changed it, it now says 2 GPUs  Oh, right. About the game. There's an invisible NVIDIA logo in one of the levels. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Short but fun; as intended, it shows of many of NVIDIA's unique applications",
            "review_score": "1"
        },
        {
            "review_text": "When your Traget Render Multiplyer hits 2.5, you are going to see some serious ♥♥♥♥!",
            "review_score": "1"
        },
        {
            "review_text": "Its a great way to demo virtual reality, with enjoyable games and great physics, the only real issue i had was that the game looked really blurry compared to everything else that I have tried in vr.",
            "review_score": "1"
        },
        {
            "review_text": "Some of the best feeling guns in VR. Maybe the best swords too. Not sure why it's blurry on my 1080.",
            "review_score": "1"
        },
        {
            "review_text": "This was amazingly well polished! Just a series of minigames showing of NVIDIA features of their latest graphics card but it's all so well executed that I couldn't care less about the limited content. This will be my new 'Hey you wanna try VR?' game!",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun tech demo, and I played on my Rift, so I didn't have the Vive controllers to really get into it with. On Rift you can't interact much (although painting and shooting work with a controller, sort of), but it still works great if you're just enjoying the visuals. Solid experience on my machine.  FX-8350/980 Ti",
            "review_score": "1"
        },
        {
            "review_text": "It's all that I could have wished for from a free game for the HTC Vive!   ",
            "review_score": "1"
        },
        {
            "review_text": "I've got a GTX 980, i7 4790k (which are below the minimum specs). I downloaded anyway because it was free - really pleased I did because it works perfectly - even on the medium settings (it even works ok on the highest settings). A great little taster as to what is possible with VR - although for some reason Nvidia have exaggerated the minimum specs required to run the thing.",
            "review_score": "1"
        },
        {
            "review_text": "This is a perfect game to introduce someone to VR. Normally I will run through the tutorial and fire up this game. The short mini games showcase the versitality of VR while not taking too much time!",
            "review_score": "1"
        },
        {
            "review_text": "tried playing 3 times and never reached the end because of the game just crashing somewhere in the middle and im running it on a gtx1080  the hardest part about this whole game is actually the physics that behave like they shouldnt behave... it feels all very clunky and not consistent, like trowing a baseball and i dont even reach the first object, then i try to trow a hammer with about the same trajectory and i end up trowing it all the way over the attraction... the physics in the lab for instance are 10 times better then this, and it doesnt change the fact that the mini games displayed in here are done better in other games so far, i expected alot more from nvidia tbh the only positive thing i can say about this is that its free...",
            "review_score": "-1"
        },
        {
            "review_text": "It's free but still not worth the time it took to download this game. Just horrible and runs terribly on my gtx 980 ti.  DO NOT waste time downloading this if you have any other gpu than a Nvidia it will simply tell you, you do not have the correct gpu and refuse to run.",
            "review_score": "-1"
        },
        {
            "review_text": "Shennanigans!  I'm 99% sure they throttled the performance of the game to make it look like you need a next-gen graphics card to make it run properly. It's no coincidence that they describe the graphics level settings with names of their own *new* video cards. Rendering smaller spaces does not take that much computing power, so the idea that it needs TWO graphics cards (which can each run Doom at 200fps) is BS.  This 'game' is a short, shameless plug for their new hardware. It is free, but I still don't recommend it. Get The Lab instead. It's longer, more fun, and there's no idiotic advertising built in.",
            "review_score": "-1"
        },
        {
            "review_text": "The first GPU exclusive VR experience. Nvidia have lowered the bar again, instead of letting AMD users try and run it badly they have locked them out completely.",
            "review_score": "-1"
        },
        {
            "review_text": "Looks good but only for NVIDIA unless you feel like working on your PC to trick it.",
            "review_score": "-1"
        },
        {
            "review_text": "A nice Demo but lack any fun. A ten minute play and your done. Why would you return. Not like the lab where you can spend hours. Uninstalled after 1 play.",
            "review_score": "-1"
        },
        {
            "review_text": "It's free, and that's pretty awesome. It's a fun way to show off the system. However, it's rather disheartening to be an early adapter of VR ready NVidea hardwarre, and have game tell me that my 360$ I spent 4 months ago is now lower than the lowest end of the settings. Walked away from this not appreciating my previous NVidea purchace.",
            "review_score": "-1"
        },
        {
            "review_text": "Looks good! Sounds good, just can't play, my hands are stuck in the floor. If your running the razer hydras on oculus platform you may have this issue. I Can play every other Vive game using Razer Hydras without fault. Not this one! Bugger, was looking forward to cranking the 1080 up!",
            "review_score": "-1"
        },
        {
            "review_text": "Wow! i play for 3 mins and get riddled with FPS issues. I wouldnt bother unless u lie spending 1 hour trying to pairing you vive controllers each time it crashes.",
            "review_score": "-1"
        }
    ]
}