{
    "app_id": 469890,
    "name": "Space Codex",
    "release_date": "2016-05-17",
    "developer": [
        "takk"
    ],
    "publisher": [
        "takk"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Casual"
    ],
    "tags": [
        "Casual",
        "Retro",
        "Shoot 'Em Up"
    ],
    "achievements": 7,
    "positive_ratings": 188,
    "negative_ratings": 46,
    "price": 0.79,
    "description": "Space Codex is a casual retro arcade minimal awesome top-down shooter featuring waves of enemy spaceships with different attacks in what is, literally, a bullet hell. To beat them, you will have power-up options available through the map. The game only gets harder. How long can you stay alive?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/469890/header.jpg?t=1466711208",
    "minimum_requirements": "OS: XP, Vista, Windows 7, Windows 10 Processor: 1.2 Ghz Memory: 1 GB RAM Graphics: 256MB Storage: 100 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "   Introduction",
            "review_score": "1"
        },
        {
            "review_text": "Every now and then I like to page through Steam and see if I can find any weird, cheap games. I usually find nothing, but today I found Space Codex! It's normally $.99, but I got it on sale for $.59. Even even if a game doesn't look that great, who could pass it up at that price? Not I. And it even had good reviews! Wowza! (There were only six reviews, but everyone seemed to like it)  Space Codex is a straight forward, top-down twin-stick style arcade shooter. Bad guys fly towards you and you shoot them, that's just about the whole game. There is a handful of power-ups and a few different enemy types. There are also three different ship types to choose from, each with different stats.  The basic gameplay is simple but pretty solid, and the music is surprisingly good. There is a pretty good variety of tracks, too. With a game this small, they could have easily gotten away with a single repeating track, so the variety is appreciated.  Now, here's a few of the gripes I have with the game:  (A couple hours after posting my review on Steam, the dev commented on it and told me he'd fixed a lot of the issues. I'm very impressed!)  -Once you choose your ship, you can't go back. You have to reset the game (Apparently, you just have to hit escape, then click 'Select Ship'. This wasn't even an issue that actually needed fixed. I just didn't think to hit escape because I'm a dummy.)  -Power-ups are hard to see against the stars in the background. The shield especially, since it's just a light-blue circle. (The dev added a nice glow effect to all the power-ups. Not only are they easier to see now, but they look cool, too!)  -No controller support.  (Controller support is being worked on.) (If you have a Steam Controller, I've uploaded a control scheme for the game, feel free to use that.)  -No Leaderboard. (Leaderboards are also being worked on.)  -There is a small window after dying where hitting the boost key restarts the game. (You can totally ignore that complaint now. Totally fixed!)  Like I said, the dev very quickly fixed most of the issues I had with their game. I can definitely recommend it now. It's good fun, especially for the price it's being sold at.",
            "review_score": "1"
        },
        {
            "review_text": "A space shooter survival game that extremely challenging and difficulty. Totally worth it!",
            "review_score": "1"
        },
        {
            "review_text": "4/5  It's a basic top down twin stick shooter. Overall, it is very simple yet also well made and fun to play.   There are 3 seperate ships to choose from each with different stats.   Enemies will shoot at you but you can destroy their bullets by shooting them. New enemy types are introduced as you survive longer. You can take multiple hits before you die.   Powerups randomly spawn on the map that can give you temporary weapons, temporary sheids, or provide you with an extra heart.   There is also a dark mode that makes the screen black except for a small area around your ship which greatly increases the difficulty.   The music is arcadey and works well with the game.  Doesn't change up the formula at all but it is fun to play and I would recommend it to anyone who enjoys twin stick shooter, especially at the low asking price.",
            "review_score": "1"
        },
        {
            "review_text": "  i like the it it's fast and small just like my sex life",
            "review_score": "1"
        },
        {
            "review_text": "I got this for 33 cents (with a steam coupon) , and I'd say it was worth it. In fact, if you buy it on sale you'd porbably be able to make a profit on the trading cards, if you were willing to put the time in. It's simple, and the closest game I could really relate that to its Bit Blaster XL on steam, where you control a ship and you shoot things on the screen. It has a nice soundtrack, too.",
            "review_score": "1"
        }
    ]
}