{
    "app_id": 469990,
    "name": "NEKOPALIVE",
    "release_date": "2016-05-31",
    "developer": [
        "NEKO WORKs"
    ],
    "publisher": [
        "Sekai Project"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 16,
    "categories": [
        "Single-player",
        "Partial Controller Support"
    ],
    "genres": [
        "Casual",
        "Free to Play"
    ],
    "tags": [
        "Anime",
        "Free to Play",
        "VR"
    ],
    "achievements": 0,
    "positive_ratings": 1118,
    "negative_ratings": 89,
    "price": 0.0,
    "description": "The catgirls of La Soleil takes to the stage and steps into the spotlight with their very own live concert. Dancing, singing, MIX'ing and purring, this is the NEKOPARA event that comes right home to you, and you got the best seat in the house!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/469990/header.jpg?t=1541634441",
    "minimum_requirements": "OS: Microsoft Windows Vista/7/8/8.1/10 64bit only Processor: Intel i5-4590 Memory: 8 GB RAM Graphics: NVIDIA GTX 970 / AMD R9 290 DirectX: Version 9.0c Storage: 1 GB available space Sound Card: Direct X Compatible Additional Notes: Oculus Rift and HTC Vive Compatible",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "For those of you craving those virtual catgirls but dont have the money for a vive or rift. 1. Buy google cardboard headset 2. I̶n̶s̶t̶a̶l̶l̶ BUY riftcat (14.99 USD)  3. enable usb tethering on your phone 4. use riftcat to play steamvr games 5. start nekopalive 6. ( ͡° ͜ʖ ͡°)",
            "review_score": "1"
        },
        {
            "review_text": "What a wonderful time to be alive.",
            "review_score": "1"
        },
        {
            "review_text": "This game is the only reason why im going to get VR",
            "review_score": "1"
        },
        {
            "review_text": "Bought a vr headset to experience the rich plot in this game.",
            "review_score": "1"
        },
        {
            "review_text": "Well, I wouldn't say no to free porn.",
            "review_score": "1"
        },
        {
            "review_text": "Well, it's free and I think it demonstrates what the future of live entertainment could be. I would rather go to a VR concert than suffer the indignity of standing in long lines, pay for expensive tickets, have a lousy view, be constrained to what I eat and drink, etc, etc, etc.",
            "review_score": "1"
        },
        {
            "review_text": "Don't have a VR headset? Google Cardboard + Android Phone + Riftcat = winning.  Now I can finally be in the same room as Coconut!",
            "review_score": "1"
        },
        {
            "review_text": "I write this review in the street.  10/10 will forget to lock their room",
            "review_score": "1"
        },
        {
            "review_text": "Better than Killing Floor Incursion",
            "review_score": "1"
        },
        {
            "review_text": "This game is about cat girls in 3D.  10/10 would play again.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a zombie survival game. Even better than L4d2. It is extremely emersive, and with the vr, it feels like you are right there in the action. Id recomend this game to anyone who enjoys zombie games or fps games.",
            "review_score": "1"
        },
        {
            "review_text": "Good VR Game which contains Coconut my favourite ^^  I Totaly Recomend this game with my 10+ Hours!",
            "review_score": "1"
        },
        {
            "review_text": "Can't wait for multiplayer.",
            "review_score": "1"
        },
        {
            "review_text": "This game has a specific target audience that directly caters to them, but not me... BUT if you aren't part of the fan-base (or lost a bet), then this 'experience' is free so your not obligated to enjoy this... but people are enjoying themselfs a bit too much... welp, I can't judge what they do behind doors",
            "review_score": "1"
        },
        {
            "review_text": "Your daily dose of kawaii, self-loathing, and right hand training 10/10 would love to arguin' with my friends 'bout my fetish",
            "review_score": "1"
        },
        {
            "review_text": "10 Dancing Nekos Girls out of 10.  Enough said.",
            "review_score": "1"
        },
        {
            "review_text": "This b the most lit game b. Deadass cuz this game is so woke",
            "review_score": "1"
        },
        {
            "review_text": "Game of the century, what a time to be alive!!!",
            "review_score": "1"
        },
        {
            "review_text": "i dont know what i was expecting honestly...",
            "review_score": "1"
        },
        {
            "review_text": "Now we need a VR for Miku. MAKE IT HAPPEN.",
            "review_score": "1"
        },
        {
            "review_text": "Hours of content",
            "review_score": "1"
        },
        {
            "review_text": "I loved this... is it a game, no not really but it is a very nice experience to enjoy.",
            "review_score": "1"
        },
        {
            "review_text": "It's a great time to be alive.",
            "review_score": "1"
        },
        {
            "review_text": "I wish they had all the other characters from the games.",
            "review_score": "1"
        },
        {
            "review_text": "I bought an Oculus Rift just so I could play this game and get closer to my dreams  11/10 for almost real catgirls",
            "review_score": "1"
        },
        {
            "review_text": "Adorable little manga idol show, I really enjoyed it, the few issues I have are a little flickering of the scene and the menu to launch the songs was on the monitor not the HMD, aside from that for a free demo I totally recommend it to manga/jpop fans!",
            "review_score": "1"
        },
        {
            "review_text": "Too much Azuki and Coconut, need to get some Chocolate and Vanilla.  Fair warning : This isn't a game, you just watch somthing dancing on your screen. It's amazing and exciting. Make sure to watch with the whole family including your great-great-great-grandparents.",
            "review_score": "1"
        },
        {
            "review_text": "I waited 5 minutes just to comment. 'boobs', 'Loli', and 5 minutes wasted. 10/10 teested positive of giving cancer.",
            "review_score": "1"
        },
        {
            "review_text": "is the best of vr netnot",
            "review_score": "1"
        },
        {
            "review_text": "I dont have VR to watch 2 of it",
            "review_score": "1"
        },
        {
            "review_text": "I have no idea what I'm doing.  10 / 10",
            "review_score": "1"
        },
        {
            "review_text": "Great way to relieve stress and Shock from Jumpscares, my pc crashed and i got the ♥♥♥♥ scared out of me from this Extremely loud Static sound blasting in my head set, i got scared ♥♥♥♥♥♥♥♥..  10/10 whould use for Relaxant again",
            "review_score": "1"
        },
        {
            "review_text": "I don't know what I expected.",
            "review_score": "1"
        },
        {
            "review_text": "There was an obstruction on the LZ.",
            "review_score": "1"
        },
        {
            "review_text": "What are the controls? I'm los...wait... what the actual ♥♥♥♥? This is just watching cat girls dancing while randomly moving the mouse to see from an other angle for... I don't know? I didn't play NEKOPARA yet but even If I would have it'll be the same for me.. But it's free so it's ok.     Please don't hate me if you love this 'game'  ",
            "review_score": "1"
        },
        {
            "review_text": "Nekopara Vol. 3 in 3D Confirmed",
            "review_score": "1"
        },
        {
            "review_text": "2D waifus in 3d.  How could i possibly say no?",
            "review_score": "1"
        },
        {
            "review_text": "I recorded this and set it as my desktop background. Now I get weird looks from my family.  10/10 totally worth it.",
            "review_score": "1"
        },
        {
            "review_text": "What am I doing with my life.",
            "review_score": "1"
        },
        {
            "review_text": "1 neko, 2 neko, 3 neko, 4 there's only 2 nekos dancing and I want more",
            "review_score": "1"
        },
        {
            "review_text": "I need an occulus Rift.   Neko Waifus upcoming!",
            "review_score": "1"
        },
        {
            "review_text": "Pointless, but adorable - see the two cute characters you know and love dance on a cute stage and watch them Loving this. PRO - dont need a VR headset cons - you will lose friends",
            "review_score": "1"
        },
        {
            "review_text": "Ok, It's kinda laggy, but it's nice as a free extra, but the psychological horror  tag......whut? ",
            "review_score": "1"
        },
        {
            "review_text": "My Vive is getting it's use.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Would becomed hyped for Vol.3 again... and watch the nekos.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic songs, Choreography is better than expected. Just replace Coconut with Vanilla and its a perfect 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "10/10-Ign  Would fap again",
            "review_score": "1"
        },
        {
            "review_text": "Well... this is a game were you watch cat girls dance... thats all. I mean sure you can look around and stuff but that really all you can do.  10/10 would watch cat girls dance again.  (Insert Lenny Here)",
            "review_score": "1"
        },
        {
            "review_text": "cool, but need more spec. just to see dance",
            "review_score": "1"
        },
        {
            "review_text": "I'm a simple man I see free to play I click, I see Kawaii nekos in maid outfits I...Well...thats another story ( ͡° ͜ʖ ͡°)",
            "review_score": "1"
        },
        {
            "review_text": "If you like watching cartoons sing and dance to the same song over and over again I guess its OK. Not my cup of tea though.",
            "review_score": "-1"
        },
        {
            "review_text": "I have no idea what the hell is goingon",
            "review_score": "-1"
        },
        {
            "review_text": "Really? 94% positive for this???   There is no game. Just two girls dancing.  Go to youtube and search for 'Babymetal'.  Or.  Go to any porn site that has anime. Way better than this 'game'. It has 3 buttons.  I can't read anything but 3 buttons are lit up. 2 will make the girls dance.   1 button will try to get you to let them take over your twitter account and post for you!??",
            "review_score": "-1"
        },
        {
            "review_text": "No matter how much you love catgirls and J-pop, it's impossible to enjoy this low res experience. Seriously, if you've got your VR headset on, be prepared for '240p Simulator VR'.  It's not obvious from the Kanji in the menu, but you can use the number keys to change camera angles, complete with a ridiculously long paw-wipe that almost convinced me to give this experience a thumbs-up. If you are a pedo, you'll probably want to stick to angle 2, while if you like large breasts you're better off with 3. The other angles put you so far away from the stage (we're talking entire yards) that all you'll see is an indistict blur, as if you were watching VHS anime bootlegs play on your neighbor's 20 inch CRT television through the window.  You have to physically bend over and get near to the floor in order to look up the girls' skirts, which is  demeaning . Also, none of the camera angles gets you close enough to even pretend like you could grope the performers - unless your playspace is an entire living room, the stage is probably going to be past the wall. Lastly, the large-breasted performer clearly has bad implants, as her rock-solid bosom never jiggles nor sways.  The performers are strictly amateur; while their dance is well synchronized, the choreography is pedestrian and repetitive. You probably already know whether you like the music, to which I am personally indifferent.  If you were hoping to molest some hi-res catgirls up close, this is almost nothing you want. Lastly, 66% of the catgirls in the title image aren't actually in NekoPALIVE, so if you're digging girls 1, 3,4, or 6, you'd best look elsewhere.",
            "review_score": "-1"
        }
    ]
}