{
    "app_id": 471330,
    "name": "VERSUS SQUAD",
    "release_date": "2016-10-26",
    "developer": [
        "DiezelPower"
    ],
    "publisher": [
        "DiezelPower"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Online Multi-Player",
        "Co-op",
        "Online Co-op",
        "Local Co-op",
        "Shared/Split Screen",
        "Cross-Platform Multiplayer",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Survival"
    ],
    "achievements": 68,
    "positive_ratings": 389,
    "negative_ratings": 88,
    "price": 5.99,
    "description": "Versus Squad is a fast action twin-stick shooter from the creator of Nation Red. Build your own sandbox defense and battle thousands of zombie mutants in top down combat! Face up to a dozen bosses. Simultaneously. Collect loot, build and repair. Play single player, on-line or local coop!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/471330/header.jpg?t=1529333632",
    "minimum_requirements": "OS: Windows® XP, Vista™, Windows 7, Windows 8, Windows 10 Processor: Intel / AMD 2.0 GHz or higher CPU Memory: 2 GB RAM Graphics: Graphics with shader model 2.0 or better DirectX: Version 9.0c Storage: 600 MB available space Sound Card: DirectX 9.0c compatible sound card Additional Notes: Xbox 360, Xbox One controller or other XInput-compatible controller",
    "recommended_requirements": "OS: Windows® XP SP2, Vista™ SP1, Windows 7, Windows 8, Windows 10 Processor: Intel Core2 Duo / Core2 Quad, i7 or AMD Phenom CPU Memory: 4 GB RAM Graphics: NVIDIA 8800GT / ATI 3850 512MB or better with latest manufacturer drivers DirectX: Version 9.0c Storage: 600 MB available space Sound Card: DirectX 9.0c compatible sound card Additional Notes: Xbox 360, Xbox One controller or other XInput-compatible controller",
    "reviews": [
        {
            "review_text": "As a longtime fan of Nation Red, there wasn't any hesitation whether I should buy this game or not. The developer has a wonderful connection to the community and Nation Red received frequent updates, adding more content and improving things, directly based on player feedback from the steam forums.  I have no doubt things will be the same with Versus.  That being said, this game is a bit different from Nation Red. Some things I like, other things, not as much.  The glorious mayhem and destruction from Nation Red is the same. There are perks, powerups, weapons, boss zombies, etc.   The graphics now have this smudged painted look, along with outlines. I like how rough and grimy it is, but the levels suffer a bit from things blending together. I like night time the most because zombies stand out very clearly towards the background.  The visual effects can get a bit overwhelming though, as it gets harder to figure out what is going on. The powerup effects and such can easily get drowned in the flood of various effects, this applies to the sound effects as well. The level up effect which is quite important is also easy to miss in the ensuing chaos.  A really cool and unexpected feature was how you can customize your character visually. Right now there's only toggling on and off various clothing and accessories, but I'm hoping to see additional gear in the future.  I really like the building mechanics, but I wish the maps had more inherent and larger obstacles to take advantage of. The controls in the build mode confused me at first as I tried to swap between using a mouse and the controller. Once I got the hang of it, using only the controller, the only issue was the sensitivity of the analogue stick when placing things.  The thing I like the least has to be ammunition. I like the idea, but in practice it's frustrating. When you run out it usually means you lose. And there's various kinds of ammunition making it even more confusing. When you play, you just want to mow down hordes of zombies, the quick paced action doesn't go well with the idea of conserving and keeping track of your ammo.  I've always thought the best thing about Nation Red was the perks and especially Random Perk mode. Each time you level up you'd get to select from a handful of random perks, because it's random you'd usually go with a different build each time, which added great replayability and you'd change your style of play depending on the perks. This hasn't changed in Versus. But Auto-perk mode is the default one and I'm sure new players won't bother to change it, which I think is bad as a new player won't even know how it works or what perks are.   I guess I have to write something at the end here, huh.. If you like building barricades and mowing down hordes of zombies. Get this game!",
            "review_score": "1"
        },
        {
            "review_text": "ok, this is a hard one  I do like it but to my opinion this is to basic/shallow to justify the price level. You can probably have a few session with this one especially co-op, but it will get boring soon enough. ",
            "review_score": "-1"
        },
        {
            "review_text": "I recommend this game. Buy it!",
            "review_score": "1"
        }
    ]
}