{
    "app_id": 471570,
    "name": "Grandpa's Table",
    "release_date": "2016-05-24",
    "developer": [
        "Kivano"
    ],
    "publisher": [
        "Kivano",
        "Kurki.games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Casual",
        "Indie"
    ],
    "tags": [
        "Great Soundtrack",
        "Atmospheric",
        "Casual"
    ],
    "achievements": 37,
    "positive_ratings": 58,
    "negative_ratings": 1,
    "price": 3.99,
    "description": "Relaxing logic game with beautiful 3d graphics and more than one hundred and fifty levels!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/471570/header.jpg?t=1529753672",
    "minimum_requirements": "OS: Windows Vista or later Processor: 1.8GHz Memory: 1 GB RAM Graphics: OpenGL 2.1+ Storage: 100 MB available space Sound Card: Any",
    "recommended_requirements": "Processor: Dual Core 2GHz",
    "reviews": [
        {
            "review_text": "So yeah, I got this game directly from the dev team thanks to a friend's input. This review won't be simple gloryfying, though :)  First thing first - GT has AMAZING main menu! It's actually an interactive old desk with things like radio (sound on/off, next track), options, level select, flags (language change) and credits. It works beautifully, creates surprisingly nostalgic aura all around, and made me stay in for longer time than I had planned.  The gameplay is more common. Sure, I like the logic puzzles as much as the next guy, but don't expect groundbreaking inventions in this particular area. Nevertheless, it's still job well done and can make you think while beating subsequent levels. Achievement system is quite thoughtful as well. All in all - a solid system with properly working mechanics.   And one more thing - this game has a story! Not something you'd expect from a piece of puzzles, but a pleasant add-on nonetheless. The nostalgic aura I mentioned bringing one's own memories is one thing, but the game explores this theme quite thoughtfully. Remember the main menu is shaped like a desk? Well, there's a drawer in it, where you collect pieces of the past, a group of memorablia if you will. Things like notes, shirt buttons, everything that could hold a warm feeling and be connected to things we've experienced. Those pieces form a bigger picture, which deepens your own understanding of memories and maybe even brings some of them back. Truly remarkable feat that makes this game unique.  If there's one thing I'd brag about - it's music. Don't get me wrong, I enjoy the sound of piano, reminds me much of The Sims 1 build mode. It's getting repetitive soon enough, though, and the game really could use a few more tracks. Also, volume controlled in-game would be most welcome, since there's only an on/off option. Still, it's nothing you can't fix from outside the game.   All in all, Grandpa's Table is a very enjoyable experience in this particular genre that I'd recommend wholeheartedly.",
            "review_score": "1"
        },
        {
            "review_text": "Very good puzzle game. I can clearly see, that devs put a lot of heart into it.",
            "review_score": "1"
        }
    ]
}