{
    "app_id": 472680,
    "name": "Elisa: The Innkeeper - Prequel",
    "release_date": "2016-06-14",
    "developer": [
        "Neoclassic Games"
    ],
    "publisher": [
        "Neoclassic Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Free to Play",
        "Indie"
    ],
    "tags": [
        "Free to Play",
        "Visual Novel",
        "Anime"
    ],
    "achievements": 11,
    "positive_ratings": 521,
    "negative_ratings": 146,
    "price": 0.0,
    "description": "This short Visual novel can be considered as a little introductory episode of the game Elisa the innkeeper. Enjoy our Art and Soundtrack as you begin to shape Elisa's destiny for the better or the worse!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/472680/header.jpg?t=1489073860",
    "minimum_requirements": "OS: Windows 7 Processor: Pentium 4 - 1.8 Ghz Memory: 1 GB RAM Graphics: Display 1280x720 DirectX: Version 9.0c Storage: 850 MB available space",
    "recommended_requirements": "OS: Windows 10 Processor: Intel i3 2.0 Ghz Memory: 2 GB RAM Graphics: Display 1920x1080 DirectX: Version 9.0c Storage: 850 MB available space",
    "reviews": [
        {
            "review_text": "Well, the art is certainly 'cute'. And the music is also 'cute'. But the story is...oh, sure, okay, whatever...I guess it's 'cute' as well. But I've honestly read the sides of Corn Flakes packets with more emotional and psychological depth. I'm as 'romantic' as anyone, but let's face it, this is an interactive visual novel for YOUNG GIRLS. As a male in his early forties, I'm probably not the target audience for this game; though there's probably a few dudes in my demographic who might be desperate enough to get a tawdry wank out of it.   Me, I'd much rather read a Clive Barker book, or play The Walking Dead or The Last of Us - two games/series which DO have some emotional depth - but don't let any of this stop you. It's free, it's certainly not incompetent for what it is, and it's probably well worth a look if you're the kind of person who can't wait to see the next Bridget Jones movie. This is only the prequel though, so tissues aren't yet compulsory, unless you're one of the aforementioned males who finds illustrated boobies more arousing than real ones.  Verdict: 5.5/10.",
            "review_score": "1"
        },
        {
            "review_text": "You are a Prince and yea a boring Prince. Better sleep.",
            "review_score": "1"
        },
        {
            "review_text": "Only played once, but I like where this is headed. Will definitely play again and would really like to how the story develops further. Also I like the idea with the items, it can lead to interesting situations. Everyone who loves VNs should give it a try.  @devs Hope you are able to finish your game and realize your visions :) ",
            "review_score": "1"
        },
        {
            "review_text": "It's nice to see a visual novel not set in high school in Japan.  Elisa the Inkeeper  is set in what appears to be an Italian fairy-tale village, and follows a handful of relatively unscrupulous characters as they attempt to manipulate each other. To what end? That's determined to a surprising extent by the player's choices; very few visual novels I've played change so completely depending on what the player decides.  This is a small preview of the game (which has met its funding goal on Kickstarter), and so doesn't reach any actual resolution. Still and all, there's enough here to get a feel for the characters and the world, and to make several interesting choices and pursue different threads. The art style is cheerful and pleasant, the music is excellent, and the dialogue, while a bit rough around the edges in places, is often well-written and funny.  The developers of  Elisa the Inkeeper  are accessible and open to player feedback, which is nice, and they've actually released an update to this demo version, adding several new features (and Steam achievements) -- that kind of dedication is nice to see, given the number of games that end up perpetually stuck in 'early access.' The Kickstarter has met its initial funding target, but is still running as of this writing -- there are plenty of stretch goals still to meet!",
            "review_score": "1"
        },
        {
            "review_text": "Well, compared to all the Visual Novel I read, this one was pretty good. Graphically the game is pretty, with enough characters / facial or body expressions / backgrounds, etc The story really differs from which answer you choose, and it leads to a lot of different endings. + the game is playable in a few languages ( french, english, german etc ).",
            "review_score": "1"
        },
        {
            "review_text": "Great story, memerable characters and a phenomenal soundtrack. One of my favorite visual novels to date.  7/10",
            "review_score": "1"
        },
        {
            "review_text": "The name of the game is actually misleading. This is more of a demo then an actually game. But I had a good time good time playing around with it and getting all the artwork and routes it provided. Also it gives me a better idea of the characters and story. At first I was not sure of some of the chracters, but as I good through more routes, they became a little more interesting.  I look forward seeing the full game in the future!",
            "review_score": "1"
        },
        {
            "review_text": "It's a Visual Novel game If you like story and anime illustrations, this game should be the one of games you like  Also, this game is FREE :)",
            "review_score": "1"
        },
        {
            "review_text": "i like the game cant wait for the full game.",
            "review_score": "1"
        },
        {
            "review_text": "such a lovely story,i love it",
            "review_score": "1"
        },
        {
            "review_text": "dissapointed, couldnt do one taps like in csgo    but, it has interesting characters :D  great game",
            "review_score": "1"
        },
        {
            "review_text": "It's free so I can't complain about what I got. The music was nice and the artwork was well done. The choices you make really do have a big impact on how the story flows. The story itself though, seems a bit choppy at this point and could use some work. All in all, it doesn't look like it will be a bad game.",
            "review_score": "1"
        },
        {
            "review_text": "Cute and interesting so far! And I definitely love the chibi options, they are so adorable! I'm excited to see what happens next!  Note for other customers: It's free! If you like visual novels, you might as well try it out, give feedback, and help the game get on its feet!  I did notice a bug in the settings menu, though. When I changed the sound effect volume, the numbers changed, but the bar didn't move at all. There are also some very small grammatical errors (English version) and strange phrasing, but I'm sure you already know about those!",
            "review_score": "1"
        },
        {
            "review_text": "Cute and interesting so far! And I definitely love the chibi options, they are so adorable! I'm excited to see what happens next!  Note for other customers: It's free! If you like visual novels, you might as well try it out, give feedback, and help the game get on its feet!  I did notice a bug in the settings menu, though. When I changed the sound effect volume, the numbers changed, but the bar didn't move at all. There are also some very small grammatical errors (English version) and strange phrasing, but I'm sure you already know about those!",
            "review_score": "1"
        },
        {
            "review_text": "DAMN GOOD GAME CAN'T WAIT FOR EP2  The knight is badass tho i liked him xd  and the prince is dumbass [10/10]",
            "review_score": "1"
        },
        {
            "review_text": "love this game more chapter please!!!! &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "From the get go the font is black letters on game background, and it's unpleasant to read. I think that a white background behind the text would be easier.",
            "review_score": "1"
        },
        {
            "review_text": "As the name suggests this novel is a prequel or, to be more correct, a preview on what could possibly be a complete novel.  The art is nice and the music is pleasant for something that was (more or less at the time of this review) made by a team of developers who made this their first game. The player does not control a protagonist but rather a 'hand of fate' (basically you're God) that makes choices at key events during the story.  Overall I would normally NOT recommend this game due to it being short. However, as the developers has stated that this is only 20% of what could presumably be a full novel it might possibly be good to recommend.  ULTIMATELY:  Recommended - Don't mind the short story/ support the developers and the novel Not recommended - Too short.",
            "review_score": "1"
        },
        {
            "review_text": "Really cool",
            "review_score": "1"
        },
        {
            "review_text": "I'm excited to see where this game goes and what it becomes.",
            "review_score": "1"
        },
        {
            "review_text": "It's definitly not what I exspected when I first booted up the game, but when I got into the game, the more I was drawn in.  I must admit though, it's not your usual Visual Novel, so anyone out there looking for somethig interesting and new, THIS is the game to play, can't wait to see the final version!",
            "review_score": "1"
        },
        {
            "review_text": "This visual novel feels very vanilla. It does not seem to try to do anything particularly interesting as the characters are nothing out of the ordinary, the story does not feel like anything new, the art is alright, and the music feels average. All around, it feels like just an average visual novel from what the prequel shows.  If this is the quality be represented after the full visual novel launches, I personally can not recommend it. The story would not interest me the slightest.   However, Elisa: The Innkeeper, as of right now, is just a prequel. It still has potential to do something more interesting. I am going to tune into what the story may become.  It is a free, I would give it a shot to see if you like it, but don't judge it completely yet.",
            "review_score": "1"
        },
        {
            "review_text": "  'He swallowed his glass of beer' 'I just gifted my castle away' ",
            "review_score": "-1"
        },
        {
            "review_text": "Honestly was very boring, no action or anything involved. Some parts are underdeveloped and leave the screen completely black",
            "review_score": "-1"
        },
        {
            "review_text": "Might have been interesting, but they went for the wet t-shirt shot right off the bat, and lost me.",
            "review_score": "-1"
        },
        {
            "review_text": "Bad one ...",
            "review_score": "-1"
        },
        {
            "review_text": "Steam Overlay Not Available. really wanted to take Screenshots",
            "review_score": "-1"
        },
        {
            "review_text": "It's not a game, it's a story that requires you to click in order to proceed. Hot characters to call the attention, focus on their hight/weight (only women, ofc)... Lost my interest after a fe minutes and just kept clicking to see where it went, but it's only that.",
            "review_score": "-1"
        },
        {
            "review_text": "I understand this is a prequel, but the game is boring and does nothing to form a connection with any character. They're all one-note and stale. Unless you have read ever other visual novel game recommended on Reddit or the forums here, you shouldn't waste your time. Little reason shown to hope the final game will be better.",
            "review_score": "-1"
        }
    ]
}