{
    "app_id": 472870,
    "name": "Higurashi When They Cry Hou - Ch.3 Tatarigoroshi",
    "release_date": "2016-06-17",
    "developer": [
        "07th Expansion"
    ],
    "publisher": [
        "MangaGamer"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Visual Novel",
        "Anime",
        "Adventure"
    ],
    "achievements": 16,
    "positive_ratings": 176,
    "negative_ratings": 6,
    "price": 5.59,
    "description": "Higurashi When They Cry is a sound novel. The music, backgrounds and characters work together to create a world that is the stage of a novel for the user to read. They laugh and cry and get angry. The user takes the point of view of the protagonist to experience the story.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/472870/header.jpg?t=1552080157",
    "minimum_requirements": "OS: Windows XP Processor: Pentium III 800 MHz Memory: 512 MB RAM Graphics: OpenGL Compatible Card DirectX: Version 9.0a Storage: 500 MB available space",
    "recommended_requirements": "OS: Windows 7 + Processor: Pentium 4 1.4GHz Graphics: DirectX or OpenGL Compatible Card",
    "reviews": [
        {
            "review_text": "After playing this, I could definitely see why many tout this as one of the best installments of the Higurashi no Naku Koro Ni series.  The series is known for pulling the rug under your feet with mood changes from cutesy to the horrific, often bordering on whiplash between the two, but this one in particular makes a bleak and hopeless portrayal of domestic abuse the main setpiece for the story, the point upon which everything unfurls this time in Hinamizawa. Ryukishi is said to have been a social worker for a time before writing Visual Novels, and in this episode you can really get a glimpse of the squalor he must have seen from his time there. The feeling of powerlessness against an injustice that thrives off bureaucracies' dogmatic adherence to regulations, the futility of going against those regulations with good intentions leading to the worst of outcomes, How people break under abuse, abandonment and betrayal. It's a very different tone from the previous works that is really heavy.   Between the bleakness however there are also some really emotionally stirring scenes, especially the bonding scenes between Keiichi and Satoko. The development of Keiichi and Satoko's relationship from something like friendly rivals to a love shared between siblings, paralleling her relationship with her actual brother who is missing is done really well and... The night time walking and conversations about nothing in particular, just enjoying the small periods of life where the good times knowing they won't last forever between the gang... Beautiful moments as dark rumbling machinations lurk just on the brink... You experience all the joys and terrors with them... Ryukishi finds a way to charge into your heartstrings and pulls at them, and really shows us how good he is at writing a story.  There are a few little hiccups here and there in the presentation. Music isn't as varied as it could be, though each track used is used to good effect, maybe a typo here and there (I believe I recall a her pronoun used when they were referring to a male character), and there's something about a sprite being removed, which honestly doesn't affect the overall work that much. One could say its addition served an important purpose as a characters view of another changes right at that moment, and it drives the point home, but you can still get the sentiment even with it gone I think.  All these aside, it's a really great entry into a great series. Highly recommended for all who enjoyed previous entries, and if you are somehow reading this without reading the previous episodes, you really ought to go and read them. They're all good.",
            "review_score": "1"
        },
        {
            "review_text": "Tatarigoroshi is my personal favorite of all 8 Higurashi chapters, and especially the best of the 3 out on Steam right now (don't skip out on the first two, of course), so it's a definite recommendation on my part. Pros:  a great storyline   wonderful character development   can become very tense and engaging   good mystery aspects, as always   fairly nice translation   access to updated and original sprites   one of the best endings to a Higurashi chapter   will make you want to   kill her Uncle yourself     lots of satoko   Cons:  some wonky sprites that leave character's eye or mouth placement a bit off. Examples include Mion, Coach, and Rika at times   a few typos/grammatical errors - I noticed 3 in my first run through   Once again, a whole hearted recommendation from me; the most enjoyable chapter, in my opinion. And, you can never get enough Satoko.",
            "review_score": "1"
        },
        {
            "review_text": "Best arc in the series so far. It doesn't spend too much time farting around with exposition and whatnot(something that bothered me about the last arc. It dragged on far too much before getting into the meat of the story), and gets intense pretty fast. It isn't as 'scary' as the previous parts in the series(although it does have its moments), but it touches on a lot of more real subjects that tap more into real fear rather than the usual mind-♥♥♥♥ery that I've come to expect from the When They Cry VNs. I've shed quite a few tears during some of the scenes, and there were also a couple times where it straight up got to the point where I had to quit reading for a little while before continuing. Especially since the writing in this one gets so good that it's easy to actually   feel   like Keiichi. ",
            "review_score": "1"
        },
        {
            "review_text": "One of my favourite parts, maybe even better than ch1.",
            "review_score": "1"
        },
        {
            "review_text": "Great game and my favorite yet, now every time I stop walking and listen to be sure I don't hear extra footsteps behind me",
            "review_score": "1"
        }
    ]
}