{
    "app_id": 474010,
    "name": "The NADI Project",
    "release_date": "2016-06-01",
    "developer": [
        "Monkeys Tales Studio"
    ],
    "publisher": [
        "Monkeys Tales Studio"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Free to Play",
        "Indie"
    ],
    "tags": [
        "Free to Play",
        "Adventure",
        "First-Person"
    ],
    "achievements": 9,
    "positive_ratings": 230,
    "negative_ratings": 128,
    "price": 0.0,
    "description": "The NADI Project it is a free-to-play, first person graphic adventure, in which you will face various obstacles to escape from your destiny.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/474010/header.jpg?t=1512221285",
    "minimum_requirements": "OS: Windows 7 / 8.1 / 10 Processor: Intel i5 3.20 GHz Dual Core CPU Memory: 8 GB RAM Graphics: GeForce GTX 770 with 2GB VRAM / Radeon R9 280X 3GB DirectX: Version 11 Storage: 2 GB available space",
    "recommended_requirements": "OS: Windows 7 / 8.1 / 10 Processor: Intel i7 3.50 GHz Quad Core CPU Memory: 8 GB RAM Graphics: GeForce GTX 770 with 2GB VRAM / Radeon R9 280X 3GB DirectX: Version 11 Storage: 2 GB available space",
    "reviews": [
        {
            "review_text": "NADI project review: Read and decide for yourself. Good: -Free -Easy achievements 1-2 hours to 100% The Bad: -the game needs some minor hints to make navigation easier -the character's movement is not smooth at all  However, since the game is free, it is a pass. I would recommend it if you want a free easy game ",
            "review_score": "1"
        },
        {
            "review_text": "The NADI Project was definitely something. I played it through to the end, and it's definitely not the worst thing I've seen on steam, ontop of being free. It's a short narrative with... I'm not quite sure. I was expecting horror and I was a little bit tense waiting for some sort of scare but one never came. I guess I have to give credit for that, it didn't do any cheap scare in the numerous chances it had. The story was... definitely something. I didn't unlock the final achievement, I wasn't sure what I was missing to get it. To be quite honest though, there's alot wrong with it too though. The inventory system is janky, and the sensitivity is painfully low. There's also quite a few translation errors. I can't really say whether or not I recommend this game because of it. It absolutely needs alot of polish. I think it has potential, as does the developer, however before I can recommend it it needs to have the forementioned issues resolved. I want to stress that not recommending this review does not mean that the game and developer aren't lacking in potential. I really hope to see more products from the developer, perhaps using the feedback from this piece as a learning experience.",
            "review_score": "-1"
        },
        {
            "review_text": "NADI Project, a pretty neat adventure/ mystery game. A bit of a challenge at first, some first person puzzles, and an all around enjoyable experience. that being said performance was rough in quite a few places, and I had more than one freeze and crash. Hopefully it gets smoothed out more now that its been released.",
            "review_score": "1"
        },
        {
            "review_text": "Finally, this game can be downloaded again!!!  This is a short game, though I have had to restart it due to a few moments where the game completely froze. Aside from freezes and walls you can walk through (lighthouse), you'll have a HORRIBLE time dealing with the awful framerate (as others had reviewed saying 9-15 FPS even on the lowest settings).  On the plus side, this game has a somewhat decent story and looks pretty nice. The details on all areas looks well-done.   PROS: + Good scenery + Nice cinematics + Decent story + Short + Free + Achievements  CONS: - Bugged (walk-through walls) - Horrible framerate   All things considered and despite the quantity of Pros outweighing the Cons, the framerate in this title is absolutely unforgivable. If you want free achievements and a short game to play, feel free. Other than that, I cannot find myself recommending this game. (By the way...it's another UNITY game)   3/10 Pretty boring, horrible framerate, and buggy. Wasn't a fun experience.",
            "review_score": "-1"
        },
        {
            "review_text": "Nice, weird, interesting story.. Good &amp; atmospheric music .. &amp; cutscenes are good. Easy 100% achievements..&amp; it is a free2play.  Just that the game isn't running smooth &amp; has some glitches at various points.  Overall rating 7/10",
            "review_score": "1"
        },
        {
            "review_text": "Though a little short, a nice little exploration game.",
            "review_score": "1"
        },
        {
            "review_text": "It was free. Since I didn't have to pay, I shouldn't say too much that's unpleasant about it.   Clearly influenced by Dear Esther (walking simulator, island, lighthouse, radio mast, ghosts), it's very much like the old point-and-click adventure games, but in a 3d environment. You walk around an uninhabited island, examining certain features and picking up certain objects. Some of the objects have to be combined before they're useful. You do this to solve the mystery of the fate of the previous inhabitants.  Positives - It works. I was able to play it all the way through without crashes or serious glitches. The developer has clearly put a lot of work into what I suspect is his first public offering. Although normal progress is slow, there -is- a 'run' button that works. Despite the negatives below, I actually quite enjoyed the game, which is why I've given it a positive recommendation.  Negatives - The story is pretty peculiar, and is not helped by a strange English translation. Many of the textures are poor quality, and the lighting has far too much contrast. Some of the scenery elements (particularly rock formations) just don't look believable.  Note - Save often. There are some areas where you can clip through the intended map boundaries, and then you can't get back.  Conclusion - Despite the flaws, it's a creditable first attempt. The developer has a long way to go, but he clearly has some talent. For a free game, it's relatively entertaining.",
            "review_score": "1"
        },
        {
            "review_text": "This is a very short game and full of bugs and glitches! Think I glitched through atleast 50% of the game, not intentionally but that happend^^   pros +achievment +free  cons +buggy +glitchy +laggy",
            "review_score": "1"
        },
        {
            "review_text": "*Looks at requirements* *Compares it to potato laptop which barely runs CSGO at 30-35 fps* *Sigh of relief* *Installs game and starts at lowest settings* *Notices cursor delay, checks for mouse acceleration. It\\'s turned off* *Plays for 3 more minutes* *5 fps* *Tries launch options* *7 fps* *Uninstalls NADI and installs DayZ* *Loads DayZ* *25 fps despite the devs sitting on their arses for 3 years* *Writes review complaining about NADI* *Realises it's free and has just been released* *Gives the devs a chance and gives a thumbs up :)*",
            "review_score": "1"
        }
    ]
}