{
    "app_id": 474210,
    "name": "BUTCHER",
    "release_date": "2016-10-05",
    "developer": [
        "Transhuman Design"
    ],
    "publisher": [
        "Transhuman Design"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Workshop",
        "Steam Cloud",
        "Steam Leaderboards",
        "Includes level editor"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Pixel Graphics",
        "Gore"
    ],
    "achievements": 27,
    "positive_ratings": 555,
    "negative_ratings": 53,
    "price": 6.99,
    "description": "BUTCHER is a fast-paced 2D shooter and a blood-soaked love letter to the cult classics of the genre. If kicking corpses into a lava pit and adorning walls with blood is your idea of a good time, BUTCHER is THE game for you.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/474210/header.jpg?t=1537617562",
    "minimum_requirements": "OS: Windows XP SP2+ Processor: Core 2 Duo Memory: 512 MB RAM Graphics: DX 9.0/OpenGL 2 compliant with SM 2.0+ DirectX: Version 9.0 Storage: 200 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "The best first person shooter that is not actually a first person shooter that you will ever play.  Butcher is unique among 2d shooters in that it has far more in common with the first person shooters from the 90's like Doom and Quake than it does with something like Contra or Commander Keen. There is minor platforming that takes place in the game but its much subdued in favor of precision aiming and deadly combat. Its not just that either, the level design, the health bar and general hud, the level hub, the end level screen were it display's the number of enemies killed and the secrets you've collected, and especially the industrial and oppresive atmosphere, it all comes together to form this feeling in your mind that your playing a first person shooter masquerading as a 2d one.   Butcher one ups those 90's shooters in the gore department with its genuinely impressive blood physics system. Blood splatters on to walls and spills on to floors, drips off of platforms onto the ground below, enemies scream and cry out as they slowly die if shot non-fatally, you can chew enemies in half with your weapons splaying their intestines all over the floor, enemies can be drowned, fed to piranhas impaled on hooks crushed and exploded into gibs, popped like cherries, the list goes on and on, it gives it a flair and brutality that accentuates the high difficulty, and this game is HARD son, I remember when I started my first play through on 'hard' difficulty (The lowest difficulty btw) when I was in the forest area I thought to myself '♥♥♥♥ man how am I even going to beat this game.' but as you play and learn the behavior of the enemies and hone your reflexes and improve your aim, you can feel yourself getting better and better until you finally beat it, and then its time to start on the next difficulty level, Its cool to think back to how I was having such trouble with just hard and now I'm on my third play through on Hardest. The key is not to give up or relent, don't let the game win, its like beating your head against a brick wall until it breaks but each time you hit it your blows get stronger and harder, you get better at it. Its a real accomplishment to make a game like this where you feel a sense of progression merely from honing your skills rather than leveling up skills or something like that.  The soundtrack is a really special thing, if I could describe it I would say it resembles a mix between the ambient industrial nine inch nails soundtrack of quake with something more fast and nearly break-beat like. It adds to the oppressive and dark atmosphere of the game extremely well and atmosphere is something that this game already has in spades.   Probably one of my favorite games of the year and It was just something I bought on whim without even hearing about it before.",
            "review_score": "1"
        },
        {
            "review_text": " Summary",
            "review_score": "1"
        },
        {
            "review_text": "im a massive fan of the orginal doom, quake, and other such iD games. plus some others i cant think of right now.  BUTCHER is pretty damn great. it knows what it is and does it very well. and yes, it is hard, and i really like that. i like that it owns that it is a hard game. because really, there are not enough hard games like this.  really will love it further once gamepad support is properly in, but keyboard and mouse is still a great experience.  worth the price and the OST is awesome on top  6/6 solid",
            "review_score": "1"
        },
        {
            "review_text": "An incredibly fun fast paced, tough shooter, basically DOOM but 2D. I highly recommend :D",
            "review_score": "1"
        },
        {
            "review_text": "Great game at a reasonable price. What you see is what you get: non-stop action and buckets of blood and gore. I especially like the attention to detail and the dark, gritty artistic approach that's obviously a homage to brutal 90's videogames like Doom. Everything's well animated; weeds sway when you walk through them, swinging chains, flowing lava and water, animals, etc. Killer music that adds to the tension, sound effects are LOUD and violent. Very challenging and encourages additional play-throughs for speed runs, plus it's just very satisfying blowing away hordes of enemies, watching them clutch their guts in pain after you give them a shotgun blast. Overall the game's very much in the tradition of Doom and Contra, just hope more people purchase to support this fantastic developer. Looking forward to the addition of multiplayer and future DLCs! Only negative I can think of would be the overly pixelated style, might turn some off but I like it. Buy it or live!",
            "review_score": "1"
        },
        {
            "review_text": "  DISCLAIMER: This is a first impressions review, and NOT a full review, if you want a full review, then please read better reviews then mine",
            "review_score": "1"
        },
        {
            "review_text": "This is a killer platformer. Fast paced and unforgiving. I was a huge fan of the game ABUSE when I was younger, and I would say this game takes that formula and pushes it even further with more detailed effects, higher resolution sound and at times a faster pace.  This game would be a lot of fun using the right analog stick to fire on a standard controller. It would have been cool to incorporate grenades, maybe desctructable walls...  EXCELLENT GAME",
            "review_score": "1"
        },
        {
            "review_text": "Great old school action platformer, had tons of fun with it in my playthrough.   Can be pretty difficult, but satisfying to get through a level.    No Checkpoints, health / armor pickups are pretty scarce, and are disabled on higher difficulties.    New weapons are gained as you progress though the game, feel great, and also open up movement options like chainsaw boosting or the classic grenade jump.   Dark, gritty color pallette works well and the music really fit the theme of the game.    Hidden skulls are scattered throughout levels for you to find, unlocking higher difficulties.   Great game, strongly recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Does not contain meat",
            "review_score": "1"
        },
        {
            "review_text": "I havent played a lot of it yet but from what i played its pretty good. well worth the price",
            "review_score": "1"
        },
        {
            "review_text": "Shoot a lot. Die a lot. Rage a lot. Have fun...a lot. Seriously though, good job THD. :)",
            "review_score": "1"
        },
        {
            "review_text": "I must say I really fall in love with this game at first sight. I suppose your playing some kind of terminator (not sure) and your destroying some military facilities in another galaxy, but seriously, you must not care about a good scenario if you want this game, there is nothing but a quick cinematic at the start of the game. The pixel art is good and the animation correct, the sound and the ambience is fitting perfectly the bloody scene. The control feel very tight, it's not easy at first to be aware of your crosshair at all time while your jumping and running to dodge bullets. Your in for some frustrating moments. Level are not very long but insanely intense and hard at first. Eventually you will start to understand that you must always be a moving target and must remember where will be the next opponents and what type of weapon will work in this position. At some point, relaying only on reflexes will not work for the average gamer (I'm average I think). There is some part of the game where you will face waves of ennemies and will need to destroy them so you can proceed to the next area. I felt there was too much of them... You will sadly die a high number of time in these, but the feeling when you will get to the next level is pure heaven. There is 35 skull hidden (some really well) in the game and four level of difficulty from hard to impossible.  In conclusion, for only 10$ it's a very good game.  ",
            "review_score": "1"
        },
        {
            "review_text": "Now im sure im a psychopath.",
            "review_score": "1"
        },
        {
            "review_text": "  A beautiful hardcore game for old school hardcore gamers!!! Blood and intestine everywhere, powerful weapons (and a chainsaw) and awesome music! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "the game isn't the only thing thats hard ( ° ʖ °) 10/10",
            "review_score": "1"
        },
        {
            "review_text": "let me just play a quick 10 minutes just to try it out before bed i tell myself. Hour and a half later im trying to force myself to stop butchering people.... ugh",
            "review_score": "1"
        },
        {
            "review_text": "  Beautiful artwork, beautiful gameplay, Doom but 200x harder. Remember to shred up every scientist you see with a chainsaw/shoot their faces off with a shotgun ☺  Simple, fun, addictive. Reminds me of crack.",
            "review_score": "1"
        },
        {
            "review_text": "This game is very well made. The combat feels better and better every time you play. Eventually you will fly through enemies like Doomguy with berserk.",
            "review_score": "1"
        },
        {
            "review_text": "I was really hyped for this game, played the demo and really loved it. I also clocked thousands of hours on Soldat before from the same developer and loved it.   Butcher works fine and smooth, weapons are fun to shoot and movement feels alright. Game is hard which I liked about the demo, but unfortunately the graphical style with addition to all effects makes everything impossible to see. You can turn some of the effects off in the Options menu, but it doesn't make it better.   In red/dark environments it's almost impossible to see where you are, where enemies are, where targeting reticule is. Add environment destruction, blood, glowing lava, screen shakes and effects withwith addition to godly marksmanship skills of the enemies makes the game rather frustrating instead of being just hard.   It's a shame because if the visuals would be clearer and readible it would be a great game.",
            "review_score": "-1"
        },
        {
            "review_text": "It's got the potential to be a fantastic game, and I do get a Doom/Quake vibe from it, but it was too difficult and not in an enjoyable way for me to really recommend it to anyone. I'm pretty sure after a few patches, I'll adjust this review but as it stands, I can't recommend it unless you're looking for a super challenging platformer/arena shooter. I mean, the title screen states that the easiest difficulty is hard, after all.",
            "review_score": "-1"
        }
    ]
}