{
    "app_id": 474910,
    "name": "The Mahjong Huntress",
    "release_date": "2016-05-25",
    "developer": [
        "Nawia Games"
    ],
    "publisher": [
        "Forever Entertainment S. A."
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Adventure",
        "Indie"
    ],
    "achievements": 16,
    "positive_ratings": 96,
    "negative_ratings": 71,
    "price": 3.99,
    "description": "Embark on a mysterious quest in search of the missing groom, Charles Gilbertworth, solve riddles, encounter supernatural creatures and ghosts - all while solving relaxing and fun Mahjong puzzles with innovative gameplay mechanics.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/474910/header.jpg?t=1464867979",
    "minimum_requirements": "Минимальные: ОС: Windows 7 Процессор: Dual core from Intel or AMD at 2.8 GHz Оперативная память: 2 GB ОЗУ Видеокарта: nVidia 320M or higher, or Radeon 7000 or higher, or Intel HD 3000 or higher Место на диске: 2 GB",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Buggy and requires you to use specials to be able to finish levels. Really not my cup of tea. Presentation is decent, but the story bits are really shoehorned in. Not worth the bother as there are better solitaire Mahjong games around.",
            "review_score": "-1"
        },
        {
            "review_text": "  TL:DR - Wait untill it is on sale, this game is still broken from those who reviewed it before me. Not worth full-price. Around 1/3 of the levels are impossible without grinding for gems just to use a power-up. I would recommend this game once the dev's actually fix their bugs and incompletable boards.   + Power-ups + Beautiful Artwork + Bonus levels   - Boss levels - Broken game - Rigged levels - Cliche Story   The game is fun, it has a storyline which is rare for mahjong games or at least ones I am able to find but don't get your hopes up. The story is pretty much your cliche fantasy with Werewolves and ghost ships with a bit of ♥♥♥♥♥♥♥t magic from your 'Grandfather' which just copies the shrinking scene from Alice In Wonderland! Nothing feels like it should tie together and is just there for plot.   The game does so however have its own little mechanics to make the game different from other mahjong games such as taking one piece off the board so you can continue or to destroy where its other-half is hiding with your power-up.  However the power-ups are confusing at first and I feel you are given too many of them at once. If anything half of them can be removed from the game and nothing will change game-wise. I only use half of them, the other half do not seem worth it compared to other power-ups you can use.   A big draw-back for me is past level 7. You can easily do level 1-7 without losing but as soon as you hit level 8 you are hit with the biggest difficulty curve. You will lose on this level so many times and I warn you to NOT SHUFFLE THE BOARD! The shuffle power-up is broken and there is a 50/50 chance that it will break the board and give you blank tiles. Meaning you need to start over. Many users have had this issue and we still have it, the devs have done nothing to fix this so a few users are actually stuck on level 8. So no it is not just my laptop, it is the game itself.   I love Mahjong and play a lot of it but the difficulty curve in this one is just too much and highly unfair, specially since like most mahjong games, the layout past level 7 will cause the game to load pieces to where you will not get them, grouped with other titles just the very same so I hope you like restarting the level alot. If you do happen to get past level 8 the levels are easier with 1-2 levels being complete middle-fingers to you in each chapter.  Also a level from Chapter 2 repeats in Chapter 6 and yes it is a level which forces you to use your gems and shuffle 4-7 times to complete it. Not fun developers.   Lastly, is the boss levels. I have only reached one so far but it is NOT MAHJONG. It turns into bejeweled to where you need to match up the gem on your side of the screen to attack the boss. Not so hard until you need to avoid matching up the tiles which the boss needs to attack you. This is hard even on the first boss because the board will be filled to death with the tiles the boss needs and he kills you in 3 hits while it takes you 4/6 hits to kill them. I swear they only need half the tiles you need as well to attack you. I don't know why the boss levels are a bejeweled-clone, yes it is a nice change from mahjong I will give it that but it seems out of place for the game itself.   I wish Steam had a MAYBE option because I would recommend this game but at the same time I would not. This game has a lot going for it with its ideas and set-up but with the power-ups able to break the board to being incompletable is a let down for any player. Wait till it is on sale if you really want to try this out, otherwise do not buy a broken game full-price.      P.S - Don't think the game is as long as my play hours, some levels are rigged to purposely get you stuck and take 1hour+ to do. This is annoying when you have bonus stars to collect because of how heavily rigged th elayout is towards the bonus star.  I find it cheap when developers rig their game to make it seem longer than it actually is. If you are going for 100% achievements on this you better prepare to pull your hair out from the ♥♥♥♥♥♥♥t luck this game have towards you.   At least in story-mode, you can play 'Mystery Challenge' for the star achievements. Pretty much all but the 'Charles Diary' achievement can be done through Mystery Mode which is more fun than storymode because the levels don't ♥♥♥♥ you over.",
            "review_score": "-1"
        },
        {
            "review_text": "The best Mahjong game I've ever come across.  The Mahjong Huntress embeds the classic tile matching game into a story, in which a young woman has to find out what happened to her fiance. In order to progress through the story, the player has to solve the boards which unlock hints about the fate of the young man.   Apart from simply cleaning the board of tiles, there are a number of objectives which contribute to the player's energy bar. Depending on its charge, the player is able to use certain powers which can put an already lost game back onto the path to success. Another nice feature is the combo system, which is basically a timer counting down a few seconds between each move, awarding more points if the player managed to match several tiles within the ever decresasing intervals.  The difficuilty of the boards is steadily increasing, forcing the player to sacrifice speed in favor of choosing the right tiles. Unwisely chosen matches will quickly force the player to sacrifice his energy for above mentioned special powers. But beware - once the energy is depleted, the player will have to start over with simpler boards to recharge the energy bar.  In addition to the story mode there are more than 230 so called mystery boards, which are offering a wide range of tile layouts to choose from right from the start.  The presentation is very nice, offering pleasant visuals along with a functional and intuitive user interface.  If you were searching for a Mahjong game, you've just found it. Especially with the very low price tag attached there is absolutely no reason not to recommend it.  Info: The Mahjong Huntress runs very smoothly under Linux as well. I've encountered no problems on my 64Bit-Ubuntu Linux configuration.  UPDATE:   So far I've encountered only a few bugs. Some minor graphic glitches, some spelling errors. Worst bug was a game crash after the boss fight in the mausoleum. After restarting, I couldn't progress because the game didn't open chapter 3 for me. I had to create a new player profile and start over.",
            "review_score": "1"
        },
        {
            "review_text": "the plot of this game is so ridiculous that you have to play it just for that",
            "review_score": "1"
        }
    ]
}