{
    "app_id": 475430,
    "name": "Kimulator : Fight for your destiny",
    "release_date": "2016-08-11",
    "developer": [
        "Bmc Studio"
    ],
    "publisher": [
        "Bmc Studio"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Casual",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Memes",
        "Indie",
        "Action"
    ],
    "achievements": 0,
    "positive_ratings": 269,
    "negative_ratings": 163,
    "price": 1.59,
    "description": "In this game, you will play as a random French Canadian who needs to infiltrate a North Korean' base with his friend Jesus. Will this dude succeed in his quest? Find out in Kimulator : Fight for your destiny! Buy now and get a free copy of Dreamblaster!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/475430/header.jpg?t=1531884219",
    "minimum_requirements": "OS: Windows 7 Processor: I5 min. 2.6 GHZ or better Memory: 5 GB RAM Graphics: GeForce 660,Radeon 6850 or similar/better Storage: 5 GB available space Sound Card: DirectX Compatible Sound Card with latest drivers Additional Notes: If you run with this kind of configuration expected some minor lag",
    "recommended_requirements": "OS: Windows 7,8,10 Processor: Intel Quad-Core (i5 2300) or AMD Octo-Core (FX 8150) Memory: 8 GB RAM Graphics: NVIDIA GeForce 660Ti or greater, AMD Radeon HD 7950 or greater, 2GB Video Card (Minimum Shader Model 2.0) Storage: 5 GB available space Sound Card: DirectX Compatible Sound Card with latest drivers Additional Notes: If you run with a better configuration , the graphics will improve a lot's.",
    "reviews": [
        {
            "review_text": "Quite underrated, feels very good, crisp gameplay, great hitboxes, and story.",
            "review_score": "1"
        },
        {
            "review_text": "Great game in every way. Intriguing story, good mechanics, superb graphical quality. I simply couldn't ask for more from this title.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game has changed my life.  It has showed me that satanism is the right way to go.  Screw Jesus I mean he threatened to kill people with a rocket launcher.  Thank you kimulator for showing me that satanism is the right way to go.",
            "review_score": "1"
        },
        {
            "review_text": "  don't buy it like pls noteven worth a cent lol   dreamcaster free included so 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Can't wait for part 2!!!1!",
            "review_score": "1"
        },
        {
            "review_text": "this is the greatest game on steam",
            "review_score": "1"
        },
        {
            "review_text": "Best experience Ive ever had in a game. The cutscene to gameplay ratio puts MGS4 to shame. It felt like I was actually in North Korea, the developers put in a lot of work in the stealth mechanics of this game. The animations are excellent as well, it amazes me that they didn't ask for 60 dollars for such a high quality game. The multiplayer is amazing too, it will truly be the CoD killer.  9/11       Jesus made me write a good review.",
            "review_score": "1"
        },
        {
            "review_text": "Actually just terrible.",
            "review_score": "-1"
        },
        {
            "review_text": "i was planning on just buying this as a joke then just giving it some horrible meme review but when i started downloading the game my anti-virus went off and said it came with some virus. once i deleted the virus i started the game and then got stuck on the loading screen for what felt like forever. once the game fully loaded it instantly crashed.  10/10",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a mess, it doesn't feel finished in the slightest. The gameplay isn't fun at all, which is the main fps gameplay, and then the incredibly poor attempt at platforming. I thought I would get at least a little bit of entertainment from the live-action cutscenes, but those fell flat as well. The acting is very weak (I guess it doesn't matter because memes). i never found anything funny or compelling. I was about to quit the game out of boredom, but it ended before i got a chance to quit out. They try to make up for the short length by shoving in equally bad bonus games. The graphics don't help this game either. Textures look terrible and models even worse. Overall this game isn't worth the money or time, you're better of doing really anything else.",
            "review_score": "-1"
        },
        {
            "review_text": "  I won't do what you tell me, Jesus! You are not my real mom!  No, seriously...this game is not good in any way. For me, it felt like a school-project of some kind.  To be fair, I wasn't able to make a game in their age, soooo...maybe, if they stick to it, we'll see something decent in the next 10 years.  But for this game...1,99€...that's kinda harsh. Back in the day, we would have passed this to our buddies on networking parties.  Good thing, it was a present of a friend on Steam.",
            "review_score": "-1"
        },
        {
            "review_text": "A steal for $1.98. Anything above that, and you're getting ripped off.",
            "review_score": "-1"
        }
    ]
}