{
    "app_id": 475550,
    "name": "Beholder",
    "release_date": "2016-11-09",
    "developer": [
        "Warm Lamp Games"
    ],
    "publisher": [
        "Alawar Premium"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 3,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Indie",
        "Strategy",
        "Choices Matter"
    ],
    "achievements": 60,
    "positive_ratings": 9947,
    "negative_ratings": 1095,
    "price": 6.99,
    "description": "You’re a State-installed Landlord in a totalitarian State. You must spy on tenants, peep, eavesdrop and profile! You must report on anyone capable of plotting subversion against the State.You MUST! But WILL you?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/475550/header.jpg?t=1549527359",
    "minimum_requirements": "OS: Windows 7/8/10 Processor: Intel Pentium Dual CPU E2180 2.00GHz Memory: 2 GB RAM Graphics: GeForce 600M / ATI Radeon HD 5450 (1GB) DirectX: Version 9.0c Storage: 1600 MB available space",
    "recommended_requirements": "OS: Windows 7/8/10 Processor: Intel Core i5 – 2.4 GHz Memory: 3 GB RAM Graphics: GeForce GT 730 (1Gb) / Radeon R7 A10-7700K DirectX: Version 11 Storage: 1600 MB available space",
    "reviews": [
        {
            "review_text": "I am simple spy working for glorious motherland. Woman was not who she said she was, told me she is running away for love. I say okay, believe her. My family takes care of her. We make wedding veil for her. Her future husband is man who is caring for my sick daughter.  She kills man, leaving my daughter with no help, and laughs in my face. Says I can't prove it was her without revealing I knew she was filthy liar.  So, I buy illegal item and plant it in her apartment, then report illegal item. Cops come, and woman is sent to jail to rot for dooming my child.   Don't ♥♥♥♥ with the landlord.",
            "review_score": "1"
        },
        {
            "review_text": "'Neighbours from Hell' from hell. Joking:)  Cool depressing experience. Everybody suffers and dies, so much fun! Something like 'This War of Mine' + 'Papers Please' but more cozy (ha-ha) and story-driven.",
            "review_score": "1"
        },
        {
            "review_text": "  Beholder  is an outstanding story-driven apartment complex management sim.  A steal for the price, too. I get heavy political overtones that remind me of  Papers, Please . The artwork is fantastic - tons of little details that just make a great atmosphere to build a story with. I do have a couple complaints about some QoL things that could be simple fixes, which I'll address below. Overall, this is a must-have title.   Essentially, you are managing the apartment complex to keep your family in the green.  This often forces you, the player, to make shady decisions to earn money. It may mean stealing tenants stuff to hawk. It may mean blackmailing tenants for a cool grand. Things like this. The dwellers feel  really  alive, and well developed. The story is engaging and propels things forward nicely. When I play it, it makes me feel like the community I am managing is alive and bustling with all kinds of things going on. One thing you definately need to know is that this game is linear. There is no randomized sandbox mode where you can try to go forever. It's not a bad thing at all, but just know this is truly story-driven.  It would have been nice to have controller support, but you only really need the mouse to play (keyboard can be used, but is not mandatory). It is also apparent that the writer was not a native English speaker, either. It's fine, but makes for a few awkward moments.    Pros:  +Does a fantastic job of simulating a real community; everyone has their own storyline and quirks and problems +Artwork is outstanding +There is definately some complexity, which is always welcome with a management sim +Definately addicting   Cons:  -Some QoL tweaks should be made, such as not having to fill in all the profile details each time you want to amend a dwellers profile report -Controller support would be very welcome -I wish you could click on the walls (and not just the floor) to move the character -You should be able to click on either side of a door to interact with it -It definately needs a sandbox mode with random encounters, where you could theoretically play forever   Well worth full price.  You could get 10 hours out of this easy cheesy.",
            "review_score": "1"
        },
        {
            "review_text": "This game is actually pretty good in all honesty, I get a constant overfeeling of oppression (exactly the same feeling I get in say Papers, Please). The game does offer you so many options to forward the story in the way you feel is right, giving the option to be good at the cost of yourself and your family, or being bad to benefit them.  Overall, I think it's quite a neat game and it's well worth a try; however one thing I believe would be a nice feature would be free-play mode where random stories appear and you're not just progressing one mayor story.",
            "review_score": "1"
        },
        {
            "review_text": "Honest opinion about the game: The game has a decent amount of time to offer, though short still has a decent gameplay to it. Does have more than one ending to it, have seen them. Just requires your mind to think a little more than it is used to doing. Might require you to jump back on some quest to redo it over with a different decision, but overall i like the game and would recommend to friends who are into this kind of game as well. Only thing i would say is to add more content to the game, for more of an extensive gameplay action.",
            "review_score": "1"
        },
        {
            "review_text": "EDIT: UPDATE: I changed my review from positive to negative. Below this comment you can find my old review. The game is too difficult, the first two or three times you try, you won't be able to save your family. This annoyed me.. but I thought about it and released the game would be too easy then...  So this morning I gave it a different try, and tried a different approach, focus on my family, above anything else... (I tried to help others first). Now without problem I saved both my daugther and son! So I want to apologize for the bad review. This game is very addiciting. This morning I felt annoyed that I wanted to play the game again... because I also found it too difficult... It is actually a great game!!  +++ Recommend!          The game is too difficult, and not in a fun way.  I will try not to post real spoilers..  Basically.. most players want to protect their family in this game, but it's not possible without alot of trial and error. Just casually playing the game and thinking about decisions will always lead to the deaths of your entire family. Many people have this problem and the developer just says 'yes it is possible but ....' and he gives a bunch of reasons which basically say: Reload alot, try alot of different options. Sell the spying cameras... (while the idea of the game is to use them for spying). It is just not fun like this.  I also read they are considering to add new difficulty levels.. I won't play anymore until they add it.  This game has alot of potential, but I am kinda dissapointed I wasted 10 hours on it.",
            "review_score": "1"
        },
        {
            "review_text": "First time on steam bought something has Chinese audio, cool (第一次见到全中文音频的游戏，感觉还不不错)",
            "review_score": "1"
        },
        {
            "review_text": "I dont know whats going on between developer and other seller(s), but stolen key giving to us as giveaway are illegal and shady practice. Thank you developer of this game for new key, i dont know what to say. I hope you guys in a good health. You got so much trouble dealing with us right now.",
            "review_score": "1"
        },
        {
            "review_text": "A very interesting concept. Love history and seems like a very Stalin-era Russia setting. Nice graphics. Lots of different outcomes. One decision can make a big difference. Only completed it once but had a fair few failed attempts. Definitely worth ten euro.",
            "review_score": "1"
        },
        {
            "review_text": "-Rebuild apartment for motherland and let someone move in -That person gives me an offer so if I sell the canned fish they give me and give them 3000 I can have the rest -Give canned fish for buisnessman and he says to wait, so I do -Buisnessman comes back and gives me 1500, I can't even pay the person back -Go to person and talk -Get given the option to flip them off since they are being a total ♥♥♥♥♥♥ -Flip them off -Promptly get shot and killed by that person -End credits roll -Turns out none of my family live and all of them die after a year   10/10 got killed for giving the bird to a person who really needed it ",
            "review_score": "1"
        },
        {
            "review_text": "This game is so fun sorry thats all i can say XD",
            "review_score": "1"
        },
        {
            "review_text": "I played the beta of this and the final release seems to be much more polished, only played a short amount so far but looking to truly explore this game. Very atmospheric and tense at times as you avoid being caught by tenants as you spy on them.          YouTube™ Video:  Beholder Ep1 - Filthy Criminal in Apartment 2&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun",
            "review_score": "1"
        },
        {
            "review_text": "you are not evil, at least that is what you think of yourself",
            "review_score": "1"
        },
        {
            "review_text": "Blackmail? Why would I ever need to do that?  'Your daughter will die in 4 days without a $20000 treatment.'  ...oh. That's why.",
            "review_score": "1"
        },
        {
            "review_text": "Reformed Papers, please!",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun",
            "review_score": "1"
        },
        {
            "review_text": "At the moment I have only put about 2 hours into the game so keep that in mind.   (I'm about 6 hrs into the game now and its got me hooked.)  Cons- *The tutorial could be better. It doesn't really explain blackmailing tenants along with some other gameplay features. This isn't a huge deal since you can figure out how the finer points of the game work yourself. It's an overall con though because your more important directives are time sensetive, and wasting valuble time trying to learn how to properly use some of the games mechanics is counter productive.   *Replayability is a concern. I don't have a ton of time in the game yet but I see how it might start to get repetitive very quickly. I will have to get back to you on that to be sure though.  Pros- *Its subjective, but I really like the art and concept for Beholder. It's a fairly basic strat/management game, but it's presented in a very intresting way.  *The game while seemingly repetitive is really addicting to me. (For now anyways.)  Personally I hadn't expected much from this game, but the concept really caught my eye and I've been looking for a cheaper game to tide me over while I wait for some of the more expensive games I have my eye on to go on sale this coming holiday season. I believe even at full price ($10 which is what I payed) The game was definetly worth it for what I wanted out of it. If you think you might like the game, but don't have to have it now just wait for a sale. Most importantly your best asset in deciding if a game or any product is worth your money is you. Read/watch other reviews, and watch gameplay to see for yourself if it's worth your time and money.",
            "review_score": "1"
        },
        {
            "review_text": "i dont really write reviews but if you are reading this you need to know this game is worth a buy unless you really dont like repitition. I myself love replaying things till i get it right. Ive just recently finished a 'successful' run. In which everyone in the country is enslaved, war goes on BUT my family is alive! Also my son is a robot now. I found myself replaying over and over till I got a run where my daughter and son both lived. Took me a while but I did it. The reason why i say dont play this if you dont like repition is because if you want to get specific outcomes such as saving your family, NOT enslaving the country or perhaps stopping war you are going to have to restart.. a lot. Thats the only bad thing ive found about the game everything else is wonderful. a tip:   You can take the sailor guys quest, sell the cans to the shop guy and then catch the sailor guy for imported soda so he doesnt demand payment from you and also you get 3 future illegal items from his items: jeans, foreign music and salt (salt doesnt become illegal for a while)  ",
            "review_score": "1"
        },
        {
            "review_text": "Nevermind this game published by Alawar, it's still beatuifull in almost all aspects (excluding sounds)!  Dystopia - 10/10 (Soundtrack/Setting/UI/Art style) Looks like guys who made it knows what is proletarian dictarship. ;)  Plot/Storyline - 8/10 Common story, but make you empathize to characters. ",
            "review_score": "1"
        },
        {
            "review_text": "its a fun game if you're smart, choices really matter but you die a lot",
            "review_score": "1"
        },
        {
            "review_text": "I'm still trying to complete it but I love it! You always have somthing to look for, if you want to keep up with the game. They are so many thing to see, so many possibilities. But after sometime, you feel a bit restricted... You spy and you see a lot, but you can't do a lot. Same, it's a good game where any act can eventually result in life or death",
            "review_score": "1"
        },
        {
            "review_text": "Great game to play.",
            "review_score": "1"
        },
        {
            "review_text": "after playing this game after the 10th of getting myself killed I realised that this game might just be more difficult to beat than dark souls",
            "review_score": "1"
        },
        {
            "review_text": "First, if you’d like to see some gameplay footage, check out my video here:         YouTube™ Video:  Suspicious Blobs // Beholder&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Imagine Papers Please but from the standpoint of someone further into the city than the border guard. You manage an apartment in clearly-not-soviet-Russia-istan and work with the Government to spy on the citizens in your building all the while managing life with your wife, teenage boy and young daughter. You spy using cameras and by peeping through windows for any illegal or noteworthy activity to either profile or report your tennants. It's absorbing to say the least, as you patiently wait, watching your newly moved in tennant through a peephole, waiting for them to leave so you can ransack their appartment for information and good stuff to steal and then re-sell, cause ♥♥♥♥ it dude, I gotta get your rent money somehow.   I must say that this game is rather hard. *SPOILER for anyone who wants to play the game without knowing any parts of the story.* So early on your daughter gets sick and you have to pay a hefty sum of twenty grand to pay for her medicine plus I believe an extra 15 for more meds. All the while your ♥♥♥♥ son wants to go abroad or run away with some random woman, asking for the same amount to do so.",
            "review_score": "1"
        },
        {
            "review_text": "Papers Please meets This War of Mine, cool short game that's worth the price. Being a landlord is a more than satisfying experience, especially from an oppressive regime 1984 style of setting. Hard to make the choice between staying loyal to the government and working with the militia to rise up against the powers that be. All the while trying to keep your family alive. Check it out, a lot of fun.",
            "review_score": "1"
        },
        {
            "review_text": "have no clue how to play this game. no information given yet you figured out until the last mins or so. Thumb Up",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game! Simply overwhelming.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome little game if you like to be a dystopian villain. Which most of us do xD  It plays very smooth and has a great atmosphere,  my advice in starting is just to try things and see what gets you killed.  Because being murdered by your tenants is a very real possibillity, 100% for me but i do enjoy being a c*nt.",
            "review_score": "1"
        },
        {
            "review_text": "  Interesting little game about anti-utopian householder, whos main task is to spy on people and report them to the police. You will certainly love this game if you like books written by Kafka and Orwell, since this game has strong kafkaesque atmosphere. Generally this game is must-play for every anti-utopian fan.",
            "review_score": "1"
        },
        {
            "review_text": "I played this game 3 times so far and still cannot pass the second assignment.. I don't know if it is a glitch but I think I tried everything (clicking randomnly included).  I made a short video of me trying to play the game. Hope it's useful          YouTube™ Video:  You can't keep secrets from ME! - playing Beholder&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "I came to this game thinking it would be an epic James_Bond-like spy game. And lemme tell you it is but it's qualities lie somewhere else - morality.   You can either choose to be a govermental spy in a dystopian dictature, that's going to report every little mistake like sobbing or reading. Or you can be a revolutionary trying to overthrow the goverment, but put yourself and your family at risk. There really is a ton of choices.   Though be warned this game can be deceivingly sad, and some choices have unforseen consenquences...",
            "review_score": "1"
        },
        {
            "review_text": "Very hard to save everyone. This is not a game you can play the 'nice guy'. You have to be evil to save your family.",
            "review_score": "1"
        },
        {
            "review_text": "too cruel to me cuz i actually live in socialist country",
            "review_score": "1"
        },
        {
            "review_text": "This game, just blow my mind.",
            "review_score": "1"
        },
        {
            "review_text": "I was watching the game trailer and was instantly pulled by its interesting set-up (I am a fun of George Orwell's books). After a few hours of game play, I realized that the game is not really about you making your own choices, but about how you can follow what the game designer wants you to do. For instance, plot will not move on unless you fulfill certain tenant's request which you might not want to. Anyways, I finish the game in off-line mode in just about 5 hours. Somewhat in the middle of the plot it becomes very clear how you should proceed. Less strategic than I have expected. You might consider buying it if you really run out of good strategic games.",
            "review_score": "-1"
        },
        {
            "review_text": "I cannot tell if this game was supposed to be challenging and unforgiving, or if it is simply broken. The motto for the game is 'Every choice has consequences,' but you'll find absolutely zero freedom in making these choices. Gameplay consists of executing tasks assigned to you by the government and by your house tenants. There is no way for you to know what the consequences will be until you are *forced* to play through the game several times. (You know how everyone just LOVES replaying the same boring dialogue over and over in games? Well, get ready to do it about a dozen times.) You'll devote hours to a playthrough, only to get caught in a loop where your character inevitably gets overcharged for a completely random fee and gets fired. When you reload, this will happen over and over again until you finally resolve to just start the entire game over. The game forces you to do this until you make the 'correct' choices, at which point I assume you feel the same level of satisfaction one feels upon completing a standardized test. While the idea behind this game is brilliant, this has got to be the least fun execution one could imagine.   In short, if you want to experience what it must feel like to be a bureacrat in an Orwellian police state, this game will browbeat you into submission until you forget your own free will.",
            "review_score": "-1"
        },
        {
            "review_text": "No 'send report' button ever appeared: imposible to play.",
            "review_score": "-1"
        },
        {
            "review_text": "I think that the game still need more work, it looks promising but need more stuff, functions and a proper tutorial, not the loadscreems advices. The game need more spyonage tools, like microphones and your should get info or hints of profiling the people. Also if you get a weapon, why cant you defend youself? Also the interface is awful. I cant remember the number of times that i could click on the right place or why there is no key to pause the game? You have only the click button. Wait until more content being added to buy it or wait until be at 5 euros or so",
            "review_score": "-1"
        },
        {
            "review_text": "Good premise I suppose. Personally, I dislike the game so far because it requires too much clicking and planning without being a strategical game, so I can't just relax and let the story unfold. The physical scope of the game is limited to just the apartment complex and its immediate surroundings. Compared to the efforts players have to put into making choices, there are minimal amount of story-telling. Maybe I am just not the right type of people for this sort of game.",
            "review_score": "-1"
        },
        {
            "review_text": "Tries to do something new but fails at it. Becomes repetetive and boring fast...",
            "review_score": "-1"
        },
        {
            "review_text": "JUST EAT ♥♥♥♥ , WHAT THE DAMN OPTIMIZE",
            "review_score": "-1"
        }
    ]
}