{
    "app_id": 4760,
    "name": "Rome: Total War™ - Collection",
    "release_date": "2007-08-28",
    "developer": [
        "CREATIVE ASSEMBLY"
    ],
    "publisher": [
        "SEGA"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Historical",
        "Rome"
    ],
    "achievements": 0,
    "positive_ratings": 7806,
    "negative_ratings": 562,
    "price": 8.99,
    "description": "Control and conquer the greatest empire ever known to man.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/4760/header.jpg?t=1545331556",
    "minimum_requirements": "Microsoft® Windows® 2000/XP, Pentium III 1.0GHz or Athlon 1.0GHz processor or higher, 256MB RAM, 2.9GB of uncompressed free hard disk space (plus 500MB for Windows swap file), 100% DirectX® 9.0c compatible 16-bit sound card and latest drivers, 100% Windows® 2000/XP compatible mouse, keyboard and latest drivers, DirectX® 9.0b, 64MB Hardware Accelerated video card with Shader 1 support and the latest drivers. Must be 100% DirectX® 9.0b compatible, 1024 x 768 Display Resolution, Internet (TCP / IP) play supported;Internet play requires broadband connection and latest drivers; LAN play requires Network card (Multiplayer) Important Note: Some cards may not be compatible with the 3D acceleration features utilized by Medieval II: Total War. Please refer to your hardware manufacturer for 100% DirectX® 9.0b compatibility.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Absolutely amazing game.. If you can get it to work.. For no apparent reason the game won't work on some computers even if the specs are met (I checked) 10/10 game, 1/10 job on Steam's part. Seriously guys, I've looked everywhere on the Steam forums for help and plenty of people have this problem but the steam 'support' team doesn't seem to care.",
            "review_score": "1"
        },
        {
            "review_text": "Rome Total War wasn't opening here, i don't know why, well... I discovered a way to make it happen. Use the window mode configuration '-ne' . This should work. Don't need put any kind of compatibility .  Right-click on the game title under the Library in Steam and select Properties. Under the General tab click the Set launch options... button. Enter the launch options you wish to apply (just write '-ne' without ') and click OK. Close the game's Properties window and launch the game.  Please... Spray the words ^-^",
            "review_score": "1"
        },
        {
            "review_text": "Metacritic rates this a 92. How the hell do you get a 100.",
            "review_score": "1"
        },
        {
            "review_text": "Gauls....I hate Gauls. My father hated Gauls until they killed him....   One of the best Total War games ever made.",
            "review_score": "1"
        },
        {
            "review_text": "Let's start with a confession. When Rome Total War was released I didn't buy it, didn't play it. Turn based sounded boring, I wanted real-time because that was cool. So when did I first play it? After Rome 2 was announced, I wanted to play with the ancient world but release was still months away. Then the release was utter garbage. Thus I turned to Rome Total War.  So lets start with the TL;DR part. Good: The feel of combat. It's not fast, a bit to slow but formations collide.  Good: Size, this game is huge. Large amount of provinces as well as factions. Improvement over Shogun 2, stuck in Japan. Good: Atmosphere, Senate missions as Rome, three seperate factions. Lots of different other factions too. Good: Mods, mods, mods. There some excellent mods out there for this game.  Bad: Graphics, the graphics sure aged. Then again it's an old 3D game, they rarely age well. Bad: AI, AI isn't the smartest. The game is easily gamed, then again newer Total War's still are. Bad: Egypt. Egypt was greek at the time, not pharaohs, well not styled like the rulers of old. Just graphics but I'll mention it anyway. Bad: Resolution, no real widescreen support and no 1080p at all. Highest I can get is 1600x1400.  So should I still get it? Well it's different for sure. I got into it after I played Medieval 2, Empire, Shogun 2 and Fall of the Samurai. I could make the journey back and was pleasantly suprised. On the other hand my main gaming PC wasn't very available at the time and I played mostly on a laptop. So older games was something I was stuck with either way.  Give it a shot if you like ancient history, a slower strategy game and long battles. If you like historical accuraccy give Europa Barborium a spin. From a pure gameplay perspective it has an overwhelming amount of units, recruitment, moving and battles take ages but it's sure authentic.  This is a great game, it has aged but not to much. It's deep but not to deep and I'm sort of sad the path Total War games have been taken lately. Still we can go back to this and I recommend you do that.",
            "review_score": "1"
        },
        {
            "review_text": "Still one of the most amazing and in-depth games I've ever played.",
            "review_score": "1"
        },
        {
            "review_text": "Great and classic strategy game. It feels good taking out 400 soldiers with only 150 soldiers.",
            "review_score": "1"
        },
        {
            "review_text": "This is amazing, second best TW imo.  Barbarian Invasion is like a rome 1 version of TW: Attila and Alexander is very challenging and hard to kick off.",
            "review_score": "1"
        },
        {
            "review_text": "First strategy game I ever played. I remember seeing the old battles on the history channel I think. One for Thermopalae they used this game. I got interested and eventually I bought the game and I still play it today.",
            "review_score": "1"
        },
        {
            "review_text": "To anyone who is a history buff or likes RTS, this is a great game. It's older, so it doesn't boast near the graphics or the features, but it's still a classic with plenty of replay value. You also don't need a ton of processing power to run it. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "By Far the BEST Total War Game in the series! and completely Moddable unlike Empire and after...",
            "review_score": "1"
        },
        {
            "review_text": "killed 3000 troops with 100 horses.....       IGN 9000/11",
            "review_score": "1"
        },
        {
            "review_text": "great g ame to recreate the roman expereince also good mods incluidng  end of days 1: fight satanic legions as christian, islamic, or buddhist nations end of days 2: reunite vampire empire or rebel as werewolf or purify the world as templar order crusader  blue lotus: ancient chinese mythology with great soundtrack if you ever s aw the movie 'big trouble in little china' you will love this mod  roma sur♥♥♥♥♥♥ 2: improves expereince of real life history  fourth age: lord of the rings post return of the king very cool!  lord of the rings: play as the ending of the third age, fight sauron or darkness conquer world.   viking invasion 2: raid british isles as viking or defend it as the natives  all in all 10/10 especially with mods im very proud  ",
            "review_score": "1"
        },
        {
            "review_text": "[9.1/10]  Way much better than any other great strategy games that had come out in 2004 ! It's huge, thrilling, epic. takes strategy into a whole new level. ",
            "review_score": "1"
        },
        {
            "review_text": "Game is good for people new to total war , Pretty good overall just old . First time is a little confusing and you only start with limited Factions but you unlock more as you conquer other factions and High advice helps .",
            "review_score": "1"
        },
        {
            "review_text": "Continues to be up there with the best Total Wars despite its age. I would highly recommend getting it, especially with its current price tag.",
            "review_score": "1"
        },
        {
            "review_text": "As the user-defined tags suggest this is a historical strategy game. The overworld campaign is a turn-based grand strategy- sort of a simplified Civilization. The battles are mostly real time, with a toggle for 2x or 3x, so I guess it could be argued there is a 4x element to the battle.  The campaign takes a long time to finish, but it is good training if you want to play multiplayer. There are some troops that don't seem to be very good relative to their costs- I'm thinking the Arcanii (why only 16????????!!!!!!!!!!), but for the most part the game seems pretty balanced.  The biggest downside for me was the fact that this game crashes every 4th or 5th battle, and I hear I am not the only person who has this problem. The public order system can also be wonky- I lost a settlement to a gladiator revolt, then recaptured it and two turns later there was another gladiator revolt with the exact same amount of gladiators.   Overall, I would strongly reccomend this game if you like the idea of massive battles, tactical thinking, or time consuming strategic considerations. I know I loved it.  ",
            "review_score": "1"
        },
        {
            "review_text": "Still better then Rome 2.",
            "review_score": "1"
        },
        {
            "review_text": "When I used to own this on disk form, this was my childhood game, every weekend I would spend hours on the campaign and custom battles. Ah memories of murdering Rome's enemies. On a more serious note though, I really cannot find a reason for you not to buy this game, it's so wonderful. Remove the age of the game and the more primitive graphics (like I said though, it's an old game and for it's time it looks amazing) and there really are no downsides to this game in my opinion, but I am a massive fan of the Total War series so I may be biast, so just see for yourself!",
            "review_score": "1"
        },
        {
            "review_text": "Great game ... nicely made ... but with lot of non historical ♥♥♥♥♥♥♥t and few things which will make you angry everytime you play. But still if you want to create empire of Britons through the whole Europe ... riding over your enemies on the war chariots or smashing Testudos with rampaging war elephants this is really game to make your dreams come true.",
            "review_score": "1"
        },
        {
            "review_text": "Have played Rome: total war every now and then since 2004. Just finished my latest 20-hour campaign in the game, so this is without doubt playable even as in 2016 there are more modern total war games available. Didn't experience a single crash while playing (windows 7).  Rome has some some issues: archers are undoubtedly underpowered, whole army can rout within seconds after the fight begins, senate's missions are sometimes nosense, AI can't handle siege battles, AI campaign logic is from USSR, etc.  When Rome was released in 2004 it was a solid 10/10, something that haven't seen before. You can greatly improve the main game with wide variety of mods. When played today you can see the flaws, but still want to play just one more turn.  10 - Perfect game 9 - Excelent game, best of the genre  8 - Good game, worth your time",
            "review_score": "1"
        },
        {
            "review_text": "Best Total war game so far.  Wish they didn't ♥♥♥♥ up RTW2 and made it the same as RTW.",
            "review_score": "1"
        },
        {
            "review_text": "The best strategy game on PC.",
            "review_score": "1"
        },
        {
            "review_text": "Even today, Rome: Total War takes the cake as the best Total War title. If nothing else sells you, it is important to note that this game almost NEVER crashes. For those of you new to the Total War series, Total War games love to crash, ruining your hours of hard, strategic work and luck.  Rome is extremely well balanced. Territory development, troop training, technology advances, political maneuvers, unit types...it all works together to make a deep, strategic game with no room to blame broken mechanics.  You pick a house of Rome and start conquering things. Many of the problems that the Roman Empire faced are now obstacles for you to crush. You can spend hours getting sucked into this world and attempting to achieve perfection. Each hour is worth it. Learn lessons, get defeated, try again. The true spirit of combat.",
            "review_score": "1"
        },
        {
            "review_text": "You can create an army of dogs and elephants, as well as set pigs on fire.  Ancient Rome was a crazy place.",
            "review_score": "1"
        },
        {
            "review_text": "It's an old game but it's also a brilliant game I love it it was my fisrt PC strategy game and without a doubt my favourite strategy game and because my computer is high spec it is great it runs better than Rome 2. Which is why I prefer it to Rome 2.  I would recomend this to Anybody who loves strategy games as they are SURE to Love it!!!",
            "review_score": "1"
        },
        {
            "review_text": "I played this game right after 'Empire Total War' and I'm glad I did. One of the best entries in the Total War series. Very addictive. Once you conquer your first city there's no going back. Even though the graphics might be concidered out-dated, it's still gives you an amazing gameplay (which in my opinion is as important as looking good) Extremely recommend even if you own and played Rome II Total War.  1000/10",
            "review_score": "1"
        },
        {
            "review_text": "More expensive than bundle. 8/8.",
            "review_score": "1"
        },
        {
            "review_text": "One of the greatest strategy games of all time and probably the best in the Total War franchise. Challenging and a really exciting view of the battlefield are some of the good points of the game although I still find the game a bit long and frustrating sometimes. But, play this game and you'll understand why people are so disapointed with Rome: Total War 2. Rome 2 failed to live up to this game.",
            "review_score": "1"
        },
        {
            "review_text": "i enjoy this game , but i would really like Rome Total War 3 , to revert back too rome total war , with more armiess better maps , . This game is a very good template to create the best game ever , .. Rome total war 2 , was rushed out its all about the videos cinema effects. Game play is ok , but its not good.",
            "review_score": "1"
        },
        {
            "review_text": "The best Total War game.",
            "review_score": "1"
        },
        {
            "review_text": "The Greatest!",
            "review_score": "1"
        },
        {
            "review_text": "Got this when it was 1 dollar and probably the best 1 dollar spent. Never thought this game would be so good. Still am enjoying the battle mechanics and I feel like I am on a big board of Risk. Great game!",
            "review_score": "1"
        },
        {
            "review_text": "Old but gold :)",
            "review_score": "1"
        },
        {
            "review_text": "Best total war, lots of customization, long game, good multiplayer (would've liked co-op or mp in story mode though, atleast for rome 2)",
            "review_score": "1"
        },
        {
            "review_text": "Rome Total War is a classic strategy game with lots of great mods giving it untold hours of superb strategic gameplay. A must play for any strategy and or history fan.          YouTube™ Video:  Rome Total War Gameplay&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Best rome total war i played yet :D",
            "review_score": "1"
        },
        {
            "review_text": "Rome: Total War was my first Total War game. Due to this game I fell in love with the rest of Total War series. Even though the game may be outdated, the gameplay is still great. Rome: Total War is a top class strategy game. One can control various nation during the rise (or fall, depends on which faction you play) of the Roman empire. I personally enjoyed the combination of city managing and real time battles. I have spent countless hours (don't be misled be my current hours, I have played Rome: Total War long before I bought it on Steam) on Rome: Total War. Who wouldn't want to be like Caesar? If you like strategy games, this is the game for you. The graphics may be outdated, but the gameplay is still solid. In conclusion, I rate this game a 89,89/100.  Yes, I can be that specific.  With kind regards, Your new Roman oppressor",
            "review_score": "1"
        },
        {
            "review_text": "  Old but good!",
            "review_score": "1"
        },
        {
            "review_text": "a very good game 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Much better than Rome 2222222222222222222222222222222222222222222222222222222!",
            "review_score": "1"
        },
        {
            "review_text": "YOU WANT ACTION? YOU WANT STRATEGY? YOU WANT GIGANTIC ROMANTIC BATTLES WHOSE SCALE RIVALS THAT OF YOUR MOTHER? WELL SIT THE ♥♥♥♥ DOWN AND SHUT YOUR ♥♥♥♥♥♥♥ MOUTH, SALLY MAE! BECAUSE THIS IS THE ♥♥♥♥ING GAME FOR YOU!  YOU CAN PLAY AS THE RED XENOPHOBIC ♥♥♥♥♥♥, THE BLUE XENOPHOBIC ♥♥♥♥♥♥, OR THE GREEN XENOPHOBIC ♥♥♥♥♥♥ IN THEIR QUEST TO DOMINATE EVERYONE THAT ISN'T A GLORIOUS PROGENITOR OF ROMULUS! WITNESS AS YOU CAN ♥♥♥♥ YOUR WIFE AND HAVE HER ♥♥♥♥ OUT SOME CROTCH-FRUIT TO RULE YOUR EMPIRE WHEN YOU BECOME A ♥♥♥♥ING WHITHERED OLD HUSK OF AN OLD MAN AND DIE! TREMBLE AS YOUR ARMIES FACE DOWN HORRIFYING BROWN PEOPLE ON TOP OF ♥♥♥♥ING ELEPHANTS! AND LEARN TO ♥♥♥♥ING MANAGE YOUR CITIES OR YOUR INCOMPETANT INBRED NEPHEW WILL ♥♥♥♥ OVER THE ENTIRE EASTERN PROVINCE BECAUSE HE COULDN'T KEEP HIS HANDS OFF THE LADYBOYS!  JUST PLAY THIS ♥♥♥♥ ALREADY ♥♥♥♥♥♥♥  I nominated this game for The 'Test of Time' award because it deserves it. Absolutely deserves it.",
            "review_score": "1"
        },
        {
            "review_text": "Rome: Total War is beginning to show its age, but even 10 years after release it is still one of the best strategy games based in ancient Rome, and is probably the closest you can come to conquering and ruling the known world as a Roman emperor. Large-scale battles, spectacular sieges, trade, diplomacy, assassination - Rome has it all. The greatest, and possibly only, weakness is the dumb AI, which has trouble applying any tactics outside of a head-on assault.",
            "review_score": "1"
        },
        {
            "review_text": "Best game I've played in a long time. I have played this game well before I even knew what steam was.",
            "review_score": "1"
        },
        {
            "review_text": "Best game in the world Rome 2 is better so if rome total war is the best than rome 2 is better than the best GET THIS GAME DO GET PICK SOMETHING ELESE PICK THIS DOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOO IT",
            "review_score": "1"
        },
        {
            "review_text": "Played this game back in the day. Even now it still is fun and satisfying. If you haven't played any Total War games this game would be a good place to get a taste of the series.",
            "review_score": "1"
        },
        {
            "review_text": "Hi, as you can see I have about 70+ hours on this game. It is really good and doesn't lag. The campaign is okay and the multiplayer is awesome. Also barbarian invasion has a really good campaign.",
            "review_score": "1"
        },
        {
            "review_text": "This game satisfies my needs...",
            "review_score": "1"
        },
        {
            "review_text": "Ohohoho. Nothing feels better than leading your legions against others. Those moments when you have your cities contributing 500 men each round..... You realize.... This... This is what war is..... You sit there knowing that these deaths are the price of a war. We rise with noble intentions, and yet we risk all that is pure. We are only as great as our hearts will allow us..... What awaits us?     +500 friend points if you get my referance :3",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing, that simply said. Yeah I understand, it's almost ten years old, but when did graphics ever matter? What it lacks in that department it makes up for in gameplay and sheer depth, and I don't know if you'll agree with me on this one, but is it just me that's thinking the Total War games are losing their charm with every new realese? I mean, you saw Empire, and sure, CA had the excuse of a new engine, but then they realesed that absolute mess that was Rome II (and I always thought the sequels were supposed to be better) I was appalled at what I was seeing, and henceforth opted never to purchase it.  Rome I is (in my opinion)   the   greatest Total War game made, and one of the best strategy games I've ever played. The amount of detail that CA put into the game is incredible, and better still, installing DarthMod to your game ever more makes the playing experience one to remember. Sure, the A.I is ♥♥♥♥ing horrible, but that never bothered me (just made Rome easier to capture). I can remember once, I had a small force of perhaps five-hundred professional, highly trained and disciplined Legionaries with me, to defend against an army of over three-thousand mindless barbarians. It was these battles that made the game so enjoyable, the sheer tension in the middle of a pitched battle, when neither side show signs of winning, is it going to be yours? Or the enemy's? And aside from the few small skirmishes between armies, when you give your opponent time to assemble a massive force, and you ride out to meet that force with your own, it's a ♥♥♥♥ing bloodbath (serious, the amount of corpses left on the sand was immense). As I've mentioned before, the battles are intense, oh, and, did I mention that the battles were intense?  With the expansions being 'Alexander' and 'Barbarian Invasion', these further build upon the gameplay. Offering you to play as the young Greek King as he forges his mighty path of blood and conquest against the Persians for control. Or giving you the chance to save the crumbling Roman Empire in a last attempt to drive out the hordes of invading Huns and Goths, and several other European barbarian tribes.   I myself, never played much of the Alexander expansion, I've only sunk as little as a few hours into it. As for Barbarian Invasion however, that, that is a completely different story. I thoroughly enjoyed this expansion to the already great game.   That said. Rome I is a great game, one I have played for hours on end, and was never bored with it.  I give this game a 9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Played since 2003, fav is Empire followd close behind with every Total war games thats out.",
            "review_score": "1"
        },
        {
            "review_text": "One of the greatest Strategy games of all time.",
            "review_score": "1"
        },
        {
            "review_text": "trust me when i say this is one of the greatest strategy games of all time. worth more than 10 bucks in my opinion",
            "review_score": "1"
        },
        {
            "review_text": "+",
            "review_score": "1"
        },
        {
            "review_text": "One of if not the best total war game",
            "review_score": "1"
        },
        {
            "review_text": "This game... This game...  This game...  Is it a good one? yes. Is it a good total war? the best one IMO Is it worth your time and money? No cuz forget what i just said above.",
            "review_score": "1"
        },
        {
            "review_text": "A wonderful reminder of *why* people wanted Rome 2. Because of Rome 1. (Even if Rome 2 wasn't that great.)",
            "review_score": "1"
        },
        {
            "review_text": "I spend a majority of my strategy gaming with two games: Rome: Total War and Civilization V (I have maybe 250+ hours offline in RTW). Why do I mention this? Because I have to say that while Civ V is a better game (though not by much), I have never found a game more masterfully put together than Rome: Total War. You might be the nicest person ever, but by the end of a campaign you might as well be ranked as the world's #1 sociopath, for you will be driven to crush every rebellion and consolidate the world under the mighty grip of your imperium. The aesthetic, feel, music, all for the glory of arguably the greatest empire ever created is emulated to absolute perfection.  And that's 10 YEARS after the game has been released. The most epic, enthralling, massive strategy game you'll ever get your hands on.  Only issues involve possible compatibility problems. Other than that, you're paying $10 for hundreds of hours of triumphant conquest. An absolute must buy.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game Great Graphics  but a bit retroish but thats cool :)",
            "review_score": "1"
        },
        {
            "review_text": "294/294",
            "review_score": "1"
        },
        {
            "review_text": "By far the game that has stuck with me the longest. I've been playing this game for ten years now and each campain is amazing. Great replay value. The combat engine is the best out of any Total War game imo. It's diplomacy is nearly completely useless, where any nation that borders you will sooner or later attack you, no matter what. But other than that this game is by far my favorite.",
            "review_score": "1"
        },
        {
            "review_text": "GREAT COOL GAME",
            "review_score": "1"
        },
        {
            "review_text": "Good game it is very cool one too",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game love the transition between real time and Epic RTS Definetlly recomend.",
            "review_score": "1"
        },
        {
            "review_text": "This game never seems to get old. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best entry in the Total War series, Rome is where for many it all began. It would be difficult to overstate the hours of time that this game will eat up, as you conquer Europe as one of the three Roman factions or rewrite history by creating a sprawling and prosperous barbarian state from the Balkans to the Iberian peninsula.   It's still a remarkably pretty game, and although the unit geometry is a bit angular when zoomed in it holds its own in creating an attractive world, with none of the over-sharpness that is plaguing the later games in the Total War series. There are frustrations though, especially with large unit sizes causing major pathfinding errors in siege battles.  If you somehow haven't played it yet then it's a must-buy. Cross that Rubicon and you won't regret it.",
            "review_score": "1"
        },
        {
            "review_text": "This game allows one too experience what it must have been like too be an ancient general. The AI is beautiful and the expansions are well thought out.",
            "review_score": "1"
        },
        {
            "review_text": "Easily the best game of the Total War franchise. I reccomend getting either of the expansions for this game so that you can get these awesome mods for it. Ex: Third Age Total War, Rise of Persia, Troy: Total War. If you like strategy in any shape or form, you HAVE to get this game.  10/10 would conquer again :)",
            "review_score": "1"
        },
        {
            "review_text": "I came, I saw, I conquered!  Played it since my teen years, bought and played it again. Choose a Roman family, rise in status, fight barbarians, and seize power in Rome herself. Or you could be a barbarian heathen. Easily one of my favorite games in the series and one of the best RTS games of all time.   The only problem perhaps is the autoresolve battle AI seems to leave a lot to be desired. However; if you wanted a turn based game I recommend The Republic of Rome Tabletop game (playable by your lonesome but better with friends you aren't afraid to lose) or your favorite Civilization. The Historical inaccuracy of certain aspects is also fairly blatant but it is forgiven due to the game being more about cinematic sword and sandal warfare than a rough simulation of historical events for that I recommend something by Paradox Interactive.  The game's strenghts lie in it's great battle system and it's fascinating overworld of intrigue. If you want a hardcore tactics game it can be that but there is also an arcade mode for people who just want to watch the sword fights but do not wish to get heavily involved in tactical movement.  This is a game I could recommend for anyone with even a passing interest in this period in history. The phoenicians are waiting to meet you on the field of battle.",
            "review_score": "1"
        },
        {
            "review_text": "'Few men are born brave, many become so through training and force of discipline.'  - Vegetius  This must be why the Gauls always rout when they see my men running towards them.  'Rome doesn't need unwashed barbarians at her gates!'  -Flavious Julius  Yet I keep seeing them there...",
            "review_score": "1"
        },
        {
            "review_text": "LOVE IT",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "A wonderful reminder of *why* people wanted Rome 2. Because of Rome 1. (Even if Rome 2 wasn't that great.)",
            "review_score": "1"
        },
        {
            "review_text": "A must have for the strategy gamer! Total War is a great strategy game series!",
            "review_score": "1"
        },
        {
            "review_text": "A must have for the strategy gamer! Total War is a great strategy game series!",
            "review_score": "1"
        },
        {
            "review_text": "Best Stratagy Game Ever, Period. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Best game in the Total war series, this game is still one of the best in its genre after being released in 2004, thats how you know this game is absolutely brilliant.",
            "review_score": "1"
        },
        {
            "review_text": "Best RTS that isn't an RTS ever.",
            "review_score": "1"
        },
        {
            "review_text": "rome total war is one of the best total war games out there i have over 750HR and still play it today buy this game if you do not own it. it is a must own. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "10X better than any other total war game ",
            "review_score": "1"
        },
        {
            "review_text": "This is still the best Total War game uit here. It is not CPU nor GPU intensive so anyone can run it, and it has by far the best strategic option. I really recommend Darth Mod V9.0.1 as the map size is almost doubled! Rome has very good unit, but i think that the Spartans are the strongest (rightfull, thouh) This game is certainly worth 4€ and if you worry about graphics, they aren't great for sure, but perfect for the genre and not too intensive so playable for more people than ROME II. I recommend this version above Total War Rome II.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game with death and agony all around. Haven't spent too many hours on it, but hopefully I'll put more time in the future. So many ways to build your armies. Do you want peasants to flank your Elephants? Go for it! You'll probably die, but it'll be fun! One small problem is that some factions are a bit unbalanced compared to other ones.   One thing to note though: Spartans are OP.",
            "review_score": "1"
        },
        {
            "review_text": "Must get for any turn-based/rts game lover. Even though it is dated, it still competes its own sequel. The feeling of leading and working with the soldiers shows the true importance of tactics and strategy over just clashing swords with no thinking. The only big flaw with this game is the outdated optimization. Ayy no dual/quadcore optimization",
            "review_score": "1"
        },
        {
            "review_text": "Great game!",
            "review_score": "1"
        },
        {
            "review_text": "Great game, simple as that.",
            "review_score": "1"
        },
        {
            "review_text": "I bought this then-cutting-edge game back when it was released in 2004. I'd seen it advertised some months before that on a TV series that used its engine wherein two teams competed against each other to win an historical battle. That whetted my appetite enormously. When I bought it, I not only spent countless hours playing but also played its add-ons (Barbarian Invasion and Alexander). To me Rome: Total War was the best of the Total War series - a balance between the old 2D strategy of Medieval: Total War and the increasingly eye-candy iterations that came thereafter (though I think Medieval 2: Total War was also very good). Add to this the fact that Rome has more mods than any other in that series (and with more diversity of setting/theme) and you have a game that is highly replayable. I still dip into it after 11 years of owning it! Rome forums still remain populated after all this time, and mods are still being developed for it. That speaks volumes. I've had the pleasure of being a RTW modder myself which has only added to the great joy this game has brought. Give it a go. You won't regret it.",
            "review_score": "1"
        },
        {
            "review_text": "Hands down the best Total War game to date. it's perfection*  *except the multiplayer never works anymore",
            "review_score": "1"
        },
        {
            "review_text": "wow, just wow. i have been playing this game for 59 hours and i have bearly scratched the surface of this epic game. my favourite total war game to date. love it so much. if you are into rts games, then you will absloutley love this game. it may be a bit daunting at the start if you havent played an rts before, but it doesnt take long before you get engrossed :)",
            "review_score": "1"
        },
        {
            "review_text": "Apart from maybe Shogun 2 this is certainly the pick of the bunch when it comes to overall gameplay.  The was CA back when they really cared and unlike the recent mess that is Rome 2 this is a polished product.  Look in the workshop for some great mods as well.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "i bought all four disks back in the day, including the expansion, for $60. i bought it again. thats a total of $70. still underpriced.   by far the best game in the genre (not including Paradox's games; they're a genre of their own) and is the basis of most total war games to date. once you're bored of the main game, theres many historical battles and countless mods. stop reading this review and click the buy button. now. you know you want to.",
            "review_score": "1"
        },
        {
            "review_text": "Rome Total War 1 is fun.  Best in the series.  The resolution can be a problem for Windows 10 users",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game. It is fully strategic and this is for me my favourite game so far.",
            "review_score": "1"
        },
        {
            "review_text": "So i loved this game When i got it it felt so refreshing.  I’m a huge fan of this setting the Roman Empire really did have some interesting wars and politics going on during its reign and you get to get in the thick of it all.  Now im going to talk about the Total War games a little, if you haven’t played these games and like History and/or Strategy Games be it Real Time or Turn based (this game has the option to play both) then do you're self a favour and pick one of the absolute Gems up and disappear into the world of being a Leader/General.  As for what one to get I would say this is 3rd on my list of Total War games If you own Shogun 2 and Medieval 2 then this is the one to get next.  If you are looking at from I like this time period point of view I would point out Rome 2 is out....but if im honest this is a more solid game despite the Fact that Rome 2 is better Graphically and Mechanically this one is just so much better for many reasons ill mention two of them one being the Bugs and Glitches that infuriate even the most die hard TW fan.  Secondly I would say that Rome 1 has a far superior Interface to Rome 2 its just a lot simpler and easier to use.  I would give this game a 8/10.  Edit - Doing this edit for my 2016 Awards badge",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game. It is fully strategic and this is for me my favourite game so far.",
            "review_score": "1"
        },
        {
            "review_text": "My time playing this game.  -Starts as the Julii -Makes a strong army -Invades the north declares war on Gaul -Gaul counter attacks but fails -Pushes towards west but fails -Gaul ambushes and destroy the main part of my army  -Retreats quickly -Gaul chases the army -Army gets backup and pushes Gaul  -Becomes ally with Briton to fight the Gauls -Briton betrays me and attack with 1277 troops -Backup arrives to retake Patavium from Arretium my capital -Declares war on Briton and pushes them to Luvavum -Macedon declares Thrace my ally -Declare war on Macedon -Attack Macedonian troops on the path to my city -600 romans vs 450 macedons -Macedon wins and damages my army very badly -Backup arrives from Luvavum -Im now fighting a war with 4 fronts -West(Gauls) north and east(Britons) and Southeast(Macedon) -Rebuild my grand army  -Pushes Briton and Macedon -Briton starts guerilla warfare against me -Briton uses a strategy of hit and run which makes Macedon even stronger while I grow weaker -House of Brutii sends help and attacks Macedon from the south and North -Macedon cant fight me for now I have to rebuild my army quickly -Battle of Aemona begins -1000 Romans vs 600 Britons -Reclaims the city -Battle of Alessia begins -1000 Romans vs 500 Britons and 300 Gauls -I win the battle of Alessia making a Roman stronghold in France -Rebels starts fighting me with Macedon -Macedon,Rebels,Briton and Gauls are now fighting me at all sides but south -Gaul now surrounds my Grand army  -Grand army losing numbers every turn  -Gaul does the same strategy as Briton, Guerilla warfare and hit n' run -Army are now fighting at all sides except south -Damage economy,morale,numbers going down and riots at Patavium -Brutii and Scipii comes to help -Ceasefire with Macedon(betray them later c;)  Im still not yet done with this game but its really fun I rate it 10/10 ",
            "review_score": "1"
        },
        {
            "review_text": "Rome total war 9.5/10 just for the nostalgia even",
            "review_score": "1"
        },
        {
            "review_text": "Best game out of the Total War collection.",
            "review_score": "1"
        },
        {
            "review_text": "a gam for autistik horse lords shood b called rome is total horsw lord.  2.43 poptarts",
            "review_score": "1"
        },
        {
            "review_text": "Pagans are much Cooler then the Christians",
            "review_score": "1"
        },
        {
            "review_text": "Addicted, can't stop playing!",
            "review_score": "1"
        },
        {
            "review_text": "10/10 best strategy and funny with friends",
            "review_score": "1"
        },
        {
            "review_text": "still dont know how to play",
            "review_score": "1"
        },
        {
            "review_text": "Better than Rome 2 in Gameplay, lack of playable faction tho.",
            "review_score": "1"
        },
        {
            "review_text": "BEST GAME EVER!!! NEVER PLAYED IT AGAIN! t(T_Tt)",
            "review_score": "1"
        },
        {
            "review_text": "The AI isnt bad, okay graphics, godd mod support, amazing music and just a blast to play   11/10",
            "review_score": "1"
        },
        {
            "review_text": "The original Rome. A historical pinnacle of strategy and tactical gameplay. I sunk thousands of hours into this before Steam introduced the playtime counter in 2009.  Perfection of the past, still a great game today. Replaying it, one can see how far the Total War series has come, and how it never abandoned its roots.",
            "review_score": "1"
        },
        {
            "review_text": "A classic... This does make it a must play? no... simply because there are other total war games with a better gameplay and smarter AI. However, i must say that Rome original is better than Rome2... Simply because, they focused waaay to much on graphics and dumb zoomed in fighting in rome 2...  While this game aint better than shogun 2 or medieval 2... it is better than any other total war and a must for a total war fan. and a classic nonetheless.. It offers much in terms of strategic options and tons of units and factions.... barbarian invasions is still my favorite total war dlc... to the point where, its worth buying this game just for the dlc... yea graphics arent good, but if you are the kind of baddie that likes to zoom in to watch soldiers hit each other... than plz stick to potato games.. with difficulties varying from potato to veryeasy...",
            "review_score": "1"
        },
        {
            "review_text": "Rome: Total War - Legendary Game 9/10 Rome: Total War: Barbarian Invasion - Fantastic game 8/10",
            "review_score": "1"
        },
        {
            "review_text": "My favorite game of all time.",
            "review_score": "1"
        },
        {
            "review_text": "Romans are Racists here",
            "review_score": "1"
        },
        {
            "review_text": "The best total-war game ever made.",
            "review_score": "1"
        },
        {
            "review_text": "Very cool strategy game, one of my favorite Total War™ games for sure.",
            "review_score": "1"
        },
        {
            "review_text": "CA at its finest.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best RTS games of all time.",
            "review_score": "1"
        },
        {
            "review_text": "Its a great game since it was one of the first total war games i played.",
            "review_score": "1"
        },
        {
            "review_text": "Rome Total War combines perfect gameplay between managing resources and fighting on the battlefield commanding your troops. It's emmersive and addicting gameplay combined with a flawless polished game, this makes on top of my best strategy games of all time, and it's still number one on my list!",
            "review_score": "1"
        },
        {
            "review_text": "Exterminated the city of Rome twice as Carthage and then wiped out the Numidians Egyptians Spanish and Greeks. 12/10 would ♥♥♥♥ history again.",
            "review_score": "1"
        },
        {
            "review_text": "Vanilla Rome Total War has its faults ie fantasy units, ancient Egyptians, awful diplomacy (share a border and expect to be attacked) being notable points. even then it is a solid game with many hours of engrossing fun to be had.  But with mods it really does shine. There is a large variety of mods to choose from to take your pick  I personally like it with Europa Barbarborum, Rome Total Realism or Chivalry.   ",
            "review_score": "1"
        },
        {
            "review_text": "why would you buy this? I sure don't know why I did",
            "review_score": "1"
        },
        {
            "review_text": "you like rts battles with turn based campaign? like fighting using acient empires like rome, carthage, egypt. Than ROME total war is right for you",
            "review_score": "1"
        },
        {
            "review_text": "Better than Rome 2 by a landslide.",
            "review_score": "1"
        },
        {
            "review_text": "NOTE: Most of my gameplay was on the original CD-ROM, non-steam version.  No strategy game collection is complete without this classic. This game perfectly blends traditional RTS gameplay with grand strategy to create a game that will leave you hooked for days. I could try to describe this game all day, but youtube could explain it better. If you really are uncertain about this game, then wait for it to go on sale for 80% off. It will be the best $2 you ever spent. Better than some of the $60+ games that I have.",
            "review_score": "1"
        },
        {
            "review_text": "This is a SUPAH AWESOME STRATEGY GAME.",
            "review_score": "1"
        },
        {
            "review_text": "Played a bit on disc a few years ago. This game is a MUST if you like RTS games. The other Total War games are fun too.",
            "review_score": "1"
        },
        {
            "review_text": "A game running through years without a wrinkle, you love strategie and civilizations of antiquity ? This game is for you !  - Pretty good graphism for his era,  - The Total War serie is definitely one of the bests strategic games serie, - You can choose betwin a lot of civilizations, - Realistic animations of fights and death, - The interface is really ergonomic, - Economic and social systems easy to understand, - There is not so much politic, - The AI have a good balance, - The campaign is really funny to play, - The map is big, - Fight maps are realistics, - There is some anecdotes about real History moments.  You to try this game !",
            "review_score": "1"
        },
        {
            "review_text": "Ahhh rome... what a game, truly one of the best RTS pc games ever made, well for its time yes but now its 2014 and creative assembly have come along way. Rome 2, shogun 2 ,empire theres quite a few so if you bought rome now would it still be fun to play? the answer is yes, while the graphics suffer because of its age gameplay never dies and theres still an active community who play this game online. Rome feels like it has what it needs to be a fun game while rome 2 on the other hand feels like rome 1 but with aload of junk piled on top, rome is simplistic, fun to play and will have you hooked for hours even days. In its time i would of given it a much higher rating but as theres newer games like shogun 2 that gives you pretty much everything you would want in a RTS the score will be lower but this is still a gem and as a pc gamer you owe it to yourself to check out this game, Overall 8/10",
            "review_score": "1"
        },
        {
            "review_text": "has been a fav for years! Rome 2 is a great game also but its not Rome Tatal war!! and now i have updated to windows 10 it does not work at all!!!!! NOT A HAPPY BUNNY!!! to sat the least! if anyone has a fix plz plz drop me a message thanks",
            "review_score": "1"
        },
        {
            "review_text": "I was managing my entire regime with a few slight losses of my total income and after a slght rebellion and the losses of a good few cav units (R.I.P the Best calvary unit there ever was) i quelled the rebellion and accidently crucified the entire city for their acts of treasons and everything went back to normal.Also damn those stupid ♥♥♥ Gauls they will take your Land and ♥♥♥♥ you hard.10/10 would do all that again.",
            "review_score": "1"
        },
        {
            "review_text": "I enjoy this game and the history it depicts. Micro-managing can get tiresome if you are not naturally inclined, and don't trust the Auto managing. I have not ever played the multiplayer. I enjoy the roleplaying and strategic aspects.   If you have an experienced assassin, he migh have this descriptor to accompany his experience level; 'the man is as cunning as a sackful of hungry weasels'  4/5",
            "review_score": "1"
        },
        {
            "review_text": "Old but gold with modding community still going strong. Ignore my hours in steam, had it on cd since 2007 i think, when i was browsing trough local game shop discount section. Best impulsive purchase ever. Including the mods, i have had about few hundred hours in this game. Sending elephants against eachother, 1 unit of gladiators vs entire team of peasants, same with beserkers... plus countless online battles. ah, good ol' times. For Rome!",
            "review_score": "1"
        },
        {
            "review_text": "batter then rome ii one of the best",
            "review_score": "1"
        },
        {
            "review_text": "shut up milo its dank",
            "review_score": "1"
        },
        {
            "review_text": "If you like racing games . . . this is for you",
            "review_score": "1"
        },
        {
            "review_text": "just one more turn i need to try out my new units",
            "review_score": "1"
        },
        {
            "review_text": "I played this game a fair bit in about 2006, around there. The story mode is boring as ♥♥♥♥ and I never played much of that. But you can create your own battles which is fantastic. Ever wanted to pit an army of flaming pigs against an army of elephants? Now you can. Or you do more conventional ♥♥♥♥ with Roman legions and Egyptian military types and Greek ♥♥♥♥ and a few different barbarian things.  Where this game hits the toilet is the AI. Holy ♥♥♥♥. They seem to have improved it between patches but even the finished product leaves a lot to be desired. Probably the biggest annoyance is that the AI won't attack unless you do. They'll just stand there until you get in range. Ridiculous.  Pwninator score: 6/10",
            "review_score": "1"
        },
        {
            "review_text": "I think i don't have to say anything about the quality of a Total War, if you like RTS buy this game!",
            "review_score": "1"
        },
        {
            "review_text": "Rome Total War is the best game in the Total War serie!!!!!  ",
            "review_score": "1"
        },
        {
            "review_text": "I always come back, my precious.",
            "review_score": "1"
        },
        {
            "review_text": "Best emperor simulator, for emperors who want to rule the world! 9/10 army is st***d",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game; I have sunk many hours into it.",
            "review_score": "1"
        },
        {
            "review_text": "best total war ever! i am pleased i purchased this after playing it in my childhood, well worth full price ,graphics arent great but you wont find a more responsive, enjoyable and complete total war. ",
            "review_score": "1"
        },
        {
            "review_text": "Best game with an even better price. I even like this a bit more than Rome 2, to be honest.",
            "review_score": "1"
        },
        {
            "review_text": "Fun for the whole family! Just kiding! One of the best RTS games out there!",
            "review_score": "1"
        },
        {
            "review_text": "Possibly one of the best games ever released. Fantastic strategy in the campaign map with amazing real-time battles providing a mix of tense combat strategy and a turn based campaign. The custom and historical battles give a great replay value and the diversity of over 15 different campaigns ensure the game never gets stale.",
            "review_score": "1"
        },
        {
            "review_text": "the best strategy game of all time.... I suck at reviews",
            "review_score": "1"
        },
        {
            "review_text": "one of the best games im ever seen its so good that its still a good game it doenst matter that it is 7 years old!",
            "review_score": "1"
        },
        {
            "review_text": "i love this series of games they just have me keep on going ",
            "review_score": "1"
        },
        {
            "review_text": "One of the greatest multiplayer experiences",
            "review_score": "1"
        },
        {
            "review_text": "top class game period its a must",
            "review_score": "1"
        },
        {
            "review_text": "My favorite rts/turn based strategy of all time",
            "review_score": "1"
        },
        {
            "review_text": "~S  Great game....fun..",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games ever made. A huge leap in gameplay and content for it's time. Graphics and mechanics are outdated now, but still find myself playing this one.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games I ever played. Major changes after Medieval Total War on Campaign map and Battle engine as well. Surely deserved the 300+ hours played.",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best game ever made.",
            "review_score": "1"
        },
        {
            "review_text": "very good once figure out how to play ",
            "review_score": "1"
        },
        {
            "review_text": "This is a realy fun RTS game where you can concor the entire world as your faveorite ancint history faction.",
            "review_score": "1"
        },
        {
            "review_text": "awesome game really low price and itss worth it it has such good features like generals actualy born grow old and die  awesome sieges and ai is a little dump but the game is realist on roman costumes and tradicions making a more realisct game  and the unit variety is great",
            "review_score": "1"
        },
        {
            "review_text": "0/10 no fish ai",
            "review_score": "1"
        },
        {
            "review_text": "The original and quite possibly the best ancient era RTS ever made. The game captures the feel of the period excellently, but has some more fictitous elements for fun (incendiary pigs anyone?) The siege combat gives a sense of size and scale that is mindblowingly fantastic. If only the, the fans of this game cry ROME 2 had been a graphically better version of this. Not to mention the great mod community greatly increases the value of this game. Want middle earth, thats been done.  Overall score- 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Perhaps one of the best games that I have played, ever. I personally perferred the multiplayer because I enjoyed just setting up an army and going head to head with other people. I have many great memories from these battles because the gameplay is really good. Rome: Total War was definitely a game ahead of its time and still is in my opinion a great game. Playing the multiplayer, you will accrue MANY memorable moments, and the recording feature at the end of each match allows you to relive those memories at another time. You will have battles where you become proud with your decisions and then you will have other games where you wonder 'How in the world did I just do THAT bad?' This is a game in which you will feel as if you are the general on the battlefield: sometimes the one who would come home back to Rome with a Triumph, or the one utterly humiliated by some Barbarian people.",
            "review_score": "1"
        },
        {
            "review_text": "All total war games are best",
            "review_score": "1"
        },
        {
            "review_text": "i have thousands of hours of this game on all of my older computors before steam had this.. Just bought it on here so i dont have to re enter the multiplayer code ;) great game and the cheats still work !! ",
            "review_score": "1"
        },
        {
            "review_text": "they could have done better but it is still awsome",
            "review_score": "1"
        },
        {
            "review_text": "Dont need to say anything ..................................................................................... its just amazing in my top 3",
            "review_score": "1"
        },
        {
            "review_text": "it's good",
            "review_score": "1"
        },
        {
            "review_text": "Why does it how barbarian invasion if it doesnt include it?",
            "review_score": "1"
        },
        {
            "review_text": "is the best game also rome total war 2 and napoleon total war are the top 3",
            "review_score": "1"
        },
        {
            "review_text": "This game is one of my favorite games of all time. Even with all the hype for Rome II: Total War. I'm definitely going to go back and forth playing this game still. It's glitchy, yes, but it's also really simplistic. It's how an RTS and Turn-Based game SHOULD play out like.",
            "review_score": "1"
        },
        {
            "review_text": "Best strategy game on planet earth!  *11/10*",
            "review_score": "1"
        },
        {
            "review_text": "I don't know about the rest of you gamers, but this game is definately one of my instant favorites. Since I was little, I wanted this game, but I never had the mental capacity to find out what it was called. This is the first game I have in the total war series, and one of the best things about it is the fact it can run on my horrible laptop. Any person who loves strategy or just straight up wants to see two massive armies clash, this is your game.",
            "review_score": "1"
        },
        {
            "review_text": "I have two copies of this game on disc and bought it on steam just as an insurance. This title addicted me to strategy gaming and is one of my top games of all time. Its outdated now but the imersion and gameplay still stands up.  Triarii!!!",
            "review_score": "1"
        },
        {
            "review_text": "Over a decade later and I am still playing this.  If Rome II is half as good then I will be a happy man.",
            "review_score": "1"
        },
        {
            "review_text": "Ah, Rome. I never played it at launch or for years after the fact, but it was always on my friends computer. Which he was of course one of those little wank-jobs that always showed off his ♥♥♥♥ but never shared it.   No, about 2012 was really the first time I got to play R:TW, my first TW title being Medieval 2.   Nowadays, people often say just get EB or any of the number of great mods. However, we're talking about Rome here, the base game as presented on Steam.  First off, with this purchase you get both Rome 1 (which follows Roman history from before the first Punic War to the early Imperial age) and the expansion Barbarian Invasion (which follows, of course, the invasions of barbarian tribes during the decline of the Roman empire). You don't receive the expansion Alexander (the campaigns of Alexander the Great) but of all the Rome expansions- Alexander is often regarded as the poorest by both critics and fans.  Rome 1 provides all the basics of a TW title. A campaign map where you conquer a part of the world. A skirmish game-mode where you fight the AI in a battle of choice. And Multiplayer (Now patched for steamworks as of 2014). Barbarian Invasion supplies the same package.  Within the Campaign Map you choose one of three Roman Families at first. This is where I start to have some gripes with Rome. For one, you have to conquer the other factions to unlock them in the grand campaign. Two, even if you just edit the .ini files to unlock them, the campaign is heavily focused on Rome. They get the most units, the most mechanics, the most events, and the most progression. While it's perfectly possible to enjoy playing the underpowered Gauls, I find these other factions to be relatively abandoned by CA. Some factions feel relatively the same, such as the Gauls and Germans, with only minor unit variations to give some feel to them. Also of note is that some factions are simply over-powered beyond conceivable belief. Units such as Rome's Urban Cohorts are just horrifying when placed against the AI. This can make Rome somewhat of a snooze-fest once the Marius Reforms activates and you start to get the best of the Roman crop. Other factions such as Gaul have laughably garbage infantry for the most part. While some argue historical accuracy, I find it harms the game balance and the ultimate enjoyment available. But a discussion on Rome's balance is way beyond the scope of this review, suffice it to say, Rome is unbalanced- but it rarely matters in single player.  If however you only care for Rome, then RTW is for you. Each of the three families starts with an 'obvious' foe and paths of expansion. The Senate functions as a uniting force, rewarding you for following orders, showing disapproval when you fail. The whole game is built around your family as you grow both your empire and your influence. The game provides some great role-play as you follow the Senate's orders, checking to see if the masses or the patricians prefer you. As you progress, so will your power- inevitably enraging the Senate. It's moments like these where the campaign starts to shine. While I won't spoiler where that ultimately leads to, it justifies the slow start to the Imperial campaign.  Speaking of the campaigning, the conquest of towns is fought on the battle map. Here you command your army, including your general if he's there, and engage the enemy. This is where the meat of the game is, and here where Total War makes its name. The battles are some of the fastest in the series, with units moving rapidly and viciously. Veteran units can stomp multiple newbie corps single-handedly. A single cavalry charge can lead to a rapid route. All this occurs to the excellent soundtrack of Jeff van Dyck and combat mechanics that (mostly) stand the test of time.  I have a gripes here when compared to the later Total War games. For one, field battles (where units meet with no city or the like nearby) are unfortunately not too common in the later stages of the Campaign. This is due to the AI choosing the hide in cities. Due to this, you get to meet the siege battles of Rome- which are terrible. I'm not going to dance around this issue, siege battles are awful. The path finding of your units is all sorts of agony, and it only gets worse if you fight civilized nations that have large, built-up cities. You can have entire units enter into embarrassing formations where a handful of men are trying to take down a hoplite wall. It's funny, but it's hell. Siege battles can be ignored due to the great auto-resolve system Rome has, which can be used for field battles too.  Unfortunately, I have issues with unit path-finding in general. Cavalry especially is very cumbersome compared to later titles. You will just have to get used with Cav occasionally ignoring your orders and charging head-long into spear-walls instead of between that wide-gap in the line. Also, units randomly charging other units instead of the ones you ordered them to is also common- this includes cav. It makes the control feel archaic, and from what I've researched it just seems to be a bug with the formations. It's annoying and often makes me just go towards Medieval 2 and download a Rome mod (EB2, I'm forever hyped). It isn't game-breaking since the AI is just...  Meet CA's AI, from Rome to Rome 2 you're going to be playing with him. He's mentally insane, tuned seemingly for players that have no clue about formation tactics. The moment you figure out strategy, is the moment you realize that the AI is helplessly innocent, inept, incapable of learning, a terrible judge in terrain choice, a terrible flanker, and perhaps suicidal to boot. He's come in many different flavors- but really only modders seem capable of making him remotely competent. Increasing the difficulty will not make him smarter, only gives him a boost in unit stats. For a newbie, he's a good first opponent for casual player, but he won't teach you anything.  What is not a flaw of the series is its presentation. Rome's simplistic art direction may have aged polygonal graphics but it still holds up relatively well, appearing distinguished and fluid despite being a game from 2004. It's a standard that's been kept by just about every title. The music, which I've only mentioned once, is some of the best in the series, bringing a lot of those aged graphics to life with broad stroke of tunes. Even the voice-acting has some charm, in the hammy sense.  But we're not done, BI rounds out our package by being ♥♥♥♥ing painful. It's a campaign for barbarian lovers giving great variety to the barbars while still making Rome a fun faction. Notably a bit more balanced in the campaign the Western Rome campaign is one of the hardest challenges in TW history. It's meant only for series vets, even then it's infamous for the horror it gives. My personal opinion of it is that it's hard in the arbitrary sense, with unrest and religion stacking the deck on you. The AI isn't any smart notably (can land units by sea if the stars align). Most of the difficulty comes from rebellions, but the various barbarian tribes declaring war on you adds some fun. This campaign is historically inaccurate in it's portrayal of what troubled Rome. This is mostly due to the engine being incapable of modeling certain things. Historical inaccuracy is just a common thing in TW as it is- but I'm someone capable of ignoring this in favor of fun. BI besides the difficulty, is a neat addition to Rome and where I say barbarian lovers should go in lieu of the RTW.  Still, RTW offers a great package for TW newbs. Introducing you to the series with a game that still holds up, with great modding potential. For the gripes I have, RTW is still a great game. If you have to choose a TW, go with an era that interests you most. All of them have pros and cons. Between Rome 1 and 2? You get a complete product with R1 that is fully patched and 'done'. No dlcs, no patches ruining your mods, same era.  ",
            "review_score": "1"
        },
        {
            "review_text": "FOR THE GLORY OF ROME!  Pretty cool game. A bit like CIV. Less management of cities though and more focused on combat. I like the actual combats that you can control.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would auto win again",
            "review_score": "1"
        },
        {
            "review_text": "Good fun for multiplayers but a bit old now",
            "review_score": "1"
        },
        {
            "review_text": "NULLUM EST IAM DICTUM QUOD NON SIT DICTUM PRIUS",
            "review_score": "1"
        },
        {
            "review_text": "Its a great game, tons of time to sink into it and a fairly simple design that strengthens gameplay. Great balance and terrific music. (Ai is stupid and never rush pikeman)",
            "review_score": "1"
        },
        {
            "review_text": "I've always been a fan of the total war series and this is the game that got me into them. it's a classic that i still enjoy revisitting too this day even with the addition of Rome 2.",
            "review_score": "1"
        },
        {
            "review_text": "One of my personal favorites games. I love how it has a turn-based board-style overworld, and then some cool real-time strategy simulation battles of epic scale. It's just a really fun game and my personal favorite RTS game. Fun as a fusion of both turn based and real time in an interesting combination.",
            "review_score": "1"
        },
        {
            "review_text": "Although this game is almost 11 years old, I find that it is the best in the Total War series. The music is great, although few in tracks. The gameplay is responsive and smooth, easy to navigate. Overall, I have no bad memories of this game and have invested many hours of my life into it. WHen I first got this game, I was probably five or six. My dog originaly snapped it in two... you can imagine the sorrow I felt. :( but now I have it again!  I recomend this game as a great introduction to the series; it is easy enough for beginners, but can also be quite challenging. Unlike its sequel, you can expect NO GLITCHES! I promise it won't leave a bad taste in you mouth.",
            "review_score": "1"
        },
        {
            "review_text": "A classic game that has aged pretty well. $10 isn't a bad buy and if you can't get it on a deal I say go for it. it's a wonderful historical RTS.",
            "review_score": "1"
        },
        {
            "review_text": "This game coverted me into a latin.  9/11 praise Jupiter.",
            "review_score": "1"
        },
        {
            "review_text": "One of the greatest games ever made by a human.",
            "review_score": "1"
        },
        {
            "review_text": "i use cheats, its da best. 10/10 would cheat again",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic Game! No problems with the game as of yet!",
            "review_score": "1"
        },
        {
            "review_text": "Also a very good game thats quite cheap like 6 bucks.",
            "review_score": "1"
        },
        {
            "review_text": "This game is ridiculously old and i spend way too much time on it. Hell, I have Medieval 2, Empire, and all the extra campaigns and I still play the original. I suppose one day I'll get Shogun 2, but until then I'll be playing Rome (so old!)",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best Total War ever! If your fan of Total War, you'll probably already had this, if you’re new to the franchise, then try this classic gem! Hours of game play to be had here, guide your Roman empire to conquer Europe.....next the WORLD, if only....",
            "review_score": "1"
        },
        {
            "review_text": "The graphics may have aged, and it may have been outdone in several arenas by later entries, but dammiot, this is still a great game. It's what made Total War a part of my life, and I will love it always for that. Simple, clear, but by no means easy. Play it and enjoy the variety packed in.",
            "review_score": "1"
        },
        {
            "review_text": "It's a classic, and a great one at that! If you haven't got it, get it!",
            "review_score": "1"
        },
        {
            "review_text": "this gam is great and awesome",
            "review_score": "1"
        },
        {
            "review_text": "best total war game there is 10/10 you need to buy it yes it's old but it's gold",
            "review_score": "1"
        },
        {
            "review_text": "maybe best game ever... if not its a diff total war game.. thanks for always being there for me...thanks for not charging us 7.99 for each new faction",
            "review_score": "1"
        },
        {
            "review_text": "Awesomeness. Lot and lots of awesomeness.",
            "review_score": "1"
        },
        {
            "review_text": "In my opinion, the strongest entry in the total war franchise to date, old textures and all. This game is simple enough to begin that even people who don't like grand strategy games will love it, then when you have conquered far and wide the complexity will rachet up to the point where experts will love it even more. Personally leading a battle of the thousands on the field never gets old and it gives campaigns a weight behind them. You become invested in your legions and your invasions.",
            "review_score": "1"
        },
        {
            "review_text": "Absolute classic, beats every other Tactical game EVER. Best part is that it will run on pretty much any computer even my laptop. 10/10 Would conquer the world again",
            "review_score": "1"
        },
        {
            "review_text": "this game is awesome ",
            "review_score": "1"
        },
        {
            "review_text": "Yard ape plays Rome: Total War™ in the yard because he not allowed in the house. Yard ape enjoy Rome: Total War™.",
            "review_score": "1"
        },
        {
            "review_text": "+",
            "review_score": "1"
        },
        {
            "review_text": "Of course I am going to sound biased when I say this but this honestly is one of the best, if not, THEE BEST strategy game ever made. Bought this when I was a prepubescent child and I made so many memories with it then and still do today. Gameplay is fantastic, both campaign and RTS. And the music to this day still gives me these chills and adrenaline rushes when playing a battle. It's very unfortunate that its successor Rome 2 didn't live up to how brilliant the first one was. Especially considering this most likely is the best of all the Total Wars with Shogun 2 being a very close exception. Not to mention it pretty much laid out the gameplay formula for every Total War game ever since (look up its predecessors and their gameplay and you’ll understand lol). It deserves the best because it is, well, the best!   And yeah, the game is over a decade old but that hasn’t stopped me from ever playing it.   And if you can find a way to still play multiplayer games with friends. Do it. It’s ridiculously fun.",
            "review_score": "1"
        },
        {
            "review_text": "A good buy to see the history of turn based strategy games and fun to play.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best in the Total War series. Highly Recommender. CHHHHHAAAARRRGGGEEE!",
            "review_score": "1"
        },
        {
            "review_text": "Good old strategic war game, lots of fun, and plenty of people still playing.",
            "review_score": "1"
        },
        {
            "review_text": ":)",
            "review_score": "1"
        },
        {
            "review_text": "When i can read code in this game,i think it's my game,very good.I can change every in it.wohahahahah",
            "review_score": "1"
        },
        {
            "review_text": "Remember kiddies, commiting genocide every time you conquer a city is how you keep those cities happy 11/10",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the most well crafted total wars out there, and with the collection being as cheap as it is now; it's a total steal.  Game of my childhood is back and I am loving it more than ever, losing myself in building my empire and armies up to fight all other factions.  Yes the game does have some bugs which can cause the game to either be slow or close down; but with plenty of autosaves, it won't effect your gaming experience too much.",
            "review_score": "1"
        },
        {
            "review_text": "More than a decade have past since Creative Assembly  released their best game of the series then. Yet this title is considered amongst best to date of  Real-time &amp; Turn-based strategy hybrid ever made. Innovative solutions and game engine, breath-taking epic battles  and all the other things that make this title extremely attractive  despite timespan since creation, specially for melancholiacs. Great work from Jeff van Dyck and his wife who created really atmospheric  soundtrack that fits and adapts into gameplay for incredible experience. Those who never played should definitely try it,  especially if they are disappointed by the remake. Those who played know it's attributes,  no need to introduce or encourage to refresh memmories.",
            "review_score": "1"
        },
        {
            "review_text": "I should have played this game a long time ago. At first, I didnt want to play it because I thought the graphics were outdated and maybe there was something better out there but boy I was wrong. Rome: Total War is an absolute classic and should be played by anyone looking for a great Strategy game. 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "This is by far my absolute favorite historically based grand strategy/RTS game ever made. Rome: Total War is an absolute must have for fans of games like Civilization and Command &amp; Conquer. Rome: Total War is one of the rare games that does what it is meant to do, perfectly. It has no problem letting you feel the triumph of Caesar himself as he conquered Gaul, or the rage of Hannibal as he sacked Rome to avenge his father. For any fan of turn-based games or real time strategies, Rome: Total War is a must have for any serious PC gamer.  ",
            "review_score": "1"
        },
        {
            "review_text": "am so loving it",
            "review_score": "1"
        },
        {
            "review_text": "Love this game, sometimes AI might be a bit glitchy",
            "review_score": "1"
        },
        {
            "review_text": "Be like the game, never in any case, capture Tara.... never....  10/10 would conquer again",
            "review_score": "1"
        },
        {
            "review_text": "cus swag",
            "review_score": "1"
        },
        {
            "review_text": "fun game and worth it, lots of action",
            "review_score": "1"
        },
        {
            "review_text": "Hours of the day just fly by",
            "review_score": "1"
        },
        {
            "review_text": "love the total war seiries but one that i have been hoping for since it first came out is a world war 2 version since i am a history person and world war 2 is my specialty",
            "review_score": "1"
        },
        {
            "review_text": "This implementation displays a level of attention to detail and polish sometimes absent from series entrants, and in no other historical period is the Total War engine more at home than here in the classical era of steel and maneuver.",
            "review_score": "1"
        },
        {
            "review_text": "This is by far my 2nd most favorite Total War game right behind Empire: Total War. Even though this game is age is pretty old, I still have this game as my 3rd most played game on Steam. So I would recommend this to anyone who is new to this series.",
            "review_score": "1"
        },
        {
            "review_text": "The single greatest RTS I've ever played. The entire Total War series with the exception of Warhammer Total War and Shogun 2 do not compete with the original Rome Total War Series. As a proud HELL Clan member, a Germania fanatic, and a participant in a few tournaments back in 2010/2011 - I can still recommend this game in 2016.",
            "review_score": "1"
        },
        {
            "review_text": "this is the first game i got on steam, and i do not regret it at all i have played this game for hours on end, basicly in single player you manage an ancient group of poeple like rome,gual,carthage,greece, macedon and much more, using your mind and many diverse units and cultures to conquer the known world. in custom battles you use said factions and there strengths and weaknesses to your advantage.",
            "review_score": "1"
        },
        {
            "review_text": "'All Rome will be amazed at such a victory! The day is ours!'  ",
            "review_score": "1"
        },
        {
            "review_text": "I was only 9 years old I loved the Phalanx so much, I had all the merchandise and movies I pray to the Phalanx every night before bed thanking it for the life I've been given. Phalanx is love I say, Phalanx is life My dad overhears me and calls me a ♥♥♥♥♥♥ I knew he was just jealous of my devotion for the Phalanx I called him a Roman He slaps me and sends to crucifixition Im crying now, and my hands and feet hurt. I hang from the cross and its really cold A point is moving towards me. I feel something pierce me Its the Phalanx I am so happy It whispers in to ear 'This my formation' I grabs me with it's powerful spear-like hands and puts me on my hands and knees I'm ready I spread my ♥♥♥ cheeks for the Phalanx it penetrates my ♥♥♥♥♥♥♥♥ It hurts so much but I do it for Phalanx I can feel my butt tearing as my eyes start to water I push against it's force I want to please Phalanx It roars a mighty roar as it fills my butt with spear heads My dad walks in Phalanx looks him straight in the eye and says 'Its all phalanx now' Phalanx leaves through my window Phalanx is love, Phalanx is life  10/10",
            "review_score": "1"
        },
        {
            "review_text": "129 hours and I still never got past Gaul...",
            "review_score": "1"
        },
        {
            "review_text": "Great game that is full of fun and challanging classes and levels! SO GOOD!!!",
            "review_score": "1"
        },
        {
            "review_text": "This is the first Total War I picked up and it instantly got me hooked on the series. Now, I can't really compare this to other games of its time because I started playing TW about 3 years ago, but I will say this: This is still one of the best TW games in the series. They just nailed so many things correctly, and the fact that after so many years it is still so fun to go back and pick up where I left off, is a huge plus.  Graphically it can't compare to the new ones, but it did so many other things so well, it doesn't even matter. Diplomacy with the old diplomat agent system is a pain when compared to the newer TW; Combat is still so satisfying (when u rain a thousand flaming arrows on a horde of barbarians); The campaign map still feels expansive; The biggest plus is the games massive variety in playable factions and unique units/traits. Even by today's TW standards it is impressive.  ONE HUGE CON FOR THE STEAM VERSION: There is a problem where in the campaign map you will have massive amounts of lag, but this can be fixed (ranging from easy to infuriatingly hard solutions). I think this is due to optimization bugs or something for the most part.  Still recommend 9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Turn Difficulty to the highest.  Flamming pig fighting runaway peasent.",
            "review_score": "1"
        },
        {
            "review_text": "'When in Rome do as the Romans do' which would be kicking everyones backside according to this game. Its your standard Total War game stratigic unit combat on the battlefield with a turn based campain map. To start with it can be a bit dull, playing as a roman faction you just walk over all other factions until you get to the meatgrinder Roman vs Roman the battle suddenly become difficult (ish) well a bit harder anyway and it becomes a hole lot more fun to play.",
            "review_score": "1"
        },
        {
            "review_text": "Friends, Romans, countrymen, lend me your non-steam version of this game! For I have more hours and saved games on it!",
            "review_score": "1"
        },
        {
            "review_text": "Best turn based game ever, if you want to conquer Europe you can, Middle east you can, North africa etc, and not just as rome, beat the game and defend your tribe from Rome and if need be, rewrite history .  ",
            "review_score": "1"
        },
        {
            "review_text": "Its stil the best one in TW series ...",
            "review_score": "1"
        },
        {
            "review_text": "Probably one of the best damn games ever. I totally recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "My only reccomendation is being able to control multiple groups of units on a wall of a city. Otherwise, great game!",
            "review_score": "1"
        },
        {
            "review_text": "what else?...",
            "review_score": "1"
        },
        {
            "review_text": "custom battle siege attack: i give enemys no archers give myself 1 battering ram, ram aproaches gate, gate starts shooting at it.........0-0 high level of realism on this game man ",
            "review_score": "1"
        },
        {
            "review_text": "The Sheriff Approves ",
            "review_score": "1"
        },
        {
            "review_text": "Growing up, I've played A LOT of RTS games. This one is the one I remember and like the most (other than Age of Empires II). I was actually pretty ecstatic when I saw that it was available to buy on Steam. It's a great RTS game. Sure the campaign mode is a little complicated, but if you get used to it, it's a great game. I consider this to be Sega's greatest thing other than Sonic.",
            "review_score": "1"
        },
        {
            "review_text": "Absolte beast game, yuo need to buy it. p.s. Dont total war 2 its ♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "Possibly still the best Strategy game ever made. Rome II was a large disappointment to me and many other fans. The battles in this Total War aren't matched by any other Total War... The game engine behind this game was possibly the best Total War game engine. This one is by far more addictive than the second. It's honestly hard for me to sit down and play a full game of the newer Total Wars. 10/10...",
            "review_score": "1"
        },
        {
            "review_text": "Good mix of RTS and turn-based strategy. Probably one of my all time favorite games",
            "review_score": "1"
        },
        {
            "review_text": "love this game!",
            "review_score": "1"
        },
        {
            "review_text": "Great Game",
            "review_score": "1"
        },
        {
            "review_text": "great game this is my favorite game as of right now i have not purchased two but i plan on it",
            "review_score": "1"
        },
        {
            "review_text": "Creative Assembly's early work was a little too 'new wave' for my taste. But when Rome came out in '04 I think they really came into their own. Commercially and artistically. The whole game has a clear and crisp gameplay and a new sheen of consummate professionalism that really gives it a big boost. It's been compared to Civilization, but i think Rome has a far more epic, grand scale type of campaign. In '05 Creative Assembly released Barbarian Invasion, their most accomplished expansion. I think it's their undisputed masterpiece. Most people probably don't play all the nations. But they should, because it's not just a historical digest of the era, it's also a personal statement about the developers themselves!",
            "review_score": "1"
        },
        {
            "review_text": "This game is a classic and will be remembered for a very long time. Lots of fun wih tactics and a cool campaign",
            "review_score": "1"
        },
        {
            "review_text": "still playing this classic",
            "review_score": "1"
        },
        {
            "review_text": "It's a bit dated now, but, still amazingly fun. A pretty good way to be introduced into the Total War series.",
            "review_score": "1"
        },
        {
            "review_text": "A very fun, yet historically inaccurate, RTS. Despite not being as fun a Rome II (Rome I has less units, factions and campaign options) it still is very fun and a great game to play and is alongside my favourite strategy games along with Company of Heroes (a simply outstanding game), Rome Total war 2 (if you ignore seige battles) and Civilization V. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I love this game, the graphics are ok for a game made in 2004 a decade ago. The game play may not be superrealistic but its the best there is. Napoleon total war and shogun are the only games of this genre that can compete with RTW",
            "review_score": "1"
        },
        {
            "review_text": "Play With Darthmod for the Fullest, and best, expereince",
            "review_score": "1"
        },
        {
            "review_text": "I milked easily 100+ hours out of this beast. One of the best and most addictive RTS ever made. Is no easy walk in the beginning since you really have to manage EVERYTHING from diplomatic relations to army salaries (yeah 200 years BC) but once you get the hold of it there is nothing else stopping you from conquering the world (or europe and north africa in this case) apart from 2000+ men armies, huge stone walls with boiling oil and 20 battalions of archers blocking the sun with their arrows coming at you. YES, it is that much fun! (and I'm not even counting Barbarian Invasion here!)",
            "review_score": "1"
        },
        {
            "review_text": "i recemend this game. I feel like a general on a battlefield",
            "review_score": "1"
        },
        {
            "review_text": "good old strategy which never gets boring",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game, definitely a classic and must play for anyone that enjoys large scale empire development combined with real time combat.",
            "review_score": "1"
        },
        {
            "review_text": "Yes... After that huge fix update, I don't get 'failed to find Steam' anymore and this game rocks. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "It's fantastic:)",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, highly recommended for those who love ancient warfare or strategy games.  I played this game a lot , first i downloaded it on the ♥♥♥♥♥♥♥♥♥, then i got bored of the Single Player, so i bought it and played Muptiplayer, the Multiplayer is freaking awesome.  Also i recommend that you buy the Alexander Expansion.  My Favourite game EVER.",
            "review_score": "1"
        },
        {
            "review_text": "The best Total War.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome. I still think this game is the best in the series. Perfect? No... but game-play and flow is great. Highly recomend this game if your interested in the Total War series.",
            "review_score": "1"
        },
        {
            "review_text": "i recemend this game. I feel like a general on a battlefield",
            "review_score": "1"
        },
        {
            "review_text": "Its Rome during its hayday togas kegs wine Ceaser doing his hippity skippity through Rome on his big white horse but something is amiss the damn barbarians are coming so what there just a bunch of hopped up vikings what can they do well take on this rather old but still massively fun game with dogs the size of horses and armored elephants ready to 'accidently' step on someone and find out but seriously ROME, ARMORED ELEPHANTS, SPARTANS who wouldnt want to buy this game",
            "review_score": "1"
        },
        {
            "review_text": "This game has aged well, I highly recommend this masterpiece to any strategy fan. 9.5/10 A must have if you see it as a daily deal or in a sale",
            "review_score": "1"
        },
        {
            "review_text": "Best game in the Total War series in my humble opinion. Good pathfinding in real time battles for its age (certainly alot better than in Toal War: Medieval II!), very smooth and easy to understand, lots of replay value! Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing just flipping perfect ",
            "review_score": "1"
        },
        {
            "review_text": "Awsome Game!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome, best game ever made. I'm serious. Dead serious.",
            "review_score": "1"
        },
        {
            "review_text": "You should BUY this game its awesome   (Hope the Total War creators do more of these games) ;D",
            "review_score": "1"
        },
        {
            "review_text": "Good mix of RTS and turn-based strategy. Probably one of my all time favorite games",
            "review_score": "1"
        },
        {
            "review_text": "A very fun, yet historically inaccurate, RTS. Despite not being as fun a Rome II (Rome I has less units, factions and campaign options) it still is very fun and a great game to play and is alongside my favourite strategy games along with Company of Heroes (a simply outstanding game), Rome Total war 2 (if you ignore seige battles) and Civilization V. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "My personal favorite of all the Total War series, until Rome II comes out. Also i have had this game before steam and have played on and off for nearly 10 yrs.  Edit: This game is a must buy if you enjoy RTS or if you have an interest in the battles of antiquity and late antiquity. The graphics are litereally the only 'problem' with this game besides balancing issues- general units are powerfull. And I say this after putting many hours into RTW 2 it is much better then its predesessor for many reasons-         YouTube™ Video:  Sane Critique, Why Rome 2 Failed&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Buy this game of pure TBS awesomness!!!",
            "review_score": "1"
        },
        {
            "review_text": "great game but a bit disapointed as barbarian invasion is not here, it has downloaded but the option isnt there to run it when i open, if i go into my files and launch from there i get a pop up saying 'cannot find steam' overall 8/10 great game but would have liked the expansion",
            "review_score": "1"
        },
        {
            "review_text": "Strategically engaging but graphically non-enticing. Gameplay could be better served by a more fluid camera navigation system and less 'boxy' architectural landscape. However, with the technological shortcomings, the game is still entertaining,",
            "review_score": "1"
        },
        {
            "review_text": "i moan like a ♥♥♥♥♥ as I play this game again and again...and again...and again",
            "review_score": "1"
        },
        {
            "review_text": "Perhaps the best strategy game I have ever played! Not only can you play as the Romans and others in the campaign, but you can also play online battles with your friends too! I recommend this game to anyone who wants a good strategy game to play.",
            "review_score": "1"
        },
        {
            "review_text": "Simply... The best game ever made.",
            "review_score": "1"
        },
        {
            "review_text": "Been playing this game since 2008 with probably over 5000 hours by now, and finally not long ago decided to actually buy the game to try multiplayer; and i must say- probably the best game I've ever played. NO DOUBT ABOUT IT",
            "review_score": "1"
        },
        {
            "review_text": "I've always been a fan of the total war series and this is the game that got me into them. it's a classic that i still enjoy revisitting too this day even with the addition of Rome 2.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best roman time frame game made yet, i think you all should get it. its £5 and multiplayer.",
            "review_score": "1"
        },
        {
            "review_text": "Coolest game ever!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Addicting and fun.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a blast. Its only for a niche market though, if you aren't into strategy games, particularly RTS's, you probably won't enjoy it. If thousands of soldiers in huge ancient battles sounds appealing to you, grab this game now! Best Total War in the series IMO, its honestly an amazing game.",
            "review_score": "1"
        },
        {
            "review_text": "It's fantastic:)",
            "review_score": "1"
        },
        {
            "review_text": "best military sim game ever",
            "review_score": "1"
        },
        {
            "review_text": "I don't know as much about the setting as with Medieval II, but Rome can still be entertaining in that unique Total War way. It still has the same problems as the later games in the series, like how every match seems to end up systematically swarming enemy cities with few surprises to keep you interested, but a fan of the franchise probably knows what to expect.",
            "review_score": "1"
        },
        {
            "review_text": "Probably one of the best damn games ever. I totally recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Still the best total war game.",
            "review_score": "1"
        },
        {
            "review_text": "i love it, i played it for 200+ hours still wonna play ",
            "review_score": "1"
        },
        {
            "review_text": "ARCHERS ON THE WALLLLLLLSSSSS!!!!",
            "review_score": "1"
        },
        {
            "review_text": "The best part of the Total War series, especially with the mods.  As CA now fails to support mods the way they did, this game will probably stay the best for the time to come.",
            "review_score": "1"
        },
        {
            "review_text": "This game is pretty good, I'm not addicted and I prefer to play other games, but I enjoy playing it every while. I recommend it if you are into Strategy or Real Time Strategy (RTS) games. If strategy isn't your thing, then I can't guarantee you'll enjoy it!",
            "review_score": "1"
        },
        {
            "review_text": "Its a great game, when it actually starts up for me. I do Roman geography competitions so this game really helped because it had all accurate information. I was able to enjoy myself and study at the same time. I like the way combat is since it allows you to be the general and make all the moves. The game is not dated and graphics are still pretty decent. I can't wait for Rome Total War 2",
            "review_score": "1"
        },
        {
            "review_text": "years and years of game play for me..this game is the way i wish all the Total War series was..  Medieval 2 was good too but calvary lacked thrust..  Rome Total War is and always will be on the gamelist ready to play.  If your new to the series..start here..",
            "review_score": "1"
        },
        {
            "review_text": "It's good, buy it",
            "review_score": "1"
        },
        {
            "review_text": "#1 unbeatable tactic: incendiary pig spam.",
            "review_score": "1"
        },
        {
            "review_text": "this game is one of the best TW game once modded with Europa Barbarorum, check it out",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun, has taken many hours from my life.",
            "review_score": "1"
        },
        {
            "review_text": "Over 200 Hrs on record but more before i got it on steam, this game was worth every penny less than $10 i believe.....",
            "review_score": "1"
        },
        {
            "review_text": "It's the 5th turn in a row that a full stack of Egyptian troops has besieged me in North Africa. After 4 successive sieges without being able to retrain a single unit, the garrison is looking a little f*****. The battle begins, in true defensive siege fashion, every unit is on a chokepoint just next to the centre, i skip the part where the enemy ai knocks down my walls and spends 10mins getting his troops in the city. The panicky advisor screams 'The Walls are down!' ...jeez, calm down mate, it's not over yet. A couple thousand infantry and just under 100 chariots (god, you learn to hate those things) come barreling down the main 'road' towards my town centre, 5mins of carefully stacking my units just right pay off here, most of the chariots bounce off my block of 500 or so legionaries, but, wtf is this!?!?! there is one unit just sat on my town square, they oblige my worst fear and abruptly charge into my neatly packed lines, facing the other direction. What unfolds is a tense fight to the death where i am powerless to help my troops as they are mown down by the chariots, followed closely by infanty, a tense meat grinder, both armies simply melting away in moments...utntil one heroic legionary standard bearer decides to stab the enemy commander in the face, despite hiom being on a chariot. This superhuman feat results in a mass rout...my infantry is too tired to consider a pursuit. I end the battle. The world map loads up, 5 armies down, 8 more to go. Declaring war of Egypt was a terrible idea... (This hasn't beein much of a review, but it simply shows the beautiful anecdotal content this game creates, despite being made in 2004, it still easily holds up to modern gamin, i considered it a benchmark for Rome 2, and found Rome 2 to be lacking...again, proving that this game was insanely ahead of it's time. Would utterly reccommend, one campaign will easily sustain you for 50-100 hours. Enjoy! ",
            "review_score": "1"
        },
        {
            "review_text": "If this game was Julius Ceasar, he wouldn't get stabbed in the back... 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I recently repurchased the game on steam. This would be the third time i have bought the game. twice on disc (the early version and the later version) and i have to say it is by far the BEST GAME I HAVE EVER PLAYED. If you are thinking should I? DONT. Just buy it now. If you liek RTS but Civilazation just isnt quite action enough for you than this is the ticket. Get this game and love yourself.   I have somewhere in the 2,000 hour range in this game. I have played it since it came out and i never had a gripe about anything in the game. I never once felt bored. Never once felt the AI was garbage on the campaign map or in a battle either, which worries me since people have those gripes with the latest installments of the series and it leaves me wondering if they tried ot reinvent the wheel and failed or if i have poor standards :/. The Barbarian Invasion 'dlc' is a complete game in its self. I dont even want to call it DLC. Barbarian Invasion is its own installment in my mind. Not to mention all the mods avaiable for this title. I reccomend the LOTR mod for this (although it might be for TWM2 and im completely mistaken). BUt anyways folks, set your unit size to huge and go to work on the barbarians of the north, or set out as the remnants of Alexander the Great to reconcour his lost Empire.",
            "review_score": "1"
        },
        {
            "review_text": "Still the best balance of units and factions of any of the Total Wars.",
            "review_score": "1"
        },
        {
            "review_text": "ohhh yea this game is amazing 1000 times better then the second one cus the second 1 sucks",
            "review_score": "1"
        },
        {
            "review_text": "THIS AND MEDIEVAL 2 ARE THE BEST TOTAL WAR GAMES THAT YOU MUST GET THIS VERY MOMENT. I DONT CARE IF YOU DONT LIKE STRATEGY GET THIS GAME NOW",
            "review_score": "1"
        },
        {
            "review_text": "Had so much fun with this game, was the first game that engaged me in RTS games",
            "review_score": "1"
        },
        {
            "review_text": "The game that PUT Creative Assembly on the map! Awesome from start to finish!",
            "review_score": "1"
        },
        {
            "review_text": "Enemy civilization sieges one of my villages for one turn. I turned my entire force on them and walked over all their settlements in 15 turns. 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "Much Good Such Fun Beating Phalanxes(?) with horses Hills and Legionaries making dogs do the dirty work taking Greece taking Gaul taking Carthage taking Rome WIN 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Greatest Total War game, in my eyes.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, great game fr people that love the roman times.",
            "review_score": "1"
        },
        {
            "review_text": "I love the game and it runs great on my older model computor and ive been playing it on all of my free time, the controls are simple to get used to for me with my experience in RTS games and the requirment to destroy factions to play as them adds a fun challange to the game, the battle scenes are awsome and they dont really lagg for me unless i have like 2000 men and i try fastforwarding time but thats because my computor barly meets the minimum requrments. overall its a great game and i love it.",
            "review_score": "1"
        },
        {
            "review_text": "&gt;Dacia sends a warship fully loaded with elite troops and generals into my territory. &gt;They declare war on me before reaching the coast. &gt;I sink the warship. &gt;Dacia immediately requests ceasefire next turn. _________________________________ Actual Review:  All you need to know is the game is great. Some things that are kind of annoying are the FPS drops in large night-time battles, moving camera fast on campaign map, and the game not letting you Alt+Tab back into the game if you tab out. Oh, and the AI can be ♥♥♥♥♥♥♥♥ if you are besieged and use your garrisoned troops to attack the attackers before ending the turn.  Aside from that, there's a lot of depth to this game that surpasses Rome 2 in many ways.",
            "review_score": "1"
        },
        {
            "review_text": "Best of the total war game series",
            "review_score": "1"
        },
        {
            "review_text": "an absolute classic game and i couldnt live with myself if it wasnt on my steam library!",
            "review_score": "1"
        },
        {
            "review_text": "Somewhere in the world a child is crying. Shh....I think I hear them now.............tragic. Their tears are a symbol. A symbol of your subconscious desire. The desire to indulge in an incomparable experience of exctasy. Wipe away their tears. Buy Rome: Total War ",
            "review_score": "1"
        },
        {
            "review_text": "Averaged 2FPS for the entire 1 game I played... 100/10 would lag again",
            "review_score": "1"
        },
        {
            "review_text": "Roman history like you've never seen it before, well were have you seen it before. This game allows you to undergo managing your own roman empire. Taking on some of the most infamous war tribes in history. The Gauls, The Carthaginian, The Greeks, The Macedonia... the list goes on. A small but very complete game, running on some of the old mid-2000 computers. This game is flawless.",
            "review_score": "1"
        },
        {
            "review_text": "For 5-10$ this game is fantastic. The combat system is great with a variety of infantry, calvary, and ranged units. There's a number of factions to choose from which provides good replayability. A solid playthrough is quite the committment so it's easy to sink hours into this game. City management is decent with factors including unrest, economy, and population. However, from cities are good while others are bad. There's no fixing certain cities and they're doomed to be financially awful so it can be frustrating. The diplomacy is the least exciting and extensive part of the game. The selling point of the game is absolutely the combat. Crush the rivaling factions alone with fun and intense battles. The diplomacy allows no true alliances and depending on what faction you play you can be surrounded by enemies and have to fight a steep uphill battle. All the factions are fun but some have a pretty solid advantage. The barbarian factions are more limited on technological buildings and troops such as onagers, scorpions, and even stone walls. It's slightly made up for by the fact that the troops they do get can be outright more interesting. Like headhurlers who throw severed heads at enemies to lower moral or axe wielding berserkers who fight to the bitter end in a bloodthirsty rage. Once again you can see the emphasize on the combat. Despite the shortcomings in diplomacy the game is super fun and there's a large mod selection too. So go build your big badass army and conquer. Veni, Vedi, Veci ♥♥♥♥♥♥♥♥♥♥♥♥s.",
            "review_score": "1"
        },
        {
            "review_text": "Cool game and that is my first total war game. Recommend for everyone who love Roman Empire.",
            "review_score": "1"
        },
        {
            "review_text": "amazing for a 2007 game runs with standard basic PC's ",
            "review_score": "1"
        },
        {
            "review_text": "Best strategy game I've ever played. Great soundtrack, good graphics, and can run on mid-low computers and up.   10/10 would rout enemies again!",
            "review_score": "1"
        },
        {
            "review_text": "As you can see from my hours played, it is one of my favorites Graphics are not the best, but the gameplay makes up for it 9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely better then Rome II  Don't think buy this",
            "review_score": "1"
        },
        {
            "review_text": "I used to play this game all the time. Recently picked it up on steam. I can see why.   Satan Approves",
            "review_score": "1"
        },
        {
            "review_text": "11 years on and this game is still in a league of its own for me! Game runs smooth as ever on my terrible laptop.",
            "review_score": "1"
        },
        {
            "review_text": "computer fritzed out a while ago, ive been tweaking to play again, super fun defenitly one of the best",
            "review_score": "1"
        },
        {
            "review_text": "This game is simply awesome I am so glad I bought this game",
            "review_score": "1"
        },
        {
            "review_text": "Gear up for epic battles!! Long live RTW!!!",
            "review_score": "1"
        },
        {
            "review_text": "another great total war game :D this time its the roman empire. if you like the total war games you probs already own this but if you don't it is a must have. Personally I like the medieval total war games better but taking nothing away from rome total war it is still a great game :D  8/10",
            "review_score": "1"
        },
        {
            "review_text": "great game simple mechanics easy to understand easy to learn and fun to play! graphics are a bit outdated but some mechanics and some of the gameplay are better than rome 2 I would rate it 9/10 and 9 instead of 10 is because it lacks realism. Of course u can mod this and then it becomes a perfect game but the original version isnt very realistic when it comes to battle &gt; there is no blood or visible wounds on the soldiers when they hit each other but other than that its great!",
            "review_score": "1"
        },
        {
            "review_text": "+ Amazing gameplay + Suberp soundtrack + Cool looking Units  - Not historically accurate at all - Sometimes derpy AI  If you buy this game you're buying the best game of the franchise, period. The empire management system is pretty easy to get into. Some of the Units like the Roman Arcani and Carthaginian Sacred Band look really cool. This game is a must to play if you're into Roman History.  The game is not historically accurate: Don't expect real characters like Hannibal Barcas or Julius Caesar. The AI will act a little weird sometimes. Making moves that don't make sense at all or attacking your cities with really small armies.  The Verdict: If you are a Strategy gamer and you don't have this game.. then please tell me, what are you doing with your life? Go get this game!",
            "review_score": "1"
        },
        {
            "review_text": "By far the best Total War game",
            "review_score": "1"
        },
        {
            "review_text": "It's good. Buy it.",
            "review_score": "1"
        },
        {
            "review_text": "do not get from steam or ebay as after a few hours of play game crashes with a programing error.",
            "review_score": "1"
        },
        {
            "review_text": "Scour the Earth killing savages, and enslaving them under Roman rule? What's not to love about this game?",
            "review_score": "1"
        },
        {
            "review_text": "Possibly one of the best, or the best in the Total war franchise, definite purchase if interested in strategic war type games.",
            "review_score": "1"
        },
        {
            "review_text": "Very much a favourite, I've played this on and off for years...can't fault it.Can't wait to try Rome 2...",
            "review_score": "1"
        },
        {
            "review_text": "I've spent a hell of a lot longer on Rome Total war than steam suggests. I had this game since about the age of 12 and used to play it on my terrible laptop. 7 years later, I still play, by far the best strategy game ive ever played.",
            "review_score": "1"
        },
        {
            "review_text": "This game never gets old, even after all these years. I still love it like the first time I played. This game you can play over and over and the only thing that can happen is you get better at it. It would be nice if they would remastered the game, since we are seeing a lot of that lately. But either way I recommend the game.",
            "review_score": "1"
        },
        {
            "review_text": "Still my fave total war game, and thats saying something cause its many sequels are graphically awesome. Just something about the balance of units and the smoothness of the game engine still wins me over.   5/5  (You should get the greek campaign for the spartans alone XD)",
            "review_score": "1"
        },
        {
            "review_text": "Friends, Romans, countrymen, lend me your non-steam version of this game! For I have more hours and saved games on it!",
            "review_score": "1"
        },
        {
            "review_text": "its a great game and all but when you get far into the campaign sea battles start to become a pain. i lost my main army and my best general because of the crap sea battles and not being able to actually fight them",
            "review_score": "1"
        },
        {
            "review_text": "Had generals with sons older then them.  12.5/10",
            "review_score": "1"
        },
        {
            "review_text": "the ganes of games 100%",
            "review_score": "1"
        },
        {
            "review_text": "  This game although it is old is definitely super fun to play. If you look past the graphics you will find yourself in a well made and thought through game which has an emersive campaign and just wont let you stop playing it.  The only negatives I have derive of the fact that I have played the newer instalments of the ''Total War'' series which would be that obviously now a days you can get much, much better total war's which have better graphics and a bigger and better campaign. Other than that I would completly recommend this game to anyone that likes strategy based games.",
            "review_score": "1"
        },
        {
            "review_text": "I only reccomend this to certain people who like slow and methotical stratigec games. It's quite slow but it's better than i expected it to be.",
            "review_score": "1"
        },
        {
            "review_text": "Want epic battles? Look no further. A great intro into these games.",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite Total War titles of all time. I have hundreds of times my shown play time in a non steam version from a decade ago. I don`t think any subsequent titles truly provided the satisfaction of the pike phalanx as this one did. The music in this title is particularily good too! So much so that Firefall stole the main menu theme for their in game track loop.",
            "review_score": "1"
        },
        {
            "review_text": "With 400 hours on this game I just had to wright a reveiw. Muliplayer is really good. If you want to see what Rome 2 is like this is a good way to show you.Plus Easy to make armys! You dont have to wait 7 hours for everyone to get their armys ready. This game is a classic if you love Total War. But the AI is pretty good. Not the best but pretty good. I got this game for hopes of being good. And I think I have spent to much time in this game. :) Overall Classic 10/10",
            "review_score": "1"
        },
        {
            "review_text": "very good game, in never be tire for play this game",
            "review_score": "1"
        },
        {
            "review_text": "For hours I played this game before Steam, I was a little boy then... Even as a little boy it was fascinating and exiting to caommand tons of armies in a metod, that was at the time innovative, and keeping a great win-streak until some 2 armies meet one of yours on an open field, then I began thinking. This game is addictive and very recommended for people who dont mind simple games with a not-so-good graphic for our time... This game got me to like the roman empire and want to know a lot about it, and about Total War.",
            "review_score": "1"
        },
        {
            "review_text": "Fuq Carthage",
            "review_score": "1"
        },
        {
            "review_text": "Great game!",
            "review_score": "1"
        },
        {
            "review_text": "Our men flee the field of battle! A shameful display.",
            "review_score": "1"
        },
        {
            "review_text": "Rome Total War is the best in the series and is probably my favourite all time game, I have been playing since release and playing total war since the days of Time Commanders the tv series with Richard Hammond.  The game is epic. i still play now and have set up a games evening just for said game!",
            "review_score": "1"
        },
        {
            "review_text": "Good game, if a little easy. Would recommend to anyone who likes this sort of thing. Battles run smoothly, if a little arcade-y, and there's a good diversity of factions, espeically with a little modding.",
            "review_score": "1"
        },
        {
            "review_text": "I got the game. i played it. i then took a sh*t after i ate pizza while i played. 17 hours later i bought medieval 2.   game no.1. played as blue people, then i went to war with greece. 5 turns later i declared to all of sciipi that january 1rst was greek people for food day, 10 turns later caesar stole of my greek human meat. i was mad, i slowly ate calimari while i f*ck*d all of rome to death.    10000000/10 i would do it again               lel. :p",
            "review_score": "1"
        },
        {
            "review_text": "The bedrock of total war  ",
            "review_score": "1"
        },
        {
            "review_text": "Played as the Germans, leader is named Ohtrad the Butcher... it wouldn't be wise for me to say what his 'achievements' were. 9/10 needed a better leader for Germany.",
            "review_score": "1"
        },
        {
            "review_text": "There is nothing more satisfying than seeing two armies clash in an epic battle. Soldiers colliding, slashing, aiming, firing. It casts a spell over me. I'm new to Total War, but the series has already captured me. Seeing an empire slowly rise to the top, watching enemies retreat simply at the sight of your massive army. The graphics are impressive for an old game, and the sounds of combat fill your head as you enter battle. The best part of this, or any Total War, for that matter, is the battles. The city-creating is well done, but the battles are stupendous. The fact that every character is simulated on the battlefield is incredible, better than most modern games could do. I definitely recommend this to fans of any strategy or city-building game, as well as fans of gaming in general. This game shocked me with its realism, and just complete satisfaction after you win a close battle, or destroy an enemy. Sometimes even losing is entertaining with the battles this game packs. The game is remarkably fun, cool, and it makes you feel immersed, like you are actually witnessing a battle. Definitely recommended. 9 /10, remarkably good, well done, and an impressive experience.",
            "review_score": "1"
        },
        {
            "review_text": "you can never get enough of the epic battles in this game. it is a must for any one who loves the total war franchise",
            "review_score": "1"
        },
        {
            "review_text": "Phalanx be OP af",
            "review_score": "1"
        },
        {
            "review_text": "Best game, cannot wait untill the second one comes out in september....",
            "review_score": "1"
        },
        {
            "review_text": "HOW TO WIN- 1. Make alliances with everyone 2. Forget about those alliances and destroy everything whilst sitting on your throne of guilt, betrayal and lies Oh, and a word of advice: set an alarm for every hour or else you'll struggle to stop playing.",
            "review_score": "1"
        },
        {
            "review_text": "Even though I have 3 hours of gameplay in this game, that is because I had to repurchases it due to losing the CD.  - One of the classic big scale war. - Dated Graphics but still give the sense of nostalgia. - Fun multiplayer, get your friends together and have a lan party. - History lesson and is very educational.",
            "review_score": "1"
        },
        {
            "review_text": "one of my best games on steam! i still remember every moment! **the best RTS, Base Building, and RPG game!!** choose your team like ( Rome or Barbarian.. etc ) and build you're castle and upgrade it! get money! attack another base And You Control your troops in the field! NICE STRATEGY GAME! make your people happy or they will stand against you!! make alliance with other regions and more =D there's so much to tell about this game but i don't want to spoil it! or them!",
            "review_score": "1"
        },
        {
            "review_text": "The pinnacle of the Total War series. One of the best games I've ever played. Too bad the Total War series has just gone downhill from here. Very sad.",
            "review_score": "1"
        },
        {
            "review_text": "cus swag",
            "review_score": "1"
        },
        {
            "review_text": "ROMANES EUNT DOMUS?!  Rome: Total War is what you play when you want to tell the Romans to go home, or vice versa.   It's the third game in the Total War series, and the first to introduce the gameplay template it still uses today. Gone are the 2D battlefield models and Risk-style campaign map from the first two games, replaced with 3D models and a strategic map you can use to finely position units and armies. Gameplay revolves around managing your territory in a turn-based strategy mode and moving armies around the map to fight opposing armies and capture or defend settlements in a real time tactics mode.  This particular entry is widely regarded as a classic, and with great value to boot. It can certainly suffice for people who can't afford or run the later games in the series. Unfortunately the game is optimized to run on only one CPU core, so newer computers might run into some trouble anyway. As this is still only the third game in the series, there are some things in later titles that are lacking in this one such as resolutions above 1600x1400. Something to keep in mind, at least.  The Gold Edition comes with the Barbarian Invasion expansion that takes place during the fall of the Roman Empire, adding new factions and some new features such as hordes &amp; religion; well worth playing after the base game. There's also a  second expansion-slash-DLC  available separately that lets you play as Alexander the Great, and it's required for some of the more popular mods to run.   The vanilla game is a good way to get the hang of things, but from the disorganized battle lines to the historical inaccuracy I wouldn't recommend playing for any extended period of time. To wit: the Greek city-states form one faction (just one) while Rome is divided into three  gens  that each get their own faction. Egypt, meanwhile, looks like it walked out of a timewarp from 1000 BC instead of the Ptolemaic empire it was at the time of Rome's ascent.  There's a number of mods that overhaul the game to fix these issues and more, including (nominally) improved AI, which has always been a weakpoint of the TW series - with the exception of the first two games, which used Risk-style troop movement that's easier for AI to understand. Two of the most popular RTW mods include Rome Total Realism and Europa Barbarorum, the former being a general overhaul of the game and the latter being much more realism-focused to the point of near simulation.   I'd recommend this as an entry point into Total War for people on a budget. It's probably better than Rome II at any rate; even with the many improvements that game's had since its disastrous launch it's still a game about ancient warfare that uses an engine Creative Assembly intended for Napoleonic warfare.",
            "review_score": "1"
        },
        {
            "review_text": "I recommend because it bring me to the old days when empire earth came out -Lil bit older then rome total war- I highly recommend if you like fighting with huge armys",
            "review_score": "1"
        },
        {
            "review_text": "It doesn't work on w10 :( Still a good game",
            "review_score": "1"
        },
        {
            "review_text": "Play as the seleucid empire take rebel towns along my border build up army attack greek town in asia minor take all of asia minor eygpt attacks a ill defended city I have 3 levy spearmen but they have 5 units of cav  I use my phalnx to victory #PHALNAZ 2 OP destroy eygpt become king of the middle east! attack athens and take it beat macedon and take it the romans are next  the juli are at war with gaul the bruti are taking some rebel towns and scipi are in africa fight cathage! invade scily and take it crush bruti make them my client state  take rome and beat scipii who owns cathage  juli die and I am the new king of rome  many years later numida is mine all that remains is germania who is HUGEEEEEEE owns france britan and lot os german city and ttowns war coe I take france and briton and peace is made I have won 10/10 would become new alexander the great",
            "review_score": "1"
        },
        {
            "review_text": "Awesome, awesome, AWESOME.  Game doesn't get boring even after hundreds of hours, old but gold. There are some small issues like if you play with more than 1 core, which causes lag (atleast for me)  Still one of the best games out there!! THIS IS SPARTAAAAA!!!",
            "review_score": "1"
        },
        {
            "review_text": "If you have a hand and a computer you need this game. You can't imagine the satisfaction you get from building up an army over time and to clash it against another army almost twice the size but to come out on top because of your masterful strategy you have crafted over time as the game progresses. It's a must have if you like games like civilization and lotr::bfme",
            "review_score": "1"
        },
        {
            "review_text": "It's a good game, but i simply don't play it that much :D",
            "review_score": "1"
        },
        {
            "review_text": "great game",
            "review_score": "1"
        },
        {
            "review_text": "Truly an amazing game. It captivates you for hours, as you delve into all the fine details of the game.",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game!",
            "review_score": "1"
        },
        {
            "review_text": "pass history class 101",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I used to play this game when I was younger with my cousins. Haha we had a hard time figuring out how to play this game when it look so cool as little soldiers ran across the battlefield fighting each other. Now I found it again years later and I'm totally getting into it again! It's fun conquering other territories and having a huge army to command!",
            "review_score": "1"
        },
        {
            "review_text": "Love this game!",
            "review_score": "1"
        },
        {
            "review_text": "Rome: Total War is a classic that remains a great addition to any strategy lover's library. The only cons worth mentioning are performance problems on newer PCs and outdated graphics, both of which can probably be fixed through modding.  ",
            "review_score": "1"
        },
        {
            "review_text": "well what can i say about this game... besides ive probably put more hours into thisgame than i have into any 4 other games combined... i just love the combat and the history... and yes the main map is kinda ehhh but still awesome game",
            "review_score": "1"
        },
        {
            "review_text": "was amazing 10 years ago and its still amazing now 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Similar to Civilization, however you're able to manage your economy more and you're actually able to fight battles. The game is hard and the simple, let me conquer everything won't work without the magical add_money 40000 in console",
            "review_score": "1"
        },
        {
            "review_text": "For classic Total War fans/ older desktops or laptops. Got it for $0.99 so really when would it be a bad deal at that price for the amount of time you put into the game? Hell even if you have never played a game like this and you just play the tutorial and decide you do not like it but cannot refund(if you play it that long) - hey, was just $0.99, you really need McDonalds that bad?",
            "review_score": "1"
        },
        {
            "review_text": "Old but still very much gold.  Bit clunky, but still very good compared to other strategy games. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "After all these years still one of the best games i've ever played",
            "review_score": "1"
        },
        {
            "review_text": "Best Total War game till today. If you like strategy and conquering worlds this is the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "The perfect blend of turn-based strategy and real-time tactics.",
            "review_score": "1"
        },
        {
            "review_text": "The Total War series have been one the best series in the history of gaming. Rome stands out as a classic that can still be enjoyed like ever before.",
            "review_score": "1"
        },
        {
            "review_text": "The only Total War game I need. Plenty of mods to keep you going forever. A time when all involved knew what they were doing. Before the dark times.",
            "review_score": "1"
        },
        {
            "review_text": "The 'Game changer' game. It was just one of those games that changed how I would see a strategy game. I loved it when it came out and still love playing it.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome. One of my favorite games in the franchise (because of the setting, not gameplay). Never gets old, great you can replay it over and over again.",
            "review_score": "1"
        },
        {
            "review_text": "Rome Total War is a fantastic game that I would recommend to any Total War fan and everybody else! Fun, swift and addictive gameplay, it is a game that you can revisit over and over again. I might even call it one of the best Total War/Strategy games of all time!  10/10 Would play all night long!",
            "review_score": "1"
        },
        {
            "review_text": "Best of the Total war serie. Can't get enough of it.",
            "review_score": "1"
        },
        {
            "review_text": "I really like this game. Graphics are old but still works well with. Or i'm just sucker for strategy games :D",
            "review_score": "1"
        },
        {
            "review_text": "Recommending for the dang Community badge, oh and the game is amazing too.  EDIT: And now the nomination badge. Yes this is a throwaway review...",
            "review_score": "1"
        },
        {
            "review_text": "A classic. I remember when I was little and saw a copy of it in GameStop. I saved up my money to go buy it and damn did I have some great times with this game :) 10/10 best game ever made.",
            "review_score": "1"
        },
        {
            "review_text": "Greatest game ever made!",
            "review_score": "1"
        },
        {
            "review_text": "My favourite game to play",
            "review_score": "1"
        },
        {
            "review_text": "My biggest 2 issues with this game:  Campaign: Holding large territories is virtually impossible due to unrest, I guess that is historically accurate (even on easy), but counter-intuitive to your objectives.  Battles: Unit and camera control are both a disaster. Why they decided against a traditional RTS camera (even though there is an RTS camera option in the game) is beyond me. Moving the mouse to the sides rotates the camera instead of scrolling the map...same goes for the arrow keys. Units themselves are hard to control and rarely do what you tell them to. Want your cavalry to attack a certain squad from behind? Well, first you have manually move them to avoid all other enemies in sight and then they may still attack the wrong enemy. Battles frequently look like masses of pixels trying to get to the enemy, but the game engine doesn't allow that.  A good example of how to do it right would be Dawn of War. Here units first engage in ranged combat, but when they are forced into melee they are actively looking for a direct opponent instead of creating 2 big masses of armies that patiently wait until the front line disintegrates. You can micro manage some of that, but honestly, it's really annoying and just lazy in my opinion.  Apart from that the game is actually pretty good if you're looking for Grand Strategy and the historic battles you can replay from the menu are fun and challenging, but also give you interesting info about what happened back then.",
            "review_score": "1"
        },
        {
            "review_text": "My biggest 2 issues with this game:  Campaign: Holding large territories is virtually impossible due to unrest, I guess that is historically accurate (even on easy), but counter-intuitive to your objectives.  Battles: Unit and camera control are both a disaster. Why they decided against a traditional RTS camera (even though there is an RTS camera option in the game) is beyond me. Moving the mouse to the sides rotates the camera instead of scrolling the map...same goes for the arrow keys. Units themselves are hard to control and rarely do what you tell them to. Want your cavalry to attack a certain squad from behind? Well, first you have manually move them to avoid all other enemies in sight and then they may still attack the wrong enemy. Battles frequently look like masses of pixels trying to get to the enemy, but the game engine doesn't allow that.  A good example of how to do it right would be Dawn of War. Here units first engage in ranged combat, but when they are forced into melee they are actively looking for a direct opponent instead of creating 2 big masses of armies that patiently wait until the front line disintegrates. You can micro manage some of that, but honestly, it's really annoying and just lazy in my opinion.  Apart from that the game is actually pretty good if you're looking for Grand Strategy and the historic battles you can replay from the menu are fun and challenging, but also give you interesting info about what happened back then.",
            "review_score": "1"
        },
        {
            "review_text": "A true classic, Rome: total war is my personal favorite in the series and has a lot to offer, between the real time battles and the turn based campaign there is a lot to like.",
            "review_score": "1"
        },
        {
            "review_text": "Doesn't work on Windows 10. So a complete waste of money if you have that OS.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't buy this game if you have Intel CPU with more than one core. The game can't handle it. The more cores the worse performance is. On lowest graphics settings FPS is still less than 20, even in small battles. The worse thing is that Steam is not telling the whole thing despite army of people having the same problem. And before You say that there is something wrong with my PC, let me tell you that I can run such oldies as Civ 3 or Pharaoh with no problem.",
            "review_score": "-1"
        },
        {
            "review_text": "rome total war works great but when i try to play the barbarian invasion it doesn't work ? if thats the case i wish i could get my money back. i didnt pay for just 1 game when it says 'collection' which means i'm supposed to get both",
            "review_score": "-1"
        },
        {
            "review_text": "If you bought this to play multiplayer, ignore my not recommended and buy it immediately, as there is no other option for reliable online multiplayer at this point.  If you're looking to play the singleplayer, DON'T get this version. Buy it on disc from a retailer or online, or torrent it. Why do you ask? In returning multiplayer to this game with steamworks, which I applaud CA for doing, they completely destroyed the performance of the game somehow. No clue how they manage to mess up something so simple, but I have about 100% worse performance with the steam version of the game compared to the older, gamespy version. Another thing is that 99% of mods aren't compatible with steam Rome Total War so you're going to have trouble playing your favourite overhauls with this. Serious FPS trouble with a i7 2600k and GTX 960 on MEDIUM settings, i'm talking drops to 10 FPS in not even remotely huge battles. Unacceptable. I get a almost smooth 60 in similar conditions on my disc copy.  Pros -  Multiplayer is returned  Cons - Absolutely terrible performance for most people after the patch Incompatibility with most mods.",
            "review_score": "-1"
        },
        {
            "review_text": "I turned Rome into a communist empire oh yes mate",
            "review_score": "-1"
        },
        {
            "review_text": "I've played this game and M2TW for years, and this morning I bought RTW on Steam but there is a ♥♥♥♥ing lag in gameplay. No point buying this game, mark my words.",
            "review_score": "-1"
        },
        {
            "review_text": "doesnt work in directx12 or windows 10. ",
            "review_score": "-1"
        },
        {
            "review_text": "worst game ever cant even play the damn game requires directx 9 that downlouds all this crap on my pc.",
            "review_score": "-1"
        },
        {
            "review_text": "the game said rome total war is encounterd by an unspecified error what is that suppose to mean",
            "review_score": "-1"
        },
        {
            "review_text": "I quite like war strategy games, but this one was just kind of lacking. You just kinda move a group of guys into their group of guys, all theirs die and you lose half of yours. Works out about the same way regardless of unit types. Just isn't satisfying.",
            "review_score": "-1"
        },
        {
            "review_text": "Yeah this game blows, but you should get it anyway...probably.",
            "review_score": "-1"
        },
        {
            "review_text": "Well, since I can't install the game hard to write a review. Support has not answered my help requests for now 50 hours. I tried a number of things, verify cache, they tell you about. I run win 10 and tried using a combatibility mode, ng. I play Tropico 4 and 5 on my rig so I'm pretty sure its not my machine. So wizards of help please answer my ticket, maybe refund next step always an option. TY for brief rant",
            "review_score": "-1"
        },
        {
            "review_text": "i think that this game is beautiful...but i have only played an half of prologue. after that crash. I tryed 3 times but crash again when i attack Tarquinia. sorry for the bad english. I can t play more of this.",
            "review_score": "-1"
        },
        {
            "review_text": "You may be wondering I have not recomendded total war. Well the reason for that is quite simple. If i had just recomended it, then my review would have been lost among a sea of other reviews that also recomend it. Hopefully someone somewhere will actually see this because its in a much smaller pool. Anyway Rome total war is an excellent game, tatics while rather straightforward most of the time are realistic and you need to have a basic understanding of strategy to beat the AI on anything above easy. Every faction has different unit compositions to use so your tatics will have to change on subsequent playthroughs. Basically Rome Total war has a stunning amount of depth and historical accuracy put into it. While the graphics don't hold up a decade later, the gameplay is superior to even the sequel Rome TW 2 which came out several months ago. This game is worth the full price even today, and if your looking to get into total war, or getting your friends into total war, this is a great starting point or gift respectively. To give you some basic tatics, rome's usual goal is to when not facing phalanxes just mash your infantry into the enemy, as your infantry are essentially the greatest in the world. While there is more to it then that namely using light infantry to hold your flanks whilst heavy infantry splits the enemy down the center, using your cavaly to take out enemy seige weapons or to flank a phalanx, thats all there is to it. When playing as greece your goal is to not get flanked, as you have the most powerful phalanxes in the world and will almost never lose if you don't get flanked. Carthages goal is to use elephants and support cavalry to literaly blow holes in the enemy line and crush enemy morale, whilst your infantry pin the enemies center or flanks in place, depending on the lay of the land. If your parthia you want to make the enemy chase you and use hit and run tactics as you have the best cavalry in the world, and the greatest horse archers to ever live. and so on. Basically buy this ♥♥♥♥ing game.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't waste your time or money on any Rome game. You'll see a lot of unhappy players if you read the comments in the boards. I can't get the application to load after playing the training mod a few times. Oh, I get the introductory animations but my excitement wanes as soon as the screen turns forever black when the actual game loads. Sega's so-called technical support puts the blame on video and sound drivers. I have the 'best' sudio driver, but AMD recommended a different video driver. It did not change anything. How long does it take Sega to debug a game? Rome has been out a long time, hasnt it?  I would have liked to try the Napoleonic Total War, but I'm not wasting anymore money on Sega.",
            "review_score": "-1"
        },
        {
            "review_text": "It took me a while to learn how to manage playing the game and after while I was enjoying it. It was a very informative experience, like reading about the soldiers, learning how to properly manage being general and learning how to budget my empire. But after a few days it got stale, it felt like a never ending game of chess where I had to perform the same objectives over and over. Rome: Total war is not a bad game, it just was not for me.",
            "review_score": "-1"
        },
        {
            "review_text": "It wont start for me. Crashes on launch :( It's a great game, its just I cant give it a thumbs up until I fix this problem. I hope I just didnt waste my money.",
            "review_score": "-1"
        },
        {
            "review_text": "Missed it back when it first came out and decided to give it a go in 2013. Huge mistake. The game is way dated and the gameplay is very stiff. Also, the game maps are boring. I'm sure it was great when it first game out, but this game has aged terribly. I'd say if you haven't played this game, pass on it. If you are a fan from back in the day, it could be worth it for nistolgia value.   Not a huge fan.   5/10",
            "review_score": "-1"
        },
        {
            "review_text": "Total war is a cross between Turn Based Strategy and Real Time Strategy genres, sadly it fails at both. The fights are bland and unless you really enjoy spending 45 minutes of mind numbing unit micromanagement for each battle you'll just let the AI auto resolve conflicts. All you are left with is a mediocre turn based campaign map with military centric building like which barely rivals browser based RTS MMOs (The mechanics are really that simplistic).   I've only put in a few hours on this game because honestly I don't see the point. From the very start I had problems with the game, glitchy problems. The tutorial cannot be saved; if you can't sit down and play it for 1 hour straight just forget about the tutorial unless you want to leave the game running in the taskbar while you are away. Then, when I finally got the time to play it for one hour straight, the camera glitched and kept panning to the lower right corner of the map. Since I couldn't save the tutorial I had to quit and start it all over AGAIN for the third time.   So I'm through the tutorial, now what? Time to conquer the known ancient world for the glory of Rome! Woot! Three battles later and my mind is changed, this is just boring and pointless. Every battle seems to be pretty much the same, you set up units and let the killing commence. Unit collision never seems to work and in R:TW it means your units behave like daft plebeians; trying to get them all through a gate, ha, half of them always split off and the rest of the time what? Do you really enjoy watching 1000 virtual units fail at each incessantly until the other unit's demise? How about friendly fire? Good stuff right? Your archers mowing down your own army because you forgot to click each archer 'card' and tell them to stop it! How about a real cool zoomed in shot with arrows flying into the camera, cool right?!   It is cool the first couple of times but the *cool* factor wears off real quick and you are left struggling to control 1k units who are completely lost without your incessant management.   The main map is really no better, it's even more focused on military then your run of the mill RTS. I was really hoping for something more akin to Civilization in depth where you actually gather multiple resources and manage your production but here all that seems to matter is hording gold through exorbitant taxes. This way you build more boring buildings that your citizens need to be happy so you can train more boring armies so you can fight more boring battles at the Senate's behest. Are you bored yet?   I think the original title for this game must have been 'Rome: Realistic Battle Simulator' but when first screened to an audience the reception was lukewarm so they changed it to something sexier.   TLDR, Unless you really enjoy overly simplistic empire management where every RTS battle is 30 minutes or more of the exact same assault plan I recommend you pass on this glorified combat simulator.",
            "review_score": "-1"
        },
        {
            "review_text": "After playing a ton of Empire Total War and Shogun 2 Total War, this game just does not compare. I had played a bunch of this game back when it was released, and I loved it. Compared to more contemporary Total War games it just does not hold up. So many of the game mechanics are frustrating. It will make you yell at the screen. Things like moving troops around during a battle is handled so much better in Shogun 2 that you are going to be at a complete loss as to why they didn't do it sooner and how did you have march your armies north against Gaul in the past.",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this game to enjoy it and i cant even play it. Please do something to fix it or else i do not recommend this game to anyone else",
            "review_score": "-1"
        },
        {
            "review_text": "Lacked a lot of the balance and structure of the Medieval Total War 2 game that I found so immersive.",
            "review_score": "-1"
        }
    ]
}