{
    "app_id": 476460,
    "name": "Picross Touch",
    "release_date": "2016-08-24",
    "developer": [
        "Jon Gallant"
    ],
    "publisher": [
        "jgallant"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Workshop",
        "Steam Cloud",
        "Steam Leaderboards",
        "Includes level editor"
    ],
    "genres": [
        "Casual",
        "Free to Play",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Casual",
        "Indie",
        "Free to Play"
    ],
    "achievements": 18,
    "positive_ratings": 576,
    "negative_ratings": 54,
    "price": 0.0,
    "description": "Find the hidden image in this fun and addictive logic puzzle game. All puzzles have unique solutions, ensuring 100% logically solvable puzzle grids.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/476460/header.jpg?t=1553601940",
    "minimum_requirements": "OS: Windows Processor: Pentium 4 Memory: 64 MB RAM Graphics: Onboard Video Storage: 100 MB available space Sound Card: Any",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Picross is a logic puzzle game. Picross puzzles are also known as hanjie, nonograms, or griddlers.  I would not call myself an expert at picross, but I do really enjoy a good picross game, and have bought and completed Picross DS, Picross 3D, and all of the 'e' series on the 3DS eShop.  For experienced picrossers, this game features about 50 5x5s, about 130 10x10s, and about 180 15x15s.  Unfortunately, Picross Touch is not a good picross game. As other reviews have mentioned, this title commits the cardinal sin in logic puzzle games - multiple puzzles that I played had more than one possible solution (Easy Puzzle #51 has three solutions, for example) but only one of the solutions is recognised as 'correct'.   Additionally, the visuals are drab and lifeless, there's no music at all, the largest puzzle size is only 15x15, there's no hint systems in place for newer players, the numbers on the left and top of the puzzle don't grey out individually, and there is no timer to keep track of how long it takes you to solve a puzzle.  If you've never played a picross game before, I suggest you don't start here. If you're a fan of picross, there are better picross games out there, as well as old-fashioned puzzle books that you colour in with pen/pencil.",
            "review_score": "-1"
        },
        {
            "review_text": "I only played a couple of puzzles, just to see how this was. to give some background, I absolutely love picross, I have several games and am always eager to try out new ones, this is definitely one of the nicer ones. The interface is very obviously mobile (and the description saying it's for android, and it, well, being called picross touch, shows this is a mobile port), but honestly it's a nice game.   It's not perfect of course, a couple of complaints I have: I wish there were bigger puzzles (other free, even mobile ones, I have, you can get up to 50x50 puzzles, sometimes larger), this game currently only goes to 15x15. I tried the first and last 15x15, and they weren't too hard, though in between, there might be some really difficult ones. overall I'd deifnitely recommend this game, if you like picross and don't mind the mobile interface. I know i definitely plan to play more in my downtime.",
            "review_score": "1"
        },
        {
            "review_text": "love it! Highly reccomend to anyone, even if they arent a fan of puzzle games",
            "review_score": "1"
        },
        {
            "review_text": "It's kinda okay for a free Picross game, I guess.  The problem with these kinds of Picross games is that people who are making them does not check whether a puzzle has more than one solution. I've played a couple of puzzles, but I've already encountered one (the television with antenna) where there are multiple solutions available with the given numbers. The game just beeps when you do it, so you need to check all the different positions to solve the puzzle.  So yeah, it's fine for a beginner game but beware some puzzles have multiple possible solutions while the game will demand you a very specific one out of them.",
            "review_score": "1"
        },
        {
            "review_text": "Thanks @amber for the game! This game's great time sink, when you're bored; it's also a good backdrop when you're asleep. MingLee",
            "review_score": "1"
        },
        {
            "review_text": "It's picross. The pictures at the end are bland and monochromatic. I'd personally reccomend Paint It Back if you are looking for a good picross game. Even though it's $7.99 there's a free demo available and it's also available on iOS and Android.",
            "review_score": "-1"
        },
        {
            "review_text": "Very Addicting! Loving this Puzzle game, would recommend to anyone.",
            "review_score": "1"
        },
        {
            "review_text": "An interesting and entertaining puzzle game that has soaked up many hours of my time trying to solve both pre-made levels and workshop made levels. Highly recommended!",
            "review_score": "1"
        },
        {
            "review_text": "actully a good game scince i didn't pay any money but i wanted to help the devolopers",
            "review_score": "1"
        },
        {
            "review_text": "it's too easy... I wish there were biggest puzzles than 15x15",
            "review_score": "-1"
        },
        {
            "review_text": "Breaks the fundamental rule of nonograms, which is to never require guesswork on a puzzle. I'm a big picross fan, and when compared to other picross titles, the puzzles in this game seem bland and uninspired. My biggest gripe, however, was that even on a low resolution, this game was using up to 60% of my cpu. The whole package just seems a bit lazy.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a comptent picross game. No hidden fees or any of that ♥♥♥♥♥♥♥t.  Any complaints I have can easily be brushed off as laziness on my part, and that the game is free.",
            "review_score": "1"
        },
        {
            "review_text": "If you like puzzle and logic games, this game is for you. Hundreds of levels to keep you busy in your free time. I hope there will be new added levels and steam achievements in the future.",
            "review_score": "1"
        },
        {
            "review_text": "This game is downright addictive. It makes you think logically to solve the puzzle, but not so hard that it's frustrating or impossible. My favorite feature has got to be trying to guess what the picture is going to be before I finish the puzzle. The simplicity of Picross Touch makes it a relaxing/casual-gaming, break from my favorite RPGs.",
            "review_score": "1"
        },
        {
            "review_text": "Nice fun game that everyone understands. And it's free! Great game!",
            "review_score": "1"
        },
        {
            "review_text": "Good game to kill some time and work the brain. Some are easy but others are hard.",
            "review_score": "1"
        },
        {
            "review_text": "Seems like a game that might be boring, but as soon as you complete one level you can't stop.",
            "review_score": "1"
        },
        {
            "review_text": "No use mincing words. If you've ever had an interest in Picross, but don't have the wallet to buy a dedicated game to it like the ones on the Nintendo eShop, then this game will deliver exactly what you expect it will. It's barebones, so you aren't getting any flashy extravagance like the binary image suddenly turning into colored pixelart or animating itself. And you're not getting anything more involved that a 15 by 15 grid. You solve the puzzle and reveal the image. That's it. If you run out of puzzles, there's load of flash games online out there labeled 'picross', 'nonogram', or 'paint-by-numbers' to help you sate your thirst for more.  Other than that, the game is free, gives you what you want, and gives what you pay for. It's got workshop compatibility, so if you want to see other people's fan-made puzzles (likely copied whole ham from Mario Picross for the GameBoy) or just distribute puzzles that you made yourself, this is the platform to do so without even spending a dime.",
            "review_score": "1"
        }
    ]
}