{
    "app_id": 476410,
    "name": "One Small Fire At A Time",
    "release_date": "2016-06-10",
    "developer": [
        "Kidalang"
    ],
    "publisher": [
        "Culture Select"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Casual",
        "Adventure"
    ],
    "achievements": 21,
    "positive_ratings": 39,
    "negative_ratings": 2,
    "price": 6.99,
    "description": "13-year-old Janis has &quot;Magic Deficiency Disorder,&quot; a madness where one can't use magic in a very magic-oriented world. For her protection, she lives in a madhouse: a place where those with mental disorders can be safe from an unforgiving society.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/476410/header.jpg?t=1498999423",
    "minimum_requirements": "OS: Windows XP Processor: Intel Pentium 4 Memory: 1 GB RAM Storage: 260 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Great backstory.",
            "review_score": "1"
        },
        {
            "review_text": "This game ticked all the boxes for me. Interesting and developed setting, good characters, a gripping story and nice art. I loved the short chapters which made it easy to follow - a recent spell of depression has done a number on my concentration span, so the short chapters and clear-cut scenes were really nice.  There are lots of interesting ideas explored here, particularly about mental health. I'm always a little wary when I see something set in an asylum (as in countless horror games), but the creators had some really good observations about the nature of madness.  The setting was another plus. How magic would affect society was portrayed fairly realistically, at least to my mind, and I always love to see fantasy worlds where magic is used as another form of technology or science, rather than the standard swords, dragons and wizards set-up.  Although there is a clear 'true end', there are a number of alternates. I really enjoyed seeing how the choices affected the story, for better or worse. I like that the 'true end' is not necessarily the happiest end for all the characters...  On to characters, another plus. Although it's short, I felt the characters were well-formed. I actually liked the protagonist, so kudos is due there as likeable protagonists seem to be few and far between. I found Aidan Woolf a little lacking though, which kind of throws a spanner in the works since he's a major character...I suppose the fact that he just explains his backstory maybe made him a little flat for me. My only other complaint was the propensity for death-bed scenes - a pet hate of mine.  All in all, I really enjoyed this visual novel. Do give it a read, it's well-worth it.",
            "review_score": "1"
        }
    ]
}