{
    "app_id": 477270,
    "name": "Lightblade VR",
    "release_date": "2016-05-31",
    "developer": [
        "Andreas Hager Gaming"
    ],
    "publisher": [
        "Andreas Hager Gaming"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Action",
        "Simulation",
        "Indie"
    ],
    "achievements": 0,
    "positive_ratings": 440,
    "negative_ratings": 95,
    "price": 2.79,
    "description": "Lightblade VR is a virtual reality training simulation for self-illumintated plasma blades. This is a childhood dream come true! Get trained by your personal robot and deflect all incoming laser beams!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/477270/header.jpg?t=1470089258",
    "minimum_requirements": "OS: Windows 7 Processor: Intel i5-4590, AMD FX 8350 or better Memory: 8 GB RAM Graphics: Nvidia Geforce GTX 970, AMD Radeon R9 290 or better DirectX: Version 12 Storage: 700 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Lightsabers   All you need to know.",
            "review_score": "1"
        },
        {
            "review_text": "Kudos for being the first lightsaber-esque VR game out, and for being relatively cheap. If this game were made for non-VR it'd probably be sold for 50 cents or less - I consider the additional $3.50 to be a VR-dev tip (which they greatly need, given that the number of VR owners is so insanely low compared to the rest of the market).  Anyway, with that in mind, I'm going to review this game as if it were 50 cents.  Pros:   The blades have a great Star Wars feel to them  The game is a fun thing to entertain a guest or yourself for a few minutes of down time  Cons:  Not enough content to make you play this game longer than 20 minutes or so.   Beatable in less than 10 minutes  Blade glow is far too bright  Way too easy (if the dev shrinks the hitboxes on the blades and increases the speed and frequency of lasers, this could be fixed)  Overall:  This game is short and easy, but also fun and relaxing. It's worth 50 cents, plus $3.50 VR tip. My main hope is that the developer makes it harder, which would keep me coming back for more.  Note: I beat the whole thing in less than 10 minutes. You probably will too. There isn't much content and it's extremely easy. I recommend playing only on legendary mode and leaving one of your sabers off. That makes it a bit harder, but it's still so easy I doubt many people will have trouble getting 100% deflections.",
            "review_score": "1"
        },
        {
            "review_text": "Fun on Legend difficulty. But still too easy. I got 100% on my first try on legend.  Please make harder. I would also suggest reducing the glare of shots that hit your lightblade, makes the second shot impossible to see.  Maybe add multiple balls?  If you make this game challenging like Pirate Space Trainer and i would definately recommend.",
            "review_score": "-1"
        },
        {
            "review_text": "For $3, I don't know if i'd say this isn't worth it nessesarily, but you have to understand that you're getting exactly what you pay for. This game is beyond shallow. There's no depth whatsoever. There's almost nothing to do. It's more or less a tech demo. Is it a good tech demo? Yeah. But it's not a game. At the time of writing there's not really anything else scratching that VR Lightsaber itch, so if your really just want something else to help you demo VR to people or just REALLY need to swing your own lightsaber for a bit, it's not a terrible buy.",
            "review_score": "-1"
        },
        {
            "review_text": "Get you pumped up in just few mins!!",
            "review_score": "1"
        },
        {
            "review_text": "The game has potential but it's too repetitive, you don't even need to move your hand that much. It's cool that you can use two lightsabres but you will manage just fine using only one which is a little let down. I played through level4 in less than 20 minutes. Level 5 seems to be level one through 4 (this might change), that's when I considered it to be a waste of time so I quit. I will say again that it has potential so I will revisit the game after a few updates but for now I have to give it a thumbs down.",
            "review_score": "-1"
        },
        {
            "review_text": "This is really cool. The feeling of turning on your  nonstarwarsbrand  Lightblade for the first time is a little bit breathtaking. Not to mention you feel like a super badass deflecting lasers.   Just holding your  nonstarwarsbrand  Lightblade's out in front of you can sometimes be an easy way of deflecting, but I've been surprised more than once by a laser sneaking past my defenses. But it's so much more satisfying to actually deflect the lasers by swinging.",
            "review_score": "1"
        },
        {
            "review_text": "+cool for 4 bucks -anyone else getting one random bullet coming at you SUPER fast where you cant react?",
            "review_score": "1"
        },
        {
            "review_text": "Fun Game at first, then this gets very repetitive. It took about 40 mins to finish the game and all its modes. This game is great for those who like Star Wars and always wanted a lightsaber. But this game can use alittle more mojo. The rookie level is something to laugh at and the legendary can be done with one saber if you pay attention. Shots come at you slow and most shots can be deflected by holding your saber in front of you. There is also a mode where you have to survive 250 shots which at first was, I thought, to be hard but with the above comments this was rather easy.  Ways I would improve this game would be to: 1) add troopers/droids that come in waves. You teamed with a squad that you can control with commands from the touchpad (selecting targets, giving individual soldiers an area to cover, using the grips on controllers as force push/pull etc.)  2) make the lasers travel faster. Right now its like playing catch with a 5 year old. And add another bot for an even harder mode. 3) this one is being picky but the saber needs to be faster when deployed. Seems slower that what is seen in movies.  Overall I still would recommend it. Its fun and can burn about an hour of time if needed. I dont think i\\'ll be playing this now that i\\'ve completed it all.",
            "review_score": "1"
        },
        {
            "review_text": "Epic feeling to hold the lightblade! Feels like you are in the MOVIE! Thanks so much to the DEV! Hoping to see more AREAS and of course a few more bots variations would be great! Worth every penny if you want to experience and side of the force! ",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun mini game - so much potential here! Really want to see a fuller game around these awesome 'lightblades'.  F you copyright bullsh!t.",
            "review_score": "1"
        },
        {
            "review_text": "Super fun, cheap Jedi simulator. I like playing with one controller only instead of two, but either way its a blast. The new desert mini game is really challenging and fun as well.",
            "review_score": "1"
        },
        {
            "review_text": "Great little game. Not much to it but worth the price.",
            "review_score": "1"
        },
        {
            "review_text": "Jep it feels good to have kind of a laserblade in ur hands.  But that's it. Very simple boring gameplay, don't even have to move to win. Just turn your hands a bit to block the laser shots coming in one straight line from one source. At least for the first lvls...  I expected more for € 4.-, but hoping for updates. There are free demos that are way more interesting! Sry, but that's not enough :(",
            "review_score": "-1"
        },
        {
            "review_text": "A bit simplistic (ok a lot) I was board after 5 minutes. Still I had to get it for my grandkids. Hoping it gets improved. turning them on - it lacks the SLOWLY expanding light of the movies. It would be cool if crossed if one or both arc\\'ed at that point of contact. Some things around to slash? or \\'fruit Ninja\\' mode. The trainer ball up close and moving around you would be nice. I lost interest before completing novice.  supports VIVE so I have to recommend it at 3.99 But at 50% off would be better pricd.",
            "review_score": "1"
        },
        {
            "review_text": "Short Review: I'm a Star Wars fan. I bought this game, played it for a few minutes, realized there was virtually nothing to do, and stoped playing it. Wouldn't recommend buying this unless it's on sale for $0.99, and even that might be too much.  Long Review: Honestly, I thought I'd love this game. I'm a huge Star Wars fan. I've seen all the movies, watched the TV shows, and played most of the video games. So when I got an HTC Vive I was one of the many people who wanted a Star Wars game in VR. Sadly I can't even call this a game. The entire game is literally you, a lightsaber as your controller, and a training remote. That's it. While it was cool to pretend your holding a lightsaber and deflecting blaster bolts, the feeling quickly goes away as you realize there isn't anything else to do. There's no stoormtroopers, force powers, or anything really. I realize that this can't literally be a Star Wars game thanks to Disney and EA, but there needs to be a lot more in this 'game' for it to be worth $4. I can't recommend this, even to star wars fans, because there's just nothing to do. This is possably the shortest time I've spent in a VR game. Really dissapointed. Don't fall for the hype. Wait till it's on sale for $0.99 or less, then you too can play it for 10 minutes and never play it again!",
            "review_score": "-1"
        },
        {
            "review_text": "Definitely builds skill and reaction time. Pretty challenging!",
            "review_score": "1"
        },
        {
            "review_text": "With the added contect it is good fun. Its not great but its worth the 3.99 price tag now. I didn't recommend the game earlier because it was very shallow in terms of content but now its a lot better. I still wish there was more content but its worth the immersion. Its better than the actual star wars free game/demo released recently.",
            "review_score": "1"
        },
        {
            "review_text": "A great little VR game. For it's price it's an absolute no-brainer, even though one can't expect story or binding through grinding. If you like lightsabres, like wielding dual swords and are searching for a basic workout, pick this up.",
            "review_score": "1"
        },
        {
            "review_text": "It's fun. There isn't much to do, and it's super hard, but it's pretty fun. For 3€ it's a really cool game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is easily worth the asking price. The sabers are extremely realistic, and the new 'Desert Temple' has made a fun diversion, into a full fledged VR game. Much fun!!",
            "review_score": "1"
        },
        {
            "review_text": "WOW! Great concept and looking forward to more from this developer! Playing this on Vive is great with the movement tracking. Dual-wielding is a little too easy, but single blade is a ton of fun. It feels like the hit boxes are too lenient, but hopefully some difficulty adjustments will be available in the future. I\\'ll be playing this a ton more when my new video card comes in.  Edit: This game gets a lot more fun when you try to dodge and reflect at the same time. Don't be a couch potato. I get a kick out of quickly swinging for a reflect instead of just holding the blade in front of me.  Games like this are why I play games, and why I have faith in the future of VR. Keep it up devs!",
            "review_score": "1"
        },
        {
            "review_text": "Definitely recommended. However, be advised that if you have any young padewans around your house, you will probably never get your Vive back. Not without tears anyway.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing!!! Thank you for making this, my want fot a Star Wars VR experience has been satisfied for the moment,",
            "review_score": "1"
        },
        {
            "review_text": "I have wanted to do this for over 30 years, and this is probably the closest I have ever been to holding a lightsaber!   The game is not much of a game, all it is is blocking lasers being shot at you. There is limited customization, and only 1 level.   You probably wont spend more than 10 hours on a game like this by yourself, but the game is pretty inexpensive and a ton of fun!  ",
            "review_score": "1"
        },
        {
            "review_text": "Good feel, love the feedback in the motion controllers! Looks great, one of the better VR experiences so far!",
            "review_score": "1"
        },
        {
            "review_text": "awesome fun .short though AA",
            "review_score": "1"
        },
        {
            "review_text": "Could be good with some work, but right now its just too basic.   How to improve this game: Add more training drones. Allow dodging to count toward leveling up. Reward the player when you manage to reflect a bolt back into a drone. Have them shoot from several directions.   As is, its not worth 4 bucks.",
            "review_score": "-1"
        },
        {
            "review_text": "Very simple, but if you are a Star Wars fan, then it its must for you. Otherwise wait for Fruit ninja comming later this month (June).",
            "review_score": "1"
        },
        {
            "review_text": "This is a good start, and $4 is a perfect price for it. The look and feel of the game are top-notch and unlocking new sabers is a fun incentive to keep going. The first couple difficulty levels are pretty dull, but later modes (including the final difficulty level, survive 250 lasers) are better.   For future updates, would love to see the following: - Harder &amp; faster difficulty modes - Ability to replay survival &amp; other game types as an arcade mode - Double-bladed sabers - Kylo Ren-style 'exhaust' blades &amp; hilts - Multiple robots! This is the big one. With only one robot, this is a waiting &amp; listening game more than anything else. Multiple enemies would make blocking lasers much more intense because you'd have to react quickly to something that you're not already facing.",
            "review_score": "1"
        },
        {
            "review_text": "Sadly, this game proves that I am not Cutout to be a Jedi or Sith Lord.  I guess Storm Tropper Academy for me then!!",
            "review_score": "1"
        },
        {
            "review_text": "A neat little demo that is fairly mechanically sound and gets every star wars fan a little giddy playing this. Notice I said demo, because that's all it seems like at this moment. It doesn't have a lot of content to it outside of lazer deflection training and one mission.  But I'd say the biggest flaw it has right now is the lack of ambient sound and music. It's missing the low hum in rooms and the sounds of soft winds along miles of open desert and of course and appropiate soundtrack that ramps up when the action starts.",
            "review_score": "1"
        },
        {
            "review_text": "simple. easy. and cheap.  great fun for 20 min. and something you can show off to friends and visitors.  and for the secret jedi/sith out there, now you can finally get some lazer parry training done.",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun, but it does get old rather quickly. If you want to see what it's like to deflect shots with a lightsaber, this is the best example of that by far. The dev has added some content since release, and I'm hoping more content is on its way.",
            "review_score": "1"
        }
    ]
}