{
    "app_id": 477310,
    "name": "Space Hole 2016",
    "release_date": "2016-09-02",
    "developer": [
        "Sam Atlas"
    ],
    "publisher": [
        "Mr. Sam Atlas"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Full controller support"
    ],
    "genres": [
        "Indie"
    ],
    "tags": [
        "Indie"
    ],
    "achievements": 1,
    "positive_ratings": 43,
    "negative_ratings": 6,
    "price": 0.79,
    "description": "YOU GOTTA GO IN THE SPACE HOLE In the near future, humans discover the missing piece for faster-than-light travel: giant glass spheres. Navigate your ball through the space hole(s).",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/477310/header.jpg?t=1539402283",
    "minimum_requirements": "OS: Windows 7 Processor: Any multi-core Memory: 2 GB RAM Graphics: Any DirectX 9.0 DirectX: Version 9.0 Storage: 500 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "refunded no mans sky to buy this for all my friends",
            "review_score": "1"
        },
        {
            "review_text": "i love it for the cheap prise it is worth every penny",
            "review_score": "1"
        },
        {
            "review_text": "It was worth the 59 cents I gave for it, it was worth about a dollar in content. Don't do the M mode by the way, just makes the game not fun. Just escape to the map so you can revisit it if you want. If you want numbers, 110 missions are needed to do the ending mission, and I skipped like maybe 5 missions. It's super fun from start to middle, but the end has a mix of fun and just kind of bs really thin lines. Not enough bs missions to stop you from getting to the end, though. It's good. By the way if you find an elevator in a level select, wait until you   unlock the bomb to jump up. I spent too long trying to get up without it.   Yes there is a mission up there, it's the little floating cube. I got up there once and didn't notice it was a mission so I jumped back down. HORRIBLE mistake.",
            "review_score": "1"
        }
    ]
}