{
    "app_id": 477770,
    "name": "Ride 2",
    "release_date": "2016-10-07",
    "developer": [
        "Milestone S.r.l."
    ],
    "publisher": [
        "Milestone S.r.l."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Online Multi-Player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Racing",
        "Simulation",
        "Sports"
    ],
    "tags": [
        "Racing",
        "Simulation",
        "Sports"
    ],
    "achievements": 35,
    "positive_ratings": 1360,
    "negative_ratings": 245,
    "price": 29.99,
    "description": "The fastest and most iconic bikes in the world's biggest digital garage!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/477770/header.jpg?t=1496218852",
    "minimum_requirements": "OS: Windows® 7 SP1 / Windows® 8 / Windows® 8.1 / Windows® 10 Processor: Intel i5 2500K 3.3GHz / AMD Phenom II X4 850 or equivalent Memory: 4 GB RAM Graphics: GeForce GT 640 / Radeon HD 6670  1GB* DirectX: Version 10 Storage: 33 GB available space Sound Card: DirectX compatible Additional Notes: *Laptop versions of graphics cards may work but are not officially supported.",
    "recommended_requirements": "OS: Windows® 7 SP1 64-Bit / Windows® 8 64-Bit / Windows® 8.1 64-Bit / Windows® 10 Processor: Intel Core i5 4670K 3.4 GHz / AMD FX-9590 4.7 GHz or equivalent Memory: 8 GB RAM Graphics: GeForce GTX 970 / AMD Radeon R9 390 4GB* DirectX: Version 11 Storage: 33 GB available space Additional Notes: *Laptop versions of graphics cards may work but are not officially supported.",
    "reviews": [
        {
            "review_text": " 'Best motorcycle racing game on the market.' - Me",
            "review_score": "1"
        },
        {
            "review_text": "#TOURIST TROPHY-PC# If you remember one of the best old school bike games,I bet that TOURIST TROPHY will definitely be one of your favourites. RIDE 2 - The essence of pure adrenaline and action can be easily seen in this game.The game doesnt have any optminisation issues and i can run this game on my Geforce 940m/i5 without any issues.Milestone has done a terrific job whilst giving precise details for the motor cycles and the tracks.  Likes &amp; Dislikes  Likes  1.The Optimisation 2.Bikes/Tracks level of detail 3.Bike's way of handling 4.Intelligent AI 5.Brought back the memories of old school Tourist Trophy 6.Road racing iconic tracks featuring-(Ulster GP , North West 200 , North Wales , Macau , Kanto Hills )  Dislikes  1.Bugs - (Once you go for a qucik restart after your bad crash,the bike auto shifts even under manual transmission option) 2.No ISLE OF MAN :( , though we have Macau , Ulster and even NW 200,,,,,road racing fans can get utterly disappointed with ISLE OF MAN 3.Online-I can hardly fiind either a lobby or a room set open,only few play the game  4.No joy stick-No fun----It is better to hook up a joy stick coz key board controls are messy  Finally , I'd like to suggest the game for hard core bike lovers or people who'd like to shift the gaming pattern. I've been spending loads of time playing  PROJECT CARS &lt; ASSETTO CORSA &lt; AUTOMOBILISTA &lt; DIRT RALLY , though i'd love to play these simulators at some pint I used to get bore of and i'd wanted to shift over bikes.So, i found this beautiful game.  What are you waiting for----GIVE A GO BIKER : )",
            "review_score": "1"
        },
        {
            "review_text": "After the launch of Ride (the first one) I felt they left out some key motorcycles. They came back stronger with Ride 2, adding a great line up of bikes with detail second to none, graphically amazing tracks and superb customizability. It feels like motorcycle enthusiasts made this game, knowing what their fans would look for and they delivered!",
            "review_score": "1"
        },
        {
            "review_text": "Im love with this game",
            "review_score": "1"
        },
        {
            "review_text": "Ride 2 actually does improve on the 1st one in a lot of ways and makes it a much better game, so I'll go ahead and split this into sections so anyone debating the game due to price gets a good idea of what to expect.  Story/Campaign:  They've completely redone the campaign mode from the original game, and it now flows MUCH better and makes way more sense. The campaign is much like driveclub and the original game, but separate sections are added in to help newer players go along and learn to actually handle bikes and figure out correct racing lines before getting a literbike and smashing into every wall (Though you do get to enjoy that in the first race).  Upgrading bikes increases an arbitrary performance point value which are limited based on the event you're entering, so you actually have to watch what you do to your bike if you want to race. As far as it keeping you from becoming much faster than the competition, there's still room to improve there, as I used the NSR125 to gold every event in the first class.  Bike handling:  This is honestly the biggest part of the new game. Bikes handle MUCH better. They handle very realistic and it's much easier to control them as the game does give a bit of assistance with inputs from a gamepad for obvious reasons. As another review complained, bikes seem like they have too much grip in the rain, though this is due to the game limiting steering input (to lower lean angles) and smoothing out braking. Whether this is a bad thing is up to you. Motorcycles in the rain are very finicky and require smooth inputs, which are difficult to do with a gamepad, so I believe it's an elegant solution with a good outcome.  The supermotos are also extremely fun to race, and require an entirely different method of racing compared to street bikes. The selection of bikes included is about as big as the previous game, but the bikes themselves seem to be modeled much better and handle much more realistically than the twitchy hell that was RIDE.  Customization:  There's been a large amount of customization for bikes added, and many redundant menus were killed off from the original game (I'm looking at the wheel menu that took 10 minutes to get to the end of).  Everything has been streamlined, the race bike enhancements are a nice touch, and you can still customize a great deal on your bike. With this said, it's still a bit limited and very much like the old game, especially in terms of power modifications. I never had much of a problem with the old system save for the really long menus, but since those have been fixed I feel customization is at a very good point in this game.  AI:  The AI still leaves a bit to be desired thus far. They still seem to have trouble seeing the player and like to crash into you if you're in their way. However, it's improved by MILES since the first game.  The AI in the first race shows this, as they all followed good lines, and only the riders below 5th seemed to be braking too early into corners. At some point, I even ended up leaving 3rd place by 6 seconds and got in a battle for 1st with the AI, which led to me finishing in 1st by 0.029 seconds. In my experience, they've at least made the AI okay enough that you can play through the races with them and not get frustrated by AI crashing into you at every corner.  Graphics and audio:  The graphical enhancements do show through in-game, and I feel that it looks much better than the original. The Audio in-game has also been GREATLY improved, with bikes no longer sounding like hair dryers, but rather actual bikes. You still do need to ramp up the graphics settings in the menu to ger a proper looking game, but all-in-all this entire section of the game has been greatly enhanced and you'll most likely enjoy it.  Misc:  I'll just use this for other little problems I feel the game has:  Taking screenshots is a bit stupid at this point in time. You have to set the camera and wait for the menu to disappear so you can use steam's screenshot function, as it won't let you take a picture otherwise.  The race starts are still very abrupt, and if you're not ready as soon as the track loads in you're probably going to miss the start.  Loading times are still fairly long. They've been improved and load time gets cut in half after you've done the initial load, but it's still a good wait.",
            "review_score": "1"
        },
        {
            "review_text": "Milestone delivered. Ride 2 is the greatest motor game I have ever played.  Helmet view on The Green Hell - I am in heaven!  Certainly in my Top 3 games of the year.  ",
            "review_score": "1"
        },
        {
            "review_text": "I've played SBK, MotoGP all games, Valentino Rossi the game and this game is most realistic game, after you get into the game and start buying, upgrading and setting the bike as you prefer, the game is great. Also, there are more interesting stuff and different experience from different tracks to everything...",
            "review_score": "1"
        },
        {
            "review_text": "wow. great to see a re-branded dish up of an ever broken game. good work Milestone!",
            "review_score": "-1"
        },
        {
            "review_text": "I like the game, had ride 1, this is an improvement, update the game with more customization options, like custom paint, or at least the ability to change the color of liverys",
            "review_score": "1"
        },
        {
            "review_text": "Well this is the last time i buy a milestone game. After 6 weeks i can finally play online and still crashes. I wish there was another game to rival it because these developers are lazy as f***",
            "review_score": "-1"
        },
        {
            "review_text": "  how to quit from this game ? =.='  and i dont see joystick option...  i don't see key config too..  * i change my review.. lol   so the game, is quite fun, and all modify look like same like the first game Ride..  just more good in sound, and yea good in playing too.  8/10 from me. why i give 8 rate for this game.. because i love bike, hahaha",
            "review_score": "1"
        },
        {
            "review_text": "7/10 solid game great grafix sounds great",
            "review_score": "1"
        },
        {
            "review_text": "Great game, but not the Forza of bikes I was hoping for. It's flawed but it's as good as we're likely to get until a big AAA developer does something based around 2 wheels.  Pros:  The bikes look great. Decent handling on pro and semi-pro modes. Lots of circuits, bikes, and hopefully incoming DLC. Great rider customisation. Well optimised, good performance with options maxed out on a GTX970.  Cons:  The same generic customisation options for each bike is dissapointing. Poor enviromental graphics and textures. Some bikes feel very wonky (supermotos and some of the superbikes). Career mode progression is very dull. Multiplayer is a laggy mess.  Overall, 7.5/10 ",
            "review_score": "1"
        },
        {
            "review_text": "Ultimately I can't recommend Ride 2, despite thinking that it has a lot of really good elements: pretty solid graphics, great bikes with excellent detail and it runs solidly on my machine. Generally speaking, I *like* the 'simcade' style racing games, where traction and line and setting up corners properly are important elements, but I've just come off playing quite a bit of Forza Horizon 3, a game which has such a well-constructed loop of races, events and getting new vehicles that just moves you through the content at such a good pace--a game that feels great to just play--that Ride 2 is like hitting a brick wall of inaccessibility.  I'd actually managed to forget that I went through this with the original game when it came out. If you don't play moto GP games, even if you play other racing games, prepare to place dead last in every race even on very easy difficulty, and to do this for a very long time. Slowly you will chip away at the difficulty, and over a period of weeks you will eventually start winning races, cranking up the difficulty, and actually get to the point where the game is tense and engaging, but this is a weeks' long project. There is no gentle difficulty curve or onboarding to speak of. You are going to need to accept having a bad time for a very, very long time before you are going to be able to have any fun playing this game.   Assuming this turns out like the first one, there really is a fun game hiding in here, but it's the chipping; it's the long, tedious and unfulfilling process to get to the level of capability you will need to have to expose that game. It just kills me that once again they've made the decision to make this game basically unplayable by non-fans when all it really would have taken was the addition of easier difficulty modes that non-experts can play on, and massaging the reward curves for playing to make it just a little less of a grind to experience the game. Why throw all that hard work away on a great racing simulation by making such poor game design choices?  So as both an IRL game developer and motorcyclist I have to give this a thumbs down. SO close to greatness, but just hamstrung by making it so miserable for new players to pick up and play.",
            "review_score": "-1"
        },
        {
            "review_text": "Like the first Ride, this is one of the best Motorcycle games I've played since Tourist Trophy on the PS2. It is as difficult as you want it to be with scaling that rewards you for turning assists off (much like Forza). It's arcady enough to where anyone can pick it up, and with just enough sim aspects to keep you on your toes if you wish. Race and bike variety is great. Small displacement 2-stroke sport bikes, dual sports, top heavy naked bikes, supersports, touring bikes, classics, etc. The PP (performance points I assume) system is new to this title. Reminds me a bit of Grand Turismo's way of measuring overall performace. Many people do not like it but it keeps the races interesting by having PP limits on events so you can't just max out the tuning on an eligible bike and smoke the AI competition on every race, which was a bit of an issue for me in the first Ride. Tuning and customization options are practically the same as the first title, with just a bit extra. The bike selection and tracks are great and much improved from the previous title. It has a very accurate Nordschleife which combined with excellent controls always makes for a great racing title. I recommend both Ride and Ride 2, but so far Ride 2 is the definitive title in the series thus far.",
            "review_score": "1"
        },
        {
            "review_text": "THE BEST MOTORCYCLE GAME TO DATE. All it needs it the isle of man tt track and a few of the offical riders and this game would be complete. great fun some great bikes and tracks.",
            "review_score": "1"
        },
        {
            "review_text": "THE BEST MOTORCYCLE GAME TO DATE. All it needs it the isle of man tt track and a few of the offical riders and this game would be complete. great fun some great bikes and tracks.",
            "review_score": "1"
        },
        {
            "review_text": "If you're a motorcycle fan, buy this.   It builds on all the good things about Ride 1 and fixes the major issue from the first game... team races. It was so obnoxious that you had no control over your teammates skill level. Nothing was more annoying in that game than getting gold in every race, (which was my goal for that game) but getting stuck with bronze or silver in team races because your counterpart wouldn't place above last place. It didn't hurt your career completion, but it was sure as hell annoying if you were trying to 100% the game.  If you're looking for a motorcycle game with the customization of gear and bike tuning like in Forza/ Grand Turismo for cars, this is as close as you're getting. And it's on point.  If you enjoyed Ride 1 but felt it wasn't deep enough and got to be a grind fest, Ride 2 changes that.  It has your standard races, championships, track days, time trials, team events, and special events. But it doesn't feel stale. The various bike classes, races mixed with the challenges, customizing of your bikes, motorcycle characeristics, and online races keep it fun.  The level of difficulty is up to you. You can make it play like you're on a rail and can't brake too hard or throttle too hard. Or you can make it feel like you're playing DIrt Rally with every single assist turned off and the difficulty cranked up, giving you an equally challenging/ frustrating experience. In first gear and crack the throttle to 100%? You'll get kicked off. Gas it too soon coming out of an apex? You and your bike will go flying. Pass on the inside of a corner with too much speed then go into a slide off the track on the last lap? Have fun restarting.  The performance ratings for parts and bikes the game uses is not perfect and there is still so much to build on. But being as this series is doing something new, that's to be expected. I would love to see more brands offered for parts with some more performance variations. Maybe just offer an EJK for a slip on/full exhaust. Or allow the ability to tune the ECU so you can use the same parts/bikes in various racing classes.  Well worth the sale price in the current Steam Winter sale and still worth the full price after it's over. This can easily be a 70+ hour game not even including online races.  I love the feeling of customizing the bike I own IRL with parts I can't afford yet and ripping around a track I dream of riding.  Plus, Supermoto.",
            "review_score": "1"
        }
    ]
}