{
    "app_id": 477870,
    "name": "Yomawari: Night Alone / 夜廻",
    "release_date": "2016-10-25",
    "developer": [
        "Nippon Ichi Software, Inc."
    ],
    "publisher": [
        "NIS America, Inc."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Strategy"
    ],
    "tags": [
        "Adventure",
        "Horror",
        "Cute"
    ],
    "achievements": 27,
    "positive_ratings": 728,
    "negative_ratings": 184,
    "price": 14.99,
    "description": "A quiet evening stroll takes a turn for the worse as a tragic accident befalls a little girl and her dog. When her sister goes missing later in the night, the little girl decides to venture out into the eerie darkness to search for her loved ones as evil spirits haunt the alleyways and streets of her once-peaceful town.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/477870/header.jpg?t=1510281008",
    "minimum_requirements": "OS: Windows 10/8.1/7 Processor: Intel Core i3-2310M 2.10 GHz Memory: 2 GB RAM Graphics: Intel HD Graphics Family (HD 4000) DirectX: Version 10 Storage: 2 GB available space Sound Card: Realtek High Definition Audio",
    "recommended_requirements": "OS: Windows 10/8.1/7 Processor: AMD A10-5800K APU with Radeon™ HD Graphics Memory: 2 GB RAM Graphics: NVIDIA GeForce GTX 560 Ti DirectX: Version 10 Storage: 2 GB available space Sound Card: Realtek High Definition Audio",
    "reviews": [
        {
            "review_text": " Highly Recommended That You Wait For This Game To Go On Sale   TL;DR - This is a short puzzle game (even with a bit of exploration on my end it only took a little over 6 hours to complete), and the strategy tag is a mislabel. Still a fun play, but not for $20.  ========  Coming on the heels of Firely Diaries, and considering it was a handheld game, I didn't expect a long trip. The overall atmosphere is self-explanatory - a quiet town in the dead of night. No music to intensify or interfere with the experience. Just silence and ambient noises.  Since the game is played top down, it's less of a horror game (cute tag is of notable detriment) and far more of a puzzle adventure. The strategy tag really has no place up top, considering it's pretty basic what you can do: hide, run, and die. There  is  a tiptoe option for movement, but I never found a use for it. Almost all the enemies are triggered by proximity, and distracting them with objects tended to only work on a few of the basic ones. Knowing when and how to hustle is your best (and later on only) friend.  The difficulty is fairly casual, in that items you pick up are still in your log/inventory even after death. While this means some puzzles can be entirely negated by suicide running them, the intent was to soften the blow when confronted with the larger stretches of the game where save points are infrequent or don't exist. This is worthwhile in several scenarios beginning around the third chapter.",
            "review_score": "1"
        },
        {
            "review_text": "In this game you play as a cute, little girl trying to get kidnapped for an achievement.  I also killed my dog during the tutorial.  Actually this is a really cute game, and pretty spooky when you're still learning what it's all about. I went in blind and just set my head on exploring and it was a mystifying experience. The game's always throwing new things at you to try and get you out of your comfort zone. Sometimes you might get lost and confused on what to do next because there's something spooky in the way, but pay attention and keep checking your map and you'll never get stuck. Each monster or ghosty goo has their own little rules regarding light, sound, or speed, so try whatever seems sensible and you'll probably be fine.   This little girl can run for blocks at a time as long as she isn't freaking out. Pretty fit. Good cardio. Will probably die of a heart attack when she's older though. Bless her soul.  Also, if you're into collecting items and completing lists (I know I am) you'll definitely still have things to do after completing the story. (There's a giant cat head in the trailer and I didn't even run into that in my game...)  With that said, I finished the game in about 3-4 hours so I'm not sure if it's worth the $20 price tag when compared to some other games which easily have more content for the same or lesser price... but that's what Steam sales are for I guess.  Overall I'd give this a cute and spooky out of ten. A cukey. Cuke out of ten. I'm gonna google that now to see if it's a real word.  PS - I still haven't got that achievement. PPS - A week later I finally got the achievement. Spooked the crap outta me when it happened. Nice.",
            "review_score": "1"
        },
        {
            "review_text": "Have really enjoyed this game so far. Jump Scares galore, can be a bit frustrating though as you figure out how to avoid the jumpscares but never the less this game is a good little horror.",
            "review_score": "1"
        },
        {
            "review_text": "This game couldn't even start up properly, no patch to fixed this game for a month (bought on halloween) , no respond on community as they said 'Post it in troubleshooting we will reply right away'   if you are a Window 7 user maybe you will get lucky and fix this problem like other player said but if you are a Window 10 user you're ♥♥♥♥.  In conclusion 'I RECCOMEND TO BUY THIS ON PSVITA IF YOU ARE A WINDOW 10 USER'",
            "review_score": "-1"
        },
        {
            "review_text": "Silent Hill 1 settled in a japanese chibi world. Lots of jumpscares and creepy moments.   Only flaw is managing the stamina that can cause frustration at certain points.  8/10",
            "review_score": "1"
        },
        {
            "review_text": "Amazing! Really is! Just ignore the negative feedbacks. Don't let it bother you or get you into thinking that the game is for 10 year olds. All I can advice is to play this game at night! It's really an amazing game! If you love CHIBI/KAWAII, then trust me, you're certainly going to ENJOY this!",
            "review_score": "1"
        },
        {
            "review_text": "Really wanted to like this game but at this point there are just too many glitches and having the game freezing that just burns out any potential it has. Which, it wouldn't be that big of a deal if the only way to save your progress wasn't to return to your home and save. Don't really want to do this everytime I find something, considering the vast amount of 'things' you can get, it's not worth the time.",
            "review_score": "-1"
        },
        {
            "review_text": "Please note, when I say that I can't recommend this game, at the moment I only have 1.7 hours of playtime and I'm very early in the game.   As someone who just started playing and is a bit lost at the school, the game really does have way too easy deaths. I got the death achiev because on keyboard, it's incredibly frustrating to survive certain moments. Because of how diagonal movement works in the game (up/down+left/right), this makes certain enemies much harder than they should be. One of the first major enemies (found after you find a shoe), will jump out of bushes when you go near them. The only way to survive is to find cover, but the game is balanced in a way that you 'barely' escape even if you do it right... which is a shame because twitch reflexes on a keyboard is not good. Almost all of my deaths were from running towards a hiding spot, only to get stuck on a wall next to it.   With this in mind, I cannot suggest this game with mouse+keyboard simply because the game seems designed for better mobility/turning that a controller may be able to give. Maybe I'll be able to recommend it after trying it with a controller, but at the moment the game is just not scary when you die because you ran into a tiny brick wall corner instead of jumping in the bush right next to it, and have to repeat that 10+ times.",
            "review_score": "-1"
        },
        {
            "review_text": "10/10 Would cover face again",
            "review_score": "1"
        },
        {
            "review_text": "A fun little game, many items to collect and monsters to avoid. The game is a bit short however, I would personally reccomend waiting for a sale as the $20 tag for a 4-6 hour story without collectibles is a bit steep.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent atmosphere, a truly unique game thats well worth playing.",
            "review_score": "1"
        },
        {
            "review_text": "A really nice and cute horror japanese game,   Looks really friendly in the first place but will take you deep into his story, a few jumpscares and a ton of monsters...  Really great sounds effect and music.  Also some really cool and original graphics plus a big thumb up for the really neat japanese structures / temples...  Really awesome !",
            "review_score": "1"
        },
        {
            "review_text": "Best horror with cuteness....^_^ It reminds me of Corpse Party alot.",
            "review_score": "1"
        }
    ]
}