{
    "app_id": 477950,
    "name": "Simple Spy",
    "release_date": "2016-07-05",
    "developer": [
        "Kodari Games"
    ],
    "publisher": [
        "Kodari Games"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Adventure"
    ],
    "achievements": 25,
    "positive_ratings": 14,
    "negative_ratings": 4,
    "price": 1.59,
    "description": "Simple Spy is a dynamic and minimalist 2d platformer. Though Simple Spy is a minimalist platformer,you can also find all fun and essence needed for a full fledged platformer. everything in Simple Spy is achieved through a combination of three action such as running,jumping and rolling.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/477950/header.jpg?t=1467788430",
    "minimum_requirements": "OS: Windows XP , 7 , 8 , 8.1 Processor: 2.2 GHz Memory: 2 GB RAM Graphics: 512 MB Video Memory DirectX: Version 9.0 Storage: 200 MB available space Sound Card: Any",
    "recommended_requirements": "OS: Windows 10 Processor: 2.4 GHz Memory: 4 GB RAM Graphics: 1 GB Video Memory DirectX: Version 9.0 Storage: 200 MB available space Sound Card: Any",
    "reviews": [
        {
            "review_text": "  I wish you could use the Analog controller but its not a dealbreaker (and not just the D-Pad). Nice game that I can see myself playing in short bursts. Seems pretty challenging so far. Controls are not 100% responsive but 98% is good enough. Can def see this getting nicer with a few more updates. I got for free but could easily justify the $2.00 cost. Worth it. Also glad to see a Unity game with such a small footprint. Low powered laptops and system will LOVE this game since you dont need a supercomputer to run it!!",
            "review_score": "1"
        }
    ]
}