{
    "app_id": 47790,
    "name": "Medal of Honor™",
    "release_date": "2010-10-12",
    "developer": [
        "Electronic Arts"
    ],
    "publisher": [
        "Electronic Arts"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "FPS",
        "Action",
        "Shooter"
    ],
    "achievements": 0,
    "positive_ratings": 3209,
    "negative_ratings": 1370,
    "price": 14.99,
    "description": "This is a new war. There is a new warrior. He is Tier 1.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/47790/header.jpg?t=1447353177",
    "minimum_requirements": "OS: Windows XP, Vista, Windows 7 Processor: Pentium D 3.0GHz / Core 2 Duo 2.0GHz / Athlon X2 Memory: 2GB Graphics: GeForce 7800 GT  / ATI X1900 Graphics Memory: 256MB",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Pros: Interesting storyline.  Quite easy to get use to the shooting/gameplay mechanism.  Graphics and the sound/fx   Cons: I dont see one yet.  It's pretty good for a Singleplayer campaign. Quite challenging at certain points but manageable. Recommended!",
            "review_score": "1"
        },
        {
            "review_text": "If you have watched any number of genuine helmet cam war videos, you will appreciate the highly realistic portrayal of tactics. This is not a corridor shooter. It is a roleplaying game best enjoyed when you immerse yourself in your role and play it out like the real soldiers.  The gameplay settings are pleasantly variable - sniping, sneaking, assault, and vehicle levels with the respective operator groups. This includes the actual equipment each of them uses and their expectable sound and power of effect. This is a chiseled out and fact-checked shooter I would definitely recommend any day.",
            "review_score": "1"
        },
        {
            "review_text": "A really good FPS shooter. I got very immersed in my first hour of gameplay tonight. Kept me on the edge. Feels like Afghanistan and a refreshing change over the other war games out there. I highly recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "I confirm the game works with Windows 10 and a 970 GTX card with latest drivers. I had the game before but figured for $5 I'd replay it... kind of like reading an old book for the second time! Enjoying it. Also nice to max out the video settings with these older titles on the latest PC hardware. Cheers!",
            "review_score": "1"
        },
        {
            "review_text": "Yes I recommend this game, but it's just too short. Nothing new in gameplay. Just killing people, proceed to next area etc.",
            "review_score": "1"
        },
        {
            "review_text": "A gripping account of war times for these Tier 1 operators. While the story line is short, it grabs you and takes hold. Making you feel every emotion. You come to realize that this is the war troops and SF have to deal with. These are some of their conditions. You get a small taste and a small glimpse into this world. Part of you wants to never let go. Medal of Honor has done a great job with capturing what its like to be in the suck.",
            "review_score": "1"
        },
        {
            "review_text": "I've played multiplayer for quite a while. There is a good community and servers still! great game for a fifteen minute match before work/school! Lot of fun!",
            "review_score": "1"
        },
        {
            "review_text": " The good  Crisp and bright visuals Good animations and modellnig Great voice acting Tense action at times   The bad  Too short Suffers console-itis no quick saving ",
            "review_score": "1"
        },
        {
            "review_text": "Has a great environment, extremely customizable FOV, amazing graphichs, and best console port of the year!",
            "review_score": "-1"
        },
        {
            "review_text": "SINGLE-PLAYER REVIEW  From the serie that 'started it all', that led the way for cinematic FPS games, I expected more than this. I played the whole MoH serie since the ps1 games, so I know how it was born and grew. The story is the usual, recycled, already seen soup, which is quite boring and you can skip with no regrets. The problem is that you can only skip movies and not cutsecenes, so if you want to replay the game, you'll have to watch them again and again, and they last for about 50% of the level time.  The real problem is the gameplay, though. Being used to games that tells you everything you need to push in order to even move, so much that it gets annoying, I was surprised that this game tells you nothing at all. Well, it tells you what to push to move and jump, the basics that everyone already knows, but not how to use the special equipment you're supposed to use in the 'mini-games'. Ok, there's no mini-games here, but there's special sequences where you need to use a special binocular to mark targets for bombing, a sequence where you use the weaponry of an helicopter, and some sniper sequences. Well, on the first 2 modes you have more than 1 firing mode but the game doesn't tell you that, and you end up wondering why certain targets don't blow up, or why the game keeps telling you to do something that you're already doing. The actual FPS mode is sub-par, too. You can't choose what weapons you start the mission with, and you can only collect enemy weapons (not ammo to refill your one, unless it's the same model) or ask your friends for ammo, if they use the same one as yours. The action has so many little breaks because you either have to climb a 1.5 meters step with the help of a teammate, something exploded near you and you take a whole 15 seconds to get on your feet again, a whole lot of enemies arrived at a near position (so it's better to just look at them instead of firing, right?), the teammates has something to tell you, and so on. It's frustrating. The fact that the game is also an on-rail shooter, with no space for exploration and only one way from point a to point b, makes the SP experience feel so restricting and unsatisfying, that the fact that it only last 3 hours won't bother you so much at the end. Yes, you've read it right, 3 hours. That is about how much it took me to complete this game. It wasn't even so much fun for those 3 hours. The game plays the compassion card for all the soldiers that actually went into those places, risking their life for our freedom. Well I'm sorry, but there's already movies for that and when I buy a game I want a game, not a barely interactive movie. I'm sorry for those people and I really appreciate their work, and I think it's not honest to use their sacrifice to make bad games.  The only thing that barely saves this game from being a complete disaster are the graphics. I get a solid 60fps in full-hd and everything at max, with vsync on, but it only looks good during daylight missions (like with most games anyway), and even there there's part of the graphics that is too blocky and/or has bad textures, but it's overall pretty good looking. The audio is a mess, though. The sound can barely be heard and you have to increase the volume at almost maximum in your audio equipment.  Oh yeah, there's an additional game mode in SP, where you fight your way in a selected level for leaderboard score. Such fun. If only they added coop, that could have marginally saved this terrible game, but as it is, it's the usual EA game: just bad.",
            "review_score": "-1"
        },
        {
            "review_text": "Very copy paste action shooter game. Painfully obvious. Story is not good. Wow 3/10",
            "review_score": "-1"
        },
        {
            "review_text": "A triumph of game design! A tour-de-force in everything that makes EA the creativity powerhouse it is today! An immaculate masterpiece that will surely be enjoyed for generations to come.  I would bet that someone at EA wouldn't even believe that if they read it. They know what kind of company they are, and they know what kind of game they make. This game had no surpises, and I only played it to remove it from my 'unplayed games' list. Ok, here's the review.  EA's Least Shiatty Game since Medal of Honor: Allied Assault (actually, MOHAA was good. I'll give them that)  'Let's relentlessly kill A-rabs for 2 hours!' Basically, it's pretty graphics and not much else. The gameplay is meh.... You're forced along a very strict path with glass walls if you try to stray even slightly. There's one great scene where you approach a small village in an Apache (that you don't control, you just hold down m1+m2 and it shoots stuff), and they just say 'Everyone is hostile here. Kill EVERYTHING' and you destroy every building in a village, undoubtedly killing children and civilians. There are lots of short easy gun battles between scripted events. The SEALs will tell you stuff like 'be really really quiet here, we want to be sealthy'. So you can, if you want, sneak along and kill nobody, or you can fire a few shots into the air, and your team will kill everyone for you. The controls are also screwed up too. For example, there was a mission where you're in a helicopter and all of a sudden you need hellfire missiles to take out a mortar, and the button for hellfire missiles isn't left click, right click, melee, grenade, or any of those keys, even though the last two of those are pointless in a helicopter. Instead, you have to hold down 4 for 2 seconds, even though there's nothing that binds 4 to any action. Really intuitive, right?  1.5/5",
            "review_score": "-1"
        },
        {
            "review_text": "I keep coming back to this game. It's what Call of Duty used to be. Stealth, pew and bad-assery. I cry into my beer knowing that EA killed off Danger Close studios and there will never be another iteration. This and Warfighter are both awesome modern warfare additions to the Medal of Honor franchise. And they never ruined it like COD:MW2 and onwards did the COD franchise.  Just thinking about this game makes me want to load it up again and pew. It's like the god old days but ages well.",
            "review_score": "1"
        },
        {
            "review_text": "2010 game but still better than COD and most other FPS, one of the best games ever made by DICE",
            "review_score": "1"
        },
        {
            "review_text": "The only Medal of Honor i've really played apart from a really old on on the PS1 when i was a kid. I enjoyes this as well as it's multiplayer. It's multiplayer is similar to Battle Field. Single Player has amazing story line and fun game play. I bought this game on Humble Bundle so it was worth it for me. The Multiplayer is near dead and there are very few servers left. If you want the game it's mainly for the 4 hour Single player experience which is amazing but not really worth $20 and doesn't really have much replay value. You can end with the smallest bit of cover left because of destructable terain and fight over heaps of taliban. I love FPS Good Storyline and game play 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Medal of honor was a very tactical shooter that pushed you into becoming a better player through its unforgiving nature.",
            "review_score": "1"
        },
        {
            "review_text": "I first played this game and hated it I must say. But then I decided to reinstall it and give it a shot, mainly because I was a huge fan of the old Medal of Honor games and because I felt like I was being mean to the game itself. What can I say? It is definitely not the best FPS I ever played but still, I found it is a good one, decent story, decent setting and overall in my honest opinion, a great soundtrack. The graphics look kinda nice for a game of 2010, specially coming from DICE. But the only thing that I kinda found weird was the shooting, the mouse moved really weird and the guns themselves were okayish, some of them had a nice and decent kick to them when you fired but I got the feeling that firing from the hip worked every single time, specially when spraying. That said, I'd say that you should probably give it a try if you're a fan of the old Medal of Honor games or if you're just bored someday.",
            "review_score": "1"
        },
        {
            "review_text": "In honor to the franchise which I thought was decent, I highly recommend MOH. The gameplay feels authentic and real. Your in real world locations and fighting alondside actual US military. The games unique gameplay in authenticity is what I like most. Yes it is a far cry from COD and multiplayer is not great, but the short single player campaign is worth a run.  The graphics are excellent for 2010 and the geography is realistic. It is a linear game though so not much exploring. The sound design is impressive, the guns and firefights sound very realistic. The radio chatter is all authentic military, be it somewhat pervassive language. You feel like part of the team. The ending was a nice touch, I salute the men and women who have to encounter these real world scenarios and I think the game gives you a sense of what it is all about.  There will be no more MOH (EA pulled the plug on franchise) and maybe players did not get that this was not trying to be COD, thats what BF3 is for or maybe they felt it was very short which it is. Bottom line is for a game of this quality and if on sale I would recommend picking it up. Cheers to MOH, always liked this games style even if it was not that popular.  ✓Recommended",
            "review_score": "1"
        },
        {
            "review_text": "I got this from a Humble Bundle, and I always liked the games they selected for being included in a bundle. It's the first Medal of Honor I played, and I must say it has lessened my respect for all parties involved, including Humble for giving this more attention than it deserves. This game doesn't have any redeeming qualities I could come up with. Gameplay is bad, execution is bad, pacing is bad, sound design is bad, everything else is bad. It's just junk, and it reminded me why I was reluctant to play war shooters in the first place. You can feel that they tried pretty hard to clone Call of Duty (I mean, just look at the title, duh). Even the description on Steam is involuntarily hilarious. '...a relatively unknown entity of handpicked warriors'? Who writes stuff like that with a straight face? It's a persiflage of its own subject matter. The realistic enactment of war simply shouldn't be treated in a way like this, it's inadvertently offensive and cheap. Although I feel bad for giving a bad review for a game I paid almost zero $ for, I'm still desperate to warn everyone about giving this game a chance. If you have to, take Call of Duty on for another playthrough, it's still better after the third time than this is during any given 30 minutes of its awful campaign. Please note that I never played any Medal of Honor multiplayer, it may well be its singular redeeming quality, since there must be a reason for it to exist at all. So there. Hope you didn't buy this at anything more than a dollar.",
            "review_score": "-1"
        },
        {
            "review_text": "get this game!",
            "review_score": "1"
        },
        {
            "review_text": "I don't care what the critics say, I don't care how many more copies of Call of Duty gets sold and I SURE AS HELL don't care if this game offends you. I had never played a more realistic campaign of the modern Afghan conflict until I played Medal of Honor. As a soldier myself I really felt like I was back in Iraq(even though this takes place in Afghanistan)   On several occasions I had to pause the campign because I had flashbacks. I'm editing this review in July of 2014 to state that to this date I still have not played another game that made me feel like this one did.",
            "review_score": "1"
        },
        {
            "review_text": "For someone who doesn't like FPS, I really enjoyed it. Its very interactive and you can understand the characters easily. I like the way that you're included into the whole comms system and have to use it to understand a mission as well as the story line. Fast paced and incredibly well done, I wish it was longer for the single-player campaign. I would recommend personally.",
            "review_score": "1"
        },
        {
            "review_text": "Just let you know this game is not worth buying. This was seriously one of the worst games I've ever played. The campaign is too short. It took me about 6 hours to beat it, but it has the saddest ending ever.",
            "review_score": "-1"
        },
        {
            "review_text": "Multiplayer Is Good And Weak Story",
            "review_score": "1"
        },
        {
            "review_text": "GOOD GAME The story is great~and i use 4 hour to complete single player The graphic is great I give 9.3 But in Multiplayer graphic is change",
            "review_score": "1"
        },
        {
            "review_text": "Graphics 6 out of 10 In-game sounds 8 out of 10 Gameplay 6 out of 10 Story 3 out of 10 Multiplayer 6 out of 10 Price-quality 2 out of 10  Summary-Campaign is ultrashort and it has not kept me going.Really boring in my opinion,and not worth spending 19.99 euro on it",
            "review_score": "-1"
        },
        {
            "review_text": "No game can be what it is really like. However this game to me is a great make. Medal of Honor brought their kind of 'Modern Warfare' to the table. I read all of these negative reviews but at least in this game we are fighting against Americas real enemy, terrorism. Here we dont see our nation being torn apart by Russia like in Call of Duty. This game brings you an experience I seem to feel is similar to the movie 'Act of Valor'. The high speed and precise actions that you as the player need to make, that quick head shot while breaching a room has not been as satisfying in any other game to me but this one. Military experience backing me on this no game is real, not one no matter Arma or anything. Games are meant to be theactical and this game is worth the money, I bought it after reading all the other negative posts about it and I am very glad I did.",
            "review_score": "1"
        },
        {
            "review_text": "its just a really, really bad game.",
            "review_score": "-1"
        },
        {
            "review_text": "A solid shooter, and the multiplayer is fun and well made. But the game feels like a teaser for Battlefield 3, the single player is embarrassingly short, and the multiplayer has a laughably small upgrade system (There are 2 team specific guns per class and then an extra one you can unlock). It looks like Battlefield, plays like a cross of BF3 and COD, and then comes up short in content. It's like paying to play a demo. Get it cheap? Worth the couple hours of playtime you will get. Otherwise, avoid.",
            "review_score": "-1"
        },
        {
            "review_text": "Completely broken multiplayer, generic campaign. Don't waste your money.",
            "review_score": "-1"
        },
        {
            "review_text": "Did you ever have the urge to play a game where you advance in waves and have to shoot somebody with all the help possible and not even having a challenge, while also suffering a lame storyline, bad game mechanics, a horrible engine and terrible voice acting?  Me neither.",
            "review_score": "-1"
        },
        {
            "review_text": "Amazing game for $19.99",
            "review_score": "1"
        },
        {
            "review_text": "-Don't kill Tariq! -They don't wear any nametags! -Just don't shoot the old guy! 10\\10 My GOTY 2010",
            "review_score": "1"
        },
        {
            "review_text": "I'm having some fun playing this but other times I just want to get to the end. The characters are boring. Seems like everybody is a hardened white commando from about the same background and with the same attitude and feelings about everything except for one black commander who might as well be white and one white general or CIA guy or something who should be a lot better actor. The sound is bad. There's lots of err... homoerotic commando whispering in your ear as you stealthily follow the one and only path to 'penetrate' your next objective like Dorothy for instance. I like it but the whispering voice sounds the same way no matter if that commando is in front of you, behind you or fifty feet in front of you. And your name keeps changing as you switch identities for no apparant reason. The cities aren't much bigger than farms. The guy directing you often tells me to do things but I have trouble following his instructions. It helps to press H so that your objective lights up for a little while. Its not really that important because there aren't any different ways to go but it took me some time to figure that out.   Quite a few times I've been unable to progress and been forced to restart a mission. I'm often annoyed with the game choosing my weapon. Can't I be allowed to make any decisions? I've played other games that allow me to pick weapons and choose paths and my name. That's how I prefer it. This game doesn't allow a lot of freedom in allowing you to pick what you'll do next or how you'll do it and its very repetitious. There's one mission where you are taking cover in some crumbling mud shack and the enemy streams in forever down the hills around you. It just gets tiring picking them off. Hard to believe they would waste that many guys on that pathetic tactic but I suppose it could happen.   What's going on with that Barret sniper rifle view? Its like they mounted a camera on the back of a camel walking on rocky terrain in high winds.  The graphics are good and there's a lot of action. Its not as good as taking a walk but its better than raking leaves. This game is not sleep inducing. It'll tire you out but it will also make you feel restless and and angry. If you need to fall asleep I recomend Eurotruck simulator.",
            "review_score": "-1"
        },
        {
            "review_text": "Though I have yet to try the single-player in Medal of Honor, I can confidently say that the multiplayer aspect of this game is awful. The fact that a team of developers had the audacity to release such an awful product is simply astounding. It disgusts me to be breathing the same air as whatever lowly scum worked on this game's multiplayer. The guns suck, the level system sucks, the graphics suck, the spawn system sucks, the game modes suck, everything basically sucks. Only get this game if you're looking to be ultimately disappointed, or if you want to play the single-player campaign.",
            "review_score": "-1"
        },
        {
            "review_text": "Uhg, where to start with this piece of corporate trash. Medal of Honor: Allied Assault and Rising Sun were some of my most favorite games. But this? Following the modern military trend that has thankfully ended as we go sci-fi. What do I say? It's like battlefield/CoD but not as fun or cool. Good graphics but it looks like trash now. I do like how it is 'based' off a true story(The Lone Survivor One) but it is 'based' in a way like a modern remake of Romeo and Juliet set in New York City is 'based' off the original.   The only fun I had with this game is this  You can knife towel heads even when their dead. Repeatedly too. Like, your guy gets REALLY into it. He goes prone and just SHIVS that allah-worshipper.",
            "review_score": "-1"
        },
        {
            "review_text": "I really wanted to enjoy the game, I really did. However I just can't. You may notice the time that I spent playing is 25 minutes, well, that's because it was hurting my eyes way too much. The FoV is so terrible that it will most likely make you want to just give up on life because of the pain it causes. I got halfway through the first mission, and well, I stopped. I really tried to keep going but I couldn't endure the pain any longer. This comes from a average 1st person shooter player.",
            "review_score": "-1"
        },
        {
            "review_text": "Verry excellent game! Better than COD, good ash BF. Love it!",
            "review_score": "1"
        },
        {
            "review_text": "Medal of Honor fast game with modern day graphics with easy controls that moves from location A to B to C and so on,  good amount of action and special effects,  good amount of educational information that raises conscious learning  good game. ",
            "review_score": "1"
        },
        {
            "review_text": "This game is broken",
            "review_score": "-1"
        },
        {
            "review_text": "I maintain that this Medal of Honor has, without a doubt, the most engaging and fun campaign of any I've played in the series. Gameplay was fun and challenging (especially on Tier 2;) and even now it still looks good from a graphic standpoint.  The mutiplayer had some kinks. You aren't able to go prone, sometimes collision is strange on the props in levels... but overall, it is still fun to play. I've continuously recommended it since launch.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a ♥♥♥♥load of not fun.",
            "review_score": "1"
        },
        {
            "review_text": "Very plain COD ripoff/cash grab, I don't recomend. 5/10",
            "review_score": "-1"
        },
        {
            "review_text": "I like military porn. it makes me feel special. this game has many a military porns! you buy if you like? also many fat white men with beards, a very acurate representation of the army. GO AMERICA",
            "review_score": "1"
        },
        {
            "review_text": "I like military porn. it makes me feel special. this game has many a military porns! you buy if you like? also many fat white men with beards, a very acurate representation of the army. GO AMERICA",
            "review_score": "1"
        },
        {
            "review_text": "This game is so damn boring. Like what, why, how, who thought this was a good idea? Go away",
            "review_score": "-1"
        },
        {
            "review_text": "what a ♥♥♥♥♥♥♥♥ of ♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "I stopped playing this game because the heavy bugs didn't let me progress in the game. Check my screenshots for this game, then you will see why (eternal falling bug, no ground to walk on etc).  That's why I can only say that this game isn't good because of the heavy bugs. It's not possible for me to continue the damn story!  By the way, this is my first 'I don't like this game - recommendation'. :P",
            "review_score": "1"
        },
        {
            "review_text": "SP: The story is pretty powerful, as it's loosely based on the real events of the Battle of Roberts Ridge. It's a gripping story and the cutscenes do it justice. The gameplay however is very monotonuous. The Taliban fighters just seem to come at you like a wave of zombies. When they shoot from cover, it's like your're playing one of those flash games where the enemies pop up at exactly the same place in a periodic manner. This makes the enemies feel very unreal and almost laughable. You also don't have any room to diverge from the beaten track, it's a completely linear shooter like CoD.  MP: The unlock system just simply and plainly sucks. The stock weapons are not much fun to use and getting some interesting unlocks takes ages. Aiming feels off compared to other first-person shooters, they probably put some sort of mouse acceleration in the game that you can't turn off. The maps and game modes get old really quickly too. It feels like they didn't put much thought in to the MP portion of this game.  Conclusion: only get this game in a sale to get dragged away by the story, but you probably won't play it much afterwards.",
            "review_score": "-1"
        },
        {
            "review_text": "The game is beautiful   Just don't try Multiplayer.   It's basically you vs level 15 (Max level) players in good gear who can one shot you, it's full of cheaters and every map is level 15's sitting in prime spots farming kills on spawn  Then they get specials, chain them on spawn and rack up more specials to chain again.  If you do get out of spawn there is someone camping just outside wiaiting.   Unbalanced and in perfect game, go try America's army",
            "review_score": "-1"
        },
        {
            "review_text": "Medal of Honor is a great title, a realistic and epic take on the war in Aghanistan, but is too short, just 5 hours for an incredible experience, that will push you in a breathtaking journey in most dangerous valleys of A-Stan. It also has an interesting hardcore single player mode, and a well made multiplayer, but it's not as good as the ones in Bad Company and Modern Warfare.",
            "review_score": "1"
        },
        {
            "review_text": "this game is bad",
            "review_score": "-1"
        },
        {
            "review_text": "My vote is NO read the whole review to find out :)  (Review on SP) It's just awesome. I can't describe it, but it feels like it's exacly what I've been looking for. A lot of people say that the game sucks for a reason...but I don't think so! In my opinion this game rullz. It's true that at some places it is just too similar to Call Of Duty but to be honest, I prefer MOH than COD. Just because it works better for me. Everybody has a different taste of gaming. So I think I've found mine. I'm going to finish the SP and have no patience to write something about the MP.  (Review on MP) This was the most horrible 'thing' that i have ever played. The maps are overwroughted. The buildings are enormous and the players are pocket-size and it's really hard to find somebody. The campers are on every meter so the choise is vacant, but in my opinion it sucked anyway When you die..you just die. You can't even see from where did the bullets came or where is the guy who killed you, The RPG ; Granade Launchers spammers are really annoying. You can't move to the LEFT or the RIGHT (with A-D) while you sprint. The game needs to be balanced. A new player shouldn't play with ones from higher levels, laughing at his death insted of going on with the game. After all I don't regred buying it because the single player was awesome.",
            "review_score": "-1"
        },
        {
            "review_text": "Best single player military campaign I've played in a long time. Pretty short but ♥♥♥♥ing awesome from start to finish.",
            "review_score": "1"
        },
        {
            "review_text": "Medal of Honor does nothing to stand out. The story does not impress. The guns don't have an interesting feel. The graphics aren't bad, but they don't blow me away either. The visuals consist mostly of a bunch of brown desert environments. The gameplay isn't really interesting either. You hide in cover, you shoot some people, you get back in cover for your health to regen, and you repeat over and over. Normal modern military shooter stuff. I'm not sure why I even bothered to finish the game.",
            "review_score": "-1"
        },
        {
            "review_text": "Game looks and plays horribly.  Don't bother.  I think I'll just go back to Battlefield 2, thank you very much.  This game spits on the memory of Medal of Honor. And then rubs it in for good measure.",
            "review_score": "-1"
        },
        {
            "review_text": "A ridiculously railroaded, bland, unpolished corridor shooter. The AI is non existent. Enemies just run to their designated spot and shoot in your general direction. Your teammates always run into your gunfire and grenades. The gameplay is insipid with plenty of point and click games and turret sections. You constantly have to wait for your teammates to open doors for you, which probably elongates this short game by another 2 hours. The weapons don't feel powerful and shooting them is just unsatisfactory. Story wise... you shoot brown people, while military guys scream at each other. And then you save 2 guys. That's the extent of it that I understood. This game is just depressing, and not in a good way.  4/10",
            "review_score": "-1"
        },
        {
            "review_text": "Uninspired gameplay, brain dead AI and game breaking bugs.  Bugs where I was forced to restart from the last checkpoint. - Stuck on terrain - enemy AI is stuck so you'll need to find and kill him before the game 'mission' moves forward. - After a cutscene, I left clicked and it put me back to the start of the mission.",
            "review_score": "-1"
        },
        {
            "review_text": "Played the first mission in the single player campaign. Time has not been good to this game. An enemy is hiding behind a crate so I throw a grenade which blows up and then the enemy glitches in front of the crate and starts shooting me. I almost stopped there but I completed the level so I got to see the rest of the linear, horribly scripted canyon that you walk through. I'm glad I got this in the EA humble bundle.",
            "review_score": "-1"
        },
        {
            "review_text": "EA is GAY",
            "review_score": "-1"
        },
        {
            "review_text": "It's a Call of Duty wannabe clone, and has the usual straight lined campaign that doesn't make any sense. Also, why do I have a pistol with infinite ammo, and why does the antagonist always have to be from the Middle East? Would never recommend this game to anybody.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is so boring and the mouse settings are awful.",
            "review_score": "-1"
        },
        {
            "review_text": "For ONLINE!!!!!! LOG IN FILED REG CODE IS ALREDY IN USE !!!!!!!!!!!!!!!!!!! WAT TO FUU........CK!!!!!!!!!!!!!!????????? HELLP!!!!!! PLLLLLL...",
            "review_score": "1"
        },
        {
            "review_text": "+++",
            "review_score": "1"
        },
        {
            "review_text": "Love this game ",
            "review_score": "1"
        },
        {
            "review_text": "Average game. You play as a faceless soldier in an elite squad and basically you shoot foreigners. Your teammates are your typical rough and gruff badasses who lack personality. Admittedly there were some military drama that got me interested. Although not much. Graphics are okay, the gameplay is so linear I bumped into a lot of invisible walls, and I encountered some moments I can't proceed because I failed to trigger the next script. It's hand-holding to the max. Multiplayer? I won't really bother. This game is 3 years old and I highly doubt there are people bored enough to still play this game online. Also it requires me to register and log in into EA servers. Screw that.  6/10",
            "review_score": "-1"
        },
        {
            "review_text": "It seems Battlefield and Call of Duty had some sort of relationship in 2010. I mean, how else could this abomination be formed?  On a side note, SP &gt; MP, but not by much.",
            "review_score": "-1"
        },
        {
            "review_text": "Better than Battlefield Bad Company 2 Better than All other Medal of Honor games Not as Good as Battlefield 3 Not as Good as COD Black Ops Not as Good as COD Ghost Not as Good as COD Advance Warfare",
            "review_score": "1"
        },
        {
            "review_text": "Not a 'bad' game just one i'd not actually recommend  Just opening and running the game is a frustrating dilemma  progressing through the levels was like shooting cardboard . the AI was waaay too easy. alot of waiting for the AI teammates  i did notice one or two glitches and impassable areas that i had to reload the game for Story is just meh . but definatly feels like a Murica type game   ",
            "review_score": "-1"
        },
        {
            "review_text": "Dull, repetitive, over the top hero-shooter. I would expect a scripted experience from a Medal of Honor title, and I would certainly expect a bit of being directed down corridors. I didn't literally expect to be shoved down so many corridors.  I am not even going to be bothered to finish it. It's a shame to think this is what has happened to the Medal of Honor name.",
            "review_score": "-1"
        },
        {
            "review_text": "Just a throwaway FPS. Nothing special about this at all. This is a game that adds nothing to the genre. [5/10]",
            "review_score": "-1"
        },
        {
            "review_text": "Singleplayer - 2/5 Multiplayer - N/A  Gameplay - 5/10  Visuals - 4/5 Story - 2/5  Accessibility - 4/5 Replayability - 1/5  Feel - 2/5 Fun - 2/5   TOTAL: 48/100   Notes: Very restrictive, linear gameplay. Enemies pop out at you like this is whack-a-mole. The only reason I remember any of my teammates' names is because of friendly fire.",
            "review_score": "-1"
        },
        {
            "review_text": "░░░░░░░░░░░█▀▀░░█░░░░░░ ░░░░░░▄▀▀▀▀░░░░░█▄▄░░░░ ░░░░░░█░█░░░░░░░░░░▐░░░  ░░░░░░▐▐░░░░░░░░░▄░▐░░░ ░░░░░░█░░░░░░░░▄▀▀░▐░░░  ░░░░▄▀░░░░░░░░▐░▄▄▀░░░░  ░░▄▀░░░▐░░░░░█▄▀░▐░░░░░  ░░█░░░▐░░░░░░░░▄░█░░░░░  ░░░█▄░░▀▄░░░░▄▀▐░█░░░░░  ░░░█▐▀▀▀░▀▀▀▀░░▐░█░░░░░  ░░▐█▐▄░░▀░░░░░░▐░█▄▄░░░  ░░░▀▀░▄ EA░░▄░░░▐▄▄▄▀░░░ ░░░░░░░░░░░░░░░░░░░░░░░",
            "review_score": "-1"
        },
        {
            "review_text": "I almost threw up. never again. ",
            "review_score": "-1"
        },
        {
            "review_text": ".",
            "review_score": "-1"
        },
        {
            "review_text": "If your buying it for the singleplayer you'll get an immersive, if brief, campaign through the eyes of several elite soldiers. However the multiplayer is riddled with campers and noobtubers. I'd wait for a sale to pick this one up.",
            "review_score": "-1"
        },
        {
            "review_text": "Fun, but short. When I completed the last mission I was like 'Oh...credits??'. Didn't expect it to end so fast.",
            "review_score": "1"
        },
        {
            "review_text": "The game has ran into multiple issues for me. In several places during the campain i have found several glitches that make the level or section not completeable. I finialy gave up trying, it is a shame to because i had fun playing while i could still actualy beat a chapter.",
            "review_score": "-1"
        },
        {
            "review_text": "This game made me feel like a stormtrooper shooting at Ewoks.",
            "review_score": "-1"
        },
        {
            "review_text": "this game is really good but the only thing u kant go into fullscreen ",
            "review_score": "1"
        },
        {
            "review_text": "It's bad. Like, just....BAD. You can have Vsync turned off or on, and you'll feel like vomiting 5 minutes into the game because all the textures, skins, and surfaces are interrupted by this incessant clipping that could very well give you a seizure.   Because of that, the game is entirely unplayable, and thus, gets a 0/10 from me.",
            "review_score": "-1"
        },
        {
            "review_text": "Having gone into this game with the notion that it would be just like all the other fps campaigns out there , bland ,on the rails and without a good story I must say I was pleasently surprised! I Highly enjoyed the game the characters in the gamae work well and are actualy useful , they will kill enemies give you ammo and point out enemies to you rather than being useless bullet soakers like in other shooters.I also commplement the fact that stealth sections areent forced on you, you can make up for a mistake rather than being condemened to an instant death or loss. The gunplay worked reasonably well and although there is definatly alot to be desired the headshot system is Very satisfying. Finaly I'd like to say that unlike every other fps I have played, (other than halo of course) this ending actualy kind of made me feel sad. I would recommened this although of course it does have it's flaws in the end I found it to be quite the enjoyable campaign, I'd give it a 7/10 as far as its genre is concerned but as a whole a 6/10 is more fitting",
            "review_score": "1"
        },
        {
            "review_text": "I was expecting much, much more from a DICE game. The story is so terrible the only thing that entertains me is killing friendlies. The controls are nice and it looks quite pretty but graphics don't sell me on a game.  On to multiplayer. COD gets a lot of hate, I can see why that might be. Small maps, OP weapons and campers. Well MOH is even worse. Tiny maps and I don't think I saw an enemy once as the game was just mortar strikes and rocket launchers. I'm a pretty good player but as a newbie to the multiplayer mode I could hardly get a kill.  I'm so glad I got this as part of a Humble Bundle deal, I would NEVER spend even £5 on this. Do yourself a favour, don't even think of buying this game.  !Updated review will be made when(if) I complete the Single Player!",
            "review_score": "-1"
        },
        {
            "review_text": "This game wasn't bad, but there isn't enough content to warrant spending any more than about $5. Still, there is some fun to be had; the sliding and stabbing mechanics can make you feel pretty bad**s and headshots reward you with a satisfying splat. The shooting mechanics are fine and the graphics are pretty good (some scenes of the mountains are actually breathtaking) but that's where the good ends really.The campaign is kind of cool because it feels a bit like you're playing the movie 'Lone Survivor' but it's far too short - like mayyybbe five hours. The characters and story are bland and I couldn't make myself care about any of it which is unfortunate given that this game is supposed to represent a real, ongoing conflict that involves many real people. The AI is terrible and each gunfight devolves into waiting for each individual head to pop out from behind cover. The game is glitchy and has little direction as to which rock you have to hide behind to activate the next scripted event. At one point, I got into a death loop beacause I was killed by a truck rolling into my cover and blowing up only to be spawned directly in front of that very same truck just before it exploded again. I almost exited the game right then but I eventually got out of the loop and found that if you manage to get yourself back to where the enemies spawn, they will completely ignore you because you are not where the game expects you to be. It's stuff like this that really ruins what could have been a cool concept for the Medal of Honor reboot. I got this game in a humble bundle so I'm not too worried about value, but I can't really recommend this game unless you can grab it for $5 or less.",
            "review_score": "-1"
        },
        {
            "review_text": "I've played through it more than once. The game is realistic, has a great story that kept me enthralled and is just awesome on so many levels.   Give it a shot, and prepare to take an action packed ride through the early years of hunting terrorists through the Kandahar mountains.  ",
            "review_score": "1"
        },
        {
            "review_text": "Definitely not the best game EA has produced but it is passable at best. Campaign doesn't offer much special aside of participating in the Afghanistan war which is basic as a fps can get. The competetive side of things is where the game has it's strong point. Being developed by DICE, the multiplayer features a different game engine and overall different experience that could hold someone up for sometime.",
            "review_score": "1"
        },
        {
            "review_text": "I was going to write a long, over informative review explaining why this game is so underrated and why it’s worth your time, but I realized about 3 paragraphs into what would have been a small book that it will just fall on deaf ears.   Simply put , this game is good, worth your time, has excellent controls, and if you aren’t a CoD fanboy, you’ll probably find it can really draw you in if you let it.  Its plot is loosely based on real events, and it aims for a more realistic approach to modern shooters. It aims to show honor and respect to out war fighters and give us something of a more realistic glimpse into what they live and face than its counterparts attempt too. It’s true a lot of what’s in this game is more of the same, but the same can be said about the competition. You have to understand it’s a war game, about a war. It’s always going to be more of the same.  What really drew me into this game were all the suspenseful moments and the amazing controls. I get that its short and pretty linear, but so is  every  other modern shooter,  period . It’s called story mode, not free mode, so of course it’s going to be linear. And like every other shooters story mode it follows a script.  The only thing that really turned me off to this game was the ending. I thoroughly enjoyed the events up until the very end  when Linkin Park starts playing and all seriousness of the tragic events that just transpired are gone.  ",
            "review_score": "1"
        },
        {
            "review_text": "The game itself is totally worth the Nothing i payed for it at the time, the graphics are great quality and the realism is on point well still keeping it fun and action packed making sure you can play without messing up every five seconds, the ending is sad tho   7/10",
            "review_score": "1"
        },
        {
            "review_text": "Very Nice !",
            "review_score": "1"
        },
        {
            "review_text": "62%",
            "review_score": "1"
        },
        {
            "review_text": "Medal of Honor... I've experienced the saddest death in whole gaming history. Not sadder than Half-Life 2: Ep2's ending, but Medal of Honor... is a great game.  I don't understand why there are a lot of bad reviews of Medal of Honor. Great game, great music, great ending, but I noticed that it's a bad copy of CoD but who cares?  I recommend you guys to play it.",
            "review_score": "1"
        },
        {
            "review_text": "Review for the multiplayer:  This is so bad it hurts. It's like the combined explosive spam of battlefield games, and killstreaks from cod. If I'm not getting airstriked to obvlivion a second after I spawn, I'm getting sniped. This is literally the worst fps I have ever played in a long time.",
            "review_score": "-1"
        },
        {
            "review_text": "There is a sniper on that roof im'a shoot it with this super accurate RPG. 7/10",
            "review_score": "1"
        },
        {
            "review_text": "Medal of Honor (2010) is your basic stale FPS. Played it through once, never going to do that again.  If you want to have yourself some goo... OK time, it's fun for awhile.  6/10",
            "review_score": "1"
        },
        {
            "review_text": "Not good enough.",
            "review_score": "-1"
        },
        {
            "review_text": "8 out of 10  Great Game - like Day of Defeat: Source.  Capture the flag style.  A little redundant as far as multiplayer maps but it has it's replayability.  Great Weapons and graphics.  Real DoD:s feel to the weapons.  I like it better than BF2:BC.",
            "review_score": "1"
        },
        {
            "review_text": "I do not recommend this game.   I found myself sighing at tonnes of glitches. A number of which forced me to restart entire missions. The campaign was just boring. I was actually happy to discover it was very short. I uninstalled the game as soon as I finished it. I'm just glad I got it as part of a Humble Bundle.   Bottom line: Avoid.",
            "review_score": "-1"
        },
        {
            "review_text": "i dont like this game (looks awefull) just buy medal of honor warfighter much better grapics and same price!",
            "review_score": "-1"
        },
        {
            "review_text": "Better than Call of Duty! nuff said!",
            "review_score": "1"
        },
        {
            "review_text": "I have only one thing about this game and it's about Singleplayer.  It. Is. Too. ♥♥♥♥ing. Short.",
            "review_score": "-1"
        },
        {
            "review_text": "My total rating on this game is simple. Is good for low PC you dont need some expert PC witch is good Bad is you are like an idiot. U need boost from friends and you are taking like child step-by-step. I think game is nice only in sale :)",
            "review_score": "1"
        },
        {
            "review_text": "Good single player FPS, i like it, not quite as good as COD modern warfare 1&amp;2 though.",
            "review_score": "1"
        },
        {
            "review_text": "Aspect Rating Story 8.5 Graphics 7.5 Sound 9.0 Gameplay 8.5 Overall 8.4 I went into this game hearing very bad tthings about this game but boy can i tell you this games is defenetly great from the story line to the game mechanics its on my top 20 best games ive played so far, there is a learning curb but its not that difficult to master. i would highly recomend this game ",
            "review_score": "1"
        },
        {
            "review_text": "it was good but it could be better",
            "review_score": "1"
        },
        {
            "review_text": "Not even worth 20 bucks. Do not buy.",
            "review_score": "-1"
        },
        {
            "review_text": "Great FPS game good graphics but there are many invisible walls the game is still AMAZING it might be hard to fit in the multiplayer as well but GREAT GAME - MineChuck",
            "review_score": "1"
        },
        {
            "review_text": "I have to say that I really enjoyed this game. while the multiplayer is nearly dead, there are still a couple servers that are usually full. The single player takes a different take on the shooter genre, in a sense that you find yourself getting atatched to the characters, and not only that, but you feel like they are real people who just want to get home at night. with and incredible story, thats packed full of great action and playability, that offers a variety of different gameplay options, my score is 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This is the last good singleplayer MOH game made. the last good multiplayer was MOHAA",
            "review_score": "1"
        },
        {
            "review_text": "its a great game with great graphics and realisem",
            "review_score": "1"
        },
        {
            "review_text": "Beards",
            "review_score": "-1"
        },
        {
            "review_text": "I didn't think I was going to like this game after reading some of the reviews. The single player campaign was surprisingly good. The only blemish is the enemy spawning. There are a few sections where the enemies will spawn indefinitely unless you advance your position. It ruins the willing suspension of disbelief for those sections of the game, although it should be noted that the enemy spawning didn't make the game unfair. It's just that enemy respawning indefinitely is an outdated convention. I would have given the single player campaign a 9/10 if not for that single blemish. Still, I had a lot of fun playing the game. The weapons were some of the best I've ever used in a FPS war game and the action was always engaging. The story was typical, but how many of us play FPS's for their story? The campaign was short; six hours tops, but it was never boring. The graphics were excellent and the explosion effects were second to none. I don't know why this game was reviewed so poorly. I didn't play in multiplayer, so consider this review only if you are interested in the single player campaign. 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Medal of Honor™ is such a good game, especially if you are searching for an arcade FPS that don't requires too many battle skills or experience in the war genre. May you can get a little of challenge playing on Hard Mode, but the AI isn't so clever, by the way is pretty simple to kill your enemies... all you have to do is to crouch behind a stone and shot on your enemy direction. He will not try to kill you, unless you wait 20 seconds looking to him. Single-player campaign is kind of involving, but is short. Medal of Honor™ is better than the precedents games of the title, and it's available on Steam for a really interesting price. Don't wait for the most incredible FPS that you'll play on your life, he absolutely is not, but he can give you some hours of good fun.",
            "review_score": "1"
        },
        {
            "review_text": "Already bought it, and... REGRET, lame, OMG, this games make me see that Call of Duty is the best FPS game ever, all of them... And the multiplayer... OMG... no words... Very poor configurations and controls... the only good things of the game are the sound and Story... Make a movie MoH, not games... Buuuu",
            "review_score": "-1"
        },
        {
            "review_text": "Single Player, Way too short.",
            "review_score": "1"
        },
        {
            "review_text": "This game is nothing special and is a bit short, which is the norm for this genre. It's a fun game to kill a few hours, if you get it for cheap on sale.",
            "review_score": "1"
        },
        {
            "review_text": "short.  glitchy.  but fun.  only buy it if it's cheap. ",
            "review_score": "1"
        },
        {
            "review_text": "Totally NOT fun for me. Boring, with strange equipment options... Better grab a Battlefield!",
            "review_score": "-1"
        },
        {
            "review_text": "It's like if Call of Duty had been designed by soldiers instead of frat boys.",
            "review_score": "1"
        },
        {
            "review_text": "Another generic shooter. I miss the WW2 MoHs.",
            "review_score": "-1"
        },
        {
            "review_text": "I wish I could go into some depth, however, after a rather cinematic start, I could barely progress in this game due to the fact that mission essential npc's (who you have to follow around to progress the level) tend to get stuck in walls, or go wandering off trying to find paths that don't exist. I watched a guy try walking through a lampost for about 5mins, only for him to appear suddenly stuck in a wall infront of me. Buggy as hell, avoid, wasting your money..etc. It is a disgrace that a game is even released in such a state.",
            "review_score": "-1"
        },
        {
            "review_text": "The entire campaign lasted only a short 4 hours played at moderate speed, FOV on singleplayer was stuck at 60 with no option to change it, character development was horrible, and the sensitivity on this game was way too high. It's also one of the glitchiest and most linear games I've ever played.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is about Killing the Taliban and Goats.  Not as polished as any COD but, similar fun with some well executed ideas.   - Your AI teammates are actually 'useful'  - They call out enemies and give pro tips.  - You feel part of a fireteam - Decent FPS   Obligatory AI bossy team leader type people tell you what to do:  GO here STOP here USE this get on the unsually well placed and fully loaded M60 and cover us in the trigger brush you must clip the trigger brush for the realistic military immersion to continue.. We are not attacking untill you fully move your charcter model into the Trigger brush as to allow the player clip trigger / ogg files to disappear as to continue the immersive, story driven EPIC ♥♥♥♥ you are holding up by trying to walk off the map.  6.238 / 10",
            "review_score": "1"
        },
        {
            "review_text": "No, I do not recommend this. This game ruined my life. I was born with a dream. A dream that this game shattered and spit on. This game is the game that hipsters play when Call of Duty and Battlefield are too popular for them. This game takes the very minimum of an attempt at being a game. Sure you can run, and shoot, and jump but what does all that matter when the game is constantly pushing you to the ground and laughing at you while doing so. The 16 minutes that I spent playing this game could have been spent doing ANYTHING else but nope those are 16 minutes I will never get back.",
            "review_score": "-1"
        },
        {
            "review_text": "Medal of Honor's short but semi-interesting story with respectable authenticity and serviceable gunplay are marred by blatantly visible linearity and run-of-the-mill level design.",
            "review_score": "-1"
        },
        {
            "review_text": "Join for the half-baked campaign. Leave afterwards.",
            "review_score": "-1"
        },
        {
            "review_text": "AVOID THIS GAME.",
            "review_score": "-1"
        },
        {
            "review_text": "An extremely generic, but nevertheless underrated shooter. Gameplay is pretty balanced, no overpowered weapons or super annoying maps. However the game could use more of them, but the few it has are well designed.",
            "review_score": "1"
        },
        {
            "review_text": "It's like if Call of Duty had been designed by soldiers instead of frat boys.",
            "review_score": "1"
        },
        {
            "review_text": "Despite the lack of punch in the shooting and the somewhat po-faced story this isn't a bad game at all. It doesn't try to tell the OTT hero stories of BF3 of COH and instead tries to bring a much more human side to a real world conflict. If only they could have made the shooting have some weight it would have been a great game. It's a shame the awful sequel killed off this franchise.  6.5/10",
            "review_score": "1"
        },
        {
            "review_text": "The game is pretty good. You'll be sniping a lot which I liked, and the soundtrack sounds good too. It's short though (arround 5 hours) but I guess this is the avreage gameplay for a fps.",
            "review_score": "1"
        },
        {
            "review_text": "For a game that pretty much created a genre, they have strayed far from the path. Another game that is trying to ride the coat tail of the COD franchise.",
            "review_score": "-1"
        },
        {
            "review_text": "Really mediocre half-finished game. No FOV adjustment unless you download a third party tool likely bundled with a keylogger. Saw floating objects placed everywhere in the map. A car exploded without any explosion particles or any debris. Car just flipped with purely its animiation. Floating guns. A mounted machine gun shot and killed me with no one controlling it, it was just floating in mid air. Not sure how this game got on my account, I didn't purchase it.",
            "review_score": "-1"
        },
        {
            "review_text": "Too short ... It is a 5 hours game ... Buy it if it is really cheap ...",
            "review_score": "-1"
        },
        {
            "review_text": "Got this from a humble bundle, and it was definately worth it. I only played the single player. At first glance I thought I had the wrong game, or if the game was made in 1999. The graphics was horrible. I 've seen gameplays on multiplayer, and it was totally different. Didn't understand why its totally different. The multiplayer community is near dead. If you plan to get it now, get it from the humble bundle, and if you were going to pay for the actual game, AVOID!",
            "review_score": "1"
        },
        {
            "review_text": "A decent shooter, great graphics, deplorable dialogue that really made me uncomfortable. A very short single player campaign but varied and fun to play. I think I would recommend this, with those provisos",
            "review_score": "1"
        },
        {
            "review_text": "So unrelentingly linear with not an ounce of free choice.",
            "review_score": "-1"
        },
        {
            "review_text": "The most boring game I've played in years. Tries being Call of Duty and doesn't even manage that.",
            "review_score": "-1"
        },
        {
            "review_text": "What a load of ♥♥♥♥. Makes my whole computer shut down without warning after 10 minutes of gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "The single player campaign is amazing. I don't think I've played such a believable shooter in... ever. I've never felt emotionally attached to characters in a shooter that's also so well polished. I don't understand how this didn't murder CoD.",
            "review_score": "1"
        },
        {
            "review_text": "This game kicks ♥♥♥.. I.ve played it at least 8 time through, and it never gets old.. IMHO it is the game of the year..",
            "review_score": "1"
        },
        {
            "review_text": "absolutely terrible game. looks bad, plays even worse. don't waste money on this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Medal of Honor returns with the new Medal of Honor 2010! This game has a good solid story, fantastic graphics ( DICE ftw ) and good aiming system! I believe this is a must buy for any FPS lover! The Multiplayer still has a lot of servers with people playing ( June 2015 ) so I guess you will spent plenty of time in the competitive maps against real players! Overall I believe Medal of Honor 2010 is a very well made video game for a great Series! Definitely reccomended!",
            "review_score": "1"
        },
        {
            "review_text": "Great SP Campaign!!!! :) MP last year was so so, hackers ruining it for everyone",
            "review_score": "1"
        },
        {
            "review_text": "Unfortunately as soon as it gets going it's all over.It's a good effort overall though.4/5 from me.",
            "review_score": "1"
        },
        {
            "review_text": "Medal of Honor... I've experienced the saddest death in whole gaming history. Not sadder than Half-Life 2: Ep2's ending, but Medal of Honor... is a great game.  I don't understand why there are a lot of bad reviews of Medal of Honor. Great game, great music, great ending, but I noticed that it's a bad copy of CoD but who cares?  I recommend you guys to play it.",
            "review_score": "1"
        },
        {
            "review_text": "Despite its pretence to offer a degree of realism the result is a gaming experience that feels very flat. A lack of polish in the graphics and dull, dull level design make this a snorefest right from the word go. The teacup ride of corridor shooters.",
            "review_score": "-1"
        },
        {
            "review_text": "good game, the graphics are decent and gameplay is smooth , but with short story , good ending by the way. the knife is useless most of the time and you will not usually need ammo.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a decent game. It has pretty grafix and it runs decently. It's worth picking it up on a sale to experience the mediocre but enjoyable story. This is the perfect Call of Duty clone. It wants to be Modern Warfare so bad it's not even funny. Down to the smallest detail. If I have one complaint about the Singleplayer is that it's sensitivity option is PURE ♥♥♥♥♥! It doesn't go low enough. I've lowered the DPI on my mouse and it still goes WAY faster than I would like to. It's such a basic option, yet they didn't fiddle enough with it so it makes the game kinda unplayable for me, I had to pull every trick in the hat, lower Windows sensitivity and so on so forth, to make it playable. Every game's sensitivity option should go from 0 to 100. 0 being DEAD STOP, not moving at all, 100 being crazy fast. Not this game. This game is special.... This is even more curios because the MULTIPLAYER's sensitivity option is very good. It does what it's supposed to do, it goes as low as you want it to, until it stops moving completely. Weird. So this nice segway brings us to multiplayer. If you're buying it for the MP, DON'T. Get the latest COD, it'll be the same. At the time of writing there are only about 100 players playing the MP at any given time! Only a couple of the 4-5 MP modes are played, and those are not the best kind of modes. Not to mention that those 100 players, given their dedication, are MAX level and have every little ♥♥♥♥ unlocked, so they're like 5 times more powerful than you, due to the better upgrades they have. If you want a compelling MP experience similar to this go play COD, or try your luck with Medal Of Honor Warfighter, but even with Warfighter I don't think the MP community is what it was at launch, not that this game even EVER had a decent MP community, not even at launch. So bottom line is, buy this game at a sale to experience the decent Singleplayer campaign. That is all.",
            "review_score": "1"
        },
        {
            "review_text": "SP is great, though kinda short about 6 hours on normal/hard. VERY REALISTIC...most combat-realistic SP Campaign I've ever played. Combat units most resemble SFOD-Delta (Delta Force) &amp; the US Navy SEALs. Hoorah!  MP can be tedious... LOTS of campers who like to baserape (snipers especially)",
            "review_score": "1"
        },
        {
            "review_text": "the Multiplayer is not good",
            "review_score": "1"
        },
        {
            "review_text": "My brilliant squad tactically took cover behind a set of poles and waited for me to run down an Alley blocked by an invisible wall. 6/10 don't buy this game seriously it has maybe 2 things that are cool in it.",
            "review_score": "-1"
        },
        {
            "review_text": "Super realistic god-tier beard simulator 2011 is a pretty neat game. Not the best, not the worst, just neat.  You take the role of some guy named rabbit who has a thing for rubbing a disembodied foot of a rabbit at random times. He dies. Credits role. Cool game.  Buy if you need somethin to burn cash on.",
            "review_score": "1"
        },
        {
            "review_text": "Fun while it lasted, which was a mere 4 hours of single player.",
            "review_score": "1"
        },
        {
            "review_text": "If you absolutely can not get enough of modern military shooters at it's most unimaginative, then get this on a sale. At the current price (€20 at the time of writing) it's a waste of money. There is nothing in it that hasn't been done better (and I suppose worse) elsewhere.",
            "review_score": "-1"
        },
        {
            "review_text": "Honestly, it had its cool moments, but they were few and far between. The game finds itself in an odd middle ground, it seems like it doesnt know whether it wants to be a CoD or Battlefield game. 4 hours is all it took to complete the campaign, I got the game via Humble Bundle. Not worth $20, wait for it to be on sale if you really want to try it - no replay value in my opinion",
            "review_score": "-1"
        },
        {
            "review_text": "Really want to recommend this game, only if you can bear with the FOV in single player. else, don't. The issue is only with single player game.",
            "review_score": "-1"
        },
        {
            "review_text": "Everything was great until Rabbit died :(!",
            "review_score": "1"
        },
        {
            "review_text": "Making somebody sign up for an EA account to play online after they already have an account with Steam? I thought we were past this. Anyway, the single player is linear, with checkpoints guiding you down the corridor from point A to point B while shooting 'bad guys'. The plot attempts fails to draw emotions while simultaneously keeping you from caring about anything in the 'story'. Medal of Honor offers nothing that hadn't been seen before; it consists of mindless killing without anything to care about. It's a game that doesn't make you think. Instead of picking up the next Call of Duty, buy this game in addition to a game that will make you think.",
            "review_score": "-1"
        },
        {
            "review_text": "I started playing this game not expecting much. Then the only reason I continued playing it was just because I could laugh at it. And then I realized that trying to laugh at it was just making me slowly die inside. So having finally uninstalled it, here are some of the main things that I find completely ridiculous in this game:     Apparently your character's arms are made of wet spaghetti noodles, because while your squadmates have no trouble lifting their arms above their head and hauling themselves onto a ledge, you have to get one of them to boost you up by running over and pressing a button.    The game shatters all attempts at being taken seriously when it chooses to call these helping hands 'buddy boosts'.    The plot is dull, the voice acting lifeless (and bad in places), and expects you to care about a bunch of guys whose 'names' go from the semi-reasonable (Voodoo) to the hilariously ridiculous (Mother). Ex: Mother: Okay, we have to go do the thing and then the thing and the stuff. Voodoo: Thanks, Mom. Me: YOU ACTUALLY WANT ME TO THINK THIS IS ALL GRITTY AND SERIOUS?!?!    The game restricts you at every turn. There was a point where I tried to enter a house with a wide open door. I could see inside! And yet the doorway was just an invisible wall. Note that this is not always the case, but still...If you can't enter somewhere, just close the door! On another occasion, I was walking along a cliff and decided to try and jump off - you know, for science. NOPE. Invisible wall. No fence or wall that would be a reasonable blockade - nothing that justified me not being able to do this. Just the developers saying, 'We don't want you to go over there, but we're too lazy to actually show you that.'    BUDDY BOOSTS.    At one point, your character gets blood splattered on his face, and the camera shows blood splats. Keep in mind that your character is not wearing goggles, thereby implying he has blood on his eyes. Then your squadmate comes over and magically wipes the blood away! Thanks for molesting my eyeballs, buddy.    The pistol is hilariously overpowered. I went through entire sections of the game just going crazy with it. It has enough range that you can snipe people from decently far away, it shoots quite fast, and it has infinite ammo (unlike your other weapons).    FREAKING BUDDY BOOSTS.    When the game does give you a bit of freedom, it's ridiculous how quickly it can fall apart. There was a part where I ran ahead of my squad, shot everyone in the area while my team was monologuing, and then ran to the back of the area while the next scene triggered. After an air strike came through, I pulled out a grenade and counted it off. After a couple of seconds, I hurled it into a seemingly empty alcove, where a moment later, about five enemy fighters spawned and were immediately blown up.    Your squadmates can and often will play the game for you. There were times were I ran into an area, fired off some shots to get the enemy's attention, and then crouched behind a wall while my squad took out everyone. Word of advice, devs: Making the player feel completely irrelevant to a game's outcome does not make them want to keep playing.    THEY ACTUALLY THOUGHT IT WOULD BE A GOOD IDEA TO CALL THEM BUDDY BOOSTS WHO THE HELL WAS IN CHARGE OF THAT?!?!?!?!   In addition, the plot is dull, the graphics aren't anything special (hooray...gray...), the sound is unremarkable (my friend commented that a hail of gunfire just sounded like hail), and the gameplay is, in many cases, entirely optional. Just...go play a shooter that actually seems to care about the player.  TLDR: THIS GAME SUCKS BECAUSE BUDDY BOOSTS.",
            "review_score": "-1"
        },
        {
            "review_text": "The campaign horrendously short and the multiplayer is dead.",
            "review_score": "-1"
        },
        {
            "review_text": "Descent singleplayer. Kinda buggy. At some point I had to open a door and I wasn't able to.",
            "review_score": "1"
        },
        {
            "review_text": "I have to say that I really enjoyed this game. while the multiplayer is nearly dead, there are still a couple servers that are usually full. The single player takes a different take on the shooter genre, in a sense that you find yourself getting atatched to the characters, and not only that, but you feel like they are real people who just want to get home at night. with and incredible story, thats packed full of great action and playability, that offers a variety of different gameplay options, my score is 10/10",
            "review_score": "1"
        },
        {
            "review_text": "general protection fault !!!!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "Cut scene simulator, single player gameplay sucks, ADS feels really floaty better off not using it, everything is so scripted it's really a bored to play. Bot interection is terrible, they get in your way most of the time if not blocking your path or jumping infront of your line of fire.",
            "review_score": "-1"
        },
        {
            "review_text": "Always loved this game. Maxed it out on the 360 and the PS3. Had to give the PC version some love even if the series has been canned.",
            "review_score": "1"
        },
        {
            "review_text": "I felt like I was playing as the team's invalid friend, I couldn't do anything without their express permission. You ask them for ammo, you ask them for helping getting over walls, you can't even kick down a door without their say so. Also there are invisible walls everywhere, meaning absolutely no exploration. This game is as linear as it could possibly be, there are even parts when driving ATVs where the computer takes over so that you brake in the right place. I'm glad the money I spent on this went to charity because I'd be really annoyed if it was going to the people who made this crap.",
            "review_score": "-1"
        },
        {
            "review_text": "I really like this game and if you enjoyed the origional COD titles you will to. Unlike the last several COD games this game is a realistic senerio from start to finish. Some other things I think are a plus are : its a DICE game that should run good and most any modern computer, you don't need a mega gameing machine to run it. It is basicly a reply of the Afghan war simular to the way the first COD games replayed WW2. The senery is very good. And it is just a fun shooter to run through. Although some complain that it is an EA title .. I differ with them in that I would much rather buy it and play it from STEAM than Origin ( not even sure if it is supported by Origin, but if it is I just like STEAM better )",
            "review_score": "1"
        },
        {
            "review_text": "This feels like a 2005 game. A bad 2005 game.",
            "review_score": "-1"
        },
        {
            "review_text": "I bought it at the sale and still I'm regretting the $5 I spent on it. Finished it in less that 6 hours maybe, I'd still say MOHAA was way better than this. There's no freedom of playing, no good weapons, just go there, kill some people, move forward, kill more, and it'll end just like that. War games standard is pretty high I know but this was way below average.  And I'm not saying this because I have some roots in Afghanistan and that they ruined the way my native language is. ",
            "review_score": "-1"
        },
        {
            "review_text": "This is for the single-player campaign (I haven't played the multiplayer portion). This is a very fun campaign that will probably last you around 4 hours and the missions and environments are very cool. It's pretty linear like most FPS campaigns but I don't see this as a problem, especially because it feels like you are controlling an intense military action movie like Lone Survivor, Black Hawk Down, or 13 Hours. The sound design in this game is excellent and is actually one of the best sounding games I've played. The guns sound great and are not like the Call of Duty guns that all sound like airsoft guns, and the sequences where you are pinned down and fighting for your life are intense and fun.  I would recommend this game on sale probably if you are looking for a fun action game to play on a weekend.",
            "review_score": "1"
        },
        {
            "review_text": "i was expecting it to be bad from reading the reviews but actually i like it",
            "review_score": "1"
        },
        {
            "review_text": "This installment of  Medal of Honor  plays a lot like its modern-warfare counterparts  Call of Duty  and  Battlefield , but offers a more sober tone overall. While the campaign is incredibly short (about 4-5 hours) and the linearity allows minimal replay value, it provides decent (and occasionally exceptional) immersion and atmosphere while it lasts. Certainly not worth the money at full price, but for the $5 I paid for it on sale, I got my money's worth.",
            "review_score": "1"
        },
        {
            "review_text": "This installment of  Medal of Honor  plays a lot like its modern-warfare counterparts  Call of Duty  and  Battlefield , but offers a more sober tone overall. While the campaign is incredibly short (about 4-5 hours) and the linearity allows minimal replay value, it provides decent (and occasionally exceptional) immersion and atmosphere while it lasts. Certainly not worth the money at full price, but for the $5 I paid for it on sale, I got my money's worth.",
            "review_score": "1"
        },
        {
            "review_text": "30 Mins in: Horrific headache inducing fov and atrocious mouse sensetivity with inbuilt acceleration.  How did this get past qc? is this an untested console port?  Graphics better than MW1, but not 2.  60 mins in:  graphics still just ok, nothing special. some cool locations. interesting wepon details; various cosmetic weapon differences in the AKs you pick up (some are Maadi, some AMD etc)  AI is pretty terrible. FOV and mouse settings still impossible.",
            "review_score": "-1"
        },
        {
            "review_text": "Medal of Honor is an ordinary average shooter, nothing more. The solo campaign can not compete with a CoD Modern Warfare, for example. The lack of a good story is the reason why there is no real suspense or excitement. You get thrown in the middle of the action and don't know exactly what you are doing there and why. The weaponfeel is not bad, but CoD is better, still. The graphics are mostly very pretty, but some levels look so terrible you can hardly believe it's the Frostbite Engine being used - seen mostly at the beginning of the campaign and in night missions. After an incredibly boring first 30-60 minutes, the solo campaign becomes significantly better and more varied - until all of a sudden you're done (and you don't know why, really unexpected) and the game ends with the credits on screen. Really disappointing, after the initial trailers had been quite promising.",
            "review_score": "-1"
        },
        {
            "review_text": "This game features a brand new experience of fighting against the new enemy,the Taliban. That's the experience I never have, which makes this game even better! I have played a lot of WW2 games, never played a game like this one which I give it 10 out of 10 points!",
            "review_score": "1"
        },
        {
            "review_text": "SP is full of action with great story,MP is not so good but after all this game is only 4.99$.Worth it! :D",
            "review_score": "1"
        }
    ]
}