{
    "app_id": 478010,
    "name": "ABC Coloring Town",
    "release_date": "2016-05-29",
    "developer": [
        "EnsenaSoft"
    ],
    "publisher": [
        "EnsenaSoft"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Casual"
    ],
    "tags": [
        "Casual",
        "Family Friendly",
        "Education"
    ],
    "achievements": 0,
    "positive_ratings": 176,
    "negative_ratings": 72,
    "price": 1.69,
    "description": "ABC Coloring Town offers a creative playground for children and is a fun way to learn Basic English pronunciation and words. Explore and learn letters from the alphabet as you visit cute houses full of pretty pictures to paint.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/478010/header.jpg?t=1478751702",
    "minimum_requirements": "OS: Windows XP Service Pack 2 (SP2), Vista, 7, 8, 10 Processor: 1.0 GHz Memory: 1 GB RAM Graphics: vCard with DirectX 9.0 support DirectX: Version 9.0c Storage: 150 MB available space",
    "recommended_requirements": "OS: Windows 7, 8, 10 Processor: 1.0 GHz Memory: 2 GB RAM Graphics: vCard with DirectX 9.0 support DirectX: Version 9.0c Storage: 150 MB available space",
    "reviews": [
        {
            "review_text": "Hey everyone and this is my review about the game!  This is a coloring game for younger people. Around 5 years old.     Interface/Menu/Settings",
            "review_score": "1"
        },
        {
            "review_text": "ABC Coloring Town is a game for kids, where you're coloring drawings of items or animals beginning by the letter represented at the house you're currently stopped at.  Each drawing has the name of the item or animal on it. You have two coloring modes: one with a paintbrush and one with a color pot. In other words, the color pot allows you to paint an area respecting its outline. For the paintbrush, you can choose its size. On the side, you have a cube rotating, showing also the progress of your coloring.  And that's all. Once exiting, you're moving suddenly to the next house, whether you're finished or not with your drawing. And you can't go back. Nope, you're forced to follow the alphabet. And once you're back at the letter (after Z, you're back at A), the drawing is different. It's impossible for you to save and come back later or to find again the drawing unless being lucky.  The only pertinent audio is the letter being pronounced, because not coloring a picture is still rewarded by an 'Excellent' or an 'Awesome'. The description of the game is confusing with Basic English prononciation. So don't expect the words to be spoken.  Despite the great idea to associate a word to its picture, the rest is just so frustrating that I largerly prefer  Discovering Colors - Animals , even with its major default of not having any word. At least, you can come back when you want to the game, you have a little animation, three modes and a better presentation.  Even the cute music or the 3D house and village aren't saving this software of a thumb down. Avoid this, even with a discount. And while I'm an adult, I can see the disappointement for kids that have to interrupt their coloring and can't resume it.",
            "review_score": "-1"
        },
        {
            "review_text": "At first I read the developer as 'EnemaSoft'. One thing I know for sure.. after completing this game, I have become the baddest motherf****** color-inner that ever lived. I'm also happy to report that the game is fully gsync compatible.. which enabled me to fully immerse myself in the world. Since becoming a ColorMaster, I've a new perception for detail.. Devs, your fill tool is buggy. It does not adapt itself to changes made with the standard brushes. Disappointing. Trainee ColorMasters, (ie Kids), will have fun.. though even the most premature of a mind need some sense of completion.",
            "review_score": "-1"
        }
    ]
}