{
    "app_id": 47870,
    "name": "Need For Speed: Hot Pursuit",
    "release_date": "2010-12-14",
    "developer": [
        "Criterion Games"
    ],
    "publisher": [
        "Electronic Arts"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player"
    ],
    "genres": [
        "Racing"
    ],
    "tags": [
        "Racing",
        "Multiplayer",
        "Open World"
    ],
    "achievements": 0,
    "positive_ratings": 11405,
    "negative_ratings": 2775,
    "price": 14.99,
    "description": "Become Seacrest County's top cop or most wanted racer!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/47870/header.jpg?t=1447353801",
    "minimum_requirements": "OS: Windows XP SP3, Windows XP 64-bit SP2, Windows Vista SP2 (32- or 64-bit), or Windows 7 (32- or 64-bit). (Not Supported - Windows 95, Windows 98, Windows ME, Windows NT 4.0, and Windows 2000 are not supported.) Processor: Intel Core® 2 Duo 2.0 GHZ or AMD Athlon X2 64 2.4GHZ; 1.5 GB Windows® XP / 2 GB Windows Vista® - Windows 7® Memory: 1GB (XP), 1.5GB (Vista), 1.5 GB (Windows 7) Hard Disk Space: 8 GB free hard disk space.  Additional space required for DirectX 9.0c installation and for saved games Video Card: DirectX® 9.0c Compatible 3D-accelerated 256 MB video card with Shader Model 3.0* or higher Sound Card: DirectX 9.0c Compatible Sound Card DVD-ROM: 8X speed DVD-ROM drive (Disc Users only) Online Gameplay: Broadband connection for online activation and online gameplay - 512 Kbps or faster Direct X®: DirectX 9.0c",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "To start off, I can't say that this is my favorite NFS game of all time, but it is certainly up there. I have been a NFS fan for a long time, dating back to the good old PS2 days with Most Wanted and Carbon. So far no other NFS game, in my opinion, has been better than those, but Hot Pursuit is still a lot of fun, and here's why.   PROS:   The graphics are fantastic. The car models are awesome as always, and the scenery is beautiful. Yes, scenery especially matters to me because I want to be able to go for a nice drive, if that's what I'm in the mood for. It looks great at 200+ MPH too! Now don't expect Metro: Last Light graphics, but it really is a nice looking game.  There are quite a few cars as well. I can't say for sure how many there are, but it's certainly enough to keep you busy with trying certain races with different cars or just taking them for a spin. Not to mention that for every normal car in the game there is a cop car counterpart, with the addition of a couple! So if driving at 250 MPH on a freeway with sirens on sounds fun to you, please give this a try! But what about how they handle?  I personally enjoy how the cars handle in this. It is NOT a simulator in any way. It is arcade style racing with easy drifting so you can boost into those corners like a boss without losing tons of speed or control. To me it seems like all the cars handle in a very similar fashion, but I actually don't mind it. I don't think this type of racing is for everyone however, but it's not hard at all to get used to. Remember that this game is all about going fast to evade cops or bust racers using special abilities, so you can't be completely focused on realistic driving. But that brings me to another thing I love about this.  In the game, whether you are a racer or a cop, you have access to EMPs, spike strips, roadblocks, extreme turbo, and more. All these make the game more exciting and tense. If you are a racer, you can drop spike strips on cops OR other racers and use EMPs to pass someone, and if you are a cop, you use all of these to take down racers. I especially enjoyed the cop career more because it is really fun to smash into other cars and send them into a barrel roll or other cool crashes.   NEUTRAL:   The free roam is one thing I always want in a racing game. Yes, Hot Pursuit does have it, but I feel that it is missing content. Being able to free roam as a racer, you would expect to occasionally run into a police car and get into some sort of epic chase, or vice versa being a cop, but sadly that just isn't the case. There aren't even any collectables! I guess the free roam in Hot Pursuit is pretty much there to test out cars or just go for a nice ride. So yes, it's nice to have, but it lacks content.  The menus are sub-par. You can very easily tell that it is more suited for consoles. While I strongly recommend using a controller for this game anyways, the least they could have done was provide a more intuitive menu for us PC gamers.   CONS:   With the exception of changing the color of the car, there is NO customization. I guess I 'spoiled' myself with the feature of customizing back when I played on the PS2 because now every NFS game that has come out recently has zero options to customize, and it has been very disappointing. I don't know why they ever took it out.  Now that I think about it, the menu tutorial at the very beginning of the game is really dumb and  unskippable . It's like they expect you to know absolutely nothing about how a menu works. It is completely useless and takes a couple minutes. Can't you just let us play the game already?    TL;DR:   NFS: Hot Pursuit is a really fun game with very nice graphics, great selection of cars, and tense racing. While free roam could have been significantly improved, it is always great to be able to go for a joyride in any of the vehicles you have unlocked, including the cop cars. Taking down racers or the police using EMPs, spike strips, roadblocks and more is very satisfying and really adds to the gameplay. There is no customization, with the exception of painting your car different colors, so this is a big let down, but nonetheless a very fun game. As a racing game enthusiast, I have to give this game a 7/10. Very fun!",
            "review_score": "1"
        },
        {
            "review_text": "There is no NFS game that came after this that is better. This game looks incredible yet runs well on many PCs. In fact, it looks better than many games released since 2010, even games released in 2015 and '16. Here is a list of Pros and Cons, as I do in most of my reviews.  Pros -Amazing graphics 6 years later, compared to other non-NFS games -Tons of cars to choose from (ranging from Mazda RX-8 and Subaru Impreza WRX STi to Bugatti Veyron) -You can play as a cop and a racer, which other NFS titles were lacking -Large open world (probably around 20x20 miles) -Lots of ambient sounds and awesome engine sounds -Special equipment for Racers and Cops (i.e. spike strips that can be deployed behind your car at high speeds, EMP to damage cars without ramming, etc) -Free Roam, which is great as you can just cruise in your favorite cars around a beautiful map Cons -The cars don't quite handle as well as they should, so you have to drift sometimes by briefly touching the brake then go around the corner in a quite-easy-to-control drift -You are forced to stay on the road and can't go offroad like in The Crew -Damage modeling is mediocre, a totaled car = ONLY a cracked windshield, bumper hanging by one end, and some dents and scratches -You can't get chased by cops in Free Roam -After a certain point you can't get any more 'levels' or 'points', unlike in the 2005 version of NFSMW where you could get wanted by the police to the point where they chased you in Corvettes the second they spotted you, regardless of what you were doing.",
            "review_score": "1"
        },
        {
            "review_text": "People who grew up playing NFS Underground 1 and 2 will most likely be disappointed, since the focus on customization and 4-cylinder tuners that they know and love aren't featured in this game.   People who know that Need For Speed existed before Underground will know that despite the powerups and pop music, this is the closest NFS has been to the original games in a long time.    Gameplay-wise, from an outside perspective, Hot Pursuit does what an arcade racer should do best and focuses on high-speed driving above all else. Not only is the game arcade-y from a physics perspective, but it's actually set up kind of like a game you'd see in an actual arcade; you don't buy or upgrade cars at all, nor do you unlock the city part by part. You simply have a list of available cars, you pick what you want, and you start racing. I can see how most people would think that might be a negative thing (I myself probably would have preferred buying and upgrading vehicles) but I think the 'quick race' approach works surprisingly well here. The driving feels good to me; the cars have a good amount of weight to them but are still easy to handle. Being able to play as a racer or a cop feels good too, and Criterion did a good job of infusing the game with some Burnout-influenced mechanics (such as takedowns and earning nitro) while still making Hot Pursuit feel distinctly like it's own game.  The game does have some faults though. There's not a lot of content, there's no way to set up custom races, and the only way to escape police is to take them down; you're not going to outrun them because they're some serious rubberbanding ♥♥♥♥♥♥♥♥♥♥♥♥s. Also, there's other ways in which the AI doesn't play by the same rules; if a computer-controlled racer's health bar hits zero and they total their car, they'll respawn with a brand new one. If you total yours, the race ends. Being able to crash your way out of a race is totally fine (I like it) but it's always frustrating in any game when the AI doesn't follow the same rules you do. It feels cheap. On top of all of this, the PC port is pretty sad. It'll run at 60fps and 1080p, but the graphical options you can choose are very limited. There's not even any options for things as simple as anti-aliasing.  All things considered, Hot Pursuit is a decent arcade racer with solid driving and mostly satisfying cop chases. The lack of content and barebones nature of the PC port are it's downfalls. If you want a fresh arcade racer, give this game a try...but only when it goes on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, every second of the races are fully action packed and fun. The graphics are amazing for a game made in 2010. I'm very impressed.",
            "review_score": "1"
        },
        {
            "review_text": "Despite its age, Need for Speed: Hot Pursuit holds up well in 2016. A fair few consider it the last 'true' entry in the series, and I think that it deserves such a title. There is no plot; just driving really really fast through beautiful landscapes.  Pros -gorgeous, although not as much as recent NFS games -Online connection not required -not very resource intensive -fast-paced  -plain fun  Debatables -Arcadey driving, a pro for some and a con for others.  Cons -Repetitive gameplay",
            "review_score": "1"
        },
        {
            "review_text": "The last good NFS.",
            "review_score": "1"
        },
        {
            "review_text": "If you play this expecting realism you will ruin a wonderful game for yourself. I'm on my 3rd 100% completion play through and I'm still loving it. The soundtrack, aesthetic, and gameplay create an experience that some how combines a relaxing cruise down the highway with an exciting high speed chase. Very fun and varied single player campaign with loads of replayability. It's best with a controller but keyboard controlls are suprisingly manageable. 10/10 Play this game.",
            "review_score": "1"
        },
        {
            "review_text": "Still one of the best arcade racing games at the moment in my point of view. You get to play with various cars, from Porsche 911 to Koenigsegg Agera. You can also choose whether you want to play as a racer or a cop. There are plenty of races, divided in many types: Time Trials, Interceptors, Hot Pursuits etc. And my favorite feature is the screenshot option, which gives you many filters and effects to take pretty photos ^*^    Pros:   +beautiful graphics;  + the ability to play as a racer or a cop and switching at any time;  + immersive soundtracks;  + dynamic weather types and cycle of day in free roaming;  + hot pursuits are intense, both you and the opposing forces using equipment to jam vehicles, call a roadblock, activate turbo and so on..    Cons:   -free roaming mode lacks initiative; it's good only for testing cars, as exploring gets ridiculously boring in a short while;  -no customization;  -Autolog, their online playing service, is pretty much dead; it's hard to find any match if you don't talk with a friend; I'd rather they switch to AllDrive service from Rivals, by all means better.  Personal rating: 87/100 - Great",
            "review_score": "1"
        },
        {
            "review_text": "WARNING: This game is extremely addictive. Once you start, you can not stop!",
            "review_score": "1"
        },
        {
            "review_text": "Probably on of the best NFS games in the series.  BIG recommendation!  Exceptional graphics with stunning locations and track design. Good balance between arcade and simulation. Awesome career mode and online features that allows you to quickly play with your friends. You can play together or separately and game will keep it competitive in both situations :)",
            "review_score": "1"
        },
        {
            "review_text": "A very nice racing game",
            "review_score": "1"
        },
        {
            "review_text": "The Best Need For Speed in the NFS Series (until 2011).  Autolog system is great, especially for multiplayer/ online play. I just love to drive at night, in the rain, at full speed :D, and you will fall in love too.",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun because i get to be a cop with my brother and chase my sister :P",
            "review_score": "1"
        },
        {
            "review_text": "It has some good tracks to listen to and will probably cling to them.  Hot Persuit (Series) i loved the ps2 version and coming to the PC as a new game kept the love i so desired and it was the beauty of the race tracks and the detail of the cars.   If you liked burnout this will get your attention. Play as Cops, knock your opponent out of the road or maybe a little helicopter support Hmm?",
            "review_score": "1"
        },
        {
            "review_text": "Best NFS from the whole series, lots of fun, pure arcade racing at its finest !",
            "review_score": "1"
        },
        {
            "review_text": "9,2/10  One of the better Need For Speeds.",
            "review_score": "1"
        },
        {
            "review_text": "(I mostly play on Origin, so few hours on Steam here.)  It's Mario Kart with modern (for 2010) cars. No kidding. You're gonna cuss out your friends as they blast you with EMP (red shells), drop spike strips (triple banana!) and ram your pride and joy into oblivion on pristine Californian roads, be it in a stand-up race or a glorious battle to the death between corrupt cop and wealthy crook.  It's a very un-EA like game in some respects. By that I mean Hot Pursuit still has an awful online interface, but it's basically a complete game without DLC and fun offline, too. It has a solid campaign which should at least last a week of sporadic play. It's very very pretty and low intensity and will run on virtually any modern rig.  Sadly there's no customization and undercover gameplay. It's terribly unrealistic in terms of handling, vehicle dynamics and speed. Despite that, it's a far better competitive racing game than most of the NFS titles that came after it and offers a lot more refined value for your dollar. It's mostly glitch-free, absolutely gorgeous and a ton of fun to pick up at any time. Also it's absolutely infuriating.  You know the game spams visual cues every time your friends beat your lap times? ♥♥♥♥♥♥♥ it.",
            "review_score": "1"
        },
        {
            "review_text": "There's bullies in here that say, 'Wee woo wee woo wee woo'",
            "review_score": "1"
        },
        {
            "review_text": "Picked this up for 5 euro's which is about as much i would pay for this game.  Goal: So, the goal of the game seems to be to reach the highest ranking as either or both the racer and the cop, unlocking new cars in the progress. You will achieve both by doing races, including a variety of new cars which you then can race with. Well.. which you can sometimes race with I must say, because for some reason the game has its own preferences for cars and in some races you are just left with 1 pick (while the game shows you more unlocked cars, which you can't pick for some reason).   Then, there is no customization (sigh). A really big letdown for me, since this was what made the game series unique and was the biggest part of the reward system. This was what kept you playing, unlocking a new car, using your money to put some spoilers, wheels, neon lights etc. on it to make it your personal driving monster. Not being able to do this also made it less rewarding to unlock new cars like the camaro, which is one of my favorite cars.  So what about the leveling system, or the ranking system if you will.. well.. you unlock new cars and some new abilities (which you can only use for specific races), but thats pretty much it.. I felt no difference being a level 1 or a level 4 other than maybe difficulty.. Its just not rewarding enough anymore, since we all expect more.. If this game wasn't part of the nfs series, it would've been so much better.  Graphics: The graphics look average at best. I guess there went more time in actually letting players drive cars then the actual looks, which saddens me if i look back into the series. Most of the nfs games had pretty damn good graphics for their time, especially for a racing game. This wouldn't have bothered me as much if it were only the landscape, it is also the car models. I've seen way better looking car models in the older nfs's and I don't expect a game series like nfs's size to go worse in graphics.  Ok.. so far for the bad stuff.. lets recap a sec: there is (in my opinion) no real goal in the game other than winning races and gaining rank. The rewards are race specific abilities and cars, which are less rewarding since you can't even customize them. The graphics are average at best, the cars being the biggest let down for me (graphics wise).  The driving: So what is GOOD about the game, why should you buy it if you dissagree with the above? well.. the racing is pretty good, I love the drifting and the way nitro works in this game. It adds alot of tactic/strategy to the racing, which is cool. You can cut alot of turns or you can try and always get nitro back by driving against traffic, closely passing by cars and drifting (against traffic). Drifiting also is really important. You shouldn't always drift, and when drifting you get the choice of the optimal route or the route where you get the most nitro of.   Conclusion: So its up to you. my advice: if you look for a nfs game, just stay with carbon, it had really nice driving, police chases were epic (throwing wood of trucs to cut them off etc.), customization was still in the game and the game had somewhat of a story/sense of progression. If you are just looking for a racing game, don't really care about customization or graphics, but just (unrealistic) racing. Then this is your game. And ofcourse.. if you have 5 bucks spare.. you can look yourself and see if you share my opinion ^^!",
            "review_score": "-1"
        },
        {
            "review_text": "SO GOOD GAME THANKS FOR THE STEAM AND EA GAMES YOU PLEASE CAN SAY TO ME WHAT THE DATE OF GTA V ",
            "review_score": "1"
        },
        {
            "review_text": "Very great Drifting Racing Game , Just Dont Play it On A Bad Lap Top X3 ",
            "review_score": "1"
        },
        {
            "review_text": "no achievements or anyone playing online but apart from that its a ok game if you got it cheap",
            "review_score": "1"
        },
        {
            "review_text": "this game provides EVERYTHING!!!!!!!!! u really should get it.",
            "review_score": "1"
        },
        {
            "review_text": "My most played racing game of all time. For some reason this game seems to always be able to excite me even though ive played for so many hours on it. Would highly reccomend for the price it's at now.",
            "review_score": "1"
        },
        {
            "review_text": "Great game to play alone or to play with others (online). This is a game where you can see what it is like to be chased down by cops or cops chasing racers. This game has great visuals. If you don't like the controls of this game when you first start out you can just simply change the controls in the settings. Downside to this game is how free drive as cop or racer is limited, you can only drive around the game map and explore, you can't get the police to chase you or you can't find racers to chase in free drive, where as in Need for Speed: Most Wanted you could get the cops to chase you. Overall this is still a great game to play if your into racing or into chasing down racers. Would recommend this game to others.",
            "review_score": "1"
        },
        {
            "review_text": "I keep restarting the race to watch enemy's car crashed",
            "review_score": "1"
        },
        {
            "review_text": "EPIC, A TOTAL MUST HAVE!!!!!!! ONLINE IS AWESOME!!! BEAUTIFUL SCENERY, GREAT SOUNDS, VERY NICE CARS!!!! If you want to drive a BUGATTI COP CAR then this the game for YOU, Koenigsegg, Mclaren, Pagani ZONDA!!!! Lamborghini, Corvette, Mercedes, Shelby, Chevrolet, Renault, Mitsubishi, Nissan GTR -SPEC V PLUS MORE!!!, Subaru, Dodge, Mazda, Ford, Cobra, Porsche, Jaguar, Maserati, Bugatti, :D:D:D:D",
            "review_score": "1"
        },
        {
            "review_text": "Good game. If you like the olds most wanted, carbon, etc, it's a good chance you like this game. It's possible to play online, but it's fun to play alone too, several races with reasonable challenges.",
            "review_score": "1"
        },
        {
            "review_text": "it's like APB without guns and without ice skates for wheels  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Best of the recent NFS. Multiplayer works (Looking at you Most Wanted) And it runs at 60fps (Looking at you Rivals)",
            "review_score": "1"
        },
        {
            "review_text": "Played this so much on Origin and on my PS3. Still the best NFS to date. And yet bought it again for a 3rd time here on steam. Endless hours of fun driving in fast cars.",
            "review_score": "1"
        },
        {
            "review_text": "Decent arcade racer, with nice visuals and police chases (Awesome). The Multiplayer is dead, literally nobody is playing. If your looking for some fast pace races with basicly no story (because Racinggame-Storys are lame anyway) you should pick this one up. It's also cheap.",
            "review_score": "1"
        },
        {
            "review_text": "Ahhh, yah, I say I been on this case for weeks. *cuffs* Take 'im in, boys.",
            "review_score": "1"
        },
        {
            "review_text": "Fast pace, fun, graphics are great. Doesn't remind me much of the other games in the NFS franchise, mostly because the lack of customization and proper storyline. But aside from that it has great gameplay with thrilling car chases and high speed races, lots of crashing, lots of action. The game should last most people awhile with an almost endless amout of races and challenges. I haven't played the multiplayer yet (Login problems, lol if i know, EA i guess..) but from what i've seen and heard, the multiplayer is awesome. I would give this game a 9/10, would play again.",
            "review_score": "1"
        },
        {
            "review_text": "Very true to the original Hot Pursuit and the best NFS to come out since the first Most Wanted. The car list is varied and except for a few Gallardos there aren't many clones, the entire map has very varied and exotic locations ranging from snowy mountains to a beach town with forests, deserts, plains, cliffs and highways in between, and the graphics are pretty good. The game does not support AA natively though, so you have to force it from the graphics card control panel (and even then it only affects the cars). The soundtrack is nothing special but it isn't bad either, I'd recommend playing your own instead.",
            "review_score": "1"
        },
        {
            "review_text": "Loving this game. It's a great game to relax to on single player, and great for competitive racing with your buddies. Not to mention the sexy looking cars!",
            "review_score": "1"
        },
        {
            "review_text": "now a days- these EA games are no longer online. so enjoy singleplayer if it works!",
            "review_score": "1"
        },
        {
            "review_text": "Extremely fun with friends! Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "I deployed spikes on fellow racer and left him as dog food for the cops. Would do it again. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game with a lot of replay value due to being able to be a regular car driver and cop. The action is awesome and fast paced its an altogether really good racing game. Its worth the money spent, NFS:Hot Pursuit doesn't let down.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic and still great to its name but should be called need for speed:hot pursuit 3 cause if you look at the series you will see this is the third installement of hot pursuit. Great game well worth the small price I enjoy it alot and don't regret getting it :)!",
            "review_score": "1"
        },
        {
            "review_text": "Definately worth the buy! Works relatively well on even lower-end gaming computers, and it's not too expensive. This is one of Need For Speed's better games recently, and waited to play it since its development in 2009. I've played both of the original Hot Pursuit games, and I'm almost 100% sure that this game is what the second Hot Pursuit on PS2 strived to be. I've put in a ton of hours already, and I will continue to do so!",
            "review_score": "1"
        },
        {
            "review_text": "Fun to play, especially against each other in the multiplayer mode; you can find some game friends around the world and compete each other for the best time in some challenges, or set racing matches with other players using the car of your choice.",
            "review_score": "1"
        },
        {
            "review_text": "Good quality racing game, and being a patrolman and shutting down races is very fun. Great graphics. Well worth a few quid/dollars/euros",
            "review_score": "1"
        },
        {
            "review_text": "Made by the people who made the Burnout franchise, what else could you want?",
            "review_score": "1"
        },
        {
            "review_text": "This IS a good racing game if you like mostly arcadey controls, but it seems like people think this is vastly different game from the other 'arcadey' NFS games, it isn't. Other than the Shift series, they all have same open world feel/layout/etc  I see a number of reviews stating that this is 'the best NFS game', to which I strongly disagree.  The first NFS Shift game was and still is one of the best as far as the driving/racing experience is concerned. Granted, it doesn't have missions, open world, rivals, cops/racers, etc, but it IS a 'Need For Speed' game, and I think if they could blend the upgrade system and driving experience from Shift with the open world and polished feel of the Most Wanted, it WOULD be the best.  Rivals is the same game, essentially, but more polished. If you have Rivals already, no point in getting this game, just play more Rivals.",
            "review_score": "1"
        },
        {
            "review_text": "I've never seen this exciting game in my life. I also played some of EA games (ex:Spore,Sims,FIFA etc) until now EA never disappointed me.  This game shows very many of cars and very beautiful graphics. And the turbo or booster of car is very nice Idea. I want recommed my friends to play this game.  So I want to play the next season to Need For Speed. I expect EA.",
            "review_score": "1"
        },
        {
            "review_text": "its kind of fun I guess",
            "review_score": "1"
        },
        {
            "review_text": "So far I love it! It's a little laggy for my computer but that's my fault, still a great game.",
            "review_score": "1"
        },
        {
            "review_text": "good game when played with a few buddies. only 'miss' is the intro video is loud regardless of in-game settings and you can not skip it. I contacted EA/Origin and they said the developers did that for our entertainment while the game loads in the background. good playability. guess the other concern is with force feedback turned on, when you crash someone else's car it cuts to the scene of their car crashing which then kicks off your force feedback... ooops. so I dont use force feedback which is unfortunate. I do not recall if the shifter is set up for it fully other than 'up down' (ie paddle) vs full shifting ie for my G27 set up. Good response to the steering and the peddles though and all controls are customizable although flaky at times for programming. Sometimes need to restart the game (and loud video) to change settings and we are recently (Jan 2014) having issues with players being dropped while racing.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, very good gameplay, would recommend to anyone",
            "review_score": "1"
        },
        {
            "review_text": "I normally hate the 'simulation' style of racing or flying games. I am all about upgrading and modding and cosmetics out your car. This game though is well worth the money. if you get the bundle pack you are only paying like 3$ for the game, it normalluy is 19.99, Definatey worth it! Hella fun! I get my heart pumping when i am cop taking down the racers.",
            "review_score": "1"
        },
        {
            "review_text": "Best Racing Experience. GO Need For Speed ;)",
            "review_score": "1"
        },
        {
            "review_text": "It is a fun game, nice graphics, open world, best supercars there are etc but the handling it's just too ♥♥♥♥♥♥♥♥,. If you are bored on a rainy day, this is the game. Don't buy it at full price, not worth it.",
            "review_score": "1"
        },
        {
            "review_text": "worth buying for 'Title Fight' race alone (Impreza STI vs Lancer EVO X) 9/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is ♥♥♥♥ing awesome! PvP chase at the highest level! 10/10!",
            "review_score": "1"
        },
        {
            "review_text": "Criterion's soft embrace shines through this game. By all means, this series needed a fresh start, and it's headed in the right direction now...at least this game is.  Pretty hard on its own, the AI WILL make your life harder. Hot Pursuit 2 has one of the hardest careers in the series, so old school FTW. The multiplayer is even better if you find decent people to play with (and not wreck their own team mates). Only downside: NO ♥♥♥♥ING SPLITSCREEN!!!  And even though i despise racing games with no split screen, this is better than Most Wanted 2012...and any !arcade! racing game released thus far.",
            "review_score": "1"
        },
        {
            "review_text": "Good game although the multiplayer is pretty much completely dead. Fun to play single player and doesn't need a mouse so it's easy to play in the car or at an airport to pass the time. Just don't go into the game thinking you'll have heaps of fun on multiplayer, or you will be disappointed",
            "review_score": "1"
        },
        {
            "review_text": "Really good fun game, the autolog is easy to use and always keeps you wanting to beat your friends' score! The multiplayer is also very fun.",
            "review_score": "1"
        },
        {
            "review_text": "This is the first Need For Speed game I've played in years. I might've played one of the older ones on the PS2, and I know I played the original The Need For Speed (yes, 'the' was part of the title at the time) back in 1994 on the 3DO. My point isn't to say, 'look at what an old gamer I am,' but instead to illustrate that I have relatively no way to compare this title againt contemporary NFS games.   GRAPHICS: The visuals are fantastic! The cars shine and reflect light and other objects, the roads kick up dirt and dust, and there's a day/night cycle.   There seems to be a distinct lack of anti-aliasing if you look closely, but given that you'll usually be going 300 KPH (that's 186 MPH) or so, you don't really have time to closely examine this. I imagine they decided to skip AA in favor of having higher framerates, which is more important in a high-speed racing game. Regardless, if you really need AA, you can always enable it through the Nvidia or ATI control panels.   CAMERA: There is no cockpit mode, so you won't get to simulate actually being in the car or looking around at the inside of the cabin. The closest thing to this is a camera view that seems like you're looking from on top of the car's hood. You can also drive without any object on the screen except the speedometer, in addition to the standard 'behind-the-car' view.  Personally, I kind of miss the cockpit view. It's not a dealbreaker by any means, but it would've been nice to have.  AUDIO: The game has plenty of engine rumbles and tires squealing. Really, the sound effects aren't anything noteworthy, but they're not bad either.   The music annoys me, however. This NFS title has an in-game radio that you can't shut off without muting all music. Your only other options are to choose between 'sequential' and 'shuffle' modes for the music. Maybe this isn't an issue if you like the music in the game (I think all the songs are from real bands, but I don't know for sure; my musical tastes are still stuck in the 1980s), but if you don't, prepare to mute it all. It would've been nice if we could add our own MP3 tracks, and there might be a way to do that, but I wouldn't know how.  HANDLING: This is a big one and probably the most subjective category. I think the cars handle great, but this is by no means a simulation. You're limited to accelerate, brake/reverse (hold the brake button down and the car shifts into reverse), the emergency brake, and oddly enough, the ignition, so you can actually turn your car on and off.   You can also turn your headlights on or off, and if they're off when night rolls around, they switch on automatically. You can still turn them off then and drive around in the dark, but it doesn't really have an effect on the gameworld (i.e. drivers don't honk or flash their headlights at you).  There's no way to change from an automatic transmission to a manual one in the game, despite most of the cars present probably have the latter or at least an option between the two. This doesn't really bother me as I always found a manual transmission to be distracting, but I know some people want it.   DAMAGE: Your cars can and do take damage, although it's practically all cosmetic. You'll get plenty of nicks, scratches, and even dents, but nothing will break nor will any damage affect your car's ability to function. The one and only time damage actually matters is if you hit an object at a fast enough speed with enough force to cause a fatal crash. Then the game shows a little sequence and then you restart back on the road.   CARS: What about the cars themselves? They're all real vehicles, fully licensed by the companies that make them. This is probably why damage is so limited.   It's neat to see the real car brands, as opposed to thinly-veiled knockoffs, but other than some information when choosing the car itself or knowing you're driving such-and-such vehicle, it does little to enhance the game.   MODIFICATION: This is strictly limited to paint color, and even that varies. Some cars don't even let you change the paint. You can't even change spoilers or headlights or tires, and you can forget about fine-tuning the engine.   Again, this is more of an arcade game, not a simulation, so perhaps expecting that level of detail is a bit much. I know I didn't, but I've read some complaints about it before.  STORY/CUTSCENES: There is no story. You simply play a speeder or a police officer, and have to complete missions and goals. When you do this successfully, you gain points (your 'wanted level') which can be used to unlock new cars.   The cutscenes are extremely annoying in that you can't skip them. This is particularly aggravating the first time you boot up the game, and each time you access a new area in the game itself. There are also a bunch of voiceovers, many of which occur when you select your vehicle. I think the automakers wanted a sales pitch to gamers and used this game as a way to do it.  ACCOUNT: Yes, there's a required account. No, you don't need Origin, but it does want your EA/Origin email and password. Without that, you can't sign into the game's account service (called 'Autolog') and thus can't play the game.   It's slightly annoying, but if you already have an EA or Origin account, it's at least quick and easy to do. If you don't, then you'll have to sign up and that might be a hassle.   VERDICT: I really like this game. It's not realistic, but it was never inteded to be either. If you want an arcade-like racing game that doesn't even pretend to have a storyline, and you don't mind using Autolog, I'd strongly recommend this game.   On the other hand, if you want a hardcore simulation and detest the idea of signing into anything (except maybe Steam), you might want to pass this game up. It won't do anything for you and there are plenty of simulations available elsewhere.",
            "review_score": "1"
        },
        {
            "review_text": "This version of Need for Speed was very different the first few older Need for Speed titles. In this installment they added 'weapons' to the racer and the cop. This wouldn't be such a problem if they had balanced them in some sort of way. They always seemed to work really well for the racer, but on the other hand, cops didn't have as good weapons. Although they were different, they never worked out well. The racers had weapons that would in a since, 'deal damage' to the cop or aid in there escape. Cops had weapons that would help stop or slow down a racer. Makes since right? Well it really shouldn't have been a problem besides playing with only 1 person (which I find to be the only way to play it seeing as the multi-player is basically dead.) Playing with only 1 other person would make it have to be cop v. racer. Racer usually has the upper hand, mainly because it starts you off in the lead although the cops can usually catch up pretty quickly. Overall I enjoy playing it. I definitely suggest you buy it.",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed this game, it remembers me of the original The Need For Speed on the Sega Saturn, i love the feeling of speed in this game and it don't ask you to loose time making ♥♥♥♥♥ in the hood of your car, the ambient in this game is nice. Don't expect it to be nothing like the post-NFSU era.",
            "review_score": "1"
        },
        {
            "review_text": "Great maps and cars with the option to play as a criminal and/or police. Pretty frustrating but it's cool. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "NFS:HP is a worthy addition to the NFS family, as it features gorgeous graphics, decent (albeit a bit simplified) car handling, and enough arcade elements like EMP gun and spikes to make for some interesting 'vehicle combat' without going overboard. Its main problem is the balance of careers, as the odds are stacked against the cops, with less game types and less tolerance for damage. Still online games are a blast as you go after speeders or be a speeder with your friends playing either side, and 'AutoLog' recommends you and your friends to go after certain records in race types, creating 'offline competition' as well. It's a lot of fun.",
            "review_score": "1"
        },
        {
            "review_text": "I really like this NFS game. Is it one of the best?.....no. Is it one of the worst?........no.  Positives: It has great graphics and the recycled NFS controls which make it very enjoyable. The racing style is a remake of the original Hot Pursuit (obviously). The racing is great and being the cop is what made the original game so popular.  Negatives: When compared to games like Most Wanted and Carbon, it does not have any traces of a story line or story behind your character and the surrounding area.  It does not have a free roam that includes chases. The only thing this free roam has is traffic, all you do is drive around and learn the roads. It eventually gets boring once done with the arcade style 'Career' mode.  Graphics: 9/10 Controls: 10/10 'Story': 6/10 [if it can be called that?] Racing: 8/10 Overall: 7/10  (While not as good as its more recent counterparts; HP makes up for it with great controls and graphics.) ",
            "review_score": "1"
        },
        {
            "review_text": "So appearantly if you go really fast you win races, since I'm a born Hedgehog I was ment to go fast. So I recommend this game only because I need more people to destroy c:  11/10",
            "review_score": "1"
        },
        {
            "review_text": "Need For Speed: Hot Pursuit  Pros: Fun and smooth vehicle handling Awesome crashes Good collection of cars Cop and Racer career Interesting AI  Cons Autolog and friends needed for multiplayer Max Bounty 2,000,000 meaning you can't see players' real game time and skills No DLC for Steam (I was excited for Arms Race and Most Wanted)  7/10",
            "review_score": "1"
        },
        {
            "review_text": "A Crown Vic does not and can not outrun a Lamborghini Gallardo LP570-4. 91/100",
            "review_score": "1"
        },
        {
            "review_text": "Good. Enjoyable game. Recommended!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best NFS I've played. Must buy!",
            "review_score": "1"
        },
        {
            "review_text": "My first time I played, but when I looked at the clock, 12 hours ago",
            "review_score": "1"
        },
        {
            "review_text": "I used to play this on Xbox 360 all day when I was a kid, only used the Crown Victoria whenever I could. Wonderful game on PC too. Very few Police oriented games out on the market though.",
            "review_score": "1"
        },
        {
            "review_text": "Very good for an old game!",
            "review_score": "1"
        },
        {
            "review_text": "Very good game with excellent graphics. Buy it, you wont regreet",
            "review_score": "1"
        },
        {
            "review_text": "Hidden DRM IN Game EA Adverts No Skipping Cutscenes No Customization  Bad.",
            "review_score": "-1"
        },
        {
            "review_text": "I Love This Game It I sSo Fun!",
            "review_score": "1"
        },
        {
            "review_text": "DO NOT BUY!!!!! this is a driving game with no gears and skocking force feedback wot is the point. i mean thats like a war game with no weopons and no sound pointless. i will be asking steam for them to re-found the hole 3 pounds spent. truley shocking game,,",
            "review_score": "-1"
        },
        {
            "review_text": "My Best Race Game Ever ^^  I love this Game and i will recommended...",
            "review_score": "1"
        },
        {
            "review_text": "Game is awesome. Much better graphics than i expected",
            "review_score": "1"
        },
        {
            "review_text": "Great graphic, great gameplay, too bad it doesn't have cloud storage.. but it's only this game downside. this game's server is still running",
            "review_score": "1"
        },
        {
            "review_text": "Just horrible ...",
            "review_score": "-1"
        },
        {
            "review_text": "Overall it's a good game, but not as good as older NFS titles such as the original Most Wanted, Underground 2 etc.",
            "review_score": "1"
        },
        {
            "review_text": "Fun driving game, but at the same time there are so many things wrong that make it relly frusterating and un-realistic. For ex:   &gt;the cop cars &amp; helicopter suck..   &gt;you can be 200mph in a lambo on a twisty back road or straight away... drifing and tearing it up.. holding in your nitrus the whole time until it empties: Doesn't matter. You can't outrun cops or other cars you are racing. They are alway in your rear view. No matter what. Its ♥♥♥♥♥♥♥t. There's almost no point in using a nitrus aside from a time trial, cause in an actual race, it really doesn't give you any advantage. Its not like the old need for speed where you could master the course and end up a full lap ahead of another racer. Here, there is always a racer or cop like a second or two behind you.   &gt;The physics are kinda meh. The cars handle really mushy. So as a result, you are forced constantly into a drift around it seems every corner. Like every corner, even little ones.   &gt;no option for automatic/manual. Its all automatic.   &gt;the time trials are a joke. Like cut way too close. You can't go to the next map until you finish the first a lot of times, and I have to redo a time trial map over &amp; over &amp; over cause I miss a half a second or a 10th of a second on a map that takes overall 5 or 6 minutes.    &gt;the cops suck  &gt;You can't scip cutscenes. Why? Most of them aren't really all that important anyway.   &gt;A lot of the corses are related to evading cops or being the cops, so if you don't like the ♥♥♥♥♥♥♥t about a cop in a regular cop sedan drifing 200mph perfectly through backroads 2' from your bumper, then you probably wont like this.   &gt;the cops are super unrealistic, cant be outrun in their piece of ♥♥♥♥ cars even at 220mmp with your turbo button held down.. they still fly past you. Bull ♥♥♥♥.   &gt;Did I mention the unrealistic cops suck and ruin the game?   I dunno, its fun as a driving game and I'm not done with it. But its more frusterating than it is rewarding. Makes you feel like you are working really hard for nothing a lot of the time the way they did things.",
            "review_score": "-1"
        },
        {
            "review_text": "This game kinda reminds me of a dumb blond... Generaly popular, but when it comes down to facts and logistics its about as smart as a bag of rocks. In which you stare and think about it.... 'At least you're pretty'.",
            "review_score": "-1"
        },
        {
            "review_text": "Can't skip any cutscenes and it took me at least 20 minutes to actually get to play the GAME. If you have a really short attention span like me, this is just going to put you in a bad mood.  Gameplay isn't too bad, but not good enough to change my mind.",
            "review_score": "-1"
        },
        {
            "review_text": "I buy this game because i miss need for speed world. By the way 10/10 m8!!!",
            "review_score": "1"
        },
        {
            "review_text": "EA games has crapped a Horse turd here, first let me say beautifual graphics and easy game play, now off to the bad, you need a EA sports account to play online with friends easy? No..., a lot of graphic settings are unavailiable, when you get in the game.. easy fix.. No unavaiable, then it sucks you in as going to be fun Newwwp again.. it is, till you progress, everything you have proquired along the way.. then is taken away from you, the further you go the worse it gets, the more i aquire the worse it gets, its a never ending battle, if i could take back the gift as i sent to a friend and get my money back i would, and spend it somwhere useful",
            "review_score": "-1"
        },
        {
            "review_text": "Too much a departure from the models of most wanted, carbon, and undercover. A graphics update to the original form a decade ago with pointless free roam aded to the game.",
            "review_score": "-1"
        },
        {
            "review_text": "Best game everrrrr. Find friends to compete with and its more fun. Add me if you wanna play ;D",
            "review_score": "1"
        },
        {
            "review_text": "Heyyo, a NFS game that returns to its roots... sweet. Campaign includes a police mode which is a fist too. Really fun game.",
            "review_score": "1"
        },
        {
            "review_text": "Unenjoyable game, dull tracks where you basically hold the accelerator all the time, and simetimes makes a 'drift' through corner using handbrake in 300kph ... right. Also AUTOLOG servers are broken and keep disconnecting, thus MP is imposible to play. I know it is an arcade racing, but for arcade racing it is not really fun, I would rather recommend Sega Sonic All Stars Racing, that is a fun arcade racing/flying/whatever game.",
            "review_score": "-1"
        },
        {
            "review_text": "5 Euro for this?! This game is not worth even 1$... The car takes 40% of your screen, you cant see the road ahead...",
            "review_score": "1"
        },
        {
            "review_text": "The last good Need for Speed game right here.",
            "review_score": "1"
        },
        {
            "review_text": "Game good. Traffic bad  I'mma put this plain and simple, I LOVE this game to bits, but I'd love it a lot more IF THE TRAFFIC WAS REMOVED OR BETTER PROGRAMMED  Seriously they place the traffic cars at the worst places, and when you're heading for them.. THEY JUST SIT THERE AND DON'T TRY TO DODGE OUT OF THE WAY.  REMOVE THEM.. PLEASE  7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "man oh, man. this isn't the best of games the Need for Speed franchise has released... the one thing i want them to add so dearly... is car customization. because there is none. :( .. .  .",
            "review_score": "-1"
        },
        {
            "review_text": "They turned the multiplayers servers off today, so dont buy for multi fun. Also speed hackers are rife in this game :(",
            "review_score": "-1"
        },
        {
            "review_text": "Good game! you should get it! It is hard though, but practice makes perfect. If some say its a bad game, but its all you need out of a racing game! its very fun! And, its totaly worth the money! yes, it gets annoying sometimes, like i got .04 seconds from beating a time, but theres nothing bad about the game at all! Great game, so get it!",
            "review_score": "1"
        },
        {
            "review_text": "Cops+racing+criterion games. Catches the feel of the old NFS,and a tiny bit of burnout at the same time (just a tiny bit). While the SP and MP is all good,the best feature is definetly autolog.I'd dare say it'll make you play the campaign differently!  PS:same caveat as Burnout Paradise:PC is missing DLC that the consoles have. PSS:Steam version has no secondary DRM,unlike Unleashed 2.",
            "review_score": "1"
        },
        {
            "review_text": "Guy dont get fooled by the ''open world'' tag, this game has a good engine, nice graphics and the races are pretty fun but the limitations are extreme, the game is litterally: do a race with preselected cars, do the next one, oh this is a timed race. WITH NOTHING IN BETWEEN! there is NO freedrive, 0 customization for the cars except a few preselected colours and NO storyline, u just do some random ♥♥♥♥, get 15 mins of cutscenes in between them and move along to the next ♥♥♥♥. NFS undercover was pretty ♥♥♥♥♥♥ but i enjoyed it more than this because it felt like it had a story, i could get a head start over other by upgrading my car and i could make it look amazing, i just REALLY MISS THAT TL;DR: good graphics/enging/physics no free drive, no customization, long ♥♥♥ cutscenes and no storyline",
            "review_score": "-1"
        },
        {
            "review_text": "Very empty game, not optimised well, almost no cars. Not worth the price.",
            "review_score": "-1"
        },
        {
            "review_text": "You make a game for console, replace button pictures with keyboard and woala! 10/10 pc game, perfect controls, advanced options, EVERYTHING you need to be tilted and uninstall broken games",
            "review_score": "-1"
        },
        {
            "review_text": "I've always been a fan of Police car chases.. Now theres a game which allows u to be in the drivers Seat! This is such an awesome game The graphics are really good making it feel more alive and more real The gameplay is great. The only let down in this game which is what i love in most of the need for speeds (PS2 seris included) is that you can't free-roam! But on the flutters rating board it is 9/10",
            "review_score": "1"
        },
        {
            "review_text": "this game will make u rage,Simple... Buy it",
            "review_score": "1"
        },
        {
            "review_text": "This Game is FUN !!!",
            "review_score": "1"
        },
        {
            "review_text": "i don't know what you guys are on about when you say it's the best game in the franchise, it was dreadfull the terrain looked crap and so did the trees the only thing that looked good was cars. Aswell as that there is nothing to do but race race race, and yes there is a freeplay but even then its boring THERES NO POLICE CHASES I TRIED SMASHING AND SPEEDING FOR 2 HOURS AND NOTHING HAPPEND.  Don't buy this game it's only good at first :(",
            "review_score": "-1"
        },
        {
            "review_text": "I've played many NFS series games, including the first ones, and this is probably the worst one. I bought this game because I wanted a car racing game and I recalled the fun I had playing cops and running from them previously. This title doesn't deliver at all.  NFS: Hot Pursuit has only one good thing about it - a variety of cars. But it doesn't matter as every car feels the same since this game has no proper physics at all. Cars stick to the road as if glued, you bounce from the walls like a ball and even the engine sound is average. The game has no soul, no emotion, getting a new car after every race is not exciting at all. Just boring.  Maybe if you're into 100% arcade and don't expect much - you might like it. But if you're into cars and even slightly demanding races - stay away, or you'll be just as disappointed as I was.",
            "review_score": "-1"
        },
        {
            "review_text": "You like to move away from the law, then this game is for you!!",
            "review_score": "1"
        },
        {
            "review_text": "I like it. The controls, graphics and sounds are top notch. The amount of tools you have at your command is most impressive. Both offense and defense. The fun factor is high and action packed! It has an active online community.   My system runs it great   Windows 8 64-bit AMD Six-Core FX-6200 3.80 gigahertz AMD Radeon HD 7570 graphics card 10 Gigabytes of ram  2 Thumbs Up ",
            "review_score": "1"
        },
        {
            "review_text": "TAKE THE THING AND MAKE IT DO THE THING, REALLY FAST! ~CRAVEN MORHEAD.",
            "review_score": "1"
        },
        {
            "review_text": "Unplayable console port with long introduction movies that can't be skipped. It require you to log in to some buggy online service just to play single player. No working controller support. The car physics is neither realistic nor fun.",
            "review_score": "-1"
        },
        {
            "review_text": "No real graphics options No manual transmission Not arcade physics, but also not sim physics, just a bad driving feeling all round  Just terrible, wish I could get my money back.",
            "review_score": "-1"
        },
        {
            "review_text": "Fans of the old Hot Pursuit with the MULTIPLAYER zaniness and fun, DO NOT BUY THIS for nostalgia's sake. Multiplayer has no bots that I know of, so you cannot play a game with your friend against AI cops. If that feature existed (or exists) I will change my review. I was hoping this was somewhat like NFS:HP2 for Gamecube, but instead it reminds me of any old racing game, but with human played cops. IF ANYONE WAS ONLINE that would be good.  That being said: The single player is fun. I got wrapped up in it and it did remind me of the old games. Why they couldn't take the AI they implemented in these and add them to multiplayer races, I don't know. If you just want a well made racing sim, or have enough friends to populate both the racer and the cop positions, this is a very good game, and I'd recommend it to you. But I wanted the AI cops in multiplayer... Set my bar too high for a modern game, I suppose.",
            "review_score": "-1"
        },
        {
            "review_text": "whan you change pc or you reinstal u go back to LVL 0 that is a bad thind for this im mad and ther is no manny people playing on line this game ",
            "review_score": "-1"
        },
        {
            "review_text": "The Best",
            "review_score": "1"
        },
        {
            "review_text": "Nice Cars",
            "review_score": "1"
        },
        {
            "review_text": "This game is clearly made by Americans that only drive in big American muscle cars, and have never once been in a European car nor seen them race on the Telly. all cars handle like some guy capped the steering wheel at a maximum maneuvering of 5% turn on the steeringwheel (maximum from 11 to 13 o'clock).. it's stupidly bad.. thanks for Steam refund :S",
            "review_score": "-1"
        },
        {
            "review_text": "Even with 900* wheel this one does not even feel like a racing game. But hey... it's what to be expected with NFS brand, right? So don't be fooled by idea that  everything and everyone evolves over a time , NFS proves otherwise. Don't buy it, don't play it. Not worth it.",
            "review_score": "-1"
        },
        {
            "review_text": "Forcing speeders off the mountain and to their death is still a fun and appropriate action when driving an overpowered pursuit vehicle.",
            "review_score": "1"
        },
        {
            "review_text": "9/10  I love this game so much however there is one thing that annoys me about it. The AI, If you play as a cop and you have to chase a suspect, there are spiky things, helicopters, explosions and more yet all the other drivers who arent police or racers seem oblivious and carry on driving slowing causing a lot of crashs around blind corners. You would think that they would have the sense to at least pull over until the massive police chase goes away... Apart from that, I LOVE IT!!!!",
            "review_score": "1"
        },
        {
            "review_text": "8.8/10 According to most of the reviews online, this is one of the best Need For Speed games in the series, and I couldn't agree more. Criterion has done a great job (if not, a better job than EA) making this masterpiece. The game is very much back to its roots. It's much like the first generation of games in the franchise. The fact that Criterion was in charge in making this game proved that EA and/or Black Box are fond of making too much changes to the game, therefore dissapointing fans. Criterion knows well what the fans want.   The game may start a bit slow but as you progress throughout your career (as a racer or cop), it gets faster and better. It also gives you certain types of equipment to help cope with the sh** load of challenges in Career mode.   I know this game is pretty old but it's still worth playing. Seriously, I was paranoid when I bought the game with the leftover $20 I had, anxious that it wouldn't be worth the 20 bucks. Need For Speed Hot Pursuit definitely proved me wrong.  I made this recmmendation hoping that I'd get more friends to play the game. Single player isn't the only feature in this game and I'd love to try out more WITH friends.   Thanks for reading! ",
            "review_score": "1"
        },
        {
            "review_text": "One of the few NFS titles that isn't crap, because it was made by Criterion, who also did Burnout Paradise. Open-worldy, beautiful, and lots of fun.",
            "review_score": "1"
        },
        {
            "review_text": "Its cheaper then The Crew. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "biggest ♥♥♥♥♥♥♥t. all other racer crash and you cant avoid crashing too. better UI pls",
            "review_score": "-1"
        },
        {
            "review_text": "Not an awful game, but it really fails to bring back what made the old Hot Pursuit/High Stakes NFS games special.",
            "review_score": "-1"
        },
        {
            "review_text": "To be short: did not live up to expectations.  To elaborate on that, I grew up with Need For Speed, specifically Need For Speed: Hot Pursuit 2. This may seem weird to some people, afterall how could the second in a series have come before the first; the reason for this is that this specific game is not the first Need For Speed: Hot Pursuit, rather it is a remake of the original Hot Pursuit duo. On the good side, this game made me very nostalgic; the map is very much like the map found in the old Hot Pursuit 2, the car selection is very similar to the old game, it doesn't have any customization or performance mods on the cars bogging down the experiance other than a selection of paint colors, and I could once again become the cop in a seperate cop campaign. In these ways it is very much like the game I learned to enjoy as a child.  However, on the darker side of things, these are the only apparant ways the two are similar. The game has done away with things that made the older game better to me; things like a behind the wheel camera view, quick race mode, and a decent tournament style ladder have been abandoned completely in favor of a gimicky multiplayer focused menu, wannabe social networking clone, and a pointless leveling system. As if that weren't bad enough, I could deal with those things, but the final nail in the coffin is transmission selection. Why? Because it doesn't exist. Every car is locked to automatic, probably to even the playing field in the earlier mentioned multiplayer focus. In the old game I would play manual every time because I found out early that you could shift a lot more effectively for yourself than the computer would for you, and I am sure any avid racing gamer would back me up on that. So imagine my surprise when I found out that the thing that let me be a better racer didn't even make it into the game.  What I am saying here is not meant to dissuade the casual gamer, this is a good game to sit down and go head to head with friends on. However anyone looking for a serious racing game should not get this game, the features are too light. In the same vein, if you found this game looking for a revitalized version of an old game you enjoyed you should look elsewhere, because it isn't here.",
            "review_score": "-1"
        },
        {
            "review_text": "Not worth it, many unskipable parts of the game.",
            "review_score": "-1"
        },
        {
            "review_text": "It's not a HORRIBLE racing game, but damn, the interstials between races feel like they take ages, and they are so damn numerous. Compound that with the rubber band apparently tied to your rear bumper. You can take out an opponent with a spike strip, causing them to spin out, while you're driving at 150mph and they will catch back up to you WITHIN SECONDS.  Might be more entertaining online, but I only played single player.",
            "review_score": "-1"
        },
        {
            "review_text": "It isn't 'bad' but it is far from 'good'. If it is a few dollars (like when I bought it) then pick it up, it is worth that much. However looking at the store page, it is certainly not worth twenty USD. I come to the game with a very picky racing game taste so if you don't share the same standard as I do this game is most likely for you. I like realistic driving games, I like to have correct physics, beautiful sound, stunning graphics and cockpit view. I use to play Xbox 360 and Fortza 3 was the best racing game I ever played because it had all of these things and I've been trying to find a good alternative on the PC.  Pros: Graphically pleasing, sound is good (Using Sennheiser 239) and it is overall entertaining  Cons: Unfocused sound, the physics is lazy, cars handle the same, funky controls, not a satisfying driving experience, can't skip cut scenes (I just want to drive!), poor steam integration, NO COCKPIT VIEW  This game, without a doubt looks great and the sound quality is really good. However that isn't enough for me to recommend this game to anyone. The controls are clearly designed purely for a steering wheel and I'm sure it is great. But I don't have a wheel so I use my keyboard and there is a large delay in the steering. When I turn it takes about half a second for the guy to realize he is driving a car and that I want to turn, once he realizes his duty he slowly begins to turn taking about three quarters of a second to do my bidding. In a racing game, that’s an age. And because of this system I wasn't able to make minor adjustments (like I can in Euro truck) to avoid a roadblock or make it to a shortcut. If I get a wheel I'll come back and see if it improves.  While the game may sound great, it isn't focused right. I feel like it is too busy on the outside driving by signs to make a 'whoosh' sound. It should be focused on the car, my car, and the beautiful noises it can make. I noticed it a bit less on my Samsung HT system but with my headphones it was excruciating. The soundtrack is okay, but I would have been fine without it and put on my own music. The soundtrack also contributed to the busy sound going on.  The physics felt wrong, I shouldn't be able to do half these turns and keep the grip to stay on the road. And if the physics were right, I'm sure the handling would have also been better. The part that makes each car unique is the looks, the sound, the speed and the handling. If all the cars handle the same it feels out of place and gives me no reason to look forward to other cars, other than the really nice sport cars. Also, I shouldn't be able to drift that easily. If everyone can drift with ease it ruins the fun of drifting.  The game itself feels more like an action Hollywood movie film than a racing game, which can be fun but it isn't my type of game. There are crashes, drifting, cop chasing, spike strips like in James Bond and other cool gadgets. It is just ridiculous and stupid fun, but that isn't enough for my recommendation. ",
            "review_score": "-1"
        },
        {
            "review_text": "The game has some long, unskippable videos at launch, and then the menu to customize the controls doesn't seem to function at all. I'm glad I purchased this game on sale so I didn't waste too many dollars.",
            "review_score": "-1"
        },
        {
            "review_text": "I really enjoy the Need for Speed series, but it seems like every new title is two steps forward and twenty steps back.   PROS    Great visuals   Play as police again, finally   Vehicle damage   Large open world    CONS    Autolog   No manual transmission   No behind-the-wheel camera   Most events are limited to a small section of the world   Open world is mostly just long stretches of track   Handling lacks any realism   Autolog   Most events use rubber-banding bots instead of any realistic AI   No visual customization   Clunky interface ported from console   Autolog   Autolog   No tuning   Autolog   Vehicle damage is not realistic   Autolog   Power-ups   Autolog   Autolog   Autolog  ",
            "review_score": "-1"
        },
        {
            "review_text": "Don't buy this game when there is another need for speed out that is better! Otherwise this game is great but just as an old game.",
            "review_score": "-1"
        },
        {
            "review_text": "Great racing game, graphics are good. Would recomend a Gforce graphics card to play for best experiance.",
            "review_score": "1"
        },
        {
            "review_text": "I've had almost if not all NFS games across all sysyems since the first one, this is quite fun, wish I could find some friends playing it, I also play Dirt 2 and 3 and Grid often, hit me up",
            "review_score": "1"
        },
        {
            "review_text": "Asphalt 8 has much better graphics on tablet, than this on PC",
            "review_score": "-1"
        },
        {
            "review_text": "I do not recommend this game",
            "review_score": "-1"
        },
        {
            "review_text": "yeah its alright",
            "review_score": "1"
        },
        {
            "review_text": "I am giving this game a thumbs down for two reasons. While the game looks beautiful, it is quite boring - there isn't much of a storyline, and the whole thing is a very linear, step-by-step process. Compared to previous NFS games such as Most Wanted, there is very little liberty, and I guess I just don't like that. As I said, just feels boring. Second, the cars feel like bricks and are incredibly tough to handle.... They turn like boats and the manoeverability just sucks. Very disappointed and got a refund right away.",
            "review_score": "-1"
        },
        {
            "review_text": "Today's Review: Need For Speed: Hot Persuit  Pros: *Amazing driver controls, fully customizable. *Great graphics for the 2010 era *Cars and world enviroment respond as expected for a car game *Incredible music *Play both as a bandit or as an enforcer  Cons: *Fps drops badly constantly unless you have a high end pc or low graphics settings *No open world *Races become incredible hard at mid game  87/100 'Yes, it's a Yes must buy'",
            "review_score": "1"
        },
        {
            "review_text": "86 of 100 for this game? Really? These reviewers must absolutely be affiliated with EA. This game is nothing but a boring arcade without any customization, plot and joy. Autolog is not a killer feature. Please give my money back.",
            "review_score": "-1"
        },
        {
            "review_text": "When I first played this game, I was expecting it to be a return to the original days of Need for Speed (read the original Need for Speed 3, and Need for Speed Porsche Unleashed; my first taste of NFS games). I was dissapointed. The graphics are good but that is about it. There are too many ridiculous cutscense as has been the case lately, and the driving dynamics are so bad it makes you not even want to play it. The series will never be the same again.",
            "review_score": "-1"
        },
        {
            "review_text": "I recommend this game to anyone who likes listening to hours and hours of police sirens.  Some more info in Q &amp; A format:  Q: How is the soundtrack? A: Police Sirens! Q: How do the cars sound? A: Police Sirens! Q: Does the game let you race against a ghost car representing your best time? A: No. Q: Any other comments? A: Flashing lights. Always flashing. Blue and red and blue and red and POLICE SIRENS!",
            "review_score": "-1"
        },
        {
            "review_text": "Seems like a big map, but it doesnt take long to get from one side of the map to the other in a car that can go over 200mph. Missions are fun, as are the races. Seems like a solid game, though $20 might be a little too much",
            "review_score": "1"
        },
        {
            "review_text": "Unlike NFS:U that was very playable - and enjoyable - with keyboard and NFS:U2 with steering wheel, Hot Pursuit is far from enjoyable either with keyboard or steering wheel. Physics engine is crap. What's a racing game without a decent physics engine? Nothing. Guys, you can skip this NFS.",
            "review_score": "-1"
        },
        {
            "review_text": "Terrible. Most Wanted owns this hard. Dont waste money on this game theres much better ones and cheaper.",
            "review_score": "-1"
        },
        {
            "review_text": "+",
            "review_score": "1"
        },
        {
            "review_text": "The intro tutorial killed me. The unskippable scenes burried my body, and the poor gameplay ate what was left.",
            "review_score": "-1"
        },
        {
            "review_text": "-no AA support. -have screen tearing -cars feel super heavy. -rubber band ai.  crap game... get Grid insted (not grid 2, sucks too).",
            "review_score": "-1"
        },
        {
            "review_text": "Feels like playing on tablet.No skills needed it takes corners on itself every even slightest turn is a drift otherwise like drag racing.You gotta be a 10 y.o to like this game.Classic EA ripoff",
            "review_score": "-1"
        },
        {
            "review_text": "I didn't even got to play.  - Doesn't detect game pad (which works fine in ALL Steam games I own). I ain't playing a racing game with keyboard. - Asks for EA account to play, but it is actually not needed. If your game is on Steam, it should use the Steam account. Period. - Will spend 1 minute of your life explaining you the menu options. Nobody needs this ♥♥♥♥. This is one of the most idiotic ideas an EA project manager has ever had. - When trying to assign controls to pad, the game doesn't detect input. What's worse, cannot cancel so the only way out is to alt-f4.  Didn't expect anything less from Electronic Arts. Well, at least I got it with a big discount.  EA/10",
            "review_score": "-1"
        },
        {
            "review_text": "this one is the best NFS",
            "review_score": "1"
        },
        {
            "review_text": "Just a fun racing game.",
            "review_score": "1"
        },
        {
            "review_text": "Way too much unskippable BS. For a game that has 'speed' in the title, there's way too much waiting. I spent the majority of the first 30 minutes smacking buttons over and over, hoping one of them would skip the god-awful tutorial, the uninspiring, boilerplate intro cutscene, or the drawn-out introductions for the crappy cars I had unlocked.",
            "review_score": "-1"
        },
        {
            "review_text": "Very fun game, the gameplay is great and the multiplayer is one of the best I've seen. The online play is perfect so your opponents dont jump around on the track. The graphics are incredible and very clear. 10/10 - worth $20",
            "review_score": "1"
        },
        {
            "review_text": "crap , the older versions are better for fun.",
            "review_score": "-1"
        },
        {
            "review_text": "It's good game !!!",
            "review_score": "1"
        },
        {
            "review_text": "This game has none of the charm of its predecesors. No storyline or cutscenes.  The yoyo physics in this game make it resemble a pinball game more than a racing game. Since the cops and and opponets are always a bit faster than you it makes gathering cars and car selection seem rather meaningless.  On the positive side the visuals are nice.",
            "review_score": "-1"
        },
        {
            "review_text": "I have played nearly every NFS release since the groundbreaking original back in 1994. However after the original 'Most Wanted', the series really seemed to struggle. This iteration of Need For Speed similarly struggles to live up to the reputation of it's namesake. Overall it's lackluster... worth it when heavily discounted, but I'm glad I didn't purchase it at full price because it would have been a massive let-down. The original Hot Pursuit (1 and 2) were some of my favorites of the series, unfortunately this reboot of the HP versions is thus far a disappointment. It doesn't have the same entertaining feel as the originals... whether you're the cop, or the racer. In the originals nothing was quite as satisfying as sideswiping a tractor trailer to have them lock-up their brakes and jacknife in front of pursuing police units. In this version, traffic interaction is almost non-existent and as a racer, you end up depending more on gizmos for breaking pursuits than skill or use of the environment (as in Most Wanted). Likewise when playing the cop, a well-timed PIT or skillful bumping of the racer into a roadblock would end the pursuit. In this version, not so much. If you try to pin a racer into a guardrail or other obstacle, they just blow through you as if you weren't even there... on the other hand repeated light taps from the rear damage the racer predictably (but unrealistically). So there's no reward for riskier maneuvers... just keep tapping their rear bumper until they eventually crash.  In the near 2 hours I've played so far, the races all have had the same overall feel. I've already laid out my complaints for the police mode. As a racer I haven't encountered any real ditch or out-run the police game modes which were so much fun in the originals. The modes are simply one race or time-trial after another.  In closing, I can't really decide whether to give this a recommended or not. My gut says no, because it just isn't as exciting as I remember many of the Pre-'05 versions being. Reading the various critic reviews, I have to wonder if any of the critics have been around long enough to have even played the originals, or if they simply came of age during the more recent releases and don't really have any perspective as to how much this release -lacks- anything innovating. Yes, the crashes are spectacular, but the gameplay required to induce them is simply uninspiring. I think given the $20 max price tag, I can recommend it... but it certainly has done nothing to restore my faith in the series.",
            "review_score": "1"
        },
        {
            "review_text": "Preferred previous NFS titles. Not much in the way of vehicle customisation. Pretty bland game",
            "review_score": "-1"
        },
        {
            "review_text": "Super fun, can't stop playing it.",
            "review_score": "1"
        },
        {
            "review_text": "The map's huge with no reason to explore it. The car selection's so wide you get a new car every time you pass an event, giving you neither time nor reason to care about any of them and quite a few of them you unlock after they've stopped being useful or long before you're allowed to use them. Having to actually hold down the brake to make some of the hairpins is nice, but by the time you get the cars that handle like that you're already halfway into the game, which is short enough as it is. This game feels unfinished, easy with very few spikes in difficulty and even the presentation wasn't quite thought through, which is weird for a Criterion game.  Also, unskippable cutscenes. The worst are the ones that come up every time you unlock a thing, because they're so unskippable you don't get to press the retry button after the event that unlocked it. That's one cutscene and three loading screens you have to sit through, all to know how 'awesome' your new radar jammer is.",
            "review_score": "-1"
        },
        {
            "review_text": "Very enjoyable game. Best played with a game controller. One of the btter racing games I've played.",
            "review_score": "1"
        },
        {
            "review_text": "It seems to have a good graphic and detail, but Very very strange game, commands can not be reset or costumized, strange AI system, and I think its one of the worst NFS games ever made. There is no good story in this game, and it looks like thoes games that you download to spent time playing on a cellphone... Not recommanded.",
            "review_score": "-1"
        },
        {
            "review_text": "Unsupprisingly, as they where both made by the same team, this feels very much like Burnout with real cars. The cars need a little more finese to get the most out of but if you like burnout you will like this.",
            "review_score": "1"
        },
        {
            "review_text": "Bought this one expecting it to be as good as the first hot pursuit all those years ago. I am sorely disappointed. It looks like a thrown together port from a console version, I mean you can't even use the mouse in the menus!   Internet games drop out constantly with no warning.  On the positive side the graphics look great and the gameplay is as good as the first incarnation.  CANNOT WAIT FOR AN UPDATE!!",
            "review_score": "1"
        },
        {
            "review_text": "one of my favorite games ...!!!",
            "review_score": "1"
        },
        {
            "review_text": "this game is ♥♥♥♥ing trash, so ashamed to have payed money for it",
            "review_score": "1"
        },
        {
            "review_text": "Need for Speed: Hot Pursuit III  Even with Steam you can effectively only install this game on one computer with online modes enabled. If you run it on any others you have to exit several menus that tell you to get online and watch advertisements for Need for Speed: World (Which I already own) before you're even allowed to play the game. Another example of EA Games' unrelenting quest to make everything tedious and unenjoyable.  The game itself is fun though, provided you can get past the first hour of having nothing but a collection of boats to drive, the digital wanking of every brand name that agreed to appear and the ♥♥♥♥♥♥♥♥♥ intro music that plays every time you start the game.  PC gaming is dead as long as this trend of flooding the market with unintuitive ♥♥♥♥♥♥♥t that prevents legitimate consumers from using their products continues.  Part 2 of review contained in Extra Review Pack DLC, released at the same time as Part 1.",
            "review_score": "1"
        },
        {
            "review_text": "Simple, fast-paced, racing. The environment is beatuiful to this very day, even though the game is over 3 years old now. It offers a wide range of vehicles ranging from a Dodge Charger to a Bugatti Veyron. The vehicle mechanics are nice and solid except at very low speeds. Each car feels a little different from the last, not just model wise.  The game has some bad porting issues. It's capped at 60 FPS and has a very limited settings menu. The mouse is not used AT ALL in the menus or in game so get used to using the arrow keys. The game appears well optimized and I can easily get 60 FPS at all times at 1080p. The game handles well on a keyboard though you may need to remap some keys, I haven't played it with a controller but it may handle better.  This racing game doesn't waste any time (except on the excessive, unskippable cutscenes at the beginning). There is only one thing that is important in this game and that is 'drive'. No time is wasted on a story, the main character you play as has no name, the characters are all modeled the same, and there is no dialogue apart from the narrator. There aren't any 'rivals' that you develope in the game, all your opponents are just static car models with a randomized color.  The game features a nice soundtrack but it gets repetitive after playing it for more than 20 hours. If you have ever played 'Burnout: Paradise' this game copies a lot of it's driving mechanics as it is made by the same developer. ",
            "review_score": "1"
        },
        {
            "review_text": "My only regret is I didn't by this over Origin™.  2Fast2Furious/10",
            "review_score": "1"
        },
        {
            "review_text": "Can't even play it because when I load up the game and try to enter the main menu, it just keeps scrolling up the options and I can't press anything. Luckily it was on sale because it's definitely not worth anything if I can't play it. 0/10",
            "review_score": "-1"
        },
        {
            "review_text": "maybe I have little playtime on this game, but it's because game is really boring. you just drive from point A to pont B with no excitement, tracks are repetitive from my point of view, you can't customzie cars at all, hard to beat opponents. I really wanted to give this game a chance because other good games from this franchise, but no, this is bad game. I bought it on discount for couple of euros and I regret it. ETS2 is better and exciting than this game",
            "review_score": "-1"
        },
        {
            "review_text": "need for speed hot pursuit is a game I highly recommend for anyone who is a fan of racing games and a game that I still recommend for those that are not.  just I thing to keep in mind when it comes to this review, it is entirely based off my single player experience as I have not touched the multiplayer part one bit.  and now on to what the game has going for it. well first off you have two choices on what to be, a reckless speed loving racer who will stop at nothing to finish the races, or a reckless speed loving cop who will stop at nothing to stop the racers cars dead flat and send them to jail.  the racers and cops do have a difference when playing as them as well. one of the biggest is that the racers nitros must be increased by doing reckless things such as drifting driving on the wrong side of the road and near misses.  the cop cars how ever have a slow but constant regenerating nitros. this helps you act a tiny little bit more like you should as it is sometimes better to drive in the right side of the road as a cop. (that's right as in right and wrong, not right and left)  the game also gives you lots of cool toys to mess with your opposition as you race. you got EMP's spike strips for both racers and the cops (the sneaky racers must have got them off the black market or something) with the cops getting road blocks and helicopters.  road blocks really help with the feeling that your not alone when trying to stop racers, just one button press and BAM there are 6 or so of you cop pals blocking the road for you.  the racers jammer how ever lets you stop EMP locks on you and turn off spike strips by making them fold back up.   the helicopter however I haven't unlocked but if I do ill add what it does here in the review.  now on to what type of races and stuff you can do as cops and racers.  so far ive only seen two types, a time trial of sorts and a average race either with or without cops for the racers and a timed chase to try and bust one or more racers.  but the variety of both the chases and the races more then makes up for this as not only will the racers and cops get harder on different tracks as it goes on but they give you access to more and better equipment as you get to later parts of the game.   and how is the A.I in this game? well I love it! at one point while racing I saw all 3 rival racers crash into one massive pile up. I know that might not be such a big deal but I just love games where they can and will screw up.  the difficulty is almost perfect in my opinion, starting you off with a bunch of easy missions to start you off and then unlocking more gear as you go as well as becoming harder.   the sound quality is excellent as well with a great choice of songs as well as proper and different sounding car noises and skidding noises.  this all sounds fine if you don't have a speaker that can't produce a lot of base, I found this out by first playing it on my now broken laptop and then moving to a tower computer with a base producing speaker.  the song choice is pretty good as well with 1 or 2 song choices that really fit going really fast. although I did get sick of it after a while as there is not as much choice as lets say most wanted, another need for speed game.  that is why I recommend looking up and if you can getting SSX3 and need for speed shift's soundtracks as they fit in perfectly in my opinion.  the graphics are pretty good as well with most of the cars looking very reall and just about nothing looking bad at the highest settings.  even a planes propellers looked good while I was sitting right next to it.  and on the highest or medium settings the game world looks so good, complete with rain snow and a day and night cycle.  there is also a free drive option in the game. this lets you be either a cop or a racer and just drive for the sake of it while taking in some views. its also good practice for honing your driving skills for when you do want to race.  or you can just mess around and try stuff like I did like obeying the laws and driving at the speed limit.   before I end this review I do have some warnings for certain things and stuff I don't like in the game.  I don't have just praise to give it.  #1 this game has very strict borders, its more like a race track then being fully open world and may create frustration or longing for a proper open world by some players when there’s nothing but a crappy little fence in your way.  #2 depending on how good your PC is your driving may seam very unresponsive to excellent, and there is no way to adjust the sensitivity when it comes to steering.  and that is with a 360 pad, the keyboard offers left or right with 1 set force of it  #3 this game is made by EA, so if you utterly hate them and don't want to support them in any way don't get it.  #4 each time you play the game you will be asked to create an EA account. this may frustrate some people so much that it ruins the game for them.  and #5 the game uses a medal system giving a bronze silver or gold depending on how well you do. im not certain about this but I think that you do need some gold or silver medals to get past some parts of the game, this means you could be stuck at a certain part for a long while.   and that's the end of my review. the game scores a 10/10 for me. its not perfect but I like it that much.",
            "review_score": "1"
        },
        {
            "review_text": "I would recommend this game if you like losing a lot and being ripped off at the finish line. I have discovered, this game does cheat. I was 4 seconds ahead of everyone with the finish line in sight and surprise surprise I went from 1st to 3rd because 3 cops only came after me and slammed me between them and into a spike strip and I came in 3rd place. This game is the biggest cheating piece of crap EA ever made...f***k them",
            "review_score": "-1"
        },
        {
            "review_text": "lacks story line and cut scenes. The game and car damage are good, but it doesn't feel like you have a personnality in the game. It feels like a simulator (just driving)... but with an arcade feel. I must say i didn't try the online part of it and it probably shines there more than in the single player campain.",
            "review_score": "-1"
        },
        {
            "review_text": "Highway drifting, highway drifting, more highway drifting, and maybe the offroad section that isn't actually a longcut. Oh and Mariokart esque EMP's and spike strips to throw at your rivals / targets. One or two taps of the e-brake and you can make any turn on the map. There's no car customization at all besides choose your colour.",
            "review_score": "-1"
        },
        {
            "review_text": "Graphics are just one of plenty reasons to play this game.  Buut the game doesnt have much active players soo need more active players for multiplayer :(",
            "review_score": "1"
        },
        {
            "review_text": "this is a racing game, with no option for manual transmission.....  but its clearly not a simulation game of any type.   there is tons of fun to be had here, and alternating between the race types works well - just when you get tired of chasing someone down &amp; ramming them, you go to a leisurely ultra-fast cruise in a supercar. (i have only played single player so far, clearly much of the features are for multiplayer so i cant speak on that yet.)   The graphics are pretty sweet and crisp, it runs fine on my rig, and controller support is excellent - recognizes and maps my Logitech gamepad perfectly.  Nicely done, for 5 bucks or in the package as its been going for lately.",
            "review_score": "1"
        },
        {
            "review_text": "Need for speed as it should be. Once you get the hang of the steering, drifting is easy and you could easily waste hours blasting through seacrest county on freeride. There's a few minor flaws but the choice of cars is superb, the graphics are gorgeous especially considering this game is a couple of years old now and the races are incredibally fun . I rate 90%",
            "review_score": "1"
        },
        {
            "review_text": "I'm now 14 minutes into the game and still haven't played a single race. So far I sat through EA account creation, serial key entry, checking off whether I want to receive EA's spam, and obnoxios, long, and unskippable cutscene explaining all the 'social' features that I'll never use, and the silly—again unskippable—and pointless cuscene with cars and cops and 'which side you wanna be on.'  Then, when I picked a race, I had to suffer another long and unskippable cuscene explaining how the game works. GOOD GRIEF!  Can I just RACE PLEASE?!?!",
            "review_score": "-1"
        },
        {
            "review_text": "Brilliant game, not a single period long term game but good for killing that spare 30 minutes or if you really want to get into it, get a bunch of mates and create carnage!",
            "review_score": "1"
        },
        {
            "review_text": "This isn't NFS, this is Burnout, naming department must have not been very careful when titling this piece of dissapointment.    On a serious note, if you are about to buy this, stop. Go over to Burnout: Paradise and buy that, it's infinately better than this turd.",
            "review_score": "-1"
        },
        {
            "review_text": "Best Need for Speed game after Most Wanted 2005 and before The Run!",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game because I remembered how much fun I had with Need for Speed: Hot Pursuit 2 (on Gamecube, and somehow released before this? NfS 3 was Hot Pursuit as well), but this game didn't follow in the same footsteps.   When I was actually playing this game, it was fun, however most of the time 'playing' this game was sitting through cutscenes. The first time launching this game, you have to sit through 3-5 minutes of cutscene before any of your keyboard/mouse/controller input does anything.  The cutscenes don't stop there. Every time you load up a race, there is a 'semi-skippable' cutscene that always plays, and will always play for ~10 seconds. I know that doesn't seem like much, but after just 6 races, you've wasted a full minute of your time, which could have been spent playing through most of another race.  At the end of a race, you better not have unlocked anything because that would another extra 15 seconds of wait time to show off your new virtual car...per car....and it's unskippable. Same is true when you rank up, which happens a little less often.  Unfortunately, I barely passed the 2 hours of play mark (which means about 1 hour of actual gameplay), so I can't get my steam refund...and who knows, I may eventually come back to this if I can find some way to alter the game file or something to kill those nasty cutscenes =P",
            "review_score": "-1"
        },
        {
            "review_text": "EA's tendency to not let you skip its game's ♥♥♥♥♥♥ cliche cutscene is very annoying.  Game is great though.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Busted a racer. He flew over the metal barrier and fell down the cliff. He's alive.  WTF M8 HE FLEW UP LE CLIFF          his grave is false",
            "review_score": "1"
        },
        {
            "review_text": "very fun but very hard to find people online to play with",
            "review_score": "1"
        },
        {
            "review_text": "Whoever was designing the driving part of this game has never driven a real car. The handling of the cars is terrible, unresponsive and unrealistic. I do not recommend this game to anyone who was looking for a successor of the original Hot Pursuit. Good thing I bought this on sale...",
            "review_score": "-1"
        },
        {
            "review_text": "My apoligies to everyone who likes this game. But it was too slow, and had absolutely no optimization. Yes it was fun, and I dont't hate for its gameplay, just the extreme lag and lack of grpahics tone-down.",
            "review_score": "-1"
        },
        {
            "review_text": "best racing game ever",
            "review_score": "1"
        },
        {
            "review_text": "decent graphics on 2015, even it is a 2010 game can play smoothly 40+ fps on my i3+ gt 520, well optimized",
            "review_score": "1"
        },
        {
            "review_text": "Cop/Crim always a nice touch. Yet this iteration feels really clunky compared to the other titles in the series. And again let down by a lot of grind hidden under the guise of free roam.",
            "review_score": "-1"
        },
        {
            "review_text": "realy cool game nice guys",
            "review_score": "1"
        },
        {
            "review_text": "I always loved Need for speed as a kid but its so damm arcady. There is nothing new in career mode, Its always the same. and the driving doesn't get better and extreme rubber-band AI Doesn't make it better.",
            "review_score": "-1"
        },
        {
            "review_text": "Horrible game. Not the usual NFS you love and want to play",
            "review_score": "-1"
        },
        {
            "review_text": "I was racing with like 5 other cars. I accidently crash my car and it flips off a cliff to my doom.  I respawn perfectly fine cuz of thug life.",
            "review_score": "1"
        },
        {
            "review_text": "You can go fast!!!",
            "review_score": "1"
        },
        {
            "review_text": "Need for speed hot pursuit is one of the best games ever! I have over 34 hours of gameplay in this game so far and it is amazing. Graphics obviously, are not the best but this game and gameplay are amazing! One of the best racing games made.",
            "review_score": "1"
        },
        {
            "review_text": "Years ago, I had a copy of Need for Speed: Hot Pursuit 2 on the PC. It was exciting races in fancy, expensive cars, accompanied by absurd street layouts that made for great tracks and wonderfully over-the-top police chases with pricey cop cars smashing head-first into racers with reckless abandon, raining explosive barrels down from the sky with the help of a helicopter, and generally creating absolute havoc in a way that was best compared to taking a bunch of toy cars and smashing them together, replete with sending them flying across the floor.  But my favorite part of that was something absent from most other titles of that ilk, Be the Cop Mode, which allowed you to take control of a pursuit vehicle and command the police forces at your will to arrest speeding drivers. And by 'arrest', I mean 'completely destroy the vehicle of'. It was ludicrous, and it was wonderful. When I heard about this, and that it was the developers of Burnout taking it on, I had high hopes.  They were met. And they were exceeded.  Being split into a Racer and Cop career means you get a lot of experience on both sides of the law, earning experience in the form of Bounty which rewards great runs but also makes sure you're always making some degree of progress. The cars start at luxury vehicles and work their way up to supercars and hypercars, and the police pursuit vehicles are... well, for the most part, variants of the Racer vehicles with lightbars and a livery slapped on. It's as satisfying as ever to teach a bunch of Pagani joyriders multi-million dollar lessons in the speed limit by smashing them off the sides of cliffs in a Veyron, and as thrilling a power fantasy as ever to destroy half a county's police force in a bulky GT-R.  The game is set in one great, big, interconnected map, but this is more like Underground 1 than 2 and onwards; the open-world element of the game is reserved for specific pursuit missions and a completely separate mode that lets you drive around for fun with no progress made. (Irritatingly, it's here where it becomes obvious that the police sirens and lightbars cannot actually be shut off.) Mostly this just means you'll get to recognize certain bends of road across various events, which are still linear point-to-point races for the most part.  A fantastic licensed soundtrack is accompanied with a wonderful (if more generic) orchestral pursuit soundtrack in the vein of NFS:MW'05, although bizarrely, the same six or so pursuit songs are re-used for every single event involving a police pursuit. Which as the game's name implies, is most of them. So the licensed soundtrack is great in the very few instances you actually get to hear it.  The physics are a skillful mix of arcadey elements with, well, actual racing strategy. If you know what you're doing and try to apply real-world racing lines to it, it'll mostly work. Just expect to drift a lot more than is reasonable. You charge nitrous with stunts, meaning Racers will want to maximize time in the oncoming lane and Cops will want to cut close with traffic. Netting a Takedown will fully recharge, so you'll have plenty of reason to go full aggro if that's what does it for you. And like KERS, and as ever with NFS, nitrous is best applied coming out of corners and finding a good rhythm for it.  The items and weapons aren't exclusive to the police like they were in games past; Racers and Cops now have their own suites of weapons. Both have access to spike strips (mercifully temporary in effect now, spinning out drivers instead of handicapping them for the entire event) and EMPs (yes, as in electromagnetic pulses, I'm not making that up). Police can call in roadblocks (with care, because if you do it right near an obvious path around a roadblock, they absolutely will be in the most useless spot possible) and helicopters (which no longer hurl exploding barrels into traffic, but now just drop spike strips with extreme skill). Racers can use a jammer to prevent police from calling in any of their weaponry, and can also use a horrifically powerful Turbo boost that... well, find a good straight for it and hold on for dear life, because the effect is striking.  The comedic tone is a massive plus for me. It's nothing extremely distracting, but it's definitely more light-hearted than many titles out there. Police chatter has officers reporting making their fiftieth ticket today, calling in EMS only to be told the tow truck is on its way, and calling their attacks by radioing them in to Central. It feels like playing with toy cars; it's purely the fantasy of speed with none of the ridiculous grimdark garbage that's pumped into a lot of street racing titles to create drama.  In short, this is a fantastic game that works well with novelty, but by no means coasts on it. It makes glorious, ridiculous street races with high-tech supercars slamming into each other, police calling in EMP blasts to send racers soaring off the road, and generally just hooning cars around corners exactly as fun as it should be. One of the best Need for Speed titles I've played, and one of the best racers overall.",
            "review_score": "1"
        },
        {
            "review_text": "Oh yeah cops and speeders!!!!!!!!!!!!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "A really fun arcade-style racing game with cop and robbers' rules.",
            "review_score": "1"
        },
        {
            "review_text": "Good game, besides the main menu controls. Racers versus cop. Online mode. Racing modes and racing modes online!",
            "review_score": "1"
        },
        {
            "review_text": "very good multiplayer racing game!",
            "review_score": "1"
        },
        {
            "review_text": "One of the greatest driving games I have ever played! Highly reccomended.",
            "review_score": "1"
        },
        {
            "review_text": "Hmmm. Drive exotic cars at ridiculous speeds, and smash ♥♥♥♥♥♥♥ cops off the road. Good ♥♥♥♥ing times.",
            "review_score": "1"
        },
        {
            "review_text": "what can i say about this game that hasn't already been said.  Slick visuals, a great choice of cars and roads to race them on.  A good single player experience as the multiplayer is completely dead.  8/10",
            "review_score": "1"
        },
        {
            "review_text": "Easy to pass up as just Burnout dressed as NFS, but regardless of Criterion's obvious involvement it stands by itself as an enjoyable, thrilling game. It starts off pretty slow, allowing the player to learn the basics and get familiar with the power-ups, but once it kicks into high gear the races get very fast and frenzied, and the police missions get very, very brutal.  Awesome presentation, solid gameplay, and a fitting soundtrack. If you can overcome your expectations for a classic Need for Speed game, you're in for a treat.",
            "review_score": "1"
        },
        {
            "review_text": "I would Recommend this game to any body who likes racing its quite well done and has a good story line",
            "review_score": "1"
        },
        {
            "review_text": "I generally don't like racing games but this is an exception. Sure, I'd never paid the full price, but the cops vs. racers multiplayer matches are fun, no doubt.",
            "review_score": "1"
        },
        {
            "review_text": "This game is very fun online and you can be the speeder or a cop.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful cars, varied landscapes (both night and day), as well as fun online and offline cop modes and races make this game worth checking out although it does lack a story.",
            "review_score": "1"
        },
        {
            "review_text": "In Need For Speed Hot Pursuit, you either play as a racer trying to evade the law, or as a cop trying to stop racers. A relatively simple idea, but the basis for a fantastic game. You can use weapons against your opponents, like EMP blasts or spike strips, and that's the main area that this game differentiates itself from others. The weapons make for a great game of cat and mouse, and mixed with the feeling of speed and the noticabally last gen but silky smooth graphics, you're sure to have a good time.  The game puts a lot of emphasis on Autolog, a system where you can compare your times on every event to the time's of your friends. It's a great idea in theory... But that game doesn't link to your Steam friends list! Oh okay, so maybe it links to Origin? Nope, this game predates Origin! So basically, you're stuck without any friends when you start, and the 'autolog reccomendations' section remains annoyingly empty...  Luckily there is a solution, just jump online and play some of the multiplayer, and you'll be able to add people from the room you're in. Then, their friends will start being reccomended to you, and you can add them to your friends list. Just keep adding friends this way and eventually you'll have a lot of autolog competition! Also, you can import your favourites into Origin if you want to.  The multiplayer is even more fun than the single player. The only people who are playing now seem to be very good at the game, which makes sense for a game this old, but still, it's brilliant. The cat and mouse excitement of the single player is ramped up to the maximum level when you know it's real people you'll be running off the road. It's a testament to how fun the multiplayer is that people still play it. It's a shame that it's so hard to link up to your friends, it's very hard to find the option to enter a friend's username.  So all in all, Need For Speed Hot Pursuit is a great game which is somewhat hampered by it's implementation on PC. No links to friends lists, no achievements... But it makes up for it with it's awesome gameplay. Oh and the soundtrack's pretty good too, did I mention that?  Add me by the way, i'm CyberAly.",
            "review_score": "1"
        },
        {
            "review_text": "This game is still timeless four years later! I still play it and wish NFS franchise hadn't disappeared into EAs Origin.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing! Both online and single-players are fun. I can't think of anything bad about this game.",
            "review_score": "1"
        },
        {
            "review_text": "Adult version of Mario Kart series. Seriously. What's more fun than raining spike strips on everyone?",
            "review_score": "1"
        },
        {
            "review_text": "Runs very well - I haven't had a single issue. Very fun.",
            "review_score": "1"
        },
        {
            "review_text": "This game has execellent gameplay. Can compete with your friends. Has lots of cars. And also has nice graphics. I give 9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Awesome Game!!!! I was not gonna get his game. Mostly because need for speed for me died for me after part3 the first hot pursuit. I then fell inlove with the burnout series. Burnout hardcore really fast unrealistic racing and crashing. Now that burnout has burned out paradise was really bad with the open world tracks. I understand it is a cool take on burnout but it took away the burnout feel. This is where the new hot pursuit comes in. I say this mostly to all the Burnout fans. This need for speed game was made by the same team who made burnout out. And it may not be as fast as burnout or have crazy crashes but dang this game is great. Instead of a quick takedown. its more of struggle to take some one down, which feels so much rewarding when u take someone out. Even better cars can be take out with spike strips roadblocks helicopters. setting up car barricades, even shoting a EMP to disable another car which give it a little missle lock jet fighter feel. Get this game!!!!! Its Burnout with a realistic feel to it. If you are into the Hardcore realistic racers maybe not for u.",
            "review_score": "1"
        },
        {
            "review_text": "Bought it on sale, really worth it, fun arcade style driving game.",
            "review_score": "1"
        },
        {
            "review_text": "What you need is just speeding up!",
            "review_score": "1"
        },
        {
            "review_text": "Combining Need for Speed with Burnout, it is a fun game and worth a purchase if you have a controller. A great way to waste time.",
            "review_score": "1"
        },
        {
            "review_text": "VERY COOL GAME! BEWARE MULTIPLAYER IS FULL OF HACKERS!",
            "review_score": "1"
        },
        {
            "review_text": "Must buy hands down. The game may have some balancing issues but it provides good fun for an endless time. Recommend to buy in bulk and share amongst your friends!",
            "review_score": "1"
        },
        {
            "review_text": "The Most Fun You Can Have Is Just Being A Cop.",
            "review_score": "1"
        },
        {
            "review_text": "This game is both amazingly real for its sensitive steering and awesome controller compatibility. If I wasn't able to use my Xbox controller with this game I would have probably had a BF and written a letter.  P.S. Neeehd fer Speehd ruhlez.",
            "review_score": "1"
        },
        {
            "review_text": "It’s a fun racing game to play, but some online modes, races or pursuits are a bit empty in terms of players, but you can still find max players in other online modes that are the most popular ones. Other than that, I would recommend it to anyone. Lovely racing title.",
            "review_score": "1"
        },
        {
            "review_text": "If you love need for speed games, than this is one you can not mis out on. I loved Need for Speed Most Wanted. And this game just makes it even better!",
            "review_score": "1"
        },
        {
            "review_text": "I have played this game more than any other in my Steam library, I think, and it is because even when I think I have exhausted its potential it pulls me back in with another magnificent vista or hidden playground. Even on my paltry computer, the graphics and the sound quality are superb, and there is a real sense of craftsmanship in the locales and the cars. I sometimes play for an hour on free drive, to see the roads in a low-stress way as the days cycle by and the weather changes.",
            "review_score": "1"
        },
        {
            "review_text": "This is easily the best arcade racing game I have played, that will leave the same grin on your face corner after corner. Prepare to be amazed with the intense gameplay and mechanics as you drift every curve in the road like a champ. Race with precision and reward yourself with the most thrilling driving experience to date. Put yourself into the shoes of the most wanted racer in all of Seacrest County or flash your blues as you take on the baddies in a cop car. Whatever role you take on I can promise that you wont be dissapointed.",
            "review_score": "1"
        },
        {
            "review_text": "Definitely a good arcade racer. The game is not suited for steering wheels! NFS Hot Pursuit allows the player to play as cop or racer, and is great fun, especially in multiplayer. It's a shame that not many people play it these days. If you can get some friends to play it, it'd be a blast. A single crash won't end your race, so it makes it a little easier for new players to get into the game.",
            "review_score": "1"
        },
        {
            "review_text": "The Best Hot Pursuit NFS Ever!",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best Need for Speed yet.",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "Bust the speeder scum, regardless of the cost to the taxpayer. Welcome to Seacrest County, ♥♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, nice sortiment car brands and models. Play as racer, or as a cop. Both is just plain fun to play. love the free roaming feature, makes the game a lot nicer so u can check out any corner of the map to explore even more things like shortcuts.  ",
            "review_score": "1"
        },
        {
            "review_text": "Fast Racing... and crashing (if you can't drive) So Much Fun!",
            "review_score": "1"
        },
        {
            "review_text": "Great racing game.",
            "review_score": "1"
        },
        {
            "review_text": "its a cool racing game,but poor abilities -Autolog is death -Multiplayer is death -No Abilities for communication  to keep playing on it,You must be cool person Like us ( ͡° ͜ʖ ͡°)",
            "review_score": "1"
        },
        {
            "review_text": "Baught this game solely off the rating compared to other NFS games. Big mistake. Repetive tracks. NO CAR CUSTOMIZATION. No choosing your car color from 5 color choices is not customization. Horrible Need For Speed game and horrible racing game. Cars all drive the same. Basically mario kart except not fun at all.",
            "review_score": "-1"
        },
        {
            "review_text": "goood game but wait for steam sale to get it",
            "review_score": "1"
        },
        {
            "review_text": "I broke my A button holding down the nitro button too hard.  Pretty good.",
            "review_score": "1"
        },
        {
            "review_text": "ftw",
            "review_score": "1"
        },
        {
            "review_text": "I love this game! Yet another success in the Street-Racing genre of games. I can use my PS3 controller, the graphics are splendid, and the ability to play as the racers AND the police makes for a great game!",
            "review_score": "1"
        },
        {
            "review_text": "Love this Game ! &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Need For Speed: Hot Pursuit is great",
            "review_score": "1"
        },
        {
            "review_text": "Good racing game with beautiful visuals, adrenaline-pumping action and POLICE!",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ this game and it's ♥♥♥♥ing rubber band AI ♥♥♥♥♥♥♥t racing. It's always been a weak spot of the series but holy Hell it was absolutely terrible this go around. There is nothing quite like being 5.5 seconds in front of 2nd only to have them overtake you while you're doing 199MPH 3.5 seconds later.",
            "review_score": "-1"
        },
        {
            "review_text": "a good remake a adds things while retaining what was good and removing what was bad, can be pretty challenging  also, use the turbo in straights  only   in  straights",
            "review_score": "1"
        },
        {
            "review_text": "great game!!!! recommended to all racers",
            "review_score": "1"
        },
        {
            "review_text": "lol this is nice, like skyrim with cars",
            "review_score": "1"
        },
        {
            "review_text": "Decent game to fill in the gaps between actual games you enjoy. The cars all feel the same, nothing is customizable except car colours and the pursit races turn into destuction derby after a while, but the game is pretty and you get to go fast and drift across sunset lit roads. Game feels like a pretty version of the old arcade game Outrun",
            "review_score": "1"
        },
        {
            "review_text": "One of the best racing game (for me) o.o b",
            "review_score": "1"
        },
        {
            "review_text": "Love this Need for Speed",
            "review_score": "1"
        },
        {
            "review_text": "I love this game cant say one bad ting aboutit",
            "review_score": "1"
        },
        {
            "review_text": "I love this game so much. It has pretty nice graphics one down fall is the driving controls but you can change the controls in the game menu. The car list is very good(including but not limited to the aston martin One-77, lamborghini murcielago, Mclaren F1,and many more. there are three main modes multiplayer, carrier(story mode) and freeroam. So to sum this whole game up it is an open world game with many fun things to do in it. ",
            "review_score": "1"
        },
        {
            "review_text": "One of the most polished games ever! Hats off to Criterion!",
            "review_score": "1"
        },
        {
            "review_text": "best NFS game for me ever, love the graphics, love the gameplay, love the cars :) easy to learn, easy to master, great play time, great ability to re-play everything :)",
            "review_score": "1"
        },
        {
            "review_text": "Classic game ;-)",
            "review_score": "1"
        },
        {
            "review_text": "Quick and to the point:  + No ♥♥♥♥♥♥♥t story, you just pick an event and drive + You can actually feel the speed, not just the need for it + Looks bloody amazing + Soundtrack is pretty tight  - Multiplayer is dead - Can be quite unforgiving at times - All cars handle almost the same",
            "review_score": "1"
        },
        {
            "review_text": "It has the core elements of the original NFS game but lacks any of the new stuff from new racing games (open-world &amp; car customization). It feels like something was missing compared to NFS underground or Burnout Paradise.",
            "review_score": "-1"
        },
        {
            "review_text": "its good game",
            "review_score": "1"
        },
        {
            "review_text": "Cop smashes crooks, crook smashes cop. I get to smash them both! =D",
            "review_score": "1"
        },
        {
            "review_text": "Like Criterion games? Like burnout series racing style? then COP campaign mode is for you  - 9/10",
            "review_score": "1"
        },
        {
            "review_text": "WARNING: CODE BREAKING BUG THAT WONT LET YOU PLAY ONLINE  This POS by EA has a bug where if you use your product key once, it will say you have used it the maximum amount of times, Meaning you cannot play online on any other machine. DO NOT BUY EA SUPPORT IS GARBAGE",
            "review_score": "-1"
        },
        {
            "review_text": "Anyone Online???????? Want to Do some races",
            "review_score": "1"
        },
        {
            "review_text": "Racing itself is cool, altho still learning what key does what. Don't like the beginning, takes way to long to get to the game :( also don't like that can't seem to put it to window and not full screen, means I have to escape multiple times to exit to go to another window. Then reload the darn thing to start again.. Unless I am missing something..",
            "review_score": "1"
        },
        {
            "review_text": "Not very good compared to Most Wanted. No customization, no single player plot. Unlock cars and they do not give you an option when you want to use it. You have 5 unlocked but we will let you choose 3 of them. But hey it is the best EA has given us since Most Wanted, I think.",
            "review_score": "1"
        },
        {
            "review_text": "This game is quite the thrill! Fast cars, intense chases, and beautiful graphics. BUY!",
            "review_score": "1"
        },
        {
            "review_text": "Best part of the modern Need for Speed!",
            "review_score": "1"
        },
        {
            "review_text": "I am not a big fan of racing games, but this game is simply awseome when you play online with a few friends, the thrill of busting your racer friend as a cop yourself is just so much fun. Not many players online but if you get two or three others friends to play this with you, you will not regret it, just go and get it !",
            "review_score": "1"
        },
        {
            "review_text": "This game is a great arcade with huge assortment of sports cars, one of the best soundtracks (this game nails music i like), and drifting is something i miss in todays race games.",
            "review_score": "1"
        },
        {
            "review_text": "A timeless racing classic that balances realism with the arcade experience of old racing games. EA normally sucks, but they manages to pull through with mouth-watering visuals, a soundtrack to get your heart pumping, and a decent storyline to excuse your progression through the game. The multiplayer is a nice touch to an already amazing game.",
            "review_score": "1"
        },
        {
            "review_text": "Have fun with the great cars, tearing up roads, annoying time limit races 9/10",
            "review_score": "1"
        },
        {
            "review_text": "  English:    Pros: - Variety by the ability of playing as a cop or racer - 6 capabilities for procuring benefits during the persuits (Turbo, nail belt, Roadblock, helicopters, EMP, jammers) - Detailed graphics - Lots of realistic vehicles with extensively additional information - More than 50 races with about 5 different game modes  Cons: - No story - No way even to individualize cars  Conclusion: Although NFS Hot Pursuit has no story it is nevertheless a diverse continuation of it's many predecessors, that offers new game mechanics and challenges.     Deutsch:    Pros: - Abwechslung durch Spielmöglichkeit als Cop oder Racer - 6 Fähigkeiten zum Verschaffen von Vorteilen während den Verfolgungen (Turbo, Nagelband, Straßensperre, Helikopter, EMP, Störsender) - Detailreiche Grafik - Sehr viele realitätsnahe Fahrzeuge mit ausführlichen Zusatzinformationen  - Mehr als 50 Rennen mit etwa 5 verschiedenen Spielmodi  Cons: - keine Story - keine Möglichkeit selbst Fahrzeuge zu individualisieren  Fazit: Auch wenn NFS Hot Pursuit keine Story bietet ist es nichts desto trotz eine vielfältige Fortsetzung von seinen vielen Vorläufern, die neue Spielmechaniken und Herausforderungen bietet.",
            "review_score": "1"
        },
        {
            "review_text": "This is my first need for speed game, the graphics aren't exactly as good as what I expected. Experiened lag in game(My computer's performence are way above the recommended settings).",
            "review_score": "-1"
        },
        {
            "review_text": "Super awesome fun. Have played NFS from day dot and despite a REALLY long gap between good titles in the series, this actually made it onto my list alongside NFS 1, 2SE, Porsche and Carbon.",
            "review_score": "1"
        },
        {
            "review_text": "Not a bad one, but dudeds, most wanted is the best ever!! :D  Hot pursuit isn't that pleasing compared to most wanted... it lacks the element of story telling and progress!! However, it is a cool ride... ;)  Go for it...",
            "review_score": "1"
        },
        {
            "review_text": "good game but the ai is sometimes to op",
            "review_score": "1"
        }
    ]
}