{
    "app_id": 479100,
    "name": "Music Wars Empire",
    "release_date": "2016-06-01",
    "developer": [
        "Antuan Johnson"
    ],
    "publisher": [
        "Music Wars"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Includes level editor"
    ],
    "genres": [
        "Indie",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Indie",
        "Simulation",
        "Strategy"
    ],
    "achievements": 0,
    "positive_ratings": 40,
    "negative_ratings": 47,
    "price": 10.99,
    "description": "Take the role of a manager or CEO of a record label, and try to make your mark on the music industry!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/479100/header.jpg?t=1554439093",
    "minimum_requirements": "OS: Windows PC Only Memory: 128 MB RAM Storage: 250 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Full of bugs and constantly crashes. After playing for a few hours the signed bands disappear and the game is then pointless, The problem with bugs in this game are so bad I asked for a refund but as I'd unknowingly played more than two hours (sometimes it's possible to play that long) my refund was denied. The bug appears at different stages 33 weeks was the last, 41 weeks yesterday so a couple of attempts and you're over the refund time.   Forums are full of posts from people reporting bugs which never seem to be fixed. I wish I'd read those before buying.  This game is unplayable and I have been totally ripped off by Steam who should be ashamed to sell such shoddy products.  Please don't waste any of your money buying this rubbish, if you're given it free don't waste your time.",
            "review_score": "-1"
        },
        {
            "review_text": "Music Wars Rebirth 2 had a few bugs, but it was still a great game.  Music Wars Empire is a more polished version of MWR2, but it's limited because of several bugs that disrupt gameplay.  Things I'd fix before I recommend a customer buy the game'  - Streaming needs to be massivly readjusted, on Spotify the average streams in the top ten ww is 23,500,000, and in the game, the top streamed track is maybe 5,000,000 at it's peak, then it falls off the charts. Streaming needs to last longer than sales, and slowly drop.  - Sales in the US also need to be adjusted, 10,000 copies for #1 is not realistic  - The bugs addressed by fans in the forum need to be fixed  If you're a hardcore fan of the series, get this, but if you're new to the game, wait till these issues are fixed.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game! It's so easy to play. It has really good graphics. I really like all the features.",
            "review_score": "1"
        },
        {
            "review_text": "Do not purchase this game, It does not work. If you did purchase, request refund. I'm so disappointed considering how good of a concept it sounded like.",
            "review_score": "-1"
        },
        {
            "review_text": "Love it!!",
            "review_score": "1"
        }
    ]
}