{
    "app_id": 480480,
    "name": "Slash or Die",
    "release_date": "2016-06-03",
    "developer": [
        "ClickGames"
    ],
    "publisher": [
        "ClickGames"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Difficult"
    ],
    "achievements": 10,
    "positive_ratings": 202,
    "negative_ratings": 30,
    "price": 1.99,
    "description": "In this game you will face violence and extraordinary complexity. You will have to become one of three heroes to slash enemies or to die from their hands. What will your hero do?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/480480/header.jpg?t=1531414090",
    "minimum_requirements": "OS: Windows XP SP1-3,Vista,7,8 and 10 Processor: 200 Mhz Pentium processor or higher Memory: 250 MB RAM Graphics: Must support of Direct3D 9 DirectX: Version 9.0",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Slash or die is an example of a penny plain but addictive indi-game.  It really worth playing.",
            "review_score": "1"
        },
        {
            "review_text": "Nice game to play while making important life decisions.",
            "review_score": "1"
        },
        {
            "review_text": "great little game - its a grind but addictive. This game is right up there with Deep DUngeons of Doom and Ubermosh - if you like those you will like this one!",
            "review_score": "1"
        },
        {
            "review_text": "An hour in, the first boss killed, its time to write a review! The hitbox on the warriors slash feels off a little bit, it starts too far in front of the animation and I found myself missing kills it said the animation cut clean through. It also had issues hitting people diaganolly from me, but neither of these things detracted from my experience, just cause minor annoyances. My biggest issue with the game as of now, however, is movement. I must manually take my index finger off of moving in order to attack, and I do not find that acceptable in such a mobile game as Slash or Die. While I still reccomend this game, it has a few issues that need ironing out.",
            "review_score": "1"
        },
        {
            "review_text": "Cheap, Easy controls (Right click / Left click only) Challenging Fair Still haven't passed the world 1  Nassy recommends",
            "review_score": "1"
        },
        {
            "review_text": "Slash aroubd and kill a half an hour of your day :), would be also perfect as a mobile game",
            "review_score": "1"
        }
    ]
}