{
    "app_id": 480430,
    "name": "Hide and Shriek",
    "release_date": "2017-10-19",
    "developer": [
        "Funcom"
    ],
    "publisher": [
        "Funcom"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Online Multi-Player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Stats"
    ],
    "genres": [
        "Action",
        "Free to Play"
    ],
    "tags": [
        "Multiplayer",
        "Horror",
        "Free to Play"
    ],
    "achievements": 20,
    "positive_ratings": 1839,
    "negative_ratings": 472,
    "price": 0.0,
    "description": "Scare or be scared in this FREE adrenaline-pumping multiplayer game full of hijinks and mischief! Set traps, cast spells, and scare the living hell out of your opponent to win!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/480430/header.jpg?t=1508751471",
    "minimum_requirements": "Requires a 64-bit processor and operating system OS: Windows 7 64 Bit/ Windows 8 64 Bit/ Windows 10 64 Bit Processor: Core i5 processor or equivalent Memory: 4 GB RAM Graphics: Intel Iris HD5200 pro or equivalent DirectX: Version 11 Network: Broadband Internet connection Storage: 4 GB available space",
    "recommended_requirements": "Requires a 64-bit processor and operating system OS: Windows 7 64 Bit/ Windows 8 64 Bit/ Windows 10 64 Bit Processor: Core i5 processor or equivalent Memory: 4 GB RAM Graphics: NVIDIA 760 series 2Gb VRAM or equivalent DirectX: Version 11 Network: Broadband Internet connection Storage: 4 GB available space",
    "reviews": [
        {
            "review_text": "'A diamond in the rough' is the first thought that came to mind when i played my first session of this game. Personally this game first came to my attention while watching H2o delirious (great lad would recommend) and from there on had to have a go at it. The game itself is a 1v1 first person online multiplayer horror were players assume the role of two high school students from Miskatonic's estranged sister school of Innsmouth high during Halloween night in a twisted magical game of something akin to hide and seek. Each player is invisible to one another and objectively must attempt to acquire their coloured orbs of blue or red and deliver it to their periodically moving altar all the while avoiding, countering and entrapping their enemies with magical game changing runes scattered around the map. To win players must by the end of the countdown or jump scare their opponent 3 times in a row, have accumulated more points plus the additional bonuses than their opposition.  Story/character Development: Like with any funcom game, the narrative background of this particular game is set in the same universe as funcom's MMO The secret world, with several allusions to the TSW around the map and in the lore. Evidently the narrative of the game itself is more or less what you would expect in a 1v1 online game. I love the premise of the story and how it sets the frame of mind for the game. There is just something about two students from what would be the equivalent of what would be Hogwarts but with a contemporary twist, getting up to mischief on Halloween that appeals to me. Maybe it is the inner lore lover i am or the many references to the other games of funcom i have so many fond memories of. The developers clearly thought out the background for the game and its implementation into the actual game play. The many background stories of how the mystical runes came to be or the various brief but intriguing references to characters from TSW that helps build their background.   3.5/5 Replay Value: Moving on from my reminiscence and into the actual quality of the game, the replay value is somewhat abundant. The basics of the game are the same in every round, find orb, find altar, place orb on alter and earn points to stay ahead of your opponent. The runes however are what make this game truly special. With around 10 unique spells all with different opportunities to ♥♥♥♥ with your class mate and not to mention the additional spells created from combining certain runes, this game gleefully presents you with about 30 different ways to scare and hinder your opponent or protect you from them. I must admit i get a buzz at leap frogging around the map every time i find a hopscotch rune. Never the less it is the unique situations presented in each game that make this one something to pick up again and again. I for instance encountered one fellow who wouldn’t stop leaving decoy exploding orbs for me to find or another time when i encountered a player who had a knack for throwing fireballs. Another addition is the levelling system used to unlock certain items that will be mentioned in customization. Some people probably think that on top of everything a levelling system is stupid however I disagree, it is this very levelling system I have found that can be an incentive to come back and play again. But the biggest absolute blue balls thing about this game is the map. More maps is a must for a game like this if it is to stay afloat.  3.5/5 Gameplay and controls: The true gem of this game is its gameplay and although clunky, its controls are simple and clear to understand. The game provides a repetitive basis goal so that players clearly understand what they have to do but also uses the game changing runes to combat any boredom the player might encounter. Its abundance of spells to screw over the opposition and the individually customised jumps cares are what make this game so enjoyable yet simple as to understanding your goal. The actual controls of the game are clunky to be blunt, with high motion blurs and a sort of swaying as you walk all of which can be changed from settings. But the consistent clicking and holding just to open doors and cupboards can defiantly leave you with a sore hand after a few games.  4/5 Graphics: I almost forget that funcom is actually a pretty wealthy company sometimes because of the below average fan base and little advertising I see of it, so going into this game I expected somewhat of a bare minimum of graphical quality but oh boi am I glad I was proven wrong. This game is beautifully designed in its spliced magical high school aesthetic, everything drawn and textured in detail. Sure it’s not as realistic looking as people would like it to be but that is exactly what fits the game itself. Its entirety is based on a wacky game two kids play WITH MAGIC. It isn’t meant to look as if it was a real place because it was built not to be. It was designed to look fun and mysterious, to appeal to that inner child of ours back when our imaginations ran rampant and magical school games like this, for us at least, existed. So some people might disagree with me here and I realise that as the game grows it will look better but from what I see now the developers are on the right track.  4/5 Character customization: I am so glad that they included a feature like this into the game and although sometimes it can seem like a very small feature, it’s always enjoyable to be scared ♥♥♥♥♥♥♥♥ at the abominations other players have created. The entire customization mechanic for the game revolves around the jumps scares you use to catch your opponent. A singular head model with a variety of 10 default heads to choose from, mixed in with different laughs and voices plus 18 different decorations PER-HEAD it’s gonna be one hell of a night. The only catch? The levelling system. You unlock one customization option per level you level up which again is an incentive to play again which I agree with. Overall I always like it when i get to see other people’s creations on screen and what I could possibly do with my own to scare others. In conjunction with the runes, it adds a refreshing aspect to the game with its basic repetitive plays sometimes. 3.5/5 Co-op and Online Multiplayer: The real kick in the balls aspect about this game. Taking into consideration that it is very new so there hasn’t been a lot of time for people to join, the amount of people that play this game are sparse to few. If this game is to survive it needs more players, something which can, given funcoms fan base, be a major problem. Obviously they have got some popular youtubers to advertise it and steam advertisement is also good but please for the love of god it needs a bigger player base if it’s going to continue. Waiting times can be a killer (don’t worry I found a fix for those of you who know what im talking about), but the ping you get is actually decent and trust me this is coming from a guy who gets (if im luck) 600kb/s speed tops.   3.5/5  (Pro tip: to shorten wait times make sure u are connected to NA region in the games options and change your download region on steam settings to Washington DC, make sure u change back to your region tho when downloading new games or when you finish playing)  Final thoughts and review: it’s not often you find a game like this and I highly recommend it. My only recommendations for this game is its expansion on maps and possibly runes and spells to keep people interested, maybe a few game modes to spice up the basics would also attract a lot of players back for more and for Christ sakes more advertising not just for the developers but for the players as well. So many good games have failed on the basis that their wasn’t a big enough player base and I pray to Cthuhlu (pun intended) that doesn’t happen to this game so share and recommended this please to anyone you might think would be interested. Overall: 4/5 ",
            "review_score": "1"
        },
        {
            "review_text": "A very nice game,where you don't want to be the guy who get scared :)",
            "review_score": "1"
        },
        {
            "review_text": "This is a good game just i hvae one problem what makes me bored in this game.The map its only have one map what is good but if u play a lot you can get bored fast",
            "review_score": "1"
        },
        {
            "review_text": "Finding the right balance is actually what makes this game so exciting.  Both players collect points by placing traps and shrieking the enemy. Special orbs in your team-color are most valuable - they are hidden randomly across the map. So you can focus on collecting orbs or placing traps to shriek the other player. If you get shrieked three times in a row, you will lose.  Matchmaking works fine but menus are sometimes laggy for me and there is only one map. Hide and Shriek isn't a long time burner but gives you some short competitive 1-vs-1-matches for in-between.",
            "review_score": "1"
        },
        {
            "review_text": "Even when this game starts to be repetitive, It's still enjoyable. Game mechanics is very easy - gather orbs, set traps and scare your opponent. How to win? One match has ten minutes. Both of you have to collect points. The winner is the one who has more points or scare opponent three times in a row.   Positives: + graphics + game mechanics + idea + It costs only 6€ + bonus content for The Secret World  Negatives: ... well, I haven't found anything yet.   Buy It, play It and the most of all enjoy It!",
            "review_score": "1"
        },
        {
            "review_text": "Hide and Shriek is a competitive multiplayer game where both players are invisible. Two players are pit against each other in a creepy school, with the aim of scaring the living hell out of their opponent. To win the game, you either have to earn the highest score at the end of the 10 minute round by collecting orbs and setting traps, where as the second option is to scare your opponent 3 times in a row.  The catch is you are both invisible. There are multiple ways to reveal your opponent, and once you know where they are, you can activate your 'shriek' which will trigger a floating head jumpscare on the enemy's screen, and get you points. If you shriek and your opponent isn't close enough, you will be revealed for them to see for a short time.  The most common way to reveal your opponent is by catching them in a trap. You can collect different runes throughout the level, which all have unique powers. Sometimes you can set traps, and sometimes they will give you powers to remove any curses you might have. Runes can even be combined to give unique traits. Some can be very interesting, like sending your enemy to an alternate dimension to waste their time, or allowing you to dash through walls.  Some runes can be shot ahead of you, some can be traps set on the floor, some are on interact-able doors or closets etc. So there's a lot to play around with.  The main way to get points is to collect orbs and put them on your altar. You can even pick up enemy orbs in order to set up traps. I like to put theirs behind transparent cupboards, and then trap them. The whole game is about outsmarting your opponent.  As you level up and get achievements, you will unlock customizables for your character, which is quite fun.  Most stuff is balanced quite well. Although I have a problem with 2 powers. One of them being a wisp that follows your enemy and teleports them to another dimension. Even if you see the wisp, it seems for no matter how long you run away from it, it will catch up to you eventually. I don't know if there's a long timer on it or if it just chases you indefinitely, but that just causes it to be more efficient to just run into it as soon as you see it to avoid wasting time.  The other one, is a power that reveals all runes close to you, and your opponent. It kind of defeats the entire point of the game if you can just see your enemy constantly through walls, there's no investigation anymore. It's not even that hard to get that power, and it seems a lot of people have realised it and are using it the majority of the time, which is why I prefer to just play with a friend and avoid using that power.  Overall, I really am loving the game so far. The aesthetic and music is great, the idea is fun and unique, and it's just great to hear your friend scream when you trap them!",
            "review_score": "1"
        },
        {
            "review_text": "Good game ! It's not too scary , more fun. 8.5/10   (Trump face : scary 11/10)  ",
            "review_score": "1"
        },
        {
            "review_text": "Really nice game for a quick round between friends. Will I play this for hours every day? No. Evry once in a while with a friend? Absolutely.",
            "review_score": "1"
        },
        {
            "review_text": "this game looks fun but it doesnt work for me ",
            "review_score": "1"
        },
        {
            "review_text": "  The gameplay is fun and engaging, but I wouldn't know as the game is so poorly optimized for a game that doesn't even look that good, and has so many game breaking bugs that constantly crash my PC and renders the game nearly unplayable. I only got to play one match for 10 minutes after it crashed on me 5 times. 9/10 wouldn't recommend this game until they better optmize it and do some SERIOUS bug fixing cause this crap is filled with more bugs than an anthill.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a good horror game to play with a friend. The graphics are well done and the music is very fitting. Well worth your money.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun and easy",
            "review_score": "1"
        },
        {
            "review_text": "i think you should rut spektate in it, just when it is a privet match, and it is your freinds. Cool game i love to play it:)",
            "review_score": "1"
        },
        {
            "review_text": "This is not a scary game. Honestly, I get scared easily on video games, I didnt jump once in an hour. The runes are a bit too complicated and you can go for 15 minutes without getting a good trap to place. The only time you might get scared is when your opponent catches you with his skull, which looks so cheesy when it happens that you will be more disappointed than impressed.  Refunded this immediently.",
            "review_score": "-1"
        },
        {
            "review_text": "Not interested in the 'OH EM GEE SOOO CREEPY' jumpscare tactic used in the game and advertised by ''''''e-celebs''''''.  Bought it simply for the TSW promotional content. But as the game feels the need to be political, I'll have to leave a negative review aswell.",
            "review_score": "-1"
        },
        {
            "review_text": "i love the game itself as a whole the fact that its a 1v1, and you can scare your opponet if there not being carful, bonus EVERYTHING and i know it has only been out for 3 days but a cool thing to see is another map because we are in little springs. i would like to see a new map themed around the other high school, one last thing another thing is that there should be more runes/rune combos because when ever i have a chance to get a 3 rune combo its always hard to find that 3rd rune   (tldr: verygood overall, plz newmap/newrunes) thanks -hinterguy123456",
            "review_score": "1"
        },
        {
            "review_text": "  If you are ever feeling consipated, just play this game. Problem solved.",
            "review_score": "1"
        },
        {
            "review_text": "Cheap and sweet, It's fun-on-a-stick for 5 bucks. Worth it. Nice concept, nice execution. Various combination make up for the one and unique level that can be too repetitive. Some spells are totally imbalanced, however. The spell that show where the other player make it too easy.",
            "review_score": "1"
        },
        {
            "review_text": "Fun but Too hard to find lobby",
            "review_score": "1"
        },
        {
            "review_text": "Fun but Too hard to find lobby",
            "review_score": "1"
        },
        {
            "review_text": "I didn't find this to be worth the money. The entire game takes place in one location which makes the game get pretty stale pretty quickly. They added a lot of cosmetic items to unlock which is nice but after an hour of playing it I had only unlocked 2 or 3 of the items and there were easily a few dozen more.   Also, there are 2 ways to win. The first is by scaring the opponent 3 times in a row and the other is by just getting a ♥♥♥♥♥♥♥♥ of points. Getting the points is monumentally easier than scaring the opponent and in the half-dozen games I played only once was either of us able to get a win from scaring as opposed to just time running out and winning by points.  It was a neat game but I would only suggest picking this up half-off in a future sale.",
            "review_score": "-1"
        }
    ]
}