{
    "app_id": 482450,
    "name": "Nitroplus Blasterz: Heroines Infinite Duel",
    "release_date": "2016-12-08",
    "developer": [
        "EXAMU"
    ],
    "publisher": [
        "XSEED Games",
        "Marvelous USA, Inc.",
        "Marvelous"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Online Multi-Player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Anime",
        "Fighting",
        "Action"
    ],
    "achievements": 51,
    "positive_ratings": 375,
    "negative_ratings": 46,
    "price": 14.99,
    "description": "The hit crossover 2D fighter finally makes its way to PC, updated to the latest arcade version for character balancing, added background animations and additional winning poses. It also includes all DLC from the console release, such as additional fighters Homura and Heart, in a single value package.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/482450/header.jpg?t=1532465735",
    "minimum_requirements": "OS: Windows 7 / 8 / 8.1 Processor: Intel Core2 Duo Memory: 4 GB RAM Graphics: nVidia GeForce 7900 GT or better / AMD Radeon X1900 / nVidia GeForce GT 620 DirectX: Version 9.0c Network: Broadband Internet connection Storage: 5 GB available space Sound Card: Direct Sound",
    "recommended_requirements": "OS: Windows 7 / 8 / 8.1 / 10 Processor: Intel Core i5 / i7 Memory: 4 GB RAM Graphics: nVidia GeForce 8800 GT or better / AMD Radeon HD3700 / nVidia GeForce GT 650 DirectX: Version 9.0c Network: Broadband Internet connection Storage: 5 GB available space Sound Card: Direct Sound",
    "reviews": [
        {
            "review_text": "It's exactly what it promises to be. You pick your waifu, and start kicking butt. No engaging storylines to be found here (although it has a 1P 'story mode' for fighting increasingly difficult AI).  IF YOU ARE NOT USING C: FOR GAME INSTALLATION, these may occur: -The game likes to hang in the background after playing. You currently need to force it to close via Task manager. -Music will abruptly stop after three seconds, every time.  Other things to mention: -The game RESPONDS ONLY TO THE FIRST KEYBOARD LAYOUT YOU TOUCH. Touched Player 2 inputs first? You're Player 2 now. Until you restart the game, at least. -The character sprites could have used some polish. Take a good look at hi-res still images. -Look, if you're reading these reviews, you were going to buy it anyway. You have a coupon and all. If not, the discussion board is full of people giving them up.",
            "review_score": "1"
        },
        {
            "review_text": "Pros : They have Saber  They have Miyuki and Aoi !!!!!!!  They have Sonico  They have Iria !! Tokyo necro !!!  They have Saya! Saya! Saya! Saya! Saya! Saya! Saya! Saya!   Well I know this is n+...  Cons: Characters not quite balanced  Booring story -- Why didn't you write a better story?? You run a galgame company after all.  A large gap between pro players and new players  Bad graphic detials.. I thought they could make it much better... but I was wrong...  I wanted to give a No, but they have SAYA, so YES.",
            "review_score": "1"
        },
        {
            "review_text": "If you like Arcana Heart, you'll probably at least enjoy this a little bit. It's fast and fun. Hell, there's a chance you may recognize some of these characters. I only knew three or four though. Won't stop you from enjoying it though.",
            "review_score": "1"
        },
        {
            "review_text": "TL:DR: If you like Mugen and VN, get it.  Note: at present, on exiting the game, it still stays active on Steam. (nothing a trip to the Task Manager won't fix, but do bare that in mind)  Great 2D fighter, and a great VN mash up game. The Story isn't particularly great, storyline wise (surprising, being released by a VN studio).  Another Story, on the other hand, is much better written    Especially if you're a Lovecraftian horror fan    if you're interested in the VN side of things. In it's defense, although having a better story for each character wouldn't have been an enormous feat, this is primarily a fighting game (Another Story being its VN counterpart, in which you even have the option of skipping the playable fights entirely). If you're into VN, you should recognise a few of the characters. As far as the fighting goes, it's pretty stock standard for the genre (no breaking from the status quo on this one, you get exactly what you pay for.  Now, onto the personal opinion portion of this review:  1. If you're going to do a VN Mugen, you need a bigger roster. Even with a small roster, you kinda need Nep-Nep. I'll settle for Soni Ami, but this kinda needed Nep-Nep... 2. Would have been nice to have had an english dub, for the ingame dialogue, but 'meh'. 3. I will never understand why everything VN related costs so much more than its western counterpart...  Oh!    And, for the fan-service crowd: pretty sure the 'DLC content included' mainly refers to everyone having a swimsuit alt. costume   ",
            "review_score": "1"
        },
        {
            "review_text": "bought cuz MY KWEEN THE APPLE OF MY EYE, THE GURL WHO KEEPS MY PṲSSY NEVER DRY, SAYA IS HERE, YOU STANK ÄSS HȮES  10/10 wet pṻssies",
            "review_score": "1"
        },
        {
            "review_text": "Support your local fighting games.",
            "review_score": "1"
        },
        {
            "review_text": "What's Heart doing here? What's Homura doing here? Why even Yuki is here?!! Can we have Dengeki Bunko too on Steam, Sega?!!! So many characters we knew thrown into one game!! If you're not good with air combo fighting system on their older fighting game, this game is for you. Just need to learn the basic combo and you're good to go.",
            "review_score": "1"
        }
    ]
}