{
    "app_id": 482920,
    "name": "Hero Zero",
    "release_date": "2016-07-05",
    "developer": [
        "Playata GmbH"
    ],
    "publisher": [
        "European Games Group AG"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "MMO",
        "Cross-Platform Multiplayer",
        "In-App Purchases"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Free to Play",
        "Indie",
        "Massively Multiplayer",
        "RPG",
        "Strategy"
    ],
    "tags": [
        "Free to Play",
        "RPG",
        "Casual"
    ],
    "achievements": 0,
    "positive_ratings": 1336,
    "negative_ratings": 428,
    "price": 0.0,
    "description": "Become a hero, build your own Hide-Out and start by saving your neighbourhood. Level up your skills, collect incredibly weird superhero gadgets, and join a superhero team to save the world!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/482920/header.jpg?t=1506584981",
    "minimum_requirements": "OS: Windows XP Processor: Intel Pentium or compatible Memory: 1 GB RAM",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Don't be fooled. It's just like Mafia Wars. You spend money for 'donuts' to speed things up. You even need 'donuts' to refresh the clothing store. Fun factor completely zero.  It's like Mafia Wars on facebook/iphone ending up on Steam. Don't waste your time.  EDIT: i honestly think there are people from the development side trying to push this game with positive reviews. all the real and negative reviews and being drowned out",
            "review_score": "-1"
        },
        {
            "review_text": "Paid for the initial donuts for $4.99, got double charged. Applied to steam for refund of second charge, was informed steam could not do refund for this game and to apply directly to the game's support for refund. A day after making a ticket with supporting images of the double charge on my steam account as well as a steam telling me to ask the game maker for a refund game maker says they cannot process a refund and to ask steam... ♥♥♥♥♥♥♥t. Do not play, they double charge and don't even bother trying to work with you.",
            "review_score": "-1"
        },
        {
            "review_text": "waiting untill you can play is not a game",
            "review_score": "-1"
        },
        {
            "review_text": "Fun concept, but all the waiting ruins the fun. A game build around the sole mission for you to buy 'donuts' in order to skip waiting.",
            "review_score": "-1"
        },
        {
            "review_text": "There is no option to login to an existing account",
            "review_score": "-1"
        },
        {
            "review_text": "Started out fun enough but QUICKLY became a pay to win game.",
            "review_score": "-1"
        },
        {
            "review_text": "Another sh*tty, free to play mobile port with money sucking in-app purchases. Steam is not a place for crap like this. Devs of this 'game' are zero. I basicly downloaded it just to say this.",
            "review_score": "-1"
        },
        {
            "review_text": "Downloaded it and it didnt work. Come on guys! Its a game based on flash and it has issues with starting the game. Really it sucks! I am not going through all the hurdles for this game and troubleshoot.",
            "review_score": "-1"
        },
        {
            "review_text": "I tried to give this game a shot, but it just seems too much like a Facebook game. This game is basically 'click &amp; wait'. Sure you can spend money to buy 'donuts' and skip all the waiting, but I'd rather just spend my money on actual donuts. Actual donuts are WAY more enjoyable.",
            "review_score": "-1"
        },
        {
            "review_text": "stupid game that wastes alot of your time",
            "review_score": "-1"
        },
        {
            "review_text": "facebook game",
            "review_score": "-1"
        },
        {
            "review_text": "Amusing time-waster - err, I mean something to do while waiting (on hold, for oven to pre-heat, etc) Aeems to be truly FTP, no harassment about buying game-cash!",
            "review_score": "1"
        },
        {
            "review_text": "This Game Is So Boring It Is The Same Thing Over And Over",
            "review_score": "-1"
        },
        {
            "review_text": "i bought some donat in this game i payyed but i didnt take any donat and support suck dont play thıs game and dont buy anythıng",
            "review_score": "-1"
        },
        {
            "review_text": "this game is really good i know its a waiting simulator but it actually gets exciting sometimes but its actually really fun u really feel like driving to success its really fun download it",
            "review_score": "1"
        },
        {
            "review_text": "Fun, amusing. I've meet nice people in the team i'm part of. Great game to play when you are doing something else at the same time. For those who loves little app games and superheros kick ♥♥♥ style. That's for you. For those who like it to move fast... you won't enjoy.",
            "review_score": "1"
        },
        {
            "review_text": "simple, fun, and its so light so i can multitask it while i work with my computer",
            "review_score": "1"
        },
        {
            "review_text": "This is a very awesome game! TWO THUMBS UP! d(^o^)b",
            "review_score": "1"
        },
        {
            "review_text": "The game is oddly mildly addictive at least to me. Though i wish there was a story mode to it. I might make a Lets,s play of this.",
            "review_score": "1"
        },
        {
            "review_text": "░░░░░░░░░░░████░░░░░░░░░░░░░░░░░░░░ ░░░░░░░░░███░██░░░░░░░░░░░░░░░░░░░░ ░░░░░░░░░██░░░█░░░░░░░░░░░░░░░░░░░░ ░░░░░░░░░██░░░██░░░░░░░░░░░░░░░░░░░ ░░░░░░░░░░██░░░███░░░░░░░░░░░░░░░░░ ░░░░░░░░░░░██░░░░██░░░░░░░░░░░░░░░░ ░░░░░░░░░░░██░░░░░███░░░░░░░░░░░░░░ ░░░░░░░░░░░░██░░░░░░██░░░░░░░░░░░░░ ░░░░░░░███████░░░░░░░██░░░░░░░░░░░░ ░░░░█████░░░░░░░░░░░░░░███░██░░░░░░ ░░░██░░░░░████░░░░░░░░░░██████░░░░░ ░░░██░░████░░███░░░░░░░░░░░░░██░░░░ ░░░██░░░░░░░░███░░░░░░░░░░░░░██░░░░ ░░░░██████████░███░░░░░░░░░░░██░░░░ ░░░░██░░░░░░░░████░░░░░░░░░░░██░░░░ ░░░░███████████░░██░░░░░░░░░░██░░░░ ░░░░░░██░░░░░░░████░░░░░██████░░░░░ ░░░░░░██████████░██░░░░███░██░░░░░░ ░░░░░░░░░██░░░░░████░███░░░░░░░░░░░ ░░░░░░░░░█████████████░░░░░░░░░░░░░ ░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░",
            "review_score": "1"
        }
    ]
}