{
    "app_id": 483960,
    "name": "Purino Party",
    "release_date": "2016-06-22",
    "developer": [
        "Frontwing"
    ],
    "publisher": [
        "Frontwing USA"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Sexual Content",
        "Nudity",
        "Adventure",
        "Casual"
    ],
    "tags": [
        "Nudity",
        "Anime",
        "Sexual Content"
    ],
    "achievements": 14,
    "positive_ratings": 176,
    "negative_ratings": 81,
    "price": 8.99,
    "description": "Purino Party takes one part puzzle game, and one part visual novel - romancing cute girls included - and combines them for a laid-back yet addictive gameplay experience!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/483960/header.jpg?t=1522225810",
    "minimum_requirements": "OS: Vista Processor: Intel Core 2 Duo equivalent or higher Memory: 1 GB RAM Graphics: GeForce 8600GT or equivalent DirectX: Version 9.0c Storage: 1 GB available space Sound Card: A sound card that supports DirectSound Additional Notes: 1280 x 720 (16：9), MMX required (SSE2 supported), not compatible with touch screens",
    "recommended_requirements": "OS: Windows Vista/7/8.1/10 （Windows RT and 10 Mobile are not supported） Processor: Intel Core i3-2120 Memory: 4 GB RAM Graphics: GeForce GTX 280 DirectX: Version 9.0c Storage: 1 GB available space Sound Card: A sound card that supports DirectSound Additional Notes: 1280 x 720 (16：9), MMX required (SSE2 supported), not compatible with touch screens",
    "reviews": [
        {
            "review_text": "MOST IMPORTANT:  The in-game tutorial doesn't explain that you can move in many directions, not just horizontal or vertical.  Most, if not all, the downvote mentioned about how hard this game it. I admit, it's not easy, but not to the point of deserving a downvote for being ridiculously hard. On top of that, there is an  Easy-mode patch . Below is the original reviews. ---------------------------------------------- The more you play, the harder it gets. If you want to make it super hard,  you can get a patch here  [download.frontwing.jp] . Now about the game, it is also really hard. In case you think Dark Soul is hard, at least you can play that with both hands. TL;DR: This game will teach you the meaning of life: it's hard.    Serious thought about Frontwing",
            "review_score": "1"
        },
        {
            "review_text": "It's obviously supposed to be huniepop, but without all of the character and fun mechanics. Honestly, I'm sure how companies like this get away with such blatant cash-ins, but it gets a downvote from me. For shame, Frontwing.",
            "review_score": "-1"
        },
        {
            "review_text": "  HEY have you played huniepop before this. Then you pretty much played this game, i think its alitle bit more forgiving and you CAN actually make combos and instead of hoping the blocks will fall into place but huniepop is alot more fun more interesting AND little more sexy thanks to the moaning haha  i do recommend this game and you should download the patch to make the game xrated(uncensored version)",
            "review_score": "1"
        },
        {
            "review_text": "Purino Party is a game that's practically unbeatable- As in, impossible to finish. Not because it's hard or anything like that, I actually found the puzzle segments to be very fun, and wish I could play more of them. No, Purino Party is unbeatable because it is bugged to hell and back. Oddly, it's not the puzzle segments that are bugged, but the short Visual Novel-style cutscenes that come after them. It's odd and very frustrating, because they aren't anything special or extremely tasking, they're just simple cutscenes almost any machine should be able to run. However, without fail, your game will crash. Again, and again. At the same points, and at new ones, leading to an impossible to finish game. It's very frustrating, because the art and UI are very nice, and I can see the game being enjoyable, if it were at all playable.  That said, if you've got an older version of Windows, or whatever it is that lets your machine run it, It's worth a shot. The story's weak but the main appeal is the art and puzzle bits, so if either of those sound appealing, you might check it out. If you want to risk spending money on a game that simply doesn't work.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a REALLY bad version of Hunnie Pop, pretty much. It's not as funny, theres almost no interaction with any of the girls, getting to know them or their likes, going on dates, etc. It's just puzzle, cutscene, puzzle, cutscene. Then on top of that, the puzzles aren't fun or challenging, they're just time crunch panic puzzles. In that you can't sit there and think because you don't have time. You also cant slide the pieces around while considering the consequences because the moment you touch a tile, it counts as a move.  So, overly frustrating puzzles for absolute garbage. Play Hunnie Pop.",
            "review_score": "-1"
        },
        {
            "review_text": "The first half of this game is great. All the girls are hilarious (The girl whose introductary statements are that she loves porn is the most tame of all of them somehow), the writing is fantastic (I know this is a Japanese developer but I couldn't find a release date for JP, so idk if this was translated or not. If it was kudos to the localization team this is really funny), and the gameplay is balanced and satisfying. The gameplay may seem simplistic and RNG-dependant at first since you have the ability to move any piece to any location and the game rewards combos very heavily, there's actually some hidden depth. The trick is not to think about what moves to make with the piece you grab, but how to use your ability to shove pieces out of the way to make as many other matches at the same time as possible in the 10 second time limit, which adds in a lot of tension and quick thinking.   Then the second half happens and everything goes downhill. Only one of the second batch of girls is anything remotely similar to the humor of the first batch, and for some reason the game tries to give your MC some ♥♥♥♥♥♥♥t opinion that overt sexuality is bad, completely ignoring the past year of his life spent saying how cool it was that the other girls were so open about their sexuality. The reason I could only be ♥♥♥♥♥ to get through two of the girl's full routes though, is because of the difficulty spike. The first half has a very fair difficulty curve, with the early puzzles being easy and can be completed with minimal skill required, with the later puzzles of each girl ramping up in a reasonable curve and the last puzzle of each route requiring solid understanding of the inner workings of the mechanics and very few mistakes to complete without having to lower the difficulty after failing it. Then the second half comes in and starts ramping up the score requirements and lowering the turn count even further on just the first puzzle, with it scaling up to a ridiculous level by the end. The last two puzzles of each girl I had to delibrately fail 5+ times just to stack up enough 200 pt. reductions in the score goal to stand a chance of completing it, and that's taking into account that I made sure to get each response during the previous stage's dialogue correct, no telling how crazy it would get if you failed them.  Also, if you're here for the porn, don't bother. Nothing here you won't find by googling 'hentai', and it gets very samey and boring after you've seen your 5th picture of a girl in a bathtub. (The water looks really good though)  TLDR: Wait for it to go 50% off next big sale, turn it off as soon as you finish the first half.",
            "review_score": "1"
        },
        {
            "review_text": "of course i am comparing this game to huniepop and it doesnt even come close. huniepop is better in everyway including the bejewled gameplay. all in all save yourself from this game and play huniepop",
            "review_score": "-1"
        },
        {
            "review_text": "It's very shallow. It also has no H-scenes, so it's not what the game implies. Also, the uncensored patch may be easily obtainable, but it's just not that enough to have actual hentai. So, NOPE.",
            "review_score": "-1"
        },
        {
            "review_text": "this game is lit. one handed.",
            "review_score": "1"
        },
        {
            "review_text": "So everyone in the review section who votes the game down is literally a ♥♥♥.... sad but true   Complaining about gameplay in a game like this xD woow just buy it when you want a game with waifu material.  And yes English is not my native language.",
            "review_score": "1"
        },
        {
            "review_text": "Very great",
            "review_score": "1"
        }
    ]
}