{
    "app_id": 483980,
    "name": "Mad Father",
    "release_date": "2016-09-22",
    "developer": [
        "sen"
    ],
    "publisher": [
        "AGM PLAYISM"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Horror",
        "RPGMaker",
        "Anime"
    ],
    "achievements": 27,
    "positive_ratings": 1168,
    "negative_ratings": 49,
    "price": 3.99,
    "description": "Mad Father is back! Check out this latest updated version of the classic horror-adventure game for PC! Get ready for blood, gore, and full-on insanity!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/483980/header.jpg?t=1554708836",
    "minimum_requirements": "OS: Windows 7 or Greater Processor: Intel Core 2 1.06Ghz Memory: 1 GB RAM Graphics: Integrated graphics DirectX: Version 9.0 Storage: 100 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I don't think I've ever purchased a game faster. I love this game. I played through the free version as least twice before and I'm very excited about this remaster.   Mad Father deserves mad support. &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Certainlly go down as one of the best RPG maker game that has ever made!  Intriging, twisted, charming, storyline with many twist and turns about crazy love and betrayle.  Everything from this game was perfectly done with Great CG, Music, Arts and plot. A flawless performace with a little outdated graphics.  Cannot really spoil much of this game except I recommend any one that havn't heard about this game to give it a try.  It's not long 2-3 hours but it will grab you deeply with it's content. There are some horror elements but it's actually not that strong and a good game for people to learn and get use to horror game.  IT was free once but for once I am actually glade this is now paid content on steam as the developer put in a lot work for this and should be compensated as such.  9.9/10 and thank u for such wonderful RPG story game. I recommend whole heartly for everyone to try it.",
            "review_score": "1"
        },
        {
            "review_text": "'Love Is a powerfull thing, it can bring happiness as much as it can drive someone into maddness'  Mad Father is a great horror game with the story being the highlight and the gameplay being the secondary focus as the gameplay usually is to walk around the house and looking at objects in order to get the right key item in order to proceed futher. Gameplay is simple but as I said earlier I feel the story makes up for it...   While the game is short I feel like the game is still worth a try for anyone looking for a horror game that scares you rather then using jumpscares as a way to be scary.   Trust me you wont regret playing it ' Or you will as I cannot desided what people thinks about this game'  ",
            "review_score": "1"
        },
        {
            "review_text": "5 dollars is all this gem is. I played some of the free version but it always crashed for me, so when I saw it for cheap on here, I bought it.  I like this game, yes I beat it with the three endings (Not the if ending though) in 3.7 hours. But it was fun and intersting. A tad spooky with some good pixel art for the style of game.  One thing I did not like was some of the sound effects for walking in certain areas and climbing latters. Also my game crashed twice and no real fullscreen worked without bordless gaming.      P.S. I am not a fan of the ''True'' ending. Would have prefered a different outcome but hey it still can fit the game and characters. Overall good game, worth the price.",
            "review_score": "1"
        },
        {
            "review_text": "The best part of this game was the soundtrack; It's eerie, chilling, and makes you wonder what's around the next corner.  I'd say the next best thing is the setting. Rooms are p dang spooky to explore as you never know what's going to pop out at you and things can shift around from the previous time you've been in one.  The story is fairly gripping, it had me wanting to say where the end would take me (and there are several to mess around with).  I'd say the most disappointing part overall was the gameplay. I'm not too big on puzzle games (even when the puzzles are pretty easy, like this one). It's not like I can complain; I kind of figured it'd be that way though I figured it more as a 'go around, see set pieces' type of game. Kind of like an adventure visual novel...  I was expecting a longer game. Not really complaining about it and it's not exactly the kind of game I'd play again  Would I suggest this is a buy? Sure thing. It's got atmoshphere, charm, and a soundtrack which you're bound to love. ",
            "review_score": "1"
        },
        {
            "review_text": "Pretty awesome story but fairly short has 3 endings and a bonus scene so there is a replayablity to it. Just wish it was longer pretty sik.     7/10 IGN boiiiisss",
            "review_score": "1"
        },
        {
            "review_text": "Short game, Enjoyable &amp; interesting storyline. Worth buying.",
            "review_score": "1"
        },
        {
            "review_text": "I played this game as freeware back when it first got translated into English, and I've always enjoyed the other Miscreant's Room games, so I figured I'd go ahead and put my money where my thanks was. The gameplay hasn't changed much, as far as I can remember. I guess you could go to the translator's website and play basically the same game for free, but it's worth it to support Sen.  Pros about this game: *the translator, vgperson, does great work *it's a horror game with only a few jumpscares, and most of those are very mild *the music is quite lovely  Cons: *the sound design can be really annoying at times. Aya's scream in particular sounds more like somebody stole her cupcake and less like she got murdered by sentient dolls. even when the scream was part of a cutscene, my sister would look up from across the room and say, did you die again? *there's a lot of backtracking. it's definitely not as bad as other games in the genre, but still enough to be tedious. ESPECIALLY if you want to get the good, 'true' endings. *the father isn't really mad. he seems quite happy, in fact. and if you try to tell me he's 'mad' in that he is insane, i'd have to say no, he really isn't. he has no mental illness. he is just an a**hole. ",
            "review_score": "1"
        },
        {
            "review_text": "Note to self-  If a parent has an underground maze of labs, an obsession with dolls and enjoys working with chainsaws...  Run... Run far away and change your identity...  10/10 run away with Maria again",
            "review_score": "1"
        },
        {
            "review_text": "I spent 4.49 on this game and I can happily say I'm pleased with it. It is something different in my Steam library and I really enjoy. I will play it once again once the achievements are fixed, good luck to you Sen!",
            "review_score": "1"
        },
        {
            "review_text": "Love this game! The differences make it slighty better than the original! Love it!",
            "review_score": "1"
        },
        {
            "review_text": "10 Aya's shouts from 10 xDDDDDDDDDD",
            "review_score": "1"
        },
        {
            "review_text": "I'm already 5 minutes in the game and i almost had a heart attack",
            "review_score": "1"
        },
        {
            "review_text": "Well, I thought it won't come to this.  I was one to record and stream this game on youtube, when it was free. When it got released, I was one of the first to buy it, to try it again. I heard there were lot of updates and new stuff, so why not. Right?  Well, it is really bad, I don't mean the game completely, game itself is awesome, but the fact it's paid for little graphic update with a lot of bugs and miserable audio,  Next thing is font, then not really steam compatible game, ratio keeps on 4:3  without any resolution settings which is still fine, right? I had to disable steam notifications because everytime I got one, game got stuck. The game is cool, I agree on that, but is it worth paying 5€ for almost no change? Depends on you. For me not, I bought the game to support developer, but now thinking about reverting that.  To everyone, before you buy the game, rethink you really want it. Because I don't think it's worth. This is all my opinion, I expect a lot of people disagree with me, but these are facts.  Thanks for reading and if you'll decide to buy the game, I wish you to have fun. Because I didn't have any.  EDIT: Several minor bugs has been fixed in last patch, but now the game isn't even running. I checked update comments and I noticed everyone had problem to run it, it's going to crash everytime sometime tries to run it. So major bugs hasn't been fixed and game isn't even running now. Support 10/10",
            "review_score": "-1"
        },
        {
            "review_text": "Is and always will be one of my favs in horror game history! &lt;3 I love the story, the gameplay, and with the steam release they added so much more than I could ever imagine to better the experience, totally get it. 100% recommended if you've played the game before the steam release! Experience the change!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game! Thanks Blademan for the tips",
            "review_score": "1"
        },
        {
            "review_text": "Honestly, this is better than FNAF. That says a lot in itself, and the fact that me and my brother can play this and get scared every time we play (well at least I do) makes it the best for me.   Okay, now onto the emotional part. As you play you begin to learn more about each character, making you grow attached. Now this may seem bad, because they're fictional, but it helps you understand the game and in my case cry when something sad happens get mad when they get mad become happy for them when something good happens to them and feel like you are there to see it all happen and I mean like be there. With Aya, Monika, whatever the father's name is, Maria, Dio/Blonde Youth, Ogre, and all the experiments (such as Collina, Collina's mom, and Ines).     For the artistic side of this game I have to say it is well done. Me being a big fan of anime and being an artist myself, the art draws my attention and everytime I see it I think 'The artist behind all of this is very gifted and talented.' The music is also great. The music itself could probably tell a story and you wouldn't even have to play the game.   The backstory of the game is greate and grabs the player's attention very easily. When my brother suggested we play this as the next game we complete, he told me the whole story and I immediatley jumped up from my seat and said 'TAKE MY MONEY, JUST GET THE GAME!' Now I know I sound childish but what do you expect from an otaku? I mean look at Akidearest, Misty/Chronexia, The Anime Man, and Lost Pause!   Overall I find this is a great game for anyone who is not weak hearted or is not big on the horror genra. I hope everybody else enjoys it as much as I have and I am glad that I decided to play it.   (P.S. keep up the good work!)",
            "review_score": "1"
        },
        {
            "review_text": "Very very Nice music~&lt;3 Too bad the Creepy Father Voice is English. If got Japanese Even More nice~!",
            "review_score": "1"
        },
        {
            "review_text": "didn't expect this to be such a wonderful game, tbh. (lol, i'm sorry) great story, i regret nothing for my 4 hours of this game! gotta finish the other endings now.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a classic. It's a remastered version and it runs wonderfully. The story is great and it's totally worth the price.",
            "review_score": "1"
        },
        {
            "review_text": "This game is SUPER fun and addicting. It's the first RPG I bought on steam and I was not disappointed at all. It's kinda short, though very intruiging and the storyline is great. I'm not hesitating at all to show it off and recommend it to my friends. The puzzles are generally simple and I really just liked everything about the game, including the sounds. The beginning is a bit drawn out and more of a visual novel than an RPG, but only because it's the prologue and introducing you to the game. Once you get past the intro, it's really just you having to go around and find out what to do next.   Definitely play it!!!  ",
            "review_score": "1"
        },
        {
            "review_text": "An outstanding release of an all-time horror classic! Gets a lot darker and more sinister than the early goings will give it credit for.",
            "review_score": "1"
        }
    ]
}