{
    "app_id": 4850,
    "name": "Cossacks: Back to War",
    "release_date": "2010-09-02",
    "developer": [
        "GSC Game World"
    ],
    "publisher": [
        "GSC World Publishing"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "RTS",
        "Classic"
    ],
    "achievements": 0,
    "positive_ratings": 1081,
    "negative_ratings": 143,
    "price": 3.99,
    "description": "Cossacks: Back to War contains all of the gameplay features of Cossacks: European Wars and Cossacks: The Art of War, this is a complete care package for all current and future Cossacks fans. This add-on contains two new nations: Switzerland and Hungary.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/4850/header.jpg?t=1547051324",
    "minimum_requirements": "OS: Microsoft Windows XP Home (Service Pack 3) Processor: Intel Atom N270 Memory: 512MB RAM Graphics: Intel GMA 950 DirectX®: DirectX9  Hard Drive: 550MB space free Sound: 100% Direct Sound Compatible Internet Connection: 56 Kbit/sec Controller: &quot;mouse&quot; or touchpad",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "What to say? The best strategy game!",
            "review_score": "1"
        },
        {
            "review_text": "So basically this is the complete package of Cossacks 1, including both European Wars and Art of War. This game is dated as hell, but it was quite good when it was new. If this entry of the series interests you, then this version allows you to access all of the game's content.  The best version of Cossacks 1 to buy on Steam! :3",
            "review_score": "1"
        },
        {
            "review_text": "It's so great to go back to the game I used to play when I was younger, and I still enjoy it as much as I used to.",
            "review_score": "1"
        },
        {
            "review_text": "Here's my review for Cossacks, I'll go for the negatives first which are few. - I've recently got into the game just a while back, I can understand why it eventually became overshadowed by other RTS strategies like Age of Empire (AoE). It is not exactly a classic that can meet to todays options. - There is a huge learning curve, the tutorials are extremely hard to understand working on a story line based script that throws you essentially into a game with some start up bonuses (note I did the one trying to understand military movements and got wrecked in the tutorial in minutes).  - Controls are more rugged than modern strategies understandably and this can be a deterrent if you're not willing to put the time into play it.  - Unlike franchises like Civilization and other games with Strategic Alliance emphasis there is no Diplomacy, its either 2v2s, 3v3s 4v4s or FFA. Don't expect the AI to give out on you if you make a blunder or get annihilated by them (don't expect if from strangers on Multi-player) they will continue to destroy you until you lose or rage *note, I did the first couple of games, which I normally don't do*. - Understandably, Multiplayer is no where near as large as other strategy games, I haven't played multi enough to judge is characteristics of its gamers' virtues.  Now the positives of the game which to me outweigh its slight love obstacles.  - Simplistic design does not mean you have to over analysis, there is one goal, kill everyone else. - Game runs on a simple quasi-rock/paper/scissors game mixed with a tacticians prowess and unit leadership. - With friends you can build massive empires and role-play the ♥♥♥♥ out of this game, only with friends and Multiplayer. - Remarkable graphics (for its time) that can arguably stand up to this day.  - Replaybility and saving in the midst of battles are nice, as well as restarting a game with the same map or different starting armies. - You can choose between historic powers of the 1600s and 1700s, like France, Britian, Turkey, Bavaria, Prussia, Saxony, Russia, Netherlands, Venice, Spain, Portugal, Denmark, Sweden, Poland and others! -Up to 8 players in a match with great challenging AI, even at Easy. - Its a cheap affordable game which should work on any computer *note I'm running this on a Windows 8, not Win 8.1 with 4th Gen i3 and 4 GB of RAM* -Its a game that if you are familiar with the Total War Series should remind you of an arcadey version of Empire Total War, *note without turn base, diplomacy or agents, and the fact that this game is more 2d than Empire*.  I would say this is a must buy if you have the patience, heart and tolerance to get be humbled by the good AI system or a Human player, its cheap and fun. Also I haven't tried any of the 'DLC' or Expansion Packs as they were known back then. I hope this helps you make your decision ultimately, I wish you best of luck on the battlefield if you get the game.",
            "review_score": "1"
        },
        {
            "review_text": "I have played this game times in the past, even played it on Windows 7, but since I have updated to Windows 8.1 the message advises not to run the game because of resolution issues and there is no way, that I can find to correct this issue.",
            "review_score": "1"
        },
        {
            "review_text": "brilliant game :) feel the excitement like when you played this as a child.",
            "review_score": "1"
        },
        {
            "review_text": "fantastic ♥♥♥ piece of art.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game - Old but amazing scale - I like cannon",
            "review_score": "1"
        },
        {
            "review_text": "Hardest and olders strategy game I have so far owned. I have not passed a single campaign in this game and only 1-3 missions per campaigns. It's custom battles are also difficult and managing insane amounts of resources that get drained at the speed of lights because of your mercenaries and walls. I may just lack the required skill and mind but seriously this game is very very hard. Like the odds that are againts you are more then often insane.  Won't work on every computer due to it's age but if it does it should be fun. You can always cheat or mod or just play custom battles with AI on your side but ye definitely hard, definitely rewarding when and if you win and definitely fun to play in my opinion.",
            "review_score": "1"
        },
        {
            "review_text": "This game right here is the reason why im addicted to RTS managment city building type of games. I put 100's of hours unto this game back in the day.",
            "review_score": "1"
        },
        {
            "review_text": "what is the diffrent?",
            "review_score": "1"
        },
        {
            "review_text": "Better than Cossacks 3",
            "review_score": "1"
        },
        {
            "review_text": "Can somebody tell me why the ♥♥♥♥ the old versions of cossakcs, the ones running on Windows xp home and family os works on a windows 8.1 and the ♥♥♥♥ing windows 7 version(the ones released years later ex.Cossacks ♥♥♥♥ing II)crashes when i try to do anything except clicking menu buttons in the main menu??  This is a great game, lost of nostalgic feeling bond me to it. But if you have a win8.1os and thinking of buything the whole series for 6euros? well dont. buy cossacks:back to war cause that actually runs on it.  but then again win10 and you can say goodbye to all this too.. ♥♥♥♥ these devs for not updating their damn game...",
            "review_score": "1"
        },
        {
            "review_text": "This is a very cool time period that you see in very few games 17th century, great graphics and great gameplay and i also recomend buying the campign expansion, there is nothing wrong with this game in my oppion, Great game 10/10 would kill a saxon again!!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "just that formations dont work.. the units wont attack unless not in formations. or its just me",
            "review_score": "1"
        },
        {
            "review_text": "this game starts then freezes and wont turn off unless I restart my computer. Steam company see that it was played even though nothing is happing. I deleted it and re-installed it but still nothing. I have a very good computer, the game program is bad. Dont down load it.",
            "review_score": "-1"
        },
        {
            "review_text": "If you over Windows Xp or Windows Vista, Don't buy It. When I played it. I was Windows 8 yours, It is inconvience for Windows 8 or probably higher users.",
            "review_score": "-1"
        },
        {
            "review_text": "Sucks, can't play on my Windows 8 computer, I keep getting a dilplay error and don't know how to fix it.",
            "review_score": "-1"
        },
        {
            "review_text": "Made 1000 fully upgraded Russian musketeers and grenadiers.  Enemy Poland had 3 baseline spearmen.  I lost all my troops within 2 seconds, enemy lost 0.   I am not good at this game.   ",
            "review_score": "1"
        },
        {
            "review_text": "The program crashes when I click apply on in game options Windows 8.1",
            "review_score": "1"
        },
        {
            "review_text": "cool",
            "review_score": "1"
        },
        {
            "review_text": "really recommend to play",
            "review_score": "1"
        },
        {
            "review_text": "Great game, birngs back good memories.",
            "review_score": "1"
        },
        {
            "review_text": "In my opinion, one of the greatest RTS games of All Time &amp; the best of the Cossacks series.  Definitely recommended to anyone who've enjoyed Age of Empires.",
            "review_score": "1"
        },
        {
            "review_text": "Its like a classic age of empires but with muskets, and a delicate econmey system.",
            "review_score": "1"
        },
        {
            "review_text": "One of the many great old school RTS of its time. Brings back memories. This is way better than Cossack 2",
            "review_score": "1"
        },
        {
            "review_text": "Countless hours spent outside Steam. It's a legendary game that will be never forgotten. One of the best strategies ever existed.",
            "review_score": "1"
        },
        {
            "review_text": "EVERYONE IS BACK TO THERE FEET AND KICKING ♥♥♥ IN COSSACKS BACK TO WAR! THERE IS NO TOHER GAME THAT CAN MAKE YOU RAGE AS MUCH AND MAKE YOU HAVE FUN TIMES THEN THIS ♥♥♥♥. PIXELS AND ♥♥♥♥ AND HORRIBLE EXPLODING EFFECTS ARE YOU NEED TO ENJOY YOURSELF IN MID EARLY EUROPE TO KILL THEM BAD GUYS! WHO ARE THE BAD GUYS? I DONT ♥♥♥♥ING KNOW ALL I KNOW THAT ITS AWESOME! YEAH! EPIC SHIP BATTLES TO ♥♥♥♥♥♥ PIXEL SWORD FICGHTING!",
            "review_score": "1"
        },
        {
            "review_text": "amazing game, i love this, i played this in my youth everytime with my brother. I missed this",
            "review_score": "1"
        },
        {
            "review_text": "Don't be fooled by my playtime i have thousands of hours in this game outside the Steam. i buyed this game when i was like 10 years old(19 now) and at that time i had the worst pc ever and this is the only game i played until 12..i have finished and win every single mision and campaign,it is a great game and the multiplayer was awesome but they took it down...like 1 year ago or something.READING THE REVIEWS I HAD SEEN THAT COSSACKS 3 IS COMING OUT???? WOW !!",
            "review_score": "1"
        },
        {
            "review_text": "we love this game. give us patches and fixes maybe ?   still awesome !",
            "review_score": "1"
        }
    ]
}