{
    "app_id": 485040,
    "name": "Nurse Love Addiction",
    "release_date": "2016-07-07",
    "developer": [
        "KOGADO STUDIO"
    ],
    "publisher": [
        "Degica"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Sexual Content",
        "Nudity",
        "Adventure",
        "Simulation"
    ],
    "tags": [
        "Nudity",
        "Female Protagonist",
        "Anime"
    ],
    "achievements": 13,
    "positive_ratings": 495,
    "negative_ratings": 32,
    "price": 29.99,
    "description": "Follow Asuka Osachi, a ditzy girl training to become a nurse at Teito Nursing School. Experience her story with her classmates as they discover love, medicine, and adulthood.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/485040/header.jpg?t=1518578226",
    "minimum_requirements": "OS: Windows 7/8/10 Processor: 2.0 GHz or better Memory: 2 GB RAM Graphics: DirectX 8.1 capable GPU Storage: 4 GB available space Sound Card: DirectX 8.1 capable",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "  General: 10/10   A girl must sacrfice everything to build a Yuritopia. Standing in the way is a weapon that can surpass Metal Gear itself...Lesbian nurses!  Storyline: 10/10  Not for any nation. Not for any ideology. Not for justice. Not for honor. Not for power. Not for the future. Not for Revenge. Not for peace. Only for Yuri  Character: 10/10  Nao Osachi : A creepy incest filled sister, as well as a visonary denied her fetish  Itsuk Amatoi: A jokster without a past (and no personel space)   Sakuya Takeda: A rival tsundere living a lie   Kaede Ohara: A teacher who stands her ground (And might get charged with statory ♥♥♥♥)   Punished Asuka: A Fallen Star...(And 'dummy girl'...)  In conclusion:   In Outer Heaven, girls...become...lesbians...",
            "review_score": "1"
        },
        {
            "review_text": "Nurse Love Addiction is a lovely visual novel. Highly recommended to anyone who needs more yuri in their life.",
            "review_score": "1"
        },
        {
            "review_text": "A really beautifull, and interesting yuri VN.  The art work is amezing, the music fits well, the characters are really interesting. It is not like the usual romantic VNs with the same plot over and over again. In this game the plot sometimes take a big turn into horror, an every other genre.  The price must seem for a lot of people too much, but trust me, I have already played at the momment 8 hours of this game, and I still have no idea who my first choice will be to go for.   My only problem with the game so fr that you can't use the steam interface while playing it, that means, no screenshots, no streaming, no chat. I hope that they will patch that one out later on.   tl,dr: this is a must have VN!",
            "review_score": "1"
        },
        {
            "review_text": "It's Yuri with twists some of the twists are nuts i love this game.  Price is fine for content  Music - 10 Story - 11 Characters - 20 Nao-Chan - 500 Nurses - Angels",
            "review_score": "1"
        },
        {
            "review_text": "This is my first visual novel and I am quite pleased. It was everything I was hoping for and more. Love the fluff and silliness along with the very dark bad ends with each romance.   I laughed, I cried, I'm in love with Nao.   10/10 would play again.",
            "review_score": "1"
        },
        {
            "review_text": "well, fine, bad endings aside, it's definetly cute and has the one thing I look for in a VN...yuri. it still gets a thumbs down though",
            "review_score": "-1"
        }
    ]
}