{
    "app_id": 485380,
    "name": "Welcome to the Game",
    "release_date": "2016-06-15",
    "developer": [
        "Reflect Studios"
    ],
    "publisher": [
        "Reflect Studios"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 18,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Sexual Content",
        "Nudity",
        "Violent",
        "Gore",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Horror",
        "Simulation",
        "Hacking"
    ],
    "achievements": 11,
    "positive_ratings": 1355,
    "negative_ratings": 272,
    "price": 3.99,
    "description": "Welcome to the Game is a creepy horror/puzzle game that takes you into the world of the Deep Web. Explore the Deep Web with the sole purpose of trying to find a Red Room, an online service / website that allows you to see and participate in interactive torture and murder.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/485380/header.jpg?t=1478826657",
    "minimum_requirements": "OS: Windows 7 Processor: 2.4 GHZ Memory: 2 GB RAM Graphics: 1024MB DirectX: Version 11 Storage: 3 GB available space Additional Notes: Best ran at a 16x9 aspect ratio / 1080p",
    "recommended_requirements": "OS: Windows 7 Processor: 2.8 GHZ + Memory: 6 GB RAM Graphics: 4096MB + DirectX: Version 11 Storage: 4 GB available space Additional Notes: Best ran at a 16x9 aspect ratio / 1080p",
    "reviews": [
        {
            "review_text": "I've played the game for 5 hours. Which is enough time to beat the game 3+ times over. If you want a good review, this might be it.  This game is pretty good. It's simple, fun, and interesting. It's not too hard, but not too easy. And it's constantly being updated. They have already updated twice and the game has only been out for 3 days. Here is my breakdown:   Price",
            "review_score": "1"
        },
        {
            "review_text": "  Uhm what to say about this game, it's ♥♥♥♥ing mental but nice to play if you enjoy seeing people getting tortured and murdered. WOULD NOT RECOMMEND TO PEOPLE WITH WEAK MINDS AND SPIRITS!!!!",
            "review_score": "1"
        },
        {
            "review_text": "I find it hard to complain about this game given the price (just under 2CAD at time of purchase) and the new and interesting horror premise, but I have to say it was immensely frustrating overall. Maybe I was missing something, but I gave it almost an hour before I lost interest.  First of all, the core mechanic of deep web exploration is NOT fun. Here's why: - You are clicking links 99% of the time to check if sites are up (they are never up), and every time you navigate to a new page (no matter how, be it through a link or a browser action) it 'loads' the page for at least a second. Furthermore, trying to navigate to another page during this time does nothing. This is not acceptable. If the game wants me to click back and forth between pages a lot to find out which ones are up at what time, it can't make it this slow and tedious to do so. I get why it's like that, but come on. - The above problem is compounded by the fact that certain links appear to be cosmetic (some randomized link names in between playthroughs indicate this, although I can't be certain), so I'm never sure if I'm wasting my time checking a particular link. This may have been the intention, but even so it is a mistake. - The few sites you are able to access at any given time are shallow and/or hopelessly obscure in their intent. I don't know about others, but I personally have not gotten more than a single layer deep into the links from the home wiki. I managed to get a single piece of the URL to the red room, and that was by clicking on ONE conspicuous link on a site linked directly from the wiki. It didn't lead me down an intriguing rabbit hole where I could track down clues, the four digits just appeared above the link after I clicked it. I'm assuming I didn't see the best the game could offer, but seriously? - In general, I have absolutely no idea how to proceed. I guess I'm supposed to spend many in-game days slowly building up my notes until I can navigate the deep web with ease, but this plan of action is frustrated by the other big problem with this game:  The secondary mechanic of counterhacking is NOT fun. Here's why: - If you fail and get hacked, you might lose all your notes. YES, THIS CAN HAPPEN. The virtual notepad, what I thought was surely just a substitute for a real note-taking surface (which I assume most players could easily procure if needed, thus making the virtual one a mere courtesy), is actually a trap, and you're a sucker for using it. This actually baffles me a bit because it means whoever made this game thought people wouldn't immediately pick up a piece of paper and start using that instead. Again, I see the intent behind the design, I just don't care. This is just a mean trick. - One of the minigames is literally a typing test. Yes, a typing test. I won't say that it doesn't fit the theme of the game or that it couldn't have been done in a better way, but the current implementation sucks balls. You just have to write out what's written on the screen, so the only challenge is dexterity. And the challenge level has been balanced poorly; I'm a relatively fast typer so I never feel any tension during this minigame, but I can easily imagine the finger-pecking typists having lots of trouble with the parens and unconventional phrasing. I'd probably be sweating bullets if I had to find every symbol on the keyboard by looking at it I guess. That or throwing my laptop out the window in frustration. - The other one is just plain hard. Again, maybe I'm missing something (because I don't care enough to get good) but it seems like if I set just one of the turnable arrows wrong, the hack either hits an empty grid cell and starts again or hits the edge of the grid (completing the hack, which means I lose) simply based on luck. I guess I should be more careful, but the timer means that I'm frantically looking for the one correct configuration that will stop the hack WHILE the hack is progressing. It feels like too many things can go wrong here.  If you can't tell from how much I had to say about this game, I do like it and care about it. It's an interesting idea and the presentation is solid, but there are non-trivial problems with the gameplay that need to be addressed if it's going to reach its potential. If this is supposed to be a finished product... dev/s, did you playtest this at all, or...?",
            "review_score": "-1"
        },
        {
            "review_text": "more Russian hackers than cs:go 8/10 pretty cool concept",
            "review_score": "1"
        },
        {
            "review_text": "Heard it was made by the devolopers of Rides with Strangers. Wanted to give it try. Ended up slamming AltF4 numerous times. 10/10 would never want to get kidnapped by Russians deterred by darkness again.   No but in all seriousness, a wonderful game for its price, a nice project for the devs. Creepy and horrifying in an-all new and real kind of way. One of those games that makes you wanna stay still and never move again. Or look around. At all.   Also, what I found most creepy *POTENTIAL SPOILERS AHEAD*      Is the fact that I'm wondering if this game is tied to Rides with Strangers in any way. First of all, many of the disturbing articles focus on young women in their twenties. The butcher looks for them, the doll maker mentioned having one that was 22 as one of his 'toys,' a 22-year old woman admits on Forgive me that she wants to be kidnapped and ♥♥♥♥♥. And plus, I've heard from some Russian speakers that the kidnapper says 'Baby, good evening' before he takes you. This could imply that the player is a young woman in their twenties.   Who else is a young woman in their twenties? I would guess Elora, from RwS. Also, the most chilling of facts is that in one of the sites, a client asks, 'Where is the current location of Elora Silverman.' Could just be a coicidence, but seems a bit spooky to me.   Conspiracy theories aside, great game, and I highly suggest you spend the 2 bucks for the experience.",
            "review_score": "1"
        },
        {
            "review_text": "Screamed out loud. Scared the dogs.  Ready to play again when it's dark outside. 10/10 fun!",
            "review_score": "1"
        },
        {
            "review_text": "Pretty boring honestly. Not really sure what I expected, but it was much more than this. More that half the websites won't load, and the excuse is that they will 'only load at a certain time on the night'. Well since it takes 15 seconds to load ANY page, it took me an hour to even look at all the pages, let alone visit them at certain parts of the night. Not to mention the fact that every webpage is just that: a single page. None of the links on any given website will go anywhere. Oh, they're clickable, but every single one leads to a DNS error. Even with all that, there's no excuse for the constant annoying 'hacking' that goes on. Sometimes it'll happen 4 times in a minute. Each time you need to type 5 lines of code to continue playing. It's not hard or scary, it's just annoying.  Really dissapointed that I spent time on this. It was a waste of my morning and my money.",
            "review_score": "-1"
        },
        {
            "review_text": "The real deep web is safer than this!!!",
            "review_score": "1"
        },
        {
            "review_text": "Back from being Kidnapped I have learnt my lesson NEVER EXPLORE THE DEEP WEB!!!! TRUST ME!!!! DO NOT GO ON THE DEEP WEB!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Samson: It doesn't seem that bad.  10 minutes later  Kidnapper in the house   Samson: I DONT WANT TO PLAY THIS ANYMORE!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Played this alongside my partner. We didn't manage to get far but we were paranoid so much a long the way. At first when I was typing in the notes, my Partner said '♥♥♥♥! The kidnappers here and he's eating dorito's beside you!' We laughed like you would but then I went on a website and it was an old priest voice. I clicked out of the website and he kept talking so again my partner said. 'He's finished eating now he's trying to talk to you!' I then exited the computer and turned to see him standing there just staring at me.. Part of me thought I saw dorito crumbs on his bottom lip.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game, infact it's the only horror game that I like. However, while the tutorial explains how to play, there doesn't seem to be anything saying how to do things like properly close the game, or save, etc. Everytime I exit the game, I use the task manager shortcut, click 'end task' and hope it autosaved recently. I tried looking online, but couldn't find any help. Please make some sort of 'controls' page in the main menu or something that will say how to do these simple things. Other than that, as I said, I love this game.",
            "review_score": "1"
        },
        {
            "review_text": "Worst than the real Deep web",
            "review_score": "1"
        },
        {
            "review_text": "Ever wonder if that CS:GO Russian was relaly gonna get you? Well....",
            "review_score": "1"
        },
        {
            "review_text": "i liked the story but i think the creator could use a vs mode (1 players is the hacker and kidnapper the other is the guy) and i thnk the kidnapper could be more esier to know where he is for peaple that are not headphone users bu i recomend this game",
            "review_score": "1"
        },
        {
            "review_text": "Really fun and difficult",
            "review_score": "1"
        },
        {
            "review_text": "step 1 start game step 2 click new game step 3 have game sit in loading screen step 4 have game not respond step 5 click wait for game step 6 repeat step 1-5 step 7 complain because you can play almost every game on steam but this isnt one of them step 8 get help step 9 escape mental asylum step 10 fight asylum demon step 11 kill gwyn step 12 link the first flame 0/10 would kill myself in a loading screen again",
            "review_score": "1"
        },
        {
            "review_text": "Learned 90 minutes into the game that the game takes into consideration what you are saying into your mic. Would say '♥♥♥♥ ♥♥♥♥ ♥♥♥♥ ♥♥♥♥' again when the kidnapper is next to me.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun game, right amount of scary and an interesting topic.",
            "review_score": "1"
        },
        {
            "review_text": "I have just under 30 minutes of play time at the time of writing this review.  That being said, I haven't experienced the entire game yet. FAIR WARNING! The first impression i got from this game was 'Oh hey, browse the deep web (kinda) except you don't actually have to download and go through the spookiness of the deep web.' That wasn't exactly correct. I won't spoil the game so as you can play it yourself. But, in the 27 minutes of playtime I have been thouroughly impressed, spooked, and interested.    one hint for you: Explore Everything.",
            "review_score": "1"
        },
        {
            "review_text": "Alone in my house at 2:38 PM. Middle of the day. Already uneasy getting into the game for the first time. I think I hear a couple noises, and back away from the computer, looking out the window and around the room. I screwed the address up on the site I was trying to reach, so I get back to fixing it.  I hear what sounds like a chair sliding next to me.  I hit escape and quit the game.  It took truly pulling a 'NOPE' move to realize I don't think I've ever been so stressed out by one of these horror/simulation games that I literally shut it off.  Waiting to get back on when my brother can watch -- and I'm perhaps not so pants-♥♥♥♥♥♥♥♥ly frightened to play.",
            "review_score": "1"
        },
        {
            "review_text": "I loved the game at first. Finding codes, hunting the deep web. Amazing. Got kidnapped, started over, but it happens. But then one time I saw the tracking icon in the top right of the screen. I waited an HOUR and I could still here the kidnapper. That's a whole HOUR of NOTHING. Got kidnapped, lost everything. Not sure if this was a bug that made it take so long but if it was then please fix it devs because it's an amazing game otherwise. Due to this I honestly wouldn't pay £1.59 or about $2. (I'm British) I would request a refund but I've played over two hours which is too long for a refund. If this is fixed I would pay £5 for the game. I just can't reccomend it now.",
            "review_score": "-1"
        },
        {
            "review_text": "Why i must go to that Dark Web ? I just want to play this game ! :(((",
            "review_score": "1"
        },
        {
            "review_text": "&gt;chillin' on the deep web &gt;hears footsteps &gt;♥♥♥ THIS ♥♥♥♥ I'M OUT 12/10",
            "review_score": "1"
        },
        {
            "review_text": "Okay, this game is so ♥♥♥♥ing annoying.    You're supposed to click on links to random webpages and look for codes.    I was on every page of the first wiki: no codes. I checked all of them numerous times to check which ones open up at certain hours and which ones are fake.   Then I tried the Choosen Awake puzzle, and by Thor's hammer, that might be the worst 'puzzle' I have ever seen. You need to scroll down the page and click at things. If you click the wrong one, you need to do it all over again. There's no pattern. Just do the same ♥♥♥♥ dozens of times and hope that you will get lucky. The last part of this  *hack*  'puzzle' requires you to hover your cursor slowly over tiny circles and hope that one of these is clickable. And of course, there will be more than one to make you scroll all the way back to the same point and try again. Then it gives you a link to the second wiki, where you will be doing the same thing as before. Oh, and remember to f*cking write it down, because if you accidentaly click the home button, it will take you back to the first wiki and you will have to enter the link again. Oh, and if you didn't write it down, then do the same  *barf*  'puzzle' all over again - but this time it's different, so have fun wasting your time on this turd.   Secondly, the enemies. You know how you just want to do something important on your PC and everyone keeps bothering you? Well, this is the perfect simulator for you. You will have to turn off your lights or pick up the phone and run to the door like every 3 minutes. Or not, everyone loves starting everything over! Did I mention that the code locations are random so if you die you need to waste even more time? Oh, and the hackers. They suck monkey ♥♥♥♥. They can strike 3 times in one minute, and their minigames are just... God.     First there's the typing one. If you don't want to lose your snail porn collection, you need to type long strings on complicated commands in limited time. F*ck you slow typers! This is not the game for you!  Then the arrow one. It starts instantly and gives you no time to figure out where to go. Boom. Hacked. Say bye to hardcore Gardevoir x Meloetta hentais!  And the cloud one. It's just a huge joke. You add something so simple in a 2.0 update?    'B-b-b-b-b-but dude, you can reset the modem and it will stop the hackers!!!!!!1!!!!!!'   Yeah, leave the computer screen, click the modem and hold it for f*cking forever, and after it finally f*cking resets you only get like 2 minutes of peace. Thank you for this amazing feature developer! Another annoyance that just slows me down and distracts me fron potential killers!    Bonus: do you want to search through funny and random xD confessions like 'I have a small ♥♥♥♥♥' or craaaaawliiiing iiiin my skiiiiiin ones like 'I wanna ♥♥♥♥ my entire family' hoping that RNG Jeebus will give you a code? Then you're in for a treat.        And the most important part: what's even the point of playing anymore? Everyone saw their favourite screaming manchild beat the game. Everyone knows the ending and what's behind sites like 'Grandma's Fantasy' or 'The Dollmaker'. Playing this is just not rewarding anymore.   I don't know why I wasted my money on this.    Avoid at all costs and just watch it on Youtube.",
            "review_score": "-1"
        },
        {
            "review_text": "So I died. Not entirely sure why. Saw that little GPS arrow in the corner, tried to click it repeatedly thinking it did something. Upon clicking it a few times and watching it disappear decided it was nothing- afterall I couldn't hear any footsteps in the house which had so often caused me to 360 with my neck and poddle over to the lightswitch with adorable plodding noises to flick it off and sit in the dark. Continued to randomly click things on that 'Chosen' website, squinting at the tiny little dots all over the page looking for the telltale mouse shift that would mean I could click that one and make ... well Something happen. Then suddenly kidnapper! Literally shrieked at that point.   Maybe it was my boyfriend shouting at Battlefield three behind me which my mic most certainly would have picked up on, maybe it was the amount of hacks I failed at before realising the 'nodes' were actually the little arrow boxes and Not the exit sign itself, maybe it was that I had spent about an hour shifting through all the dead links and trying to go through them all one by one (only getting a single code at the end of it all, too! BOO!), or maybe it's just that the deep web is trolling me- but I definitely died.  But hey- I was trying to find a room were I could watch someone else be tortured and killed- so I guess I deserve it.  Absolutely had a laughing fit in the confessional, though, when someone confessed they fapped to furries. Good times... probably not enough good times for a fully fledged or fully priced game, but at a couple of quid- try it!  :v Maybe one day I'll work out where all those blasted codes could be!",
            "review_score": "1"
        },
        {
            "review_text": "This game will always keep you on your toes, you start to feel paranoid after every minute, whether it be a chair moving or a paper plane icon thing on the top right of the screen. I always end up waiting in the dark for 10 miniutes because I'm actually scared when the lights are on. Thanks Adam for giving us this amazing game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is very good &lt;3  xD ....... ",
            "review_score": "1"
        },
        {
            "review_text": "&gt;plays game with friends talking in discord &gt;believes i will be fine because that usually helps &gt;plays the game up until the gun buying room &gt;not really that spooked &gt;friends joke about guy being at the window &gt;I look at the window &gt;not there thank god.jpg &gt;goes back to buy an ak47 because i want to murder some people &gt;black man voice talks to me saying something i cant understand &gt;literally ♥♥♥♥ing screamed and scared the ♥♥♥♥ out of my friends   I have never screamed like that at all. Ever. Horrors game dont usually spook me but this one.   Buy it. Even if you have no money just buy it. It's worth it.     10/10 would need to change pants again",
            "review_score": "1"
        },
        {
            "review_text": "I went onto the Dark Web. None of the pages worked so I didn't actually connect. Fifteen minutes later I was kidnapped by Russians. That's world class efficiency.  In all seriousness (that's really what happened though), this is like a super creepy Five Nights at Freddy's. You watch and listen for clues while using the Dark Web. When you think someone's about to break into your house, you log out of the computer and turn the lights out. During the time when you are on the Dark Web, you are looking for clues to get to a particular site. Get to the site without getting kidnapped and you win.   Overall seems fun so far.",
            "review_score": "1"
        },
        {
            "review_text": "Got kidnapped in the first 2min...",
            "review_score": "1"
        },
        {
            "review_text": "I was looking forward to playing this game.. So i bought it and i downloaded it and everything and once i got to the loading screen, the skull (loading bar) blinked 3 times and then it froze and i sat there for like 10 minutes waiting for it to load in to the game and it never did. Even know i could hear the game going in the background. If someone could help me that would be great, thank you.",
            "review_score": "1"
        },
        {
            "review_text": "I just wanna know how to determine when you're supposed to turn the lights off so I can finish the game. Other than that it's pretty cool.",
            "review_score": "1"
        },
        {
            "review_text": "the game is fun but getting hacked happens way to much, and I feel like the requirements are way to high just to run this game. also, if you liked getting scared this is the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "an awesome game......sadly played it during the night",
            "review_score": "1"
        },
        {
            "review_text": "-downloads game- -does tutorial- -hears a small sound-  -press windows key then closes the game-",
            "review_score": "1"
        },
        {
            "review_text": "10/10. Lets see if I can hold ♥♥♥♥♥♥♥♥ myself in the next 10 minutes of playing",
            "review_score": "1"
        },
        {
            "review_text": "This is better than tor.",
            "review_score": "1"
        },
        {
            "review_text": "russian/10 would ♥♥♥♥ pants again",
            "review_score": "1"
        },
        {
            "review_text": "Very Scary ♥♥♥♥ my ♥♥♥♥ and my face",
            "review_score": "1"
        },
        {
            "review_text": "Russian thugs snuck into my house and took me away, 8/8 r8 8",
            "review_score": "1"
        },
        {
            "review_text": "Welcome to the game is one of those great indie horror game gems you find every now again. If you have any interest on going onto the deep web and exploring some of those disturbing sites this is a safer equivalent. While doing that you have to find pieces of a link which leads to a red room and avoid a Russian kidnapper. That's all I'm going to say. It's great.",
            "review_score": "1"
        },
        {
            "review_text": "I was kidnapped and the game immediately crashed afterwards. ♥♥♥♥ myself. 10/10 would play again",
            "review_score": "1"
        },
        {
            "review_text": "im only played a small amount and i love it the only thing i see as a issue is the kernal complier hacks those ones either need that clock slowed down or something other then that great game IMO and i would metion this to others to give it a shot to try since its cheap to buy as well keep up the good work reflecter studios",
            "review_score": "1"
        },
        {
            "review_text": "this game is so fun and scary and it is so realistic , but maybe add animations so he actually comes through the window so he can come in if you dont turn the lights off and you are in 3d mode :)",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. I can't feel my balls right now. Thanks Adam.",
            "review_score": "1"
        },
        {
            "review_text": "spooky &amp; scary.  will be playing again.",
            "review_score": "1"
        },
        {
            "review_text": "Jumpscares. From one word alone you know whether or not you're going to buy this game. This is a sort of FNAF clone where the jumpscare only happen if you die, but the cues for when you die are, as usual, virtually non-existent. ...and when you die, you lose all progress. I played through the tutorial and then I closed the game and watched an LP instead. I regret absolutely nothing. ...but if you're a 15 year old kid who loves Markiplier and PewDiePie, then you'll probably love this game.",
            "review_score": "-1"
        },
        {
            "review_text": "It is fun for a little while but then you realize that you are in for the long haul, it starts to get boring from all the clicking and finding nothing. I admit it was pretty interesting and different style of game play.",
            "review_score": "-1"
        },
        {
            "review_text": "this game is freaking boring but funny. ( ͡~ ͜ʖ ͡°)",
            "review_score": "1"
        },
        {
            "review_text": "the game will not load the game needs a little minor updates ",
            "review_score": "1"
        },
        {
            "review_text": "  Welcome to the game is very very ! nice horor game Valve !",
            "review_score": "1"
        },
        {
            "review_text": "My playtime may show 11 minutes, but I haven't gotten to do anything past the tutorial. Everytime I try to load one of the in-game webpages, the right hand side of every page is cut off, making it impossible to play. I've tried messing with my resolution settings, and it just made it worse. This is a huge shame, because for $2, this seemed like a pretty fun little game. Read the community posts before you buy, a lot of people have major problems with bugs. I put that I do not recommend this game, but that's only if they don't start fixing some of the issues that pop up.",
            "review_score": "-1"
        },
        {
            "review_text": "Hecc.  First I spend 4 dollars, excited and happy to play this game.  Only to find out it's always lagging out on me and never getting into the actual game.  Now when I tried to move it onto my background-place it stopped working all together and now it won't let me pay.   Rest in peace 4 good dollars.",
            "review_score": "-1"
        },
        {
            "review_text": "Its boring to hard",
            "review_score": "-1"
        },
        {
            "review_text": "Game is straight butt and it's boring as ♥♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "One time I went onto the deep web and I accidentally hired a hitman on myself. Thank goodness I am a military trained kung-fu professional and I beat him easily and then the hitman guild hired me to be their best guy. But then I said 'no' becuase I was too powerful for them now.",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty ♥♥♥♥ to be completely honest.",
            "review_score": "-1"
        },
        {
            "review_text": "*Gets phone call* *Answers call and hears breathing* *Nopes right out of game*  11/10 3spoopy5me",
            "review_score": "1"
        },
        {
            "review_text": "Its worth a few scares and is bound to get you. Although it can get reppedetive and boring id recommend playing it with a friend watching. The websites can offer a very spooky atmosphere the idea is genius.",
            "review_score": "1"
        },
        {
            "review_text": "Great horror game, especially with the new update. The first time 'the breather' called me, I jumped from my seat and fell over. After I got up, I lost about 4 days because I got hacked while recovering. One recomendation, allow to go out of the computer to do stuff without loosing the link you were typing.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely original and unique,Recomended, personally though i wish i could just buy a gun and shoot the damn kidnapper ._.",
            "review_score": "1"
        },
        {
            "review_text": "Im not saying that i dont type fast but if you dont do not buy this game",
            "review_score": "1"
        },
        {
            "review_text": "(Man, I really wish the Illuminati website was open...) A truely authentic horror game! Welcome to the game delves you into the deep web where truly horrible things happen! This game allows you to actually feel like you are going in the deep web without having to. 10/10 Great Game (I screamed a lot!)",
            "review_score": "1"
        },
        {
            "review_text": "  I got taught how to flick a light switch.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. I know a bit of C# and it seems like the code may actually be some form of C (C++ maybe) or just 95% made up.  Either way, I have browsed the deep web and watched videos. The game is clearly made by someone who has spent a great deal of time on the deep web. Granted the basis of the game is based on a lot of myths and urban legends, it is still pretty cool.  It absolutely scared the living **** out of me about an hour in, with minor jump scares throughout. I was about 1/4 through with solving the puzzle and making it to the elusive 'Red Room'.  The object of typing the code in the alloted tim to avoid being hacked is really fun. I like trying to type code super fast. It gives me breif feelings like I'm a proficient programmer.  I did feel a bit cheated with the arrow puzzles barely giving you enough time and deeming me 'HACKED' when I feel like I got it. Also the fake in-game load times could be shortened, I mean, they are pretty realistic- maybe even faster than an onion network but when you're clicking through hundereds of sites the 3 second waits reallly add up.  There is a lot of nonsense in the game overall but it's really well made and a lot of fun. It's also super cheap. I highly reccomend. I could justify using all of these tags on this game:  Simulation, Puzzle, (Atmospheric) Horror, Programming, Time Waster, Funny and Disturbing. Pretty good combination and well done at that.  I will be playing this again really soon and I WILL solve the puzzle.",
            "review_score": "1"
        },
        {
            "review_text": "I was having fun until CrazyRussianHacker came to tell me how to make a bag of chips stand up",
            "review_score": "1"
        },
        {
            "review_text": "i've never felt the urge to ♥♥♥♥ literal bricks from just the ambience of a game  i am dead",
            "review_score": "1"
        },
        {
            "review_text": "This game is realy fun! It's really intense at some pats but that makes me want to play it even more",
            "review_score": "1"
        },
        {
            "review_text": "Great game so far! The only change I would make would be say a difficulty level. The kernal attacks i believe they're called, they can be difficult if you can't type for ♥♥♥♥. XD",
            "review_score": "1"
        },
        {
            "review_text": "How 2 Welcome to Game   * Friend buys it for himself and I* * He sharescreens on skypes and starts playing* *Almost gets hacked* * I realize he's a slowass typer* * He goes on some random confess website* *Man talks about loving ♥♥♥♥* *Girl talks about having a bad childhood* *Clicks next, takes a while...* *' I will find you and kill you'* * ALT+TAB * * RIGHT CLICK * * CLOSE WINDOW *    12 minutes later. I start playing I hear a thump while sharing... *♥♥♥♥ THAT* Look behind me thinking I could actually walk around... start yelling how the **** do I move???? Turn off the lights... The turn around animation is scarier than the kidnapper  Afterwards, my friend tells me to continue sharing screens and write this...   My 'hacker' friend in-game named Adam teaches me about the ways, I think since I declined his call caused him to tell me that I would die in 28 days...   11/10 would get dead in 28 days again. Remember kids, always right click close window repeat. Now I'm off to play some more      ",
            "review_score": "1"
        },
        {
            "review_text": "This game is actually pretty good! The game focuses on trying to find a red room, throughout trying to find it your computer gets hacked many times and you have to try to redirect the attacks. And throughtout all of that be careful for the kidnapper that trying to get into your house. And by the way.. be warned, if you get hacked and the kidnapper is inside of your house it gets really hard..",
            "review_score": "1"
        },
        {
            "review_text": "its fun but hacking is to constent and kidnappers will kidnap with no indication they are coming",
            "review_score": "1"
        },
        {
            "review_text": "Really desturbing 4/20",
            "review_score": "1"
        },
        {
            "review_text": "This game sends a chill down my spine that i can never recover from.   10/10  Best Experience",
            "review_score": "1"
        },
        {
            "review_text": "Good game, not scary. Simple attack bloking. Cheap &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "One of the better games that I've played. Took me about 10 tries to get to the red room.  8/10 would play again",
            "review_score": "1"
        },
        {
            "review_text": "  Great....  10/10",
            "review_score": "1"
        },
        {
            "review_text": "This is a really good game. They're actively working out kinks, and there aren't many to begin with. It's a cool concept and pretty unique and original. It's very immersive. It's also a cool introduction for people curious about the deep web. It's obvisouly not the exact same, but the general concepts aren't far off. Have fun.",
            "review_score": "1"
        },
        {
            "review_text": "Welcome To The Game is a short indie horror game where the protagonist must search the Deep Web for eight pieces of a URL. Once completed and entered into the browser, this URL will take the player to a Red Room, which is a website that livestreams torture and murder for the entertainment of its twisted viewers.  The player starts on the desktop screen of their computer with two tools at their disposal: the A.N.N. (Anonymous Node Network) web browser, and the Notes app. ANN is a special browser that gives the protagonist access to the Deep Web, and the player is given a list of Deep Web links as their homepage (this is called 'Deep Wiki I'). From there, the player must click on each website link, and the subsequent links and buttons found on each site in their search for the elusive eight URL pieces.  Sometimes, when the player clicks the right hyperlink or button on a webpage, a notification-type sound will play and one of the codes will usually appear in text somewhere on the page. Alternatively, a .txt file may on the desktop screen, which the player must then double-click to reveal the code inside the file. Once a code has been found, the player must then write it down in the Notes app in order to keep a record of it.  If the player is lucky, they may even find a website where one of the codes is already displayed on-screen when they first visit the site.  However, while you're exploring the Deep Web, there are hackers who will try to hack into your system and disrupt your path towards the Red Room. Thankfully, your friend Adam (who is also the developer of WTTG irl) has installed some defensive software on your computer to deflect the hacks from harming your system.  There are two types of hack attacks:  The DOS (Denial Of Service) attack, a mini-game where the player must direct the incoming web traffic through all empty nodes (green boxes) and then finally towards the end node (a USB icon) before the timer runs out.  and the kernel attack, a mini-game where the player must type out all lines of web code they see on-screen before the timer runs out.  Both mini-games are very challenging, though I much prefer to fight a kernel attack as I am a fast typer, whereas the DOS attacks are harder for me to block since some of the arrows will send the traffic back to the start of the grid, and the timer is generally shorter than with kernel attacks.  The DOS game requires quick thinking and fast reflexes from the player in order to calculate the correct route for the incoming traffic, as well as being able to direct the traffic quickly enough. The kernel game relies more on accuracy and attention to detail as the player will often find themselves creating typos or forgetting certain characters like capital letters, semi-colons etc. as they race against the clock to get all lines of code typed out in time.  If the player manages to block the hack, then nothing is affected and they can continue on with their quest for the URL. If the player fails to block the hack, then they will lose a certain amount of days of looking for the Red Room URL. The amount of days is displayed at the top of the screen when browsing the Internet, and this is important as there is a readme.txt file placed very sneakily on the desktop after you have played the game for a few minutes. In this file, Adam explains that you only have 30 days until the Red Room closes, at which point it is a Game Over.  There is also a small chance that, upon getting hacked, the player may also lose all notes they have recorded in the Notes app, hence forcing them to remember where they found each code so they can go back and write them down again. The player could simply write the codes down irl, but this ruins the fun of the game and makes it too easy imho. It is up to the player whether they want to play the game as it was intended, or if they want to cheat and write the codes down irl. I personally don't since, as I said, it makes the game too easy because the hacks aren't as big of a deal that way.  Adam (developer of WTTG) could address this in the next update as he is implementing a '1337 mode,' which will essentially be a harder difficulty mode with a new ending as the reward for beating it. In this mode, I suggest that Adam could make it so that when you lose your notes, the Red Room URL changes. The lost codes would still be in the same places that the player found them in before losing them, but the codes themselves would be different since the URL has changed. So even if the player does write down the codes irl, it won't help them since the codes will now be different; thus they would still have to remember where they found each code and go back to get them again.  There is a good range of delightful, family websites websites the player can visit, such as drug stores, gun stores, hacking websites, a blood sacrifice site and more. Most of the links you are provided with are dead since it would be impossible for sites like 'xXTEENXx' to actually be put in a Steam game, though there are websites that are only operational at certain times of the day, which is why the player must also pay attention to the clock at the top-right corner of the screen.  The lore that can be found from reading the text on some of the websites really adds to the atmosphere of the game, especially when you play it late at night with headphones on. Some sites even play sounds in the background, which can make your skin crawl as you skim through the page for a code. There is a volume button at the top of the screen that you can click in order to mute these sounds, and you'll need to do this later on in the game.  This is because there are also kidnappers in the game. The longer you surf the Deep Web, the higher the chance you have of being tracked by a kidnapper. Sometimes you can spot a GPS arrow icon appearing next to your Wifi icon at the top of the screen, which means that someone is tracking your location. Other times, you will hear strange sounds in or around the house, such as feet walking through the grass, someone walking through the house etc. If the player thinks a kidnapper is about to abduct them, they can get up from their computer, switch off the lights and sit completely still. If they move at all when the kidnapper is nearby, they will be found and abducted.  So when sounds are playing on a website, it is often a good idea to mute them to make sure you don't miss the kidnapper making any sounds, or else you may just end up being abducted.  I won't spoil the ending too much, though it is a pretty decent ending imo. Some players may find it kinda lackluster, and others will appreciate it for what it is. However, as I stated earlier, the developer will be releasing an update for this game (at the end of August I believe) which will inlcude the new 1337 mode where the player can find a new ending upon beating it, so perhaps this ending will be more appealing to some players. The update will also include more websites and some gameplay balances I think, so I am excited for the update :)  In conclusion, this game is very engaging, very entertaining and above all else it is bloody scary. The game is fairly short once you figure out how to play it, although the codes, puzzle solutions and available websites change each time you play the game, so there is some replay value here. For £1.59 (about $2-$3?), I'd say you get bang for your buck with this title. For anyone looking for a great horror experience, I highly recommend Welcome To The Game as your next Steam purchase.  Adam Flatau, developer of WTTG, is also working on another horror game called Rides With Strangers, which should be released in 2017 if I am correct. After playing WTTG, I am very excited to see what creepy games Adam can give us next :)",
            "review_score": "1"
        },
        {
            "review_text": "I loved how acurate this game is compared to using the real deepweb, I loved how scary yet compelling the gameplay is, I loved the mystery, I love the graphics, and I just flat out love this game overall! It is one of the best games out on the steam marketplace and more than gives FNAF a run for it's money!",
            "review_score": "1"
        },
        {
            "review_text": "This game is really awesome!!!!",
            "review_score": "1"
        },
        {
            "review_text": "  Only played once, this game gave me very fast heartbeat and my self-awareness was well over kiltered.    Never. Underestimate. Any. Noise.",
            "review_score": "1"
        },
        {
            "review_text": "*Buys Game* Alright lets play this, not sure what to expect but seems alright. *5 mins later after getting hacked about 20 times* Did i hear footsteps? *♥♥♥♥♥ pants* Alt f4 never opening again 10/10",
            "review_score": "1"
        },
        {
            "review_text": "&gt;See some youtubers play this game &gt;'oh, that looks pretty cool' &gt;Buy it &gt;Concept is really interesting, have a blast for the first few minutes &gt;HACKING SOUND ALL THE ♥♥♥♥ING WAY &gt;I think my printer fell off solely from the vibrations that my headphones produced &gt;Clean pants and continue playing, sound lowered &gt;Reading on how to prepare a delicious steak out of human &gt;Start drooling &gt;RUSSIAN KIDNAPPER JUMPSCARE, ♥♥♥♥ER SNEAKED UP ON ME BECAUSE I HAD MY SOUND SO LOW &gt;Alt + f4 &gt;uninstall &gt;never again &gt;10/10, cheap alternative to laxatives",
            "review_score": "1"
        },
        {
            "review_text": "Holy cow this game is scary. Some people think, oh it's got no actual horror in it because you're scared of the jump scares. But that's not true. Jump scares are the reason I screamed most of the time, but that's not the point. This game puts me on edge. It takes a lot of patience and time to find the codes, and once you've found 1 you don't want to loose it. In order to win you have to be immersed. This is such a good game, I very very highly recommend this.",
            "review_score": "1"
        },
        {
            "review_text": "I honestly wish there were an 'easy' version where The Kidnapper and The Breather didn't exist for those of us who don't feel like having to check the door every two seconds. This game is brilliant--just kind of unplayable because you get caught extremely often and have to start from the beginning every time.",
            "review_score": "1"
        },
        {
            "review_text": "Best Game every and it can get you heart attack!!! LOL! jk but be ware from that ruissan theif he will try to kidnap you by surpries and you ♥♥♥♥ in your pants XD",
            "review_score": "1"
        },
        {
            "review_text": "Buddy and I tried playing it. Made no sense. We seemed to get stuck in a loop with the plot not developing at all. Might be missing something.",
            "review_score": "-1"
        }
    ]
}