{
    "app_id": 485490,
    "name": "Dungeon Journey",
    "release_date": "2016-06-03",
    "developer": [
        "Carbomb Software",
        "Nova Dimension"
    ],
    "publisher": [
        "Nova Dimension"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Casual",
        "Indie",
        "RPG",
        "Simulation"
    ],
    "tags": [
        "Casual",
        "RPG",
        "Indie"
    ],
    "achievements": 0,
    "positive_ratings": 160,
    "negative_ratings": 39,
    "price": 1.59,
    "description": "Fight your way through thousands floors of dungeons. Get precious treasures and slay undead creatures of hell to make your character stronger.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/485490/header.jpg?t=1510400878",
    "minimum_requirements": "OS: Windows XP, Vista, 7, 8, 8.1, 10 Processor: 1 ghz Memory: 512 MB RAM Graphics: Integrated or higher Storage: 240 MB available space Sound Card: Integrated or higher",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Nice little game i got for 0.40p (UK), Repetitive and a little long for a game this simple but 10 hours says they must have done something right as it really wasnt too bad. Money well spent i would say.",
            "review_score": "1"
        },
        {
            "review_text": "This is an excellent game combining smartphone-sized roguelike dungeons with a battle system not unlike how trading card games work. It's very easy to get into to the gameplay, yet does it demand a combination of risk management, strategic thinking and quicktime reaction to actually survive whatever the game throws at you. Don't be fooled by the gameplay trailer - the game flow is solely based on the pace of your actions and you should think twice or even thrice about what to do next. Additionally, it's worth to note that game generates a distinct audiovisual atmosphere of it's own and you feel immediately entangled by the very gods of random number generation.  Bought it for 0,59€ but the full price of 1,99€ is absolutely worth it. If you like well crafted roguelikish games with their own flair, this is perfect for you.",
            "review_score": "1"
        },
        {
            "review_text": "this is a very fun game and cheap. i seem to pay 5x as much for games i never play, and this gem is worth it for sure. only dislikes are the merchant item prchase. this game gets you used to clicking clicking and clacking, and when you save up to buy item, you sometimes go too fast and click and accidentally buy crap you then have to sell back for 10%. or at least my dumass did.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game. It is very easy to start to play. In-game training takes just 5 minutes. And now I can't stop playing it.",
            "review_score": "1"
        }
    ]
}