{
    "app_id": 485580,
    "name": "24 HOURS",
    "release_date": "2016-09-13",
    "developer": [
        "Freshtrax"
    ],
    "publisher": [
        "Freshtrax"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "Adventure"
    ],
    "achievements": 0,
    "positive_ratings": 317,
    "negative_ratings": 409,
    "price": 0.79,
    "description": "&quot;24 hours&quot; is a First Person Shooter where you plays as an intrepid marine. You will fight against evil powers save people precipitated in a lair of chaos.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/485580/header.jpg?t=1538951951",
    "minimum_requirements": "OS: Windows 7 64 bit Processor: Intel Core i3 Memory: 6 GB RAM Graphics: GeForce GT 730 Storage: 5 GB available space",
    "recommended_requirements": "OS: Windows 7 64 bit Processor: Intel Core i5 Memory: 8 GB RAM Graphics: GeForce GT 730 Storage: 5 GB available space",
    "reviews": [
        {
            "review_text": "Name of icon is MyProject06, so someone created this by 6th attemp, and it suck. No ambient music, only one sound - extremly loud shoot of gun. Two enemies - Burning skulls and black skulls. There is only one map, where you can easly get out of the 'safe zone'. There is no story, simply you spawn and shoot, go forward and shoot and go to green light, and then, it's end of the game. Ending is just simply main menu.  This game is bad, I did not recommend. Why is it on Steam? ",
            "review_score": "-1"
        },
        {
            "review_text": "'24 HOURS' is FPS horror game. I see no reason to like '24 HOURS' all you have to do is shoot infront of you. Only 1 sound in game... your gun. Why? To win the game you need to get into green thing I did it in 13 minutes. Only reason to buy this game are cards. I think game was created in 24 hours that's why it's called '24 HOURS'. I hope valve will give me my money back.",
            "review_score": "-1"
        },
        {
            "review_text": "bad, refund this if bought",
            "review_score": "-1"
        },
        {
            "review_text": "Seriously!? This is sold as a game?! This might as well have been a high school kids computer project. And I'd give that kid a C-. I beat it in just over 5 minutes. I guess I only paid a quarter for it, but I still think that's almost too much.",
            "review_score": "-1"
        },
        {
            "review_text": "Cheap badges.",
            "review_score": "1"
        },
        {
            "review_text": "Nice game",
            "review_score": "1"
        },
        {
            "review_text": "really good game,wanna play all time in this game",
            "review_score": "1"
        },
        {
            "review_text": "  Well where to start?  I now actually believe my friend hates me a whole heap for giving me this walking simulator with a gun that spews crummy looking lazer bullets to the tune of a capgun! There is litrally only one sound and thats the aforementioned capgun! compleatable in under 10 mins I could have killed myself faster.  Oh there's a bake option in the graphics settings go figure I can bake my eyes in pixelated horror!",
            "review_score": "-1"
        },
        {
            "review_text": "I paid 17 Cents, so I expected nothing. I got Steam Trading Cards. 10/10, exceeded my expectations.",
            "review_score": "1"
        }
    ]
}