{
    "app_id": 485570,
    "name": "Milford Heaven - Luken's Chronicles",
    "release_date": "2016-06-10",
    "developer": [
        "CGGAMES"
    ],
    "publisher": [
        "CGGAMES"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Indie",
        "RPG",
        "Adventure"
    ],
    "achievements": 0,
    "positive_ratings": 27,
    "negative_ratings": 14,
    "price": 0.79,
    "description": "Milford Heaven, a small medieval village, is under attack!! Won't you do nothing? Luken's castle is filled with treasures! Come, help the villagers, loot Luken's castle and became as rich as you have never dreamed before!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/485570/header.jpg?t=1474981843",
    "minimum_requirements": "OS: Windows 7 Processor: Intel i3 Memory: 2 GB RAM Graphics: Intel HD Graphics DirectX: Version 10 Storage: 150 MB available space Sound Card: IDT High Definition Audio CODEC",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I suppose I'll give this a kind of hesitant thumbs up...  The game on its own is pretty fun, just going to different screens and rapidly clicking all the enemies until they're dead.  The assets certainly aren't new or spectacular, but I think they still look pretty nice.   A thing I really dislike is the fact that health is so limited. Even the biggest potion only restores 10 points of Health, which is roughly 2 or 3 enemy hits. The only ways to restore health are through potions or leveling up. That means that if you lose too much health early on, you'll be unable to get any further and have to start over. The fact that potions are ridiculously expensive doesn't help that either.   It would just be so much less mind-wracking if the game had something like floors that you'd have to do in one go after which you could save and heal somewhere.",
            "review_score": "1"
        }
    ]
}