{
    "app_id": 485650,
    "name": "Campaign Clicker",
    "release_date": "2016-10-05",
    "developer": [
        "Springloaded"
    ],
    "publisher": [
        "Springloaded"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "In-App Purchases",
        "Partial Controller Support",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Casual",
        "Free to Play",
        "Indie"
    ],
    "tags": [
        "Free to Play",
        "Indie",
        "Clicker"
    ],
    "achievements": 11,
    "positive_ratings": 172,
    "negative_ratings": 204,
    "price": 0.0,
    "description": "Democrats Vs Republicans! It's the political battle of the decade!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/485650/header.jpg?t=1555898226",
    "minimum_requirements": "OS: Windows XP Processor: 1 GHz Memory: 1 GB RAM Graphics: 128 MB Video RAM, capable of Shader Model 2.0 DirectX: Version 9.0c Network: Broadband Internet connection Storage: 64 MB available space",
    "recommended_requirements": "OS: Windows 7, 8, 8.1, 10 Processor: 2 GHz Memory: 4 GB RAM Graphics: 256 MB Video RAM, capable of Shader Model 2.0+ DirectX: Version 9.0c Network: Broadband Internet connection Storage: 64 MB available space",
    "reviews": [
        {
            "review_text": "This is pretty much a giant leap backwards for idle clicker games. First off it is P2W. Let me explain: -Each campaign lasts 24hours. -After each campaign there will be a scoreboard for the highest scoring player. (pseudo competetive) -Each campaign (24h) has a limit of 5 boosts. (ranging from X more votes per click / sec. etc. etc. you know the drill) -With a single payment you have unlimited acess to those boosts. (Hence P2W in a pseudo competetive game)  Secondly: -8bit graphics, totally retro bruh (♥♥♥♥ off you lazy ♥♥♥♥) -Nothing UI or gameplaywise is innovative -Lacks so much more options the rest of the idle games already have implemented  If that's not enough, play the game and see for yourself pay a few cents and climb to the #1 spot because why play the game when you can pay the game to play it for you, eh? Game developer do not want people to play their game and eventually make a living out of it now they want your money and happen to be game developer. But nowadays who isn't an indie dev, eh?  I am well aware that developer have to eat and feed their children. But if your microtransactions give you a enormous advantage (borderline cheat) like that, you and your offspring are better off starving. R.I.P. Harambe  Edit 1: to those who chose to be and identify as mentally challenged:  Let me do the thinking for you because apparently it hurts you a lot when you even try.  Example A.: Dude A spends money on the game and buys multiplier and has acess to INFINITE amounts of boosts. Dude A can therefore kickstart his placement in the leaderboards of each campaign (every 24 hours) as if he was playing for days / weeks and easily reach the no. 1 spot.  Example B.: Dude B doesn't spend money on the game and plays it like the GAME ALLOWS HIM TO. Meaning he has to wait 24 hours until he can get his 1 (one , O N E) multiplier and is limited to 5 boosts each campaign (5 boosts within 24 hours). After each campaign Dude B is ♥♥♥♥ed and not even mentioned he exists on the leaderboards because the whales are circlejerking around.  In conclusion: the game is P2W.  Does the leaderboard matter? To me? No. To other people it might be the only thing left that gives them a hard on seeing themselves on a leaderboard of ~400 players because they have spent money with a flick of the wrist. What does it matter if someone loses the game? If they have lost because someone else pays off the jury, then it's cheating in this case P2W.  This review is by no means a 'stop enjoying what i don't enjoy' this is a 'BEWARE! P2W AHEAD' warning. I cannot possible tell people what to do or not to do. All I am saying is that it is POSSIBLE to pay extra money to come ahead of other players. Which in itself is discouraging for a lot of people.  What's sad is that this game came out on steam when the election is in its final stage and if the worst outcome truly emerges then we will witness the season finale of the United States of America and a bunch of crooks make a quick dime for a simplified product.",
            "review_score": "-1"
        },
        {
            "review_text": "It is unclear how you are to progress in the game. Each game lasts 24 hours of real world time and not game time, so you are punished for having a life outside of this basic clicking game. ",
            "review_score": "-1"
        },
        {
            "review_text": "Harumm, There isn't much for balance, The upgrades are borderline pointless and it's just another mindless clicker game.  Frankly the boost system is aggravating, there are 2 good boosts and the rest are just piles of garbage in the long run. Hope you like waiting for them to spawn and getting a click shower when you really needed fight unemployment!",
            "review_score": "-1"
        },
        {
            "review_text": "This gigantic turd of a game is the bane of the idle gaming industry. It's like the developer was running low on moola and decided to drop this big fecal junk into steam, I mean, come on dude, this game is lacking soo much content and the graphics are ♥♥♥♥ too, but what can you expect from someone who decided it was a good idea to charge for what it would seem to be just a scoreboard boost, shame on this dev, the poor soul just lost so much credibility with this ♥♥♥♥. Anyway, it's free so theres something, you could play it to see a good example of what not to do when you finally decide to make an idle game yourself. Cheers",
            "review_score": "-1"
        },
        {
            "review_text": "Poorly balanced auto-click ability tree. UI doesn't give good info like VPS/level or the even more valuable VPS/($*level)  Edit: I mean most games have that as a hover window or right on the button what the VPS is, not hiding one window in. Also the balance of items going from .1 VPS/level -&gt; .5 VPS/level -&gt; .6 -&gt; .7 -&gt; .8 -&gt; 1.0VPS/level is really little progression for item tiers.",
            "review_score": "-1"
        },
        {
            "review_text": "Campaign Clicker is one of the newest clicker styled games in the over-saturated market that spawned since the monumental success of AdVenture Capitalist. This particular title centers around the fad of the popular United States election current event. It's a battle of Democrats versus Republicans, and you get to choose the side that you want to be on. There are even unlockable candidates that can be purchased with in-game coins, that are obtained through campaign victories.  The general idea is that the more clicks you make, the more votes you get. You can make your clicks count for more votes by spending votes on fingers, which you can have up to 100 of; effectively making each click worth 100 votes by the time it's fully upgraded. You can also spend votes on upgrading your campaign, such as buying more billboards, newspaper ads, social media experts, etc.; these go towards upgrading the amount of votes you get per second. Each campaign lasts for a full 24 hours, in which time you will need to earn a staggering 323,214,999 votes to win. Upon winning you get 10 coins that will unlock new campaign characters.  Campaign Clicker is by far one of, if not the worst, entry into the newly founded clicker genre. The content is boring, the gameplay abysmal at best, and the pay to win model unforgivable. In fact when the game first announced that I could buy boosts and multipliers, it popped up right in the middle of the screen and I nearly accidentally purchased a $4.00 USD boost. Without these boosts, winning the campaign is nearly impossible, even with the aid of an autoclicker. You do start each campaign with some free boosts, but you can only use five in the course of 24 hours.  If you don't care so much about that, take into account that the game CONSTANTLY freezes, becomes unresponsive, and crashes; even when just idling and not clicking. Occasionally these faults cause you to lose a large chunk of votes that you've accumulated. I initially downloaded this to idle it for the card drops, which is proving problematic in itself. So even if you're like me, and you just want to get some trading cards, you may want to think again since merely idling is troublesome. If you're a fan of clickers in general, this one is horrific in every way imaginable. Just steer clear.   Rating:  0.5/5.0  - Abysmal, avoid it like the plague.",
            "review_score": "-1"
        },
        {
            "review_text": "What's more pointless then stealing free things?  Putting microtransactions in a clicker game.",
            "review_score": "-1"
        },
        {
            "review_text": "Scale for benefit of upgrade vs. price of upgrade is insane. Where other clickers has upgrades that go like 0,1, 1, 10, 20, 50, 100... clicks per second on different levels of upgrades, this one has 0,1, 0,5, 0,8, 1... and prices for for upgrades are insane considering how slow you get clicks. Manual clicking also can be improved... in increments of one and those get insanely expensive fast, so even clicking macros won't help you here.  Terrible terrible clicker with some money-grapping microtransactions. It's like developer has heard of clickers but doesn't know math and has no understanding why people play clickers.",
            "review_score": "-1"
        },
        {
            "review_text": "Crashes at launch. Specs: Core I5 4460 GTX 960 2GB 10gb RAM Windows 10",
            "review_score": "-1"
        },
        {
            "review_text": "wtf , just why?  i am not even american.",
            "review_score": "-1"
        },
        {
            "review_text": "Tabbed out to check the achievements and the game crashes, that's a good sign of a game. It's so good it makes Valve look good, 10/10",
            "review_score": "-1"
        },
        {
            "review_text": "No 'Save Game' via Steamcloud.",
            "review_score": "-1"
        },
        {
            "review_text": "it wouldn't even LET me play the game.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a very addicting clicker that stands out from the rest. I love every bit of it and it would be a great tradition to play it around election time every four years! I really love the game so don't expect to follow that tradition.",
            "review_score": "1"
        },
        {
            "review_text": "So far the game has been pretty cool. Alot of comments on the game being pay to win. Which is true I guess. I spent .50 cents on unlimited boosts and got a landslide on second try. But most games want you to spend ALOT MORE on things you want in-game. Just wanted to point that out. (.50 cents) LOL..... Anyway the focus on the game should be V.P.S. which is votes per second. If you dont focus on upgrades you will lose. Unlimited boost will randomly give you upgrades or you can buy them but they get pretty expensive. I suggest buying them early then later. and also in the upper right hand coner of screen is a yellow triangle symbol click that to buy 2x multiplier. don't worry doesn't cost real money. I had a VPS of 45,218 x2 was 90,436 votes per second. I was getting 325,569,600 votes per hour. had a total vote count around 1.3- 1.4 billion. and on second try. thats gotta be pretty good. no cheats no mods I swear. so just focus on VPS and you should do well.",
            "review_score": "1"
        },
        {
            "review_text": "Works like a charm and I like the quotes popping up - taken from real speaches the candidates have made.",
            "review_score": "1"
        },
        {
            "review_text": "this is really fun am not gonna lie buuuut it can get boring REAL FAST i recommed using an auto clicker",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good I guess",
            "review_score": "1"
        },
        {
            "review_text": "a cookie clicker rip off cause we needed another one of those i rate 4/10",
            "review_score": "-1"
        },
        {
            "review_text": "its good actually",
            "review_score": "1"
        },
        {
            "review_text": "So lets see. 8 bit graphics I mean come on put some effort into the game. P2W, yep nagware every time possible trying to get you to buy your way onto a leaderboard. Did I mention the poor graphics? Can only use the boost once in a 24 hour period unless of course you pay for infinite boosts. Somthing about those graphics again, Just not doing it for me.",
            "review_score": "-1"
        },
        {
            "review_text": "THIS ♥♥♥♥ IS BROKEN YOU ♥♥♥♥ING IDIOTS YOU NEVER MAKE THE WINDOW MOVEABLE MAKE IT MOVEABLE OR MAKE IT SO THAT THE ♥♥♥♥ING GAME FITS THE DISPLAY AND NOT MAKE US DO IT MANUALLY IT IS VIRTUALLY UNPLAYABLE",
            "review_score": "-1"
        },
        {
            "review_text": "This is one of the best games I've played in years, and it didn't cost me a dime! It just goes to show that you don't need to look for those $60 price tags to find very high-quality, fun games anymore. Somebody call the newspaper; free games are fun now!  Extremely reasonable upgrade fees. For only $5.99 you can get 5 multiplier tokens (essential) and for $0.49 you are permitted to use the on-screen upgrades. Other games charge you ridiculous amounts to use the on-screen upgrades. 50 cents? That's chump change (or should I say TRUMP change LOL)  On top of being addicting and fun, this game is a great educational resource. I learned how campaigning works through the game's intricate campaign click strategy algorithms. You have to decide how to spend your votes in order to optimize making more votes. Do you want to run a grassroots campaign or save up for social media clicking. It's more expensive, but it will allow you to get your message out to more voters. It's not as simple as it sounds!  Game features that you simply WILL NOT find in other games: - Cartoons of today's leading politicians - GREAT soundtrack - Pro-Israel  Why are you still reading this? GO DOWNLOAD IT RIGHT NOW!",
            "review_score": "1"
        },
        {
            "review_text": " ",
            "review_score": "1"
        },
        {
            "review_text": "where is the delete button?!",
            "review_score": "-1"
        },
        {
            "review_text": "While i was messing around to make the screen full sized i could reach the options button to change the settings back. Fun game thats a problem.",
            "review_score": "-1"
        },
        {
            "review_text": "this game is ridiculously greedy. they want u to buy stuff. i would ask 4 a refund if it wasnt free. dot waste your time with campaign clicker. i for sure regretted getting it.",
            "review_score": "-1"
        },
        {
            "review_text": "it ♥♥♥♥ing sucks i cant play it",
            "review_score": "-1"
        },
        {
            "review_text": "I Like the Idea Of a Trump v Clinton Campaing game but this is the right style of it. Oh. ... ok well if it's a cliker I'm not expecting anything fancy but in future time something like this where it is more graphical and more story to it not like this where you click your way to the White HOUSE.  Overall: Ok Game Not Many Things To be excited about.",
            "review_score": "-1"
        }
    ]
}