{
    "app_id": 485760,
    "name": "Legend of Numbers",
    "release_date": "2016-06-02",
    "developer": [
        "YFC games"
    ],
    "publisher": [
        "YFC games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "In-App Purchases",
        "Steam Leaderboards"
    ],
    "genres": [
        "Casual",
        "Free to Play",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Casual",
        "Free to Play",
        "Indie"
    ],
    "achievements": 0,
    "positive_ratings": 52,
    "negative_ratings": 16,
    "price": 0.0,
    "description": "Experience Legend of Numbers, the one of a kind match-3 game that is both new and revolutionary. one that you’ve never seen before!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/485760/header.jpg?t=1519962124",
    "minimum_requirements": "OS: Windows XP or Later Processor: Intel Core™ Duo or faster Memory: 2 GB RAM",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "If you like gritty, serious games that shine a light on the flawed reality we call real life, you should consider this free-to-play title. It is, albeit unintentionally, a perfect metaphor for existence.  Gameplay centers around matching three or more of the same number, a mundane, repetitive task, just like real life. You are given objectives to complete, just like real life, and a limited amount of turns in which to complete them, just like real life. These turns symbolize the rapidly passing minutes in each hour, hours in each day, days in each year, years in each life. These similarities may seem trite to you, but I haven't gotten to my point yet.  Gameplay that may seem satisfying at first becomes less and less enjoyable as time goes on. Just like life, it gets harder, and as it gets harder, you realize how arbitrary and unfair it can be. The sheer amount of luck involved becomes more apparent as you progress, and are given less room to fail. Often you will be put in circumstances where the only moves open to you do nothing to help in your objectives, and only serve to waste the limited opportunity you've been given, but the alternative is to do nothing. Earlier in the game, you had excess available moves, and could afford to waste them. Now you cannot.   I am not one to believe that the universe is completely random. Making smart decisions increases your chances of success, and making stupid decisions increases your chances of failure. Just like real life, though, in this game you can often make all the smartest decisions available to you, and still fail, because of the conspiring of circumstances. Whether these circumstances are procedurally generated (evolution), or the work of the unseen devs (a Creator Deity), they can render your efforts useless, and make it seem as if hard work is not worthwhile. This is nonsense, and I will tell you why.  While you are not always given opportunities to succeed, sometimes you are, and if you are not ready for those opportunities, you will not be able to take advantage of them. Sometimes life conspires against you, and though you do the best anyone could do, you fail. Rarely, you are given copious opportunities, allowing you to make big mistakes but still succeed in the end. This is less common as you progress through the game, just like real life. But the most common opportunities for success are narrow openings. You are given the chance to succeed, but in order to do so, you must do everything right. Any failures on your part are fatal to your efforts. This is different then the circumstances in which your efforts are meaningless, in which success is impossible; in these instances, success is possible, but. very. difficult. Just like real life!  As in real life, if you have capital available to you, you are able to buy your way into having more of a chance at success. Also like real life, you can spend your capital and still fail, if circumstances are strongly against you, or if you make poor decisions regarding the opportunities you've been given. In a delightfully self-aware statement, the developer has made it so that real-life money is the capital used to give oneself an advantage in their simulated reality. Truly an artistic irony.  What is the moral of this game, and this review? Nothing in life is completely random; by making good decisions, you'll get farther than by making asinine ones. But there are always elements outside your control, that will turn the best laid plans into paper mache. You simply must, if you hope to progress, always act as if making good decisions matter, because eventually it will, and when it does you must be prepared to make such decisions. I'm about to make a good decision now. I'm uninstalling this game.",
            "review_score": "-1"
        },
        {
            "review_text": "OMG YES THIS GAME IS SOOOOOOOO GOOD. THEY SPENT A LOT OF GREAT TIME ON THIS AMAZING GAME ITS SO MUCH BETTER THAN STUFF LIKE COD AND UNDERTALE... OMG YES THANK YOU!... JUST YES! YES YES YESY YES YESYSYESYEYSYE YES!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "I love the variety of challenges per level. There are a few levels that took many lives, and quite a few boosters, to help me succeed. I found the timed levels to be the msot challenging. I've currently achieved level 111 and am patiently waiting for the designers to create more levels to challenge me!",
            "review_score": "1"
        }
    ]
}