{
    "app_id": 486360,
    "name": "Timore Inferno",
    "release_date": "2016-06-02",
    "developer": [
        "Vidas Salavejus"
    ],
    "publisher": [
        "Vidas Salavejus"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Horror"
    ],
    "achievements": 0,
    "positive_ratings": 188,
    "negative_ratings": 123,
    "price": 3.99,
    "description": "Timore Inferno is the 4th indie horror game in the Timore series. Strange visitors have come to a little girl's house, robbing her home and killing everyone inside... Except her. With dolls holding the anger of her loss, everyone who tries to go there and investigate what happened wind up missing.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/486360/header.jpg?t=1491768525",
    "minimum_requirements": "OS: Windows® 7/Vista/XP Processor: CPU Intel® Pentium® 4 2.0 GHz Memory: 2 GB RAM Graphics: 512 MB DirectX: Version 9.0 Storage: 320 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "  SUGGESTION BUY THE GAME DONT LOOK AT ANYTHING! personally i downloanded every single game i have on steam and go trough all of them i tought it something like story but nop its horror its much more entertaiming and fun going in without knowing anything what is it going to be.  I will try to express how i felt in the game in long story short. The games rating is i have to say 9/10 and the price os okay,  Pros: +Its fun and scary to play no matter what +Has pretty good sounds +One of the best Horror Games +Everything in the game is good for a horror game there is nothing bad with it.  Cons: -Sometimes curssor goes outside of screen when you play  Overall: The game is so freaking good i have no words i usally never get jumpscared but here it jumpscared me multiple times i woud suggest this to everyone!",
            "review_score": "1"
        },
        {
            "review_text": "Another unity horror for &lt;insert your favorite youruber here&gt;.",
            "review_score": "-1"
        },
        {
            "review_text": "  Not worth your time even if you got it for free. Just remove it from the store.",
            "review_score": "-1"
        },
        {
            "review_text": "  Pretty cool indie horror game.",
            "review_score": "1"
        },
        {
            "review_text": "  That little alien dude is cute",
            "review_score": "1"
        },
        {
            "review_text": "  Thanks you for Vidas Salavejus was make this game, but some sound is loud so you can update menu to change sound, 8/10",
            "review_score": "1"
        },
        {
            "review_text": "FIRST!! YAY! haha  Pretty nice indie horror game. At first some of the mechanics in the game looked a bit weird (especially the way that axe moves) but oh well, it's an indie game and I'm happy that more and more indie developers get a chance to sell their production on steam.  overall 7/10, but as it costs only 5 euro, I'd say it has good enough content for the price.",
            "review_score": "1"
        },
        {
            "review_text": "Do not waste your money on this 5$ omfg",
            "review_score": "-1"
        }
    ]
}