{
    "app_id": 486480,
    "name": "Tales of Destruction",
    "release_date": "2016-07-14",
    "developer": [
        "Tero Lunkka"
    ],
    "publisher": [
        "Tero Lunkka"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "FPS"
    ],
    "achievements": 0,
    "positive_ratings": 21,
    "negative_ratings": 93,
    "price": 1.59,
    "description": "Tales of Destruction is Steam's newest FPS game fresh from Greenlight. TOD currently comes with 9 maps + 1 Open World and 2 weapons. You will be tasked to complete each map. There is pick-ups like ammo &amp; health kits.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/486480/header.jpg?t=1491291972",
    "minimum_requirements": "OS: Windows 7 Processor: Core i3, 2.10 GHz Memory: 4 GB RAM Graphics: NVidia GeForce 820M Storage: 3 GB available space Sound Card: Direct x9",
    "recommended_requirements": "OS: Windows 8 Processor: Core i7, 3820 3.6 GHz Memory: 8 GB RAM Graphics: NVIDIA GeForce 470 GTX Storage: 4 GB available space Sound Card: Direct x9",
    "reviews": [
        {
            "review_text": "Mm. Boy-no-boy do I wanna just go off on the creation team(assuming).  10 minutes in, no options menu, gotta do everything through console. Mouse doesn't bind to window and doesn't work in game unless aiming down sight. The worlds look alright to be in, no multitude of weapons or real features. Game looks like it was made within 6 hours in Hammer and just mild scrips thrown about.  Steam's gotta work on what comes through them pearly gates onto this fabulous DRM.",
            "review_score": "-1"
        },
        {
            "review_text": "The worst game ever. If this game even for free I would never add it to my steam account, I wish if I get my money back.",
            "review_score": "-1"
        }
    ]
}