{
    "app_id": 48720,
    "name": "Mount & Blade: With Fire & Sword",
    "release_date": "2011-05-03",
    "developer": [
        "TaleWorlds Entertainment"
    ],
    "publisher": [
        "TaleWorlds Entertainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Achievements"
    ],
    "genres": [
        "Action",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Open World",
        "Action"
    ],
    "achievements": 21,
    "positive_ratings": 6236,
    "negative_ratings": 1055,
    "price": 7.99,
    "description": "The standalone expansion for Mount &amp; Blade! With Fire &amp; Sword builds and expands upon the highly regarded combat system from Mount &amp; Blade: Warband. Firearms have been introduced to the battlefield.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/48720/header.jpg?t=1511540500",
    "minimum_requirements": "OS: XP/Vista/Windows 7 Processor: 2.1Ghz or higher Memory: 1.2 GB Hard Disk Space: 900 MB Video Card: 128 MB+ Sound: DirectX Compatible Sound Card DirectX®: 9.0c",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": " New? &gt;Ride to nearest city &gt;Find a lord in the castle &gt;'Quest pls' &gt;Lord asks you to collect his taxes from his town and he will give you a share &gt;Accept &gt;Collect taxes &gt;Never see that Lord again  10/10 would rob again",
            "review_score": "1"
        },
        {
            "review_text": "A great medieval open-world game just like Warband, but this time with pistols, rifles and alot of other new content. I really love the concept of this game and I would really recommend it to anyone.",
            "review_score": "1"
        },
        {
            "review_text": "Never changes, from rags to riches then back to a prisoner again.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great Mount &amp; Blade game although i still prefer Warband version because of better multiplayer and more challenges/missions, but this is a must-play game if you like this series.",
            "review_score": "1"
        },
        {
            "review_text": "&gt; A Russian Warlord tells me to collect some stuff from Moscow and deliver it to another Russian Warlord  &gt; I go to Poland  &gt; I sell the things for 4000 gold  &gt; I stole 4000 gold from Russia  I now plan to create a huge army, take over Russia and Ukraine and reunite the Soviet Union",
            "review_score": "1"
        },
        {
            "review_text": "Here's the thing - if you're looking for the best mount &amp; blade to buy and can only afford one of them, this is, sadly, not the choice to make. I love this game but Warband is the superior one, although this one has guns for the campaign, the gameplay is better and warband and there's just not anything new here. I enjoy both of the games, but this game does lack in comparison.   Now is it a bad game? Hell no. I love using a two-handed claymore one minute and switching to a pistol for the next wave of enemies, and having a group of 100 men with nearly all of them using muskets is so satisfying when you can watch them shoot down the entire enemy group. If you can afford both mount and blades grab both of them, and while you'll throw more hours into the other, you'll get a great amount of game time and fun from this one as well to make your purchase worth it. Just wait for a sell first.",
            "review_score": "1"
        },
        {
            "review_text": "It's what people are trying to make out of ArmA - realistic and unforgiving RPG sandbox with fortresses and stuff. Only this one goes with swords and caravans. U buy it.",
            "review_score": "1"
        },
        {
            "review_text": "It is a very good expansion to the Mount &amp; Blade series! Although the Napoleonic Wars DLC trumps this one in popularity, it is still worth the money to buy this DLC.  The Multiplayer has very few players (One or two active servers with a few dozen people) and in my opinion is ok compared to Native M&amp;B Warband. However, there is no focus on ranged over hand-to-hand combat as both are used no matter your preference. There's archery, musketry, swords, shields, spears, crossbows, etc., etc.  The part I really like is the Singleplayer campaign, despite it being similar to the other DLCs. I just have a liking to this one in particular over the others for some reason, probably the guns (Since Mount &amp; Blade Vanilla and Native Mount &amp; Blade Warband don't have guns :D)  If you've played another Mount &amp; Blade game or like Medieval and/or historical games, here's another one for the collection!    Thanks for reading! Check out these other links!   My Curator Group   Other Game Reviews ",
            "review_score": "1"
        },
        {
            "review_text": "Mediocre compared to Warband, feels unfinished. I would only really recommend if you have a fetish for muzzle loading weapons and people standing in rows, in which case it can be a lot of fun.",
            "review_score": "1"
        },
        {
            "review_text": "Not as good as Warband but still good.",
            "review_score": "1"
        },
        {
            "review_text": "although below average graphics, a great fast paced multiplayer and decent campaign. better than warband anyway. looking forward to bannerlord",
            "review_score": "1"
        },
        {
            "review_text": "Oh my god. This game is ♥♥♥♥ing amazing!!! I suggest everyone to buy it. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Good game. but it would of been better if they added more things to it.",
            "review_score": "1"
        },
        {
            "review_text": "Another excellent game in the Mount &amp; Blade series. This one really brings the setting of Henryk Sienkiewicz's novel, Ogniem i Mieczem (With Fire and Sword) to life. Step into 17th century Eastern Europe and play one of the best historical RPGs/battle simulators on the market!",
            "review_score": "1"
        },
        {
            "review_text": "Gosh, I will start this review with one sentence...no, better, one INQUISITION, YOU, YES, YOU, you there sitting on this chair, YOU. WILL. BUY. THIS, GAME. this game it's just...man...it's just the game, I mean it's warband, but with way improved well...'diplomacy' I guess I can put it in this way, and some handy options, as for example you can speak with the elder of a village just clicking with one button, instead of doing all that work to do so as in warband, I mean, don't get me wrong, Warband it's a damn awesome game and i'm not trying to say which is better, but this game as I have said is almost the same as warband...Oh and of course RIFLES and BOMBS",
            "review_score": "1"
        },
        {
            "review_text": "It feels like they shoved the Original Mount &amp; Blade forward into time into the gunpowder age. While the guns can almost always kill someone on the first try, the trick is trying to not miss, as the gun takes a good deal of time to reload. Also, most armors with a defense of +10 or higher are expensive and harder to obtain, making it vital to avoid being shot at. The implementation of bar fights, caravan hiring system and diseases really adds into the game that I feel like the original should have had. Addicting and highly enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "Don't buy this game. Even though this was made at a later date than Mount &amp; Blade: Warband, buy Warband instead. It's a lot better and is worth the extra dollars if you are deciding to get this game anyway.",
            "review_score": "-1"
        },
        {
            "review_text": "the mount and blade serise is pretty fun as long as you can get past all of the aweful expansions",
            "review_score": "1"
        },
        {
            "review_text": "Very good game but I prefer mount and blade war band over fire and sword",
            "review_score": "1"
        },
        {
            "review_text": "It's a Mount and Blade game. Need I saw more? This entire series is a masterpiece. Great story, amazing gameplay, easy to learn - hard to master. Almost everything in this game is perfect. I prefer the 1600s setting over Napoleonic Wars. But like other great games - it's only good because the positives overlay the negatives. By god, there's a lot of them. - Crashes: The game crashes often. It's not really a graphics issue, it happens when interacting with an NPC. Even still, without crashing, clicking dialouge options often drops FPS waay low. - Hit Detection: Guns are the main selling point of this game. And they suck. More often than not, bullets go straight through enemies. Trying to hit anything below the abdomen is a surefire miss. - Siege: Sieges 'glitch' out a lot. Once you've pushed pass the wall, you head down to engage the enemy... and there's an invisible wall! The AI just sits back behind this wall - none of your soldiers can hit them, they don't charge, and you can only use what's left of bullets/arrows to take them out. Then retreat, loose morale and have your soldiers suck even more. - AI: They can be stupid sometimes. AI is hard to program - I don't blame 'em. - Music: The music is buggy as hell and likes to-o r-r-r-re-n-n-ot-t-tesic-c-ch is an-n-n-nin-ng as h-e-e-e-ell. (to repeat notes which is annoying as hell)  Don't let these cons fool you - this game is amazing. However, some players may get annoyed by these glitches, so be cautious",
            "review_score": "1"
        },
        {
            "review_text": "Pros: Poland.  Sweden.  Mount and Blade.  Interesting campaign/storyline and weapon/armour selection. Cons: Very weird interface-backround colour when compared to it's predecessors', and this annoys me greatly.  Guns are a bit too OP.   No options to select your backround, like M&amp;B and M&amp;B:Warband had.  Dull gameplay when not in battle.  Overall I must give it 8/10. While it's a pretty bad game compared to those before it, it is alright as a standalone. I did not rate it as standalone though, if I did it would achieve an 11/10. The fact that Poland was in the game made it very amazing.  Poland Poland Poland Poland  You know you love Poland...",
            "review_score": "1"
        },
        {
            "review_text": "Way, way too much castration.",
            "review_score": "1"
        },
        {
            "review_text": "So far as ive lpayed, a decent game, though it is very different from the rest of M&amp;B.  I'd put it at 6.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Mount and Blade: With Fire and Sword is a great expansion to the classic Warband game. Not only does it add guns, but a whole new map and story too. New mechanics and crisp gameplay make this another well done experience. Must buy for Warband fans.",
            "review_score": "1"
        },
        {
            "review_text": "&gt;multiplayer &gt;take musketeer &gt;a regular pistol &gt;headshoting from spawn to spawn 10/10 would snipe again",
            "review_score": "1"
        },
        {
            "review_text": "A very different game from the previous Mount &amp; Blade games. Some changes not so good. But the biggest good, or interesting change at least, is the addition of firearms. It really changes how combat works, especially early on it can be quite difficult. It definitely provides a new experience and I think it is worth trying. Really changes the combat. I think in terms of whether that change is good or not, will differ greatly from person to person.   If I had to choose my top Mount &amp; Blade game it would be Warband. This one has removed the arenas and tournaments from the game, which I think they should have kept. However this is still a fun game, and the other changes make it worth trying out.",
            "review_score": "1"
        },
        {
            "review_text": "Fun Med-Evil Warfare Combat  Swords  Spears  Bows  Axes  Plus Much More  This game takes a bit of time to learn how to play , After you learn how to play its a very fun game to play  This is a game that will took up a lot of youre Game-Play Time this game is very fun and a good challenge The Online is fun to play with a group of friends it makes for some good times , some good laughs , and Fun to be had.  I Give this game an 92/100",
            "review_score": "1"
        },
        {
            "review_text": "its fun but they keep releasing new titles and never seem to finish one, prefer warbannd its got more mods",
            "review_score": "1"
        },
        {
            "review_text": "this is the best game ever even better than warband ",
            "review_score": "1"
        },
        {
            "review_text": "Well, I have to say it's fantastic and magic in some ways.I love this old game very much !",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this as it is very fun to play and you can do a lot of stuff on it. Mount &amp; Blade games are good because they are different to other games. Although some people might find it boring, I think you can spend a long time on it because there is singleplayer and multiplayer. Obviously people will mostly go on multiplayer, multiplayer is more challenging than singleplayer. Fire &amp; Sword is also quite realistic because in some games you can shoot people in the head and they don't die, but with this game they will die if shot with a gun or bow in the head. I would rate 9.5/10 because of the sheer lack of graphics, but that dosen't really interfere with gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "A very different game from the previous Mount &amp; Blade games. Some changes not so good. But the biggest good, or interesting change at least, is the addition of firearms. It really changes how combat works, especially early on it can be quite difficult. It definitely provides a new experience and I think it is worth trying. Really changes the combat. I think in terms of whether that change is good or not, will differ greatly from person to person.   If I had to choose my top Mount &amp; Blade game it would be Warband. This one has removed the arenas and tournaments from the game, which I think they should have kept. However this is still a fun game, and the other changes make it worth trying out.",
            "review_score": "1"
        },
        {
            "review_text": "this is a really good game, but if you're a fan of Mount&amp;Blade games don't get this one, get Mount &amp; Blade Warband &amp; Napoleonic Wars first and then get With Fire &amp; Sword if it's in discount.  The only bad things in this game it's that is harda s f#ck cuz' of the ♥♥♥♥ing dudes poppin' yo' ♥♥♥ up.  But still, good story, good gameplay and good graphics. 11/10 ign.",
            "review_score": "1"
        },
        {
            "review_text": "HELL YEAH ♥♥♥♥♥ this ♥♥♥♥ is what i was talking about i get guns kill ♥♥♥♥♥♥♥ and ♥♥♥♥ and pillage castles for homney and oats and ♥♥♥♥ then i go to a kingdom kill da king eat his children and i get to train my ♥♥♥♥ing digimons in my mansion and if you kill like 30 ♥♥♥♥♥s at once you get to be on cribs and ♥♥♥♥ so why dont you man up and PIRATE this game GET IT? cuz theres NO ♥♥♥♥ING PIRATES  TERRIBLE GAME DO NOT BUY 0/10 SAVE YOUR MONEY FOR DRUGS AND GUNS",
            "review_score": "1"
        },
        {
            "review_text": "This game is nice ! :D",
            "review_score": "1"
        },
        {
            "review_text": "Mount &amp; Blade: With Fire &amp; Sword simply classic.",
            "review_score": "1"
        },
        {
            "review_text": "Mount &amp; Blade: With Fire &amp; Sword simply classic.",
            "review_score": "1"
        },
        {
            "review_text": "I bought Mount &amp; Blade: With Fire &amp; Sword, and I didn't recieved fire or sword yet.",
            "review_score": "1"
        },
        {
            "review_text": "My least favorite part of the game is the map. It has very few landmarks. I liked the feel of the warband map where you had different kinds of terain. It is all flat and bland in with fire and sword. But hey, guns.",
            "review_score": "1"
        },
        {
            "review_text": "You can drink alcohol with Pan Zagłoba and make Poland great again. 9/11 Higly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "i like this game. mostly becouse the weapons and the map of central Europe and the base of the game",
            "review_score": "1"
        },
        {
            "review_text": "Main questline is somewhat lazy and kind of disappears. Game has less content than some free community made mods yet costs 10 dollars for some reason. The Eagle and the Radiant Cross or it's submod have probably the same amount or more of content and is completely free. There's also a wide variety of mods that go above and beyond like Gekokujo, Floris, Pendor, Brytenwalda, Anno Domini, and much more yet this expansion doesn't really seem to bring anything to the table like the other two expansions. Very uninteresting map, lacks detail and makes the eastern european theme very drab. All in all not really worth buying imo. Napoleonic Wars and Viking Conquest are far superior expansions while this just feels like a community mod. If it was made by a fan I'd give it a 8/10, but since its made by taleworlds and charges money, more like a 5/10 in my opinion.",
            "review_score": "-1"
        },
        {
            "review_text": "HOLY ♥♥♥♥!!! This game is so annoying and difficult i love it comparing this to to mount and blade warband this is near impossible i have over 250 hours of warband and conquered every castle/town and this is impossible for me to get anywhere near succsessfull but as soon as i join any faction i am at war with half the nations and if you try to make your own nation after 25 hours of playing i cant find how to recruit more lords to your fac and almost all other nation declares war on you! i can not get close to sucsessfull but i cant stop playing!",
            "review_score": "1"
        },
        {
            "review_text": "why not? cause mount and blade warband is better. but why do i give a thumb up? cause its mount and blade. Thats it!",
            "review_score": "1"
        },
        {
            "review_text": "Personally, i dont think it has the same feel as Warband, but, it has more content. I personally dont enjoy it, but i think a lot of people trying Mount and Blade out for the first time, should definitely buy this game",
            "review_score": "1"
        },
        {
            "review_text": "good but just buy warband its better",
            "review_score": "1"
        },
        {
            "review_text": "I love this game !",
            "review_score": "1"
        },
        {
            "review_text": "S000000000000000 MAny Haorse!!! SUch Battle And fite! I haved Vare fUn timme",
            "review_score": "1"
        },
        {
            "review_text": "This is a game that doesn't need to exist. It's essentially a Warband mod, and honestly, even for that it isn't even the best warband mod I've seen. Hell, its not even the best warband mod that the developer sells (that would be Napoleonic Wars by the way). Just buy Warband, and if you've already played it to death, go download Brytenwalda for it. You'll enjoy yourself a hundred times more than playing this.",
            "review_score": "-1"
        },
        {
            "review_text": "I've played and loved warband. I really just can't get into this game though. I was also expecting a completely new game but it has many of the asame quest (and with the same dialogue) as warband aswell as some of the castle being just retextured warband castles. THat brings me to another point. I dislike the textures for this game such as in the castle etc because, to me, they seem bland and of lower quality.  If you haven't already I suggest buying warband over this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Rebelled Crimean Khenate Take Islam Giray Han as a hostage at a battle. Crimeans cant attack anymore. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Get this game , get on DynamicSquads server , play all thay long.",
            "review_score": "1"
        },
        {
            "review_text": "ive never played this game but george plays it alot so it must be pretty good",
            "review_score": "1"
        },
        {
            "review_text": "disappearing Tsar simulator 2011 head-shot and insta-killed simulator 2011 Lvl 50 and still afraid of low tier musketeers simulator 2011(see above) weird names simulator 2011 disappointed with consumable grenades simulator 2011 dumb enemies trapped inside their own wagon fort simulator 2011 super expensive horse crippled by a low tier musketeer simulator 2011 (see 3rd line) chased by 1300 crimeans simulator 2011  10/10 would spend a lifetime savings on a double-barreled pistol again ",
            "review_score": "1"
        },
        {
            "review_text": "kebab OP boost activated",
            "review_score": "-1"
        },
        {
            "review_text": "Can't activate with serial key...",
            "review_score": "-1"
        },
        {
            "review_text": "crappy graphics but amaing multipplayer ",
            "review_score": "1"
        },
        {
            "review_text": "Mount and Blade, more like Smelt and Swade, Pref for people like specer wade, Plunder, Adventure and Big Booty ♥♥♥♥♥es",
            "review_score": "1"
        },
        {
            "review_text": "Its like mount and blade warband with guns.",
            "review_score": "1"
        },
        {
            "review_text": "A decent mod, but not worth 10 bucks... you find stuff miles better than this on moddb",
            "review_score": "-1"
        },
        {
            "review_text": "The game is mostly epic, more fun with gunfire and grenade but sometime feeling angry with weird horse controlling. Movment still same like Warband. Crossbow was removed... WTF",
            "review_score": "1"
        },
        {
            "review_text": "A definite reccomendation, for the campaign. To me the multiplayer wasn't as satisfying as making your own army from the ground up. 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Awsome game for cutting down your enemies with your army that you have fought beside forever.",
            "review_score": "1"
        },
        {
            "review_text": "Good game. It's economical aspect is much better than Warband who had basically no economy.  I wish the economy of the game would reflect the income and resources a lord has. That way, commerce would be even more interesting, and being a bandit even more fun as caravans would transport important supplies.  Combat, as in all M&amp;B, is excellent. Adding firearms only adds another dimension to the already excellent combat system.  It would be nice if the designer could make a gameworld as good as their game system. Right now, few gameworlds were interesting enough to hook me more than a dozen hours each. I lose interest in M&amp;B games due to the bland game worlds. I don't mind having no story if I have something to do in the game world like trading, building, patrolling, hunting, marrying, spying, conquering, diplomacy, politics, economics, road building, bridge building, cult-related stuff, etc. There are very few of these things you can do in all M&amp;B games put together. I really thing they should improve the game worlds they use, they are too colourless.  Still, it's a must buy for anyone who dreamed since the 1980s of having a game where you can fight on horseback in real time, not some dumb swings of weapons on horse back, real fighting with some physics involved.",
            "review_score": "1"
        },
        {
            "review_text": "Its a lot like warband in a sense. The muskets are very attractive in this game. Its a lot harder than Warband in my opinion. Still a great game.",
            "review_score": "1"
        },
        {
            "review_text": "Like mount and blade warband, but with guns and horses",
            "review_score": "1"
        },
        {
            "review_text": "Well yes this is pretty good and the reloading is pretty fast and all. But, its pretty half dead and its pretty equal. The reason that I actually bought this because it was on sale 2 bucks and I just sold so many cads for this game. Its pretty awesome and I its awesome!",
            "review_score": "1"
        },
        {
            "review_text": "Great game . Open Word game with Gun and Sword and fight for any age of for you . unlucky this game lack unique weapon and boring when you play singerplay around 1-2 hours . And the bandit in this game very discomfort more than warband .",
            "review_score": "1"
        },
        {
            "review_text": "good game but i like the other ones more ",
            "review_score": "1"
        },
        {
            "review_text": "Mount my blade: expansion pack with a bigger sword for your mouth.",
            "review_score": "1"
        },
        {
            "review_text": "I should have stared at the sun for 4 hours instead of play this game. Maybe next time.",
            "review_score": "-1"
        },
        {
            "review_text": "If you happen to like 17th century Eastern European siege warfare, this is your game.",
            "review_score": "1"
        },
        {
            "review_text": "Between the guns, inability to do much without joining a faction and so on. There is no reason to get this when Warband exists and has plenty of mods as well as DLC to support its longevity.",
            "review_score": "-1"
        },
        {
            "review_text": "There is no reason to get this game when there are so many mods for Warband. Some have all the features of Fire and Sword, such as different grades of food and gun warfare. The game lakes quite a bit of polish, even compared to the original Moun and Blade. The gameplay is ruined for me by the fact that for whatever reason, I can't recruit troops from villages. I'm not sure if this is a glitch or a gameplay mechanic, but it ruins the flow of the game because it makes getting high tiered troops impossilbe. If your looking for a fun game in the Mount and Blade series, just stick with Warband or wait for the devs' sequel.",
            "review_score": "-1"
        },
        {
            "review_text": "This gamew is pretty good, but it still can,t compete with the Warband so psych.",
            "review_score": "1"
        },
        {
            "review_text": "If you don't enjoy this game, I suggest you pick and bridge and jump.",
            "review_score": "1"
        },
        {
            "review_text": "Virtually dead multiplayer, less singleplayer features, guns are too accurate for the time period. I strongly recommend buying the previous game, Warband, instead (along with the Napoleonic Wars DLC).",
            "review_score": "-1"
        },
        {
            "review_text": "for some reason i couldnt play this on my old computer but normal warband worked. ♥♥♥♥ this game because its ♥♥♥♥ing mean",
            "review_score": "-1"
        },
        {
            "review_text": "ello good sirs i am but a lowly youtuber wanting subscribers! if you feel more genourous then normal it would help if you were to subscribe! plz look up bed head jed and click on the guy drinking water hes wearing a red shirt!!!!",
            "review_score": "1"
        },
        {
            "review_text": "warband with guns that all",
            "review_score": "-1"
        },
        {
            "review_text": "I am the very model of a modern Major-General, I've information vegetable, animal, and mineral, I know the kings of England, and I quote the fights historical From Marathon to Waterloo, in order categorical; I'm very well acquainted, too, with matters mathematical, I understand equations, both the simple and quadratical, About binomial theorem I'm teeming with a lot o' news, With many cheerful facts about the square of the hypotenuse.  I'm very good at integral and differential calculus; I know the scientific names of beings animalculous: In short, in matters vegetable, animal, and mineral, I am the very model of a modern Major-General.  I know our mythic history, King Arthur's and Sir Caradoc's; I answer hard acrostics, I've a pretty taste for paradox, I quote in elegiacs all the crimes of Heliogabalus, In conics I can floor peculiarities parabolous; I can tell undoubted Raphaels from Gerard Dows and Zoffanies, I know the croaking chorus from The Frogs of Aristophanes! Then I can hum a fugue of which I've heard the music's din afore, And whistle all the airs from that infernal nonsense Pinafore.  Then I can write a washing bill in Babylonic cuneiform, And tell you ev'ry detail of Caractacus's uniform: In short, in matters vegetable, animal, and mineral, I am the very model of a modern Major-General.  In fact, when I know what is meant by 'mamelon' and 'ravelin', When I can tell at sight a Mauser rifle from a Javelin, When such affairs as sorties and surprises I'm more wary at, And when I know precisely what is meant by 'commissariat' When I have learnt what progress has been made in modern gunnery, When I know more of tactics than a novice in a nunnery In short, when I've a smattering of elemental strategy You'll say a better Major-General has never sat a gee.  For my military knowledge, though I'm plucky and adventury, Has only been brought down to the beginning of the century; But still, in matters vegetable, animal, and mineral, I am the very model of a modern Major-General.",
            "review_score": "1"
        },
        {
            "review_text": "This game is so fun to play with friends. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "a lot more challenging than m&amp;b warband but i still have some questions on if we can get other officers to join me in my cause",
            "review_score": "1"
        },
        {
            "review_text": "Heyyo, another game in the Mount and Blade franchise... not as good as the first one, but maybe on par or a little worse than Warband, it's still a good game. For multiplayer? I wouldn't bother with this game as Taleworlds now has that viking game out which is Multiplayer only... I dunno, I might not bother with that one since I really enjoy the singleplayer of the Mount and Blade series.",
            "review_score": "1"
        },
        {
            "review_text": "Not enough mount nor enough fire to make up for the sword",
            "review_score": "-1"
        },
        {
            "review_text": "While another good game in the series, I do find the addition of guns really takes away from this game, Especially with how your AI work compared to how the enemies works. I find more often then not battles start up, And the AI mows down half your team with a wave of musket shots which seem lazer guided. I would Strongly suggest the others in the series.",
            "review_score": "-1"
        },
        {
            "review_text": "This is not close to how good warband is. Not worth the money",
            "review_score": "-1"
        },
        {
            "review_text": "The gameplay of F&amp;S is nearly alien to warband. Only play this game if you are expecting completley different gameplay. Here are a few differences:  -You cannot get professtional troops from villages. The most you can get out of them is ♥♥♥♥♥♥ millita.  -In order to get better troops, you must do a lot of pointless ♥♥♥♥ or go to overpriced mercenairy camps  -Features such as weddings are removes  -Your guys will die very easily (trust me)  -You cannot chose your own beggining. You have to start with default stats and you cannot select your starting location.  To me this game is an absolute waste of money. Should have bought castle crashers.",
            "review_score": "-1"
        },
        {
            "review_text": "If you like getting killed by one shot and lose all your hard earned siege progress, go ahead.  Dumb as it may sound, I don't want to get killed by a musket and I don't want to spend 10 days reloading guns while enemies swarm all over.  Many people might say it's realistic and challenging. I agree, but it didn't work for me.  The other Warband games are great in my opinion.",
            "review_score": "-1"
        },
        {
            "review_text": "No recruitment system is my only complaint.",
            "review_score": "-1"
        },
        {
            "review_text": "Do not buy this. It's like a really bad Warband mod except you have to pay for it. Unless you an get a great deal it's just not worth the price.",
            "review_score": "-1"
        },
        {
            "review_text": "GUNZ AINT NO FUN RITO BALANCE YOUR ♥♥♥♥ING GAME PLS",
            "review_score": "-1"
        },
        {
            "review_text": "Sucked No Marriage System...",
            "review_score": "-1"
        },
        {
            "review_text": "Gunpower ruined this beautiful game..buy older versions",
            "review_score": "-1"
        },
        {
            "review_text": "Warband with Floris is better in every way.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is not as good as Mount and Blade: Warband. Granted it has some pretty cool features, but it gets boring really quickly. I would recommend just to stick to Warband.",
            "review_score": "-1"
        },
        {
            "review_text": "Its far from as good as Mount &amp; Blade warband.  What i felt most disapointing was the singleplay. Sure it has some new mechanics but i didnt find them any good or fun. Also you don't get those epic and fun fights like you do in warband. Becuse you spend most of the fights hiding behind a rock, tree or your soldiers so you wont get one shot by some random rifleman 100m away.  The rifle combat is so awful. The rifles are very strong so you can often get suprised killed by anyone. Useing a rifle yourself is even worse since the bullet can fly anywere. So shooting becomes more of luck then a skill. With the high relode time just makes it worse. If you want to fight with rifles in a mount and blade game i recomend the napolic dlc for warband. Becuse the rifles are more accurate so its more skill based, It feels more epic with music and cannons, I think relode is faster or atlest it feels faster.   I only got the hours on the game becuse the melee combat in multiplayer was the one fun thing.",
            "review_score": "-1"
        },
        {
            "review_text": "Stop it. Get some help. Single player worth only for the big battles. Multiplayer sucks(russians, no servers, slow combat)  JUST DONT GO AWAY",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥♥iest M&amp;B game. Wank.",
            "review_score": "-1"
        },
        {
            "review_text": "No mountains to blade",
            "review_score": "-1"
        },
        {
            "review_text": "This game is infested with pros , Noobs stand no chance .",
            "review_score": "-1"
        },
        {
            "review_text": "Mount &amp; Blade, Fiery Sword is a terrible, terrible shitpiece of a game. Unlike Skyrim, there are no epic fantasy elements in the land of Firordia, instead, the player travels across boring European landscapes- with no snow. Clearly they do not know that European landscapes are boring without snow which is why Oblivion was a ♥♥♥♥ game. I do not reccommend this game. Even the combat opts too far towards actual swordplay instead of flailing your weapon like Skyrim. Not reccommended.",
            "review_score": "-1"
        },
        {
            "review_text": "f***ing horrible game jesus christ this game sucks no weight to your sword AI is ♥♥♥♥♥♥♥♥ has potential but man it sucks....",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥♥♥ Broken Game with 2 Bandit groups continuely capture you until your money runs dry  10/10 best game ever N/A",
            "review_score": "-1"
        },
        {
            "review_text": "Quite enjoyable, if you can overlook it's shortcomings. Combat is satisfying, if nothing else.",
            "review_score": "1"
        },
        {
            "review_text": "Crashes way too much",
            "review_score": "-1"
        },
        {
            "review_text": "An RPG set in the medieval era...aren't they all? But I digress. Mount and blade with fire and sword is a fairly good RPG. If you were to imagine total war on a smaller scale where you play as one of the soldiers, this is it. You start a new game, make a new character and set off on your journey. you can use bows, swords, shields and guns. Bows will lose accuracy the longer you aim them and because the guns are muskets they have little to no accuracy from a distance. You will wander around the campaign map doing quests for kingdoms pillaging villages and battling people. you can recruit mercenaries to help you in your adventures or recruit random people from pubs. You upgrade there equipment and will eventually have a force large enough to take over a castle. These battles are large and hard to win but when you do win the spoils are awesome. BUY THIS GAME.",
            "review_score": "1"
        },
        {
            "review_text": "Nowhere near the Warband benchmark but still a great title. What it improves is great but what it removes takes some soul away from the game.",
            "review_score": "1"
        },
        {
            "review_text": "a fun open world RPG Quote 'It's like meeting a bearded women with a great personality' basicaly ♥♥♥♥ graphics but good game",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, I play a lot. You should try it, if you haven't.",
            "review_score": "1"
        },
        {
            "review_text": "It's warband with guns. Also set in realismland. Also armies are way more complicated now.   Still pretty good though, even if Warband's better.",
            "review_score": "1"
        },
        {
            "review_text": "I can't play this game without it glitching out constantly. My screen is filled with so much ♥♥♥♥ that i cant see town names and charectors 'stretch' to the point that I cant see anything in a battle Warbands is a lot better game although that would be a stupid comparison since this game is not fully developed and is a huge dissapointment based of its predecesor. Don't waste your money.",
            "review_score": "-1"
        },
        {
            "review_text": "kicked a guy in the face while he was on a horse 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Jean-Luc Pierre left the game and never came back, even though he was an essential character of the story. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Decent game for $2.5, but Warband is a hundred times better.",
            "review_score": "1"
        },
        {
            "review_text": "A little different from the other MAB games but if you want MAB with guns this is your game. HOWEVER there are a few differences that make or break it for some people. do your reaserch and watch a youtube review or something  Brilliant game Different from other MAB games but yet the same",
            "review_score": "1"
        },
        {
            "review_text": "At first I was frustrated with the release of another stand alone from Tale Worlds, as I thought it would divert attention from their previous games and would I would have to pay for a whole new game. I also didn't see the point as there were mods for M&amp;B and Warband that add most of the things that WFaS add, but I must say that no mods do it quite as nicely as WFaS. Graphically it is superior to all mods out there and there are some new features that are nice. The outfitting of mercenaries was a little awkward, so if that's a key point for you, you might look past this one. Overall though I would recommend it especially as a fan of the series, it is really well polished in comparison to mods of the same type for the previous games.",
            "review_score": "1"
        },
        {
            "review_text": "Ride horses blow stuff up 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Very Great glade mount and blade bannerlord is coming soon",
            "review_score": "1"
        },
        {
            "review_text": "Very fun Mount &amp; Blade mod. Even compared to the recent mod releases, this mod was well made - in particular, the battle sequences are very polished.   BUT once you own castles and towns, you get spammed with so many popup notifications it ruins the game.",
            "review_score": "-1"
        },
        {
            "review_text": "Takes a while to get used to, but very rewarding. Previous players of Mount and Blade: Warband may have a harder time adjusting to the gameplay than newcomers: Enemies can take you out near-instantly with muskets from afar, focus is far more on army combat than individual, and an army of all cavalry is no longer the dominant strategy.  4.5/5",
            "review_score": "1"
        },
        {
            "review_text": "Very very fun game it is extremely good",
            "review_score": "1"
        },
        {
            "review_text": "greatest medieval war sim ive ever played. chivalry has nice graphics and a decent fighting system but has nothing on this game. just the sheer size of this game and its prequels is enough to get by the Morrowind like graphics. the only thing this game in the series needs is some DLC. preferably a japanese one kinda like the viking for warband. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Literally one of the best games I have ever played. Not much more to say. Its great. Go buy it.",
            "review_score": "1"
        },
        {
            "review_text": "this game is the best i hope to get mount and blade warband later when it comes on sale but this is a great game nice job",
            "review_score": "1"
        },
        {
            "review_text": "I can't say that this is as good as the Warband version but it has its own charm and it is interesting since they introduce a different style of weapons and gameplay (guns can be a lot of fun) but as I said it is not the same as the warband sieres of games so do keep that in mind but it is worth a look.",
            "review_score": "1"
        },
        {
            "review_text": "This version of the game sucks. Gameplay and story are about the same as the other games except that when you are taken prisoner, you lose nearly everything, including inventory items and equipped things such as muskets, pistol, etc leaving you with absolutely nothing. Most enemy troops are faster than you so they can run you down and kill you over and over I was captured 8 times in a row losing everything over and over. You can't recuirt troops like the other games in fact it seems as if you can't get any troops unless you buy mercenaries at outrageous prices. Oh and the armor sucks, so most of the time it's one shot kills.   Do not buy unless you intend on being frustrated and bored of losing battle after battle even on easy mode.",
            "review_score": "-1"
        },
        {
            "review_text": "this is the worst, terrible, an insult to mount and blade.",
            "review_score": "-1"
        },
        {
            "review_text": "Good game, I definitely recommend it for the story.  However, if you would prefer to have more freedom than actual story in the game I would definitely say you should get Warband over this.",
            "review_score": "1"
        },
        {
            "review_text": "*-*",
            "review_score": "1"
        },
        {
            "review_text": "a nice refreshing version of mount &amp; blade that requires you to learn new battle tactics.",
            "review_score": "1"
        },
        {
            "review_text": "The only reason why I am not recomending this game at the moment is because you cant even acces it. The servers are not working so you can activate the game using the serial cods. even the manual activation does not work due to internal error. I will reconebd this game when this problem is fixed because this is truly a grate game but this server problem is ♥♥♥♥♥♥♥ everyone off.",
            "review_score": "-1"
        },
        {
            "review_text": "The slightly less amazing (but still great) brother of Mount and Blade Warband, if you haven't played warband get that instead (it has a demo if you aren't sure about it), if you are a fan of warband don't expect this to be the worthy heir to the throne.",
            "review_score": "1"
        },
        {
            "review_text": "It is fun, especially the guns and increased options....  But... be wary. It's very buggy and some quests are very difficult to understand the the heck your supposed to be doing, especially some of the mainstorylines.  No where near as good a game as Warband, but still a decent game in its own right.",
            "review_score": "1"
        },
        {
            "review_text": "Another great gem of a game for the sandbox lovers, just the right amount of fire power to to make it feel to tacky and the variants of units now is very nice to see can feel a little harder than warband and mount n blade for starting troop trees are the same you have to go to towns and speak to a commander for higher tier troops as villages give you basic miltia.",
            "review_score": "1"
        },
        {
            "review_text": "Alright, this is...well nothing compared to Warband. But however it is still good, it has limited options though. The scenery is nice, and such, political aspects aswell, but alot of the options in warband are eliminated. Marriage is, so are founding your own factions, etc. The game itself is good, but napoleonic wars is extremely better. The formations and such are great, battles are good, but combat with guns is the only good thing to this game really. I like the special quests, but I struggle to find them past 'satisifactory' level. Mount and blade is supposed to be BETTER than this. It's still good, and I recommend it, but it lacks any depth compared to Warband. Just get Napoleonic wars for multiplayer, but this right here is a worse version of NW for singleplayer. But it's still a 7.2/10. Get it by all means, it's good.  GET A BETTER INTERNET CONNECTION RUBBERBANDING NOOB",
            "review_score": "1"
        },
        {
            "review_text": "Great Game, not as good as the older ones but some fun new stuff to try out in this version",
            "review_score": "1"
        },
        {
            "review_text": "This game is the best so much to do lots of fun.",
            "review_score": "1"
        },
        {
            "review_text": "it makesw it flashy, but it dosent have the feel of mount and blade",
            "review_score": "-1"
        },
        {
            "review_text": "105 hours in M&amp;B With Fire and Sword. More then 300 hours in original M&amp;B. I discovered that you can use ctrl+space to speed up time on map. Good game, will play again (well, not again but still because I haven't finished it yet).",
            "review_score": "1"
        },
        {
            "review_text": "Better than Kingdom of Swadia....",
            "review_score": "1"
        },
        {
            "review_text": "M&amp;B Warband with guns. Bang.",
            "review_score": "1"
        },
        {
            "review_text": "ahhhh, relaxing game is relaxing. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "amazing game, i used to own the cd but it broke. so i am hapy as hell to play it again",
            "review_score": "1"
        },
        {
            "review_text": "Not as good as Warband but still great fun with the guns and all.",
            "review_score": "1"
        },
        {
            "review_text": "one of the best games I played",
            "review_score": "1"
        },
        {
            "review_text": "Bought, refunded, now coming back because I didn't give it enough time, and I love it. Thanks!",
            "review_score": "1"
        },
        {
            "review_text": "Originally a mod for Mount and Blade, With Fire and Sword was picked up by the developers and made into an independent game with some of their own little additions and polishing. This game comes with a lot of really awesome improvements to the original and Warband. But some of these improvements aren't all that awesome in reality. Most of it will come down to your tastes and the changes are too many to list. None of these specifically are game changers though and I would NOT recommend you buying this game before you play Warband a lot. The main problem with this approach though is, if you've played Warband and spent a lot of time playing the many mods for Warband. You'll realize that the improvements this game includes aren't necessarily better than what you get with Warband. And the amount of Mods for WFAS (The amount of which, which are all just minor improvements and can be counted on your hand.) are not nearly half as awesome, or not even 1/100th as plentiful as the mods for Warband. Basically, if the time period turns you on and you really, really, really liked Warband this is the game for you. If you have never played Warband. DON'T BUY THIS!",
            "review_score": "1"
        },
        {
            "review_text": "this game very fun love seeing my troops run to the battlefield and be armoured up in the highest gear i can buy and guns going off as u charge into your op. and running around the map after a while tho lvling up could be better luckly they put a trainer skill in it so my advise put at least 1 in so u can lvl up if u r waiting around or doing nothing but walking around the map doing quest running mail to other people in game worth the money",
            "review_score": "1"
        },
        {
            "review_text": "AWESOME!!! Death comes out of nowhere, there is nothing more awesome than this ",
            "review_score": "1"
        },
        {
            "review_text": "You know them big battles in skyrim. Well its like them but thats the whole point of the game. Admitidly it has some kinda bad graphics( which can be fixed with mods) and some weird physics (which cant be), but apart from that it is a really good game.",
            "review_score": "1"
        },
        {
            "review_text": "Ok im going to be generous. I can KINDA recommend this game. The fortresses and cities look the same and can waste time trying to figure out which is which. I cant recruit from villages for some reason. I can only go to cities if I can find one and can only hire mercenaries or other characters which are expensive. The combat with firearms is a bit clunky and ive only been able to find good two handed weapons. I DONT WANT A POLEAXE. I WANT A SABRE. Really only get this if you want guns and bombs and only get it on sale. Otherwise, Warband is the way to go. 6 out of 10. I was expecting more.",
            "review_score": "1"
        },
        {
            "review_text": "It is an interesting game and enjoyable. I have no idea what the real point is. There are little quest like things, but there isn't a story or plot. I am somewhat content to have an armed caravan and move goods from place to place and get into the scrap every now and then.",
            "review_score": "-1"
        },
        {
            "review_text": "Excellent game, expansion of Mount &amp; Blade: Warband that includes guns, grenades, and more. If you haven't played Mount &amp; Blade: Warband yet, I highly suggest you go there first. This game serves more as an expansion on Warband.  Pros: interesting and indepth war based in central and eastern europe, at the outbreak of gunpowder warfare. Firearms add a new depth to battle situations, and allow for more strategy when controlling your units. Seige mechanics have been greatly improved (mostly in the fact that not everyone is trying to cram themselves onto ONE ladder to seige the castle), including more diverse town and fortress layouts. Multiplayer is improved again with better seige battles, and the popular survival-squad type game mode.  Cons: Does take a while to get going and have a decent sized army. Certain units are greatly overpowered (looking at you Swedish Reiters). Unable to buy stores and businesses in this version, and weapon diversity is down from the last game.  Overall, excellent niche game for those who have played games such as Total War or Age of Empires, and have wanted to experience personal action on the battlefield, or if you like Chivalry, try your hand at commanding your forces.",
            "review_score": "1"
        },
        {
            "review_text": "Now this game is recogized for its multiplayer, not it's campaign. The campaign is somewhat dull and boring to play through and just doesn't have the same quality as Warband's campaign. However, the reason I got this game is for the multiplayer, for it has been improved greatly.  Worth the money though! This game is the bomb once you get used to the controls!",
            "review_score": "1"
        },
        {
            "review_text": "Commit mass murder on eastern Europeans. 10/10 would recommend.",
            "review_score": "1"
        },
        {
            "review_text": "The game is just perfect.There is plenty of customization in story mode and many many choices throughout it.Multiplayer has a good number of players,where sometimes a server gets 100 ppl fighting(50v50).The maps in multiplayer are really nice too.There are many units to chose from in story mode and a variety of armor,weapons etc. A fan of roleplaying strategy games should try the game out for sure! 9/10 from me.I don't give 10/10 just because of the graphics as they are outdated,but they do not effect the whole experience.",
            "review_score": "1"
        },
        {
            "review_text": "this game is awesome love having your own troops who follow you into battle",
            "review_score": "1"
        },
        {
            "review_text": "OH MAH LAWRD Alright so you just randomly feel like you need a game where you can turn the tide of any battle with simple commands? Or perhaps you just need to see and hear swords clashing? Or maybe you like muskets? I like muskets.  For a great single and multiplayer game Mount and Blade has a lot to offer. Anything from gear, mods, weapons, countries, ect. But wait...The campaign has a FULLY nagivational map! Searching through a vast land to find mercanaries, getting dragged away from your home by bandits, losing your stuff, burning bridges for money, taxing citizens then keep their money to yourself. Let's not forget....SEIGEING CASTLES! ♥♥♥♥♥♥♥ yeah. Climbing several ladders to reach a only certain death, hiding behind your only sense of hope wishing for the rain of arrows to end, charging head first with 200 or more units screaming for dear life.   Open field fights are pure chaos with swords every which way. I swing one sword to kill a soldier from behind and suddenly another blocks it. But then the line infantry are firing at my guys. Oh my.   The good -Amazing combat and block system -Tons of weapons -Muskets -Spears -Expansive campaign with endless possiblities -Doesn't suck -You can hire whoever you want, pillage who you want, marry who you want, and be held captive all in the same moment. -Easy yet frusterating sword play -Arrows hurt   The bad -Naploneic wars is only for Mount and Blade Wardband plus you have to pay for it. Another downfall is people. Everybody online just want to charge you. Join a clan for line fighting. It is worth it. -Warband is better by a long shot but Fire and Sword offers gun play to any battle -Sometimes swords or spears don't register and you end up in the wrong -A.I. for huge battles online (By yourself in your own server) charge straight to the wall and just start pushing themselves until they die. -A.I. are not very smart -The command system is ok but units do react fast enough to form two lines or hold position -The game is very slow to begin and building an army can take forever. 9 times out of 10 ex military will just kill your small party and take all your ♥♥♥♥.  -The starting quests suck -Finding the weapon you want is hard but buying it is even harder. Espically if it is going to break or be lost easily. -By the time you get to a seige battle neither side wants you involved. -It is hard to find certain people for quests. I can't find the king of red land while the king of green land is in purple land -Frusterating movement system (Map wise) Bandits or ♥♥♥♥♥♥ bags run into you as often as possilbe -Money is hard to come buy  -You have to provide food for your party  Buy it.",
            "review_score": "1"
        },
        {
            "review_text": "One of my favourite game franchises ever. Just the sight of lining up all 150 of your musketteers on a hill, preparing to rain fire on the enemy is absolutely crazy. I would have liked to see some things from the first M&amp;B implemented into this one (things such as flag colours printed on shields for easier identification). Plenty of different story paths to take and heaps of different troops to train and upgrade. Even though the multiplayer is highly unpopular, the single player skirmishes made it up for me. 8/10 would recommend.",
            "review_score": "1"
        },
        {
            "review_text": "hack it to the point your a teleporting horse with a million points in every stat then run around the battlefield singing my little pony with a musket shooting everyone whilst making over dramatic noises.",
            "review_score": "1"
        },
        {
            "review_text": "I've always been in the 'Graphics don't make a game' camp and I can safely say this is true in this case. You won't play any of the Mount &amp; Blade titles for the graphics. I think what grabs my attention most about the game is the longevity, playability and sandbox feel to the game.   There is freedom in the game to a certain extent. It's like Freelancer but with horses and hatchets. I am really enjoying with Fire &amp; Sword as you have the Musketeer and Swashbuckling era of history.   Shooting a Slav Brigand from his horse with your flintlock musket as he charges your lines of musketeers is very satisfying!",
            "review_score": "1"
        },
        {
            "review_text": "best mount &amp; blade huge improvemts on warband 8.5\\10",
            "review_score": "1"
        },
        {
            "review_text": "As an expansion to Warband it is seriously a fun game. The addition of firearms adds a new level of gameplay and strategy. You might kick yourself the first few times you think you can charge headlong into battle like Warband only to catch a stray bullet and be put down instantly, but once you learn to deal with it expect hours of fun as you slowly build up your army in the greatest 'Medieval Simulation' games ever. (If not the only medieval simulation game)",
            "review_score": "1"
        },
        {
            "review_text": "Very disappointing, No where near as good as Mount &amp; Blade or Mount &amp; Blade:Warband. Check them out before buying this. ",
            "review_score": "1"
        },
        {
            "review_text": "I do like this one, but I prefer regular mount and blade because I'm not really a big fan of using inaccurate guns and bows. I prefer to go at the enemies with a large polearm and a crossbow. I do play lots of multiplayer with friends on it though which makes it more enjoyable for me. It is a good game overall, so 85/100",
            "review_score": "1"
        },
        {
            "review_text": "The name says it all. The mount gives you inertia; the blade, opportunity.",
            "review_score": "1"
        },
        {
            "review_text": "An interesting historical story.",
            "review_score": "1"
        },
        {
            "review_text": "An interesting historical story.",
            "review_score": "1"
        },
        {
            "review_text": "If you've played Mount &amp; Blade or its followup, Warband, you've pretty much played this already. The guns are an interesting and challenging addition, but aside from a few minor tweaks and a new map and era based on a book, the game is the same. Warband still feels like a more worthwhile game but the entire Mount &amp; Blade franchise is solid gold in my book. Few games do so much with so little.",
            "review_score": "1"
        },
        {
            "review_text": "An interesting if somewhat poorly handled official mod, With Fire &amp; Sword is actually Mount &amp; Blade's official release in Poland, pretty much setting up history from the 16th century or so as a framing device. One thing that becomes immediately clearis that this version of Mount &amp; Blade is MUCH harder than its previous incarnations. This can be summed up in three simple reasons: poorer economy, less effective armor, and GUNS. The regional economy is falling on hard times and defeating even bandit infantry is much more difficult than is thanks to the fact that much of your armor is cloth and even low level enemies will carry rifles. Soloing is nearly impossible, so you will have to amass an army one way or another soon. If you're the kind of person who likes to just roam the map being a lone wolf, this is not the game for you, but if you enjoy building up a (surprisingly historically accurate) army and inflicting it on your fellow man, give With Fire &amp; Sword a shot. (Ba dum tish.)",
            "review_score": "1"
        },
        {
            "review_text": "Same recommendation as Warband. Is a really good game!",
            "review_score": "1"
        },
        {
            "review_text": "I'll give it a 6/10 its a fun game and all but its buggier than hell and it sometimes crashes, never had these kinda issues with M&amp;B Warband......if you still want to check it out i would buy it when its 75% off that way you saying WTF is this a Beta version",
            "review_score": "-1"
        },
        {
            "review_text": "If you like history, or just want to go a little old school with guns than this is the game for you, This game is based on the cult novel called With Fire And sword",
            "review_score": "1"
        },
        {
            "review_text": "The Singleplayer is very good with different storylines. But its Multiplayer is completely unbalanced. Overall, it is nothing but a cool mod for M&amp;B.",
            "review_score": "1"
        },
        {
            "review_text": "Mount &amp; Blade: WFaS is an awesome game that combines the amazing gameplay from Warband with a twist of gunpowder, this minor addition alters the whole game darastically.   This game is hard at first, it requires correct judgment of reach and speed whilst also challenging you to think about what direction to attack from. You can attack and parry from 4 sides, slash/parry from left, slash/parry from right, slash/parry overhead attacks as well as stab. The controls are very simple, a simple click and flick of the mouse in a particular direction will give you your attack/parry.   The gameplay in this game is a mix of RPG, Strategy and Action, you will be controlling a main character, leveling them up and giving them weapons and armour. When you are in combat you will also be commanding an army (if you have decided to recruit troops) the commands are very simple, such as; hold, move up, charge and hold fire (with fire and sword feature only).  In short this game has given me hours of fun.",
            "review_score": "1"
        },
        {
            "review_text": "Like Skyrim with guns",
            "review_score": "1"
        },
        {
            "review_text": "Takes place in Eastern Europe. Has Guns. Have Fun.",
            "review_score": "1"
        },
        {
            "review_text": "Initially I was quite skeptical, the firearms were very difficult to use - aiming was a nightmare and their effectiveness rendered them useless. The fact that a male was the only option was a bit irksome, mostly because it was a choice in the previous game, Warband. They have since updated it and I find the game much more playable and just as enjoyable as the original.",
            "review_score": "1"
        },
        {
            "review_text": "It;s built on a fun concept, but there are so many bugs that its impossible to play without one ruining your game.",
            "review_score": "-1"
        },
        {
            "review_text": "Eventually once I put more time into this game, I might have a better outlook on it. While the use of firearms adds a good twist to the game, it just doesn't have the same appeal to me as M&amp;B: Warband. It took me some time to master the art of getting head shots with bows and crossbows in Warband. In WF&amp;S, I'm getting headshots like crazy with a pistol right away and it just doesn't seem as fun. Maybe it's just me. I highly recommend getting the Napoleonic Wars mod for Warband and playing multiplayer on there if you're need to fill your slow-as-molasses-reloading gun fix.",
            "review_score": "-1"
        },
        {
            "review_text": "The pick-up artists come across as nerdy, emotionally underdeveloped men, usually young, who have chosen to reinvent themselves as sexually irresistible predators. Buy it :D",
            "review_score": "1"
        },
        {
            "review_text": "I think this was the worst 4 Euros i spend on a game !   4/10",
            "review_score": "-1"
        },
        {
            "review_text": "Very disappointing, No where near as good as Mount &amp; Blade or Mount &amp; Blade:Warband. Check them out before buying this. ",
            "review_score": "1"
        },
        {
            "review_text": "Keep crashing when creating character. Can not play.",
            "review_score": "-1"
        },
        {
            "review_text": "dont buy 2 ♥♥♥♥♥ get free mod ",
            "review_score": "-1"
        },
        {
            "review_text": "A group of bandits tried to rob me while i was carrying over 500 men  i hit surrender by mistake  lose my moral and half my money  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Remember those hours upon hours playing Risk and then you would make secret alliances and your friend would go to get another mountain dew and you would remove half his army from the board?  This games kind of like that. But you have a horse. And you don't roll dice. And theres no mountain dew. But it's still fun as hell for some strange reason, maybe the simplicity.  Always a good way to kill time when I am indicisive about what game I want to boot up.",
            "review_score": "1"
        },
        {
            "review_text": "I didnt think a game could kick my teeth in harder than mount and blade:Warband.  I was wrong.",
            "review_score": "1"
        },
        {
            "review_text": "WF&amp;S is not a bad game by itself. It's a bad game compared to anything else in the Mount and Blade franchise. It's more tedious and firearms with realistic damage is one frustrating mechanic.  To its credit, the meelee + firearm battles are convincing.  What ended my run in this game was a series of crashes resulting in lost progress. Stability is a huge issue with this title and if you forget to save, you'll not only lose your progress, but potentially the opportunities that appear in your lost game.",
            "review_score": "-1"
        },
        {
            "review_text": "First off, you have donated you're money to the right guys. Second off, i am addicted.  Keep up the good work. ",
            "review_score": "1"
        },
        {
            "review_text": "Guns ruined this franchise. Get the near-perfect Warband instead.",
            "review_score": "1"
        },
        {
            "review_text": "Best Turkish Game Series Congratulations TaleWorlds",
            "review_score": "1"
        },
        {
            "review_text": "Have you purchased this game? Yes? Go ahead and dig a hole. Next, fill that hole with sawdust. Now use that modified car to pop a wheelie. Add some Calcium Carbonate to that. Left foot in, left foot out. Ok, now you're done.  That feeling you're feeling right now is what following the storyline like the developers intended feels like. You're going to buy this game, play it for ~8 hours vanilla while ignoring the storyline, use cheats, ransack two castles and start a rebel empire (which involves A TON of clicking and walking), and maybe try to wipe a nation or form an alliance. After you're done with that last bit, go ahead and uninstall. By then the gimmick has expired.",
            "review_score": "1"
        },
        {
            "review_text": "Mount and Blade is an addictive game where you go about trading and fighting on foot or horseback. Your character upgrades itself as you gain experience. Buy, collect or sell weapons, armour, firearms (Pistols, Muskets, Grenades), different kind of horses, sell prisoners as slaves, recruit troops, etc. The mechanics of fighting is the best part of the game. There are even seiges you can take part in to storm a castle.   Fire and Sword is based more heavily on trading than the original version and here are many more castles, and a bigger map. You can even send caravans to trade and in this version, this provides substantial money. Castles and towns can also be developed quite a bit after you own them. You can even order hand-crafted weapons at a steep price and which are slightly better than what you find on the market.   Great game!",
            "review_score": "1"
        },
        {
            "review_text": "BEST GAME EVER MUST HAVE ITS REAAAAALLY fun multiple ways to personalize and armor up ur character, PLAY OR DIE!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "I am enjoying it so far, have not played enough to write a full review. I just wanted to put it out there that it has caused my computer to overheat twice so far. And my computer is not that bad. I can play MUCH higher-end games perfectly fine. So yeah. No warnings or anything. Just *off* *restarts* *some message about computer overheating*.  Edit: Make that three. I'm going to look into this....",
            "review_score": "1"
        },
        {
            "review_text": "My favourite game on the world.Good music. This game have happy players.And singleplayer in this game is very good. Moja ulubiona gra na świecie.Dobra muzyka.Ta gra ma wesołych gracz.I tryb jednoosobowy w tej grze jest bardzo dobry.   Miłej zabawy rzyczy:Dymitri Samozwaniec",
            "review_score": "1"
        },
        {
            "review_text": "The campaign is quite tricky and wierd in some places, but the multiplayer is sssooooooooooooo much better in this than mount &amp; blade: warband. This game is best if you want to play multiplayer :D",
            "review_score": "1"
        },
        {
            "review_text": "once i watched a short tutorial and realized that you could command an army i flipped the ♥♥♥♥ out and this game is really ♥♥♥♥ing fun",
            "review_score": "1"
        },
        {
            "review_text": "Duelled a bloke over the honour of a lovely lass. Met on the grounds outside his castle.  -probably a whole bunch of his mates egging him on from the walls as he preps with his massive claymore and full plate armour. I rock up on my horse wearing half plate and a swagalicious hat. Duel begins. He charges with his sod off great big sword. I sit and scroll through my weapons. 'Ah'. Aim. Fire. Shiny new carbine pastes his body to the floor two feet from my horse. 10/10 Would ride off into the sunset with my bonny lass again.",
            "review_score": "1"
        },
        {
            "review_text": "I'll update this review if I find a fix, but as of now the game is near unplayable because the cursor doesn't appear. The fix that works with certain Bohemia games doesn't seem to be working either. It's a shame, I was hoping to enjoy this game.",
            "review_score": "-1"
        },
        {
            "review_text": "I would recommand the game to anyone who likes medievil, RPG, and/or open world games. It brings an interesting style to the game since they added muskets, and flintlocks. The only thing I don't like about it is no one has made a mod on steam for the game.",
            "review_score": "1"
        },
        {
            "review_text": "Best Turkish Game Series Congratulations TaleWorlds",
            "review_score": "1"
        },
        {
            "review_text": "Play as Poland, get chased down by huge swarm of enemies. Out numbered 5 to 1, playing with damage on normal so my army gets ruined. Reinforcements spawn in, all thirty winged hussars in my army.  Pikeman killed by winged hussar Dragoon killed by winged hussar Lifeguard killed by winged hussar Pikemen killed by winged hussar mercenary pikeman killed by winged hussar Musketeer killed by winged hussar Pikeman killed by winged hussar Dragoon killed by winged hussar Lifeguard killed by winged hussar Pikemen killed by winged hussar mercenary pikeman killed by winged hussar Musketeer killed by winged hussar Pikeman killed by winged hussar Dragoon killed by winged hussar Lifeguard killed by winged hussar Pikeman killed by winged hussar Dragoon killed by winged hussar Lifeguard killed by winged hussar mercenary pikeman killed by winged hussar Musketeer killed by winged hussar Pikeman killed by winged hussar Lifeguard killed by winged hussar Pikeman killed by winged hussar Dragoon killed by winged hussar Lifeguard killed by winged hussar mercenary pikeman killed by winged hussar Musketeer killed by winged hussar Pikeman killed by winged hussar Lifeguard killed by winged hussar Pikeman killed by winged hussar Dragoon killed by winged hussar Lifeguard killed by winged hussar mercenary pikeman killed by winged hussar Musketeer killed by winged hussar mercenary pikeman killed by winged hussar Musketeer killed by winged hussar Pikeman killed by winged hussar Lifeguard killed by winged hussar Pikeman killed by winged hussar Dragoon killed by winged hussar Lifeguard killed by winged hussar mercenary pikeman killed by winged hussar Musketeer killed by winged hussar mercenary pikeman killed by winged hussar Musketeer killed by winged hussar Pikeman killed by winged hussar Lifeguard killed by winged hussar Pikeman killed by winged hussar Dragoon killed by winged hussar Lifeguard killed by winged hussar Lifeguard killed by winged hussar mercenary pikeman killed by winged hussar Musketeer killed by winged hussar mercenary pikeman killed by winged hussar Musketeer killed by winged hussar Pikeman killed by winged hussar Lifeguard killed by winged hussar Pikeman killed by winged hussar Dragoon killed by winged hussar Lifeguard killed by winged hussar  Victory (Press Tab to leave)   Winged Hussar / 5  ign: 10/10 liked skyrim with guns and Winged Hussar   Get this game, its not as buggy as people say, and it requires more thought compared to warband.",
            "review_score": "1"
        },
        {
            "review_text": "04/28/15  Mount &amp; Blade is a single and multiplayer game which is not based on normal middle-age games. It has a special flavour .... The multiplayer is little bit like Call of Duty. You can play Team-Deathmatch , Conquest , Rush , Battle etc.  If you like ver funny team-based games you should definetly buy this one .   The singleplayer is what you make out of it , you can conquer castles, citites and villages.  Build your own Army and fight against others ! Go into the City recrute members , fight with many diffrent kingdoms. It´s your own game.  M&amp;B Warband was without any guns and that stuff . Guns in F&amp;S are OP but they are cool and funny doh! The horse-riding system is also very nice . I don´t like to fight with weapons on a horse because thats a little bit hard for me.   Every1 who wants to have fun should buy this game. ",
            "review_score": "1"
        },
        {
            "review_text": "I am enjoying it so far, have not played enough to write a full review. I just wanted to put it out there that it has caused my computer to overheat twice so far. And my computer is not that bad. I can play MUCH higher-end games perfectly fine. So yeah. No warnings or anything. Just *off* *restarts* *some message about computer overheating*.  Edit: Make that three. I'm going to look into this....",
            "review_score": "1"
        },
        {
            "review_text": "The most satisfying thing in this game is when an enemy is running at you and you aim your pistol at his face and blast him away right before he reaches you. And also running over people with a big horsey :)  On a more serious note, I highly recommend this game if you are the least bit interested in sword combat and a hint of strategy and controlling your own conquering army. The neat thing about this game is that while you can look at a map and move your army around the continent, and choose castles and villages to raid or conquer, as soon as you begin a battle, you have the option to join it. Which means you have your own character that you level up and equip gear to who serves as your army's leader. So there is both a strategic side as well as a medieval FPS side. In my opinion it also has a very good replay value.   All in all it's a very well made game and I have enjoyed all 400+ hours of gameplay :)",
            "review_score": "1"
        },
        {
            "review_text": "Great game, and goes well with the series. Always keeps you on your toes; just don't get too cocky.",
            "review_score": "1"
        },
        {
            "review_text": "i have been loading for 20+ hrs just for the game to crash but i do know that mount and blade is a good series but ill let this one off the hook its the only one not to work for me but for a new player to the series i more reccomend mount and blade warband ",
            "review_score": "1"
        },
        {
            "review_text": "You better be ready to be challenged.Number of bandits,looters and deserters is largely increased,there is no salt nowhere for the village missions,and you get sniped every single time.Its a refreshing experience from the normal M&amp;B,really interesting to see how gunpowder really changes everything,new clothes,new weapons,cities,and names,and all of this on normal mode.One can only imagine the horros that await beyond this dificulty.  The tutorial is really fun :D",
            "review_score": "1"
        },
        {
            "review_text": "This game is like a more tactical version of Chivalry. The levels and teams are very historically accurate, from the way they look and sound, right down to how the weapons handle. This is not a very fast-paced FPS shooter, it's more of an antique combat simulator. Mount and Blade really belongs in its own special category of tactical FPS. When a server gets going with a good team on both sides, it can be a lot of fun. I also enjoy skirmish mode. I have never found much time for the campaigns. Buy it on sale, and it's some of the most unique fun you can have for the money.",
            "review_score": "1"
        },
        {
            "review_text": "Very similar to Warband, still fun though.",
            "review_score": "1"
        },
        {
            "review_text": "I have new computer and i can't download it. :( This game is nice but i want play it on this computer!",
            "review_score": "1"
        },
        {
            "review_text": "While guns try to act as the selling point for the game the mechanics are too sluggish to be effective. Considering this is paradox's first attempt at three dimensional guns I wouldn't hold it against them. The usage of real European nations was definitely a nice touch. As a whole I'll give this the exact opposite of my review for the book the title was based off. While the worst piece in the trilogy it still manages to entertain.",
            "review_score": "1"
        },
        {
            "review_text": "Holy crap this game is fun. If you like games like Dynasty Warriors/ any of the battlefronts/any game that involves melee combat, well then you'll love the action in this game!",
            "review_score": "1"
        },
        {
            "review_text": "This compared to the original mount &amp; blade, awesome, but I feel like there's missing so much stuff like weapons (the guns are cool though) and just small things like tournaments. In this game there is also new stuff like pub fights, newly decorated castles on the inside, and the mercenary camps are cool. I'm not saying this is a bad game, but I would get the original Mount &amp; Blade first or buy this on a sale (like I did).",
            "review_score": "1"
        },
        {
            "review_text": "Napolean and Warband mixed together. Guns seem to be a little more accurate however and you can reload while walking, but there is armor and no bayonets so it still feels fairly balanced.",
            "review_score": "1"
        },
        {
            "review_text": "Brought a gun to a sword fight. Somehow lost to the swords, but I fired back. :3  Anyways, &lt;3 this game, 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This compared to the original mount &amp; blade, awesome, but I feel like there's missing so much stuff like weapons (the guns are cool though) and just small things like tournaments. In this game there is also new stuff like pub fights, newly decorated castles on the inside, and the mercenary camps are cool. I'm not saying this is a bad game, but I would get the original Mount &amp; Blade first or buy this on a sale (like I did).",
            "review_score": "1"
        },
        {
            "review_text": "One of the games which creates 'just a little more' or 'I'll just do this and I'm finished' syndrome. The graphics were not great even when it was released, but the game will make you play it for hours without noticing how the time flies. Great gameplay and even though I do not like sandboxes this one gives you so many attractive ways to play that you can easily find the playstyle you like. The expansion brought firearms and new world to explore which made the game even more attractive.",
            "review_score": "1"
        },
        {
            "review_text": "not as good as M&amp;B W-B gun play not as good as it needs to be",
            "review_score": "-1"
        },
        {
            "review_text": "𝖎 𝖓𝖊𝖛𝖊𝖗 𝖋𝖊𝖑𝖙 𝖘𝖔 𝖒𝖚𝖈𝖍 𝖑𝖔𝖛𝖊 𝖇𝖊𝖋𝖔𝖗𝖊",
            "review_score": "1"
        },
        {
            "review_text": "Many improvements, but Warband is still more popular than this.  Hint: Buy the  Full Collection !",
            "review_score": "1"
        },
        {
            "review_text": "this game is so hard,but is fine",
            "review_score": "1"
        }
    ]
}