{
    "app_id": 487330,
    "name": "Totally Unbalanced",
    "release_date": "2016-07-29",
    "developer": [
        "Isojumper"
    ],
    "publisher": [
        "OtakuMaker.com"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Online Multi-Player",
        "Co-op",
        "Cross-Platform Multiplayer",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards",
        "Steam Turn Notifications"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Casual",
        "Indie",
        "Racing"
    ],
    "tags": [
        "Racing",
        "Adventure",
        "Indie"
    ],
    "achievements": 10,
    "positive_ratings": 73,
    "negative_ratings": 16,
    "price": 2.09,
    "description": "Totally Unbalanced is a 3D platform game where you have to complete puzzles and overcome obstacles. Totally Unbalanced also features (currently) two multiplayer modes : sumo arena with 4 players and racing mode with 16 players.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/487330/header.jpg?t=1489333764",
    "minimum_requirements": "OS: Windows 7/8/8.1/10 Processor: Any Dual Core Intel or AMD processor Memory: 2 GB RAM Graphics: AMD Radeon HD 7750 / nVidia GTX 580 Ti / Shader Model 4.0 Graphics Card DirectX: Version 10 Storage: 1 GB available space",
    "recommended_requirements": "OS: Windows 7/8/8.1/10 Processor: Any Dual Core Intel or AMD processor Memory: 4 GB RAM Graphics: AMD Radeon R7 260 / GTX 750 / Shader Model 5.0 Graphics Card DirectX: Version 11 Storage: 2 GB available space",
    "reviews": [
        {
            "review_text": "I felt totally unbalanced playing this game!!",
            "review_score": "1"
        },
        {
            "review_text": "Totally Unbalanced reminds me of the game Super Mario Maker. The puzzles are incredibly frustrating to clear and you may have to go through many tries in order to get it right. And after clearing the puzzle, you have to steer the ball, jumping across the platforms to reach to the goal.   This is probably one of the hardest platformers I have ever played.  The game also provides for a large range of customizable settings to suit the player needs from screen resolution to even the framerate limit. The game uses simple to understand colour schemes which are quite comfortable to the eyes.  This game has infinite potential if it allows player created maps.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "This is an awesome game and you should be alot skilled to pass levels , is funny and nice graphic it worth any pound this game THUMBS UP ^.^",
            "review_score": "1"
        }
    ]
}