{
    "app_id": 487430,
    "name": "KARAKARA",
    "release_date": "2016-06-27",
    "developer": [
        "calme"
    ],
    "publisher": [
        "Sekai Project"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Casual",
        "Indie"
    ],
    "tags": [
        "Visual Novel",
        "Sexual Content",
        "Anime"
    ],
    "achievements": 7,
    "positive_ratings": 1306,
    "negative_ratings": 126,
    "price": 6.99,
    "description": "KARAKARA. It is the sound of aridity. It is the sound of dry asphalt and sandy winds. It is the sound of relentless sunshine, as well as the sound of a withering race.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/487430/header.jpg?t=1548807980",
    "minimum_requirements": "OS: Windows 7 or above Processor: 1Ghz Memory: 1 GB RAM Graphics: 1280 x 720 DirectX: Version 9.0c Storage: 1 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "  Developed by calme and published by Sekai Project onto steam. KARAKARA is a short kinetic visual novel lasting up to 5 hours.[Based on my reading speed] There are no choices to be made at all and is available in English and Japanese. KARAKARA is made possible and funded through an Indiegogo campaign. KARAKARA is the sound of aridity. It is the sound of dry asphalt and sandy winds. It is the sound of relentless sunshine, as well as the sound of a withering race.   The Story",
            "review_score": "1"
        },
        {
            "review_text": "  Moe rules the world",
            "review_score": "1"
        },
        {
            "review_text": "As of writing this review my playtime is low but I played it outside of Steam and therefore havent racked up hours on Steam. This game caught my eye due to the animal/human characters, which I really like. The artstyle is amazing too, there is so much detail and it matches the theme of the Visual Novel. The bright colours, the aerie, almost haunting music pieces of piano music underline the theme of dystopian future. You can almost feel the heat in those bright colour shots, as if the sunlight flows out of the pictures. The story told here comes to life with the wonderful voice acting and above mentioned music pieces. The story itself is a little tale of two (three) people that give each other comfort in these vast lands. The peace of those two living in a mutual releationship gets disrupted by a third one, which tries its hardes to fit in. I will be honest, I enjoyed the story and playing the All-Ages version on Steam doesnt take anything away from the story. I myself played the 18+ version with the erotic content, which might offer a deeper insight in their relationships. For those that expect some hardcore action or anything you will be disappointed, it matches the flow/tone of the novel to have light erotic content. As said before, the audio is a great positive point. The piano pieces with the occasionally track with more instruments matches the vast and empty lands where the visual novel plays. I often found myself wondering if some tragedy would befall them, often trying to assure myself that this isnt that kind of visual novel even if some mystery sprouts up. I really enjoyed that and thus cared for the characters. Some critize the gametime of this title, but for 10 Euro (brought it on sale at release (20% discount)) I got more then enough of my moneys worth. The great art, audio and good story are worth the price in my opinion. I always remember, going to the cinema costs the same for roughly 2 hours without food and you cant rewatch it. I certainly will replay the story a little down the line when I forgot some of it (especially one of the mysteries in it). Its kinda bittersweet with the desolated world and the sweet relationships.  Now, obviously I still have a few things I find negative or rather I long for them like those in the novel. Firstly, I would love to stay longer in this universe, explore more about the story, how the world came to be, how the three will master new situations (e.g. children) and how their relationships grow. At the same time, I dont really want much hardcore drama like death and stuff, I wouldnt like that... . Because the three, especially the girls are so frail.... . This doesnt mean it was to short, I just want more of the characters and hope for a sequel. My other point would be, as a Nekopara player, I would like more elaborate or rather higher quality erotic scenes, especially if they fit into the story. Higher quality in a sence of animation and drawn art, not that the art is bad, just more variations in the same way as you animate, more small steps to make the characters become more alive. That would elevate the erotic scenes more.  Now, can I recommend the game? I totally can and hope for a sequel! Even the All-Ages version should be great as the erotic scenes rather show a new side of their relationship then dictate the story. For a Kickstarter game the art, artstyle, music and story is great.  Message for the developer, build onto that! Just be careful not to destroy the balance of the existing characters.",
            "review_score": "1"
        },
        {
            "review_text": "I notice that Karakara TV 2, 3, and 4 are released, but at this time of writing, no idea how this game has evolved for those. But back to my experience of the game;  KARAKARA:  This is not a detailed review. Opinion only; Too short. Ends after just two chapters. No choices for the player to make at all. Just read through to the end. Pretty and colourful, but basic artwork, ok. Story is very typical for this type of thing. Without giving anything away; a normal boy is 'freak'. Everyone else has more ears and a tail, parents died, has a loyal work partner/love interest to operate restauraunt, together they find a poor cute little orphan creature = new trainee for shop / love interest. Mystery revealed, problem soved, end chapter 2. End game. Huh? no choices for story branch? Nope, thats all. This is why I do not recommend this game.  edit: grammar; modified the opening sentence of this post re Karakara to include 'TV' (originally could have caused readers to think there were newer versions of Karakara the game - there are not)",
            "review_score": "-1"
        },
        {
            "review_text": "So, after seeing all the great reviews this VN got, I was looking forward to playing it!  But... unfortunately, the only good thing this game offers is a couple cute looking characters - the story is awfully paced, terrible writing (especially a certain confession...) all romance is forced, and really unnecessary as both the overly sexualised characters look like they're 10 years old.  I would've loved to like this, but I play visual novels for a good story, not for cute catgirl lolis being sexualised for 'plot' purposes.",
            "review_score": "-1"
        },
        {
            "review_text": "Quite a short Visual Novel, it was quite nice and the characters were pretty decent. The dialouge, it always gets me with Visual Novels, why does the Main Character say such stupid ♥♥♥♥ . Some of the lines were pretty cringey, but I find that a lot in Visual Novels, Nekopara (bless those catgirls though) had a ton of ♥♥♥♥ dialogue, thank god I got to pet virtual cat girls.   So apart from some cringey lines, the game was pretty decent, but personally I really liked the setting I wish it spoke more about the setting of the game, god damn I hate it when a show or game has a really cool setting that is scarcely talked about. I just want to know who they cracked the code and got cute fox and cat girls, that's all I want to know.   Would I recommend it? Sure, why not, drop some money on it, but dont expect it to be too long it is a very short game. Also drop by and get the H patch, they aren't bad.",
            "review_score": "1"
        },
        {
            "review_text": "I want to know what name they're giving the puppy ):",
            "review_score": "1"
        },
        {
            "review_text": "The game was good even if i don't recoment buying it the game is extreemly short only 4 hours if you use the auto fuction and if you read with out listening to the voices you could compleet this game in less then 3 hours and lets not speak about the 18+ patch $8 for only 30 min of 'content' come one   it is still a good game but only buy it during a sale not for the normal price",
            "review_score": "-1"
        },
        {
            "review_text": "--------[Summary]-------- Length: 2-3 hours CG: Pretty Good Voice Acting: Pretty Good OST: Average, but it works Story: Average (a bit rushed plot/ romance) Characters: Good designs World: Average (wished it was more fleshed out) --------[Verdict]-------- This VN is just a nice heartwarming story about 3 people running a little restaurant in not-so-bleak post-humanity world. All in all, this is a pretty AVERAGE VN (H-scenes included). This would be a good starting point for people new to visual novels.  BTW, Lucia is best girl (Sorry Aisia).  ",
            "review_score": "1"
        }
    ]
}