{
    "app_id": 487770,
    "name": "Hoops VR",
    "release_date": "2016-06-20",
    "developer": [
        "Wizard Games Inc"
    ],
    "publisher": [
        "Wizard Games Inc"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Leaderboards"
    ],
    "genres": [
        "Simulation",
        "Sports"
    ],
    "tags": [
        "Simulation",
        "Sports",
        "VR"
    ],
    "achievements": 7,
    "positive_ratings": 46,
    "negative_ratings": 12,
    "price": 4.79,
    "description": "Hoops VR is specially designed for the HTC Vive so you can live out the ultimate basketball free-throw challenge. Use the motion controls and shoot hoops as naturally as you would out on the basketball court. Compete online for the top of the global leaderboards as well as locally against your friends.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/487770/header.jpg?t=1510442636",
    "minimum_requirements": "OS: Windows 7 SP1 or newer Processor: Intel i5-4590 / AMD FX 8350 equivalent of greater Memory: 4 GB RAM Graphics: NVIDIA GeForce® GTX 970 / AMD Radeon™ R9 290 equivalent or greater Storage: 500 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I am very pleased with this game. It's one of those games that the screen shots don't do justice to at all. Being on the platform and shooting feels really good, and the idea, while simple, has been done in a pretty neat way. Don't fall off the ledge!",
            "review_score": "1"
        },
        {
            "review_text": "One of the recent updates broke my game. The first couple times I played, it worked great. Fun and difficult, but enjoyable. Now, the ball doesn't stay connected to my 'hand' as I attempt to throw it. The ball sticks where it is spawned. It can still be thrown, but doesn't follow your hand, so it's super frustrating to get it to go where you want. This is literally unplayable right now (no sarcasm intended). Please fix this for Vive users.",
            "review_score": "-1"
        },
        {
            "review_text": "It is a simple fun game, with lots of replay value. It appeals to the wii players... the physics of the ball is good and you get the feelling that you are actually shooting hoops.",
            "review_score": "1"
        },
        {
            "review_text": "I have played Hoops VR for hours trying to best my high scores and if you try it, you will too. The game, as simple as it is, is very addicting. Whether it's thowing paper airplanes through hoops, garbage in trash cans or practing your jump shot, this game leaves you teetering on the edge of frustration and jubilation.   Two player mode would be awesome so you could go one-on-one with other top scorers.   Hoops VR is definitely worth a shot. &lt;Rimshot&gt;",
            "review_score": "1"
        }
    ]
}