{
    "app_id": 488280,
    "name": "Gun Done",
    "release_date": "2016-06-13",
    "developer": [
        "AZAMATIKA"
    ],
    "publisher": [
        "AZAMATIKA"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Casual",
        "Indie"
    ],
    "tags": [
        "Casual",
        "Indie",
        "Pixel Graphics"
    ],
    "achievements": 6,
    "positive_ratings": 484,
    "negative_ratings": 49,
    "price": 0.79,
    "description": "Gun Done - it's a timekiller arcade game about brave heroes",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/488280/header.jpg?t=1505906144",
    "minimum_requirements": "OS: Windows 7 and above Processor: Must have Memory: 512 MB RAM Storage: 20 MB available space Sound Card: It's fine too Additional Notes: You need only one finger to play",
    "recommended_requirements": "Additional Notes: Five fingers is fine too",
    "reviews": [
        {
            "review_text": "Gun Done is a cute little test of your reaction speed. It's not much of anything else, though, and I have to say the novelty wore off somewhere in the space of an hour. There's a ton of neat little pop culture characters to unlock, which was a great touch, even if the process of unlocking them is grindy and tedious. I also disliked how later stages of both modes of play required literal psychic ability rather than just a quick finger. It won't hold your attention for long and I don't think it'll be anyone's personal Game of the Year, but I will say that it is at least priced appropriately; I definitely had a dollar's worth of fun. Updates so far have shown promise, and I hope that the developer continues work on this game.",
            "review_score": "1"
        },
        {
            "review_text": "A fun little game where you and a opponent duel usually with a random modifier that changes how you play the duel, although sometimes the game doesnt do a good job of explaining the rules of the mini game. Then theres the fact that if you want to play a tournament you have to earn money by playing the duels, but it takes waaaaaaaaaaaaaaaaaay to long to get the 50 coins to play them. In the end though its only a 1$ so are you really expecting much? fun little game that ill probably goof around in when i have nothing else to do",
            "review_score": "1"
        },
        {
            "review_text": "Great game, my only problem is that it doesn't tell you how to unlock new guns, but other than that one of the best cheap games i have ever played  The warren with the spinning targets needs to slow down, even with 0 points he is very difficult",
            "review_score": "1"
        },
        {
            "review_text": "i dont know if i should recommend this simple game reasons are  - 1 or 2 duels you don't understand on how to win them. ( go to youtube to know how to win IF ! there is a video BUT i didn't check ) - the achivment are hard as hell espicially it tells you ' get the reaction time under or exactly 0.01 sec ' 0o0 wha ?? - this game is repetitive some time you get the same duels  - you need 50 GOLD to enter the torumment duel ( get out of here that take too long to get them ) each win will only give 1 or 2 piece gold ( as far as i know that i earned ) - at least make us pay per torument like 10 for easy 25 for medium 50 GOD HARD MODE UNDER!! 0.01 SECONDS!!!!! ( more drama in this sentence ) - there is 1 guy working by himself no hate to the guy that he made this simple game but at least give us a really ♥♥♥♥♥♥ story like a 5 year old making it PERFECT EXAMPLE ( love this show ) : AXE COP go watch it I PERSONALLY recommend it (a five year old is making the story line i loved it ) - this game is free on the google app store ( i just made a little research just know how many people were making this game no number but i can't say 100% it only 1 guy working on this game cudos to him for making and self publishing). -the game will feel boring in 30 mins ( that how i feel ). -there are some character like zoror or ONNNNE PUUUUUUUNCH [ THEME SONG FOR ONE PUNCH MAN ] and many more if you can win at least once in the touremment   that about it excluding the guns there all the same BUT diffrent sound effects that all i have to say under a dollar game. ( wow all this review under a dollar in the app store and the game it self dame what i'm i doing to my life )   me personally i would get this game in the app store not because it free but there is co-op 1 friend take the other half of the screen and also half of the screen fighting for your reaction time that all and by the way it not all bad i would not recommend this game but hay it your dollar",
            "review_score": "1"
        },
        {
            "review_text": "  My rating for McCree Simulator:  High Noon/10",
            "review_score": "1"
        },
        {
            "review_text": "What a weird game. It's recommended, but because it's only 50 cents, so it's not like you're losing much. You could do much worse with 50 cents. It's actually a good game if it got online multiplayer though. If only.",
            "review_score": "1"
        },
        {
            "review_text": "I mean...59 cents....but imo its bad. it has some references to the movie Django Unchained, but other than that, it's really quite bad because the gamemodes don't make much sense and it gets boring fast. 59 cents was a waste of money.",
            "review_score": "-1"
        },
        {
            "review_text": "This game would be alright for 59 cents, but it's poorly translated and kinda racist.  For example, one of the Mexican's lines is just 'Burrito Burrito!' There's also a black guy in a blue suit (I assume it's supposed to be Django), who sometimes says 'Listen to Master, a White Guy.'  The game plays fine, and there are plenty of unlocks to grind out if that's your thing (they seem to be only cosmetic). Can't expect much for 59 cents. But as-is, I'd go ahead and save your pennies for something a little more articulate and a little less culturally abrasive.",
            "review_score": "-1"
        },
        {
            "review_text": "im loving it but.      theres one person when i duel her/it a code error pops up and i have to restart the game please fix.  thx",
            "review_score": "1"
        }
    ]
}