{
    "app_id": 488950,
    "name": "Werewolves Within™",
    "release_date": "2016-12-06",
    "developer": [
        "Ubisoft"
    ],
    "publisher": [
        "Ubisoft"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Multi-player"
    ],
    "genres": [
        "Casual",
        "RPG",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Casual",
        "Strategy",
        "RPG"
    ],
    "achievements": 0,
    "positive_ratings": 75,
    "negative_ratings": 31,
    "price": 16.99,
    "description": "Werewolves Within brings the fun of game night with friends to Virtual Reality. This is a fast-paced game of hidden roles and social deduction for 5-8 players.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/488950/header.jpg?t=1501690209",
    "minimum_requirements": "Requires a 64-bit processor and operating system OS: Windows 7 SP1, Windows 8.1 or Windows 10 Processor: Intel® i5-4590, AMD FX 8350 equivalent or better Memory: 4 GB RAM Graphics: NVIDIA GeForce® GTX 970, AMD Radeon™ R9 290 equivalent or better Storage: 5 GB available space",
    "recommended_requirements": "Requires a 64-bit processor and operating system",
    "reviews": [
        {
            "review_text": "So I've been looking at this game to be released for a couple months now, but like most of you I was shocked and turned away from the $30 price tag ($40 for someone of you on different points on the globe). After a couple beers I said F it and bought the game.   The game is amazingly fun. The art direction and the world it created is a fun and enjoyable atmosphere to be a part of. Everything is well polished and the game is simple enough for anyone to jump in and start playing.   Right away I was paired up with 6 other guys who I got to spend the next 3 - 4 hours with. It was such a BLAST try to deceive everyone or try and convince them of who you TRULY (or falsely) are or are not. Other than the game objective itself, it was so much fun interacting with one another, doing all sorts of gestures, making all sorts of jokes, and, overall, just being part of a new community and getting to know one another. It's an amazing social experience and I don't think I ever laughed so hard in a VR game (one guy said he was laughing so hard, tears were getting in his headset).    Despite being incredibly fun, is it worth the $30 ($40) price tag? Sadly I'd say no. While it is an awesome experience and a fresh game mechanic to the Vive database, because of it's high price I don't see many people getting on board and thus I believe the player base will soon decrease (which is common for online only games). Which is a shame, that the price of the game is going to be it's poison and greatest contributor to it's lack of success. While it is great being able to play with other players across Vive, PSVR, and Oculus, it's going to be impossible to maintain a steady player count unless price is addressed. I recommend giving the game a try when it's on sale. With the amount of polish and creativity I would say this is more of a $15 game.    TL;DR Amazingly fun polished game with great atmosphere and addictive gameplay, but with a hefty price tag that, unless decreased, will starve the player count.",
            "review_score": "1"
        }
    ]
}