{
    "app_id": 489360,
    "name": "CASE: Animatronics",
    "release_date": "2016-08-03",
    "developer": [
        "Last Level",
        "Aleson"
    ],
    "publisher": [
        "Aleson"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Horror",
        "Robots",
        "Survival Horror"
    ],
    "achievements": 7,
    "positive_ratings": 958,
    "negative_ratings": 185,
    "price": 6.99,
    "description": "CASE: Animatronics is a truly scary and challenging first-person stealth horror on PC. Control of the police department is in the hands of anonymous hacker. All exits are locked. Electricity is off. Metallic thumps are getting closer. Will you survive, Detective Bishop?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/489360/header.jpg?t=1541705784",
    "minimum_requirements": "OS: Windows 7 Processor: Intel Core2 Quad Q8400 Memory: 512 MB RAM Graphics: NVIDIA GeForce GTX 560 1GB / Radeon R7 250X 1GB DirectX: Version 10 Storage: 1 GB available space",
    "recommended_requirements": "OS: Windows 7 Processor: Intel Core i5 3470 Memory: 2 GB RAM Graphics: NVIDIA GeForce GTX 660 Ti 2GB DirectX: Version 10 Storage: 2 GB available space",
    "reviews": [
        {
            "review_text": "&gt;I wake up in my office at the police station. &gt;Power goes out. &gt;Head toward the control room to investigate. &gt;Heard a noise, so I go check it out. &gt;Saw a large robot wolf sitting in the hallway with a note saying '8237'. &gt;Got jumpscared by ghost at the control room door. &gt;Entered '8237' into the door's number pad. &gt;Turned on power. &gt;Go back and find wolf missing. &gt;Got chased by wolf. &gt;Hid in closet. &gt;Wolf sits outside the closet for ten minutes before leaving. &gt;Made a break for the front door. &gt;Wolf was in lobby. &gt;Ran away some more. &gt;Went back to my office. &gt;Crawled out the window. &gt;Went home and played CASE: Animatronics.  10/10, this game was fun.",
            "review_score": "1"
        },
        {
            "review_text": "Movement keys settings/editing not working and absolutely NO support from developers :( I am using a AZERTY (French) keyboard and I have troubles playing the game because it seems that I cannot find a way to edit the key binding that control the in game movement of the character I am playing. Contacted the developers about this issue and they never replied. Going to un-install et ask for refund now. :(",
            "review_score": "-1"
        },
        {
            "review_text": "this game is hard but good",
            "review_score": "1"
        },
        {
            "review_text": "Okay listen, this is the most horrifying game I've played scince like, ever. I got it for only 3.36 (Steam sale) WORTH IT. So scary that I cant even walk down a simple hallway without bracing myself for instant skull-crushing... And uuuh what is the objective? I was too busy listening for the *tink* *tink* of animatronic steps coming to EAT ME!  (Sounds I make and you will too!) 'NO NO NO NAH NOPITY NOPE NO! Huh huh hhaarrrrg heh heh hehehehehhe HAH! Oh it was a door... OH I WAS WRONG! HO HEE HAH HAAAAAAAARGH! ($#!ts pants)",
            "review_score": "1"
        },
        {
            "review_text": "So scary, and fun nice job devs :)",
            "review_score": "1"
        },
        {
            "review_text": "Its a great game although not scary for me but its definitely a great game to buy.",
            "review_score": "1"
        },
        {
            "review_text": "my game keeps crashing when i click new game help!!",
            "review_score": "-1"
        },
        {
            "review_text": "good game to play when youre bored, although its pretty repetitive",
            "review_score": "1"
        },
        {
            "review_text": "I'M NOT ABLE TO PLAY THE DARN GAME!!!!!  It crashes everytime I play and the game wont let me check why!!! How does anyone play this without it crashing everytime you load up a new game??? I want a full refund or you tell me how to fix it.",
            "review_score": "-1"
        },
        {
            "review_text": "played at least 2 minutes befor i uninstalled this ..i can tell what this is and i just cant be bothered generic boring fnaf jumpscare lost in the dark wake me up kids horror game -_-",
            "review_score": "-1"
        },
        {
            "review_text": "EDIT: (I have played it more and found out what to do. The game has a matching game inside of it as a filler(what is that ♥♥♥♥) This game is complete ♥♥♥♥♥♥♥t. Completely not worth the buy. I cant say enough: ***DO NOT BUY THIS***)  I WISH I COULD REFUND BUT I PLAYED IT FOR TOO DAMN LONG  EDIT 2: I did get my refund and it was well worth it. If I could I would refund it again.  I played this game for a bit now and I have tried to beat it but I cant seem to find any way to the second power panel. The game looks well made except for the voice acting. The voice acting could have been better.   Also as I have stated before, It seems impossible to do BECAUSE the map gives hardly any indication to doorways or how to actually get into a certain area. I have been looking for a card or any way to advance in the game but it seems impossible to find a small blue card with no indication before you search it up or spend hours observing the ground.  Also the jumpscares aren't even scary after the first 5. This game will also probably be polluted by 'hardcore fans' who will defend this ♥♥♥♥ hole because its like 'Five nights at freddy's'.",
            "review_score": "-1"
        }
    ]
}