{
    "app_id": 490820,
    "name": "Fly O'Clock",
    "release_date": "2016-07-08",
    "developer": [
        "Digital Melody"
    ],
    "publisher": [
        "Forever Entertainment S. A."
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Casual",
        "Action"
    ],
    "achievements": 9,
    "positive_ratings": 266,
    "negative_ratings": 58,
    "price": 0.79,
    "description": "Fly O’Clock is tiny, highly-addictive single &amp; online multiplayer arcade endless jumper with innovative one-touch mechanics and unique pixel-art graphics.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/490820/header.jpg?t=1468008919",
    "minimum_requirements": "OS: Windows 7 Processor: Dual core from Intel or AMD at 2.0 GHz Memory: 2 GB RAM Graphics: nVidia 320M or higher, or Radeon 7000 or higher, or Intel HD 3000 Storage: 200 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "All you need is 89 cents to enjoy a genius idea  You are a little fly and you have to jump by clicking down on your arrow keys over two clock hands, otherwise you will get smashed and the game is over.   Sounds easy, but it is not. You mostly start by clicking the down arrow the wrong moment.   But, with a bit training you achieve fast a higher jump counter, get achievements, level up (yes there is a great exp level up system) or compete against other nerve wracks on the multiplayer.  What I like:  + simple idea, perfect execution + price + little time waster + multiplayer + one key input + achievements + level-up system  What I don't like:  - it will stress you a lot and rage quitting predestined  If you can handle raging and you like competing against your own highscore or other players: this game is for you!  Highly recommended",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game Was waiting for a friend and this killed the time! I could even join a full server within a minute.",
            "review_score": "1"
        },
        {
            "review_text": "Is this game a pun on 'time flies'? 'Cause if so, good job. 10/10 ",
            "review_score": "1"
        },
        {
            "review_text": "Simple but fun little game. Can be played with keyboard or mouse but worked best for me on a touchscreen. Not sure if the developers are looking to do something more with this game but I imagine it could be expanded by giving the flies power ups or special abilities.",
            "review_score": "1"
        },
        {
            "review_text": "This pretty much sums up the game:  5:01 PM - Hans Auhndiks: this game is built for mobile but is made to drive you to kill yourself. at least it was 10 cents with coupon lol 5:01 PM - Carl is now Online. 5:01 PM - Carl: If youre describing aoe2 im gonna murder u 5:01 PM - Hans Auhndiks: oh hell no lol 5:01 PM - Hans Auhndiks: this ♥♥♥♥ game 5:02 PM - Hans Auhndiks: if i could get AOE2 for 10 cents i'd be pretty darn happy with myself",
            "review_score": "1"
        },
        {
            "review_text": "Good game and very addictive. This game is like a game you would play if you are bored and have nothing else to do. Actually a great game and I love it so far. I also really like the different range of clocks you hop on and how it gets harder and harder.  Great game for holidays or when bored. It's a pointless time wasting game but if you want to play it to waste time then great. Got it for free from ♥♥♥♥♥♥♥♥♥♥♥♥. (not sponsored or anything)",
            "review_score": "1"
        }
    ]
}