{
    "app_id": 491090,
    "name": "Ant Queen",
    "release_date": "2016-06-17",
    "developer": [
        "inVantage Technologies"
    ],
    "publisher": [
        "inVantage Technologies"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements"
    ],
    "genres": [
        "Indie",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Simulation",
        "Indie"
    ],
    "achievements": 31,
    "positive_ratings": 89,
    "negative_ratings": 68,
    "price": 2.89,
    "description": "Begin a journey like no other, become the Ant Queen and establish your empire. Ant Queen is a simulation game where you breed different types of ants to ultimately conquer your surroundings and achieve a stable ant colony.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/491090/header.jpg?t=1470926942",
    "minimum_requirements": "OS: XP SP2 and Higher (7, 8, 9, 10...) Processor: Intel Core2 Duo 2.4Ghz+ Memory: 512 MB RAM Graphics: DX9.0c compatible : GeForce 4 Series +, AMD Radeon R350+ DirectX: Version 9.0c Storage: 500 MB available space",
    "recommended_requirements": "OS: Windows 10 Processor: Intel i5 Memory: 1 GB RAM Graphics: DX9.0c compatible : GeForce GTX 6 Series+, AMD Radeon R520+ DirectX: Version 10 Storage: 500 MB available space",
    "reviews": [
        {
            "review_text": "If you're a fan of Sim Ant you gotta get this game :3",
            "review_score": "1"
        },
        {
            "review_text": "is an ok game should be $5 no more untill the bugs for longer playtime and bigger colonies are worked out",
            "review_score": "1"
        },
        {
            "review_text": "great game. alot of fun.",
            "review_score": "1"
        },
        {
            "review_text": "This is a game that touches my heart... I play it and can not help but smile. It is fun in many ways and is verry likely to please all gamers alike. It has nice Graphics and good gameplay. I hope that you all play it... It is more than worth it.",
            "review_score": "1"
        },
        {
            "review_text": "It looked good, however it appears all I can do are missions, the only controls over the queen is to make larva and mabey move every now and then, and finally, why are their no soilder ants. You have workers, diggers, and nurces, but no soilders. Not very open world game either. It also appears that you cant dig as to where you desire, you automatically dig into one or 2 general directions. Why do I have to go through all these little missions, if all I want to do is build a colony. Game is good, however it needs aloooooot more in my opinion. So you might want to keep it for early access. Until I see even one such improvements, Im afraid I cant recomend this game.",
            "review_score": "-1"
        },
        {
            "review_text": "When I first saw this game on Steam I thought it would be something like the old school Ant War game I used to play as a kid, so I decided to give it a try. I completed the game about halfway and was very disappointed with it.  The game consists of about 15 scripted missions for you to complete. There is no sandbox mode. As you complete missions, more and more units get unlocked for you to breed. Units have different roles that they take on to help you run your colony. Nurser ants feed the Ant Queen and help the larvae develop into ants. Worker ants collect food from outside the colony and bring it back. Digger ants dig new tunnels and chambers in your colony and deposit the dirt outside. Soldier ants fight against other insects and protect your colony. There is also the Queen Ant, who produces larvae. Her health bar drains every time she produces a larave and every few seconds depending on how many ants are in your colony. The health bar can regenerate by eating food. Each above mentioned unit (besides the Queen) has several different versions, which have more specialized stats.   The missions themselves are very straightforward. Some will require you to collect enough food, some will require you to survive against insect invasions for a set time limit, and some will require you to expand your colony by digging new tunnels (which are predeterminated, you do not get to pick and choose how to build your colony.)  Units are not directly controlled. Instead, you either turn on or turn off specific tasks for your workers to complete. These tasks include collecting food, developing larvae, digging tunnels, patrolling above ground, or fighting enemies. The AI seems to spend most of its time blindly walking around instead of actually completing these tasks however. Digger ants especially are useless for half the game, as there is no digging for them to do other than in specific missions. This means they drain your Queen's health without contributing anything to the well-being of the colony.   This game is simply awful, and asking for $17.99 for it is a joke. There were no reviews when I bought game so I took a chance on it. I don't want anyone else to make the same mistake I did. Spend the $2.99 for Ant War: Domination instead if you want something significantly better.",
            "review_score": "-1"
        },
        {
            "review_text": "Why, oh why do I always do this to myself?   Firstly, because being the unquestioned sovereign of a hive is actually a pretty interesting idea for a game. The world of ants is sufficiently gritty and subject to sufficient questions of tactics, strategy and logisitics that you could certainly make a pretty good game out of it - the concept is juicy enough that I almost invariably buy every one of these games that I see - everything from Sim Ant on up.  I bought this game. I really have buyers remorse.  It's hard for me to write a detailed report on what's wrong with the game - but the short version is 'everything you thought might be wrong with it when you decided to check out some reviews before you purchased it yourself.' The graphics are so simple as to be childish, but set in a realistic design that prevents them from being cute. Colony management mechanics are not hard-edged enough to make you feel in control, instead you make vague decisions that conflate with other vague factors to lead to a vague sort of direction towards either success or failure.  Increasingly, however, you'll be confronted with a definite sense that the game is simply not good enough. The design of the gameplay mechanics wasn't good enough, the graphics aren't good enough, the sound is equally lack lustre - and so it goes.   I wandered off in vague disquiet roughly 20 minutes into my first play and now find myself wishing I wandered back and made the hard call on this game sooner. A week ago, I might have had a pretty decent chance of getting a refund - now, I'm not so sure.  I'm still going to try.",
            "review_score": "-1"
        },
        {
            "review_text": "I reall wish i could recomend this game but I can't. the story mode is a glorified tutorial of building a coloney and I got stuck on building the cacoon segment because of the spawn rate of catapillers just destroying my coloney.  the controls are too simplistic and designating tiles to dig is tieadous once you get a few supersolders its game over you win sand box",
            "review_score": "-1"
        }
    ]
}