{
    "app_id": 491000,
    "name": "Gravity Cat",
    "release_date": "2016-07-13",
    "developer": [
        "Quiet River"
    ],
    "publisher": [
        "Quiet River"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Indie"
    ],
    "tags": [
        "Cats",
        "Indie",
        "Platformer"
    ],
    "achievements": 7,
    "positive_ratings": 310,
    "negative_ratings": 63,
    "price": 2.09,
    "description": "Gravity Cat - it's a puzzle-platformer. You play as a cat who has an ability to change the gravity.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/491000/header.jpg?t=1493570406",
    "minimum_requirements": "OS: Windows XP, 7, Vista, 8, 8.1, 10 Processor: Intel Celeron 1800 MHz Memory: 512 MB RAM DirectX: Version 9.0 Storage: 150 MB available space",
    "recommended_requirements": "OS: Windows XP, 7, Vista, 8, 8.1, 10 Processor: Intel Core i3 Memory: 1024 MB RAM DirectX: Version 9.0 Storage: 200 MB available space",
    "reviews": [
        {
            "review_text": "This game is really fun and a fantastic time waster! Here are my Pros and Cons'  Pros ---- - Cute cat! - Great time waster - Good music - A very happy game overall - It's very Challenging!  Cons -------  - Maybe mix the levels up a bit more. For example, in my opinion level 10 is harder than 11 eyc.   Awesome game! Great work Quiet River.",
            "review_score": "1"
        },
        {
            "review_text": "Gravity Cat is a game that I recommend because: - it is a method to banish boredom - it has a good price - it is indie - it has trading cards  Enjoy!",
            "review_score": "1"
        },
        {
            "review_text": "a fun cheap, easyer version of super meat boy..cute..good soundtrack,i just have 2 issues  1 how do u get the FOR WHAT?! achievment..?! ive done all levels on standard mode AND the 'no clip' mode and i cant get it :P 2 u cant get the soundtrack :(",
            "review_score": "1"
        },
        {
            "review_text": "Gravity Cat is Fun but too much repetive.  Because it only to change the gravity up and down turn laser off and get the door.  The level design not bad but with Only 1-2 gimmick that make it boring fast like 0.4 hr lol. The background okay well detailled but a little blank  the level need more decoration to make it cuter longer. The music nice but the game lacking sound effect. The background okay well detailled but a little blank the level need more decoration.  Sadly i don't recommend it. There better game like super meatboy or  ¨no time to explain¨,¨Ember Kaboom ¨Fenix Rage¨¨ ¨adventure shuggy¨  But if you wanna a little change maybe get it not that bad for a short play. Not missing much to be fun game. You may enjoy it. ------------------------------------------------------------------- Summary   Pros: Cute cat Nice music. Fast restart (maybe too fast) Number of level.   Neutral:  Background detail Level design  Control¨ Simple story ( hey it have a plot)  Easy mode   Cons: No collectable item No timed mode or score few type of gimmick and enemy not sound effect or it broken??? Oh that laser switch sound",
            "review_score": "-1"
        },
        {
            "review_text": "As a cat lover I was exited to buy this game. The game looks cute however the movement system is bad. You get no options to change the keys. Although that can be expected of a small game. Another problem is that the game is very often unresponsive when using the keys which pretty much ruins the whole game for me since its based around movement challenges completely. Therefore I cannot recommend the game at this moment.",
            "review_score": "-1"
        },
        {
            "review_text": "Nice, challenging little game! Some levels get really tough! It's got a funny plot too ;P Simple review, I know. Seriously though, if you're looking for a challenge, grab this game!",
            "review_score": "1"
        },
        {
            "review_text": "Just... boring. Played it for a bit over an hour, and got bored. Non-creative level designs, using the same design elements over and over and over from level to level, really doesn't have any staying power.",
            "review_score": "-1"
        },
        {
            "review_text": "  (This is a slightly altered version of the review I wrote for ticgn . com)  I’m a sucker for gravity-based platformers, so I felt the instant need to play this one. Funnily enough, my first review for TICGN is for the Xbox One release of In Between, which was a gravity-based platformer with high production values to it. That isn’t to say I was expecting this game to reach that level of quality…but I do wish it at least had as much to it in terms of its basic design.  Graphics  Other than that comic intro, the graphics are more on the bare side of the spectrum. Other than the cat and the saw blades in the grand majority of the levels, the worlds are completely static and are uninteresting to look at to say the least. The cat itself is pretty adorable though, and its animations do reflect on the cuteness.  Audio  The music has that kind of public domain vibe to it, but it works. There are a number of background pieces that play throughout the duration of the game, and while they are bound to repeat, they are nevertheless pleasant to listen to. Too bad sound effects are as minimal as they could get. Other than the sound of levers clicking, there is nothing in the game that makes a sound. You don’t hear the cat jump or die, nor do you hear a victory jingle when clearing a level. It’s a shame, really.  Gameplay  There’s always potential to be had with the platforming in gravity-based games. Titles like In Between, Gravity Duck, and even smaller portions that utilize the mechanic like in Mega Man 5 show that it’s always fun when things flip around onscreen. Gravity Cat is no exception in this regard, but unfortunately other aspects do leave a lot to be desired.  99% of the levels consist of a miniature gauntlet featuring saw blades and levers. The way the levers and blades are placed in the levels vary from actual clever designs to aggravation for the sake of aggravation. It’s mostly the former, but when the latter happens, things do feel like they’re only going through the motions instead of aiming to be fun. This is most obvious when coming across a level where you have to keep consistently doing the same thing to progress. Press this lever to go access that lever, and press that lever to be able to go over here. Run. Change gravity. Run. Change gravity. It’s times like those that make me believe there should seriously been way more obstacles to work with.  Not only that, but there are a few times where a stage hazard could be too challenging for its own good. I’m talking about the moments where you have a split-second to react or else it’s back to the beginning of the level. This game isn’t totally guilty of it, but it is there.  Verdict  As harsh as many of my comments may seem on the title, though, that doesn’t really mean I hated the game. In fact, I don’t think it’s really a bad game. It’s just…okay. There were times where I had fun, but I can’t guarantee everybody will be able to get a kick out of it. It can be good for casual enjoyment, but it can nonetheless leave players craving more variety and pizzazz than it currently dishes out.  That said, for $2 for some (albeit flawed) gravity platforming? Sure, why not? I recommend it just enough, but players should proceed with caution.",
            "review_score": "1"
        }
    ]
}