{
    "app_id": 491330,
    "name": "12 Labours of Hercules V: Kids of Hellas (Platinum Edition)",
    "release_date": "2016-06-17",
    "developer": [
        "Jetdogs Studios",
        "Zoom Out Games"
    ],
    "publisher": [
        "Jetdogs Studios"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Casual",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Casual",
        "Strategy",
        "Indie"
    ],
    "achievements": 23,
    "positive_ratings": 237,
    "negative_ratings": 29,
    "price": 1.99,
    "description": "With your help, Hercules must return the kids home, blow up the factory that produces the evil toys, and lead a strategic operation to destroy Ares' command transmitter in 12 Labours of Hercules V: Kids of Hellas!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/491330/header.jpg?t=1502273387",
    "minimum_requirements": "OS: Windows XP Processor: 1.6 GHz Memory: 512 MB RAM Graphics: 1024x768 resolution DirectX: Version 9.0 Storage: 300 MB available space Sound Card: With OpenAL support",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "You would think that the Gods learned their lessons to let Hercules in peace. But Ares had to ask our hero to help him in a war. And as Hercules refused, the God of War decided to turn all the kids of Hellas into an army of zombies. Hercules, Megara and all their friends will have to save the children and to return them home... with the servants doing all the work as usual.  It's already the fifth episode in Hercules's life. Nothing really changed in terms of gameplay. Allow me to paste a text I've made for the profile of the previous games on Neoseeker (inspired mainly by my reviews).  The game has three difficulties: Casual (without timer and without score kept), Normal (with a timer and with score) and Expert (with a timer that goes faster and with score).  The goal is to finish the level by reaching objectives given (in time if you're playing in Normal or Expert). You're sending workers to clean or repair the road, to gather ressources (food, wood, gold) whether they're outside or being produced, to build buildings (farm for food, workshop for wood, mine for gold, outposts for expanding the inventory and to stock faster resources). During the course of your adventure, you may be helped by other mythological figures like Pegasus. Generally, before being able to use them for specific tasks (Pegasus can make rocks fall down, the Lion is taking pieces of meat, Medusa is scaring Minotaurs and Cerberus is doing the same task but for ghosts for example). You can also exchange gold for floating ressources with Charon.  Also, you can get favors from Gods by building poles in their honor: Demeter will make ressources being produced faster, Hephaistos that will make your servants work faster, Apollon will scare every robber, Hermes will make your workers run faster, etc.  Robbers are also returning: if you leave your ressources unattended for a certain period of time, thieves will steal them.  Hercules and Megara are still there: the former for moving boulders or other specific tasks, like saving the children, the latter for growing fruit trees and clean the soil. New allies are also revealed as sellers: for example, they can sell 2 gold for 3 wood.  The search for puzzles pieces is also included, to unlock a jigsaw puzzle that will do the same for bonus levels.  While the first levels can be done easily without bonus, later, you can activate some if the energy bar reachs it: work faster (ressources appear faster and workers are doing their tasks faster), run faster (workers see their speed increased when running from a task to another), stop time (timer is frozen), more ressources (each ressource gathered is giving one more), temporary worker (one more worker will help). These bonus are limited in time and are resplenished. Their place in the bar is varying from a level to another.  Children can be used to retrieve more energy for the bonus bar.  Are you still with me? Ok, I'm just checking if you didn't run away from that long description. Let's focus on the other points.  The graphics didn't change at all, they're still colorful and nice. The soundtrack is also identical.  As usual, 12 Labours of Hercules isn't a big surprise: apart for the children and the new allies, nothing is really different. However, if I'm writing a late review, it's simply because I was waiting for a fix for an achievement that didn't work. Indeed, the only level with thieves was impossible to realize the anti-theft achievement because ressources were at the other end of the map, with rocks and bridges to repair. Now, since two days, they've added thieves in other levels (like 4.4) and since then, everything is working fine.   Should you purchase this game? If you're a fan of the series, you're not going to miss it. I'm recommending it to every player out there that wants to try casual time management games. But, true, while the rest of the series is cheaper, the five bucks I've spent are five bucks well spent. I've still enjoyed greatly this new episode and I'm pretty sure that many people will keep it like that.",
            "review_score": "1"
        },
        {
            "review_text": "5 Hercules games and it never get boring. 56 Levels to beat the Expert Gold Time and the incredible developer points. The levels are again so unique, they dont look like any one before and there was many in first 4 games. Sure the games make no big revolution, but its still a good strategy and reaction test game. I cant await part 6. Only little critic point is only 23 Achievements, there could be much more STEPs Achievement (Getting 10,30,40,50 Levels Gold and enough other to get 37 Achievements at all, but no problem, i am happy with 23). Test it yourself for me the game get a 86 % personally, i hope other ones enjoy the game like me. Thx 4 reading.",
            "review_score": "1"
        },
        {
            "review_text": "I own all of the Hercules games and they're all amazing. It helps to be skilled with time management! The levels are very interactive and fun to play, it's a nice way to spend some time. I follow the developer and can't wait to see more of their stuff, I hope they continue the line!",
            "review_score": "1"
        },
        {
            "review_text": "nice music but it's not strategy, its hard to manager character",
            "review_score": "1"
        },
        {
            "review_text": "  Another installation of the 12 Labours of Hercules series, now with kids, and increasing difficulty! I love thiss game, and I always have, it's a good game, beautiful gameplay and relaxing music. Play this whenever you need to lay off a bit.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game to relax to, awesome for kids as well. Same for all of the games in the series.",
            "review_score": "1"
        }
    ]
}