{
    "app_id": 491530,
    "name": "Notruf 112 | Emergency Call 112",
    "release_date": "2016-11-09",
    "developer": [
        "Crenetic GmbH Studios"
    ],
    "publisher": [
        "Aerosoft GmbH"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Workshop",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Casual",
        "Simulation"
    ],
    "tags": [
        "Simulation",
        "Realistic",
        "Singleplayer"
    ],
    "achievements": 21,
    "positive_ratings": 698,
    "negative_ratings": 461,
    "price": 18.1,
    "description": "Emergency Call 112 – The Fire Fighting Simulation is an exciting, fully detailed simulation of the eventful life of a big city fire department. It was developed in cooperation with and modelled on the fire brigade of Mülheim, Germany. Mülheim has one of the largest and most modern fire stations in Europe.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/491530/header.jpg?t=1556277508",
    "minimum_requirements": "OS: Windows 7/8/8.1/10 (64 bit) Processor: 2,6 GHz Memory: 8 GB RAM Graphics: min. 1 GB VRAM (no support for onboard cards) DirectX: Version 11 Storage: 6 GB available space Sound Card: Yes",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Overall a great concept. Being in the public safety field for over 20 years, I can relate to almost all duties performed in-game, either from experience or from being able to observe it first hand. That said, I'm in the United States, this is set in Germany (I think). Regardless, it does not take away from the playability of the game. All of the in-game text is in English, so there's no issue there.  That said, the nitpicky part...  Not much ambient sound, maybe some crackling of the fire, or radio chatter (as another reviewer stated) would add to the game a bit, but all-in-all does not affect the playability of the game.  It's a bit confusing at first when you've got to figure out on you're own, but after about 10-15 minutes you kinda catch on to it. After that it's much more enjoyable.  You start out in station, get an assignment, have to find your assigned vehicle, either as a driver or passenger, enter the vehicle, then either drive or ride to the fire. Once you get there, your mission leader will give you a briefing and you go from there. Basically you havet o procure a water source from an underground hydrant, attach hose to that and supply the engine, then pull the hose off the engine into the fire. Then you can swap firefighters and either take on a different duty, or take the attack nozzle and go to work. After the fire is out, you've got to clean up! Nice touch... But like in real life, it must be done.  The game could use a bit more polishing, but it's very playable and enjoyable. Would love to have some of the audio in English, or at least English sub-titles. Some more ambient sounds. I have no doubt that as long as the developers continue to make improvements, this game can only get better.",
            "review_score": "1"
        },
        {
            "review_text": "brilliant game for any firefighting fan ! yes there are a lot of negative reviews but they are still working in the game but overall fantastic game !",
            "review_score": "1"
        },
        {
            "review_text": "It is a very promising game, fun, exciting ... Still needs adjustments, but I recommend this game because of the producers' promise to solve problems and evolve the game ...",
            "review_score": "1"
        },
        {
            "review_text": "        YouTube™ Video:  Emergency 112 The Firefighting Simulation - Wastebin Fire&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "I wanted to give the game a go before making any review so here goes.  After reading all the neg reviews I still decided to buy the game, worse mistake ever. The idea is great but the game is shocking, so many glitches the worst being that when waitinf for instructions in a mission it does not tell you if you have not completed a task you have to cycle through every firefighter to find whats not completed and sometimes even then nothing! at the end of the mission sometimes you end up having to return all tenders to the station and then it can glitchj so that when you do return the area you are meant to park in doesnt turn green and the game just hangss really.   This game could be fun but its not because its so shocking, it is a massive waste of £27.00, it should be a pocket money game at £9.99 max and even then I would say dont bother.  Really do not make the same mistake as me and ignore the neg comment DONT BUY THIS RUBBISH!!!! if you want to wast £27.00 send it to me :-)  ",
            "review_score": "-1"
        },
        {
            "review_text": "english translation please",
            "review_score": "-1"
        }
    ]
}