{
    "app_id": 491790,
    "name": "Project Syria",
    "release_date": "2016-11-01",
    "developer": [
        "Emblematic Group"
    ],
    "publisher": [
        "Emblematic Group"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Free to Play",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Free to Play",
        "Simulation",
        "Indie"
    ],
    "achievements": 0,
    "positive_ratings": 24,
    "negative_ratings": 48,
    "price": 0.0,
    "description": "Nearly one half of Syria’s 23 million people have been displaced in its civil war and no group has been as severely affected as children. Children make up more than half of the three million refugees living in camps some news reports indicate that children are actually being specifically targeted in the violence.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/491790/header.jpg?t=1547083364",
    "minimum_requirements": "OS: Windows 8 64 Processor: i5 Intel Memory: 8 GB RAM Graphics: Nvidia 970 or higher DirectX: Version 11 Storage: 150 MB available space",
    "recommended_requirements": "OS: Windows 10 64 Processor: i7 Intel Memory: 8 GB RAM Graphics: Nvidia 970 DirectX: Version 11 Storage: 150 MB available space",
    "reviews": [
        {
            "review_text": "Downloaded only to give it a ♥♥♥♥ review  Get this cancer the ♥♥♥♥ off of steam",
            "review_score": "-1"
        },
        {
            "review_text": "I couldn't even strap a bomb to myself, this is ♥♥♥♥ and NOT realistic. Why the ♥♥♥♥ would I want to be a syrian whatafuq? I also had to play this game twice and still wait just to get ♥♥♥♥ing 5 minutes to write a review. If you want a good way to spend your evening, and your only options are to play 5 minutes of this or KYS. KYS.",
            "review_score": "-1"
        },
        {
            "review_text": "They say a VR headset can be an 'empathy machine'. This is an attempt toward that goal. It's a few very brief scenes documenting the humanitarian crisis in Syria. It feels like something that might be played on a loop in a kiosk as part of a larger exhibit.   This is not a very polished experience. It is interesting for its aspirations more than for what it actually achieves.",
            "review_score": "1"
        },
        {
            "review_text": "I feel sorry for folks who wasted a 700$ worth HMD to run this ♥♥♥♥♥♥ propaganda.",
            "review_score": "-1"
        }
    ]
}