{
    "app_id": 491950,
    "name": "Orwell: Keeping an Eye On You",
    "release_date": "2016-10-27",
    "developer": [
        "Osmotic Studios"
    ],
    "publisher": [
        "Fellow Traveller"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Choices Matter",
        "Dystopian ",
        "Story Rich"
    ],
    "achievements": 27,
    "positive_ratings": 7045,
    "negative_ratings": 651,
    "price": 7.19,
    "description": "Big Brother has arrived - and it’s you. Investigate the lives of citizens to find those responsible for a series of terror attacks. Information from the internet, personal communications and private files are all accessible to you. But, be warned, the information you supply will have consequences.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/491950/header.jpg?t=1547632267",
    "minimum_requirements": "OS: Windows XP SP2+ Processor: 2.0 GHz Memory: 4 GB RAM Graphics: GPU: DirectX 9 compatible DirectX: Version 9.0 Storage: 3 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Do you like Dystopian fiction? Do you like games like Papers, Please? Do you like engaging detective stories? Then this game is for you.",
            "review_score": "1"
        },
        {
            "review_text": "  How far are you willing to go to protect the populace?",
            "review_score": "1"
        },
        {
            "review_text": "Orwell is a fun, engaging, clever, brilliant, unique game that I would say is a mix of L.A. Noire, Her Story, Papers Please, and a touch of Telltale Games thrown in.  You go about solving a main crime which, along the way, you will discover a group of characters--all suspects. You do this by examining, accessing, reading through, and hacking into many different kinds of online resources (this would be the 'Her Story' aspect of it: A game where you get bits of the story unlocked, piece by piece and out of order, over time). As you go on, you will learn more and more about the suspects and characters and you need to try to figure out what information is relevant and what is not. What points of info is truth and what is false. What bits of knowledge and writings and conjectures are sarcasm or jokes and what is being said with true belief.... (the LA Noire side of it). Can you read between the lines and use logic and intuition to decide what will help you with the case and what may NOT be so smart to share with the database?  You see, what you share with the database is totally up to you. This is the TellTale Game and Papers, Please side of it... in Papers, Please, you had the option, sometimes, to break the rules or turn your head to things based on what you believed to be morally right or true..or even just due to personal hunches or gut feelings. What you choose to forever put into the database will affect the story, characters, and outcomes in a big way...there are multiple ways things could play out depending on if characters are free, in jail, or even killed. Sometimes you even have choices to make in the spur of the moment. Events that will happen in a few minutes (in game time) that you can either stop or allow to happen to see how things play out.   ...but once you choose to document something into the database, the die is cast and you must live with your choices and then all you can do is sit back and watch things play out and hopefully not live to regret how it all turned out.  Would strongly recommend.",
            "review_score": "1"
        },
        {
            "review_text": "I must say I never heard from that game, after it pops up on Steam at its release date.  And I'm suprised to say, that this game catched me aloen by its name!  I awaited a Big Brother game ... and I got a Big Brother game ... a game, where you can be Big Brother yourself.  You take control of a new surveilance system called Orwell to find the people responsible for a terror bombing. Fot that you can check websites, 'listen' to calls and chats and search through phones and computers.  Pros: - Easy to learn gameplay - Fitting graphic style and background music - Good story - 'Just one more minute/level/stage' - Different endings and outcomes of story parts  Neutral: - 4-6 hour for a single walkthrough - Balanced 'Cliché' and 'Suprised' moments/characters  Cons: - A bit to simple gameplay (there are only some situations, where it is a bit hard to decide between different choices) - No 'dead ends' - Linear story progress  As this game offers its first (of five) episodes for free as a demo (works also as a tutorial), you can easily test out, if you like its gameplay. The initial price of around 10 € is very fair, so do the devs a favor if you like the demo and buy it directly. ;)  I really hope the devs use the base concept/gameplay for some more games! I really like that detective style of conecting clues. But at the same time I hope they expend the concept with video footage to analyze, dead ends, more conflicting clues.",
            "review_score": "1"
        },
        {
            "review_text": "Pros: - Art style is interesting and engaging - Story is well crafted and immersive - Exposition isn't forced on you, but it is there if you wish to learn more about the world or certain characters - Creators clearly spent a lot of time and effort on the setting  - The game tackles some pretty engaging ethical dilemas that are applicable to the world we live in  Cons: - Click and drag simulator 2016 - Uninspired gameplay mechanics  - Constant handholding (I kept thinking I was in a long tutorial but that's just how the game is) - Very binary choices (he did it vs she did it/ she did the right thing vs she is bad) - No real detective work the game just tells you everything - The game treats you like an idiot by having a sidekick tell you what each piece of info means   Other things that bothered me:  - Chat/phone calls move too fast to keep up with uploading the 'chunks' that appear and you're forced to either ignore the dialogue progression and try to click on a certain chuck as the screen constantly shifts or wait until the exchange is done to upload anything (or maybe I was just too slow).  - Music shifts in tone dramtically whenever 'shocking info' is revealed which makes the game feel very linear (which it is) instead of just letting you stumble upon the info yourself and make your own conclusions as to what is important. The music changes give the feeling of 'This was a scripted event that I experienced at a designated time.'  - Your partner/boss just tells you things so you don't really have to do any investigation yourself which is kind the whole point of the game.   - You are fed information in a pretty constant chronological stream instead being given all the info at once and having to sort through it with your brain. The game treats you like a baby and doesn't give you your next treat until you click and drag the things on the page it just gave you.   - The game established this rhythm really early of scrolling through a page, clicking on stuff, listening to your buddy pal guy tell you stuff, being given a new page, then repeating.  - The fact that the chats/calls don't start until you actively bring them up is quite harmful to immersion (why would the people wait to start talking on the phone for 5 seconds until I'm monitoring them? Just have them act like normal humans and not wait for the player).  - The gameplay would be a lot better if the events driving the characters weren't so close to the present. If we as players were given this new technology to help solve a crime in the past (several months at least) it would eliminate the need to have these awfully convenient text conversations and phone calls every 5 seconds that always have important info. What I'm saying is put the event in the past so that the player can be given a bunch of call transcripts and chat logs to sift through instead of being handed the info.  - The very nature of how the game highlights all of the important info for you makes you question what your job really is and why anyone would need you to do it. If they already have a system that determines what is important and human operators who interpret the data (your boss/partner guy), why the hell do they need you???  - The info highlighting eventually has you just scrolling through pages until something lights up or you get an update instead of actually reading the page and deciding what is important and what is irrelevant.     This is not a bad game by any means. It's just always frustrating when I see one of these 'choices matter' games where there's clearly a certain path you're encouraged to take and you really aren't free to do things your own way.  While I had pretty high expectations for this game after coming off a Hacknet binge, I just feel as though the game is trying to pretend to be something it's not. Just market the game for what it is, a linear narrative experience.  I'm very aware that since I did not finish the game my perspective is limited to what I played, but what I played I did not enjoy, so I cannot reccomend this game.  TL;DR: This game is a very and hand-holdy linear story based experience while it is advertised to be a sort of detective",
            "review_score": "-1"
        },
        {
            "review_text": "A game brimming with tension from the outset. Orwell is a look into the shady world of government surveilance through the use of hacking, spying and incriminating peple based on the slightest pieces of ' evidence'. It's a testament to our time.  Where do you stand?   Net Neutrality or Please feel free to investigate me for no reason at all.  A work of genius.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "I've deleted a lot of my tweets after playing this game. 10/10 would arrest more people for their tweets.",
            "review_score": "1"
        },
        {
            "review_text": "The game is really great so far (Episode 1&amp;2).  Very well polished, great Story, great UI (could use a tad better click/mouseover-detection though). The game puts you in the shoes of an investigator - reading through other peoples mail, communication etc to find connections to terrorist attacks.  You often have to rely on your judgement which parts to submit. They sometimes contradict each other and are submitted largely without context - so you could easily put suspicion on a person for a throwaway comment on the internet. The game really gives you a chilly feeling of 'how realistic is this?' - its awesome so far.",
            "review_score": "1"
        },
        {
            "review_text": "Wouldn't dare write a bad review. You don't know who's watching.",
            "review_score": "1"
        },
        {
            "review_text": "Well I can safely say that this game proves that playing a game is different then watching one get played. The choice of what to upload is up to you. (Though somethings must be uploaded to make progress) The act of making those calls is what gives this game weight. That and the impact on the characters. This is a timely reminder of a possible near future where too much freedom is given up for security. Provided you don't mind doing a bunch of reading and not just uploading everything I can safely recommend this game.   Not much re-playability but thought provoking and does not over stay its welcome.",
            "review_score": "1"
        },
        {
            "review_text": "This is a linear gameplay experience and unfolds more as an interactive story. You are a tool of the establishment and have to read and assess data from a number of sources. This could be emails, transcripts of telephone conversations, news reports or blog posts. You will make decisions on which data to upload to Orwell so that your supervisor can direct your next course of action in the fight against terrorism. Despite the fact that it is a wholly linear experience I am really enjoying it, having just completed Episode 3. If you are a workaholic that likes gaming you may enjoy this, as it is a game that feels like a job! It is a slightly disorientating experience when you are relieved of duty at the end of the working day and finally have to return to the real world.  Several of Charles Dickens' novels appeared as twelve monthly serials. People at the time were frantic by the time the next installment was due, such was the level of hype and expectation. Fortunately the episodes of Orwell are being released weekly with Episode 4 released on 10th November. Orwell thanks you for your service to the nation.",
            "review_score": "1"
        },
        {
            "review_text": "Cannot praise this one highly enough. You play as a goverment employee whose job it is to investigate a series of bombings by stalking the suspects on the Internet, listening to their calls, checking their mail, looking through their medical records and so on. Makes you feel like the scum of the earth. And the reason why it does, is it's incredible attention to detail, it is a very believeable world. People actually talk like real people, dating sites are full of ♥♥♥♥♥♥♥s, every one of the people you investigate is a real person with different tastes, relationships, catchphrases and backgrounds. This creates a feeling of authenticity of what's happening and makes it into quite a unique game. One of the best games I played this year.",
            "review_score": "1"
        },
        {
            "review_text": "Found this game accidentally. Played the demo and then finsh the rest of the game after inspired by the demo (1st ep).  Great game! Every ep makes you deep into the story, BGM, the feelings of the characters, and the story itself, let you feel you are in..actually in and closer to the truth...just with this simple interface of system! So creative!  It's a choice making game, choices cause the development of the story. There are true clips, nonsense clips and wrong clips. When you are struggling with them, it means you have already understood how to play it. To be honest, ORWELL may not be a good game for someone hates reading, perhaps a good practice of english reading for non-english speaking gamers.|ω・）  A small tip, the listener keeps happening once you open the dialog , depends on the situation, you may want to upload sth to make the story different at the same time by swaping into other windows.  You are the investigater, you are the player and you are the justice. I hope there will be more branches of the story?",
            "review_score": "1"
        },
        {
            "review_text": "Orwell has a lot of interesting concepts and provokes a lot of thoughts about privacy, security and the blurry lines of morality. It's a prettier version of a visual novel, so make sure you know that before jumping in.  It's an interesting game which is very captivating. It's broken down into episodes and was released weekly at the time of release. Buying this game now will give you an ongoing playthrough of the whole story.  The story and intrigue are the only thing that'll keep you interested in the game, as everything pretty much plays itself. When looking for clues and uncovering data, it'll highlight itself, so there's no real mystery solving or need for you to actually participate.  Definitely give it a try.",
            "review_score": "1"
        },
        {
            "review_text": "This game is brilliant! It has a gripping storyline and great, interesting graphics. 10/10 Can't wait for the next episode.",
            "review_score": "1"
        },
        {
            "review_text": "I don't normally write reviews, but I think I have to here. If you have any interest in narrative structure, or if you like detective novels, I strongly recommend this game.  The title may be somewhat misleading, as Orwell is not, in fact, set in a horrible dystopian nightmare future brought about by an overavundance of surveillance. In fact, The Nation seems like a pretty decent place to live.  You play an investigator operating the new 'Orwell' surveillance system, the most advanced data trawler/compiler ever. It's your job to upload relevant information pertaining to a series of people who may be connected to a terrorist attack. Due to the Orwell Code of Ethics, only investigators are allowed to upload things to Orwell. As a result, based on what you upload, other characters will make some very important, potentially disastrous decisions.  The game plays at quite a sedate pace, allowing you plenty of time to mull over what would be the most accurate and relevant information to allow everyone to make the best decisions they can, which is nice. What's even better is that this really makes it incredibly tense when the game DOES put you on a (usually very short) timer and forces you to make a snap decision that could get people killed.  The narrative has pulled a few ♥♥♥♥ moves so far (mainly of the 'Well that would have been good to know 30 seconds ago' variety), but none of them seem unfair, and they're entirely believable.  As a final big tick in my 'things that make a good narrative game' box, the characters all act generally sensibly and behave as you would expect rational human beings in high stress situations to behave.  tl;dr - 10/10 would upload again.",
            "review_score": "1"
        },
        {
            "review_text": "I am writing this review of my own free will, have no fear, there is no one watching me and there is obviously watching you  Have a nice day  We will see you soon",
            "review_score": "1"
        },
        {
            "review_text": "This game was really good, its kinda short but its definately worth it. It takes you through a roller coaster of inside jokes and serious shocks. I really recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "This is a very good game, so buy it!  The game is fairly linear, but that is also part of the constraints of the system, you can only flag up the things Orwell has identified as possibly important. This makes sense in the world, but sometimes can be a little frustrating when you can make some associations and realisations before the game does.   But really that is missing the point of the experience.   This game starts off easily and you don't have too much investment other than catching the perpertrators, however, as you begin to see the results of what you are uploading play out, you begin to get more personally involved in the situation and the decisions you are making. This is when the game really excels.  There was a particular piece in one chapter where I waited an age before finally declaring a piece of information. The outcome I dreaded, but knew would happen, occured, and it was all my fault. It twisted me up inside, but I still felt like I was doing the right thing, despite the consequences of what happened.  This is definitely an experience I recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Games like this renew my faith in gaming as an effective and original storytelling medium. My only complaint? Where's the next series of episodes?! Don't leave me hanging!  10/10. Would surveil again.",
            "review_score": "1"
        },
        {
            "review_text": "This game is well worth your money. It offers a superb story; a story that is especially relevant (most likely intentionally) today. There are very few bugs, and none of the bugs are gamebreaking. I highly recommend this game and I am suggesting that it be nominated for 'best story' in the Steam Awards.",
            "review_score": "1"
        },
        {
            "review_text": "  This seemed like a novel and interesting title when I first found it. After playing through I can say this is so much more.  When you talk about games that move you people might say things like Mass Effect, Deus Ex, and various other story based games, or if we look at the indie side of thing you will get: Brothers: A Tale of Two Sons, This War of Mine, and To the Moon.  I can tell you this game does it just as effectively, if not more so, because YOU -- the actual you sitting at your computer -- are a charter in the game. Add that to the decisions you have to make and the pressures you will feel -- even though it's just a game -- it will make you react to the story almost as though it is real.  You will care about what is happening, deeply.  You will be unable to stop, just like with a good book.  And all that's just the story, this game is also basically a case study of a surveillance state, like in the book 1984 (as you might have guessed from the title of the game) and references to the book are ♥♥♥♥♥♥♥ everywhere.  So, should you buy it? IMO yes you should it is an amazing experience. If you like visual novels (Ace Attorney comes to mind) you will love this. (as it basicly is one) If you like a good book you will love this. If you like just a good story you will love this  And for that reason, should you consider ever buying this, I vehemently urge you to go in completely blind -- if you haven't read the description about this game on steam, don't. This game is better the less you know of what is going on when you start, and if you spoil it all the magic will be lost.  However should you come here expecting a good 'GAMING' experience and you care little for the story you will be very disappointed with this game as gameplay is as simple if not more than many of the classic flash games on sites like addictinggames.  I give it a 9/10 though it pains me to do so  I just can't give it a perfect to to some niggles in the interface that are simply annoying.  Regardless you should play this game (try the demo, it's part of the actual game not some curated bull crap like ubisoft does)",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely adore this game. It's intriguing and engaging, not too difficult but still clever. The game uses music effectively to set the mood for different events and it's overall an incredible game even though the mechanics are so simple.",
            "review_score": "1"
        },
        {
            "review_text": "Orwell had me lost for words. Featuring a variety of references to George Orwell's dystopian political and surveillance novel, the game offered an interesting concept as to what may have been the beginning of Oceania. Of course this game has no canon with the novel that I happened to study in school just before discovering this game.  There is something extremely captivating about playing a game in which you dig into the most private aspects of the lives of several different characters. From the start, I was sure that there would be some revelation that you should not enter information that may harm the futures of these potentially dangerous characters but the actual plot twist featured at the end of the game was both unexpected and in a way poetic.  This game surpassed my expectations and with a beautiful soundtrack and imagery featured through-out this Papers, Please reminiscent game was captivating and extremely fun. I highly recommend it.  Notes: I played the first episode/demo for free before purchasing the game and playing all but one episode in one night (I would have played the final episode but I had to go to sleep for work the following morning).",
            "review_score": "1"
        },
        {
            "review_text": "This game is really interesting. The narrative is awesome - I did feel like an investigator and after a couple of minutes with each new character I did feel like I know them. From the gameplay perspective, there is a lot of reading. You do nothing but read in this game. But it is amazing and makes you change point of view on the case not just once. This game makes you think not just about morality of the case that is being investigated, but the morality of investigation itself. Love this game and I can imagine playing it again.",
            "review_score": "1"
        },
        {
            "review_text": "Highly Recommended. Story is well crafted, with twists that I certainly didn't see coming. The issues dealt with within the game (survelliance, privacy etc) are also very relevant to the present day. A bit on the short side and not much replayability, but still a highly enjoyable experience regardless.",
            "review_score": "1"
        },
        {
            "review_text": "&gt;be me &gt;wanting a game where choices ACTUALLY matter   I just wanted to do the right thing... but what if the right answer really isn't the right one?   I didn't realize picking up this game was going to cause this much thought to really rise inside of me. The story, the people you grow to know... the concept is so scarely possible in a near future that it makes you almost wonder... do we live in a world going down this path?  Minimalistic in art and contol yet has the most depth i've ever witnessed in a game like this. A game of this genre. It's the perfect dystopian fiction that reminds me of Fahrenheit 451 (I probably spelt that wrong). Just like the end of that book, this game made me really just sit back and think about everything, which doesn't happen offten.   The game runs smoothly and for the price of $9.99 (bought it during the Winter Sale tho) it really is worth every penny in the end. You really grow to love this game and I just... wow...   Just wanted to do the right thing...",
            "review_score": "1"
        },
        {
            "review_text": "The first playthrough was satisfying but the second playthrough was much better. The game feels like it is a very linear progression where one finds evidence and after moving on by submitting evidence goes on to the next chapter but when you replay it you realize that the game tricked you into providing evidence and you don't really have to provide anything and this does impact the branching story",
            "review_score": "1"
        },
        {
            "review_text": "The story in this game was very well written and full of surprises. In addition, it closely enough resembles actual investigation without being as muddy that I fully enjoyed it. I'd recommend this for anyone who has a knack for curiousity, problem solving, investigating, or information security.",
            "review_score": "1"
        },
        {
            "review_text": "Loved this game!  - art is fantastic  - storyline is intense  - got irritated at some points  - sometimes I found myself staring at the screen and googling for advice.  - sacrificed sleep to finish the game tldr; was worth it.   (short review warning)",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. Loved the idea and loved the execution.",
            "review_score": "1"
        },
        {
            "review_text": "Definitely worth a play. It is short, you may only get one playthrough out of it, but it's a very well told story if you are at all into the big brother concept it portrays. I eagerly await the 5th episode!  I had been watching this one for a few weeks now, and I'm glad I decided to purchase it. Gameplay is sort of linear, and part of me wishes it didn't point out exactly what you needed to click on next as that mitigated the investigative feeling a little bit, though there are a few spots where you can decide which 'truth' to go with, and I assume this changes the story around a bit.   On the other hand, I quite like that the 'hand-holding' present does keep the story moving and remove any dead searching and re-reading time that would be painfully present otherwise.  All in all, worth the purchase. I can only hope the ending is worthy of the rest of the story. I will update this if I remember after the 5th episode comes out!  To the devs, Great work so far! Beautiful, easy to understand interface, well written story, and a few heart jump twists.",
            "review_score": "1"
        },
        {
            "review_text": "The theme of the game is very interesting, particulary if you enjoyed 1984 book or like conspiracy theories. Beside that I cannot recomend the game mostly because I find it very simplish for it`s price... it`s just a point and click on web pages, some kind of modern read tale where you can make choices by selecting bunch of data from websites.",
            "review_score": "-1"
        },
        {
            "review_text": " Overview    I really enjoyed this game, your choices actually matter and can change what happens. Unlike other game which give a false illusion of this. As you progess the story gets juicer and juicer and i got hooked on it very quickly. This game is not about graphics in the least, it doesnt have the worst ever but not the best either. The game is about the story.   ",
            "review_score": "1"
        },
        {
            "review_text": "At first I was intrigeud by the concept of the game but after 30 minutes of gameplay it felt more like a guided tour than an interactive experience.   The game starts with CCTV footage of a bombing at a plaza. In that footage a woman who has a criminal record is identified. From her you will start your investigation. The game presents you with newspaper articles, web pages as well as personal communication logs in which you will find marked passages of text or pictures, so called data junks, which you can upload to an agency to complete a person profile as well as finding connections to other people.   Unfortunately you can't upload information which the game itself deems unrelevent. Some information which is rather useless needs to be uploaded to progress. Some information will even be taken out of context and there is nothing you can do than upload it and watch your handler making the wrong asumptions.  In one instance you have the profile of a person without the picture. You will find that persons picture very soon but will be unable to upload it. In another instance a data junk you can upload will be totally out of context from the conversation it can be taken. The worst was that on time where I could not upload proof of a direct connection beween a persons statement and the letter of intent which was sent to a ploice department prior to the bombing. Ironicly, at the very beginning, the game warns you to make sure not to upload anything that might be misleading or irellevant.  If you are looking for a story in wich you just press highlighted pieces of text to progress this might be the game for you. If you where hoping for a game in wich you are asked to find out what happened using online surveilance you might want to look somewhere else. ",
            "review_score": "-1"
        },
        {
            "review_text": "Honestly, the most fun I've had in a game in a while.  The game is heavily based off of George Orwell's 1984, and by god do I love it. I even managed to get several friends into it as well. All in all, 9/10, mostly because it's episodical.",
            "review_score": "1"
        },
        {
            "review_text": "I have been waiting for this game to come out ever since I saw it at PAX West.  It is exremely fun.  You actually feel tied to the cases that you are assigned to. The story is so immersive that you actually have a viseral reaction when something happens.  There is a mechanic in the game that keeps you for just spam clicking information. This makes you really think about what you are doing and what your choices can affect.  Hacknet was a good game. This is a GREAT game.",
            "review_score": "1"
        },
        {
            "review_text": "So I got this game because I read and absolutely  loved  1984. There's plenty of references to the novel that are absolutely wonderful, but that's besides the point.  Orwell is a 'Big Brother' simulator- You play the role of 'Big Brother' as a cog in a mighty Orwellian machine. You prevent a couple of crimes, possibly get someone killed, the usual Big Brother stuff. Then you fall foul of a hacker who's learned about the machine (Aptly named 'Orwell') from a source known as 'W1n5t0n'. This happens around Episode 3. This hacker is a threat, and leaks data on a government employee, leading them to become the head target for Orwell... Until the activist group they're part of catches wind of you. There's three possible endings which I won't delve into too much, but suffice it to say that one of them lets you become Edward Snowden. That's the one I picked.",
            "review_score": "1"
        },
        {
            "review_text": "I can appreciate Orwell so far, even with the lack of content in the game. The concept seemed justified for a story-driven game, and after trying out the free demo (good on your part devs), I was intrigued by the subject matter and decided to give the full game a try. The highlight of this game will be the discussion with the community about different plot points they encountered. Already in the first two episodes, it is evident that every decision you make in Orwell, even the ones not explicitly highlighted, can alter what happens next. From the looks of it, the story will branch heavily based on your choices to expose certain information over others. Do what you think is morally right, or rat out every little secret someone has, the choice is up to you. It is your job to do your best to keep the people safe, by any means necessary.",
            "review_score": "1"
        },
        {
            "review_text": "There are very few actual choices available to you. If you want to choose not to divulge certain information, the game simply does not progress. There is very little content so far. I can see the potential here, but as of right now there is not much here other than a short story where you have to click on some key points to make it go.",
            "review_score": "-1"
        },
        {
            "review_text": "Gotta say I took a risk and bought it based on the premise and what info you gather from the trailer alone. Did not disappoint. I must start with the 'bad' - the game is episodic, and on release 2/5 'episodes' are available. Unfortunately, the game presents a focused story, so breaking off just as it starts to wind up is unpleasant. That said, the following episodes are supposed to be released within the upcoming three weeks, so I guess that's acceptable.   On to the points.  Facts:",
            "review_score": "1"
        },
        {
            "review_text": "I really love the art style and the storyline so far is really good.",
            "review_score": "1"
        },
        {
            "review_text": "Not very happy about all the episodes not being released at the same time, otherwise, a nice solid experience. Not much choice to be had but intriguing none the less. 10/10 regarding UI design and telling you where you missed something.",
            "review_score": "1"
        },
        {
            "review_text": "Orwell is a text heavy Investigation game, you play as a goverment agent tasked with using the ORWELL surveillance software during a trial investigation, however, in true adventure game fashion, the deeper you dig, the deeper the case goes.   Elegantly simple interface, compelling narrative, and a real sense of creepiness as you listen in on conversations of your suspects.  It's reminiscent of Papers, please. Except you're not working for a fascist government.... or Are you?  10/10 would recommend, especially at it's current price tag.   Update all 5 eps are now out! And Got Elements of Black Mirror and 24, WHAT MORE DO YOU WANT!",
            "review_score": "1"
        },
        {
            "review_text": "I very very very reccommend this game. It may not be very long - I have completed several playthroughs to part 5, in 5 hours. But it is good under the merits of emotions. I connect with the characters in a way I usually don't, and this is especially effective at makign the game more enjoyable. Also, nice name guys. Orwell? George Orwell? 1984?",
            "review_score": "1"
        },
        {
            "review_text": "Its really cool. every action has its pros and cons , loving the story so far. Keep it up (:",
            "review_score": "1"
        },
        {
            "review_text": "Great game!",
            "review_score": "1"
        },
        {
            "review_text": "It turned out to be a really good game. It left me wanting more.",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "Straight up amazing! If you where at any point in time thinking: 'Hey, what's so bad about a little more security?' in regards to mass surveilance. play this! This puts YOU in charge of being THE surveilance. You get to make all the right calls, for all the morally correct reasons. How could that possibly go wrong? If you got nothing to hide, there's reason for privacy, right?",
            "review_score": "1"
        },
        {
            "review_text": "This game is close to being unique (it's a bit Hacknet/Uplink but with a wonderfully minimal UI and no typing (yet), it also reminds me of a 90s game called Floor 13 which was about conducting political espionage), is interesting and smart, and is just overall fun to play. If you want to embroil yourself in convicting people of crimes based on things they've basically written on Facebook then go for it.  Negatives: The choices, I suspect, will only ever be binary. The fact that the game flags up conflicting data-chunks **even thought you've only seen the first one of the two** works against the immersion slightly.  But overall I'd wholeheartedly recommend this to anyone who wants to play a game about heavy-handed surveillance culture where anything anyone does works against them.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting and you put your mind to it, worth trying",
            "review_score": "1"
        },
        {
            "review_text": "8/10",
            "review_score": "1"
        },
        {
            "review_text": "Highly Recommened. The graphics for this game go right along with the game itself without any cringe factor or wishing for them to change it. How they push out dialogue without you craving for a voice behind it is just absolutely amazing. You make up your own voice as they go! And how your choices matter. What information you put into Orwell and what you don't MATTERS. The story is just phenomenal.",
            "review_score": "1"
        },
        {
            "review_text": "It is amazing how engaging this game is.",
            "review_score": "1"
        },
        {
            "review_text": "I wanted to like this game i realy did, however this game is just so hollow. I not aginst games being split into episodes but not only was this first episode short it was dull and boring.   And as for the game play I say this.....WHAT GAMEPLAY?????  Ive seen tell tale games with more gameplay than this. Literaly all you do is just read fake files and news articles and drag and drop important info into the suspects profile, now that sound fun untill you realize the game highlights everything that you need to put into the profile handing everything to you and presenting no gameplay AT ALL let alone any kind of difficulty.   Its a cheap game and I can see what they where trying to do with it, but to be honest this game is more hollow than a basketball. If you can get it for 75% off go for it but other than that dont waist your money.",
            "review_score": "-1"
        },
        {
            "review_text": "The only thing I have found nice in this game is the interface. Aside from that, there is little meat around the bone.  I've seen free games on Kongregate that are longer to finish than this game. Also, it's another of these incompleted games that comes into chapters... I mean come on! This ain't a graphic-based game, surely you can publish a complete game... it's just text damnit! I know games in the 1980s that were deeper than this!  Where is the gaming industry heading anyways with such tiny games? Make this thing free. If I can get bigger better games for free, why should I pay for this?  It seems linear, at least I did not see any changes... reminds me of The Walking Dead series minus the interactions.  I cannot recommend this 'game' until it is finished and takes as much time as it costs in dollars in hours. Right now, should be 8 hours of gameplay but it's like 30-45min of gameplay (that's what it took me to finish both chapters... very very short chapters... I mean my 10 pages short story is longer than this).  I,ve asked for a refund. My thematic boardgame prototype has more text, depth and replayability than this computer game, I am not even paid to do it.  Don't buy until the full game is here otherwise you will be disappointed with this 30 min game... go play free games on Kongregate instead, much more fun and cheaper.",
            "review_score": "-1"
        },
        {
            "review_text": "Incredibly immersive and immediately hooked me the whole way to the end of episode 2. I was actually upset when I came to the end of episode 2 and found I had to wait longer. I got chills almost every time the music got more intense when something important happened.  Overall: Absolutely worth the money to get it if you like story driven games. It really makes you think about possible connections and all that, so it's totally worth getting.",
            "review_score": "1"
        },
        {
            "review_text": "Very good read. Not so much a game, as there's a few choices here and there, but no real freedom.",
            "review_score": "1"
        },
        {
            "review_text": "great story so far!",
            "review_score": "1"
        },
        {
            "review_text": "Love this game! It's very engaging, and it's very unique compared to other games I've seen. I definitely recommend it, and I can't wait for the next episode to come out!",
            "review_score": "1"
        },
        {
            "review_text": "This game is really good, the interesting story line make you feel like you inventigating the bombing that happen. The more I played it the more I didn't want to stop. Can't wait for November 10 to continue the story.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, I really love it. It's captivating and challenging. No so easy, but still fun anyway.",
            "review_score": "1"
        },
        {
            "review_text": "Great story ! reminds me of playing uplink in away :-) Really looking forward to episode 3  ",
            "review_score": "1"
        },
        {
            "review_text": "I'm sure it's been said a billion times in other reviews but this is really not a game. It is more of an interactive story.  There are a few points where you have to weed out incorrect or conflicting information but that is about as much gameplay as you are going to get. If you are on the fence, try the demo first!  That being said, I have not been as engrossed by a story in a long time as I have been with Orwell. They are only on episode 3 when i wrote this and it seems like forever til the next one comes out!",
            "review_score": "1"
        },
        {
            "review_text": "Today i woke up, whole internet was down, social media was also down.Police arrested few people and there was an explosion at the earlier hours of morning, do you think that's a coincidence ?   12/10 This is not a game, this thing is real !",
            "review_score": "1"
        },
        {
            "review_text": "Creeping NSA guy in a basement simulator 2016",
            "review_score": "1"
        },
        {
            "review_text": "I saw this game when I was looking at games that were just added to steam, bought it on a wim &amp; it's pretty fun.",
            "review_score": "1"
        },
        {
            "review_text": "An intriguing game experience. You are at the helm of an omnipresent surveillance system, analyzing different sets of data. Although the datasets are often very binary or exclusionary. But this in turn can lead to your decisions being important in the long run. It all happens from a web interface.  I would love even more if someone remade Sid Meier's Covert Action (1990), where you don't just collect data sets, but also try to analyze them for a bigger picture. But this is a very intriguing game, and it highlights a lot of the same problems we are facing in today's societies.",
            "review_score": "1"
        },
        {
            "review_text": "So far, (waiting for the next episode) a FANTASTIC game, full of mystery, intrigue and an intricate plot... 100/10",
            "review_score": "1"
        },
        {
            "review_text": "TL,DR: Excellent game and worth to replay to get the different sides of the story – 9/10    For those who like me read “1984”, when the name ORWELL pop-ups on steam something inside our minds sparks the memories of the dystopian society presented by the author, so we check the game to see if it has something related to our imagination.  We are presented with a detective-type game, but since the first episode is free (great move to attract new players, well done) why not give it a try? Well my friends, although it’s not a game about the book, I see this as a modern times adaptation of the “thought police” present in the book.  Although know you can play it without interruptions, please stop at the end of every episode to check the steam forums, because the doubts, the theories, the mistakes you made, it was all felt by us who played one episode a week and oh boy, it was fulfilling to read them.  So, to finish this review, be prepare to immerse in a world with a great story and where you can feel the air get heavier as the consequences of your actions kick in. ",
            "review_score": "1"
        },
        {
            "review_text": "This game is more of a great piece of political commentary than a game, but would still be classed as one of my favorite 'visual-novel' games.  You are John Orwell (by that, I mean you have no name) and you stalk several known suspects in a series of bombings pertaining to a revolutionary group. You look through phone calls, emails, personal computers, and websites, finding bits and pieces of each character with the reward of finding more websites and other methods of stalking the suspects. As you progress, learning more and more about each of the characters, events will occur in which whatever data you give to the Orwell system (which wins the award for most blatant symbol in the history of visual novels, IMO) results in either arresting key individuals, letting them go free, or letting them die, in the typical 'your choices matter' way.  The are a few problems that are mostly negligible. For one, the game was a bit... unstable on my moderate PC rig, freezing twice and crashing three times (albeit I think one time was intentional, like that boss in Undertale, as an attempt to keep me invested in what is happening). While this would be a major problem for some other games (see any modern Bethesda work for more info), the game has a really nice auto-save system, saving at every bit of data you give and at every major event; all three times the game crashed, I was back to where I was within 1 minute, mainly due to my next problem. This game has one of the WORST load times in a modern, under 1 GB game. Fortunately, this is mitigated by the fact that it only loads once you begin the game, and doesn't even stop in between episodes, but that moment when I waited for the game to load after the game crashed in the middle of the last phone call in the game infuriated me. This leads me to my biggest problem with the game: the ending is a bundle of disappointment. Episode 5 consists of you closing out the last few leads, followed by a double whammy of contrived Shyamalan-esque plot twist and three-way ending that makes pretty much all of the choices leading up to it moot.   Regardless of my long rant, I still recommend this game on premise and message alone; it's a modern tale of the concept of hyper-security and both the good and bad of it. The first 3 Episodes basically say, 'It's a terrible idea, but it's necessary to save the lives of others'. Episode 4 shows how wrong it can go with a character's information getting published online, and Episode 5 cuts the bull and directly asks you, 'What would you do if you could change or shut down the system?' It's a interesting story, with thought-provoking dialogue, and was almost done in an entire 4.5 hour sitting (the final episode came out 2 days after I binged through the first four episodes)  PS: The game is about 5 hours long, so if that effects your purchasing decision, there you go.",
            "review_score": "1"
        },
        {
            "review_text": "Worth the price of entry.",
            "review_score": "1"
        },
        {
            "review_text": "Well made game, great commentary on the current state of surveillence with a fantastic soundtrack and disturbing atmosphere.",
            "review_score": "1"
        },
        {
            "review_text": "Enjoyed this series as it came out over the past few weeks. Would recommend it to anyone who enjoys story driven games with some moral relativity. I also appreciated that it doesn't beat you over the head with a pro- or anti-goverment message. Although the game does skew toward an anti-observation stance, the player still effectively prevents crimes and catches wanted suspects using these tools, thereby showing how effective a program like this could be in the real-world, even if it comes at an insanely high price for personal privacy.",
            "review_score": "1"
        },
        {
            "review_text": "Superb game! It is not a very long game but is very much worth the buy. I hope that there will be a quick followup. ",
            "review_score": "1"
        },
        {
            "review_text": "I just finished the last chapter of this game, and this is what I have to say: Orwell is a very, very, very, VERY good game. An amazing game! Worth every penny I spent on it! It's nominated for The Game awards 2016, and toatally deserves it. If you like invastigations, mysteries or investigating mysteries, if you like story-driven games or if yoy simply enjoy stalking people online, I HIGHLY recommend you give this game a try. You will not be disappointed! The gameplay may feel to simple and the plot too linear at first (I know some people got that first impression), but please hear me out: This first impression is almost as far from the truth as it can get.  Now that you understand how good this game is, let's talk about what this game is ACTUALLY ABOUT : So, in this game you are playing an investigator for the secret goverment program called 'Orwell'. Your job as an investigator is, well, to investigate. How? Well, you have Orwell at your disposal! This program allows you to snoop around in other people's data that can be found online: public data and private data. data that was posted online willingly and data that noone knew even existed on the web. True, useful data and lots of half-truthes, misinterpreted information and straight-out lies. You need to find and gather this data, decide what's right and what's not, and report it. Watch out, though, once a data chunk has been reported there's no going back - you must commit to whatever you belive the truth and face the consequences. And believe me - THERE WILL BE CONSEQUENCES. Your decisions can and will affect the lives of tens if not hundreads of people. Maybe even the entire nation. The story starts right after a bomb was set off in the middle of the city of 'Bonton' in the nation called 'The nation', (I know, such a good name for a country. Wanna guess what's the name of the prime minister's party? Yup - 'The party'.) killing many (can't remember the number) civilians and generally making everyone feel a bit worse about everything (What can you expect? A bomb just exploded in the middle of their city...) You start with barely any information - your only clue is that one person - a blue-haired woman - who's known to the police was spotted near the site of the attack just before the explosion. Now you and your trusty advisor 'Symes' must get to the bottom of this attack and try to prevent any future ones from occuring. On your way you will start to uncover many secrets - about your suspect (and the others that may or may not appear later on), about the mysterious group 'Thought', and even about the entire nation, it's leaders, and Orwell itself.  Good luck ;)",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite games so far. I think I will have to play this again. Too bad that it was only 5 episodes.",
            "review_score": "1"
        },
        {
            "review_text": "I love this. Great original concept excellently delivered.  A very absorbing experience although not all that replayable, well worth it at 9,99 EUR.  Highly recommended, and I don't say that lightly.",
            "review_score": "1"
        },
        {
            "review_text": "Wow. That was a-maz-ing. I couldn't bring myself to leave my computer for 4 hours of my weekend. The idea of the story and the excellent tie-ins kept me intrigued and wanting more. The easy to pick-up gameplay mechanics and rich story were only compliments to the simple idea behind the game, The idea of mass surveillance is brought to light, and the player is lead to discover the truth and choices DO MATTER. The magnitude of your discoveries are represented later in the game, and I was amazed by the details kept under my nose because of my ignorance. My ONLY complaint is in chapter 4 looking for a major detail, it took me 15 or so minutes and I became rather frustrated, but the reward of the find was worth it.   I would play again any day of the week and I look forward to the future of the game.  10/10 Matthew",
            "review_score": "1"
        },
        {
            "review_text": "This game is very interesting.  I went in thinking it would be a simple narrative, and would be an interesting story which I could waste a little time with... I love it so far. Gameplay wise, it is spectacular! The idea of the context you give the overseer (for lack of a better world) makes it really cool. You can paint someone out to he a danger to society, or a lost soul. The most powerful moment however is when you make a mistake!  I love this game.  Plain and simple",
            "review_score": "1"
        },
        {
            "review_text": "PLOT TWIST! dont read this or u will know everything!   POLICE GOES TO HER HOUSE TO ARREST HER. THEY KILL HER BCUS SHE HAS A GUN XD    This game is suuuuuper cool i recommend it. U know. PLOT TWIIIIIIIIIIIIIIST. (i like music here especially when smth bad happens).",
            "review_score": "1"
        },
        {
            "review_text": "This game has very good concept and great story about surveillance. Revolutionizing visual novel genre to next level using interactive, intriguing data and bring new perspective. Full of plot twists and confusing events.    Absolutely Recommended",
            "review_score": "1"
        },
        {
            "review_text": "Honestly one of the best games I have played all year. I loved this game from start to finish. Recomend to literally everyone. Very 1984ish. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Really good game!",
            "review_score": "1"
        },
        {
            "review_text": "Orwell lets you datamine in order to stop a terrorist plot, but not all is as it seems. What will your role be in the future of The Nation? Using very unique mechanics Orwell tasks the player with only one goal: Upload all information needed to solve the ongoing terrorist investigation. It is now up to you to decide what that means. Engrossing and interesting story that had me weighing every choice carefully.",
            "review_score": "1"
        },
        {
            "review_text": "Really, really dark story. This is not a game ... is a documentary and we are all in it. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "loved this game! very thinky. only bad thing is that its not longer or that there is not another one. A++++++++",
            "review_score": "1"
        },
        {
            "review_text": "Honestly, a wonderful game. I can't put it any more simple than that.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome. Breathtaking. Inspiring. This game does not preach that a surveillance state is bad, it shows you. It is the most convincing argument against 'If you have nothing to hide, you have nothing to fear.' There are no evil people in this game, no sinister motives. Everybody, including you, just tries to do the right thing, but good people end up suffering none the less.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game! First of all, the plot is amazing! There are multiple endings so it adds replayability. Short but immersive game.  10/10 Definetly worth buying!",
            "review_score": "1"
        },
        {
            "review_text": "I must say that this game has become in one of my favourites, it has all that a good game needs to have, I really have tons of expectations for Orwell like DLC's or more various content. Due to the fact that this game needs of your reading comprehesion skills, very well developed to be able to see beyond of the context to get the main idea of what the game is showing you. Another thing that will improve more the feelings trough it, in my personal opinion, is voices to the phone calls i really think that would be awesome and will give it that touch to game.   As i said before i have a lot of expectations on this videogame i think theres an opean sea of possibilities for it. So Osmotic studios GO FOR IT! you have already done a very high level video game dont waste the potential that this game has.!!!!! love and cheers for all Osmotic Studios members. &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Great story",
            "review_score": "1"
        },
        {
            "review_text": "Short, linear, but tells a very interesting story and very fun for a playthrough or two. Recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Still not sure if I helped or hindered the world in the end, but I did realize I enjoy reading other people's personal email way too much.  10/10 would snoop again.",
            "review_score": "1"
        },
        {
            "review_text": "Concept : Good Execution: Great Story: Good Characters: Good except for one who was difficult to empathize with. Ending: Felt rushed and somewhat ham-fisted, but maybe I just chose a poorly written ending.",
            "review_score": "1"
        },
        {
            "review_text": "Orwell is a good piece of political commentary that forces the player to weigh the consequences of new-found national security legislation. Kind of like Stanley Parable, your choices impact the outcome of events in-game.",
            "review_score": "1"
        },
        {
            "review_text": "An interesting little detective game that I decided to pick up for the hell of it.  While there's not a whole lot to the gameplay itself, I found the story very immersive and quite thrilling at times. Although a little short, finishing my first playthrough in just 4 1/2 hours, I feel as though there's more to be discovered and experimented with, making different decisions and seeing what other outcomes come with it.  I thoroughly recommend it for the reader and detective types, but if you're expecting some Watch_dogs-esque camera-hacky gameplay and stuff, it may not be for you.   Whilst the Deluxe bundle is on sale, I recommend it thoroughly for the soundtrack also.  Although, the soundtrack on its own at $10US (full price) is a little steep for me.",
            "review_score": "1"
        },
        {
            "review_text": "Utterly enthralling from start to finish. Excellent writing and design which always leaves you not completely sure of the right course of action, thus creating one big moral grey area.",
            "review_score": "1"
        },
        {
            "review_text": "I own 457 games.  None have been as engrossing or as thought provoking as Orwell was. Evocative, powerful and moving and an accurate commentary considering the gradual erosion of digital privacy rights in the modern world.  Not so much a game, as a bold political statement that allows the 'player' to draw their own conclusions on whether security is worth privacy and whether peace should come at the price of freedom.  It certainly lives up to it's name.",
            "review_score": "1"
        },
        {
            "review_text": "I'm still in Episode 1. I'll get to the point immediately. So far I've found this game quite frustrating for two reasons:  1. Your 'handler' does suspect interrogations. He manages to make a complete ♥♥♥ of himself by pointlessly antagonising the suspects, and is saved only by the sheer volume of information you've painstakingly gathered. The in-universe explanation is that he has to act on pieces of information you have uploaded in Orwell, so while I'd like to see more dialog sophistication at such critical junctures (there's a method to do it, read it up online), I understand this would drive up design complexity, and therefore cost. Still that display of brute force was a bit annoying    2. Some things aren't as compartmentalised as you'd expect.    You wouldn't expect an analyst to tell a strike team how to do their job, yet informing people on the ground of an impending danger might cause your handler to panic and instruct said strike team to go 'all in', when in fact they should be the ones making the call. Where did they find this guy again? Anyway the resulting mess was his f-up, but of course you're the one who uploaded the intel, and you're the bloody player, so you're left feeling like it's your fault.   Also, when a suspect chooses to escape via the back window while the police are banging on the door, they shouldn't bee too surprised to find they're surrounded. Again, uploading that piece of intel felt like I was telling the strike team how to do their job... but frankly if they didn't know they're supposed to cover every exit, I might as well. They showed incompetence, and this frustrated me.     That said the game managed to get me emotionally invested (enough to write a review, yay!) so I'd definitely recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "When I saw a game named Orwell, I just knew I had to play it.  Orwell is a fantastic, stark look at a very big brother type of government can monitor and control its population.  You play as an investigator looking into an increasingly complex terrorist plot against the fictional nation. At your disposal is the Orwell system, capable of looking into the complete digital lives of your suspects and finding their intermost secrets in an attempt to stop them.  All the while, it makes you think whether or not what you are doing is the right thing, and how much control is too much control.  It is a game that gives you questions. Questions that challenge you and your opinions. And that is great!  If you want a game that is deep, questioning but also fun and satisfying at the same time, them you need to get this game",
            "review_score": "1"
        },
        {
            "review_text": "Very engrossing game, I ended up playing it for 4 hours straight just to see the ending. I'll likely return to it for a second playthrough too, as the decisions you make have both immediate and long-term impacts on what happens in the game.   Very fun, and nice artistic style as well.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game, I've played nothing like it before. Seriously well written and engaging storyline from start to finish. Highly recommended :)",
            "review_score": "1"
        },
        {
            "review_text": "Most Thought-Provoking Snooping Simulator of 2016. 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "I'll admit, I was skeptical, even with all the glowing reviews on Steam. However, bored with playing the same old games, I decided to give the game a try since it wasn't even 10$. As I started up the game, I asked myself - how this game could possibly keep me interested? It's a game where you're literally staring at a 'computer' screen in-game.. when you're already staring at a computer screen in real life. Not even 10 minutes in and I was hooked. I needed more information and I needed it NOW! I got really invested in the fictional characters stories, lives and background; why did she break up with him? How long were they dating? Why is 'X's relationship with her parents so strained? I looked through every single e-mail and chat message I could find. I listened to countless phone calls and actually cared what was said and listened intently. All the while snickering to myself because the fictional characters didn't know I was listening in on their conversations.   This game proves that sometimes being innovative and creative pays off. The game was worth every last dollar. It's relatively short (6 hours) and I played all the episodes straight through, but it still managed to keep me excited and interest throughout the whole game. I kept playing 'just 10 more minutes' to find new information. Although only 6 hours long, I felt like it's the perfect length. Any longer and I probably would have started getting annoyed (because I did want to find out the ending to the story).   The only issues I had with the game was that it doesn't really explain how the 'upload information' works. It tells you very briefly what your job is - to upload information, but I didn't understand that I could literally choose what information to upload and what to withold. I thought I had to upload certain information to continue with the story - turns out that may not have necessarily been the case. I actually got an ending I didn't intend because even at the end of the game I wasn't really sure what I was supposed to be doing (how did I access information, not upload it but still continue with the story?). You would think 'upload information' would be an easy concept to understand and wouldn't really need a tutorial, but in my case I would have liked a proper 2-3 minute introduction to how Orwell 'works'. The fact that you can choose what you do and do not upload, and depending on that - there will be different concequences.  The highlighting of relevant text kinda made the game too easy, but I do understand the necessity of the function. Any real-life program such as Orwell would probably have a similar feature that highlights relevant information. I felt like it made the game more realistic because occassionally while reading an on-going chat, I could quickly scan for relevant information that was highlighted - upload it - and then continue reading the conversation.  I really idn't realize that my actions of uploading certain information would have concequences; I guess I thought the game was a lot more linear, not that I could actually influence what happened by what I did or did not upload.   This was really unique, both in game-playstyle as well as story telling. I'll be playing it again, that's for sure.",
            "review_score": "1"
        },
        {
            "review_text": "My though processes through playing this game:  'Alright, let's catch some terrorists' 'Oh ♥♥♥♥ I didn't mean to do that' 'No noonononoonono' 'I never meant for this to happen!' '♥♥♥♥ ♥♥♥♥ ♥♥♥♥ ♥♥♥♥' 'Oh ♥♥♥♥.' After vaguely remembering this from a crowdfunding site whose name escapes me, I went into this game feeling like it would be a copy of the hacker simulators of the early 2000s, but I was pleasantly surprised.  I love this game. Not because of 'social commentary' (Which is eerily close to what might be going on) Not because of the art style, or anything like that. But because that this is a game that, in a long while, made me feel like my choices really mattered. That a simple click and drag could mean either saving countless lives, or ending them. It made me feel like I was THAT guy behind that desk in a government building, torn between two choices, either ruining a life, or completely ignoring one. And when I realized that I had been chasing the wrong person the entire time, I felt like a failed detective, who chased that big case his entire life, only to be let down.   No other game I have ever played, has made me feel like this. It really made me think about the choices I made, and also gave me 20/20 hindsight. And for $6, you can't go wrong with this captivating story. I never thought that I would be dragged into a game like this again after playing other mind-♥♥♥♥ games, but in all honesty, this game doesn't quite do that. It takes you to dinner first, then when you least expect it, you start to get drowsy, and you wake up in a daze at the end of this story, wondering what happened, and what went wrong. And oddly... you want to do it again.  Pros: Captivating story if you like reading Interesting abstract style Orwellian-type game (Go figure) Great decision system IMO Twists that I did and did not expect, My favorites. Price (sale)  Cons: Super short. (Less than 4 hours) No voice acting  No save state/save game option (Would love to go back to a certain point and replay it without having to do the entire game over again) Hits you over the head with Anti-government messages at times. Where's the subtlety?   Final verdict: 8/10  last comments:  If there were more stories, or more episodes carrying on from the current story, this would be my Indie game of the year easily. The way that the devs write the dialogue makes me feel like I'm reading teenagers' tweets and messages. Which I suppose is the point, but it gets pretty annoying when the smartest guy of the bunch types like a toddler. But I digress. Great game, great story.",
            "review_score": "1"
        },
        {
            "review_text": "Thoroughly engaging game; be the NSA, look into terrorists, realise there are NSA agents watching you play as an NSA agent.  Totally recommend!",
            "review_score": "1"
        },
        {
            "review_text": "I normally don't review many games, but this game definitely needs it. At first it seems like another one of those typical hacker games but it is so much more. This game brings information searching and 'hacking' to a whole new level. I recommend this game for every person. Patience is key in this game and do not worry about making mistakes because you will want to play it again.  8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game. I have spent several hours playing it, and it is a fantastic story of how government intervention in the daily lives of citizens can disrupt civil society. Managing what information is valid to an investigation is tedious but fun!",
            "review_score": "1"
        },
        {
            "review_text": "Fun but too short, you can finish this in about 4 hours.",
            "review_score": "1"
        },
        {
            "review_text": "An entertaining game to play a few times over. The story is about what one might expect but the world is interesting enough to pull you in for the first couple of playthroughs at least. Performance was good for the first four chapters but the last chapter was so buggy that one had to quit the game and then reload where one had left off at a few points. I probably would have been more interested in a more sandbox game rather than the more story driven one that this game is but it was certainly still a good game.    My main issue was that I didn't really agree with the point of view of the antagonists after the first playthrough and it took me until the second playthrough when I saw how much acting differently changed their outcomes, particularly that of Nina.   ",
            "review_score": "1"
        },
        {
            "review_text": "Highly highly recommended. This is the absolute best game of 2016 and highly under rated. It looks incredibly basic and easy but it is anything but. Highly immersive and addictive. Crashed once but was fixed by the time episode 5 as launched the following week and it worked fine. No ending is guaranteed and no outcome is easily predictable. There are multiple endings depending what YOU choose to do and submit to Orwell. I've spent almost 3 hours on the game at the time of writing and intend on going through it doing different things the next time and see what happens. Its highly unnerving and brilliant and the soundtrack is well worth getting as the soundtrack is one of my absolute favourites. There is literraly one stage in the game where you get hacked and I thought my actual laptop was getting hacked it was done that well. The story line is brilliant and I'm hoping there will be a sequel or second season.",
            "review_score": "1"
        },
        {
            "review_text": "This game is in short brilliant. The feeling is something that you can't really put your finger on but closest I get is to have a book you just can't put down. Both sound and aestics are stellar and not to miss the obvious but grande point, Whats is privacy really and surviellance can't be bad if you only use it for good, right? A really clever and intriguing game that shows the downside and fraility of our modern IT society. Highly recommend!",
            "review_score": "1"
        },
        {
            "review_text": "Love this game for the uniqueness. I really enjoyed all the reading, especially the irrelevant information; that's what made this more realistic. I caught myself getting into the investigator role and invading people's privacy even though I'm Libertarian and am terrified of a big brother state. Definitely worth the price.  I agree with another reviewer that we should be able to replay chapters instead of starting the whole game over to tweak results. While I don't mind replaying an RPG for different endings, this is too repetitive and tedious to do that.",
            "review_score": "1"
        },
        {
            "review_text": "Bought this on a whim and found it really addictive. The whole idea of prying on peoples private lives legally within the seems morally wrong but objectifably correct in the context of the game. There are twists and turns and every step meaning you never quite know what will happen next. This is also effected by the evidence you compile over the game. Finally, it is perfectly named as this has several shadows of 1984 and Animal Farm with the whole 'Big Brother' idea imprinted in the entire game.  Really worth buying if your interested in something a little different form the usual gaming fare plus you can try the first chapter for nothing!",
            "review_score": "1"
        },
        {
            "review_text": "This might be one of the scariest games to ever come out this year. It is a modern day horror story of government power gone haywire. What is scariest is that you serve as an integeral cog in a machine that exists to destroy liberty. What is scariest is that odds are the government is reading this review and is adding it to the massive pile of data it has on me. It made me realize how there is not true anonymity on the internet and that all it takes is the right software to find out everything about a person. I am terrified. Great game. This might be the best games of this year.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent and thought-provoking whodunnit that was a fun, albeit short, experience. The message was somewhat undercut in the details, however, as some of the complex ethical questions were artifacts of the game rules rather than mass surveillance. At the time of this writing, the game was plagued by a number of technical glitches and problems, but they were not insurmountable. Overall a positive and recommended experience at it's price point.",
            "review_score": "1"
        },
        {
            "review_text": " Great game",
            "review_score": "1"
        },
        {
            "review_text": "I've enjoyed having a game that isn't like every other game. It reminds me a bit of a recent mail-order solve a mystery in a box puzzle I played, only with feedback and stress. I enjoy the open ended nature of the game and the freedom you have to influence the outcome - highly recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Finally made me clear my browsing history",
            "review_score": "1"
        },
        {
            "review_text": "Never before would I have thought reading through random documents and articles could be as fun as this, but it is. I feel like the soundtrack definitely helps with that, making things audibly interesting. The user interface is gorgeous, and it's smooth as well. Highly recommended",
            "review_score": "1"
        },
        {
            "review_text": "  Highly Highly Recommened. Kept me engaged from start to finish.",
            "review_score": "1"
        },
        {
            "review_text": "I've finished the first two episodes and MY GOODNESS this game is wonderful. It's a really thrilling game to play. I feel involved in a way I usually don't when playing games. I feel like my choices ACTUALLY matter. I highly recommend this to people who like to choose their own adventure.",
            "review_score": "1"
        },
        {
            "review_text": "Orwell was unexpectedly good. A story filled with interesting characters and impactful decisions that make you really feel like you're guiding the game to a conclusion - you don't ask 'how did I end up here?' at the end of the game. Recommended.",
            "review_score": "1"
        },
        {
            "review_text": "I very linear though thorough game. It was very narrow minded, however left much to the imagination. I enjoyed it after reading 1984 and it was very very clear that there were many ideas taken from the book. A must by if you are into investigative, thought-provoking games.",
            "review_score": "1"
        },
        {
            "review_text": "Orwell is a fantastic game with a good amount of replay value that makes it well worth the purchase. It's overall theme is not unique, it's one almost as old as science fiction itself, however your imersion in the story makes it highly compelling. You will grow attached to certian characters only to watch your choices alter or even take their lives, you will be forced to make morally questionable choices that at first seem straightforward but you may later reconsider.  The gameplay itself is also well done, it seems simple at first. Process data chuncks to gather the evidence you need to move forward. But sometimes data conflicts and contextual clues aren't enough to reveal the truth, you will have to use your best judgement in situations where your judgement can justify arrest or murder. And sometimes you may make the wrong call. As the story progresses things will also get more and more urgent, at first the worst reaction you get to processing data that isn't deemed important is a wisecrack about your priorities but later on processing unimportant data could mean a serious drain on limited resources.   I very much enjoyed this game, it is short (2-4 hours depending on how focused you are) but I'll definitely replay it to aim for different outcomes and I would highly recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "this game is good. but it's more of an interactive story than a game. thats really all the information you need go in blind so the game is more fun",
            "review_score": "1"
        },
        {
            "review_text": "Orwell is a fantastic game with a good amount of replay value that makes it well worth the purchase. It's overall theme is not unique, it's one almost as old as science fiction itself, however your imersion in the story makes it highly compelling. You will grow attached to certian characters only to watch your choices alter or even take their lives, you will be forced to make morally questionable choices that at first seem straightforward but you may later reconsider.  The gameplay itself is also well done, it seems simple at first. Process data chuncks to gather the evidence you need to move forward. But sometimes data conflicts and contextual clues aren't enough to reveal the truth, you will have to use your best judgement in situations where your judgement can justify arrest or murder. And sometimes you may make the wrong call. As the story progresses things will also get more and more urgent, at first the worst reaction you get to processing data that isn't deemed important is a wisecrack about your priorities but later on processing unimportant data could mean a serious drain on limited resources.   I very much enjoyed this game, it is short (2-4 hours depending on how focused you are) but I'll definitely replay it to aim for different outcomes and I would highly recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Orwell is a game about online privacy, where in this world you're in a nation that has just introduced 'Orwell' to spy on it's citizens for it's purpose of 'Security'   Of course this game has heavy political tones, as you would expect  Anyway 8/10 now scared of my country",
            "review_score": "1"
        },
        {
            "review_text": "Well what can I say.... I really enjoyed the game and wish it was longer with other campaigns or something like that! It is really structured well and you have all the decisions, I found it difficult sometimes to think what is right or wrong - I will definatley be playing this game again and again to find different outcomes! I really enjoyed it and would recommend it :)",
            "review_score": "1"
        },
        {
            "review_text": "Honestly I loved this game. You have to make some difficult choices in-game that have difficult consiquenses. This game made me feel like I was doing something important, like I was effecting these people. I do have a tendency to really get immersed in what I'm playing (especially with games like these), but I feel like it wouldnt be that hard for anyone to do in this game. Overall, I would absolutly recomend Orwell to anyone.",
            "review_score": "1"
        },
        {
            "review_text": "A nice tight game with a moral dillema in its core which is most relevan right now. Do we allow the 'Orwellian' distopia to occur to stop criminals?  you play as 'The bad guy' investigating a bombing, eventually uncovering a disturbing truth about it.  even though the game is short and dumbed down somewhat (extracting data packets is your main job), you get to have some say in how the story goes, especially near the end.  Eventhough the game is short, its still has an engaging story with good writing and a unique feel.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic story driven game, Simplistic, yet fun. Defintely worth your time to experience.",
            "review_score": "1"
        },
        {
            "review_text": "  At first it's great, busting crime left and right But the information becomes a lot to keep track of. And if you don't play the cards right, the house of them will topple on Big Brother, as it always does",
            "review_score": "1"
        },
        {
            "review_text": "An ultimately disappointing game. It's very short (~3 hours for a full run even if you are taking your time and reading everything), which I can forgive if the game is excellent but it's not.  The gameplay itself, as others have noted, is drag-and-drop pre-highlighted bits of text. Some of this text is mandatory for the game to proceed, some of it is optional. It's not always clear which, so it's easy to get stuck if you are doing a replay and want to see what happens if you ignore bits of evidence, and you may accidentially find yourself doing the same thing that you did last time.  A lot of the choices you make (up until episode 5) are relatively inconsequential, you'll get different text but the overall plot remains the same. Unfortunately there's no way to replay an episode to see what would happen if you did something else; supposedly this feature is being worked on, but in a choice-driven game this should have been a feature that shipped; Tell Tale has had this feature since The Walking Dead season 1.  I thought this game was going to be more about the surveillance state ala 1984, Person of Interest, etc. but I wouldn't say this is a good critique. True, you are reading other people's emails, but we're not investigating some political dissidents who said bad things about Great Leader, we're investigating an actual in-universe violent incident (and someone who potentially wants to commit more of these.) So while snooping through the emails of the suspects, it's not unreasonable to think that you are trying to catch people who legitimately committed a real crime. The game does try to railroad you a bit to force you to investigate someone who may not be the offender, which you can ignore, but this is pretty late in the game.  Some of the story beats just don't work; for instance, in the final parts of episode 4,   information about your handler is leaked and the game forces you to drag-drop some of his personal information into his file. There's zero reason to actually do this, it's only to force the user to involve someone who clearly isn't a related to the crimes. And that would work if it was optional, but it's not. It's a 'you are meant to feel bad right now' bit, and just falls flat.    The 'good ending' is pretty trash,   everyone sings the freedom song and topples down statues and gives you a plaque for spilling the beans, ask Snowden how that's working out for him. It's rather corny.    Overall had decent potential and the demo (episode 1) is pretty good, but fails in the end stretch.",
            "review_score": "-1"
        },
        {
            "review_text": "An ultimately disappointing game. It's very short (~3 hours for a full run even if you are taking your time and reading everything), which I can forgive if the game is excellent but it's not.  The gameplay itself, as others have noted, is drag-and-drop pre-highlighted bits of text. Some of this text is mandatory for the game to proceed, some of it is optional. It's not always clear which, so it's easy to get stuck if you are doing a replay and want to see what happens if you ignore bits of evidence, and you may accidentially find yourself doing the same thing that you did last time.  A lot of the choices you make (up until episode 5) are relatively inconsequential, you'll get different text but the overall plot remains the same. Unfortunately there's no way to replay an episode to see what would happen if you did something else; supposedly this feature is being worked on, but in a choice-driven game this should have been a feature that shipped; Tell Tale has had this feature since The Walking Dead season 1.  I thought this game was going to be more about the surveillance state ala 1984, Person of Interest, etc. but I wouldn't say this is a good critique. True, you are reading other people's emails, but we're not investigating some political dissidents who said bad things about Great Leader, we're investigating an actual in-universe violent incident (and someone who potentially wants to commit more of these.) So while snooping through the emails of the suspects, it's not unreasonable to think that you are trying to catch people who legitimately committed a real crime. The game does try to railroad you a bit to force you to investigate someone who may not be the offender, which you can ignore, but this is pretty late in the game.  Some of the story beats just don't work; for instance, in the final parts of episode 4,   information about your handler is leaked and the game forces you to drag-drop some of his personal information into his file. There's zero reason to actually do this, it's only to force the user to involve someone who clearly isn't a related to the crimes. And that would work if it was optional, but it's not. It's a 'you are meant to feel bad right now' bit, and just falls flat.    The 'good ending' is pretty trash,   everyone sings the freedom song and topples down statues and gives you a plaque for spilling the beans, ask Snowden how that's working out for him. It's rather corny.    Overall had decent potential and the demo (episode 1) is pretty good, but fails in the end stretch.",
            "review_score": "-1"
        },
        {
            "review_text": "Amazing! Such an adventure. Couldn't stop playing.",
            "review_score": "1"
        },
        {
            "review_text": "Really well made and worth the 10€",
            "review_score": "1"
        },
        {
            "review_text": "Cyber-Noir. Investigate possible leads and connected weblines that accuse possible suspects. If you like dystopic themes this is really good. Oh and choices do affect the story alot.",
            "review_score": "1"
        },
        {
            "review_text": "A game has never given me chills before. That is, until I played Orwell. Go in blind for your first playthrough, you won't regret it.  If you don't like to read, this game may not be for you, but I found the story immensely intriguing. I played through the whole game in one sitting both times I've played so far. You play as an Investigator, where you investigate (duh) various Terrorist attacks and try to figure out who's responsible. That's all you need to know.  It takes 3 playthroughs to get all of the achievements (I still have one to go).  I absolutely love this game. I hope Orwell 2 is planned. Take my money.",
            "review_score": "1"
        },
        {
            "review_text": "a fascinating and quite lovely little game where you feel like you are making a difference in the VR world. clever and quite ingenious at times, but it can be a little linear. still enjoying it though",
            "review_score": "1"
        }
    ]
}