{
    "app_id": 492170,
    "name": "Planet Driller",
    "release_date": "2016-07-04",
    "developer": [
        "Oryzhon Studios"
    ],
    "publisher": [
        "Oryzhon Studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Casual",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Casual",
        "Action",
        "Adventure"
    ],
    "achievements": 15,
    "positive_ratings": 42,
    "negative_ratings": 18,
    "price": 1.59,
    "description": "Planet Driller is a mining game where you need to find DarkMatter in order to save the earth. To do this, drill your way through a procedurally generated planet full of minerals that you can sell for cash, then use the cash to upgrade your ship and make the job a lot easier!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/492170/header.jpg?t=1467632158",
    "minimum_requirements": "OS: Windows 7 Processor: Intel Pentium D or AMD Athlon 64 (K8) 2.6 GHz Memory: 1 GB RAM Graphics: Intel HD Graphics or AMD/ATI Radeon HD Graphics DirectX: Version 10 Storage: 200 MB available space",
    "recommended_requirements": "OS: Windows 7,8,10 Processor: Intel Core i3 or AMD Athlon II (K10) 2.8GHz Memory: 2 GB RAM Graphics: NVidia GTX 650 / Radeon R7 DirectX: Version 10 Storage: 200 MB available space",
    "reviews": [
        {
            "review_text": "As of July 6 I would recommend. Even at its normal price!   If you enjoy clearing blocks, harvesting, accumulating things for $2.00 you will get your moneys worth in my opinion. Sure its simple, maybe it is cloned from somewhere but honestly what is truly unique these days? Everything is cloned from something!   There is currently one type of game mode to play where you can dig down to 1000m. The developer replied in the discussions that Endless &amp; Timed were coming, and possibly a fourth based on the poster's suggestion.   The basics are collecting up to 16 &amp; a ? resource with your ship and sell for currency to buy buffs and upgrades. There are two other ships, three buffs, and four categories of ship components with four upgrades each.   Buffs:   A beacon to teleport you to the top.    Explosives that destroy multiple blocks including lava instead of hurting your ship by digging it.    Insurance that spawns you a new ship instead of ending the game.    Ship upgrades:   Drill: Speed your ship can destroy/collect the blocks.    Hull: HP, or amount of dmg you can take. Two lava blocks in a row with max will almost kill you.   Fuel: If you can't reach the top to refuel you explode.   Storage: How much you can carry before you need to head up to sell.  It's also worth mentioning...   There is an option to use a Teleporter to save your game progress so you don't have to start a new game every time. Making it a very casual thing you can just open up and destroy some things and then close if time is limited.   If you are a completionist, this takes less than 2 hours to 100% in its current state. I do not know if more achievements will be added with the addition of new game modes.",
            "review_score": "1"
        },
        {
            "review_text": "Its actually pretty cool! Got greenlighted and for a first game for this developer its really nice to play ;D",
            "review_score": "1"
        },
        {
            "review_text": "this is lower quality almost carbon copy of an old online flash game called motherload without the satan boss once you hit the bottom. as far as i can tell you can't purge things from the inventory although it will list how full and how much of each ore you have, fall damage doesn't increase based on your fall speed so if you can handle taking fall damage you might as well just deadfall to the bottom of the shaft. all in all go for the free 2d 15 year old game over this unless you really love digging.",
            "review_score": "-1"
        }
    ]
}