{
    "app_id": 492220,
    "name": "Bohemian Killing",
    "release_date": "2016-07-21",
    "developer": [
        "The Moonwalls"
    ],
    "publisher": [
        "Libredia Entertainment"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Captions available"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Adventure",
        "First-Person"
    ],
    "achievements": 22,
    "positive_ratings": 121,
    "negative_ratings": 45,
    "price": 9.99,
    "description": "Paris, 1894. Class differences and pervasive racism finally lead to a tragedy. A year later you find yourself on trial, accused of a brutal murder. How far will you go to exonerate yourself? Will you lie? Manipulate the evidence? Frame others? Act insane? Confess? Your imagination is the limit.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/492220/header.jpg?t=1546511259",
    "minimum_requirements": "OS: Microsoft Windows 7 32bit Processor: Intel Core 2 Duo 1,66 GHz Memory: 4 GB RAM Graphics: Radeon HD 7500G/Intel HD Graphics 3000 Storage: 8 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "In this game you will:  - lie in the courtroom to escape the guillotine, - collect evidence and get some steam achievements along the way, - listen to a very nice voiceover commenting on your every action (and I mean EVERY), - use the stairs, - have your own torture chamber in a secret room, - fail at playing a piano, - get beaten up by French bar patrons, - drink a lot of champagne at every occasion because it's free, - buy some fish from a vending machine (seriously), - figure out what is so steam-punkish about this Paris, - give a lot of credit to the author who managed to pull off this game all by himself! - ...and then use the stairs some more.  I'm still trying to escape the guillotine. Very unique game concept, give it a try.",
            "review_score": "1"
        },
        {
            "review_text": "I agree with alot of people that say that this is pretty much just a walking simulator. If you look at it in that regard, it's a nice game. It has pretty enviornments, the voice acting is solid and the music is cool. But looking at it for what it's advertised at I think it's completely too high of a price to pay. I was really hesitant to buy it even with the discount and somehow convinced myself and I'm still not sure it was worth it. There doesn't even feel like enough content to be worth it.  And I may be wrong, but I'm pretty sure at initial release the original price was not $17 as I paid around $13 with the -15% promotion which also really rubs me the wrong way. $17 is a bit outrageous.  It's a really cool concept for a game but it's a little over complicated with not too much guidance. There's alot of talking, which is understandable, but not if you buy it expecting some action now and again. I've only gotten one ending so far, but I intend to go for more and hopefully my opinions will change a little. At best I would even be more forgiving if it was an early access game. It is not. I had high hopes but so far I'm not sure.  So yeah, if you're into that kind of thing, I do recommend it because it is a nice game and in my opinion you can tell some thought went into it.   Just wait for the steam sale.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting game. You start of already being guility, how do you lie in the best possible way to get out of a situation you are in? The only thing is we wished the gameplay mechanics was explained earlier in the game, because it can get confusing.    Playthrough  ",
            "review_score": "1"
        },
        {
            "review_text": "Amazing idea, but nothing more than a good game because of its issues, especially in coherence, would love to see a game like this made by a AAA company",
            "review_score": "1"
        },
        {
            "review_text": "To be honest, I haven't got a clue what you would find enjoyable about this game? It sounded good but there are so many flaws.  The camera/controls are AWFUL The game doesn't really explain what the hell you have to do.. It's difficult  Totally gutted and annoyed!!",
            "review_score": "-1"
        }
    ]
}