{
    "app_id": 492370,
    "name": "Affairs of the Court: Choice of Romance",
    "release_date": "2016-06-23",
    "developer": [
        "Choice of Games"
    ],
    "publisher": [
        "Choice of Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Captions available",
        "In-App Purchases",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Adventure",
        "RPG",
        "Indie"
    ],
    "achievements": 56,
    "positive_ratings": 41,
    "negative_ratings": 12,
    "price": 4.79,
    "description": "Plunge into court politics and change the course of history, or pursue a love affair that rocks the kingdom to its foundations!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/492370/header.jpg?t=1538621380",
    "minimum_requirements": "OS: Windows 7",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "An amazing story. I can't wait to play it again and see how much will change. THIS WAS SO COOL!!! thank you for making this game as you did.",
            "review_score": "1"
        },
        {
            "review_text": "I've played this game on my phone for years now and have even bought the dlc for it so excuse my very short playtime here on steam.  But this was the game that made me more gay that I already was and even made me have a thing for older women GG.",
            "review_score": "1"
        },
        {
            "review_text": "I found 'Affairs of the Court: Choice of Romance' to be a rather interesting game compered to other games of its kind, it felt like the game was always pushing you to date the queen which i at time hated it. Plus the hole 'l'm going to be king' thing your family keep push you to do, doesn't work like that.  BUT all things consided if your tired of playing the choice your own story games that are like spys, army and wars and all that, and you want a game thats driven by 'love' then you should consider playing this.",
            "review_score": "1"
        }
    ]
}