{
    "app_id": 493730,
    "name": "HardCube",
    "release_date": "2016-06-30",
    "developer": [
        "LEVER Software"
    ],
    "publisher": [
        "LEVER Software",
        "Enjoy Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards",
        "Commentary available"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Adventure",
        "Casual"
    ],
    "achievements": 13,
    "positive_ratings": 171,
    "negative_ratings": 47,
    "price": 3.19,
    "description": "This arcade platformer for all hardcore lovers of toys. Simple and addictive time killer with lots of interesting setting in which a lot of different levels and worlds. Nice graphics eye accompanying soundtracks gameplay and online rankings.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/493730/header.jpg?t=1501967023",
    "minimum_requirements": "OS: Windows 7, XP, Vista, 8, 10 Processor: Intel Core2 Duo 2.0 Ghz Memory: 2 GB RAM Graphics: Any 512 MB DirectX: Version 9.0 Storage: 500 MB available space",
    "recommended_requirements": "OS: Windows 7, XP, Vista, 8, 10 Processor: Intel Core i3 2.4 Ghz Memory: 4 GB RAM Graphics: Any 2 GB DirectX: Version 11 Storage: 500 MB available space",
    "reviews": [
        {
            "review_text": "I think you should play classic bounce games one more again, before play hardcube. Because hardcube doesn't show innovation to us. Only waft, bounce and collect... Again and again and again.",
            "review_score": "-1"
        },
        {
            "review_text": "Flashback to a simpler time when marbles were madness. Crank/pump/juice it up with a generation z energy drink. then Rage hard in a peaceful utopia. Bounce. Go balls to the wall with this one. plus All the hashtags are here. They are extreme. hashtag rage hashtag hard hashtag cube",
            "review_score": "1"
        },
        {
            "review_text": "Enjoyable and relaxing. Simple concept but the only other ball platformer I've personally played is Mojo and that is a very different kind of game. I have little to compare this to but I can say the trailer is very accurate to what you can expect to get out of HardCube.  Currently I have only finished two of the worlds but I'll probably finish the rest later today.",
            "review_score": "1"
        }
    ]
}