{
    "app_id": 493810,
    "name": "Jonah's Path",
    "release_date": "2016-07-07",
    "developer": [
        "Ionut Lucian Achiricioaei"
    ],
    "publisher": [
        "Ionut Lucian Achiricioaei"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Free to Play",
        "Indie"
    ],
    "tags": [
        "Free to Play",
        "Indie",
        "VR"
    ],
    "achievements": 0,
    "positive_ratings": 43,
    "negative_ratings": 19,
    "price": 0.0,
    "description": "A short immersive Virtual Reality experience placed somewhere between Jupiter's moon Europa and Jonah the biblical story.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/493810/header.jpg?t=1467923608",
    "minimum_requirements": "OS: Windows Processor: I7 Quad Core Memory: 8 GB RAM Graphics: Nvidia GTX 980 Storage: 1 GB available space",
    "recommended_requirements": "OS: Windows Processor: i7 Quad Core Memory: 16 GB RAM Graphics: Nvidia TitanX Storage: 1 GB available space",
    "reviews": [
        {
            "review_text": "Jonah's Path is a pretty neat VR demo/ experience that takes you on a quick under sea trip. I did not have any real issues with it and I recommend anyone with a VR headset try it.",
            "review_score": "1"
        },
        {
            "review_text": "'A short immersive Virtual Reality experience placed somewhere between Jupiter's moon Europa and Jonah the biblical story.'  Ask yourself in all seriousness if the above statement makes any sense to you whatsoever, whether rational, logical, philosophical, literal, or even common sense...   This is part of the story of Jonah, found in the Old Testament of any King James bible.   Now the LORD had prepared a great fish to swallow up Jonah. And Jonah was in the belly of the fish three days and three nights.  (in other words... you're Jonah in this VR demo. Here's what happened inside the belly of the fish...)   Then Jonah prayed unto the LORD his God out of the fish's belly,   And said, I cried by reason of mine affliction unto the LORD, and he heard me; out of the belly of hell cried I, and thou heardest my voice.  For you had cast me into the deep, in the midst of the seas; and the floods compassed me about: all thy billows and thy waves passed over me.  Then I said, I am cast out of thy sight; yet I will look again toward thy holy temple.  The waters compassed me about, even to the soul: the depth closed me round about, the weeds were wrapped about my head.  I went down to the bottoms of the mountains; the earth with her bars was about me for ever: yet hast thou brought up my life from corruption, O LORD my God.  When my soul fainted within me I remembered the LORD: and my prayer came in unto thee, into thine holy temple.  They that observe lying vanities forsake their own mercy.  But I will sacrifice unto thee with the voice of thanksgiving; I will pay that that I have vowed. Salvation is of the LORD.  And the LORD spake unto the fish, and it vomited out Jonah upon the dry land.  ...  Europa is one of many names of mother goddess/queen of heaven worship. Inanna. Isis. Semiramis. Ishtar. Today's versions are Mother Mary, Liberty (like the statue), and Easter. To get to the point: this is demonic worship. Satanic. Lucifer. Think of a demon womb that births demons through its v@ginal entry. This worship is worshiping that womb and passageway.   The only conclusion I have where that game description makes any sense to me is: Virtual Reality is the Europa/demon womb whose passageway will lead you into the belly of hell. The mouth opening at the end of this demo is the v@ginal entry. From your perspective, its the exit out of the womb and into the belly of hell.  ...  VR is a crafty way to get you by the neurons and drag you to hell. Don't worry, the trip is surreal and wonderful and lovely and you'll probably come in your diapers a dozen times before reaching there. But that's the destination. Enjoy.",
            "review_score": "1"
        },
        {
            "review_text": "Well, as I don't have a VR headset, it was just a short little trip down memory lane. Looked like a demo I would've seen quite some years back. I don't see WHY it needs a high end graphic card. Sorry...boring",
            "review_score": "-1"
        }
    ]
}