{
    "app_id": 494450,
    "name": "Office lovers",
    "release_date": "2016-08-07",
    "developer": [
        "Dogenzaka Lab"
    ],
    "publisher": [
        "Dogenzaka Lab"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 16,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "Visual Novel",
        "Otome"
    ],
    "achievements": 13,
    "positive_ratings": 34,
    "negative_ratings": 31,
    "price": 11.99,
    "description": "It's a romance game where you can experience the thrill of an office romance where you have to keep your relationship secret. What will happen when you're alone with him in the conference room?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/494450/header.jpg?t=1478745154",
    "minimum_requirements": "OS: Windows 7 Processor: 1.8 GHz Pentium 4 Memory: 1 GB RAM DirectX: Version 9.0c Storage: 1 GB available space Additional Notes: Resolution: 1280x720",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Ignore my time on record, I played this on mobile before it came to Steam. This game is hilarious for all the wrong reasons. The premise is actually a decent one, but how they handle the relationships between you and these men is just beyond off-putting. I've never played a Japanese dating sim that didn't have a very dubcon feel, I expect that from their story telling style. However, this crosses that territory in to just plain creepiness and it feels totally unintentional. This game fails to understand how it comes across to a Western audience in particular. I played this game on mobile first and live blogged the entire thing and..the one thing that kept coming up was 'are you sure this isn't secretly a horror game?'. It would have succeeded far more as a thriller. I'm sorry but when you have three erotic scenes in one particular route and you're not even on a first name basis with the love interest by the end of the game, how am I supposed to take that? This entire office is INSANE. They are all crazy about you as if this were a frat house and they'd never actually encountered a woman before. Not only that but the way they ALL insult you and treat you as if your worth as a woman is limited to their cosmetics..it's baffling. With lines line 'a goddess shouldn't ever have chapped lips, fix that' and 'for someone who works for a cosmetic company you sure don't care about your appearance it's disapointing' and 'I'm going to feed him like a pet, and train him to stay away from you.' [in reference to a really sweet new guy wanting to have lunch with you], 'Look at you using lip stick like a good girl!'. Everyone in this story is emotionally abusive and manipulative. I expect that from our tsundere and glasses types, but literally, EVERYONE is like that in this story (even if they aren't a love interest). This game is baffling. Not as baffling as Secrets of Me--a game by this same company I really hope comes to Steam because you have to play it to believe it--but darn close. Nothing in this game is romantic or sweet. The only reason you should invest any money into it is a morbid curiosity of how deep the rabbit hole goes and how utterly psychotic everyone is. If you change your perception of the game and view it as a psychological thriller or a dark comedy or even a satire of this genre, you may enjoy it more, but as a romance novel it's laughably awful, insulting, and just degrading. If it were more self aware, maybe, but it clearly isn't.",
            "review_score": "-1"
        }
    ]
}