{
    "app_id": 49470,
    "name": "Magic: The Gathering - Duels of the Planeswalkers 2012",
    "release_date": "2011-06-15",
    "developer": [
        "Stainless Games Ltd"
    ],
    "publisher": [
        "Wizards of the Coast LLC"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Steam Achievements",
        "Partial Controller Support",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Card Game",
        "Strategy",
        "Trading Card Game"
    ],
    "achievements": 26,
    "positive_ratings": 705,
    "negative_ratings": 95,
    "price": 0.0,
    "description": "Deck Pack 2 Now Available!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/49470/header.jpg?t=1447354038",
    "minimum_requirements": "OS: Windows 7/Vista/XPProcessor: 2GHz CPU (Pentium 4 or equivalent)Memory: 1GB RAM (2GB for Vista)DirectX&reg;: DirectX 9.0c or laterHard Drive: 700MBSound: DirectX 9.0c compatible sound cardVideo: 256MB VRAM GPU capable of Pixel Shader 3 or betterAdditional: Co-op gameplay is online only.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I bought this game when it first came out and it was fun whilst it lasted. Now there's never anyone online and the decks are broken. See*  It will never replace face to face MTG but for a few quick '5' minute sessions that can turn into hours it was, at the time money well spent.  *However since the last update all the decks I purchased (downloadable content) have now re-locked themselves and I refuse to spent anymore money paying for something I have already purchased.   It is a bug that has not been fixed and Steam are willing to sell you a faulty product and therefore i cannot recommend this game, I advise you to steer clear.",
            "review_score": "-1"
        },
        {
            "review_text": "Offers plenty of content for newbies-to-intermediate MTG players.   If you're a long time MTG player who's looking for a similar experience online though - you won't find it here; the customization aspect of deck building in this game is quite limited.   Give it a shot if you're into card games or if you're a new MTG player who wants to learn/practice the basics.   Word of warning if you're gonna get this game: Almost all of the DLCs do NOT offer additional content (except for the expansion and Deck Packs #1,2 &amp;3 ) as you are still able to get most of the unlockables by progressing in the campaign.",
            "review_score": "1"
        },
        {
            "review_text": "For old school fans who are looking to throwdown with some premade deck this this game is for you! So Good!",
            "review_score": "1"
        },
        {
            "review_text": "The 2012 update is more of the same as the original Duels of the Planeswalkers. An excellent conversion to PC of Magic: The Gathering. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Great and addicting game. Thanks a ♥♥♥♥♥on to the guy who gifted it to me, everything with this game is great. It's not glitchy, it's SUPERB when it comes to noob-friendly (since I never played MTG at all in my life, although I have the basic idea about TCGs).  Really, I haven't had any problems or any illogical bugs and stuff like that, no game-breaking stuff which is usually the deal with these online TCG.  Most of the decks are balanced, and the mini-challenges which teach you about the game are a real treat and a fun thing for a non-experienced MTGer.  Very addicting, almost made me buy the DLC, and definitely will once and if it goes on sale. The multiplayer so far looks great, although I haven't tried it since I don't have many people who have this game, but if you ever get it, be sure to ring me up ASAP!  9/10  Very great game. Superbly executed.",
            "review_score": "1"
        },
        {
            "review_text": "This game does not allow you to build your own deck, but you can play with a dozen or so pre-designed decks with random limits on what cards of the same type can be in it. It also crashes, displays card graphics improperly, and cuts off the edges of the screen so you cant see or use cards on the side of the playing field. also it is very difficult to select or view enchantments on flying creatures.",
            "review_score": "-1"
        },
        {
            "review_text": "This game had a big influence over me deciding to get into the actual trading card game. The game is easier to figure out than you would think, and Duels of the Planeswalkers 2012 makes learning the game mechanics and terminology even easier. All it took was the tutorial within the demo to make me go out and buy a pile of cards. This is considered the ultimate TCG, and I'd say that that is justified, having played various different TCGs in my time (Yu-gi-oh!, Duel Masters, Pokemon, Naruto, Digimon). Now that I think about it, this is the longest-running TCG on the market, and it didn't need a children's cartoon to be successful, and that should say something. It didn't take long for some of my friends to jump on the Magic train when I introduced them to it, and it's always good to have friends to play a TCG with.  So if you have any interest at all in trading card games, go download the demo.",
            "review_score": "1"
        },
        {
            "review_text": "I do not recommend this game for 1 reason. Buy the newest version. Wizards has improved the game every year and it is worth the price to upgrade. Unless you simply want to see the older decks, go for the most recent version.",
            "review_score": "-1"
        },
        {
            "review_text": "HIGHLY addicting - especially the new ArchEnemy game modes.  ",
            "review_score": "1"
        },
        {
            "review_text": "this game is truly awful. half of the skill in magic comes from building a deck but in this game there is no deck building whatsoever. Magic is all about playing the game YOUR way and finding your own strategies but this game throws all that out the window. Being a heavy magic player it infuriates me to have to play with decks as awful as these, The apex predators deck has no predators, its just rubbish 2/2 land booster cards. The weilding steel deck is too land heavy and yo never get any good creatures before your opponent .",
            "review_score": "-1"
        },
        {
            "review_text": "If you like card games, then this is for you. Forget about all the DLCs, you can unlocked those cards in-game, and the foil conversions are just cosmetic. Get the expansion is enough.  My score: 7/10 (Get it on sale, if you like card games.)",
            "review_score": "1"
        },
        {
            "review_text": "A was a fan of the previous magic games, but this is just too confusing, seems new cards can be invented that do just about anything .... a bit too much going on now.",
            "review_score": "-1"
        },
        {
            "review_text": "Dunno what it is about Wizards of the Coast. I think they must really just not undestand how to do software. The Mechanics of Magic the Gathering are pretty solid as a card game. How it turns into this unenjoyable mess, after thousands of hours of development- I have no idea. WOTC continues to leave money on the table here by doing this so badly. Not to mention leaving room for ambitious competitors.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is fun and probably a really good intro into magic if your a beginner and want to learn, but overall compared to playing an actaul game its kind of restrictive. Like you cant really make your own deck, you select pre-made decks, you might be able to swap some cards in and out but its just not the same. Also I think a big rip off are those 'foil conversion decks', foil cards ARE normally really cool but not in digital form. its just.. digital..",
            "review_score": "1"
        },
        {
            "review_text": "It's MTG, only you don't have to go buy cards and you don't have to find somebody willing to play against you. You could always try and teach your cat to play, but it won't work, they only make plague rat decks and that's lame.",
            "review_score": "1"
        },
        {
            "review_text": "This is an online multiplayer game which need people to play with. unfortunately it is nearly impossible to find someone to fight with online. even if you do find, 99% of the time the other guy either get DC or AFK or something",
            "review_score": "-1"
        },
        {
            "review_text": "For those who like Magic but don't want to spend a fortune on the cards. The release a new edition every year, they're pretty much the same game.",
            "review_score": "1"
        },
        {
            "review_text": "A vast improvement over the previouse, Duels 2012 is a great follow up. It includes new game modes, such as Archenemy, and new decks. Now I just can't wait for any expansions/DLC.",
            "review_score": "1"
        },
        {
            "review_text": "Love all the Magic the Gathering games on Steam so far except maybe 2015. that one, really was not as fun sadly, keep em up though!",
            "review_score": "1"
        },
        {
            "review_text": "Good game with multiplayer, lots of fun with the archmage challenges.. Some designflaws, pointless 3D as it could have been nicely oilpainted backgrounds.   More decks and the option to customize your deck from the start would be greatly appreciated.   Overall - nice game in multiplayer - two headed giant and archmage, but lacks the depth what Magic the gathering game IRLhas.",
            "review_score": "1"
        },
        {
            "review_text": "If You're Thinking About it...Get it!",
            "review_score": "1"
        },
        {
            "review_text": "if you like magic cards youll love this!",
            "review_score": "1"
        },
        {
            "review_text": "Duels is an adaptation of the Magic card game, and I've enjoyed it. You select a pre-made deck to play with, beat AI opponents, and get more cards to add to the deck. The AI is mostly competent (unless, of course, they're your allies), and some of the matches can get pretty challenging.  In this version, they added the ability to swap out cards you don't like, and that's a huge upgrade from the previous version. Also new are Archenemy games, where one deck uses 'schemes' to take on multiple opponents, and these are mostly fun, though often frustrating and too luck-based.  The music and sound effects are bad. I turned them off.  I think it's worth it for $10. You can get a lot of playtime out of this, and the variety of decks keep the game interesting. If Magic sounds even slightly interesting, give it a try.  The bonuses in the Special Edition aren't worth it. The foil conversions are just cosmetic, the game's music isn't good, and you can find the comics online for free.",
            "review_score": "1"
        },
        {
            "review_text": "Interested in MTG? this is a great place to start !",
            "review_score": "1"
        },
        {
            "review_text": "Better than then the one before.Sick decks! Awsome game!",
            "review_score": "1"
        },
        {
            "review_text": "2012 review: Outstanding casual game, provided you have some interest in a card game. It's pick up and play which is the best thing about it - no deck configuration required. If you grew up playing Magic like I did, I think you will enjoy this as I do.  2015 update: I am frustrated with all the different versions of Magic: the Gathering on PC and have a difficult time recommending any of them, let alone investing in them myself. At this point I think it makes a lot more sense to switch to Hearthstone since you know that Blizzard won't be abandoning it in a year with an entirely new Hearthstone 2016 product.",
            "review_score": "-1"
        },
        {
            "review_text": "Classic gameplay and cool twist to an old school card game.",
            "review_score": "1"
        },
        {
            "review_text": "Quite a good strategy game, with pre-made decks adapted to different playstyles to which you can add through winning duels.",
            "review_score": "1"
        },
        {
            "review_text": "When i first bought this game, i didn't know what to expect as i never played card games before. It was a great sale, the complet serie for £5.99 i think. I then left it there in my games library only to play it recently damn what an idiot i was because the game is great, a little confusing at first as you have to deal with the rules and different decks and cards characteristics.... When you're familiar with the system (which has been simplified i think) then the game get really addictive. Some may not like the cards locking system which unlock new cards only once you have beating the bosses (or buy the dlcs to ulock decks) leaving you to struggle to get the strongest card when facing your enemy who has full card deck.  However, Magi: The Gathering - Duels of the Planeswalkers 2012 is a great game to start with if like me you are new into the geinre. Wait for the sales and get it.",
            "review_score": "1"
        },
        {
            "review_text": "first look may give you a oh what a ♥♥♥♥♥♥ game but after you played it you might find it quit addictive",
            "review_score": "1"
        },
        {
            "review_text": "Very good MTG game, way better than the original and good options to play with friends",
            "review_score": "1"
        },
        {
            "review_text": "This got me interested in MtG again. Great gameplay. Plenty of awesome cards in every deck!",
            "review_score": "1"
        },
        {
            "review_text": "Poker + Magic = MTG, first-person thinker.",
            "review_score": "1"
        },
        {
            "review_text": "2012 MTG, It's good, but 2013 is better, and soon enough... 2014 will be out with much needed deck customization, so just wait for it!",
            "review_score": "1"
        },
        {
            "review_text": "All the fun of the real thing without the thousands of unused crap cards sitting in your closset. Instead of the rules being governed by angry nerds sitting across from you, they're enforced with finess by the game, also making it all the more worth while!",
            "review_score": "1"
        },
        {
            "review_text": "Better than the first Duels of the Planeswalkers. 3 friends against 1 AI in arch enemy makes for a good laugh, the challenges are still challenging and the rules are less flawed. The deck editor has improved but you'll still end up with a third of your deck left unwanted. The AI also uses Cheating Prick technology so you'll be sure to have many games stolen from you at the last second, so great news if you like sighing loudly at your monitor.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun to play online! Fun even for beginners. And the pretty artwork!",
            "review_score": "1"
        },
        {
            "review_text": "The feel of MtG without the huge wallet drain. More than the others, the 2012 version is the one I keep coming back to. '13 and '14 have their own gimmicks, but nothing beats playing as the Archenemy in the Expansion campaign here.",
            "review_score": "1"
        },
        {
            "review_text": "a great filler for those who loved but dont want to play tabletop anymore.",
            "review_score": "1"
        },
        {
            "review_text": "Loved this game a classic to MTG",
            "review_score": "1"
        },
        {
            "review_text": "Fun card game without all the hastle that card games bring with them. Online is insanely fun. Ten bucks its a steal.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game, well worth the price.",
            "review_score": "1"
        },
        {
            "review_text": "New to the series, I didn't expect to be able to gather the mechanics of MTG so quickly. As a long-time Yu-Gi-Oh player, it took a while to train my brain out of some of their rules, but once I did I found myself equally addicted. I can't speak for all MTG players old and new, but my recommendation is so far based on pickupability, and the insane levels of detail the game goes into.  It's your classic card game you've come to love; we know that. The graphics for the cards are as always beautiful but what really sets it up for me is the amount of freedom I have in choosing what style and play type I want. From deck customization to multiplayer to co-op, there's no level of restrictions.   I need more time to play to be able to critique it fairly, but I know i'll be thoroughly impressed as I am now. I've become a MTG convert, which speaks for itself.   (Also, what an amazing opportunity Wizards of the Coast are giving to freelance concept artists.)",
            "review_score": "1"
        },
        {
            "review_text": "DOTP 2012 adds much needed interface improvements, more balanced decks (although I wish they hadn't gutted the U/B deck from 09.:() and a new co-op mode to the DoTP series. Pre-made decks are more customizable this time around, which is a huge plus.   This game is meant as an introduction to Magic and as such is casual friendly and easy to pick up, while still being pretty hard to master. If you're looking for a turn based strategy game, or want to get into Magic, you should definitely give this game a go.",
            "review_score": "1"
        },
        {
            "review_text": "A Great way to get into the magic scene and fun in it's own right. This game lets you stretch your wings with some deck building but prevents you from getting them clipped by making fundimental frackups with some helpful advise. The CO-OP modes are even better as if you have a freind that's familier with magic they can help coach you in no time.",
            "review_score": "1"
        },
        {
            "review_text": "Addictive gameplay, but tons of bugs and things that could be realized better Gameplay - 10/10 Technical side - 4/10",
            "review_score": "1"
        },
        {
            "review_text": "Much, much better than the previous Duels, this game is a MUST for all Magic fans out there. Great value, nice graphics, everything looks very polished, and the new game modes are a blast.",
            "review_score": "1"
        },
        {
            "review_text": "If you play Magic then it is MTGO or MWS and this is all pretty irrelevant, but Duels is a good foot in the door for anyone interested in learning the game. You can't build or edit decks except to remove cards, so this is a very catered experience. I don't usually enjoy odd formats, but the Archenemy variant (1v3, in this case) is pretty fun. While limited in scope, Duels is significantly cheaper than going after physical or digital cards.",
            "review_score": "1"
        },
        {
            "review_text": "For a card game based on the idea of letting players do every crazy combination they can think of, this video game adaptation lets you do surprisingly little",
            "review_score": "-1"
        },
        {
            "review_text": "It's a buffet but the management chooses the meals for you. Most of the meals are still pretty decent, except Cloudburst which is just straight up disgusting.",
            "review_score": "1"
        },
        {
            "review_text": "Lots of fun for fans of the card game. Basic but entertaining.",
            "review_score": "1"
        },
        {
            "review_text": "Better than then the one before.Sick decks! Awsome game!",
            "review_score": "1"
        },
        {
            "review_text": "Better than the previous game",
            "review_score": "1"
        },
        {
            "review_text": "Cheap and so worth it.",
            "review_score": "1"
        },
        {
            "review_text": "Challenging. Never any multiplayer games available.",
            "review_score": "1"
        },
        {
            "review_text": "some may think this isnt the game for them just like me but to be honest this game is exellent must buy for the price of it",
            "review_score": "1"
        },
        {
            "review_text": "Better then the last one with the addition of deck edit.....but still needs to let you tap your own mana.",
            "review_score": "1"
        },
        {
            "review_text": "Better than buying booster packs, until the online play goes down.",
            "review_score": "1"
        },
        {
            "review_text": "A simple game based on the card game. If you like the card game you'll probably enjoy this.",
            "review_score": "1"
        }
    ]
}