{
    "app_id": 495110,
    "name": "Enigmatis 3: The Shadow of Karkhala",
    "release_date": "2016-08-11",
    "developer": [
        "Artifex Mundi"
    ],
    "publisher": [
        "Artifex Mundi"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Casual"
    ],
    "tags": [
        "Hidden Object",
        "Adventure",
        "Casual"
    ],
    "achievements": 34,
    "positive_ratings": 407,
    "negative_ratings": 33,
    "price": 6.99,
    "description": "Enigmatis 3: The Shadow of Karkhala is the final chapter in the blockbuster trilogy, an exciting detective story rife with adventure, puzzles, and ancient mystery. Follow the trail of a demonic preacher and unravel the secrets of Karkhala Peak!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/495110/header.jpg?t=1512040933",
    "minimum_requirements": "OS: Windows XP, Windows Vista, Windows 7, Windows 8, Windows 10 Processor: 2 GHz Memory: 1 GB RAM Graphics: 256 MB VRAM DirectX: Version 9.0b Storage: 3 GB available space",
    "recommended_requirements": "OS: Windows XP, Windows Vista, Windows 7, Windows 8, Windows 10 Processor: 2.5 GHz Memory: 1 GB RAM Graphics: 512 MB VRAM DirectX: Version 9.0b Storage: 3 GB available space",
    "reviews": [
        {
            "review_text": "Why didn't I play the game when I bought it? It was Olympics Games time. But I don't regret delaying my pleasure.  Enigmatis 3 is concluding the hunt for the evil Priest initiated in Maple Creek and pursued in Ravenwood. Rick and you are nearing to stop the madman, however, you don't know his next destination. Returning at Maple Creek, you find that the Priest is interested in a mountain village, in the Himalaya...  The story is full of twists and I liked it. There is no major plotholes and why I wish that some stuff turned differently, it was satisfying enough. As Artifex Mundi is rarely ending their games on a tragic note, Enigmatis is also ending positively. However, that being said isn't revealing who survives and who does not.  The gameplay is quite standard: find items, use them, combine them, solve puzzles and clear hidden objects scenes. However, you have some actions moments (like firing your revolver, avoid falling from the plane, climbing up a mountain, etc..) and that's very refreshing. Everything is quite easy and I must say that I was happy to avoid puzzles frying my brains. The Evidence Deduction is also back: you find evidence and then it's up to you to place them in the right circle which is a question. That gameplay was used in Maple Creek to help you remember your investigation there following the memory loss and in Ravenwood to help you find why a beast was interested in a little girl.  I also liked the fact that you can interact with some objects, like the radio in the car, to choose your own music. It's perhaps not something often in the game but I find these little interactions very nice.  The graphics are quite good, I loved them. The fact that you're in an Eastern setting is also nice, even if you're not really confronted to it all along (as you have also the portion in Maple Creek and in the archaeological crew camp). But what I liked the most is the soundtrack, very fitting. I loved the menu track, played directly by the little girl with her flute.  Enigmatis 3 is wonderfully concluding the trilogy. It's a must-have for anyone that liked Enigmatis or Artifex Mundi's work. The whole trilogy is marvelous and I'm sad to see that there will no more (though the gameplay will probably end in another game). It's like Nightmares from the Deep or Time Enigma: you're very sad to leave behind you a wonderful universe.",
            "review_score": "1"
        },
        {
            "review_text": " In a nutshell:  A worthy end to the Enigmatis trilogy. It has its flaws, but the presentation and gameplay is thoroughly enjoyable and on par with the rest of the series.  If you haven't played the previous two Enigmatis games (Maple Creek and Ravenwood), I highly suggest doing that first, because the story in Karkhala begins a few days after the Ravenwood adventure ends, and some of the details and subtle nods to the earlier games will make a lot more sense.   For achievement hunters, there's no need to plan for the usual '1.5 playthroughs'. The pair matching achievements are in-game only.   Story/Presentation",
            "review_score": "1"
        },
        {
            "review_text": "I'm a big fan of the Enigmatis series so I was dying to see how they wrapped it up. To say I was disappointed would be understating it. First off the game quality is crap. It has problems loading and then glitchs. I can honstly say the problem isn't my laptop as it can handle skyrim at full specs. Plus I've seen reviews with other people mentioning this problem.   The plot of the game pretty much rehases the previous 2 games for a good 3/4 of the game. There is barely anything new. The characters get a big downgrade espeically preacher who had been such a great villain. When the climax of the game came I wanted to scream because this game didn't even last half as long as the previous two entries into the series. So I was more then shocked when it ended so quickly. After 2 entries into this universe this honestly had me dispapointed that i had played the series at all. It just felt so rushed and a lot of important things weren't explained.   The puzzles weren't challenging either. If you have to get this to know how the series ends I'd really reccomend waiting until it is on sale. Otherwise I say this is a skip.  I give it 4/10",
            "review_score": "-1"
        },
        {
            "review_text": "I played the first two games of the series and loved them. This was a very nice finale. Everything I have come to expect from an Artifex Mundi game. Loved this one too!",
            "review_score": "1"
        },
        {
            "review_text": "great finale to the enigmatis series, for those who like HOG type games i would recomend this when on sale.",
            "review_score": "1"
        },
        {
            "review_text": "If you like adventure/hidden objects games, this one is one of the bests. The whole titles of this series are good enough but, this one is awesome. Mix of adventure, puzzles and hidden objects, very interactive, variated puzzles. You don't do the same thing again and again. Even the transition scenes are interactive. Good work. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best games in the Hidden Object genre I have played. The storyline is on point, the voice acting is good, and the hidden object scenes contain items that actually make sense to be there.  The only drawback is that the cinematic scenes are very slow to load, which really detracts from the story.",
            "review_score": "1"
        }
    ]
}