{
    "app_id": 496180,
    "name": "GE Neuro",
    "release_date": "2016-09-05",
    "developer": [
        "Kite & Lightning"
    ],
    "publisher": [
        "Kite & Lightning"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Casual",
        "Simulation"
    ],
    "tags": [
        "Casual",
        "Simulation",
        "VR"
    ],
    "achievements": 0,
    "positive_ratings": 25,
    "negative_ratings": 8,
    "price": 0.0,
    "description": "Take a journey through the mind of musician Reuben Wu whose real life brain data was scanned with an MRI to create this VR portal into the human brain. Created by Kite &amp; Lightning in partnership with GE &amp; AMD.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/496180/header.jpg?t=1473141967",
    "minimum_requirements": "OS: Windows 7 SP1 64 bit or newer Processor: Intel i5-4590 equivalent or greater Memory: 8 GB RAM Graphics: AMD R9 290 equivalent or greater DirectX: Version 11 Storage: 2 GB available space",
    "recommended_requirements": "OS: Windows 10 64 bit or newer Processor: Intel i7-4790 equivalent or greater Memory: 8 MB RAM Graphics: AMD R9 390X equivalent or greater DirectX: Version 11 Storage: 2 GB available space",
    "reviews": [
        {
            "review_text": "It has CG robots doing the robot dance, and some very, VERY bright neurons.  In all seriousness, I was expecting something more in-depth as far as brain exploration is concerned. It's a fun little commerical, but takes itself too seriously compared to the MSI ad for instance. And the flashing neurons really are too bright.",
            "review_score": "-1"
        },
        {
            "review_text": "A cool experience, an even better learning tool. It's a non interactive tour of a musician's brain, sprinkled with factoids along the way. I really wish this technology existed when I was going through primary school.  If you have a kid or know someone that does, would higly reccomend letting them try this out. Maybe plan a few different programs to see since its pretty short length wise (abt 10 mins) Like this, Titans of Space, and the Blu. Appropriate for all ages (whose necks are strong enough to hold the headset duh!) but would really click in the 5 - 10 age range I think. Old enough to start building comprehension tools, but still young enough to not be too self conscious.   Just one tip, I learned from personal experience you may want to hold off on bringing to classroom unless you have like 10 Vives\\Rifts to go around, other wise you may have a full scale mutiny on your hands! Highly Reccomended, would like to see more programs in this vein.",
            "review_score": "1"
        }
    ]
}