{
    "app_id": 496260,
    "name": "Corona Blossom Vol.1 Gift From the Galaxy",
    "release_date": "2016-07-27",
    "developer": [
        "Frontwing"
    ],
    "publisher": [
        "Frontwing USA"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Casual"
    ],
    "tags": [
        "Visual Novel",
        "Nudity",
        "Anime"
    ],
    "achievements": 21,
    "positive_ratings": 206,
    "negative_ratings": 11,
    "price": 6.99,
    "description": "Meet R-ne, a metallic organism from space in the form of a young girl. She’s taken in by Keiji and the people of Hanma town, but the maid uniform-clad, cat-eared space pirate Lily and her crew are looking to sell the valuable metal that’s R-ne. Caught up in the turmoil, can she make it back home?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/496260/header.jpg?t=1550817873",
    "minimum_requirements": "OS: Vista/7/8.1/10 Processor: Intel Core 2 DUO 2.0GHz Memory: 1 GB RAM Graphics: VRAM320MB, 1280×720 DirectX: Version 9.0c Storage: 3 GB available space Sound Card: Support for PCM playback through DirectSound Additional Notes: Windows Media Player 9 equivalent or higher",
    "recommended_requirements": "OS: Vista/7/8.1/10 Processor: Intel Core 2 DUO 2.66GHz Memory: 2 GB RAM Graphics: VRAM512MB, 1280×720 DirectX: Version 9.0c Storage: 3 GB available space Sound Card: Support for PCM playback through DirectSound Additional Notes: Windows Media Player 9 equivalent or higher",
    "reviews": [
        {
            "review_text": "OK.... What can I say abot the game... It was quite good but still kinda short . From my perspective the character development and story gets a solid 10/10 for sure the animation a 8/10(what was with the too small mouths) and the only rating that everyone cares about my personal enjoyment 10/10 would buy the game 10 times again!!!",
            "review_score": "1"
        },
        {
            "review_text": "This is a kinetic novel about an amorphous metal blob alien thats being hunted by cat girl space pirates who wear maid outfits.... Do i need to go on? oh ok Basically its a lower rent Nekopara with a bit more story involved, huge breasted females, breast jokes and well the usual mammary related events (yet to find the jiggle key though) + It doesnt try too hard to be what it isnt (no pretensions)  funny Cat girl Space Pirates with big guns - Short pop pulp novel level writing (but hey its a giggle)  Its a competently written, funny and light story for the slightly more mature audience, there is partial nudity but nothing you cant see with even a basic look on the net. The graphics aren’t as smooth as Nekopara’s but are perfectly acceptable. There are occasional sound issues with the default settings (some of the characters get drowned out by the music) but these can be tweaked. On a side note the patch isn’t worth the money and only introduces 3 rather creepy H scenes that are nothing to do with the story and only detract from the product",
            "review_score": "1"
        },
        {
            "review_text": "I've never thought that metal can be so cute. &lt;3 10/10",
            "review_score": "1"
        },
        {
            "review_text": "If you buy this then you get a strange story that last about five or six hours, there are no choices at all so it get really boring fast.I am still looking forward to the next one, tho hoping that there is eventualy at some point going to be choices to make.Not a fan of kinect novels and that is the only reason i don't recommend this.I can also confirm that the 18+ patch adds nothing to the story at all, it just adds three sexual scenes that you can watch from the main menue.I would say its pointless to get the 18+ patch for this.",
            "review_score": "-1"
        },
        {
            "review_text": "It Is Worth To Buy This Game, Great Artwork And CG 10/10",
            "review_score": "1"
        }
    ]
}