{
    "app_id": 496550,
    "name": "Noob Squad",
    "release_date": "2016-10-05",
    "developer": [
        "Antonio Renna"
    ],
    "publisher": [
        "Antonio Renna"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Multi-player",
        "Online Multi-Player",
        "Steam Trading Cards",
        "Steam Cloud",
        "Stats"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Memes"
    ],
    "achievements": 0,
    "positive_ratings": 207,
    "negative_ratings": 268,
    "price": 0.75,
    "description": "Kids, play Noob Squad and begin now to enter the ranks of the losers... the only important thing is to play and have fun!!! Yeeeeeeeeeeeeee!!!!11111ONE!!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/496550/header.jpg?t=1540407820",
    "minimum_requirements": "OS: Windows XP, Vista, 7, 8, 10 Processor: 2.2 GHz Dual Core Processor Memory: 2 GB RAM Graphics: GPU with 512 MB Video RAM DirectX: Version 9.0c Network: Broadband Internet connection Storage: 1 GB available space Sound Card: Any",
    "recommended_requirements": "OS: Windows XP, Vista, 7, 8, 10 Processor: 2.4 GHz Dual Core Processor Memory: 2 GB RAM Graphics: GPU with 1 GB Video RAM DirectX: Version 9.0c Network: Broadband Internet connection Storage: 1 GB available space Sound Card: Any",
    "reviews": [
        {
            "review_text": "Tbh this game is the worst game ive ever played in my life, I bought it cause i thought it would be fun and enjoyable to play but instead i wasted money on buying it. You can't even find a match, barely anyone plays it :(( I did'nt think it would be that bad but it actaully is and i regret buying this game and i wish i never wasted money on it.",
            "review_score": "-1"
        },
        {
            "review_text": "empty meaningless barely functional miserable nothing",
            "review_score": "-1"
        },
        {
            "review_text": "Pls dont buy that sh+t! NO NO NO NO NO ",
            "review_score": "-1"
        },
        {
            "review_text": "Don't buy it its just a waste of money.",
            "review_score": "-1"
        },
        {
            "review_text": "i just start host game it not loading it say stopped working !!!! i waste money O_o",
            "review_score": "-1"
        },
        {
            "review_text": "Still better than Call of duty infinite warfare",
            "review_score": "1"
        },
        {
            "review_text": "it keeps crashing when i get in a match. i am angry",
            "review_score": "-1"
        },
        {
            "review_text": "This game is absolutely awesome i just wish people actually played it still :(",
            "review_score": "1"
        },
        {
            "review_text": "more people need this shizz",
            "review_score": "1"
        },
        {
            "review_text": "so after 3 minutes of gameplay I can say its freaking great....the graphics are amazing and the sounds....yes there is a sh**load of bugs that make the game unplayable. Ok lets see what are the problems: the menu is very glithcy- it takes some clicks to join a game- the pause menu is completly fckd (it sometimes flips around, you cant click anything, it wont close...) and the sensitivity button is also very weird...it works but if u set it to 30 it will be rly slow and if u put it to 40 it will cause epilepsy other than that this game looks awesome! and to all you squeekers saying ''eeeewhhh this game has no servers...no players...'' ITS THE FIRST DAY OF THE GAME YOU CANT GET 10000000 PLAYERS IN ONE DAY ON A GAME THAT IS NOT FAMOUS!",
            "review_score": "1"
        },
        {
            "review_text": "Made in unity with free/stolen assets.  Never any online servers Cannot reccomend ",
            "review_score": "-1"
        }
    ]
}