{
    "app_id": 496650,
    "name": "Antihorror",
    "release_date": "2016-07-27",
    "developer": [
        "HFM Games"
    ],
    "publisher": [
        "HFM Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Horror"
    ],
    "achievements": 0,
    "positive_ratings": 99,
    "negative_ratings": 27,
    "price": 0.79,
    "description": "Strange coincidence brought traveler in unfamiliar places. It would be fine, except sinister desolation is starting to embrace the surroundings. There is no another soul around for the tens of kilometers. Or that’s what it seems like? I should probably go deal with that.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/496650/header.jpg?t=1539186256",
    "minimum_requirements": "OS: Windows XP, Windows Vista, Windows 7 Processor: Dual core CPU @2GHz (Pentium D or better) Memory: 1 GB RAM Graphics: 2GB Video RAM - will work with less, but wouldn't look too good. DirectX: Version 9.0 Storage: 800 MB available space Sound Card: 100% DirectX 9.0c compatible audio device Additional Notes: Mouse, Keyboard",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "You begin the game by peeing into a toilet in the middle of a forest.  Then, the bus that dropped you off pops a wheelie as it drives off. Then, you walk into a ghost town - the same ghost town seen in games like 'Devil's Share' and 'The Note' - it's a map pack called 'HE - Ghost Town MegaPack', available on the Unity Store for $45, and it appears in this game completely unaltered.  The town contains buildings that are pitch black inside and there is no flashlight or source of light.  At one point, you'll come across a monster covered in poop that pops out of a barrel for a 'jumpscare.'  Yep. That's the game. You can see most of the stuff I just described in the screenshots for the game if you're skeptical, but this is a joke. A distinctly unfunny one.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is something that you need to experience...it's not necessarily good but it's not bad either...it just IS. If you're very confused, don't worry that's normal.",
            "review_score": "1"
        }
    ]
}