{
    "app_id": 496630,
    "name": "Empty Horizons",
    "release_date": "2016-07-19",
    "developer": [
        "ebi-hime"
    ],
    "publisher": [
        "ebi-hime"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Indie",
        "Simulation",
        "Visual Novel"
    ],
    "achievements": 13,
    "positive_ratings": 57,
    "negative_ratings": 8,
    "price": 1.99,
    "description": "Following the sudden death of her father, Mireille Maiorano is sent to live with her uncle in France. Enter Lyon, a tactless, perverse Frenchman charged with escorting to Mireille to her new home. She hates him passionately, with everything she has... so why does he make her heart flutter?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/496630/header.jpg?t=1538159288",
    "minimum_requirements": "OS: Win XP+ Processor: 1Ghz Memory: 512 MB RAM Graphics: DirectX® 9 Compatible Graphics Card DirectX: Version 9.0 Storage: 620 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Wow. Just wow. I was not expeting that ending. This story was amazing. After you play it the first time, make sure you play it again. Just trust me.   I found the characters altogether likeable, and the writing was good. The ending was surprising. Usually I can see a twist coming, but that time I didn't. I won't say any more for fear of giving something away, which I really don't wanna do.  10/10 Great story!",
            "review_score": "1"
        },
        {
            "review_text": "Like other ebi-hime VNs this is a dark tale that shocks and surprises you, tugs on the heart strings, and haunts you for days afterwards.  The premise is simple: an orphan is being chauffeured from her childhood home in Italy to live with her Uncle in France. She has known the chauffer since childhood, and the two of take a meandering journey north with stops along the way.  This a VN that you read, there are no choices. After you beat them game if you replay it there is a new choice at the beginning of the narrative that lets you pick from two alternate branches of how things could have happened.  If you enjoyed Asphyxia or The Sad Story of Emmeline Burns you’ll enjoy this. If you’re looking for a VN with lots choices, heavy romance, and a happy ending, then you should look elsewhere.  Sillyselly’s art is stunning as always.",
            "review_score": "1"
        },
        {
            "review_text": "i loved this game it's defently bittersweet and the plot twist was great (didn't even see it coming) you do need to play the three different times to get the whole story. after the first play though you will get the option of going with lyon or staying if you choose go with lyon you will go though the plot of the first play though but with some new dialogue so you will want to pay attention to it rather than use the skip feature.",
            "review_score": "1"
        },
        {
            "review_text": "The art in this game is very nice, so I am sorry to say that the story is booooooring and long-winded. Almost nothing happens. There's one vaguely interesting twist near the end... and it takes hours of boring dialogue about nothing to get to it. Not worth it.  This VN forces you to get through the whole darn story as a kinetic novel--that's right, no choices--before it unlocks the one and only choice you can make in the game. Each subsequent choice unlocks new 'plot', so you have to suffer through more boring story again and again.  I mean, you don't HAVE to. I'd paid for this VN so I felt like I should go through all the choices. I kept hoping that maybe something interesting or cool was hidden in there somewhere.  It wasn't.",
            "review_score": "-1"
        }
    ]
}