{
    "app_id": 496680,
    "name": "SweatShop",
    "release_date": "2016-07-22",
    "developer": [
        "DUCK"
    ],
    "publisher": [
        "Sometimes You"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Casual",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Casual",
        "Indie",
        "Strategy"
    ],
    "achievements": 50,
    "positive_ratings": 177,
    "negative_ratings": 200,
    "price": 0.79,
    "description": "SweatShop is a incremental game where you're the owner of a sweatshop, you have to hire more staff to work for you and sell products to gain more money. Buy many different upgrades for your workers and make even more money than before.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/496680/header.jpg?t=1471630053",
    "minimum_requirements": "OS: XP Processor: 2.4 Ghz Dual Core CPU Memory: 1024 MB RAM Graphics: 512MB Dedicated Memory DirectX: Version 9.0 Storage: 50 MB available space Sound Card: DirectX® Compatible",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Good time waster",
            "review_score": "1"
        },
        {
            "review_text": "I love enslaving chinese people to make t-shirts for me.",
            "review_score": "1"
        },
        {
            "review_text": "Not that bad of a game really, it's quite good for what it is. :D I made a video on it here:         YouTube™ Video:  [1080p HD] Let's Play: Sweatshop!&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Wanna talk about a game with potential? This game! Great concept and all and great tycoon game! But it's buggy, crashes, freezes (mac and windows), and seems to be incomplete. Please fix - and I will 100% give you a recomendation.",
            "review_score": "1"
        },
        {
            "review_text": "An extremely buggy piece of work. In fact it is so buggy, the game cannot be played as should and it's impossible to obtain more than half of the achievements. After the first game reset, which should upgrade the Hall, the Hall isn't upgraded. Sure, you can make 5 additional Walkers but when scrolling up there's no squares and options to build additional tables, workers, etc. After the reset you're still stuck as is, with a useless income multiplier. Once you have enough funds to initiate the second reset, the game does not allow you to. It just tells you 'Error'. Restarting the game, whether saved/loaded or not, just results in all Walkers losing all their upgrades, this while they are still running at the upgraded speed.  The UI is geared towards touchscreen, not keyboard and mouse as is most common for desktop systems. The mouse scrollwheel doesn't work half of the time. The game does not remember any settings whatsoever. If you relaunch the game, you'll have to manually set the video and audio options once again yourself. Over and over again. Plus, as mentioned before, restarting the game just removes the Walker upgrades, whether saved/loaded or not.  And what's worst: during the first hour of gameplay, the game managed to hang my PC 3 times. I have no such issue with any other game, ranging from other simple unlicensed Unity-games to AAA-blockbusters. My system is decent and up-to-date. The game's process also does have sufficient security rights.  Highscores, not even an hour after release, the leaderboards were being topped with players having scores in the range of trillions. This is simply not possible and most likely the result of cheating with things provided like CheatEngine (memory/code editing, increased tickspeed, etc). In this day and age there's no excuse anymore for games being subject to such things, especially considering online syncing. Regardless, such scores shouldn't even be accepted to the leaderboards, but no attention is given to that whatsoever making the leaderboards fully useless and meaningless.  All in all, a terrible piece of work. My advise to the programmer: If you have no clue what you're doing, go do something else. It's sad to know Steam has even accepted this release; so much for quality assurance.",
            "review_score": "-1"
        },
        {
            "review_text": "4.9/10 - Not Enough To Make Sweat Shops Cool Again...  I received a discount so I decided to check this one out! I wasn't totally disappointed. I don't know why, but I'm embarrassed...I played at least 7 active hours all yesterday. I completed the game the first time in 6 hours, at this time you can 'reset' or ascend to the next factory; which is the exact same except you earn coins faster. I was disappointed in this for sure!  You are responsible for the effective management of a small upstart business. (Sweat shop). You will have to purchase desks, platforms, sewing machines, cloth and workers; this stuff doesn't come cheap either! Aside from adding new equipment and workers your only job is to collect the clothes once the worker is ready. If you wait too long your worker will fall asleep and wait until you collect the clothes.  This game really had some potential for a monotonous clicker but let me down in a couple of areas:  1) When I ascended there wasn't anything new or different; just a coin bonus. I worked extremely hard for 6 hours waiting on a payout that didn't come.   2) Some of the achievements don't work. I maxed out everything in the first ascension so I should have received at least a few more achievements. This immediately made me want to quit playing.   3) The 'collectors' bug out and vanish without a trace. These units are so important because they collect cloth automatically. Unfortunately, they start to disappear once you hire more collectors than you have rows of workers. This really sucks when you are trying to auto and take a break from actively clicking.   Overall, I would give thumbs up if these 3 issues were fixed. At this current state I don't recommend, but I did have some fun with it!     Accidently Reviewed",
            "review_score": "-1"
        },
        {
            "review_text": "I tend to enjoy these kind of clicker types but this is the worst i've ever played unfortunatley.  -Very buggy -Feels like it's in Alpha stage and an all around amateurish disapointment feeling -Without exaggerating, most free webbroswer games of this clicker type is alot better and much more advanced then this -after 1minute of gameplay you seriously start to wonder why it's been released and a 'is this it?' feeling.  I do enjoy the simple clicker types, there's no need for them to be advanced or have any complexity to them in my opinion but Sweatshop fails even if it's simple.  How you ask? Imagine someone who have no experience whatsoever to make a game and then tries to create one without any edeting/correction just publish it without even looking at the result.  This is the result.  Just dont buy this one, even if it were free i would not recommend it to anyone.   ",
            "review_score": "-1"
        },
        {
            "review_text": "Unplayably buggy. Everytime I restart the game my workers dissapear LOL &gt;.&lt; And are not repurchaseable.",
            "review_score": "-1"
        },
        {
            "review_text": "Day one - Installed the game - Play the game - Keep clicking the papers  - Got walkers  - Happy that you don't have to keep your eyes on the game  - Save the game  Second day - Play the game - Crashed, screen went white - Force it to turn off  - Reopen it - Everything works - Loading the game - Found out ALL your walkers are gone!!! - Which means you have to spend another hour to clicking on the paper  I mean, it is a good game. It is relaxing and hardly need your physical work UNTIL the game crash it and all my walkers were gone. it was a pain to buy the walkers again. Lots of bugs, I won't recommend you guys buy it unless they fix the bugs. Hopefully they will fix the bugs.",
            "review_score": "-1"
        },
        {
            "review_text": "How on earth do you release a Clicker that is this buggy? I mean, how do you screw up a Clicker?  [ERROR]",
            "review_score": "-1"
        },
        {
            "review_text": "I like this game, really. But currently it's impossible to play it - it's buggy in all possible ways: multiple crashes, broken runners, problem with reset and even progress erasing.  If you like Idle\\Incremental genre i would recommend to wait for fixes and only then buy it. For now - not.",
            "review_score": "-1"
        },
        {
            "review_text": "Most of the Negative comments are correct. This is one buggy program. Would not be so bad if it only crashed itself NO!! but it crashes all my open games! Unless they can fix all the issues which are too numerous to mention this is not worth even if it was FREE!",
            "review_score": "-1"
        },
        {
            "review_text": "Before I tear this down, let me say that this game has loads of potential, but as it is right now, it's not even worth it for the $0.84 sale price let alone a whole dollar. I sincerely hope this game keeps getting bad reviews until the developer takes notice and fixes these glaring issues, because the positive rating it currently holds is wildly misleading and this game COULD be great...First off, and most importantly, the save feature is broken, so after you dump 2-4 hrs or more of your time into playing this and decide to take a break, you're screwed, but don't worry because the time counter works fine, so it will let you know exactly how much of your precious life you've wasted with this. It either doesnt save and starts you over from the begining, or when you reload your saved game, it breaks the game and just loads a blank white screen. Unnacceptable. In additon to that deal breaking bug, i noticed, in my experience at least, The platform and material 'upgrades' are purely cosmetic, meaning you are wasting huge tracks of time to save up for these way overpriced, in game upgrades that do nothing to help further your progress as they should. Theres no kind of leveling system. once you max out your workers, you just keep making the same amount of money, while the upgrades get more and more expensive effectively making you wast even MORE time. The only thing these upgrades do is unlock more upgrades, which i have to assume are just as useless. 2/10 will not play again until it gets fixed.",
            "review_score": "-1"
        },
        {
            "review_text": "Another clicker game. This one is a bit of a grind, but still OK.   You basically run a T-Shirt sweatshop. You start out with an empty factory that you can slowly upgrade by adding desks and workers.   Once you have a desk with a worker on, you simply click on their T-Shirt piles to collect your cash, which in turn you spend on more workers and upgrades.   I'm still enjoying this one so far.  5.5/10  EDIT: had to change my review for now to 'Not Recommended', due to the game currently randomly resetting players games. When they fix this, I will change my review. Just had all my progress wiped.",
            "review_score": "-1"
        },
        {
            "review_text": "I got this game at a discount and it wasn't even then worth it. My complaint about the game is that it is so buggy that it is unplayable. I quit playing after my 'walkers' (basically the autoclick function) walked off the screen and never would comeback....all of them did this. I could see them chillin in the corner of the screen.",
            "review_score": "-1"
        }
    ]
}