{
    "app_id": 496750,
    "name": "The Housewife",
    "release_date": "2016-08-25",
    "developer": [
        "Colossal Wreck"
    ],
    "publisher": [
        "Back To Basics Gaming"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Indie",
        "Simulation",
        "Female Protagonist"
    ],
    "achievements": 0,
    "positive_ratings": 74,
    "negative_ratings": 149,
    "price": 3.99,
    "description": "Take on the role of the housewife and make sure the house is maintained, she lives to keep her husband happy. Learn how the world changes for an abused person. She believes that he only beats her when she disappoints him. Get deep inside the functioning psyche of a victim of abuse.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/496750/header.jpg?t=1472124026",
    "minimum_requirements": "OS: Windows XP SP2+,Windows 7, Windows 8, Windows 10 Processor: 2.0 GHz Intel or equivalent AMD dual-core processor Memory: 2 GB RAM Graphics: Nvidia Geforce GTS 450 Series, AMD Radeon HD 6770 graphics card or better (min 1GB VRAM) DirectX: Version 9.0c Storage: 2 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "...This could have been an important game that actually did allow you to 'get deep insider the functioning psyche of a victim of abuse', it could really have been a thought provoking, sobering, harrowing experience &amp; it just isn't. Their story feels like it only barely gets a mention with about 3 audio clips in the first 3 chapters that even give the barest sense that there are issues in their relationship &amp; the opening cutscene of the fourth chapter which was the first time the game really gives itself the opportunity to deal with a serious issue in a serious manner serves up something I'd more expect in a bad Unity horror game cutscene.  If this game continues to get developed or if another developer takes a go at this topic for a game; can we please look to Sunset. This really just needed to be Sunset but a serious look at changing dynamics in spousal abuse relationships over time instead of love requited/unrequited relationship amidst political revolution.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is so tedious and BORING. Riddled with bugs that make it infuriatingly unplayable. But I guess the intended message is nice? Not well executed. The game over screen is so bland and confuding it feels like satire. I didn't play past the first chapter though so maybe it picks up.  Really really wish I would have looked at the other reviews before purchasing.",
            "review_score": "-1"
        },
        {
            "review_text": "Kind Of Sux Thought You Would Get To... See The House Wife Get Her ♥♥♥ Beaten!!",
            "review_score": "-1"
        },
        {
            "review_text": "Gets you to have a view point of a female in an unstable society, like today, although most people playing this voted down, I say it's a good way to start with showing how unfair it is for some in todays world, doing meaningless tasks to fufill the need of someone else, within an alotted time, to then be punished for ones enjoyment. Game has a good view point, and gets a message across well :)",
            "review_score": "1"
        }
    ]
}