{
    "app_id": 496890,
    "name": "Replica",
    "release_date": "2016-07-11",
    "developer": [
        "Somi"
    ],
    "publisher": [
        "Somi",
        "Zero Rock Entertainment"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Adventure",
        "Pixel Graphics"
    ],
    "achievements": 8,
    "positive_ratings": 2367,
    "negative_ratings": 350,
    "price": 1.99,
    "description": "Replica is an interactive novel game played through a cellphone and social media. The insane experience of peeping into someone's private life through a cellphone will transform you into the state's greatest patriot.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/496890/header.jpg?t=1531879390",
    "minimum_requirements": "OS: Windows XP/Vista/7/8 or above Processor: 1.6GHz Memory: 2 GB RAM Graphics: Supports 1280 * 720 resolution Storage: 240 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This game is insane. And I mean that in the best possible way. To not spoil too much, you're locked in a cell and tasked with going through a suspected terrorist's phone. The rest is kind of similar to Papers Please, but I'd also liken it to something like a puzzle in the Zero Escape series on a much larger scale. If you enjoy the story in Papers Please, and how you're a small person that can make big changes, or enjoy the puzzles in Zero Escape, I'd say buy it.",
            "review_score": "1"
        },
        {
            "review_text": " Just... wow...   After the first launch, I thought that this is another common pixel-styled game. What a mistake...  This game is incredible. I was getting lost in every moment, with tons of puzzles that I couldn't connect without seeing all of the endings. Getting to know more and more of someone's secrets was making me bad feeling, and finally when I connected everything together, I still missed something. In this game, you need to use your mind and break passwords which are getting harder and harder on every next step. In my opinion, this game is awesome.  'Tutto nello Stato, niente al di fuori dello Stato, nulla contro lo Stato' -Benito Mussolini  ENG Translation  'Everything in the State, nothing outside the State, nothing against the State'",
            "review_score": "1"
        },
        {
            "review_text": "If you enjoyed any game from following, you should try this: Please, don't touch anything. Papers Please. It's a great indie puzzle game and with full of references. 10 / 10 would afraid of big data.",
            "review_score": "1"
        },
        {
            "review_text": "If decoding/hacking is your thing, then this is the game for you.  But what I learned from this game...  'Don't trust people over 30...And doubt people under 30'  ",
            "review_score": "1"
        },
        {
            "review_text": "Its pretty sad but a great game",
            "review_score": "1"
        },
        {
            "review_text": "It is worth the $2.99 that I paid. It has a nice story, and replayability. There are eleven endings. It is a hacking visual novel with nice pixel art.",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME IS SO GOOD  BUY IT RIGHT NOW  IM BAD AT REVIEWS  ALSO MAJOR SPOILERS FOR ENDING 11 AS IT AFFECTED ME SO MUCH:   I FEEL SO BAD FOR KILLING DICKIE FOR BASICALLY NO REASON. SOMI PLAYED THAT ENDING PERFECTLY. MORAL OF THE STORY: PLEASE DONT KILL DICKIE. IT'LL PERMANENTLY CHANGE THE GAME. #RIPDICKIEGREENLEAF.  ",
            "review_score": "1"
        },
        {
            "review_text": " Despite the game being non-replayable and quite short, it surely provides a player with some things to consider  It reveals a clear image of what some countries in the modern world are about to become. Exposing one of the most controversial problems,  the problem of freedom / security ratio  in a state, Replica will turn a player into a political science major for an hour or so, making her / him question herself / himself about her / his own stance on the aforementioned issue. Futhermore, Replica's sweet pixel art and that relaxing music you'll hear, apart from its really interesting concept, stand for several additional reasons to purchase the product.",
            "review_score": "1"
        },
        {
            "review_text": "I'm glad I've encountered this game and decided to buy it. It's a really fun and challenging game with a very deep meaning to it which was interesting. Recommending this to those who likes to just brainstorm and think!",
            "review_score": "1"
        },
        {
            "review_text": "Provide 2 hours fun, worth it.",
            "review_score": "1"
        },
        {
            "review_text": "Slow paced, yet fun game! Truly satisfying and unique!!",
            "review_score": "1"
        },
        {
            "review_text": "Really Good Game",
            "review_score": "1"
        },
        {
            "review_text": "Crawling trough someones phone all sneaky peaky like, is surprisingly super fun.",
            "review_score": "1"
        },
        {
            "review_text": "Did buy the Game in Sale. Gave it a try and made it to on of the endings - was a little short and not realy worth the shekelz  but i had fun so its okay",
            "review_score": "1"
        },
        {
            "review_text": "This game is telling us how people are being so naive when it comes to terrorism.how the government blame someone who is just an ordinary teenanger.This game has good storyline with it. IM NOT GOING TO SPOIL I RECOMMEND IT 10/10 :D",
            "review_score": "1"
        },
        {
            "review_text": "Very creative and interesting game.",
            "review_score": "1"
        },
        {
            "review_text": "A neat puzzle game about power using the law for its own ends.",
            "review_score": "1"
        },
        {
            "review_text": "The big brother is watching you",
            "review_score": "1"
        },
        {
            "review_text": "Remember, remember, the fifth of November.",
            "review_score": "1"
        },
        {
            "review_text": " Replica is not an awful game, but it is neither inspired nor memorable.  My main gripe with the game is that, while the message the game tries to deliver is quite interesting, the gameplay itself is very shallow and devolves into spamming clicks on everything to find new information to progress. What you can do is very restricted, almost as if you are on rails. The writing is good for the most parts, but the totalitarian government gives off a rather comedic impression towards the end. I do not think it is really worth buying, unless you get it for next to nothing. ",
            "review_score": "-1"
        },
        {
            "review_text": "  *sigh*  bloody hell this game",
            "review_score": "-1"
        },
        {
            "review_text": "Mildly entertaining ... for an hour (and that's with me being AFK a few times). And then it's over. Would've liked more freedom to explore the phone, etc. I got one ending, but to be honest, I can't say I'm fussed to get one of the other endings. Mundane.",
            "review_score": "-1"
        }
    ]
}