{
    "app_id": 497680,
    "name": "Plates",
    "release_date": "2016-08-19",
    "developer": [
        "maasgdev"
    ],
    "publisher": [
        "maasgdev"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements"
    ],
    "genres": [
        "Casual",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Casual",
        "Puzzle"
    ],
    "achievements": 2,
    "positive_ratings": 35,
    "negative_ratings": 9,
    "price": 0.79,
    "description": "Plates is a minimalist puzzle game. Experiment and explore to progress through over 50 inventive levels.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/497680/header.jpg?t=1471742845",
    "minimum_requirements": "OS: Windows XP SP2 Processor: 2 GHz Memory: 2 GB RAM Graphics: Any card supporting DX9 (shader model 2.0) DirectX: Version 9.0 Storage: 100 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Honestly, it's a nice game, but I completed it 100% in 23 minutes (shortest paths on all puzzles). I was actually really into it. Nice puzzles, even if they are a bit easy, relaxing sounds and unique puzzle mechanics, but as soon as the puzzles start getting a bit more difficult it suddenly ends.  If you're looking for a really good puzzle game I'd recommend Hexcells over this any day. Much better value for money and infinite puzzle generator.",
            "review_score": "-1"
        },
        {
            "review_text": "Of all the simplistic $1 puzzle games I've bought on steam, this is probably the best. It's a simple concept that gets twisted in interesting ways as you progress. Never gets dry or repetitive. Not hard enough to be frustrating or easy enough to be boring. Thumbs up.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun for only a dollar. It only took me about 20 minutes to beat. You'll get even more out of it if you beat the game with the minimum amount of moves possible for each level.   TL;DR 8/8 PL8s r G8 M8",
            "review_score": "1"
        },
        {
            "review_text": "Too few and too easy puzzles.",
            "review_score": "-1"
        }
    ]
}