{
    "app_id": 497670,
    "name": "LineDash",
    "release_date": "2016-07-11",
    "developer": [
        "Gamera Interactive"
    ],
    "publisher": [
        "Gamera Interactive"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "Arcade"
    ],
    "achievements": 0,
    "positive_ratings": 18,
    "negative_ratings": 4,
    "price": 1.59,
    "description": "LineDash is an Arcade-oriented game that doubles as a procedural player-controlled multimedia sculpture.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/497670/header.jpg?t=1529921738",
    "minimum_requirements": "OS: Windows XP SP2+ Processor: SSE2 instruction set support. Graphics: DX9 (shader model 2.0) capabilities; generally everything made since 2004 should work.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "  Line / Dash is a cute little arcade game developed using Unity by Davide A. Fiandra. According to the Steam page it’s an “action” game, but I’m not sure how one could spend more than two seconds playing Line / Dash and decide that. The concept is simple: hit squares that fly from the right hand side of the screen to the left with lines that are controlled with your mouse. You may be expecting the classic “this game is deceptively simple” marketing term that’s applied to games with simple control schemes, but no. It’s that simple.  After playing the short tutorial (and by short, I mean a left click and then a right click), you’re thrown into the vibrant, geometric world of Line / Dash. Gameplay starts simple and doesn’t get any more complicated. Drop a line with left click, then make it “dash” to the right with right click, with the aim of colliding with a square. Once a square has been hit, the line returns to the vertical axis, where you can again make it “dash”. The goal is pretty simple, but if you fail to hit a square you will lose one of your three lives. Once all three lives are lost your score is tallied up and you're added to the online leaderboard, which at the time of writing doesn't seem to have many on it (my pitiful first attempt was apparently the 75th best in the world).   The gameplay is about as casual as you can get, but that doesn't take away from the game. The neon visuals and sound design form the biggest positive for this game: as you drop lines and dash across the screen to collide with the squares, colours will change and previous lines will persist, forming the 'multimedia sculpture' mentioned in the game's description. This leads to an almost hypnotic experience, with the vibrant lines combining with the changing background to make an almost artistic experience. More often than not I would find myself being more interested in making a good-looking series of lines rather than adhering to the rules of the game. There is also a fairly limited 'soundtrack' to the game, which mainly consists of dull thuds when lines collide with squares, and a short jingle that plays when you achieve a combo.  On the bad side of things, this game gets old fairly quickly. I spent about half an hour on the game, and that was more than enough to get a feel for it. It gets pretty boring after a little while, as the game has a severe lacking in variety. I feel like this is a little bit of a missed opportunity for the developer, because despite the initial good impression, Line / Dash never capitalises on that running start. It also feels a little empty without a proper soundtrack, perhaps something a la Tetris would help to fill the void. Similarly, while I gave the visual aspect of the game a glowing review, I also feel like it's missing exactly that: glowing. The cherry on the top of the visuals would be a pulsating neon line rather than a persistent one.  All-in-all, however, this game is a great little gem to pick up with some petty cash. I can see myself coming back to it every now and then to kill ten minutes. The modest price tag is a huge bonus, as well. If you've got £1.50 lying around in your steam wallet, Line / Dash is as good a purchase as any in the price range.  (It should be noted that the game comes with a warning for those that are sensitive to contrasting bright colours. Definitely give this game a miss if this applies to you.)  This review was written on behalf of TeamTom's Reviews, who also provided the key. You can check out the steam group   here , or visit us on our   website  [teamtomreviews.co.uk] ",
            "review_score": "1"
        },
        {
            "review_text": "COME FOR THE LINE / STAY FOR THE DASH",
            "review_score": "1"
        }
    ]
}