{
    "app_id": 497720,
    "name": "Funfair Ride Simulator 3",
    "release_date": "2016-08-04",
    "developer": [
        "Pixelsplit Simulations"
    ],
    "publisher": [
        "Pixelsplit Simulations"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Stats"
    ],
    "genres": [
        "Simulation"
    ],
    "tags": [
        "Simulation"
    ],
    "achievements": 29,
    "positive_ratings": 30,
    "negative_ratings": 37,
    "price": 4.79,
    "description": "Have you ever had the opportunity to control your own amusement ride at the fair? Probably not ... Now you can experience this on your PC &amp; Mac with the new Funfair Ride Simulator 3. With physics and detailed graphics, awesome fog, firework and light effects and a simulated fairground.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/497720/header.jpg?t=1525412463",
    "minimum_requirements": "OS: Windows 7 or newer Processor: 2 GHz Memory: 2 GB RAM Graphics: Compatible with Shader Model 3, 512MB VRAM Storage: 1 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Not really a simulator, couldn't even really call it a game either lol.  Expection Being able to go on rides have a bit of fun in first person view, go on bumper cars and go around a park.  Reality Simple controls to control how fast a ride goes like your the operator and the lights and cheesy sound effects, having to back out to choose a different ride from a menu then get told you can buy a ride to play with ....   Conclusion You probably could have more fun going on secondlife and finding an amusement park, the physics might be tempermental but still alot more fun than whatever you would call this.",
            "review_score": "-1"
        },
        {
            "review_text": "this game is not soo good for all of the computers",
            "review_score": "-1"
        }
    ]
}