{
    "app_id": 497850,
    "name": "8-Bit Hordes",
    "release_date": "2016-08-12",
    "developer": [
        "Petroglyph"
    ],
    "publisher": [
        "Petroglyph"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Online Multi-Player",
        "Local Multi-Player",
        "Co-op",
        "Online Co-op",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Workshop",
        "Steam Cloud",
        "Includes level editor"
    ],
    "genres": [
        "Indie",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Indie",
        "RTS"
    ],
    "achievements": 25,
    "positive_ratings": 335,
    "negative_ratings": 71,
    "price": 10.99,
    "description": "From the team that brought you 8-Bit Armies comes a new fantasy RTS as fast-paced and friendly as the original! 8-BIT HORDES is a colorful strategy-arcade game that is easy to learn for players of all skill levels. Collect resources, build up and defend your base, amass your army of orcs or humans and ultimately crush your opponents!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/497850/header.jpg?t=1521061796",
    "minimum_requirements": "OS: Windows Vista SP2 Processor: 2.6 GHz Dual Core Processor Memory: 4 GB RAM Graphics: Nvidia Geforce GTS 250 or ATI Radeon HD 3870 DirectX: Version 11 Storage: 2 GB available space",
    "recommended_requirements": "OS: Windows 7 Processor: 2.6 GHz+ Quad Core Processor Memory: 6 GB RAM Graphics: Nvidia GeForce 550 Ti or AMD Radeon HD 6800 Series DirectX: Version 11 Storage: 2 GB available space",
    "reviews": [
        {
            "review_text": "can't wait for 8-Bit Aliens!",
            "review_score": "1"
        },
        {
            "review_text": "Are you ready for another interesting and enjoyable game with a slight twist? 8-Bit Hordes, the third entry into the 8-Bit Armies series (if you count the Guardian’s Campaign DLC) jumps out of the Command and Conquer style universe and lands into an early Warcraft universe. Reminiscent of the original Warcraft games, I find 8-Bit Hordes to be just about the best 8-Bit Armies game to date. In the original 8-Bit Armies, you had equally equipped factions fighting over who had the better paint colour. That is after all because that is the only detail that separated the teams. Then came the expansion which added an entire new faction. This made 8-Bit Armies much more like the classic Command and Conquer series I loved by adding a brand new NOD style faction with NOD style units. This really spiced up the game since now you are no longer just a carbon copy clone of your enemy; they actually juiced up the action by having abilities and units you did not have. The adversary still looked fairly similar, because I mean you can only change a tank so much in function and appearance, and soldiers other than showing off their fancy uniforms are still just people no matter how loud or brave or brash they might be. Now in 8-Bit Hordes, the factions look not only totally altered but completely different. No longer is it the dreaded other colour out to get you, now it is a whole other race out to get you. Enter the Orcs Versus Humans!   Each faction looks completely different from each other. The Orcs occupy more primitive looking structures where as the humans utilize more medieval looking buildings. Each faction, at least in my opinion, feels like it plays different from the other. It doesn’t feel like just a re-skinned army versus a different skinned army. I know we have all played games where the armies are so similar we temporarily forget who is fighting who so it makes it a lot more fun to play when you can actually tell at a glance if that’s friend or foe you are about to fight with. Both factions also have their own campaign.  The campaigns here are basically the same as they were in 8-Bit Armies, which brings the same pros and cons as before. Due to the timer element, assuming you want to complete all the bonus objectives (and you should want to because it permanently unlocks bonuses to be used on all prior and future missions) this can mean you will have to just rush through a level, spamming the quickest building units you have until you complete all objectives. This detracts from the fun as you end up just using the basic units in wave after bloody wave until the enemy is so slick with your blood that they drown (metaphorically). If you go back and replay a level once you completed all the objectives, you can enjoy it far more. You are able to explore the map, find the hidden boxes, and enjoy the detailed units and scenery. The fact that completing bonus objectives gives you permanent rewards is something that I have enjoyed about this series. Usually the bonus objectives just change your badge colour for completing the mission in most games. Hey you did that pointless extra task we told you to do? Great! Oh we should reward you… um… err… have some pocket lint, a candy wrapper and a Gold star champ! In the 8-Bit Armies series, your rewards are additional starting units or extra starting buildings, both can really help you out come later on in the game. In fact, the game even suggests if you are having too much trouble with a bonus objective that you should wait and come back once you unlock more stuff as it will help make the timered challenge much easier.   Graphically, the game is an improvement over the previous games. It still has the blocky charm of the previous games but the units appear far more detailed now. The units are also far more diverse than they were in the previous ones as well. If I could only play one of the 8-Bit Armies games, this would be the one I would choose. It even has the added bonus that since I do own both of the earlier games, I can use them in 8-Bit Hordes as well.   You still can’t rotate the buildings, which takes away a certain charm from the base building elements, but I can overlook that. Other than sometimes making a building fit into a spot it wouldn’t have otherwise fit, rotation serves an almost pure cosmetic function anyway. You also still need to spam additional copies of buildings to speed up production which can really clutter your base, but also saves you from losing valuable production capabilities if the enemy breaches your base. This is perfectly fine but it would be nicer if you could just add to an existing building to enhance its output too. The ability to upgrade buildings is a feature in the game, so it’s possible someday down the road that feature may be added. The Headquarters can now be upgraded so you can produce different units at your other structures.  A core change to the game play occurs in 8-bit Hordes as well. On the surface it might not look like a significant change, but when you stop to think about it, it really changes things up. I am still undecided which style I liked better. I will go into those details now starting with the original. In the Original 8-Bit Armies and the Guardians DLC, you had to worry about power management. The more buildings you constructed the more power you needed to support your base. Additional power generators could be built to help support your base defenses and production capabilities. Assuming you had power, your base defenses would keep on firing and your units would keep on being produced almost indefinitely. If you lost power some of your buildings (like your turrets) would shut down, and construction would slow until power levels were restored. A great strategy in multiplayer or versus a stronger AI, is to charge into the base with a swarm of weak, cheap, and quick to produce units and attack their power generators until their power went offline, then sending in your more expensive mop up crew to take out their buildings and units. Now in 8-Bit Hordes, units are controlled by the “power grid” or rather the food supplies. Each unit needs 1 food available. If you have no more food available, no more units will be produced until more farms are built. You can freely spam buildings now because there are no power concerns. It also means that you can’t just run and gun the power plants to take a massive tower defense wall /maze offline. There is a new strategy that can be attempted here, but it isn’t that effective. Once you think your enemy is unit capped, take out their harvesters. If you take them out and their production cues kick back in to gear, they may not be able to produce harvesters to replace them and they might not have the money to build a new farm to allow additional units. The solution though is they just need to attack you… but it might slow them down a little…maybe… Both systems have their merits and I actually thinking combining them could be interesting.  So should you get 8-Bit Hordes? If you like classic RTS that involves good old base building mechanics, I see no reason to not give 8-Bit Hordes a try. It contains pretty much all the charms of the vintage Warcraft and Command and Conquer games wrapped up in a better looking package. If you liked the previous 8-Bit Armies games, you will definitely like this one. It takes the best elements from those ones and slaps a much better looking exterior on it. It doesn’t have all the gimmicks and flare that more modern RTS games have which is very refreshing since most of those gimmicks end up detracting from the game play. You don’t even have alternate abilities for the units, which is great for me because in games like Starcraft (maybe the next 8-Bits game theme?) I never remembered to use the alternate abilities anyway. Most of the other games add far too many additional features that end up detracting from the game play.",
            "review_score": "1"
        },
        {
            "review_text": "Great Sequel to armies, first off you can play with the previous factions from armies on multiplayer and play with people currently playing that game, you only need to own 1 of the games to play with friends on multiplayer and secondly there are new campaigns and many more unlockables, buildings, and units. this is a great expansion that you should get if you love the previous game.  9/10 Great experience over all",
            "review_score": "1"
        },
        {
            "review_text": "A nice little RTS that is essentially a stand alone expansion to 8 Bit Armies. With a total of 4 factions to chose from now (assuming you also have 8 Bit Armies) the 8-bit experience is definately much deeper than before with larger selections of units and strategies. Military vs Fantasy is also pretty cool.  I do believe however, the game is a little unbalanced (eg mass air ), but that is to be expected as the game has just come out. There are also a few typos here and there (eg the tech trees). It would also be pretty cool if we could still have the 8-Bit Armies music in the game when the original factions are selected.  If 8-Bit Armies' support was anything to go by, I'm sure Petroglyph will give 8-Bit Hordes the same treatment with constant tweaks and updates. Definately reccomended for fans of RTS or anyone who is looking for a more laid back experience.",
            "review_score": "1"
        },
        {
            "review_text": "Classic PC RTS gone 8 bit!",
            "review_score": "1"
        },
        {
            "review_text": "love the game so far but i mean ive played 6.1 hours and it launched today so i think ive played long enough to call it good,",
            "review_score": "1"
        },
        {
            "review_text": "8-Bit Hordes is a stand alone DLC to the game 8-Bit Armies. This addition adds two new factions which can be interchangeable between 8-Bit Armies and 8-Bit Hordes. For example you can play as DeathSworn(Orcs) and vs Renegades(Basic C&amp;C army). The art style is very simple and the gameplay is also very simple making it an easy pickup game. Anyways lets go into the pros and cons.  Pros:  +Bunch of new maps and they are very different from the maps in 8-Bit Armies not just a copy and paste reskin  +Factions are very different in play style and looks  +New voice sets and music  +You can cross play with 8-Bit armies  +Different upgrade paths compared to 8-Bit Armies  +Easy to learn, after a few matches you'll be a pro  +Variety of new units in the new factions  +Easily understandable upgrade paths for buildings units ect  +Nostalagia of Warcraft III  +Campaign has alot of missions Cons:  -Campaign can be a bit repetitive  -AI in campaign can be a bit 'dumb'(Destroying their base next to their army and they do nothing)  -Barely any multiplayer games  -Bit pricey  8-Bit Hordes is a simple and fun additive to 8-Bit Armies. Although the campaign is a bit repetitive, its still pretty fun. Skirmish is fun and the AI is challenging but not overpowered. If youre getting this game for a competitive multiplayer I would not recommend because the quick match takes ages and there is barely any open lobbies. 100% get this game if you were a fan of Warcraft III and want a simple, fun and challenging game. Also if you enjoyed 8-Bit Armies this is a must pick!   Rating: 8/10 Great game guys can't want for your next updates and factions!",
            "review_score": "1"
        },
        {
            "review_text": "2 good. Great 8-bit graphics, very little lagg. Connection is great and on the first day there was lots of people on. I definetley recommend getting this.",
            "review_score": "1"
        },
        {
            "review_text": "gg dudes nice game !! if you buy 8 bit armies and 8 bit hordes you will have 4 teams gdi nod orc and humans only G.L.A and zerg is missing lol :P ! frank klepaki soundtrack ! nice gameplay alot of good maps ! . plz make next game 64 bit :P i dont like 8 bit lol",
            "review_score": "1"
        },
        {
            "review_text": "Tell me this is not warcraft which beated C&amp;C in 1995. Thumb up for C&amp;C:Tiberian Dawn and Westwood, as always...",
            "review_score": "1"
        },
        {
            "review_text": "I would recommend the game but the troop spamming is way to over powered.",
            "review_score": "1"
        },
        {
            "review_text": "fun and love the stratigy thus game talkes if is a really fun game and i perfer you to play it",
            "review_score": "1"
        },
        {
            "review_text": "So much fun! Classic RTS in 8bit! Highly recommended!",
            "review_score": "1"
        },
        {
            "review_text": "crashes when im about to finish level",
            "review_score": "-1"
        },
        {
            "review_text": "I have to say it's a good game if you like Halo Wars and all those other things but this is like Clicking Simulator along with Army Training Simulator.  If your graphic card is more modern, VSYNC can't even help you, if you were to enable it it's stuck at 120 FPS making your screen stutter and shake all over the place. There's no resolution option, it's stuck at a constant 1080p (1920x1080) resolution by default. The .ini isn't anywhere to be found either.",
            "review_score": "-1"
        },
        {
            "review_text": "The game manual isn't even for this game....",
            "review_score": "-1"
        }
    ]
}