{
    "app_id": 498240,
    "name": "Batman - The Telltale Series",
    "release_date": "2016-08-02",
    "developer": [
        "Telltale Games"
    ],
    "publisher": [
        "Telltale Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Batman",
        "Superhero",
        "Story Rich"
    ],
    "achievements": 30,
    "positive_ratings": 5729,
    "negative_ratings": 1783,
    "price": 11.99,
    "description": "Enter the fractured psyche of Bruce Wayne and discover the powerful and far-reaching consequences of your choices as the Dark Knight.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/498240/header.jpg?t=1522267577",
    "minimum_requirements": "OS: Windows 7 64Bit Service Pack 1 Processor: Intel Core 2 Duo 2.4GHz Memory: 3 GB RAM Graphics: Nvidia GTS 450+ with 1024MB+ VRAM (excluding GT) - LATEST DRIVERS REQUIRED DirectX: Version 11 Additional Notes: Not Recommended for Intel integrated graphics",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Made a choice to not hurt a criminal, the game tells me I beat him into the hospital. Gave statement to the press, the game tells me I did not. If your choices are not reflected correctly within 1 episode the rest of the series is a joke.",
            "review_score": "-1"
        },
        {
            "review_text": "I deleted my chapter 1 review to put this one up (chapter 3 just finished) because my opinion of the game has totally changed.   More and more I'm seeing the choices not matter...for instance I took the high road the whole way through chapters 1 and 2, using as little force as necessary and not brutalizing anyone, and yet the police/Gordon still hate me because they think I'm a psychopath who tortures people.  Without spoiling anything, something radical happens at the end of chapter 3, this big f*ck you cliffhanger that is meant to steer the plot in the direction that the designers want it to go. They build this sense of immersion and RP and really make you feel like you're making meaningful decisions. Right up unil the last few moments that is, where they pull back the curtains violently. It's very clear Telltale has no intention of ever letting players have any amount of control.   It's so sad because the dialouge and story and character writing is so good...right up until the literal last minute scene that undoes everything. It could have been a really amazing game.  It would be one thing if the narrative was good, but it's absolutely riddled with plot holes and consistancy errors.   Moreover, as a dedicated Batman fan, I have to comment on the fact that they retcon the ♥♥♥♥ out of the cannon on a systemic level. Characters have totally different allegiances/motivations that what we're used to. Almost none of the charming characters that you know and love are the same anymore. At this point, is it even a Batman game?  The tearing that was there in chapter 1 isn't a slight nuissance anymore...it's now very prevalent and annoying. Character models are glitchy, art assets are poorly coded, just all around this not a polished product.   Lastly, the gameplay is even more watered down now. The detective sequence in this chapter forces you to link evidence together so that you can 'figure out the puzzle' even though it would be obvious to a simpleton what is going on. Then there's random uneccessary QTE when you're doing simple tasks (like not even timed, but just there randomly as if to check that you're not AFK).  Telltale is clearly running out of ideas and budget, and I don't have much faith in their products anymore. I may not even finish this game.",
            "review_score": "-1"
        },
        {
            "review_text": "I understand that my computer is a few years old, and that over time games advance. However there is no reason a cell shaded point and click adventure should be chugging along so slowly when all other Tell Tale games I've played run flawlessly. Can't recommend this game to anyone until they get these bugs worked out. I'd rather wait longer between episodes so you can fix this mess, than get slowly handed the steaming turd this game has been so far.",
            "review_score": "-1"
        },
        {
            "review_text": "This is the second game I have ever returned in my entire life for a refund. I enjoy TellTale Games other works - Tales from the Boarderlands and The Wolf Among Us are some of my favourite works of fiction. I love the Batman: Arkham series (until Arkham Knight, which is the first game I ever returned for a refund) so you can see where this is going.  I played through the first episode, and it was horrifyingly bad in two completely different ways. First was the technical faults. Mouse lag, graphical stuttering, frame tearing the works. I'll be the first to admit my nVidia 760 isn't the greatest graphics card ever created, but it handles all the other TTG games at max graphics. Even set to its lowest settings, the lag made QTEs difficult, the mouse lag made aiming sections (and sometimes dialogue selection) nearly impossible, and the jitteriness gave me severe eye strain.  Yes, I did try what was posted in the forums to try and fix it, but no dice.  Secondly, the story is just BAD. Generally speaking, the first episode of most TTGs is the worst of the series, but without getting into spoilers, the set up for the story is just a mess. Utterly predictible, occasionally tedious, and disingenuous - it promises to reveal Bruce Wayne's psychological turmoil within by falling back on everything you have seen before. The only way the story would have provided a new angle on Batman is if you have never ever seen a Batman story before. There seems to be exactly one reasonably meaningful 'choice' in the entire plot.  I could have forgiven the technical issues if the story was grand. I could have forgiven the story if the game was stunning and innovative. Having both issues is just crude.  HAHAHA / 10 - you'd have to be as nuts as the Joker to enjoy this game!",
            "review_score": "-1"
        },
        {
            "review_text": "Although I love Telltale, and I'm so happy they went with telling a story from the DC-universe, it's a shame that the game is so poorly optimized. The lagging is unbelievable, to the point that I can barely play for ten minutes straight until the point where the game suddenly cuts to game over without any specific reason.  I hope Telltale will do something about this, and then I'll change the review as the concept itself seems like a lot of fun.",
            "review_score": "-1"
        },
        {
            "review_text": "'What have you been hiding from me, Alfred? ALFRED!!!'  The moment I witnessed this chilling scene in the game, I knew it would be different from the normal Batman games.  Technically, it IS a different game; whereas Rocksteady goes for the classic Batman, Telltale has chosen to give us an even grittier story.  At the start of this game, we witness Batman taking down a gang of mercenaries and his first meeting with Catwoman. As we're used from Telltale games, the fights are QTE-based and I admit, they are interesting. However, the control scheme is a bit confusing and you will fail one or two QTE's, but that doesn't matter. Because, in the end, if you've build up enough 'QTE-power', you'll be rewarded with a finishing move.  The dialogue in the game is top-notch, with Troy Baker voicing Bruce Wayne &amp; Batman(he also voiced The Joker in Arkham Origins). It's a shame we don't have the glorious Kevin Conroy voicing Batman, but it doesn't matter; Baker pulls off a good job and displays a different Batman / Bruce Wayne than we're used to see.  As to the story, Telltale has chosen an interesting plot - Early in the game, Bruce Wayne funds Harvey Dent's campaign to be the new Mayor of Gotham, who has promised to sweep the streets clean of crime. But after episode 1, we learn that even the Waynes aren't the 'knights in shining armor' as they were always thought to be. Bruce starts to learn a few dark secrets about his family's legacy, which impact his daily life as well as his Batman adventures.  The game might appear a bit laggy, but that's ok; overall, it's smooth and the great story, the great voice-acting and the QTE - fights make up for this. What's even more interesting is that you get the option to choose whether to handle certain events as Bruce Wayne or as Batman (as per Episode 2; Episode 1 is more of an introduction and it forces you mostly between Bruce Wayne and Batman - sections)  All in all, it's worth a buy. Full price? Maybe not, as only three episodes have been released. But, as with other Telltale Games, it's definitely worth the wait until the last 2 episodes have been released!",
            "review_score": "1"
        },
        {
            "review_text": "This game is wonderful. Atmosphere and story are great, dialogue choices always felt very in-line with the character's different possible motivations... Setting up an awesome Batman mystery and story.  Gameplay mechanics are nothing to write home about, but are good enough not to detract from the game. Button prompts during actions sequences I'm going to stay neutral on, but the investigation and engagement planning modes both showed a lot of promise, adding even more to the game.  Played through the game on high graphics to the end without stutter, crashes, or issues at all. My machine is not all powerful either, it is fairly mediocre. I get the feeling, as is usually the case, that the performance complaints are just a little overblown, like they were with Arkham Knight. I don't mean to dismiss them, it is perfectly natural to be angry when a game you just purchased won't let you play how you'd like to.  I just mean to say that even if I had encountered a few bugs, I would still recommend this game. Especially if you are a Batman fan. Lower the graphics if you must just to get through the story, it is telltale after all, I doubt it would detract from the experience too much.   Already planning at least a second playthrough of the first episode. Really hope that the game gets fixed for everyone it's broken for, and that if you do buy it, you can enjoy it as I have: without issue.",
            "review_score": "1"
        },
        {
            "review_text": "Telltale's formula has worn thin. And this was the straw that broke the camel's back. Each scene is sewn together clunkily, with dialogue and gameplay to induce multiple eyerolls per session. Your choices don't matter, the voice acting is poorly cast, the characters poorly concepted.  And that's not to even mention the 'new' graphics engine.. new? It still looks like crud. The animation jerky as Southern beef. Stilted as English cheese. And then they have the audacity to put 'cinematic' black bars on widescreen ratios?   No thanks Telltale. You just unhyped me for The Walking Dead Season 3, something I never thought I'd say.  Many will disagree with this review, but as an avid Batman fan and once Telltale fan, this is a disappointment as bitter as making Penguin a millenial with a poorly voiced faux-British accent.  1/5.",
            "review_score": "-1"
        },
        {
            "review_text": "To be blunt, Batman - The Telltale Series is a game that has a lot of really great ideas that completely fails to stick the landing. It brings back a lot of old comic story lines (like Harvery Dent running for mayor, becoming close friends with Bruce, and then turning into Two Face when it all goes disasterously wrong) and tries to put a spin on existing Batman lore by asking a new question: what if Bruce Wayne's parents were secretly part of the mafia? Most of the ideas that Telltale brings together are actually pretty decent on their own, but the problem is that they try to do too many at once and fail to do any of them justice. More importantly, most of the choices are ultimately cosmetic and the climax is never really built up before hand, so the end experience is just boring and dissatisfying. If Telltale had just committed to just two or three plotlines, this could have been an incredibly strong game, but this game just desperately needed an editor to cut down the excess ideas down to the essentials. Unless this game is on a really good sale (or you're just a huge afficionado of all things Batman), I can't recommend buying this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Oh, the pain. After having bingeplayed the first three Arkham games in the space of about two-three weeks (and having avoided Arkham Knight for the  exact  same reason I'm now getting a refund for this game), I was thrilled to play this. Hell, I even preordered it the day before it came out because I was so excited to see what Telltale had for me, seeing as I loved The Walking Dead season 1 and 2, the Wolf Among Us, and even the Back to the Future and Jurassic Park games. I never expected this.  The absolute highest fps I got in this game was 17fps, and that was at the very beginning, at which point it went incredibly downhill from there, dipping inbetween 5 and 7 constantly before finally giving up and crashing. I restarted to the same result, at which point I uninstalled and reinstalled the game. That didn't do anything, however, and so I'm just giving up and getting my money back until I have  definitive  proof that it can actually be played. I even waited 4 days for a patch once I saw the amount of negative reviews the game was getting, just to see if anything better came along. Sure enough, a patch came, and sure enough, it did nothing for me.  Once this game seems to be getting good again, I'll consider rebuying it. Until then, I'd rather buy something I can actually play.  0/10 stars. Get good scrub.",
            "review_score": "-1"
        },
        {
            "review_text": "   An Adventure Game",
            "review_score": "1"
        },
        {
            "review_text": "I just got done with the first episode and I can say that it is a very good game. It mixes combat, story, and hard decisions. I can not wait to play the next episodes.",
            "review_score": "1"
        },
        {
            "review_text": "When I first purchased the game (yesterday) I encountered a lot of the same issues many people are having. But after reinstalling it and switching the settings to use the Nvidia chip in my laptop instead of integrated I haven't had any of the problems. I play now at 1080p but with anti-aliasing off (haven't tried turning it back on). The controller seems to work fine for me as well. It sucks that it's not working for everyone but hopefully it'll be fixed soon. The game in my opinion is pretty good and intriguing, and I can't wait for the next episode. While I do recommend this game if you can work to fix the problems by fixing the settings, it's dissapointing to see a flawed product at launch when it should have been taken care of better.",
            "review_score": "1"
        },
        {
            "review_text": "childish dialogs and poor animation, telltale has really been doing the same thing over and over for what, 10 years?  never thought a batman game could be this boring but they did it.  dodge this one like hell and just play any of the arkham games, guys.",
            "review_score": "-1"
        },
        {
            "review_text": "I really want to say that I could recommend this game, but the ending is so dissatifying, and disappointing. Although you can make many choices, it seems as though your choices don't always make a difference. I think you should have the ability, in one of the given options, to take your choices a bit further. I loved this idea and style of the game, it just didn't always run smoothly, a bit buggy. Episodes one and two along with part of three are great, but then the plotline just seems to breakdown. (Honestly, think there were too many characters involved at once.) I really got into parts of the game, pretty intense at times, there was so much suspense built up... and the ending ruined it. Just don't get into this game if you don't want to end up disappointed.   (6.5/10) maybe  ******POSSIBLE SPOILER ALERT*******  There were many cases in which I tried to 'talk people down' or calm them down and with all the efforts, no one really responded in a realistic way. I understand, you can't succeed in talking someone out of a bad decision in every situation or it would kill the game. However, if you can choose the fully pursue the violent route it would be nice to do the opposite. I think it's a little odd that you can't prevent Harvey becoming Two Face even if you choose to save him in Episode Two. Instead he ends up rampaging either way. There are a few things similar in the plotline that just doesn't end the way you would like, even if you made the correct decisions for it.  RANT:   Why is it when you try to save people or be rational, you still end up getting hated???!!!!! For example, when you're sitting inside the car with Alfred after the officer has stopped your vehicle shortly after getting out of Arkham, i try to say 'I want no problems' Bruce starts screaming like a maniac, like why!? You try save Harvey and he still hates you, EVEN IF YOU DON'T FIGHT HIM AND YOU DON'T SLEEP WITH SELINA. And why can't I help him get professional help, SELINA EVEN SAYS SHE'LL CALL HELP AND IT NEVER HAPPENS. Alot of the time, if you take the nonviolent way of doing something it doesn't matter at all, nobody cares nor sees Batman as a Hero. But if you beat the crap out of someone when you interrogate them, Batman is a villian. The only way to end up feeling satisfied in the end is if you choose Selina over Harvey, take Selina away from Harvey, and then screw everyone else over in the process while being as violent as possible in the process. OH and you can't make things right with Oswald. You should be able to do at least some of these in the same storyline, but some of these options are given.",
            "review_score": "-1"
        },
        {
            "review_text": "  NOTE: If you're having trouble running this check the windows 7 option in the start up menu. I'm running this on windows 10 and this worked for me and allowed me to mess with the settings and get a normal FPS.",
            "review_score": "-1"
        },
        {
            "review_text": "I've only played episode 1 but it is exactly what I wanted from a batman telltale game. However, there are a couple glitches that ♥♥♥♥♥♥ me the hell off but besides that it is great. I personally would rate it and 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Telltale did an awesome take on Batman. Taking basics of what we know of the Batman lore and adding unique twists to the story.  Combat sequences are fun, satisfying to watch and easy to use. Detective mode is great addition that isn't too complex and adds a bit more depth to the story. Batcave is a nice place to sum up all the data you've come up with and take a short break from the action, read updates on Batcomputer, watch news and dig through clues.  Dialogues are well written, characters have great depth of emotions and lip sync. All characters have rich personalities and you can feel good chemistry between them in conversations, which adds nice feel of immersion. Every time I start the episode I'm literally on the edge until it ends.  Having a blast with the game and I'm enjoying it a lot. Chapters are around 2 hours long each, which is a pleasant surprise considering it's short series of sorts. Runs well, plays well at least at the moment of writing this, so if you are a fan of Batman, try the Episode 1, it's free and see if you like it.  Have fun.",
            "review_score": "1"
        },
        {
            "review_text": "altough i have read the nvidia 1st day fix notes, I could not make it run in fuIll screen on ASUS ROG with 960M 4gb video card. its simply frustrating that they have released the game like this.  dont buy it at its current state.  preordering was a mistake. im realy sad that another Batman game suffers the same as Arkham Knight did. ",
            "review_score": "-1"
        },
        {
            "review_text": "It is basically a good game but a lot of story elements were not detailed, some conversations are dumb and the game still has some bugs, but it has a good Batman like feeling as you play it and has some twists. I recommend the product but I also bought at reduced price (I would not recommend for full price).",
            "review_score": "1"
        },
        {
            "review_text": "WOW.... no issue with the game... fantastic story... quite good graphic for a telltale game.. nothing to say... i love it...",
            "review_score": "1"
        },
        {
            "review_text": "Flawless graphic and audio performance. Win 10. Entertaining but quite short. Can't wait for next episode. ",
            "review_score": "1"
        },
        {
            "review_text": "It's broken. I'm not even past the title screen. If you try to raise the resolution beyond its default, your mouse gets stuck in a little invisible box in the upper left corner.",
            "review_score": "-1"
        },
        {
            "review_text": "Black screen right after pressing Enter, no fixes works. refunding it, enough with Telltale ♥♥♥♥♥♥♥♥ and ♥♥♥♥♥♥ tech.",
            "review_score": "-1"
        },
        {
            "review_text": "So I bought the Season Pass after trying Episode 1 for free, and my save file is gone? Why is this? Very disappointing problem to have. Otherwise the game's story, characters, and dialogue are interesting. A different take on the Batman story. Graphics are a little eh at times.",
            "review_score": "1"
        },
        {
            "review_text": "white screen wtf",
            "review_score": "-1"
        },
        {
            "review_text": "If you loved playing the Bat in the Arkham series you're gonna love playing as Bruce Wayne in this one.",
            "review_score": "1"
        },
        {
            "review_text": "I love telltale. But this game is to laggy and always crashes it. Id recommend not getting it until Telltale do something about the lagging or crashing",
            "review_score": "-1"
        },
        {
            "review_text": "The latest Batman games, whether from Rocksteady or Telltale, seem to be getting poor ports for PC. Why is that? Anyway, you should probably wait for some maintenance before picking this one up. Or...just get a console version.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is amazing, it runs perfectly fine on my PC without any issues. The story is super intriguing and its very refreshing to see Batman through the eyes of Bruce Wayne since we dont see that very often. I cant wait for the release of the next episode and definetly recommend this game to any Batman fans.",
            "review_score": "1"
        },
        {
            "review_text": "The game has its + and -. I like the original view on Batman's story and you are quickly caught up in it, trying to help Bruce. What bugs me is that the episodes are rather short and sometimes I would appreciate more decisions or harder gameplay, for example when you are scouting crime scenes.",
            "review_score": "1"
        },
        {
            "review_text": "There were some technical issues realese day but after the update but after playing 15+ hours i really do recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "As a big Batman fan I have enjoyed the game, only problems have been hitching every few minutes. Episode 1 has been very good so far.  (will add to review as each episode releases)",
            "review_score": "1"
        },
        {
            "review_text": "DO NOT GET THE GAME IN ITS CURRENT STATE!!!  The frame rate is terrible, the sound lags alot and the performance overall at this moment is just a huge mess.",
            "review_score": "-1"
        },
        {
            "review_text": "The FPS is very low. the Texture quality is quite bad, when in full screen at least. Hopefully it gets fixed soon.",
            "review_score": "-1"
        },
        {
            "review_text": "Got so excited and stared at my computer screen for hours waiting for its release, only to realize that I can't even play the game. In my opinion, I do not think it would be that hard to test your game on mediocre devices along with good machines so people wouldn't be as upset as they are... Cause like, I love Batman guys. And who knows how long it's gonna be until improvements are made. I think this just might be another Arkham Knight-ish PC port. And I do not know if I would recommend this game yet since I can't play it. So for now I'm gonna go with a big fat NO.",
            "review_score": "-1"
        },
        {
            "review_text": "Cantt even use controller DO NOT BUY GAME!!!!!!!!! I REPEAT DO NOT BUY THIS GAME!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "Do not waste your money. The game is good but only for the time that it works. It constantly crashes and the only way to solve is to uninstall and then reinstall which then looses all of your saved data. I have replayed the start of the game twice now. Absoloute waste of money.",
            "review_score": "-1"
        },
        {
            "review_text": "It doesn't have a full screen mode, i can't even play the first two minutes, because it always crashes and the game close itself. Yep, i think i want my money back, Telltales.",
            "review_score": "-1"
        },
        {
            "review_text": "The game is pretty neat so far, I have finished up to episode 4 with no real significant lag or performance issues after I tweaked the settings a bit. As a HUGE Batman fan I have to say i'm impressed.  After finishing episode 5, I was blown away at the ending and emotional pull between the characters shown throughout the whole thing. Another great installment to the Batman video game franchise. Highly recommend during a sale.",
            "review_score": "1"
        },
        {
            "review_text": "Ran into a few glitches (final choice from episode 1 was not correct in episode 2) and occasinal crashing.  Overall though it was another entertaining interactive story from Telltale. Recommend for anyone even slightly interested in Batman.",
            "review_score": "1"
        },
        {
            "review_text": "What a pleasant surprise this game turned out to be. When I saw Telltale was taking on a Batman game I didn't assume they would break with the Batman cannon or make Bruce Wayne into a fleshed out character. He has always been a sideshow to the main event of Batman but in the game I found the choices that Bruce had to make far more interesting. Overall, I'm really happy I played this and am excited for whenever Season 2 is released. Another win for Telltale. Congrats!",
            "review_score": "1"
        },
        {
            "review_text": "  What Is This Game?",
            "review_score": "1"
        },
        {
            "review_text": "Best Batman game, EVER. And one of the best Batman stories I have seen. Though some people are complaining about the graphics, the game ran perfectly in my machine from beginning to end and graphics are stunning. Either Telltale fixed the graphics issues or these issues are computer-related.",
            "review_score": "1"
        },
        {
            "review_text": "(Many early reviewers seem to have had many technical issues, i had two crashes to desktop throughout playing all episodes but besides that it ran silky smooth for me throughout, so my review focusses on the gameplay and storyline, not technical aspects which were fine for me)  Overall this is a very solid season,  and definitively worth playing,  already for the first two episodes alone.   That is also my main issue with it though: The first two episodes are great, among Telltale's best stuff so far, and some of the best twists in the Batman storyline (in the first few episodes), too.  Sadly then i liked the later episodes less and less, it recovered some again with the latest one but never again reached the greatness of the first two, both in storyline and gameplay.  I still enjoyed it enough to play through it all within a day, so yes, it's still very solid in the later episodes, too, just a bit sad it doesn't reach the greatness of the first two episodes anymore.  Pros: In the first two episodes: -makes you feel like badass Batman -makes you feel like actually putting the pieces together in the investigations and doing the master plan for chaining together attacks and the actions during fights feel less like quicktime events in many cases -it feels like the best origin story so far for Batman -there's great dialogue  Cons: -Sadly in the later episodes it feels a lot less badass and more like standard quick time events and the investigations are less cool and more repetitive, too and i liked where the whole story and most of the characters went less and less as the season went on.  ____________ Spoilers below ____________    _____________ almost final spoiler warning _____________    ______________________ seriously, you have been warned, best only read onwards after playing it. ______________________     ______________________ ok, let's do this =) ______________________  Gameplaywise, what i liked less in the later episodes of the season were that the actions felt more like typical QTE stuff (instead of forming a cool attack plan like at Falcone's hangout early on in the season) and the investigations felt more like connecting lines to come up with a simpleton obvious solution for the sake of it rather than piecing together a non obvious but interesting puzzle (as was the case way more in the first two episodes).   Storywise: -So what's a great change to Bruce's origin storyline (compared to the most commonly used ones) is that Bruce's Dad was involved in lots of shady business with Falcone and other bad guys and had many enemies and normal people who didn't go with what he wanted put away to Arkham Asylum and more nasy things done to them there. That lead to the Penguin becoming who he is now, too. (And btw, very cool Penguin mask in this one, even if i like the penguin's characterisation and back story in the Gotham tv series way more overall, the mask here is great) So then Bruce uncovering the truth about his parents and the fallout it causes puts a very good twist into the storyline in the first few episodes.  Sadly, i feel then they overdid it, massively. In the later episodes of the season too many bad guys were introduced in short timespan, giving them too few weight and worse, this plot twist was then applied to most of them, which took away all the interest in it for me, it sorta felt 'me too' for each guy instead of with weight and importance it had in the first two episodes. Oh, yeah, Harvey Dent turned (fully) Two face because of Bruce, too,  and Viki Vale sorta became evil because of Bruce's parents, too and well, it felt lame at that point. Viki Vale in general in this version of the story overall felt like a lame character to me and it was neither cool nor interesting to fight her. I felt annoyed they tried to mix in like 3 back story/reasoning storylines for her, it would have been much better if they focussed on one (what her foster parents did to her) and went with that and also didn't use a scare crow sorta mask and turning people crazy poison for her. (Actually it would have been best if she wasn't in the game at all) Not sure how much or not those parts are main Batman canon already, i feel like after watching so many different Batman related things i've witnessed many flashpoints/parallel universe storylines, but yeah, i've seen several other characters have similar dresses/masks/poison making people crazy type plans and so her whole character felt generic and was like the lamest implementation of those aspects. (For example Scarecrow in Batman in general or Jervis Tetch from the Gotham tv series was a way better version of a similar tactics using villain imho, in general most of the Gotham tv series' characterisations are way better than those of the bad guys in the later episodes of this game season). And how cool would it have been if they allowed to actually have a plot twist which really changed the outcome with one of the bad guys? Make two face not become two face or recover (besides his face) or have a more interesing outcome for the penguin (whose whole demise was pretty lame)  Joker came off as kinda lame, too, if we wouldn't know what the Joker is about by now, the way he acted in this season was mostly just offputting but besides that like the most (weirdly) calm guy among the crazies. Of course likely buildup just to introduce him now and make him one of the lead villains in the next season, but yeah, interacting with him didn't have much excitement to it besides already knowing what he represents in the overall Batman arc. Overall it is weird to me that the whole characterisation of Falcone and solving his 'case' was best in gameplay and storytelling, had the most interesting unexpected and well done story results and the best investigation and action moments.  I also felt like it was boring and lame Catwoman/Selina Kyle went away the way she did, i would have loved it if they put a twist in that storyline and were bold to progress it further to the point where we could have catwoman and batman as couple and fighting baddies together for a whole season.  Instead it was that typical Selina Kyle falling back to the don't care about anything much at all routine, lame and boring, also reduced any weight to any relationship buildup there. So overall for the storyline i feel like they trashed the great potential of their main twist to Bruce's family origin story some later on and some of the later plot twists and characters were boring and in other aspects they weren't bold enough to push the story further and to cool new places and instead rejiggied common Batman (villain) character tropes. And the your decissions have gameplay consequences aspect of course always can only go so far, but i would have far preferred it if they left out the whole Viki Vale part and made everything else better and more refined in the later episodes of the season and let all your decisions have actual more weight in the overall outcome. I would far prefer to play through a chunk again with different choices if i'd a) know there are bigger outcome implications and b) they would make it then easier to just play onwards from a certain decision moment.  Anyway, enough rambling for now, in summary, i was a bit let down by the later episodes of the season, but the first two are great if not excellent in several aspects in my book, so just due to that, i look forward to the next season quite a bit =)",
            "review_score": "1"
        },
        {
            "review_text": "A shame it took until Episode 5 to patch it to let the game run smoothly, but overall a good story. I had my fun. The quick time events are a joke, way to easy and even if you hit the wrong button you have muuuuuch time to correct it. The Boss fight is nice. Would buy it again.",
            "review_score": "1"
        },
        {
            "review_text": "I have a brand new desktop with an Nvidia 1070. I have no problems running pretty much any game in Ultra settings, yet this game won't run well no matter what I try. I would love to play this game as I love TT and Batman, but I cannot recommend this experience. I am really annoyed.",
            "review_score": "-1"
        },
        {
            "review_text": "Great start and story from the beginning. Can't wait to play the second episode already!!",
            "review_score": "1"
        },
        {
            "review_text": "I use Window 10 with Intel Core i7 2.50 GHz, 8 GB Ram and can barely run the game with 800x600 Resolution, disabled Anti-Aliasing. Get it together Telltales, please don't make me lose my faith now. This is just embarassing. ",
            "review_score": "-1"
        },
        {
            "review_text": "Purchased and played this game after seeing the reviews, both good and bad. A majority of reviews are complaining about bugs and I didn't come across anything major and almost nothing minor. Story and gameplay wise, the game is great. The only con is you don't have full control over combat, but thats what telltale's format is. IF YOU WOULD LIKE TO PURCHASE THIS GAME, I HEED YOU ONE WARNING: HAVE HIGH SPECS TO PLAY THIS GAME, AND DO NOT RUN IT ON WINDOWS 7. LOW SPECS WILL LOWER PERFORMANCE AS THIS GAME ISN'T WELL OPTIMIZED AS OF 8/2/16. Otherwise it's a good game, Bugs noticed: Can't exit Codex, Controller support is messed up.  My Specs: CPU: i5-4690 GPU: Gigabyte Geforce GTX 1070 8GB OS:Windows 10  The rest of my stuff isn't really gaming worthy so I'd hope you'd have a motherboard for gaming or something better than a cheap bestbuy one. I do not overclock. I hope this helped :)",
            "review_score": "1"
        },
        {
            "review_text": "There is constant lag and its pooly optimzized.  With that said, HOLY CRAP this is now one of my favorite Batman stories ever! I'd say this is one of the best stories Telltale has made ever since Walking Dead. The story is so good and if you can overlook the performance issues, this game is absolutely great!",
            "review_score": "1"
        },
        {
            "review_text": "the fps drops makes it unplayable  liked the first two episodes though",
            "review_score": "-1"
        },
        {
            "review_text": "I started playing Batman with great anticipation after having loved 'The Wolf Among Us'. And it started out okay. Ep 1-3 was quite good, if not to the same level of The Wolf Among Us. However, the last episodes drastically dropped in quality, and there was very little in terms of any feeling of achivement or satisfaction. There was no epic crescendo at the end, where you got to feel badass as Batman. Instead you're almost beaten to a pulp by a crazy girl in a home-sewn suit. That did not feel very Batman, nor played on the whole 'Dark Knight'-fantasy.  TL;DR Good start, poor finish, leaving behind a feeling of incompleteness.",
            "review_score": "-1"
        },
        {
            "review_text": "Wait for performance update",
            "review_score": "-1"
        },
        {
            "review_text": "Could spent the night with Catwoman... 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Sadly, what the people say is true. The performance, as far as I could gather from the opening sequence, is absolutely dreadful. FPS tanks and makes for a crappy experience from what looks like a pretty decent game. Wait for patches",
            "review_score": "-1"
        },
        {
            "review_text": "I would give this game a thumbs up for sure, it was a lot of fun if a bit short and i can't wait for season 2 with the joker. But episodes 4 and 5 sucked and very buggy i just can't as a whole give it a thumbs up.  ep 1 Great episode 5 out 5 ep 2 Good episode 4 out 5 ep 3 Great episdoe 5 out 5 ep 4 ok episdoe 3 out 5 ep 5 not good 2 out 5  The first few episodes were very good and setup some cool stuff but i didnt like how it turned out. Episode 4 would have been crap without joker in it as a saving grace. Episode 5 was short and lame the investigation parts sucked no reason for them just a dumb time filler took 2seconds to know what happend. Also the final boss was not fun or a bad guy i would ever care to see again. Season 1 feels like a pilot episode on tv it could turn great but due to the suck factor of episodes 4 and 5 i don't know. But with huge pauses and lag with the episodes mostly ep 3, 4, and 5 and the fact that each episode got shorter and shorter to ep 5 lasting less then an hour i won't be buying from telltale for a long time",
            "review_score": "-1"
        },
        {
            "review_text": "I was looking forward to this game and it is terrible. FPS terrible, mouse lag and crash in the beginning of the game.  FIX THIS NOW",
            "review_score": "-1"
        },
        {
            "review_text": "I got the first episode free on the Windows store yesterday. I am on Windows 10 and play with a plugged in Xbox One Controller. I enjoyed the first episode so much I purchased the game on steam that has all the episodes. First, the game ran great on the version from the Windows store. The Steam game I actually paid for had some issues. I play at 1440p and the Steam game graphics looked terrible and I could not read the text well. A little searching and I found a solution for my graphics issue. Go in Steam apps, common, batman the Telltale Series and right click on Batman_win7 and select Properties. Click on Compatability tab. Click the box to 'Run this program in compatabilty mode' and select Windows 8. Also in the same tab click the box 'Disable display scaling on high DPS settings'. I did the same for the Batman_win8 file just below the Batman_win7 file. That fixed the graphics for me to glorious and crisp 1440p. Next, the controller wouldn't work unless I had the controller plugged in when I launched the game. The controller Right Trigger also didnt work in a particular quicktime event in Episode 2 (in the bar). I got past it by simultaneously clicking on my keyboard the Right and Left Arrow keys instead of Right Trigger and A on my non-working controller. Having noticed this, I downloaded the Xbox Accessories App from the Windows store which updated the firmware on my controller. That seemed to fix the Right Trigger issue. The game is really fun and pretty relaxing. It is too bad there are a few issues which take some research to solve. Hopefully this post will help others with the same issues that I had. I still recommend it if you like Telltale games or Batman. It's basically like watching a decent Batman Movie in the style of the Walking Dead. The writing was decent.",
            "review_score": "1"
        },
        {
            "review_text": "DO NO BUY THIS GAME. This game is absolute trash. No matter what graphic setting you run on, it has an unplayable frame rate. There is both a horrible lag on the mouse and key strokes. It makes the game unplayable. Half the key strokes dont register and no matter what you do you fail the quick time events, making it impossible to get past the first few minutes of the game. I don't know how this game was released, its almost like they didn't even test it.  I've never regreted buying a game on steam more than this game.",
            "review_score": "-1"
        },
        {
            "review_text": "This game ran great on my enthusiast rig. I enjoyed EP1, can't wait for the rest of the season.  I'm giving this game a recommendation, but they're some reports that people are having troubles with the game, so do some more research before buying.  Update: All 3 ep so far have been great.",
            "review_score": "1"
        },
        {
            "review_text": "A lot of people say that this is buggy, laggy, and runs like crap. Well I guess it is a coin flip for if it runs well or not because for me it runs perfectly alright.",
            "review_score": "1"
        },
        {
            "review_text": "My experience with this game so far (in episodes):    -EPISODE 1:  Framerate at 20 (mostly lower) which made fighting sequences awful. Really bad start for a game like this :(   -EPISODE 2:  Constant 60 fps, except for the controller triggers that didn't work in battle sequences.   -EPISODE 3:  After figuring out that you need to change the graphic card settings, the game ran by 60 fps with a few framedrops. The only other negative thing is that the triggers on a xBox controler still don't work, which is a bit dissapointing.   -EPISODE 4:  Everything works fine now. Stable frame rate and everything. HYPE for episode 5!  The story of this game is great, as in pretty much every telltale adventure and it's definetly worth playing. Altough the triggers on my XBox one controller still dont work, there aren't any other bugs I run over. If you're a fan of Batman or wan't a great Story, play it.",
            "review_score": "1"
        },
        {
            "review_text": "After changing the PC's settings to the dedicated graphics, the MENU was ok. But the scenes are still laggy, and I can hear the sounds even before the scene happens... I've NEVER had such issues in any of my games that I've previously played, those include Telltale's. No, it is not possible to recommend it, yet.",
            "review_score": "-1"
        },
        {
            "review_text": "I see all the negative reviews are from bugs and lag, i played the first episode with no problems, and was the best telltale game i have played since TWD s1, still only the first episode so cant say its my favourite to soon",
            "review_score": "1"
        },
        {
            "review_text": "I ran this game with no difficulty. Windows 10 NVIDIA GTX 980M using a cheap ol walmart gamepad.  First game of the Telltale Series that I've personally played, but I've watched others. I like it so far. I feel like the choices I made for batman were almost uncharacteristic at points... I found myself picking things just to hear him say certain phrases or carry out an action. That's part of the fun I guess ^.^  I'm game for more episodes.",
            "review_score": "1"
        },
        {
            "review_text": "Honestly the plot of this game is better than almost any Batman based movie out there. Although it's a decision based game you feel like if you're in it and not just as if you're clicking paths. Very good overall. Amazing representation of The Batman.",
            "review_score": "1"
        },
        {
            "review_text": "I have no problem with this game at all i don't know what people are talking about ",
            "review_score": "1"
        },
        {
            "review_text": "First off, this game is not buggy for me. I was able to change to my max resolution and played through the game at high fps. I'm not sure if this matters but did everyone make sure to chose the correct version of windows when launching the game? If so then idk what the problem is though as im typing this steam just started downloading an update for the game so maybe its a fix?   Anyways, bugs aside, this game was really fun. It might not give me the same feeling I got from playing TWD or TWAU but thats probably because I'm already familiar to batmans story and it wasn't entirely fresh to me. I was skeptical when starting the game because i wasn't sure if I'd like the batmans voice but they did a pretty good job. While there are quite a bit of quick-time events, they were nice and fluid and fit perfectly. They also added a new game mechanic to this telltale story. You can link evidence to try and put together a crime scene and understand what happened. I am not sure how restrictive this mechnic is as I've only done one playthrough so far but it may give you different outcomes based on how much you investigate.   As far as the story goes I am quite intrigued. While there are decent amount of scenes playing as batman, this episode mostly focuses on bruce wayne's problems. Not that this is a bad thing as you'll learn when you play it. I'm not sure if this is following a comic or if its an original tale but I'm enjoying it so far. Once again they leave they episode off on a cliff hanger and now I have to wait a few months to continue. Though from what I've learned after binge watching netflix shows on release date, this is probably a good thing for me.",
            "review_score": "1"
        },
        {
            "review_text": "No played a huge amount yet, but its is shaping up to be a great game.   No problems what so ever with regards to performance.   Stable at 60fps with a i5 2500k, GTX 970",
            "review_score": "1"
        },
        {
            "review_text": "This game was highly anticipated since it's announcment and it dosn't dissapoint. Telltale games are on form agian with another great game. Highly recommended for any Batman or Telltale fan.",
            "review_score": "1"
        },
        {
            "review_text": "Very impressed with Episode 1. Telltale has done good by Batman so far. I'm very excited to see what they do with Batman and Bruce as characters.",
            "review_score": "1"
        },
        {
            "review_text": "I liked it. albeit the graphics resolution needs to be touched up, it was a pretty good experience. It sets the ground work for the story over all and I can't wait to play the next episodes.",
            "review_score": "1"
        },
        {
            "review_text": "Great detective story and cool characters. That cobblepot....",
            "review_score": "1"
        },
        {
            "review_text": "Loved it!! Ran fine for me (GTX 970) So nice to see a fresh take on the Batman story. Lots of engaging gameplay that makes you feel like the hero and the man behind the mask. 10/10 would replay many times :)",
            "review_score": "1"
        },
        {
            "review_text": "AWESOME GAME. Seriously. I can't wait for the second episode. The gameplay was awesome. Great fighting sequences. The story, awesome. I get to feel like Batman taking decisions.  Just what I was expecting.",
            "review_score": "1"
        },
        {
            "review_text": "Another great Telltale series, love the first episode and can't wait for the rest ^_^",
            "review_score": "1"
        },
        {
            "review_text": "Really enjoying this. Not all of the Bruce Wayne stuff hits the mark but it has a good try. The Selina Kyle bit bubbles beautifully. The Batman Parts are great. As for bugs I have not hit any yet.",
            "review_score": "1"
        },
        {
            "review_text": "Framerate wasn't optimal (my rig is also over 4 years old), but definitely playable and not game-breaking. Never encountered any audio issues or game-breaking bugs. Did have one glitch where I was stuck at the Codex screen, but closing and reopening the game fixed it.  Aside from these issues that I'm sure come with the game being on a brand new engine, the game is fantastic and I highly recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Another fantastic narrative and campaign very addictive, a must for any DC fan must play ! A****",
            "review_score": "1"
        },
        {
            "review_text": "After seing the reviews i was worried this game would be unplayable, luckly i was one of the chosen ones that had no issues what so ever.   On the merit of the game; this genuinly feels like a Batman game, the choices and the gameplay fit well into the cowl of the dark knight. The one negative of the game is the combat, i reckon they have done over with the 'failing QTE' states as seing the Dank knight do the carpet shuffle would be immersion breaking, but the power move buildup seems a rather uninutative exchange, i have not seen enough combat to make a final decision however and it will be exciting to see the next chapters.   I definetly reccomend waiting until this game is patched so you don't happen to have any of the fatal bugs reported and until a 2nd chapter is realeased (Like many other teltale games).  Side-note: Crowd-play feature will probably be overlooked by many, but it's actually quite decent feature for a group of freinds in couch-play scenarios.  7/10 ",
            "review_score": "1"
        },
        {
            "review_text": "Great game, no bug no lag issue for me ran it max 60fps all the way",
            "review_score": "1"
        },
        {
            "review_text": "This gmae sure knows how to tell a Batman story really well. I would recommend this if you really like the comics and if you are really into sotry driven games. And also, he's the Batman.",
            "review_score": "1"
        },
        {
            "review_text": "Honestly the plot of this game is better than almost any Batman based movie out there. Although it's a decision based game you feel like if you're in it and not just as if you're clicking paths. Very good overall. Amazing representation of The Batman.",
            "review_score": "1"
        },
        {
            "review_text": "It was a bit of a dodgy launch apparantly, but as a computer technician and software developer over the past 20 years I tend to take more care of my rig than the average PC Gamer so I didn't suffer from any latency issues, frame issues or voice sync problems that being said that doesn't mean there wasn't an issue, if a Telltales game gets mixed reviews (now mostly positive) on Steam them something obviously went wrong.  However never fear Telltale have dropped a number of patches which have fixed some of the bugs and crashes that have occured. The only game breaking bug I had was viewing the codex on the computer and it wouldn't let you exit out of it, forcing you to exit the game in which I lost all my progress.  So onto the game itself, well it's pretty much what you'd expect, it's a half decent story so far, it's fun and engaging and at least matches the cheap price tag. Episodes can be annoying sure but Telltale have some this for a while so it should be expected before even thinking of purchasing it.",
            "review_score": "1"
        },
        {
            "review_text": "I bought it after the wave of its techincall problem release. It functioned fine and it was a good little experience. It's a little bit more removed from it's Walkind Dead predecesors. But It isn't bad. In the least,",
            "review_score": "1"
        },
        {
            "review_text": "Best combination of QTE and combat, even better than some Action games. The plot is thrilling too! Can't wait for next episode.  Just one problem, could you cancel the chinese translation? Even google translate could do better...",
            "review_score": "1"
        },
        {
            "review_text": "Not the best intro &amp; presentation out there if i were to compare it from Arkham series.  It has some bugs but nothing that would break the game really even though I thought I reached a game-breaking point one time then only to find that the detective mechanics weren't that intuitive unlike the Arkham series.   It seems that once you play a telltale game you get the feeling that as if you played them all when it comes to gameplay's perspective so I guess it goes down to pick your own telltale story and enjoy the *cough* *show* *cough* I mean game!!  Some people in the internet complains that the lips aren't synced with the character's mouth but does it really matters that much? Hello  Life is strange ? Not one bit that this thing concerned me because what matters the most is how much I got out from this game rather than being too critical to bother such simple &amp; non-game breaking technical issues. And most of the time they're synced compared to Life is Strange.  I know that this game or review will not please everyone but at least I'm honest &amp; getting my voice out there.   So, if you're really a fan of the telltale games or Batman series you're just in the right place and the end of the episode is interesting enough for me to want to know what will happen next.   So I finally finished the whole thing tonight and I say that this is one of telltale's weak games... It would probably best to get this on sale so that you won't feel robbed from the experience.   if you expect something better than Wolf Amoung Us or Walking Dead then it's not, given that i'm a fan of Batman since childhood I really can't recommend this game on a higher level and it can be a forgettable experience in a short period of time.   This game only appeals to the fans of Batman or for the first timers in Telltale games.",
            "review_score": "-1"
        },
        {
            "review_text": "This game runs slow on my computure. As i see it many people also complain about how slow it runs, even people with good processors complain on how this game runs in 10 fps. Also hitting combos are impossible with the fps, im stuck on a part of the story due to this. I dont know if its me but i can maximize the window so i have a minimized window which is very annoying to play with. Whoever can actually play this game in 60 fps and can actually hit them combos, are the luckiest people on earth.",
            "review_score": "-1"
        },
        {
            "review_text": "A very differnt Batman game that I have played in recent years, but I have to say it is really fun. I highly recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "BatCat I ship Dat 10/10",
            "review_score": "1"
        },
        {
            "review_text": "My opinion might change later down the future episodes but the first one seems so far promising. Investigating the crime scene was rather well done and definitely brings the detective into Batman.",
            "review_score": "1"
        },
        {
            "review_text": "I bought it after the wave of its techincall problem release. It functioned fine and it was a good little experience. It's a little bit more removed from it's Walkind Dead predecesors. But It isn't bad. In the least,",
            "review_score": "1"
        },
        {
            "review_text": "Looks like a great story and game. But I'll be taking my money back.   I waited a few months to see if they would fix the plagued issues people were complaining about. I gues snot... Unfotunately, this game seems to be half ♥♥♥♥♥ in the performance department. I'm getting a whopping average fps of 21. I don't know much about how demanding this game is, but an Nvidia GTX 1080 should be able to run this game over 60+ on 1440p. Maybe even 100. How do I get up to 90FPS on GTA V but I can't even get 60 on this game. Is this game that demanding? LMAO  This is the PC version, but it seems like I'm playing on a console version running at such horrid framerates. The game can't even keep up with my mouse.",
            "review_score": "-1"
        },
        {
            "review_text": "My opinion might change later down the future episodes but the first one seems so far promising. Investigating the crime scene was rather well done and definitely brings the detective into Batman.",
            "review_score": "1"
        },
        {
            "review_text": "Great story, as a big fan of batman i do love the game however it seems that pc players take a back seat in release dates and optimization, i recommend that if at all possible just buy it on a console that way you dont have to worry about getting the game late",
            "review_score": "-1"
        },
        {
            "review_text": "Despite a shaky start with some technical difficulties, the game proved to be WELL worth the effort! An amazing and stellar start of a new series; as always, Telltale never fails to deliver. The updated engine looks great so far, the QTEs are quite challenging yet they're merciful if you flub up, the voice-acting is top-knotch, and the music is well-composed. Even someone who doesn't know a lot about Batman is finding this to be one hell of a start, and I do look forward to the rest!",
            "review_score": "1"
        },
        {
            "review_text": "I had no bugs what so ever on my MSI Nvidia 970 with Windows 10. I completed the first release of the game and enjoyed it. I liked the story and the art work. I liked my choices and enjoyed playing as Batman.",
            "review_score": "1"
        },
        {
            "review_text": "I always watched Telltale games on youtube, like a tv show, but when I heard the developer was making a Batman game, I had to get it.  Batman: The Telltale Series gives you control of Bruce Wayne and of course Batman. Something that hasn't really been done before in any Batman game.   The story is top notch and unique. A web of lies (or maybe truths) is affecting both Bruce Wayne and his alter ego. The supporting characters are believable, and all have a clear motive for their actions.  The soundtrack is amazing. In previous Batman games, the sounds is always grim and serious with low tones. In this one the music is hopeful and tense.   The gameplay like every Telltale game is minimal, but when you play a TT game, you aren't here for the gameplay. You are here for the experience. ",
            "review_score": "1"
        },
        {
            "review_text": "This game had me so enthralled in making Batman/Bruce Wayne be the good guy, that when I accidently chose something that made Bruce Wayne sound like an edgy shmuck, I reloaded 30 min worth of my save in order to choose a better option, only to have it produce the SAME EXACT RESULT!!!!",
            "review_score": "1"
        },
        {
            "review_text": "I don't know what's going to happen with this thing after the first scene, but I'm ready to review. Even though it feels like we're going into things which have been done before, I love it. For the most part, I enjoy Telltale, and I love Batman, so it seems like a good combination. First off, I have to complain about the only complaint I have: graphics. I'm miffed that I can play a game like Arkham Asylum on a 5-year-old laptop on lowest graphics with less lag than a Telltale story-based adventure game on a newer laptop... I hear everyone's having some kind of graphics issue, so I'm going to look into it. As it stands, the opening fight with Catwoman was incredible, even though I don't know if the fight went the way it was supposed to because the lag didn't always show me whether my choices hit... I'm getting tired of every new game feeling like it has to compete graphically with every other game out there, regardless of genre. If the graphics to this game were as simple as even the older Sam and Max games, I'd be happy. Now, I want to see whether my choices really affect much. I believe (unlike in The Walking Dead) I won't care too much if my choices don't have a big impact. It's a Batman story, and I want to see it played out. Life is Strange ruined me with its twisting of making my choices matter while at the same time making them completely irrelevant. ^_^ Based on the opening of this game alone, I recommend this game. If this is our 'gritty' Batman of modern times (and it's looking like this will be somewhat based on the latest installment of our movie Batman), I look forward to seeing all of my favorite characters and watching them develop. It looks like we'll have a nice mix of action in combat, pulling us into the Arkham vibe, drama in dialogue, and hopefully some detective work between the scenes. We deserve to see the 'world's greatest detective' go back to figuring stuff out.",
            "review_score": "1"
        },
        {
            "review_text": "This game seems to have caused issues for many players but fortunately for me I've only encountered some small stuttering but otherwise I've been running at a stable 60 fps at 1080p on a r9 390 and i5-4690.  The experience so far for me has been very enjoyable with the games story being engaging and having another perspective as Bruce Wayne has definitely added to the experience. The quick time events have also been very good.",
            "review_score": "1"
        },
        {
            "review_text": "Best Telltale game so far. Completely original, fresh Batman story. I'm hooked. Game ran completely fine.",
            "review_score": "1"
        },
        {
            "review_text": "I have no complaints about any Telltale series games. They are absolutely amazing!! ... and this one being BATMAN!!! What can I say? na na na na na na na na na na na na na na na na BATMAAAN!! Sooooo good!!!!! Must have for any Batman fan! ",
            "review_score": "1"
        },
        {
            "review_text": "Don't get fooled by the negative reviews. I was waiting for this game and it is awesome. I saw a lot of people saying that they get 10 FPS max or its buggy as hell, stuff like that. The game had stable fps it never droped. Story is very good. I don't know why so many people say its unplayable or laggy. I didn't had an issue at all. I really recommend this game.  Im also super excited about Episode 2. Waiting for it ~",
            "review_score": "1"
        },
        {
            "review_text": "Wow. Just wow.  As a comic book fan and a Batman fan, I've played a lot of comic book games in my time. Marvel Ultimate Alliance had a great amount of lore behind it and followed stories well. X-Men legends stuck to storylines within the comics and fleshed out the characters well.  Nothing compares to what I have played so far in Telltale Batman. From the very start, the opening scene sets out what angle they are going for, it feels like they are using Batman - Year One as their starting point. The villains so far have been introduced thick and fast. Playing as Batman and getting to fight them in Telltale-esque quick time events feels epic and smooth, not forced and awkward. Using one touch button commands to use gadgets gets me hyped, press B now to use a grapple hook, press up to lift a henchman up and scare everyone. They captured being Batman really well.  Then there is the typical 'choose your answer' telltale dialogue options as Bruce Wayne. YES! ALL THE YES! I get to be Batman by night and millionaire playboy Bruce Wayne by day. Whats more the options are great, you can be the ♥♥♥♥ that Bruce needs to be to hide his Batman persona, you can play a little dirty unlike how he acts in the comics or you can be a bit bad ♥♥♥. I've so far tried to stick to the flash cars, lots of women and a bit wimpy Bruce Wayne that hides my Batman persona, but you can take it whatever direction you want!  The cast of characters so far is bloody excellent! No spoilers here but there are a host of characters from minor to major.  Also, for those not intensely into Batman, they have done an excellent job of introducing villains, some they have even set the groundwork for a future villain reveal.  Overall, 10/10 from me and absolutely can not wait for the next episode. Only slight criticsm was the slight lack of optimisation on day one which stopped the game working for some people, however a very quick patch sorted that right out so kudos to Telltale for being on the ball with it.",
            "review_score": "1"
        },
        {
            "review_text": "It's better than Suicide Squad.",
            "review_score": "1"
        },
        {
            "review_text": "Cloud save dont work, I lost 2 hours of gameplay",
            "review_score": "-1"
        },
        {
            "review_text": "I am one of the lucky ones that didn't get a broken game, I suppose. Besides for having to (ALT+ENTER) for fullscreen, I had zero problems.   -It's par for the course as far as Telltale game mechanics are concerned.  -Interesting story  -Bruce has a bit of an Archer thing going on, which I find pretty amusing.  My favorite Telltale title so far. ",
            "review_score": "1"
        },
        {
            "review_text": "Dear Telltale,  You have been making games for long enough now. You KNOW this is broken. 20 mins in and I get stuck in the codex. I'll tell you in detail how to replicate the bug.  Step one. Play the game  You have screwed us over just like EA. Filthy.  ",
            "review_score": "-1"
        },
        {
            "review_text": "I am one of the lucky ones that didn't get a broken game, I suppose. Besides for having to (ALT+ENTER) for fullscreen, I had zero problems.   -It's par for the course as far as Telltale game mechanics are concerned.  -Interesting story  -Bruce has a bit of an Archer thing going on, which I find pretty amusing.  My favorite Telltale title so far. ",
            "review_score": "1"
        },
        {
            "review_text": "Blank white screen EVERY SINGLE TIME I start up, what the hell is this? I paid 25 dollars for basically an interactive story and even then it's not RUNNING? What do I do with this game? I can't even use it as a paper weight! You know I had high hopes for this series, but seeing how god awful the optimization is, this is basically and GOD DAMN RIPOFF. Telltales basically sold an UNFINISHED PRODUCT. Either this gets fixed, or I am going to pursue a refund because this is basically unplayable. UNTIL ALL THE GAME-BREAKING ISSUES ARE FIXED, THIS RATING IS STAYING AT NEGATIVE. For reference, I am running this on my 2016 laptop, with an i7-6500C and NVIDIA GeForce 940M, while this is not up to all AAA gaming specs, it most certainly can run this game, but the damn thing is so POORLY OPTIMIZED that there's no way I could play it.",
            "review_score": "-1"
        },
        {
            "review_text": "I reccommend this game to any batman fan or anyone who is a fan of Telltale games.  The Batman parts are awesome great qte sections and it explores the Worlds Greatest Dectective aspect of Batman. The Bruce Wayne parts although less action packed obviuosly, are so interesting and intriguing that you just want to keep on progressing to see where the story is going.  I give episode 1 a 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "I'm really enjoying the game.. Batman... Telltale... What more could you want?... Oh yeah right ♥♥♥♥ing trigger",
            "review_score": "-1"
        },
        {
            "review_text": "Cant get the game to run. An error poped up, DirectX error - 'The parameter is incorrect' Could somebody help me out here?  Update - (21/9/16)  Finally got the game running and played episode 1.  I'm trying to play episode 2 but the game crashed every single effin' time. When the game starts with ' previously on Batman...' right when Vicky Vale starts to talk!!!! So I can't play... wtf!!!!  Is it because im on Window 7? I heard this game runs like ♥♥♥♥ on Windows 7... If it is the case, the requirements should have stated. Damn this game!",
            "review_score": "-1"
        },
        {
            "review_text": "If you are hoping for a game that truly simulates what it is like to stare at a black screen with the promised controller support not working, then this is the game for you! Otherwise, be thankful STeam offeres refunds.",
            "review_score": "-1"
        },
        {
            "review_text": "Aside from the black screen bug that I fixed by going in the discussions, this game was fantastic so far. Telltale has brought many new components to it's engine that add flavor such as piloting a drone. I really enjoyed it and look forward to episodes 2, 3, 4, and 5!",
            "review_score": "1"
        },
        {
            "review_text": "My entire life i wanted to be Batman. This game gave me the opportunity.",
            "review_score": "1"
        },
        {
            "review_text": "Wow, not sure what people are having such a problem with... I had zero bugs and made it through the game with no problems at all.  The game is great! Voice acting is great, dialogue choices feel meaningful and had me panicking a few times. Love the direction they are taking with the story and some new looks at old characters.  Not all great though. Animations are less than smooth and it's pretty short for a first episdoe. I suppose you could replay multiple times but that means deleting your previous choices. If you don't like the second run, you'll need to start over again just to start episode 2 where you want.  Overall, I enjoyed this and can't wait for more!",
            "review_score": "1"
        },
        {
            "review_text": "Wow, not sure what people are having such a problem with... I had zero bugs and made it through the game with no problems at all.  The game is great! Voice acting is great, dialogue choices feel meaningful and had me panicking a few times. Love the direction they are taking with the story and some new looks at old characters.  Not all great though. Animations are less than smooth and it's pretty short for a first episdoe. I suppose you could replay multiple times but that means deleting your previous choices. If you don't like the second run, you'll need to start over again just to start episode 2 where you want.  Overall, I enjoyed this and can't wait for more!",
            "review_score": "1"
        },
        {
            "review_text": "cant play the game, its laggy and crashes, and my PS4 controller doesnt activate when i plug it in.  I want a refund.",
            "review_score": "-1"
        },
        {
            "review_text": "Cloud Save does not work and I therefore lost 5 hours of progress. Would not recommend any Telltale game untill they finally fix their poor engine. How is it that such a basic but important function such as saving your game has bugs? SHAME, SHAME, SHAME",
            "review_score": "-1"
        },
        {
            "review_text": "I can play games like The Witcher 3 and The Division at 1080p60.  This? 15fps. At 1440x900.  The story is fine, but even the QTEs were hard to get through with these performance issues.  Wait for them to (hopefully) fix the problems before picking this up.",
            "review_score": "-1"
        },
        {
            "review_text": "I ran into one problem while I played but after that it was fine, and I figured out it was because I didn't update my drivers after I upgraded to Windows 10 so it was my fault. The game is good and is very interesting so far and I can't wait till the next episode comes out to see what happens. 8/10 definitely recommend to any fans of tell-tale/choice games.",
            "review_score": "1"
        },
        {
            "review_text": "Last night, Rotten Tomatoes gave a bad mark to Suicide Squad, and what you guys did is really awful as that, are you spys from Marvel?????? ——A fan from China sorry for grammar mistakes if there are.",
            "review_score": "-1"
        },
        {
            "review_text": "I'M BATMAN!   What more do you need?",
            "review_score": "1"
        },
        {
            "review_text": "Na na na na na na LOVEIT.  Great story so far I look forward to the next episodes. Telltale never fails to illustrate. Worked perfectly fine on my computer.   If you love Batman like I do, then I suggest purchasing the game.",
            "review_score": "1"
        },
        {
            "review_text": "I started out as Batman trying to instill fear in others then I got recurring flashbacks and *BAM* I'm Bruce Wayne.  INstantly I had to start acting like a boyscout. I did not like that. I even shook Falcone's hand, out of sheer kindness. But Nooo. Apparently that means I am dealing with him.  DO NOT SHAKE FALCONE'S HAND!  I REPEAT   DO NOT SHAKE FALCONE'S HAND  ",
            "review_score": "1"
        },
        {
            "review_text": "Nice ♥♥♥♥ing game!! like always Telltale u did a great job",
            "review_score": "1"
        },
        {
            "review_text": "You can hit a man in the face with a steel pipe and then break his arm. You can also impale a guy. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I've seen a lot of reviews that are not very positive about this game, mostly complaints about performance. I bought this game about a day after release and haven't had ANY problems with it, graphics are unique, gameplay is awesome, fighting is smooth, voice acting is on point, story builds well... Honestly I'm a huge batman fan and if you ask me, there is literally nothing I can find to criticize about this game.   Highly Recommend Batman Telltale. :)",
            "review_score": "1"
        },
        {
            "review_text": "Run this on my ultrawide works fine in windows 7 mode fun batman story feels like your playing the comics can't wait for more 4/5",
            "review_score": "1"
        },
        {
            "review_text": "This game is truer to the Batman we know from DC and further from the one we know from WB.  Telltale did a good job setting the scene up for some interesting story-developments  BUT...  Episode 1 is incredibly short. Unless episodes come out on a weekly basis this is going to land in the 'maybe play again some time in the far far future'- bin.   That said, I don't feel like I wasted my money, will just have to wait for a few more episodes to release to have a day's worth of entertainment.",
            "review_score": "-1"
        },
        {
            "review_text": "Short part 1, only about an couple hours of content. Story goes on a new path for the Batman mythos, taking bits of the core story and going it's own way. Not sure how I feel about Cobblepot's arc (thought the friend would be Hush), Otherwise solid game.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent. 120-200fps. V-sync: Fast. GTX 1080. 32GB. i7-5820K(6 core). Windows 10 Pro.",
            "review_score": "1"
        },
        {
            "review_text": "A bit erect after playing. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "First episode was fantastic. My favorite opening to a Telltale game since Tales from the Borderlands, by far! Their art style really soars in this setting and the action QTEs are the most interesting they've ever been. Serves as a really rich early-career Batman story as well, and I grinned at some of the dialogue options I got. Really charming stuff and does a good job of making you feel like Bruce.  Technical issues some players are having, but thankfully I was free from them. I can't wait for episode 2!",
            "review_score": "1"
        },
        {
            "review_text": "After having problems that made the game unplayable for me, this game is incredible. The patch allowed me to play with almost no problems. I missed one or two quicktime events due to minor lag but these had no effect on my outcome. All in all I am very excited to see this game continue.",
            "review_score": "1"
        },
        {
            "review_text": "Best Batman game in years and better story than the last couple of movies. I really enjoyed it and crowdplay worked out okay with Steam broadcasting, although the delay is still a bit much for people. There was a little slowdown at the beginning as scenes transitioned between environments in a bunch of quick cuts, but besides that I didn't notice much of a performance drop off. Great takes on classic Batman characters, especially Catwoman, and I can't wait for more.",
            "review_score": "1"
        },
        {
            "review_text": "I haven't had any problems with the game , and the game itself was great .",
            "review_score": "1"
        },
        {
            "review_text": " An amazing story and interactive experience in a buggy game",
            "review_score": "1"
        },
        {
            "review_text": "Wow. I LOVE Telltale Games. I have played them all. LOVE IT  Its definitely a telltale game!  This has all the goodness of telltale and the action from the other batman games which were also great! It feels like the same Gotham City from the other games but it's telltale's Batman with a diferent story. I loved Episode one and I am confident the rest will be equally as awesome.  I hear others are having issues with the game but i was fortunate enough to get the full experience with my windows 10, AMD Fx, and aMD Radeon R9 380 setup. Read the game discription if you are having trouble:  ****If you are experiencing performance issues, you may need to update the graphics card drivers to the latest available. If you are using a laptop, please use your dedicated graphics and not intel integrated graphics.*****",
            "review_score": "1"
        },
        {
            "review_text": "First episode is a bit short (110 minutes), nothing too amazing, but nice. I like Telltale's version of Alfred, even if I'm used to Rocksteady's one. Still don't know if Troy Baker suits Bruce Wayne\\Batman, we'll see.  Telltale could probably do something about the animations, body movements look like they're made by a doll and facial expressions sometimes are hilariously bad.  Anyway, I'd recommend to play this game when all the episodes are out, the first one gives you a taste but you just want more.",
            "review_score": "1"
        },
        {
            "review_text": "Brillant game! definatly recomended (even at full price with only 1 episode it would be worth it)  Worked great for me but i do have a fairly good gaming pc  fantastic mechanics: -proper investigating of a crime scene which is done realy well through linking events - planning of attacks so that you have to fluidly link together a series of beatings for different thugs (kind of like a create your own cutscene/ quicktime simulator) is cooler than it sounds and i may have litterally shreked with joy when i realised what it was letting me do - new 'bar building' with the quick time events  Story:  - very interesting and tence - charactors are very well developed - differs from the dc universe (eg penguin and bruce childhood friends) - although it feels like a 'damned if you do, damned if you dont' situation, your decisions feel as though they have weight. so although they story/outcome doesnt change with choice - the perception of batman and question of morality does. However ive only played through it once so im not saying this with fact but more how the overall decisions &amp; outcomes felt.  DISCLOSER: amoungst my favourate things are batman and telltale games; so im most likely bias.",
            "review_score": "1"
        },
        {
            "review_text": "*EDIT!*  Ok so i've left the negative feedback on the launch day as game was horrible, FPS was horrible, along with crashing. now finally!! yes i had few fps drops in some areas, not very disturbing, but didn't go unnoticed. As for the story it is Amazing! characters are on point...voice actors (troy baker as batman, Richard McGonagle a.k.a Victor Sullivan as falcone) are amazing , makes every moment even more special.So ignore the negative feedback, the most of it was due to launch day issues. just grab the game you'll enjoy it. i am really waiting for ep 2 !!",
            "review_score": "1"
        },
        {
            "review_text": "Wow is finally playable, but one problem . cant fullscreen",
            "review_score": "1"
        },
        {
            "review_text": "Regardless of low frame rates and occasional out of sync dialogue, this is easily overlookable with coming patches and more content.  As a fan of Batman I have to say, this hits home for comic readers, fans of the animated series, and watchers of The Dark Knight trilogy. The storyline is similar to Year One and Bruce feels naive and just beginning his journey to discovering himself as the player should (If you want a Batman who knows what he's doing go play the Arkham games).   If you want to be 'The Batman' the 'canon' path is there for you, but you'll have to be quick in your moral choices, otherwise you'll be 'The Bat$%@&amp;' who likes to sandbag Harvey Dent at press conferences (Which has its own rewards).  If you need to wait for this to perform better on your computer that's fine, maybe go watch a let's play by your favorite YouTuber, but trust me, this is worth the wait and I can't wait to see more.",
            "review_score": "1"
        },
        {
            "review_text": "I'm really enjoying this game. It has good graphics and a interesting story as well. The game reminds me of the animated series; however there's no Kevin Conroy.",
            "review_score": "1"
        },
        {
            "review_text": "No preformance issues to speak of now. They patched it really fast props to telltale!   Otherwise a great game! Really love the twists they did on what seemed to be a normal batman story.",
            "review_score": "1"
        },
        {
            "review_text": "Episode 1 : Realm of Shadows is awesome. Highly recommended to anyone who remotely enjoys the Batman universe.  Aside from some initial issues I had with my Xbox One controller I can't comment on any of the performance issues that other users have experienced.",
            "review_score": "1"
        },
        {
            "review_text": "Are a few bugs, things like being stuck in the codex screen, but story wise, another Telltale success",
            "review_score": "1"
        },
        {
            "review_text": "Its a nice game but the episode is way too short",
            "review_score": "1"
        },
        {
            "review_text": "I guess I'm one of the lucky ones. Game ran fine for me. Steady quick framerate and not one crash. Played through the entire first episode in one sitting. Cant wait to see where the story goes, its off to an amazing start.",
            "review_score": "1"
        },
        {
            "review_text": "A new telling of Batman in his seemingly 'early' years. Harvey Dent's running for mayor, Gordon's a Lieutenant and most of the villains are new to a town under the control of the Falcone mob. Not just a batman action game, however as this is very much Bruce Wayne's story. And like other Telltale Adventure/Action hybrids, you will be spending just as much time considering your words in the dialog trees and their consequences as anything else. Batman himself is of course a fighting superhero, but he's also the 'world's greatest detective' and so the detective work takes advantage of the adventure game style.   Only playing episode 1 thus far but this looks to be the beginning of an interesting series and an enjoyable game. Sorry for all the folks who can't get it running but my AMD card seems to play it smoothly at 1080p but for the occasional stutter in the action. A few bugs at launch (I got 'stuck' at the Batcomputer) but that's to be expected. Would definitely recommend this and looking forward to seeing more of the story unfold over the coming months.  And you get another Troy Baker Batman voice...",
            "review_score": "1"
        },
        {
            "review_text": "I see other users saying they're having framerate issues but I didn't experience any but I do have a gtx 1070 so I wouldn't expect any issues. The gameplay and animation is ok but the story and voice acting is great.",
            "review_score": "1"
        },
        {
            "review_text": "i think it's one of the best game of telltale : - The action sequences are way better than in previous game - Even though it's prety simple, the new investigation system is a good idea - Writting is very good as always - I had no FPS/graphical problems whatsoever. To sum it up, it reminds me of The Wolf Among Us but with better action sequences :)",
            "review_score": "1"
        },
        {
            "review_text": "I have high hopes for this game, I still do. But fix the lag and I will enjoy the game. Wait for a fix before buying this   EDIT:  The lag issues have been resolved. I just finished episode 1 and it was amazing, the ending was a big surprise",
            "review_score": "1"
        },
        {
            "review_text": "  okay i wrote a first review on this and it was bad but now when i got the game working its actually freakin cool cant wait til episode 2",
            "review_score": "1"
        },
        {
            "review_text": "Review for episode 1. Worked fine for me, finished episode 1. As a batman fanboy i liked the episode. The new voice actor for batman wasn't bad so that was a suprise for me. Took 2 hours to finish which can be seen as short but hopefully the next episodes will be bit longer. Used crowd play which is a new feature to let other people vote aswell on the dialogue options. But only works well if you got your friends in same room. If you use twitch or steam streaming it wont work very well because of the delay steam and twitch has. Would ask the devs to implant a stream option where the dialogue options dont got a timer or a longer timer.   Anyhow overall the experience was good and i didnt have any issues with the game or fps. But i noticed one bugg when i was at the batcomputer they forgot to add a 'back' button which kinda was bad as you had no idea how to get out of it apart from that it was a good experience like i already said.",
            "review_score": "1"
        },
        {
            "review_text": "Wouldn't usually review a game so early but due to the issues that some players have been having having I thought I would say   It worked perfectly on my pc and I loved the first episode it's a real shame that people are having issues   Would recommend on the experience I had",
            "review_score": "1"
        },
        {
            "review_text": "got game working finally... other than that this isw an amazing story of the BAT. Surprisingly also Bruce Wayne. I am on the edge of my seat waiting for how the episodes cliff hanger is going to unfold. i would absolutly recommend this game to anyone who is a batman fan!",
            "review_score": "1"
        },
        {
            "review_text": "a passive video game play concept . ALL movements are pre-programmed . You are prompted to press Left Right Up Down E SHift E , or possibly aim with the mouse .  When watching this Batman Cartoon , you might remove your hands from the keyboard and mouse , then when an on-screen prompt occures ,...you may miss it .  It is like watching a cartoon on TV , and at times , having to press buttons on the remote control to 'keep it going' . Perhaps 'drop in another quarter' at the arcade .  Text\\dialogue responses are logged to alter the outcome . However , slow keypress responses during combat spells 'game over' , try again .  runs good on AMD APU R7 graphics High Quality setting at 720p ( No Crash ) slight pauses during Scene Changes .  The story keeps going , makes it difficult to Exit . Keep your eye on the clock if you gotta go somewhere .  The nature of the passive game play tends to suck you more into the story. It works .  This is Episode 1 , 5 total episodes ,...neat .  This is real game play movie magic , fully scripted with user selectable responses to give alternate paths to the story . An interactive movie .  Adult level gore and dialogue . As sophisticated as a hollywood movie .",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed Episode 1, and as i can see there is mostly negative reviews on this game, because of lag issues and such. Myself i do not have any of these problems and at the same time i do have some out to date hardware (my GPU) But they will most likely push a patch for these issues soon.   But i would say if you like batman, buy it! I had alot of fun in episode 1 atleast!",
            "review_score": "1"
        },
        {
            "review_text": "Day of release was pretty rocky, FPS issues still linger but they are not as bad anymore. Story is pretty good so far. Interested to see the rest of it.",
            "review_score": "1"
        },
        {
            "review_text": "Wow, really good game. Made me feel like I AM BATMAN, not cheesing around (lol) at all. Story was nice and fresh (idk if it was covered in the books), completely different from the previous trilogy (no one counts Origins). All Batman falls will enjoy :D",
            "review_score": "1"
        },
        {
            "review_text": "System Specs:  Athlon X4 860k @ 4.1ghz MSI RX 480 4GB Kingston HyperX Fury 16GB 1600mhz DDR3  I suffered plenty of stuttering and crashes throughout my duration of the first episode.  With that said, I really enjoyed the episode. It was a refreshing take to actually see a story told mostly through Bruce Wayne's eyes. I'm interested to see where they take the rest of the series. It took me about 2 hours to play through the episode but I'll likely play it again as the next one nears.  UPDATE:  Episode 2 still stutters but it did not crash.   I was engrossed in the story throughout and I am really looking forward to the next episode.  UPDATE 2:  Episode 3 is just as buggy and this story is something else.  FINAL UPDATE:  With the latest patch, it fixed most of my performance issues. There were some drops here and there but nothing as significant as it was before. I really recommend the game to Batman fans.",
            "review_score": "1"
        },
        {
            "review_text": "I had one major bug (soft locked) and one instance of a frame drop below sixty at 1080p full graphics. Not sure what people are really experiencing but technicalities seems to be fine.    Overall the game is great. Voice acting is really good with Troy Baker and Lauren Bailey lending a hand. The story is really interesting as in it deals with the Politics that Bruce has to deal with and it plays out well, and of course with awesome Batman action sequences. The decision system seems really refined compared to other TellTale games, but since only the first episode is out they don't seem to have any major effect yet.    Overall my experience was great and can't wait for the next episode: 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Episode 1 has lag/framerate issues, but it was not unplayable by any means. A ran into an issue at the batcave computer where I couldn't exit from the codex screen. I switched to a 360 controller without issue. Overall a decent first episode. Im looking forward to patches and the next episodes.",
            "review_score": "1"
        },
        {
            "review_text": "Review of episode 1:  So far the game is great, and i haven't experienced any performance issues or bugs. There's the perfect amount of time split up for both Bruce Wayne and Batman, and there's lots of recognizable characters for the Batman fans, like Vicki Vale, Harcey Dent, Falcone, etc. Telltales art style fits the Batman universe perfectly, its like straight out of the comic, and i must say, his suit looks awesome.  You see the brutal yet elegant fighting style of Batman, along with his great detective work, and the charming side of Bruce Wayne along with with his damaged personality. Most of the characters were portrayed pretty well, like Catwoman, Vicki Vale and Falcone, yet i didn't really like this version of Harvey Dent that much, he didn't really seem like the pure shining white knight that Harvey is supposed to be. Gordon was also a bit off, but i think thats because him and Batman haven't really established a real relationship yet, as this seems to be pretty early in Batmans career.   All in all, if the game continues like this first episode, i think it will one of the best Telltale games so far.",
            "review_score": "1"
        },
        {
            "review_text": "Good story, but this game is so poorly optimized that I can't bring myself to recommend it. Just watch a 'Let's play' if you're interested in it, because games that are this full of bugs should never be released to the public.  Shame, Telltale.",
            "review_score": "-1"
        },
        {
            "review_text": "As exciting and entertaining as the Arkham series has been, for many comic fans, the opportunity to explore the duality between Batman and Bruce Wayne has been left unexplored in video games until this game. Gripping and suspenseful the whole way through, this game invites the player to consider the many sides of the Dark Knight. Is Batman a noble crusader or a brutal vigilante? Is Wayne a naive playboy or a cunning idealist? The supporting cast is great and pushes the player into reconsidering past choices. I found myself developing my views just as much as Wayne does in his journey.  Technically, the game is admitedly flawed on PC. I run an i3-3220 @ 3.30GHz, NVIDIA GTX 960, and 8GB RAM, averaged 55-60 fps with some stuttering and frame drops. I played on highest settings at 1960x1080 fullscreen using an XBox 360 controller. At times, dialogue or sound dropped, was muted, or was out of sync. This was enough to break immersion, but personally, I was not put off enough to not enjoy the game the whole way through.  tl;dr Great, immersive story and game. Occasional graphical hiccups. Generally recommend except for those most concerned with technical performance.",
            "review_score": "1"
        },
        {
            "review_text": "I've enjoyed this game a lot.",
            "review_score": "1"
        },
        {
            "review_text": "I had NO problem whit this game. Great graphic, no lag what so ever, and no problem with my XBOX-Controller.   LOVED the story! And GREAT choices! Unlike GoT-TellTale, choises actuall do matters in this game.  10/10 Can't wait for next episode!!!  GREAT WORK TELLTALE!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Telltale have done a pretty good job here, it's pretty ambitious with more options/choices to do things than in previous games. The story and dialogue are both fantastic, the chemistry between the characters is there thanks to some great voice acting. Combat and graphics have been upgraded and the music I have to mention is really well done - fits perfectly.  It acknowledges that Batman is a detective more than ever before, I am glad to see that this is in more than just the first episode as well. This game has surpassed my expectations, really worth playing for a Batman fan provided it works. Shame that there are some performance issues and (for me) a bit of stuttering in one of the episodes.  Ultimately if you play episode one (which is free at the moment) you will know if the game is for you.",
            "review_score": "1"
        },
        {
            "review_text": "Is good game wether like battyman or nah boi.",
            "review_score": "1"
        },
        {
            "review_text": "This is my first Telltale Series game and I am greatly enjoying it.  Pros -Looks Real Nice -Engaging Story  Cons -Other then Episode 1 it feels a bit short",
            "review_score": "1"
        },
        {
            "review_text": "I have never played a game with such a huge sound sync problem. I tried to persevere with it and chaned several combinations of settings on my NVIDIA control pannel. Trying the recommended fixes and also other settings that should have remedied the issue.   But the Problem remains that the frame rate drops so severley it becomes unplayable. Hopefully there will be a patch soon that fixes this problem but this isnt something that a 2016 game made by a respectable developer should have.  Ovarall it has soured the game and wouldn't reccommed anyone with a NVIDIA rig to purchase.",
            "review_score": "-1"
        },
        {
            "review_text": "It ran fine for me and I played it 30 minutes after it came out ( had to wait for it to install) I streamed it on twitch and it ran fine.  However I did get stuck on the codex screen while I was standing up and had to reload the scene. During the fight towards the end the audio completely disappeared. Gunshots couldn't be heard but it did fix it self after the moment was over.  Not bad.  The Story: I really like it. it's better than I expected yet original and new at the same time. Good controls action packed fight scenes a story that has me worrying and sweating like a pig.  not bad so far.",
            "review_score": "1"
        },
        {
            "review_text": "Awful fps/lag, no matter what you do the settings. So let down. Honestly, don't waste your money.",
            "review_score": "-1"
        },
        {
            "review_text": "Very fun and interesting take on the batman mythos. I did have to make some graphics adjustments before I could play but a couple quick youtube searches and it was taken care of. I had the whitescreen on startup, and that seems to be a problem with nvidia graphics cards, but youtube had the answers. Really enjoyable story/drama and not completely lacking in the action department. My one gripe is that the first chapter was over too quickly and has left me desperatly craving more! Overall I would definitely reccomend this to anyone that is an avid batman fan!",
            "review_score": "1"
        },
        {
            "review_text": "Good game as usual from Telltale. I had no issues with the game, it lagged only once but it fixed it self. Used alt+enter to go fullscreen and im playing it in 1080p no frame rate drops. Since im a batman fan (i just like batman dont know everything about it - played all batman games), the story still has its unexpected outcomes but i just like to play as BATMAN",
            "review_score": "1"
        },
        {
            "review_text": "  What a s***stain of a game",
            "review_score": "-1"
        },
        {
            "review_text": "besides the framerate issue its still a good game. ",
            "review_score": "1"
        },
        {
            "review_text": "Such a great game!",
            "review_score": "1"
        },
        {
            "review_text": "This game is brutal. First day I didn't liked it at all but in the second day they fixed the fps problem and with the rich story this game is best telltale so far.  Episode 1 review:  Good Things: They started it so good I mean It was very good It almost felt like I was the batman, There were brutal choices that you could make I won't mention them because It might be spoiler. This batman is mix of many like in arkham and DCEU batman a little from christian bale a little from tim burton. The relationship between catwoman and batman was good I think you will be able to change it in the next episodes. Game's story telling was great like planing and solving crimes.   Bad Things: I personaly didn't like the penguin, he doesn't look like him I mean he was cool af how can penguin be cool?  I think thats all about the first episode I'll update it when the second episode comes out.  Sorry for my english and long review I could post a potato but you know this is not 9GAG and you just can't post a potato.",
            "review_score": "1"
        },
        {
            "review_text": "I personally think Episode 1 was great, Telltale played the story to people knowing the source material while adding naturally arriving detail for new comers. I personally did not expierence any issues with the game except for one moment where i tried accessing the Codex inside the story and it didn't let me out.. I lost 2 minutes of since previous autosave.. Episode 1 has presented itself as a promsising story and i am looking forward for the next chapter... 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Batman - The Telltale Series is an amazing game. I know everyone talks about the bugs but except the clunky framerate, I haven't noticed anything else. There aren't a lot of meaningful choices but there are some minor choices that can still give you the batman feel. You really feel like a detective by linking possible clues together to piece together what happened. This is a solid start to a new telltale series with good writing and fun detective gameplay. It just needs some optimization. ",
            "review_score": "1"
        },
        {
            "review_text": "Hm........it is really hard to say whether it is a good game or bad game. Let's say it is a good telltale game but a very bad batman story. Sorry, telltale, that is the truth. I doubt their men never read a Batman story...........",
            "review_score": "-1"
        },
        {
            "review_text": "Batman - The Telltale Series is an amazing game. I know everyone talks about the bugs but except the clunky framerate, I haven't noticed anything else. There aren't a lot of meaningful choices but there are some minor choices that can still give you the batman feel. You really feel like a detective by linking possible clues together to piece together what happened. This is a solid start to a new telltale series with good writing and fun detective gameplay. It just needs some optimization. ",
            "review_score": "1"
        },
        {
            "review_text": "Despite early PC performance issues the first eposide followed in suit with the rest of telltales games and delieverd a fun and engaging story",
            "review_score": "1"
        },
        {
            "review_text": "the game is great if you are a batman fan and it is better then there other games to",
            "review_score": "1"
        },
        {
            "review_text": "Slight performance issues.",
            "review_score": "1"
        },
        {
            "review_text": "Just played through the first episode. Huge fan of Batman as a kid from the comics to the animated series to the movies to the games. This by far is one of the most Batman feeling Batman games out. An original story mixed with Year One mixed in with The Long Halloween and a conspiracy.   One of the best things about this game is that we get to make important choices as Bruce Wayne, not just Batman.  I haven't come across any performance issues whatsoever but if you are wanting to play this game, make the buy and get a refund if it does not work for you.",
            "review_score": "1"
        },
        {
            "review_text": "Performance is great for me with a GTX 970. Great game with good choice as well as batman being brutal as ♥♥♥♥  EDIT: It just gets better and better....",
            "review_score": "1"
        },
        {
            "review_text": "Great Game,  This definitely plays like Bruce Wayne simulator 2016 at times but not in a terrible boring over done way, but rather in a zesty, fun new (goat simulator) way, sure there are bugs with the frame rate and there is an error that I have come across that forces you to restart the game (don't open the batcomputer codex at the first time you get to the bat computer) but this is a new engine for TT so no hate there, I personally find that it runs smoother each time you launch the game or after a little bit after downloading.  I am a huge Bat Nerd, look at my profile and you see Arkham Knight, I completed that glitch fest opening week and I can confirm that this is not bad for launch or even any game, all I can say for hardware is that you need a Good CPU to back up that beefy 1080 TI that we all obviously have (that is a jab to the endless torrents of trolls saying it runs at 10FPS and always say they have a titan or a card from 10 years in the future). At the end of the day, I love it and get good frames (Better than Telltale's GoT or Borderlands), I can't promise anyone else that they would love it but I can recommend it. Besides Who wouldn't want to say that Dent, 'is the new face of gotham'.  In summary 9/10 make the QTEs simpler or more forgive, or better yet don't give me a diagonal one and say it is up. It's not an arkham game but that is not what it is trying to be, so get it.",
            "review_score": "1"
        },
        {
            "review_text": "My laptop runs this game fine.   + Batman &amp; detective work! + Interesting story + Well balance between Batman &amp; Bruce Wayne + Political scenes with tension  - Overused stuffs for Batman's fans like conversation between Bruce &amp; Alfred, Batman &amp; Gordon - It's early years of Batman... AGAIN!!  Overall: It's good but not great.  7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "I haven't experienced the bugs or crashing that other have had happen. The story is very good and the detective work is fun to play. The game needed to be set to a higher resolution for the first start. Also, I am using an Xbox One controller and the RT and LT are reveresed. So, if it says to press RT + A, I really need to press LT + A. I'm not sure why.",
            "review_score": "1"
        },
        {
            "review_text": "got to admit I'm probably a bit bias because I'm a huge batman fan, but i loved this, absolutely amazing, just wish all the episodes were out ",
            "review_score": "1"
        },
        {
            "review_text": "Apart from a mouse bug playing on higher resolution (over 1080p) on full screen, I ran into little problems. I enjoyed the first episode and do dont regret my purchase as a fan of Telltale Games for years.  I have a very high rig, and not going whinge and moan as I kids today would'nt survive boot disks and waiting ages for patches and fixes. Playing games on day of release has always been playing russian roulette no matter what hardware you have, If you are a fan of Batman or Telltale Games its a pretty standard affair, but thats not to say it was a enjoyable start too the game.",
            "review_score": "1"
        },
        {
            "review_text": "Really enjoyed plaything this first episode of the Batman Telltale Series. Took me about 1 hour 40 minutes to get through the first episode. I liked the combat scenes as Batman, and liked how responsive the game was to the controller input, though for a change in Telltale games missing a button prompt in a QTE is not rewarded with a fail, just prevents you filling a meter to perform a special combat finisher.  The conversation scenes and dialogue choices are again what you are familiar with from Telltale though I did notice when comparing my playthrough with some other people there are scenes where regardless what option you choose the characters around you still proceed with the same dialogue and actions, so perhaps not as many options written and recorded by Telltale. I had no performance issues when I played and from the negative comments I've seen and the negative reviews they all seem to come from the same group of people, Laptop users who are trying to run this on a system with integrated graphics, when the store page and system requirements clearly list this as a no no. Any playing on a PC with a dedicated PCIE Graphics Card is not having any issues.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game,  This definitely plays like Bruce Wayne simulator 2016 at times but not in a terrible boring over done way, but rather in a zesty, fun new (goat simulator) way, sure there are bugs with the frame rate and there is an error that I have come across that forces you to restart the game (don't open the batcomputer codex at the first time you get to the bat computer) but this is a new engine for TT so no hate there, I personally find that it runs smoother each time you launch the game or after a little bit after downloading.  I am a huge Bat Nerd, look at my profile and you see Arkham Knight, I completed that glitch fest opening week and I can confirm that this is not bad for launch or even any game, all I can say for hardware is that you need a Good CPU to back up that beefy 1080 TI that we all obviously have (that is a jab to the endless torrents of trolls saying it runs at 10FPS and always say they have a titan or a card from 10 years in the future). At the end of the day, I love it and get good frames (Better than Telltale's GoT or Borderlands), I can't promise anyone else that they would love it but I can recommend it. Besides Who wouldn't want to say that Dent, 'is the new face of gotham'.  In summary 9/10 make the QTEs simpler or more forgive, or better yet don't give me a diagonal one and say it is up. It's not an arkham game but that is not what it is trying to be, so get it.",
            "review_score": "1"
        },
        {
            "review_text": "I'm not sure why most others are experiencing difficulties running this game, but it ran just as smoothly as the other telltale games that I have played on my mediocre build. This was at 1920x1080 on fullscreen. Don't be too hesitant to buy it; it rivals 'The Wolf Among Us' in its immersive story.",
            "review_score": "1"
        },
        {
            "review_text": "Works really well with me !  just done with the episode 1 of this great game, really enjoyed playing this game !  a MUST BUY game for Batman's fans !",
            "review_score": "1"
        },
        {
            "review_text": "I have had no issues (60fps), though I understand that there is an issue and feel for those experiencing game breaking issues. I've really enjoyed the first episode and hope that Telltale can fix these issues quickly, there is a well crafted and interesting story on offer, just hope everyone is able to experience it.",
            "review_score": "1"
        },
        {
            "review_text": "This was amazing.  Played all 5 Episodes in one run and I just loved the Experience. I love, how Bruce Wayne is, if you want to, more important to the Story than Batman. The Characters are all extremely good written and have some exciting new Twists.  Also, the fights are, for Telltale Standards, very intense and epic. But I don't want to spoil anything.  You dont have to be a Batman Fan to love this Game. And after you played it... you really want to see a second season of this game.    tl;dr WHERE IS BATMAN SEASON 2?! AND WOLF AMONG US SEASON 2?!",
            "review_score": "1"
        },
        {
            "review_text": "I love this game! It's not action pack kinda of games, its more into the adventure and story kind of game. QTE Game style. You have the freedom to be a good batman / Evil batman.   You will be given 4 options when chatting with certain people in the game, and your pick will decide whether it's a good or bad decision in the story. Your decision will effect throught the story line. You also will decide to save/kill (no kill in episode 1 yet, there is a Brutalize option and so I assume there will be an option in the future episode).  The QTE is quite hard for me, My reflexes is slow :/ need to pay attention more &gt;.&lt; The game have terrible release at start but they fix it. I have not encounter any bugs or any crash issue.  The story is actually quite entertaining, I want to know what happen next in Episode 2 after Bruce shouted at Alfred at the end :o .  PLEASE RELEASE MORE EPISODE SOON!  Good game :) worth the price.   - My English is terrible I know :v But atleast I tried as much as I can :D",
            "review_score": "1"
        },
        {
            "review_text": "Well, you thought i'd learn something after playing several Telltale games and remember that pretty much none of your choices matter. But here i am, complaining about it again.  Im so annoyed, i played my whole playthrough pro-Harvey, but no matter what you do,  he still becomes crazy and mad at you. I didnt initiate any romance with Selina, but ofc Bruce had to be caught only in boxers by Harvey in her apartment.I didnt tell Vicky the officer's name, but the game thinks i did.   and so on.   I dont know why i keep taking a bait, probably cause i really love the 'game like a movie' trope.I guess i should realize that its really just a movie, and no matter what you choose to say and do, it will still have one ending with some small differencies.  Yea, and dont even get me started on how laggy this game is.",
            "review_score": "-1"
        },
        {
            "review_text": "If you're money-conscious, I would highly advise waiting until they release a more stable version of the game before purchasing.  Refunded this game so quickly. Purchased this game for myself, wouldn't even launch. I updated the game and my drivers, yet I'm still stuck at a blank white screen whenever I try to play it. Apparently there are a lot of people with this issue still.  Four of my other friends also purchased this game, 2 have the same issue (one on Windows 7 and one on Windows 10) and the other two either have ♥♥♥♥♥♥ frames with a gtx970 or they just freeze and lose all controller support.  The patch doesn't fix this game for everyone unfortunately. Please make sure your game is stable for a large portion of your audience",
            "review_score": "-1"
        },
        {
            "review_text": "Unless your PC is the strrongest computer in the world, don't buy this game because it will lag and the framrate will be stuck at 10 fps or lower.",
            "review_score": "-1"
        },
        {
            "review_text": "10 fps glory :gun:",
            "review_score": "-1"
        },
        {
            "review_text": "I'm aware of the issues that many players have been experiencing in running the game and fortunately I've been able to play the entirety of episode 1 without any issues. I'm a little biased as I am a huge Batman fan, but the game is great as a new addition to the Batman mythos. Graphically, the game looks fine; nothing realistic but has that stylish comic book feel to it. Animation is quite smooth (apart from some lip syncing issues and clipping) and really shines in the combat sequences as the Dark Knight. Where the Arkham Series had a lot more focus on being Batman, Telltale's story delves more into the life of Bruce Wayne. If you're looking to see the caped crusader beat down on thugs every five minutes, this may not be the game for you. There's quite a lot of exposition but that may change in the later episodes. Towards the end of my playthrough, action seemed to pick up and I began to feel like Batman: analyzing crime scenes, planning an attack, and executing it. You truly get to experience the contrast between the love for Bruce Wayne and the fear of Batman.   While I did feel like my playthrough was short, Telltale's golden formula of branching paths will have me coming back again to try out new choices and see their results. Of course, there's only so much I can do while I wait for the next episode to be released. Overall I give the game an 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "After the travesty of the Game of Thrones Telltale game I am glad to see Telltale have picked up the ball for Batman, there is a new Engine which for me at least runs very smoothly at 60fps, the beginings of what seems to be an interesting story focusing on Bruce Wayne and not just Batman (Which I am very excited for) and seems to be an entielry new story set in the Batman universe, which means unlike the Game of Thrones storyline is going to allow the writers to create a world that can change massively depending on the player's actions. it will be interesting to see how far they let us take Batman, whether you choose to become the Ben Affleck Bat, breaking arms and being incredibly violent to get what you want or a more tradtional Bat where you can use fear to bend people to your will. The choices also seem to acutally matter and I am very much looking forawrd to the next episode! Seems to be shaping up to be the best telltale game yet!",
            "review_score": "1"
        },
        {
            "review_text": "If you are a fan of batman i would deffinetly get it i see that alot of people report bad frame problems but if there were any i really didnt notice but one thing that i was not to happy with was that some audio clips simply seemed to not be there and i was very dissapointed since they were misssing in the boss fight but the story line is good it has very good potential just rough around the edges",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Shook Falcone's hand everyone hated me",
            "review_score": "1"
        },
        {
            "review_text": "I am vengence, I am the night, I broke someone arm",
            "review_score": "1"
        },
        {
            "review_text": "░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░ ░░░░░░░██████╗░███████╗██████╗░░ ░░██╗░░██╔══██╗██╔════╝██╔══██╗░ ██████╗██████╔╝█████╗░░██████╔╝░ ╚═██╔═╝██╔══██╗██╔══╝░░██╔═══╝░░ ░░╚═╝░░██║░░██║███████╗██║░░░░░░ ░░░░░░░╚═╝░░╚═╝╚══════╝╚═╝░░░░░░ ░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░",
            "review_score": "1"
        },
        {
            "review_text": "It finally started getting better a day after. I updated my G-Force Nvidia drivers, and it's working fine. The graphics options did get a bit better with the options of 'High Performance' and 'High Quality'. There is one thing that is bugging me and that's the mouse. The mouse looks and feels a bit laggy for some reason. I wish it felt like I was moving the mouse normally. Whatever. It's just a minority.",
            "review_score": "1"
        },
        {
            "review_text": "Good storytelling The faster paced quick time events are great Noticed some minor bugs during the gameplay but nothing game breaking",
            "review_score": "1"
        },
        {
            "review_text": "Great fun! Done with second playthrough of episode 1. Runs smooth at 1080P. Can't wait for more!",
            "review_score": "1"
        },
        {
            "review_text": "one of the most fun telltales games iv played",
            "review_score": "1"
        },
        {
            "review_text": "I've played though the first episode twice now. And overall I really enjoyed this game. Yes it has a few bugs and is a little laggy at times but its never to the point where its unplayable. I am a huge fan of both Batman and Teltale and it have to say that once the small problems are worked out this game will really do Batman justice.",
            "review_score": "1"
        },
        {
            "review_text": "I've played though the first episode twice now. And overall I really enjoyed this game. Yes it has a few bugs and is a little laggy at times but its never to the point where its unplayable. I am a huge fan of both Batman and Teltale and it have to say that once the small problems are worked out this game will really do Batman justice.",
            "review_score": "1"
        },
        {
            "review_text": "I personally haven't nad any issues running the game. It's definintely one of the better telltale games I've played and I'm looking forward for more! I recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "ya no lag here dont know what all the fuss is about. the game is rerally good! loved every minute! cant wait for the next episode!",
            "review_score": "1"
        },
        {
            "review_text": "Review for episodes 1-4: I have high expectations from Telltale Games and this game doesn't fail to deliver. I rarely pre-order games, but with this developer I know it's safe to do this. First of all they finally updated the engine which is a huge improvement, because this game looks amazing. I with their previous games looked that good.  It shouldn't come as surprise, but the voice acting is absolutely fantastic.  The plot... Oh boy, it's so good! The story is so engaging and moving very fast, packed with breathtaking action which is keeping me on the edge of my seat. The dialogues are great, although I found some inconsistency in Gordon's attitude to Batman, but that was only once. Just like the rest of them this game is more like an interactive TV series, where you need to press buttons from time to time to progress (I personally love it), but it was very nice that they added some puzzles and you must do pixel-hunting trying to solve stuff, also you get to move around in locations. There are of course decisions that you have to make, and some of them are tough which is good. I really enjoyed not only getting to choose answers in dialogues, but also choosing either this or that activity to do, which offers you unique gameplay and experience. Moreover, the game offers bonus videos covering game development. Can't wait for ep 5!  Thank you so much, Telltale Games! The Walkind Dead season 3 is already purchased ;-) Much love from Russia! P.S. Bruce is smokin' hot!",
            "review_score": "1"
        },
        {
            "review_text": "best batman game there is.",
            "review_score": "1"
        },
        {
            "review_text": "game is kinda flat and bad optimized. when they fix this mess ill change my review.  edit about game in general not performance: This game is a bunch of quick time event, pre rendered videos, mostly dialogues and little detective stuff which ultimately doesnt affect the outcoming. man even if you let dialogues not answering they still give u the best scenario. i tjink we all can agree this game is no way near arkham franchise.  i wouldnt recomend this game if you are not into this role play gay stuff.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a good TV show. I mean game",
            "review_score": "1"
        },
        {
            "review_text": "my fps are so low i can't even play  i need a refund immediatly ",
            "review_score": "-1"
        },
        {
            "review_text": "Telltale games were awesome before this piece of ♥♥♥♥ came out",
            "review_score": "-1"
        },
        {
            "review_text": "Don't play this game and don't buy it.It's must waste your money!We need Arkham Series!!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "  Batman got some ♥♥♥♥♥ Batman got some ♥♥♥♥♥   :D all in all at first the game had issues performance wise but after the episode 3 Update the game has been running fine on my end   as fore story line the game is beautiful and i cant wait for the rest to release  ",
            "review_score": "1"
        },
        {
            "review_text": "Weird bugs with mouse cursor lag and resolution scaling, tried with Xbox One controller and inputs on screen didn't even match controller inputs. Technically broken, unplayable garbage. I've always had borderline bad experiences with the technical aspects of Telltale's software, but this is easily the worst.",
            "review_score": "-1"
        },
        {
            "review_text": "It's really hard to judge since only have one episode right now, but enjoyed the story of the first episode. It appears they used the TV series Gotham's Oswald Cobblepot version as I don't ever remember the character being tall and lean in the comics or movies. The graphics were great and didn't have any FPS issues that others reported.",
            "review_score": "1"
        },
        {
            "review_text": "Honestly first episode was great. I dont get why people are saying its bugging etc. Don't pay attention to the bad reviews saying that because in all fairness frames were great and the gameplay were great can't wait for episode 2.",
            "review_score": "1"
        },
        {
            "review_text": "Edit: With the complete lack of communication and terrible management over the release of Episode 4, I can't recommend buying anything from this company.     It's got a few issues, the codex bug is irritating, the CTD on my first attempt and it crashed my graphics card's drivers. But the game is fun, I'm not seeing any of the lag people are talking about.  Recommending this because the issues will almost certainly get patched. And it is playable.",
            "review_score": "-1"
        },
        {
            "review_text": "It's Batman. It's Telltale. If you like them both you'll like this.   I don't have performance issues but I did have a bug that caused my save file to be corrupted and had to start all over again.",
            "review_score": "1"
        },
        {
            "review_text": "Awsome story, good gameplay, I give it 8/10 because of the freezing, and crashing",
            "review_score": "1"
        },
        {
            "review_text": "Great game! I love that telltale stuck to the no killing aspect to Batman as they are known to have a lot of killing in their other game titles.  Great work can't wait for episode 2!",
            "review_score": "1"
        },
        {
            "review_text": "Patched up and good to go in typical telltale style.  Not to sure about the story I mean it looks as though you get penalised for playing as Batman. Brutal crime fighter.....  Whatever its still pretty good",
            "review_score": "1"
        },
        {
            "review_text": "Hey, loved this first episode because the game gives you choices and a possibility to form the 'batman' you wish to be.  ",
            "review_score": "1"
        },
        {
            "review_text": "In Its current State for me it is unplayable. I tried to get it to run full screen. Then the game only showed a white screen with the sound running. I cant even play. Until this is fixed stay away. I preordered as I love Batman, and Telltale, but I am extremely disappointed  EDIT - Found a workaround on the forum. Alt+Ente rto remove full screen. However now I just get a black screen after the Batman intro, no menu screen. This can be fixed by disabling the steam overlay.Still disappointing that after The Walking Dead and Wolf Among Us that Telltale cant get a fullscreen game to run. The unintuitive options menu also should never have happened.  However once the problems are out of the way, I loved the game. If you like Batman, and Telltale Games, then you will surely be satisfied. But it may be worth waiting a while to purchase due to the problems",
            "review_score": "1"
        },
        {
            "review_text": "I'm a simple man. I see a Batman game, I buy it.   Seriously though, this is a different take on our favorite superhero. Telltale is good at story-telling and this Batman game is no exception.",
            "review_score": "1"
        },
        {
            "review_text": "Technical hiccups can make it unplayable at times, and it took me a long time of scrolling through possible solutions on the internet in order to make it run, but if you can get past those obstacles it's really a great game.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic. Great writing. Had no issues with frame rate. May be the best Telltale yet. Can't wait for the next release.",
            "review_score": "1"
        },
        {
            "review_text": "This is a batman game or not? It's hard to say, although the title is Batman. However, the TTG has a big dream, to creat a whole new story of Batman, eh....from what I've played yet, the year one, maybe. I can't say this is a bad game, and I just can't say this is a good batman game. Too many filters here, and sometimes the words don't sounds like what Batman will say. Besides, the personality of Bruce, is too weak if you choose some soft branches, or too strong as a well-known playboy. The part of acting Batman is okay, but acting as Bruce? ha, it's really not so good.  And, as a worker in 2k china local QA, the localised work of this game is a crack of ♥♥♥♥. One more thing, can't we just make it a AVG-type game? All I need to do is choose the words I'm gonna say and I don't need to the ♥♥♥♥ing QTE!  顺便一提，这官中不如不出。",
            "review_score": "-1"
        },
        {
            "review_text": "The Game has way to many problems If you buy this game just now that you will need a computer made by God because if you don't the game will lag and some of the quick time events won't show up or even tell when you hit the key. This will case you to fall over and over and over and over and over again.",
            "review_score": "-1"
        },
        {
            "review_text": "Review written at the launch of ep.1. Writing seems to be up to Telltale standards and delivers what you'd expect of familiar Batman characters. I understand that the first chapter tries to set up the story but there's only so much you can fit in about two hours of gameplay. It left some of the scenes shallow and instead of focusing on few main characters it threw them all in bit too quickly. However few characters deviated from their typical depiction and it felt fresh and interesting.  Didn't run into any bugs myself but the framerate did occasionally drop to 10-20. Camera angles were bit annoying with Batman usually filling the screen especially in detective scenes.  Recommended because despite few flaws it still feels and acts like a Telltale game.",
            "review_score": "1"
        },
        {
            "review_text": "Awsome game, lots of fun. The game ran great on max graphics. With my lenovo Y50 'GTX 860m'. The only problem I had with how it ran was. I had to turn on my graphics card, Which is really easy and full screen would not work making me have to play in windowed, which is just fine. Looking forward to the new episodes :)",
            "review_score": "1"
        },
        {
            "review_text": "For some reason my first attempt to play started with my integrated graphics browser. Once I restarted with the default set to my discreet Nvidia card, it was perfect.   Good game. Not worth $20 for one episode, very short game. Wait for a sale. It will offer good replay value, but you have to wait until you complete the whole series since it will affect the sequels.",
            "review_score": "1"
        },
        {
            "review_text": "This story has something to it, and like many Telltale games that is the whole point. However it never really picks up the flow of some of the other Telltale games.   Maybe i'm getting used to the formula, but too many decisions felt pointless. There were lots of great setups and moments, but it feels like many of them fly by so fast that I barely get the chance to really enjoy or consider them. At times I just wished this was a short film that explored this concept of a corrupt Wayne family further. It does hit the important notes of a batman story and a Telltale story and it is mostly competently executed. It does have the ocassional hiccup, even after the latest performance patch, but nothing that destroyed my gameplay.  It just doesn't have that 'edge'. It doesn't make me want to see more at the end of each episode and the pace almost feels too quick to really enjoy the truly interesting parts. I enjoyed it enough to recommend it, but it's not the strongest of the Telltale series.   Overall i'd say to give it a go if you like Batman and Telltale.  7/10  ",
            "review_score": "1"
        },
        {
            "review_text": "Another solid telltale title.  If you like Batman you probably have already bought this game, if you are not a Batman fan you might not get some of the inside jokes made by some of the characters but other than that you are probably o.k. to play it.   Really cool detective mode, I really like the way you can setup how to fight baddies.   8/10 Good new take on the beginning of Batman.",
            "review_score": "1"
        },
        {
            "review_text": "A truly fantastic game that tells the story of Batman/Bruce Wayne like never before. I highly recommend it if you are a Batman fan, or even of Telltale in general. There were some bugs, but the game was always playable. Can't wait for season two!",
            "review_score": "1"
        },
        {
            "review_text": "Came in on the release of Episode 5  When I started playing, I could not stop.  Pros: -Thick story line where your choices matter. -Combat scenes are solid. -Writing up to Episode 5 is solid. -...  Cons: -If a lower spec PC, or a lower spec graphics card, might be choppy on combat interactions. -Heavy graphics processing game. -...  Overall -9/10 would put a dent in harvy dent again. -9/10 would smack Pengiun again. -9/10 would steal from catwoman again. -... ",
            "review_score": "1"
        },
        {
            "review_text": "Thoroughly enjoyable as this Batman game provides a fresh story that covers aspects of the iconic mask that prevaious games and films haven't covered yet. Story was interesting and easy to follow. Gameplay was as good as others Telltales games and what I liked most was how the dialouge didn't go on for too long and everything that could be interacted with was actually useful and not just a filler. Really hope they do a sequel soon.",
            "review_score": "1"
        },
        {
            "review_text": "This game waesnt disapointment. There were some difficult choises, but the story were great.",
            "review_score": "1"
        },
        {
            "review_text": "Strong reinvisioning of the Bat and much of Gotham, I liked it very much.  Happy that Telltale has the IP and Arkham Aslyum's shadow can't cast on quite so much of the franchise.  Overcoming a few small Telltale typographical errors, some incongruent dialogue, and the occasional posing issue (Bruce handing confidential documents over to Gordon with his spine thoroughly disjointed, and Catwoman freeing herself from a choke-hold with a disconnected animation), the only irritant I have left is the omnipresent stock voice actors of Telltale: I wish --   I wish   -- they'd branch out more for their major characters: for instance, Rhys and Fiona of Telltale's Tales from the Borderlands reprise their role as Batman and Catwoman, and it grates.   If you like modern Telltale, however, you'll cherish this as much as any of their other products.",
            "review_score": "1"
        },
        {
            "review_text": "Loving this game! This is right up there with A Wolf Among Us!",
            "review_score": "1"
        },
        {
            "review_text": "I am a massive Telltale fan so this review might be a bit biased but I think that this is one of their best series they've released (beat only by The Wolf Among Us). The story is engaging, interesting and fresh in a world of predictable superhero movies. Each character and villian is given a virtually blank slate that mean your decisions really feel like you're creating this world more so than in other Telltale series like The Walking Dead.  As far as gameplay goes the only main improvement over other Telltale games is the addition of the linking mechanic, which makes the detective element much more in your hands. The puzzles aren't very difficult and the quicktime events are very stock standard making it feel less like a game and more like a pop-up book. But the conversation choices do let you vary from the kind and caring vigilante to the ruthless maniac.  Overall this is an enjoyable game that fans of all things Batman will no doubt find interesting, even if the gameplay itself is basic.",
            "review_score": "1"
        },
        {
            "review_text": "Terribly optimized, lip movement and voice are often for me not synced. Massive frame drops. Besides the terrible performance, the story itself I'm not a fan of either its just so so for me. This being my first telltale game will also probably be my last. Can't recommend at this time and even upon completion and possible patching I still dont think I'd recommend this game. Want a good batman story play the arkham games if you haven't already.",
            "review_score": "-1"
        },
        {
            "review_text": "Didnt't do anything after finishing episode 1 (no season pass was bought) Came back a few hours ago to play episode 1 again and realising that i have all the episodees (i almost cried) Because of this the only thing i can say its amazing how the story drives  5/7 'ign r8 dis'  ",
            "review_score": "1"
        },
        {
            "review_text": "Great game,but not for wood pc",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game, expecting to enjoy playing through the eyes of Batman, and make choices. I played the game for 20 minutes, all I got was lag, poor framerate, and when that 20 minute mark came around my game crashed, I have been unable to open the game since, I even redownloaded it. I watched a couple of clips of the game, and it is beyond bugged. A strong dissapointment.",
            "review_score": "-1"
        },
        {
            "review_text": "Great.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Everything about it is Batman. Telltale again does a fantastic job with the story. The comic book art style in all the Telltale games fits the Batman universe great. The voice acting is great too. All the Episodes (so far) have been great, especially episode three. My god was that good. I normally hate episodic games but with a game as solid as this it gets a pass in my book. No performance issues for me at all, running this with an R9 270x and an FX-6300.  **** Just finished the final episode and I can say that this is a fantastic game. Telltale knocked it out of the park with this one. The story is on par with Arkham City, maybe even better. This is great rendition of the iconic Batman.  Fun Fact: The voice actor of Batman in this game, Troy Baker, is also the voice actor for the Joker in Arkham Origins.",
            "review_score": "1"
        },
        {
            "review_text": "Even with performance issues, this game is realy fun to play. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "The brilliant story kept me gripped throughout. Love a good batman game and that's exactly what this is!  Had a few issues with cloud sync but once that was turned off it was a lot better. Not sure if there were some mistakes made with rushing episodes out but there were times where audio was out of sync and things didn't display how you would expect them to but overall nothing game breaking.  The whole 'your choices change the game' is interesting but ultimately you're going to come across the same key events and I felt in this game when I made one choice, further down the line it would reference that choice but it would sometimes not be the choice I selected. That was just a bit strange but again nothing that broke the game just a little weird.   Highly recommend, Can't wait for more!",
            "review_score": "1"
        },
        {
            "review_text": "Terribly optimized, lip movement and voice are often for me not synced. Massive frame drops. Besides the terrible performance, the story itself I'm not a fan of either its just so so for me. This being my first telltale game will also probably be my last. Can't recommend at this time and even upon completion and possible patching I still dont think I'd recommend this game. Want a good batman story play the arkham games if you haven't already.",
            "review_score": "-1"
        },
        {
            "review_text": "Another solid telltale title.  If you like Batman you probably have already bought this game, if you are not a Batman fan you might not get some of the inside jokes made by some of the characters but other than that you are probably o.k. to play it.   Really cool detective mode, I really like the way you can setup how to fight baddies.   8/10 Good new take on the beginning of Batman.",
            "review_score": "1"
        },
        {
            "review_text": "Even with performance issues, this game is realy fun to play. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "While I would have liked it to be longer, I found this an enjoyable game. As someone who loves Telltale games AND Batman, this was a great experience. If you're a batman fan and ever wanted to 'RP' as Batman, this was a very enjoyable game.",
            "review_score": "1"
        },
        {
            "review_text": "4/5  Refreshing take on Batman Mythos. Choices matter sometimes suprisingly and sometimes not that much. Great game overall, works pretty solid with GTX 960 and i5-2320 as late of 2016.",
            "review_score": "1"
        },
        {
            "review_text": "A week after his wife left him, Jim went out to the local watering hole. After a long evening of drinking, Jim was thrown out of the bar as usual. On his way home he spotted a nun walking down the road. After looking at her twice he ran over and tackled her, then proceeded to beat the living daylights out of her. Some people passing by spotted this and called the police. As the police were pulling him away in handcuffs he looked back and said, 'I thought you'd be tougher than that, Batman.'",
            "review_score": "1"
        },
        {
            "review_text": "Lots of fun! Excited to replay through and change my decisions.",
            "review_score": "1"
        },
        {
            "review_text": "Lots of fun! Excited to replay through and change my decisions.",
            "review_score": "1"
        },
        {
            "review_text": "The classic Telltale recipe added to a bowl of one of the most popular superheroes of all time. Bang! The result is fabulous.  Pros: +a gripping new narrative (I am not familiar with the comics, so I'm not certain to what extent it's also different from them) +the choice of dialogues and choices in general with which you should be used by now. If not, it's a perfect way to start +you get to make some investigations on your own (they're not such a big deal, but it's still a nice gameplay innovation) +has Crowd Play, with which you can basically make all the choices in the game along with your friends +hey, it's Batman!  Cons: -it's plagued by the same problems every Telltale game has been. Though you are really invested in the choices you make, they don't really matter that much in the end -the story does fall into cliches at times  P.S. haven't seen anything of the technical issues people were complaining of at launch and my PC is anything but high-end, so I guess they must've solved them in the meantime.  Do I recommend it? Well, of course I do! Despite its occassional letdowns, I think it's a great game both for newcomers to Telltale games and to hardened veterans. And you don't even necessarily need to be a Batman connoisseur to like it. If I were to rate it, the score would probably be 8.5-9/10.",
            "review_score": "1"
        },
        {
            "review_text": "As a Batman fan, this game was worth it at the sale price of just under $17.  Pro:  -most of the bugs and technical issues appear to have been resolved. I did experience some crazy slow downs during times when Batman was in the Batmobile (what is it with PC games and frame rate issues with the Batmobile)? But fortunately, this affected only a very tiny portion of the overall game.  -with one exception, the story was engaging and interesting. It was on par with watching some of the direct to video DC animated films of the past several years (and better than some of those).  -the game did a pretty good job mechanically with making sure there was actually detective work for The World's Greatest Detective. The nature of the engine here limits how far they could push this, but it was nice to see.  -Batman gets down with Catwoman. Would give Selena the special Batarang again.  Cons:  -The Telltale game format is really starting to get stale. Over time you start to realize just how little player agency there really is in these games and you begin to see the sleight of hand they're using to give players the illusion that their choices matter. That makes these games a PITA to play anytime the story lags at all.  -One of the annoying things about superheroes is how every writer feels the need to revisit the origin stories. In this case a *significant* part of Batman's origin story was revisited and recast in a way that I absolutely detested. This is a major plot point and seemed to be part of the writers' efforts to reframe the origin and, thus, Batman/Bruce Wayne. Writers: please cut this s*** out. ",
            "review_score": "1"
        },
        {
            "review_text": "I only bought this game a few days ago and already have completed all five episodes.  Thoroughly enjoyed this game - great dialogue, great story and with the ending I am really hoping that they'll be a season 2 at some point.  Thank again Telltale",
            "review_score": "1"
        },
        {
            "review_text": "OH MY GOD! THIS GAME IS SO GOOD! This is some of telltale's finest work. PLEASE TELLTALE, MAKE ANOTHER ONE!",
            "review_score": "1"
        }
    ]
}