{
    "app_id": 498330,
    "name": "Cats are Liquid - A Light in the Shadows",
    "release_date": "2016-07-25",
    "developer": [
        "Last Quarter Studios"
    ],
    "publisher": [
        "Last Quarter Studios"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Adventure",
        "Platformer"
    ],
    "achievements": 16,
    "positive_ratings": 426,
    "negative_ratings": 43,
    "price": 0.79,
    "description": "A minimalistic 2D platformer about a cat with the ability to transform into liquid.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/498330/header.jpg?t=1554805441",
    "minimum_requirements": "OS: Windows 7 Processor: 5th Generation Intel Core m3 Memory: 2 GB RAM Storage: 120 MB available space",
    "recommended_requirements": "OS: Windows 10 Processor: 5th Generation Intel Core i5 Memory: 8 GB RAM Storage: 200 MB available space",
    "reviews": [
        {
            "review_text": "I love this platformer, the levels are awesome. Narraration is detailed. Its kinda funny and the cat is adorable!",
            "review_score": "1"
        },
        {
            "review_text": "Soundtrack, sounds and visuals are dreamyyyy  ^3^",
            "review_score": "1"
        },
        {
            "review_text": "1 word: cattastic. Very fun game! Combination of adventure and comedy with a bit of great narration and amazing gameplay = one great indie game, Cats are liquid! Would recomend 10/10 and even the price is affordable, coming in at only 1 euro/dollar (90 cents on current sale) 90 levels across 9 stages, first level is mastering 1 tecnique, 2nd is another.",
            "review_score": "1"
        },
        {
            "review_text": "Cats are Liquid is a nice little game. Puzzles aren't hard, movement is fluid (Pun not intended). It's just a fun game to play for a little while.  ",
            "review_score": "1"
        },
        {
            "review_text": "this game is addictive as hell. i let my sister try it out, and i couldnt get my computer back.",
            "review_score": "1"
        },
        {
            "review_text": "While this game is simplistic and a little long, it's very stress relieving. The calm colors and simple design choices make this game great for people who need to take breaks, and it's definitely helped me have a more cool mindset. I recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is interesting, and hard to properly evaluate. I think that, given it's price of $1, it is hard not to recommend it. It takes about and hour and a half to two hours to beat, and offers a nice enough story and some interesting artwork. If you want a game with the challenge of a super-meat boy type platformer, or the level of story and puzzling from something like Thomas was Alone, this game is not for you. It suffers from a general lack of difficulty, but at it's core has some potential. If it interests you, I would say to go for it, and look out for anything made by these devs in the future, I think they may make some incredible games to come.",
            "review_score": "1"
        },
        {
            "review_text": "I keep thinking my cat is in my room somehow. Would be funny if he crawled under the door, just to see me play a game called 'Cats are liquid'.   However, this must be the most realistic game I've seen so far. The cats look like a big bubble with a face, just like most cats out there. And they slide under doors... I love this game!",
            "review_score": "1"
        },
        {
            "review_text": "Thomas Was A Cat",
            "review_score": "1"
        },
        {
            "review_text": "Amazing story, great gameplay and mechanics. Dont let the simplistic graphics and the low price discourage you.  Do you like cats? Of course you do.  Do yourself a favor and immerse yourself in liquid cat.",
            "review_score": "1"
        },
        {
            "review_text": "Certainly a lot more intrigue then i anticipated for a game with a title like, 'cats are liquid'",
            "review_score": "1"
        },
        {
            "review_text": "This game was addictive and the puzzles are very clever and just the right difficulty, I really enjoyed playing it... however I was extremely disappointed in the ending. Personally, that ruined it all for me. I was going to go back and try to get the rest of the achievements, but now I don't even want to do that.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a simplistic game about a cat who can become liquid! But to me, I found it much more than that. This game might be simple, but it has a lot of charm, and is worth the 99 cents easily, this game will last you a few hours, and I recommend it to anyone really, this game is surprisingly dark if you get to that point and leaves you with questions. 8/10                                                                  GAME THEORY COME ON WHERE IS THAT THEORY ON THIS GAME I WANTED?!",
            "review_score": "1"
        },
        {
            "review_text": "I like this simplistic platformer, Cats are Liquid, though it was an impulse buy as soon as I saw kitties on my friend's screen. Everyone knows I'm the crazy cat person of the group and they always try to avoid showing me kitties or else I end up buying kitty games.  I like how simple it is, though I get lost in the instructions. The menu is a little clunky and the options were bigger than it should be, so is other buttons. There is a lack of control instruction/manual, to guide myself with or I will be perpetually lost.   Speaking of menu, I find it hard to navigate the game using my native screen (I use a 1366x768/1360x768) and had to result to a higher screen res, just to make everything bearable. It's missing and it bothered me.   Otherwise, I liked it for simplicity, can be much more improved.",
            "review_score": "1"
        },
        {
            "review_text": "A fun and cheap platformer, really no reason to not get it if you don't mind platformers.",
            "review_score": "1"
        },
        {
            "review_text": "Narrating and mechanics are good for price. I can say that easly game was fun",
            "review_score": "1"
        },
        {
            "review_text": "Presently unable to form words to do this magnificent little game justice, I will just say one thing, which I advise you not to mouse over if you want to avoid spoilers.    I want to track down every     pet abuser     in a square mile radius and rip his/her ♥♥♥♥♥♥♥ throat out.    I apologize for this irrational statement that explains nothing about the game itself. I presently need time to clear my head so I can give this gem a proper- or, half-decent, at any rate- critique. Until such time, I want it recorded as having my up-vote, and I will simply say here a sort of abridged review, from what little I can gather from my preoccupied and scattered thoughts; I shall return to expand on it later. Please note that this has slight spoilers, as well, and I would advise caution if you'd prefer the story to be with as little pre-set expectation as possible.  In my opinion, this is a very engaging game. The story is mysterious, very creatively told via lines of text set in the environment  , and, while bearing much levity in terms of choice of wording, ultimately powerful- if you moused over the above-warned line, you can probably tell that I, for one, have been strongly affected by it  .  The gameplay, in my opinion, is amazingly fun. The protagonist herself is comprised of a collection of malleable orbs which stick together in a sort of cloud; movement consists of an assortment of different methods, including rolling, sliding, wall-jumping, and another ability that you can discover early on. On that note, there are some abilities you can discover which add welcome elements of variety to the gameplay. The character moves fluidly, her locomotion and transitioning between different states to be flawless.  I find it rather difficult to describe, but the gameplay involves a great deal of potential skill ceiling, and in my opinion would lend itself very well to speed-running- so much so, that I am surprised, and I must confess slightly disappointed, that there is not an option for an in-game Timer. I hope I might be able to afford explanation to this point regarding speed-running at some point in the future, if/when I am able to return to this.   The soundtrack... ties in with the happenings of the story, such that I fear to comment on it would spoil more than I alrady have. However, I can say that it is very surreal, and oddly pleasant, although very eerie, to listen to. I've much the same to say regarding the graphics, if one replaces 'listen to' with 'look at'.  I, for one, heartily recommend this game, if you are fond of physics-based platformers.  Mind you, I have only played through the game once, and, again, have written this with a clouded mind. What's more, I've yet to play the Companion Mode. I intend to return to this review and change it accordingly, proceeding my having done so, as well as replaying the 'Normal' story line.",
            "review_score": "1"
        },
        {
            "review_text": "I didn't quite 'get' the story even at the end, but regardless, I didn't find it very motivating at any point. As a physics platformer, it has very wonky and exploitable physics which i used to accelerate myself through the level and bypass a great many obstacles. While holding the button to transform into liquid, you move at an accelerated rate, but you still have the ability to 'jump upwards' on any surface you touch. I could move along ceilings with this method at great speed. When the levels opened up late game, I could fly over most of the level.  Other than the exploitable physics, 90 levels of samey obstacles made this rather a chore to play. Perhaps if it was cut down in length a bit or add some more diversity to the levels other than just change colours, it might have been more interesting. Some puzzles, such as the rotating room level were a refreshing change, but it only lasted a single level.  The idea is fine, but it's let down by repetitive and unimaginative level design.",
            "review_score": "-1"
        },
        {
            "review_text": "game that proves cats are liquids and can die easily simulator 2069 best game 12/10",
            "review_score": "1"
        },
        {
            "review_text": "Very interesting game to say the least. But, it is a platformer game. Has a few challenging levels but a relatively easy game all together. It's only 99¢ so why not grab a copy and play it?",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥♥♥♥ this was quite the experience. It started as something cute, funny and simple, but I knew something was amiss. Stuff got slightly more complex as the rooms went by, more abilities were unlocked and then... ♥♥♥♥ went downhill fast.  Real fast.  It went from super cute to dark and kinda depressive. And this wasn't bad at all. This game took the perfect approach on this style of storyline, a really smooth transition from fun and happy to dark and sorrowful. I loved every second of it, specially during the mid-late parts. I loved how everything can be linked to some part of our lives  , specially when you lose everything you have, going through denial, then getting mad at that loss and then accepting it. I almost cried reflecting about when she loses everything and starts questioning the world around her  . Long story short, this game's great, and I can't really describe how wonderful this game is, but I can definitely tell you that it's worth every single cent.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game, the platforming, the mechanics, everything about it has WAY too much charm! There were parts where the dev CLEARLY didn't want me to use the steam powerup (or maybe that was intentional...), but y'know, MONEY WELL SPENT!  The story DOES get depressing after a while, but I'm not that much of a 'feels' guy, so not like a shed a tear or two, but still made me feel, bad. ESPECIALLY when I finished the 'Companion' levels that came after. I do not want to spoil what happens! That's all I (or anyone else) should give you.  Now, 1 person rated this review funny, probably because of the 'thing' that's right below this small wall of text. So I decided to keep it. Enjoy this, final little, 'thing' I made...  C ool A wesome T ubular S uper  A wless R adical E xciting  L ifting I ncomparable Q ueued U ltimate I nsightful D ander",
            "review_score": "1"
        },
        {
            "review_text": "Very recommended.... this same is simple in design... but OMG is it good, After playing the first room i was hooked, simple games are usually those that are the best, I have not found a AAA that hooks me as much as indie games have recently and this one is a keeper.. i feel the price is slightly too cheep but that is what made me get it!",
            "review_score": "1"
        },
        {
            "review_text": "isnt bad for a small, cheap game",
            "review_score": "1"
        },
        {
            "review_text": "it is a good logic game",
            "review_score": "1"
        },
        {
            "review_text": "Well, it's not some indie classic, but it is an alright little platformer to play for an evening or two. (I managed to finish both the basic and extra content in a little over 3 hours.) With its price,  Cats are Liquid  is a fair deal for the amount of content and enjoyment it provides.  I'll note here that it has its flaws. I felt like it was, to make up a word, “under-designed”. Some abilities and some obstacles didn't really feel like they added a lot to the game. Levels were too big for what was in them, looking empty as a result. For much of the game, there was an option to cheese it by abusing the “steam form” and just floating through entire levels. There are some inconsistencies in difficulty too, since it ranges from extremely simple to pretty frustrating (especially in the final levels).  On the other hand, the game looks very pretty and cute. Music is good too and ranges from happy little tunes to some ominous ambient droning. And it all works without any issues on Linux.",
            "review_score": "1"
        },
        {
            "review_text": "I've never had a happy looking cat thing give me depression before this.  10/10 worth the £0.71 i paid.",
            "review_score": "1"
        },
        {
            "review_text": "This game is strangely charming. The different ways the cat can move are fun, and atmospheric textual commentary makes one connect with the cat and its absurd plight. The graphics are shockingly simplistic and look like they were made by a child - it's a bunch of triangles and rectangles and circles, with only solid colors for textures. But somehow that only adds to the enjoyment.",
            "review_score": "1"
        },
        {
            "review_text": "It's a good game but at world 4 and level 10 it wouldn't lwt me finish the level when I made it to the door. ",
            "review_score": "1"
        },
        {
            "review_text": "such a cute little game but the ending just why , why would you do that to a small innocent creature",
            "review_score": "1"
        },
        {
            "review_text": "I was just looking for a fun game with cats ... TTATT THAT ENDING THO. WHY U GOTTA BE LIKE THIS?   Anyway, it was fun to play, I really liked playing it ... except for the square levels, that was stressful. For the square levels, at times the square was really hard to control. The music was nice to listen to while playing, reminds me of inudge. Overall, I would recommend playing it whether it be just for chilling or for taking a break from other games lol. Although seriously Im crying, that cat was too precious and cute TT-TT",
            "review_score": "1"
        }
    ]
}