{
    "app_id": 498510,
    "name": "DreamLand",
    "release_date": "2016-07-07",
    "developer": [
        "SandVUE"
    ],
    "publisher": [
        "SANPACE"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "RPG"
    ],
    "tags": [
        "RPG",
        "VR"
    ],
    "achievements": 0,
    "positive_ratings": 36,
    "negative_ratings": 26,
    "price": 0.0,
    "description": "Summary: “DreamLand” is an immersive VR game, made by AAA team base on htcVIVE with Unreal Engine. With the VR device, the player could pass through the Portal of Astral Spirit, and explore the mystical dreamland by time travel.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/498510/header.jpg?t=1467957909",
    "minimum_requirements": "OS: Windows 7 SP1, Windows 8.1 or later, Windows 10 Processor: Intel i5-4590, AMD FX 8350 equivalent or better Memory: 8192 MB RAM Graphics: NVIDIA GeForce® GTX 970, AMD Radeon™ R9 290 equivalent or better, Video Output: HDMI 1.4, DisplayPort 1.2 or newer DirectX: Version 11 Storage: 1300 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This game is awful. The intro is just a vertigo inducing light field that sort of looks like the world's worst loading screen until you figure out that you need to look straight down to start the game. Then, if you are prone to motion sickness (thanfully I am not, but it was still a bit rough) you'll fall over or barf as it drops you into the game world.   The game itself is a jittery mess. The world jumped around a bit whenever I turned my head, and I rarely, if ever, have that problem with other games. There is no teleport, so if you're unlucky enough to have important things spawn outside the edge of your room, well, I guess you just don't get to play this one. Not that you'd want to, because this is probably the worst thing available for the Vive right now. Free isn't cheap enough. You should be paid to play this game.",
            "review_score": "-1"
        },
        {
            "review_text": "When the game loads I am at the initial light field but nothing happens. I have no issues whatsoever with any other game. Has anyone else experienced this?  (GTX 970, i5 4690K, 16GB RAM)",
            "review_score": "-1"
        },
        {
            "review_text": "This is NOT a game and NOT an RPG. This is a good looking interactive little story with bad and unintuitive controls. My current playspace is 3x3 meters and most things I had to interact with were outside of those dimensions, the floor was too high as well, almost couldn't grab the key.  I wouldn't recommend it, there are much better VRexperiences out there. Decent 'jump scare' at the end.",
            "review_score": "-1"
        },
        {
            "review_text": "This was beautiful. Very short, but with excellent production values.  As for suggestions: I have quite a big play space, but have barely enough space to finish the puzzle with fire. I think it would be a good idea to implement teleportation as well (even if limited to small play area in this demo), this way even those with small rooms will be able to finish the demo.  Anyway, I hope we'll see a full game out of this (and hopefully in English as well).",
            "review_score": "1"
        }
    ]
}