{
    "app_id": 49900,
    "name": "Plain Sight",
    "release_date": "2010-04-05",
    "developer": [
        "Beatnik Games"
    ],
    "publisher": [
        "Beatnik Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Multi-player",
        "Steam Achievements",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Multiplayer"
    ],
    "achievements": 24,
    "positive_ratings": 177,
    "negative_ratings": 83,
    "price": 3.99,
    "description": "Plain Sight is a multiplayer arcade game about suicidal ninja robots. Fly through space, leap over planetoids and destroy opponents with your trusty katana. Killing fellow robots lets you steal their tasty, tasty energy. Packed with spinach-like goodness; energy makes you bigger, stronger, faster and generally more awesome.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/49900/header.jpg?t=1447352855",
    "minimum_requirements": "OS: Windows XP Processor: 2 ghz or better Memory: 1 GB RAM Graphics: Shader model 2 supported graphics card DirectX®:DirectX 9 Hard Drive: 300 MB of free space Sound: Sound card required",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This was the first game I ever got on Steam. IN FACT...it was the game that my friend told me he was gifting to me, which meant I had to install Steam. Ah, I'm so glad I did. :D #nostalgia #thankyouLordDust  AS for the game, it's a third-person suicidal robot simulator. You go around slicing up other robots with your sword and then when you want your kills to COUNT, you have to self-distruct yourself.  Sounds simple, right? Well, it would be if it weren't for the fact you can run on walls, ceilings, etc. Basically any surface on the map you automagically cling to it. The 'bound/unbound' mechanic takes a little bit to get used to, but it's a unique game &amp; one I recommend at least TRYING once in your life.  *edit [12/21/15]: I just heard multiplayer servers are down. :( I don't know much else, but if MP comes back in any way, I'll update*",
            "review_score": "1"
        },
        {
            "review_text": "the game is about looking at robots",
            "review_score": "1"
        },
        {
            "review_text": "Fun multiplayer timewaster. Don't play with Snakkles, he will definitely blow you up and then laugh about it.",
            "review_score": "1"
        },
        {
            "review_text": "It's like... You're playing Team Fortress 2 as a Targe + Eyelander demo. But your charge always replenishes itself. And everyone else is also a Targe + Eyelander demo. Oh and when you wanna get points you switch to the Ullapool caber and make yourself go boom... So, nothing like Team Fortress 2 at all. You should get it though.",
            "review_score": "1"
        },
        {
            "review_text": "Good time waster!",
            "review_score": "1"
        },
        {
            "review_text": "An amazingly simple indie game, with so much energy and fast-paced fragging akin to Quake Arena days. Only wish there were more people to play online with.",
            "review_score": "1"
        },
        {
            "review_text": "this is really fun. it's multiplayer only (tho it does have bots) so deffo only get it if its on sale + you can get other people to play it too. one of the modes makes you a giant trex robot ^_^",
            "review_score": "1"
        },
        {
            "review_text": "Ninja-robots in space. Nuff said.",
            "review_score": "1"
        },
        {
            "review_text": "If you are ever looking for a bit of rapid-fire action with a very dynamic game-field, Plain Sight can provide. You kill a lot, you die even more. But it's okay. In fact it's perfect. Controls are simple and intuitive, and gameplay concepts are fairly easy to understand. The learning curve can be a bit steep (the bare-bones tutorial doesn't give much away) but figuring out good tactics is half the fun.  However, the game requires a solid internet connection, because multiplayer is the only way to go, and lag can ruin you effortlessly. As well, the multiplayer community isn't perpetually online, so whether or not you can set up the exhilariting large matches is hit-and-miss.",
            "review_score": "1"
        },
        {
            "review_text": "look not alot of people play this. BUT IT DOSENT MEAN ITS NOT EPIC AND TAKES MASSIVE AMOUNTS OF SKILL.",
            "review_score": "1"
        },
        {
            "review_text": "I got this game for free and this game is so cool, but the server is dead, so you have to play against bots but you can play through LAN party and have fun with your friends and the controls are so easy to know, btw its a game about robots and ninjas, give it a try!",
            "review_score": "1"
        },
        {
            "review_text": "I got this game for free and this game is so cool, but the server is dead, so you have to play against bots but you can play through LAN party and have fun with your friends and the controls are so easy to know, btw its a game about robots and ninjas, give it a try!",
            "review_score": "1"
        },
        {
            "review_text": "tight work here boya!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "SPACE NINJAS! Robot Ninjas. ROBOT NINJAS IN SPACE! Challenge your friends and their reflexes. Utilize torn up terrains and odd gravity wells, soar through space and outsmart opponents, ready to slice them open with a one-hit-crit in this high stakes combat game. But it's not just about landing kills. It's about building up a killstreak greater than your last in order to obtain more points and more power in the end. Great for LAN parties and fanatics of ninja clicks and killstreak boasting. Technically you could call this a third person melee game.",
            "review_score": "1"
        },
        {
            "review_text": "If you wish to play Multiplayer look elsewhere this game has absolutely no multiplayer community and that is a shame because the game is quite excellent",
            "review_score": "-1"
        },
        {
            "review_text": "Cool concept, but nobody plays it and is extremely newb-unfriendly.",
            "review_score": "-1"
        },
        {
            "review_text": "This was a lot more fun than I was expecting it to be! Unfortunately, the multiplayer base is stone ♥♥♥♥ing dead. There are only eight servers running, the one that has people in it is probably somewhere in Eastern Europe. I cannot recommend a game with a stone dead multiplayer base. Sorry, guys.",
            "review_score": "-1"
        },
        {
            "review_text": "No reason in buying this super colourful game, it's been abandoned for a looong time now. Nobody plays this game anymore.",
            "review_score": "-1"
        },
        {
            "review_text": "Jump around, hold down your mouse button on other people, die randomly I guess?  Not even for a dollar. Horrible game. Don't do it, bro.",
            "review_score": "-1"
        },
        {
            "review_text": "From what i remember the game was fun.  But there are no servers for the game. And the community is pretty much dead.",
            "review_score": "-1"
        },
        {
            "review_text": "Now this is an odd one. Kind of fun, but I grew bored of it rather quickly.",
            "review_score": "-1"
        }
    ]
}