{
    "app_id": 499460,
    "name": "Tomato Jones",
    "release_date": "2016-07-11",
    "developer": [
        "HA Studio Ltd."
    ],
    "publisher": [
        "HA Studio Ltd."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Action",
        "Adventure",
        "Casual"
    ],
    "achievements": 0,
    "positive_ratings": 114,
    "negative_ratings": 23,
    "price": 1.59,
    "description": "It is just a red tomato with a stupid hat. He tries to look like a cool tomb raider, rolling and jumping all over the maps. Help him find all the treasures in the mystic castle or watch him die...in many painful ways.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/499460/header.jpg?t=1532036018",
    "minimum_requirements": "OS: Windows XP / Vista / 7 / 8 Processor: Intel Core 2 Duo or better Memory: 1 GB RAM Graphics: Nvidia GTX 460 or better DirectX: Version 9.0c Storage: 150 MB available space Sound Card: Generic sound card",
    "recommended_requirements": "OS: Windows XP / Vista / 7 / 8 - 64-bit Processor: Intel Core i5-3330 or better Memory: 2 GB RAM Graphics: Nvidia GTX 550Ti or better Storage: 200 MB available space Sound Card: Generic sound card",
    "reviews": [
        {
            "review_text": "  (Review code was supplied free of charge by the publishers. TL;DR at the bottom)  Tomato Jones is a challenging 3D puzzle platformer developed by HA Studio Ltd. in which you play a rolling red tomato who bears resemblance to Indiana Jones in both choice of hat and agility. You must roll and jump through castles and tombs collecting gold and artifacts along the way while simutaneously dodging what appears to be Nazi tomatillos and Apache potatoes(?). The game's 20 levels slowly increase in difficulty and occasionally add in new game mechanics like minecarts and swinging blades.  Upon first starting the game I opened up the 'Options' menu and found a decent enough selection of settings from Screen Resolution to graphics options like 'Bloom' all while a silly little soundtrack played in the background. I began the first level and was welcomed by unique and decent graphics with an art style that fit the theme of the game. I immediately noticed the solid physics the game presents as Tomato Jones continues to roll even after your fingers leave the keys, his momentum pushing him onward.   As I progressed through the levels I was often glad to see additional game mechanics added nearly every level. The game would require me to learn how to utilize things like minecarts and buttons to my advantage. I also enjoyed the challenge of collecting each and every coin, sparking the completionist within me. The game's difficulty gradually and constantly increased as the levels took longer to beat and my patience was tested. I appreciated that the developer added in the ability to change camera angles manually, as sometimes you need a different perspective in order to complete a level.   Unfortunately the game has it's weaknesses, as to be expected with a not-so-serious $2 dollar game. I'm thankful that the developer added in a feature to restart to the last checkpoint as I had to do that quite a few times. For instance, you can get stuck in between two walls and watch as Tomato Jones slowly slides to his death, which takes anywhere from 5 to 20 seconds to happen. You can also get launched off the map if you time your jump off of an elevator incorrectly, which is fine, except for the times when it doesn't kill you. It was also annoying when I'd depress a button with a crate or barrel, just for the barrel or crate to accidentally get moved thus making the button disappear.   The game, at times, feels unfinished in that I'd like to see quite a few features added. I think that the game could use a skybox or background of sorts, for one. I also would like to see different modes added like a level creator. I suppose it's a bit much to expect from a $2 dollar game, but I'm just throwing ideas out there for the long awaited sequel Tomato Jones 2. Luckily, the developer seems to actually care about his game as he's already fixed some issues and appears to be working hard to fix more while simutaneously adding features to the game. Even AAA developers could learn something from that.    TL;DR   All in all, Tomato Jones is a fun platforming game where you'll get exactly what it says on the tin. Despite it's flaws, it's a fun, cheap little game that will supply you with a couple hours worth of enjoyment, laughter, and frustration. It's a silly little game with great amounts of potential. If there's ever a Tomato Jones 2 I expect it to garner much more attention and popularity; you heard it here first, folks!    MachoDan's Bottom Line:   Tomato Jones gets a 50% or 'D' rating.  (A+) Hot and bothered (A) Bother (B) Bother as soon as it’s on sale  (C) Bother only if you like the genre    (D) Bother only if you really like the genre   (E) Don’t bother (F) Bother your state representatives with a letter complaining about the existence of this game   -- Thanks for taking the time to read my review! If you liked it, please let me know by clicking the ol' thumbs up button. If you didn't like it feel free to do the opposite. Either way I'd love to hear your feedback in the comments. To read more quality reviews check my profile! Thanks again.",
            "review_score": "1"
        },
        {
            "review_text": "Edit: 8/3/16 Load times have been drastically shortened and is better optimized, which definitely improves the game! Still worth buying, even without the 2% discount!  Original review: Tomato Jones is a simple platformer with a funny theme. It's amusing for what it's worth. Unfortuntely, it's also poorly optimized. While the game hasn't crashed yet, poor frame rates, long load times, and camera issues definitely bring the whole experience down. 7/10 Get it while it's 2% off!",
            "review_score": "1"
        },
        {
            "review_text": "It is defenatly a good platformer although it has some issues.  Pros:  - I like the cluncy controls (curz it's a tomato, It should be cluncy)  - Good platforming  - thoughtout level design  Cons:  - I'd like an option to manualy toggle the camera.  - sometimes I fall off the platform and I have to reload the last checkpoint in the menu so I can contunue playing.  - I hate the load when you die.  - the cons you collect are useless as far as I know.",
            "review_score": "1"
        },
        {
            "review_text": "omg this is the best game ever move over Call of Duty and Halo this is the new hot seller that kids will want at christmas",
            "review_score": "1"
        },
        {
            "review_text": "It's a great game about tomatos...... Thats about it.   (its a fun one for streaming)",
            "review_score": "1"
        }
    ]
}