{
    "app_id": 499540,
    "name": "Wake Up",
    "release_date": "2016-08-09",
    "developer": [
        "Black Cell OG"
    ],
    "publisher": [
        "Black Cell OG"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Free to Play"
    ],
    "achievements": 6,
    "positive_ratings": 67,
    "negative_ratings": 12,
    "price": 0.0,
    "description": "Experience a shattered and surreal dream filled with fascinating riddles, where your only guide is an elusive butterfly. Can you make the journey and wake up?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/499540/header.jpg?t=1470902171",
    "minimum_requirements": "OS: Windows 7 Processor: Intel i5-4590 &amp; AMD 8350 Memory: 8 GB RAM Graphics: GTX970, AMD Radeon R9 290 DirectX: Version 11",
    "recommended_requirements": "OS: Windows 10 Processor: Intel® Core™ i7 4790 Memory: 8 GB RAM Graphics: GeForce® GTX 980 DirectX: Version 11",
    "reviews": [
        {
            "review_text": "Interesting puzzles, neat aesthetics, and really awesome sound.  And it's free, so if you have VR, check it out!",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic little experience. I would defintely have paid a dollar or two to play. I hope to see a more robust experience by this team in the future!",
            "review_score": "1"
        },
        {
            "review_text": "Interesting and well put together experience.  The puzzles could have been a bit more consistantly presented some felt like random trial and error and other seemed too obvious.  For free, recommended.",
            "review_score": "1"
        },
        {
            "review_text": " Wake Up  is a short, first-person puzzle game for the Vive.  The player explores a set of areas, using only (sometimes  extremely  subtle) environmental cues to determine how to manipulate her surroundings in order to progress.  The puzzles were interesting and fairly unique - definitely a worthwhile use of a half hour.",
            "review_score": "1"
        }
    ]
}