{
    "app_id": 500,
    "name": "Left 4 Dead",
    "release_date": "2008-11-17",
    "developer": [
        "Valve"
    ],
    "publisher": [
        "Valve"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Steam Achievements",
        "Full controller support",
        "Captions available",
        "Steam Cloud",
        "Valve Anti-Cheat enabled",
        "Stats",
        "Steam Leaderboards",
        "Includes Source SDK",
        "Commentary available"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Zombies",
        "Co-op",
        "FPS"
    ],
    "achievements": 73,
    "positive_ratings": 17951,
    "negative_ratings": 948,
    "price": 7.19,
    "description": "From Valve (the creators of Counter-Strike, Half-Life and more) comes Left 4 Dead, a co-op action horror game for the PC and Xbox 360 that casts up to four players in an epic struggle for survival against swarming zombie hordes and terrifying mutant monsters.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/500/header.jpg?t=1517005754",
    "minimum_requirements": "Supported OS: Windows® 7 32/64-bit / Vista 32/64 / XP                     Processor: Pentium 4 3.0GHz                      Memory: 1 GB                     Graphics: 128 MB, Shader model 2.0, ATI 9600, NVidia 6600 or better                      Hard Drive: At least 7.5 GB of free space                     Sound Card: DirectX 9.0c compatible sound card",
    "recommended_requirements": "Supported OS: Windows® 7 32/64-bit / Vista 32/64 / XP                     Processor: Intel core 2 duo 2.4GHz                     Memory: 1 GB                      Graphics: Shader model 3.0, NVidia 7600, ATI X1600 or better",
    "reviews": [
        {
            "review_text": "One of my favourite games ever. You and three friends will battles against hordes of 'infected' or perhaps become the vanguard of those infected to wreak terror and death on survivors as the 'sepcial infected'. This game prioritizes team work over twitch skills and is a great game for people who like to play with a dedicated group of friends.  I have not played for a few years and when I left the game was more geared for hard core players when compared to it's successor, Left 4 Dead 2. From a cursory look this still seems to be true. A great game, but for beginners I might actually suggest playing Left 4 Dead 2 first, and then perhaps trying the first game once you are a little more skilled. Getting quad capped by people will 5000 hours in game might not be your best first expereince of the game :)    HOURS ON RECORD : I don't play this game on my public account. I have over 400 hours played in Left4Dead 1 and 1500+ in Left4Dead 2 on my private account.",
            "review_score": "1"
        },
        {
            "review_text": "Left 4 Dead is a first-person shooter game, an apocalypse survival game from Valve. The game is a zombie apocalypse game where you play as one of four survivors trying to get themselves to safety. These survivors are Bill, Zoey, Francis and Louis. They're trying to get themselves to safety as their story began two weeks after the infection. They themselves are immune to this virus while thousands of people already become hungry undead.  The gameplay is almost similar to any Valve game, you can play up to 4 players with friends or people from the internet and play together. The zombies in this game are also unique, you won't just meet regular zombies, there are special infected that has many special abilities which can get you some troubles. Hunters for example, likes to leap and then pinned the survivors by surprise. The most fearsome infected could be the tank or the witch, they are the worst. Witch can take you down with only single attack despite her pity appearance. Weapons are quite good here, there are pump-action shotgun, dual pistols, submachine gun, assault rifle or hunting rifle. If you're overwhelmed, simply toss a pipe bomb and that thing will attract zombies from you and then blow them up.  Graphics of Left 4 Dead is quite decent and impressive. The Source Engine has again prove its worthiness. Explosion effects, gore and blood effects, the sounds and the environment are all impressive, including the amazing ragdoll effects which makes the environment more chaotic. And still, the game runs pretty stable and smooth.  Overall, Left 4 Dead is a good game to play with friends. I recommend this.  + Cooperative play. + Good choice of weapons. + Good graphics, engine and physics. + Many variety of zombies.  - AI team still not very improved. - Harder difficulty is too hard.  Rating 8/10",
            "review_score": "1"
        },
        {
            "review_text": "I don't know what to say, this game brought me here. A gr8 example of using the game's full potential. Give a chance to the classic, now that it's cheap, see how it all started or just pay your respect to Valve. I loved it, I still do and I always will. No number can rate this, it's a heart-case for me.",
            "review_score": "1"
        },
        {
            "review_text": "There are such games which don't differ an interesting plot or a gameplay, but remain in the hearts of players on long and for many years. One of the brightest representatives of such peculiar exception to the rules - Left 4 Dead shooter from the Valve company. All game consists of four (a standard set) big missions which are subdivided into five collateral. Everyone begins and comes to an end in special shelter where players can take breath. Any the check points on a course of passing of collateral missions - lost - be so kind as since the beginning. It adds also a headache and the aggressive drive, especially when you play on the maximum complexity, and opponents, well very strong and cunning. In such rooms always there is an opportunity to dolly up wounds, to take the new weapon, to fill up quantity of cartridges or to take a bomb with Molotov's cocktail. Here such here game)) (This my opinion and it can not coincide with yours).",
            "review_score": "1"
        },
        {
            "review_text": "This game has ruined my life.",
            "review_score": "1"
        },
        {
            "review_text": "Main differences between L4D and L4D2:  1. You can see your character's legs. 2. Shotguns have 128 shells in reserve. 3. Survivors ragdoll upon death.  These are the only reasons to play the original.",
            "review_score": "1"
        },
        {
            "review_text": "Left 4 Dead is a co-op, first-person shooter video game, with survival horror elements thrown into the mix. Just like Castle Crashers, this game is for that special friendship group, composed of four friends. With this game, you will find a bounty of endless fun, especially when setting the game's difficulty to an all-time high, as it really gives you that experience of being an endangered species, with the more stronger zombies wanting you dead, thus extinct. From my point of view, you can already tell I hold this game in high regard. Probably due to the fact it  is  developed by Valve.  The story takes place in an unamed location, within Pennsylvania. A highly contagious virus known as th ''Green Flu'' swarms the state, causing heavy mutation to human body cells and brain functions, resulting in the loss of humanity, meaning yes, the birth of zombies.   Two weeks after the infectious outbreak, four survivors, William ''Bill'' Overbeck, a bold, Vietnam veteran; Zoey, a sassy college student; Louis, an optimistic IT technician, and Francis, an aggressive outlaw biker, the four heroes of this game make their way through perilous cities, discovering along the way that the virus is causing more dangerous mutations. On a side note, the story of this game is split into campaigns, going in chronological order from top to bottom and progressively, the story is carried out on to the games sequel.  The player takes control of one of the four survivors; only if human players are not involved, thus the survivors are controlled by the CPU. The main objection of the game is to reach the safehouse after each level of the campaign.   Beware to watch out for the special infected. These types of zombies are the strongest of the common infected and if you get incapitated by one, you won't be able to shake them off, but unless one of your fellow survivors lends a helping hand and kills the attacking zombie. So, this just goes to show that teamwork in this game is the key of getting farther and staying progressively stable to continue playing.  Guns and other types of defense and weaponry, (in the shapes of molotovs and first-aid kits) are scattered among the map, usually on different occasions. This mainly happens after holding off an entire zombie horde, where they break through from left, right and centre. All of these weapons that you find are frequently random, but you can stick to the weapon you like the most. Just make sure to search for ammo at a seldom pace, especially if you're playing on a much higher difficulty. When outnumbered, just remember to always keep your health up, along with your teammates, as every chip of HP is precious into reaching the end of your goals.  This game is simply fantastic, but is usually overshadowed by its sequel, Left 4 Dead 2; possibly due to the inclusion of all campaigns found in this one and carried out in its said sequel. The one thing I personally prefer from this game is the feel of the slightly tighter controls it has when compared to Left 4 Dead 2. I would say this one is for the competitive players and the sequel is for the casual players. Considering you could just mess around, with the Shrek mod and all, and don't tell me you bloody haven't. It's a lot of fun and of course, the modding community adds to Left 4 Dead 2's advantage, much to this games' disadvantage.  In closing, I definitely recommend this game to all who are fans of survival horror video games and those itching to test their own determination and teamwork with one another. If you have have the sequel, I would still recommend getting this first game, just for its originality and or the fact you can add it to your godly Valve collection.",
            "review_score": "1"
        },
        {
            "review_text": "This game is the reason why I have Steam installed in my pc.",
            "review_score": "1"
        },
        {
            "review_text": "I'm not sorry! I just wanna thank all of my first friends on steam! Thank you so much for being with me all this time. You're brilliant. But now... Farewell time. As it says-everything eventually will end. Has this game gone for me? No. But I anyway gotta stop here and move forward. This time on my own! My story is done. Right here,right now. L4D is a real masterpiece! My dear friends,you are all here &lt;3!  I won't forget you! Hope to see all of you in the future!:) Good bye,left 4 dead...",
            "review_score": "1"
        },
        {
            "review_text": "Old but gold",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "Left 4 Great",
            "review_score": "1"
        },
        {
            "review_text": " The  benchmark zombie shooter.  Fun solo; even better with friends.  - Skinny from the Fat B*stard  (curator link) ",
            "review_score": "1"
        },
        {
            "review_text": "  The best game ever made. A friend of mine gifted it to me and now I love it. I have its second counterpart too. Both of them are awesome! You should check them out :D",
            "review_score": "1"
        },
        {
            "review_text": "As of this review, this game is 8 years old, and is still as amazing as it was when it released. I played this game for years on my Xbox 360 before I finally got it on Steam when I got my first computer a year ago. It's a shame I missed out on how much better this game is on PC, graphics and game play wise. Great game for friends.  Sidenote: All the maps from L4D are avaliable on the Steam port of L4D2, which I did not read anywhere before I bought this game, so I would not bother purchasing this game due to its improved counterpart, Left 4 Dead 2.",
            "review_score": "1"
        },
        {
            "review_text": "This was one of the funniest concepts ever, too bad it only lasted 1 year.",
            "review_score": "1"
        },
        {
            "review_text": "This... Game... Is... ♥♥♥♥ing... INSANE!!!  For Valve, it was no surprise that they would soon come out with a game like this because they had already made half-life with zombies so why not a game series based a zombie breakout that covers the story of a team of survivors that are immune to the hell of a disease that makes the dead come back to life and turn more of the living into them. GET THIS GAME AND IT'S SEQUEL.",
            "review_score": "1"
        },
        {
            "review_text": "The original Left 4 Dead was much superior to Left 4 Dead 2 in terms of stability and gameplay. Too bad Valve wants this game to rot, now. There are no official dedicated servers, the third party servers run like ♥♥♥♥ (you'd be better off on a local server), and only an average of about 700 people play (There are only about 9 open lobbies for the entire game itself, including all game modes).  Yes, I am aware that all of L4D1's content was ported to L4D2. That could be the reason why the original Left 4 Dead is 'left for dead'. BUT IT'S NOT THE SAME. Left 4 Dead 2 will never be as good or as better as the original.  It's strange how Valve can advertise the ♥♥♥♥ out of a game, then completely forget about it a few years later. The game isn't strong and popular as it used to be, but it still holds a strong position in my heart.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "you kill zombies and kill more zombies and more zombies and more zombies and more zombies and more zombies and more zombies and more zombies and more zombies and more zombies and more zombies and more zombies and more zombies and more zombies and more zombies and more zombies and more zombies and more zombies and more zombies and more zombies and more zombies and more zombies and more zombies and more zombies and more zombies and more zombies and more zombies and more zombies and more zombies and more zombies and more zombies and more zombies and more zombies and more zombies and more zombies and more zombies and more zombies and more zombies and more zombies and more zombies and more zombies and more zombies and more zombies and more zombies and more zombies and more zombies and more zombies and more zombies and more zombies and more zombies and help teamplayers and kill them 10/10 i need more zombies IGN",
            "review_score": "1"
        },
        {
            "review_text": "I owned the Xbox 360 version of L4D first. However, this version is the best! Read to the end to find out why.  Night of The Living Dead meets 28 Days Later... what more could you ask for?  Everything you've heard about Left 4 Dead is true. It's a great game, and while there's enough action and excitement to enjoy the single player campaign, this is mostly about the instant and gratifying co-op multiplayer that you can get out of it. Playing with friends is a blast, but playing with complete strangers can also be a barrel of laughs. Yes your co-op partners can make the gameplay more difficult for you, but to this day there is no end to the amount players that are still playing this timeless classic of an Zombie / Action / First Person Shooter.   Some things to know:  * Left 4 Dead has a fun campaign which can be played alone but is most entertaining when it is played with others. * The story is bare-bones, and each campaign ends with a rather short bookend, but each chapter is it's own action adventure. * While the story might be light depth and content, the game is presented in a very B-Movie Hollywood schlock fashion that should appeal greatly to classic and modern Zombie movie fans, but also first person action fans as well. * Every time you play Left 4 Dead things may play out entirely differently than last time, this is especially true and adds almost endless replay value when playing with numerous different people including randomly encountered gamers. ** Left 4 Dead is regularly modded by the player community and provides endless hours of entertainment including all new ways to play the game. This is why the Console verison cannot really hold a candle compared to the Steam version of the game.  I could go on and on about the game, but I think that Left 4 Dead has been reviewed by enough people that it isn't necessary. I just figured I'd give my two cents and perhaps encourage anyone who still hasn't had a chance to enjoy this excellent action zombie horror game. Here's the most helpful tip I can give you: If you're a Zombie movie fan but don't own Left 4 Dead on PC, or World War Z on Blue Ray or DVD, then buy L4D and forget all about World War Z (and go read the book instead, cuz the movie sucked!)",
            "review_score": "1"
        },
        {
            "review_text": "Left4Dead 1:  Release Date: November 17, 2008  Strengths: -Originality -Good graphics -Extermely good level design and gameplay -No delays, instant action -Great replayability because of random generation of zombies each time -Great story and characters -Good sound and voice acting -Sense of survival is awsome when all your teammates are dead and you are left alone   Limitations: -Low number of weapons -Limited DLC and maps   Conclusion: L4D1 is truely revolutionary and a masterpiece game that rightly earned it numerous awards by various game reviewers including 'game of the year'. What I like about this game is its originality, detailed and thoughtful level design, good story and characters (My favourites Bill&gt;Zoey&gt;Francis&gt;Louis), nice music, sound and voice acting. Still better than Left4Dead 2 in my opinion. Highly Recommended.  Level Design: 10/10 Music and Sound: 9/10 Gameplay: 10/10 Story: 10/10 Graphics: 9/10 Replayability: 9/10  My rating is 9.5.  -High2k",
            "review_score": "1"
        },
        {
            "review_text": ".....It's left 4 dead",
            "review_score": "1"
        },
        {
            "review_text": "Nothing else than a masterpiece, but what else to expect from VALVe? Left 4 Dead was the flagship of the zombie apocalypse genre. With a fairly interesting story-line, as interesting as it can get when zombies are trying to eat you. The game is split up into episodes, or movies, where the four protagonists make their way through all imaginable zombie infested areas.  I think Left 4 Dead didn't start the zombie culture, as there were books much earlier, but the game obviously did a great part of magnifying the genre, not only for games but for movies and TV-shows as well. The game has a lot of gore and darkness flowing through it, and I remember being terrified in my first play-through of the game. Looking back - this game didn't have a long lifetime, not as it's 'competitor' Killing Floor, that is still kicking.  Valve kind of screwed Left 4 Dead over with Left 4 Dead 2 being released only a year after the original. The sequel wasn't even close to having the same atmosphere as it's predecessor, with all that darkness and grain film filter. Valve later ported over the whole Left 4 Dead into the sequel, which gives no reason to play the first game at all, which is very saddening, indeed.",
            "review_score": "1"
        },
        {
            "review_text": "This game is awsome but it's better to buy Left 4 Dead 2, because l4d2 comes with L4D1 and 2! AWSOME! THis game alone is 8/10! But buying any L4D game, get it on sale. U HAVE BEEN WAARNED",
            "review_score": "-1"
        },
        {
            "review_text": "I remember being sooo hyped for this game when it came out. The game consist of 4 special zombies including a tank,smoker, hunter, and a boomer. The game has around 5 chapters and each chapter has about 5 parts to each chapter. The game is addicting and really fun.. If you get left 4 dead 2 you will get all of left 4 dead 1 maps on that game.. So why would you buy left 4 dead? Ill tell you. On left 4 dead 2 you deal with new special zombies jockeys, spitter, and charger. These special zombies are really annoying in 2. Also in left 4 dead their are no melee weapons.  I recommend left 4 dead whenever it goes on sale in a bundle. Game is totally worth it and there is no steam workshop on the game, but their are some amazing mods to the game!!  ",
            "review_score": "1"
        },
        {
            "review_text": "I have played pretty much every zombie game out there and RE4 and Left 4 Dead are the two best ones. The only problem is that Easy, Regular, and Advanced are cake and Expert requires intense and well used team work.  This game is so much fun online and I plan to play it for more months to come.",
            "review_score": "1"
        },
        {
            "review_text": "If you don't have Left 4 Dead and you're a fan of any kind of zombie-apocalyptic type of game, you're missing out one of the best experiences ever. This game has satisfied the thirst of any zombie-killing fan out there. There are even modes to play as zombies where you are special infected and you can attack the survivors with your team mates. A must-have!",
            "review_score": "1"
        },
        {
            "review_text": "Better than L4D2. Cleaner, Simpler, Less Confusing. Level design is better, zombies aren't throwing cheap shots, and you don't have to walk 50 miles to finsih each little map. In general a better experience.",
            "review_score": "1"
        },
        {
            "review_text": "classic old fashioned multiplayer fun!!!",
            "review_score": "1"
        },
        {
            "review_text": "I really like this game but i would recommend buying the second game. You ask your self why ? Well let me tell you why : -more maps some new some from the first -more special infected :O yes this is the game with the freak little zombie rider JOCKEY -and yes even more black humans ",
            "review_score": "1"
        },
        {
            "review_text": "Left 4 Dead is a great single player/multiplayer FPS with zombies.  It's fun with friends or solo. L4D has multiple enemy types and a great deal of entertaining character banter during play.  I HIGHLY recommend this game to anyone on sale or off.",
            "review_score": "1"
        },
        {
            "review_text": "Very crazy and awesome game.All musthave.",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun, and real fun online if you have friends and you want to play and your bored this is a goo game.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game and even more fun when playing with your friends. Versus mode is awesome. Being able to be an infected killing the survivors or being the survivors killing of the infected with a team is very fun. Communication is key in this game. Without communication you will find it a small bit difficult to do things with your teammates online. All in all it is a fantastice game.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 learn to play hunter",
            "review_score": "1"
        },
        {
            "review_text": "This Game is Fun Looking for Shooters Action Gore? this Game is Awesome!",
            "review_score": "1"
        },
        {
            "review_text": "Best game to just chill and play with friends. It's simple yet the various addons make it interesting to play everyday.",
            "review_score": "1"
        },
        {
            "review_text": "The game based on zombie style and players corpration online with nice NPC AI. This game is my first game bought by Steam online store since 11/2009. You can't behind it, you must to have it due to it's a classic great game.",
            "review_score": "1"
        },
        {
            "review_text": "I loved this game when I first saw it, and when I got to play it for the first time, I honestly couldn't put it down. It's best played with friends, as the game focuses a lot on teamwork.  Though with coop, there will naturally be pvp, or just friends being an a** for the fun of it, but even so it makes it even more 'interesting'.  The game looks good, has a decent difficulty and is a fun to play game. I definitely recommend it to you zombie fans out there!",
            "review_score": "1"
        },
        {
            "review_text": "Good Game but they should of added more campaigns and more modes but the rest was fine.",
            "review_score": "1"
        },
        {
            "review_text": "A totally incredible piece of art..If you like zombie games, this is the perfect choice for you.",
            "review_score": "1"
        },
        {
            "review_text": "Pharmaceutical catastrophe meets violent virus outbreak.  Take your  dose  pills and prepare for your own, deeply personal, zombie apocalypse.   10/10 : would take pills and smoke again.",
            "review_score": "1"
        },
        {
            "review_text": "they got it all right",
            "review_score": "1"
        },
        {
            "review_text": "Good for killing braincells and curing insomnia, aslong as you've played more than 400 hours of it.",
            "review_score": "1"
        },
        {
            "review_text": "When playing this game cooperatively with your friends it is just about one of the most fun COOP games I have every played.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best zombie shooter co-op game. I'm not even a big fan of zombie movie but this game has something special in it. It's the atmosphere that keeps you playing. It almost feels like you're in a post apocalyptic world for real. Non-stop action mixed with some humor can offer countless hours of fun online. Lost of downloadable custom maps and mods. Graphics are a bit older but zombies and other types of infected look pretty convincing, you will almost want to kill as many zombies as possible no matter how long it takes, for years in my case. Too bad you'll have to stop playing it eventually, when zombies start to appear in real life...  10/10 - few years of fun, if i go... i'll go with a smile",
            "review_score": "1"
        },
        {
            "review_text": "At start, some things about Left 4 Dead. L4D is an awesome game, epic gameplay, graphic, playable characters which are nice, and most important thing - It's a game about zombies !. Yes, i love games with zombies and apocaliptic climate in background. It is a game for everyone who like zombies - Killing like and playing as them. U have 4 playable main characters, which u choose ? It's your decision !. On Versus mode u can play as zombies. U have 5 zombie 'Bosses' which 4 are playable. 3 are random everyime and 1 - Called Tank - choosed for any player in infected team. All is random.  Then now i choose good and bad atributes of L4D.  Good Sites: +Great climate. +Best Multiplayer Mode focused on teamplay. +Two sites in Multi. +ZOMBIES !. +Some effective weapons. +AI are good. +Play with friends !. +Much Campaigns, u can download more if u want.  Bad Sites: -Not much weapons. -Some bugs. -Not open world. U just have to go from 1 point to 2nd point... -Valve forgot about it some time ago, and do not want make any patches / Bux fixes for it anymore.  I look on hours played too. I have around 4,500 so it's great game -for me- and i will stay with her for long time. I hope L4D never die.    9,5/10",
            "review_score": "1"
        },
        {
            "review_text": "Bringing 3 friends in and cooperating through the game at full will easily show you why 4 player co-op shooters are a popular genre. This game codified, nailed and perfected the idea of cooperative shooter well before anyone else did, often outdoing its later competition. Even compared to Left 4 Dead 2, the gameplay is squared off and honed into a fine, focused point that simply can't be outdone.",
            "review_score": "1"
        },
        {
            "review_text": "Wasted most of my teen years competing in this game. Won't regret a single hour.",
            "review_score": "1"
        },
        {
            "review_text": "It is as good as Dying Light and Counter-Strike combined. Bring your friends and get ready to have a hell of a time shooting zombies!",
            "review_score": "1"
        },
        {
            "review_text": "This game is really fun with a group of friend or public mostly you can derp around and laugh your ♥♥♥ off to some bugs and infecyted dying a certain way. This game should not be forgotten",
            "review_score": "1"
        },
        {
            "review_text": "Left 4 Dead, GO BUY IT ♥♥♥♥♥♥♥ OR I KILL YOU!!! ",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, still fun to play after 6 years of it's original release. Sequel is Great. Do wish that there were more servers to play on.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best FPS games on the market. Don't bother with L4D2, this baby's all you need. ",
            "review_score": "1"
        },
        {
            "review_text": "...",
            "review_score": "1"
        },
        {
            "review_text": "better than l4d2 and its the best zombie game EVER!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "I played this on console for countless hours, so I decided to get this on steam. Needless to say it's just as good and since it's a PC game it has better graphics.",
            "review_score": "1"
        },
        {
            "review_text": "pills here",
            "review_score": "1"
        },
        {
            "review_text": "The best co-op from valve",
            "review_score": "1"
        },
        {
            "review_text": "Best game steam has to offer, sadly though not enough players like the good old days. Still an excent zombie shooter, by far the best zombie game out there. Would rate 6 Stars out of 5",
            "review_score": "1"
        },
        {
            "review_text": "I never really played any co-op, zombie or fps games before I tried this..... And so this is the game that caused my downward spiral into the world of slaugtering zombies, and soon anything running past my gun in many fps and coop games.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of my all time favorite games and probably the one game i can always come back to just relax and have fun killing zombies. There's only 5 campaigns which have high replayability but when you throw addon campaigns into the equation it becomes nearly endless. This game is best when it's played with a few friends because thats usually when the weird and hilarious stuff starts happening.",
            "review_score": "1"
        },
        {
            "review_text": "Perfect!",
            "review_score": "1"
        },
        {
            "review_text": "I would defiantly recommend this game, lots of blood, Love the characters and the special infected, Also love to have fun with the console commands with friends!    pros   -console commands -zombies  -comedy  -pills -versus mode -being able to play as a zombie -funny glitches   mixed   -the bots   cons  horrible community",
            "review_score": "1"
        },
        {
            "review_text": "The best.",
            "review_score": "1"
        },
        {
            "review_text": "I got kicked in Versus just for saving my teammates. 10/10 Left4Kick",
            "review_score": "1"
        },
        {
            "review_text": "Forever a must play...  (All my own opinions/experiences/joys)  As an avid fan of zombie games, I can honestly say this is the one I have enjoyed the most!  Once you've got your sensitivity set, you're set to take on the hordes of seemingly endless zombies, alongside your three friends (don't take it personally when they shoot you in the back, they're probably just trying to shoot the zombie that's about to swipe at you). I highly recommend getting up to three other people on board that you can speak to via headset. I say this due to the fact (and you may be surprised how often this occurs) they may not realise that you've been pounced on by a hunter, pulled away by a smoker or thrown up on by a boomer (...thus resulting in being molested by a horde of horny zombies, that want to rip your clothes off) and you will end up typing things like “jyghk!!!11!” in the chat, just to be abandoned, angry, on the ground, bleeding out, shooting wildly into the crowd of gropers around you.  So in short, get a headset... (And some friends)  After getting into the swing of sticking together and (although you may hate it) helping out your teammates, picking them up when they go down and parting with your precious pills to prolong their lives, you will become a pro. You'll be running the Expert level campaigns, crowning witches, burning tanks, sniping hunters in the face mid jump, generally winning at the game.  Versus is another story... A lot of fun, however it's hard to find a normal server these days, so you'll be thrown into a 20 vs 20 game which is both hilariously fun and rage quittingly frustrating. So again, private games with friends trumps crazy hacker filled custom servers.  From playing Left 4 Dead for nights on end on the Xbox 360 with my buddy (MrSneakyMan), listening to Rammstein in order to pump ourselves up to fight the horde, to finally downloading it on PC and pouring even more hours into it. I still keep coming back to this game, sometimes for a quick versus match, other times to replay entire campaigns with the strangers of the internet (yeah, you...).  Just buy it... :)",
            "review_score": "1"
        },
        {
            "review_text": "If you don't have this game why do you have a steam account?",
            "review_score": "1"
        },
        {
            "review_text": "Here's a little story, one day I was just sitting down casually playing Left 4 Dead until I got into a lobby that had 2 elitists and 1 noob. 10 minutes into the gameplay, I accidently shot one of my teamates(one of the elitist) and I apologized for shooting him. In return, he kills me and spawn traps me continuously until he died. The level restarted and I brought it upon myself to get revenge. I killed him and both him and his butt buddy decided to kick me just for simply getting revenge. If you ever run into these type of people just report them and leave. Overall the game is pretty darn good. The community is 'eh' it has good sports that don't get mad just because you accidently shoot them, and bad sports that get mad just because you accidently shot them once.  I rate this game 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Awsome",
            "review_score": "1"
        },
        {
            "review_text": "Ok game i guess. Also typing this because steam badges are nice.",
            "review_score": "1"
        },
        {
            "review_text": "Best game of all time!",
            "review_score": "1"
        },
        {
            "review_text": "Zombie-em-up that doesn't smell like a hospital. Pure multiplayer delight.",
            "review_score": "1"
        },
        {
            "review_text": "Spent many hours making friends, this game is amazing for the teamwork involved.",
            "review_score": "1"
        },
        {
            "review_text": "Ahhhh.... I felt like they really relied too heavily on zombies for a story.",
            "review_score": "1"
        },
        {
            "review_text": "Honestly the game with more replay value than any other. My personal favorite co-op zombie game of all time. Most likely the best in my inventory. Well Half-Life is great too but nothing beats palying LFD with friends and blasting zombies. An unbelievably full and rich gaming experience that will have you learning, trying, and doing more things in a video game for years and years. Never will you get tired of this one. 10 stars way up!",
            "review_score": "1"
        },
        {
            "review_text": "This game took a simple idea from counter strike and made an amazing game out of it. What an incredible game.",
            "review_score": "1"
        },
        {
            "review_text": "Combine cooperative gameplay with survival/horror FPS genre, and you get this! One of the best games ever made!",
            "review_score": "1"
        },
        {
            "review_text": "My favourite multiplayer game ever. Cannot recommend highly enough.",
            "review_score": "1"
        },
        {
            "review_text": "8/10  I love this game alot, I have played it quite a bit. But there is what I find a really big problem. There are no Mele wepons like in the 2nd game.  Appart from that a real good game :)",
            "review_score": "1"
        },
        {
            "review_text": "Good classic game original characters, big scaled maps. Good shoot and loot",
            "review_score": "1"
        },
        {
            "review_text": "I have nothing better to do.",
            "review_score": "1"
        },
        {
            "review_text": "Arguably jive",
            "review_score": "1"
        },
        {
            "review_text": "did the reveiws backwards and did left4dead2 first, but it's pretty much the same as that one. so  10/10gameplay 7/10 sound 7/10 graphics  10/10 would recommend to any zombie lover. ( might want to add some friends from a L4D community before finding a multiplayer match ) .",
            "review_score": "1"
        },
        {
            "review_text": "Best Teambased Horror Action FPS ever made!",
            "review_score": "1"
        },
        {
            "review_text": "so much fun especially with 3 other friends, makes that game 100% must have. even if it gets older, itll be very good multiplayer game for long time ;)",
            "review_score": "1"
        },
        {
            "review_text": "An amazing co-op FPS servival horror game with a really active community even in 2015. A must buy game to play with friends.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "my bad......found out that the dlcs automatically come with the game, which makes it even BETTER",
            "review_score": "1"
        },
        {
            "review_text": "It's good but Left 4 Dead 2 is an improvement in every way on its dad and the maps in this one are all playable in the second.",
            "review_score": "1"
        },
        {
            "review_text": "Arguably the best FPS for its year. L4D is one of those games that punishes you if you try to be a lone wolf and go out by yourself. In fact, one of the many strengths of this game is that you live or die by your team and the weakest teammate can even be a liability (because you're always saving them or they're not covering their corners or they're using all the team healing resources up). No matter how good you are at this game you can still get capped by a Special (i.e. something tougher than a zombie) and the only way to be saved is by one of your teammates. Additionally, it's almost impossible to do the finales by yourself (especially on any difficulties above normal) so, again, I like that the team is vital to the success of the mission. Weapon selections are tiered as you progress through the campaigns (which vary in length from half an hour to many hours, especially if you die and keep repeating chapters) and there are nice goodies to help you against the zombie hordes such as Molotov Cocktails, pipe bombs, gas cans, propane tanks, oxygen tanks but none of these matter much if you don't follow one of the cardinal rules of positioning yourself strategically.   This is a game that also rewards you for positioning your team in the most strategic positions when you are attacked by random zombie hordes or at various chapter finales. In fact, if you aren't very good at protecting your teammates and putting your back to a solid wall when the hordes come, well, you probably shouldn't be playing on advanced difficulty and certainly not the unforgiving expert level. Healing resources are limited to health packs and pills and in the higher difficulties there's never enough. In fact, sometimes it makes sense to let a few teammates die so that the others can make it to the safe house chapter where everyone who died spawns for the next chapter. That way, you don't all have to die and repeat the chapter. If someone died soon enough in a particular chapter they respawn in one of the many closets up ahead but a teammate has to 'rescue' you. Spawned characters start at moderate health and lose some of their resources, especially a favorite main weapon.  But the real pleasure of this game is the multiplayer. In fact, if you don't MP your gaming experience may dwindle after a time. Yes, it's true that the director of this game changes elements even if you play the same campaign over and over with the bots but the dynamics of playing with real people and not just bots throws in so many variables. Weaker players will make the campaign harder and sometimes that can be fun. Stronger players will make it easier and they'll also show you tricks that you're unlikely to read in the cheat books. In fact, chances are good that you'll start to have favorites that you like to play with regularly and as you get to know your particular team better you will react better to them when they need help. Compare that to when you play with new people for the first time, even if you all have microphones for faster communication.   Other nice things about MP (at least, on Steam which is my experience) is that you can do different types of coop scenarios that fans have created. They're free to download. If you're tired of the same maps this can be a lot of fun. Additionally, if you want something different they have survival games in which a group holds out for as long as possible but the real attraction, if you want something different, is the versus games. Each side takes turns playing the Specials and try to stop the other team from reaching the safe house. Victory points are all determined by how far the survivors have gotten, how much damage was inflicted on them, whether health packs were used or not and several other variables. Interestingly, people who are very good at coop games are usually not very good at versus games as its a totally different beast.  SOME OF THE BAD/CRITICISMS: the AI, compared to L4D2, is sometimes slow to respond. They don't always save you in time when they should and they won't always help you defend at unique positions during chapter finales; some argue a lack of melee weapons is a problem but I think it's not an issue and just makes it a different type of strategy game. In MP you can get some real low quality people showing up in the public rooms but a nice thing is that a majority of people in agreement can kick the bad player out of the game. Worse case scenario you just leave and look for another game.  In closing this is an awesome game for FPS fans, especially if you want an action horror video game.   Unlike a lot of other video games the achievements are unique and sometimes entertaining. A nice thing about them is that you get to show them off to your friends on Steam. These days I typically look to whether a particular player has achieved the expert status achievement. If they have then I know they're likely going to be a tight player.BTW, playing this on Steam and other multiplayer sites make this a lot harder than your Xbox. A couple of friends who played it on the Xbox jumped on to Steam with me and couldn't even handle normal difficulty until they practiced some. Just a fair warning.  MUSIC/SOUND: A minus ; EASE OF CONTROLS/USES: A minus to A ; GRAPHICS FOR ITS YEAR: A; DIALOGUE/VOICE ACTING/CHARACTERS: B to B plus (even though it's limited as to be expected for a FPS); ATMOSPHERE: A to A plus; REPLAY POTENTIAL A to A plus (on MP); GENRE: Horror Action Adventure; OVERALL GRADE: A minus to A.",
            "review_score": "1"
        },
        {
            "review_text": "it's cool game. I recommend it for all/",
            "review_score": "1"
        },
        {
            "review_text": "Great! 100% I suggest you buy this game! P.S. i do like it better than Left 4 Dead 2",
            "review_score": "1"
        },
        {
            "review_text": "I love this game very much. In some ways i prefer it to L4D2.. I can see my feet, there aren't 3 million melee weapons and the atmosphere feels so much darker and grittier. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Well, this game follows a simple rule: be one of those Boomers or die covered in vomit.",
            "review_score": "1"
        },
        {
            "review_text": " The original, and still the best game of the series",
            "review_score": "1"
        },
        {
            "review_text": "A Game that should be played by everyone if you don't own then you haven't experienced life this game heals cancer and the common cold the more people who buy it the longer people live so I say buy it or die at 23 years of age its your choice.",
            "review_score": "1"
        },
        {
            "review_text": "The best game i ever played l4d is a must buy better then the 2nd l4d. Coop is the main thing in l4d to survive you need team work and in l4d without a team you will die a great zombie game i still love it even know i had it since it come out.  +Buy +Buy  And +Buy",
            "review_score": "1"
        },
        {
            "review_text": "Most multiplayer cooperative games require all players to be more or less in the same level. Left 4 Dead breaks the rule, allowing a less skilled player to nevertheless tag along and be helpful.",
            "review_score": "1"
        },
        {
            "review_text": "I got this game recently.... AND I ABSOLUTELY LOVE IT.",
            "review_score": "1"
        },
        {
            "review_text": "lol zombie fun! fun game to have if u wanna show off ur inner pyro!!",
            "review_score": "1"
        },
        {
            "review_text": "the good old Left 4 Dead! is there any better co-op zombie game?",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely love this game! Graphics are faily nice, controls are simple and its great for groups! :D",
            "review_score": "1"
        },
        {
            "review_text": "Great game, but it's time for L4D3, bring it on!",
            "review_score": "1"
        },
        {
            "review_text": "funny game to play with friends.",
            "review_score": "1"
        },
        {
            "review_text": "The people in this game are cool guys.They kill aliens and doent afraid of anything. Actually they kill zombies. This game is fantastic with friends. If you have at least 3 other friends and you love zombies this game is perfect, but i'd look into getting its sequel instead. It has workshop support and all the original L4D maps.",
            "review_score": "1"
        },
        {
            "review_text": "Yeah so i picked this ♥♥♥♥ up on reccomendation from my ♥♥♥♥♥ eyeball so me and him decide to do lots of drugs and it turns out one of me other friends is a ♥♥♥♥♥♥ and has been hiding a copy of left 4 dead in the woods past the traintracks so me and my ♥♥♥♥♥s hop in a car and go to look for it(haha but not before i kicked they asses in a race) and we get there and a bunch of these kids got there before us so im like 'Yo kid hand over the game' so he calls my mom a ♥♥♥♥♥ and i get really ♥♥♥♥♥♥ and im about to knife the ♥♥♥♥er when his boyfriend pulls out a gun and im like 'ey yo ♥♥♥♥ dat ♥♥♥♥ son' and i walk away like a cool ♥♥♥♥♥♥♥♥♥♥♥♥ and i never got to play left 4 dead but i did ♥♥♥♥ the kids mother good that night",
            "review_score": "1"
        },
        {
            "review_text": "Better than Left 4 Dead 2 gameplay wise. But hella lot more broken with bugs. But the bugs are good. Doesn't have as much content. BUT THIS GAME IS MUCH HARDER THAN LEFT 4 DEAD 2 MY GOD!",
            "review_score": "1"
        },
        {
            "review_text": "This game really tests your friendship..",
            "review_score": "1"
        },
        {
            "review_text": "10/10 best game ever would buy left 4 dead 3 (if it happeneds) ( ͡° ͜ʖ ͡°)",
            "review_score": "1"
        },
        {
            "review_text": "Nice game.",
            "review_score": "1"
        },
        {
            "review_text": "This game doesn't suck",
            "review_score": "1"
        },
        {
            "review_text": "no reason to play this if u can play L4D2",
            "review_score": "1"
        },
        {
            "review_text": "Old but still a damn good game! I love the arcade-like maps. It never gets boring! this game is a must!",
            "review_score": "1"
        },
        {
            "review_text": "just great. evil atmosphere, simplicity but so replayable...",
            "review_score": "1"
        },
        {
            "review_text": "Outstanding cooperative 1st person shooter, based on the kind of running 'infected' zombies from 28 Days Later. Very atmospheric - you will get the occasional fright lol!",
            "review_score": "1"
        },
        {
            "review_text": "Stuck at a hospital/highway/airport/woodland, surrounded by death, zombies, and terror. Hope lies near a distant rooftop/cottage/landing strip/farmhouse. All you have is your legs, a rifle, and some buddies.  Co-op at it's best. ",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best zombie-cooperation game",
            "review_score": "1"
        },
        {
            "review_text": "I've owned this game forever, but only recently started playing it. It's freaking awesome! Like Zombies on COD, but better!",
            "review_score": "1"
        },
        {
            "review_text": "it's one of my favorite games of all time :)",
            "review_score": "1"
        },
        {
            "review_text": "Had to review for achievement.",
            "review_score": "1"
        },
        {
            "review_text": "Going into this game, I expected an average zombie shooter game. This game came out around the time that zombies were really popular I think? I don't know, I heard alot of kids talking about zombies when this game came out and I still hear talk about mostly L4D2 to this very day.  I love this game. As of this review, I may not have a whole lot of time in this game but from my inital completion of the first single-player campaign 'No Mercy', I can tell this is a much more different game than I originally thought due to the cooperative gameplay elements that make this game standout from all other zombie survival games I have seen.  This game is really ♥♥♥♥ing fun, you just straight up murder zombies and it really feels satisfying seeing as how when you kill these zombies, you are in turn helping your teammates avoid a brutal death to a hoarde. Helping these guys out in need kind of makes you feel a little better as a player. This game has more to keep you on your toes than you'd think, you have to watch over your teammates, the guys that are the difference between winning and losing, survival or death because playing this game solo is really no fun at all. It gives this game a unique challenge factor to it that I can't believe wasn't thought of before. It makes the game different, but alot more fun.  Rock on Valve, I almost feel like they can tackle anything and come out with an impressive piece of work. I cannot wait to play L4D2 and try out this game's multiplayer.  I assume however the multiplayer would make this game alot more interesting, seeing as how there are humans playing and not robots. I am looking forward to my first round in multiplayer.  But thats just my silly little review, if you actually read it, what were you doing in that time? You could've spent that time actually buying this game and playing it. Infact, do that now because I have nothing left to say at the moment. I might edit my review once I try out the multiplayer and talk about the community aspect of this game.",
            "review_score": "1"
        },
        {
            "review_text": "Zombies,tanks,boomers,witches,smokers,explosions,pills,and more pills. 10/5",
            "review_score": "1"
        },
        {
            "review_text": "► Game: Left 4 Dead ► Genre: FPS, Action, Zombie-Apocalypse ► Rating: ■ ■ ■ ■ ■ 5/5  ▲ Favorable Aspecps: After watching, in the past 6 years, all that 'boom' of Zombie themed games, specially those where you blow they head off, I can easily assure you that Left 4 Dead, launched in 2008, was one of the biggest responsible for that exponential growth, if not the main responsible. The zombie theme wasn't new at the time, but it never had a solid oportunity at the gaming world, much less in a FPS game. Valve used their best at the time to create this game, and what is it that Valve can't create and automatically become a classic? Well, they did an excelent work again in this title, put extremely easy and soft controls, gave us hordes of zombies to kill, not only weak and rotten zombies, but special ones, with specific abilities, which guarantees different gamestyle, when you're trying to avoid them. Every character has it's own personality, line of words, thinking, and are at some point even funny to hear. For some, that may break some of the tension that the game can produce. Other huge step in the making of this game is the addition of the Cooperative mode, which is undeniable required to survive. Any effort will be useless if you don't have on your side some good mates to release you when get caught by some nasty infected, for example. There are also some other game modes like Versus (player vs player) and Survival (player vs time). Left 4 Dead is that kind of classic that can be played at any time, by any generation, and will always bring you that same joy and fun that you had when you played it by the first time. A real masterpiece. Without a doubt.  ▼ Negative Aspects:  After giving that huge statement in favor of Left 4 Dead, it is hard to point out some minor imperfections, but they always exist. There are two things that I believe they could take better care on this game: the lack of weapons, by that I mean variety, there aren't many different guns to kill, specially melee. And the second is that they didn't launch a lot of official campaigns, or maps. Fortunately, L4D2 came out just one year later.  ► How much is it worth to pay: [●] Full Price [ ] 75% [ ] 50% or Less",
            "review_score": "1"
        },
        {
            "review_text": "Fun with friends - at least at first. OK with randoms.  Still its worth a shot.   This review in memory of deShamus. :) ",
            "review_score": "1"
        },
        {
            "review_text": "Probably still one of the best Coop games. Not much of a Zombieapocalyptic game, if u looking for a story. Also it doesn't transfer the ZA feeling. Therefore the zombies are just too fast and too many. The Community got smaller with time and mostly worse. Barely any players left that play the game for fun instead of insulting other players. All in all I would give the game   5 / 10",
            "review_score": "1"
        },
        {
            "review_text": "Zoey is waifu tier",
            "review_score": "1"
        },
        {
            "review_text": "I remember the days of playing this on console, trying to find groups of people to do the insanely annoying achievements and to complete expert.  One of the best zombie games in existence, this fast and non stop zombie shooter faces you versus untold hordes of infected humans, once alive and like minded, they have succumb to a rage virus, destroying the minds of those infected.  You play 1 of 4 survivors, immune to the rage virus for unknown reasons and must survive the thousands of mindless 'undead' and the special infected, humans that have undergone odd and dangerous changes to their anatomy based on their past lifes.   Many different gametypes and achievements will keep you busy, making you team up with like minded people to complete annoying and tough challenges. For all the achievement hunters out there, they will be a good collection.  Solo play is also enjoyable, allowing you to just relax and kill zombies at your own pace.  Steam approved sites and other third party websites have skins, maps, sounds and other mods that are perfectly fine and legal to use whenever you feel bored with the original game. Just stay away from the hacks, no one likes a dirty hacker.  Personal Rating: 4/5",
            "review_score": "1"
        },
        {
            "review_text": "francis is there anything you don't hate?",
            "review_score": "1"
        },
        {
            "review_text": "A classic, one of the best zombie games ever made.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best co op games out there and one of the best zombies game out there, Left 4 Dead is fun when playing online with random people, but the true delight comes when playing with friends. Hearing your friends panic when you know there's a witch nearby, coordinating when to us certain valuable supplies, ad communicating the locations and actions of the zombies together makes for an incredibly fun friday night at a friends house.",
            "review_score": "1"
        },
        {
            "review_text": "left 4 dead very good is coop",
            "review_score": "1"
        },
        {
            "review_text": "great zombie shooter with a ton of zombies to kill!!",
            "review_score": "1"
        },
        {
            "review_text": "✔",
            "review_score": "1"
        },
        {
            "review_text": "I had 2k hours on this game. Best. Game. Ever.  n0limit best admin NA. Best  alliedmods.net  user NA.",
            "review_score": "1"
        },
        {
            "review_text": "You get to play as a feminist, a old man, a black person and a wigger who kill zombies (and one tried to ♥♥♥♥ you) What's not to like about this game?          9/10",
            "review_score": "1"
        },
        {
            "review_text": "Good game to play with friends",
            "review_score": "1"
        },
        {
            "review_text": "love this game ",
            "review_score": "1"
        },
        {
            "review_text": "Second is better",
            "review_score": "1"
        },
        {
            "review_text": "love this game!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Zombies, splatter, stupid undead abominations, 4 players fun.",
            "review_score": "1"
        },
        {
            "review_text": "Make A Workshop For This",
            "review_score": "1"
        },
        {
            "review_text": "I've played this for over 3 years but I had to get a new profile. Still a great game!",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing. Too bad so few people play it nowadays. This game is fast paced, nothing happens in the same moment. Every playthrough is different. It's best to play in co-op. Only then one can experience pure awesomeness this game has to offer.",
            "review_score": "1"
        },
        {
            "review_text": "Great game with tons of replay value.",
            "review_score": "1"
        },
        {
            "review_text": "I honestly didn't like the gameplay of this. The PvP seemed even worse in formula tactacs. Sorry guys I let this one go.",
            "review_score": "-1"
        },
        {
            "review_text": "Has the best animation for a Left 4 Dead. It's better than Left 4 Dead 2. L4D has the best animation and less bugs",
            "review_score": "1"
        },
        {
            "review_text": "this game is awesome its valves best game probaly",
            "review_score": "1"
        },
        {
            "review_text": "A classic that redefined co-op gaming for me. Surviving the zombie horde with friends always feels like an accomplishment, but I never knew I would play a game where I wanted to be on the other side. Now, it's hard to remember a world without Boomers, Hunters, Smokers, and Tanks.",
            "review_score": "1"
        },
        {
            "review_text": "1. Good Graphics 2. I like The Game Play 3. Play with friends &lt;3 4. Tank &lt;3 5 Pills here &lt;3 6. Not Boring   9/10 Pills here",
            "review_score": "1"
        },
        {
            "review_text": "'Pipe-bomb Total thrown:22 Total kills:0' ",
            "review_score": "1"
        },
        {
            "review_text": "7",
            "review_score": "1"
        },
        {
            "review_text": "a little bit of aids, and a little bit of cancer",
            "review_score": "1"
        },
        {
            "review_text": "I remember anticipating this game and when it launched I was floored by how incredible it was. This is the type of game that is creative/unique and amazingly fun to play! Its like a ride at a theme park you get off and go right back on!   Why are games not this incredible anymore?  100/10",
            "review_score": "1"
        },
        {
            "review_text": "Just bought this to experience the AWESOME atmosphere of my favorite game's prequel. I like this game better than the sequel because of it's originality and I just feel so old school, and it feels SO GOOD. I recommend this to anyone who wants to know the whole story of the Left 4 Dead Series and wants to revisit the original Left 4 Dead. :)",
            "review_score": "1"
        },
        {
            "review_text": "Classic...already calssic.",
            "review_score": "1"
        },
        {
            "review_text": "Kill zombies! Kill zombies with friends!! Kill each other!",
            "review_score": "1"
        },
        {
            "review_text": "My favorite zombie game i ever played.  10/10  Oldschool but gold :3",
            "review_score": "1"
        },
        {
            "review_text": "cool ",
            "review_score": "1"
        },
        {
            "review_text": "Started game got addicted to pills 10/10",
            "review_score": "1"
        },
        {
            "review_text": "bought the game and when i try to play it, the game just keeps me on the blackscreen while its playing. i tried restarting my mac and relauching the game but it still does the same thing. is there a way to make that stop?",
            "review_score": "1"
        },
        {
            "review_text": "Left 4 Dead; is the perfect game for the whole family! From the youngest Junior to the oldest of grannies! Not the most realistic game since, you know.. 'THEY'RE ZOMBIES, FRANCIS!' But it's hella fun to play both alone and alongside friends.  With the different game modes; versus, campaign and survival you will never get bored!  Play as a smelly smoker or a very scary bouncing hunter! Wait! Why not as a tank? YES, it is possible!  Go on an adventure as one out of four survivors, make russian friends, kill some undead and jump your way to the next safehouse spamming that T2 Auto-shotgun!    I never regret buying this game! Join the fun! Even though this game TRULY is.. Left &amp; dead! (GL findning anyone to play with) But HEY! There's always singleplayer!   TL;DR - Left 4 Dead &gt; Left 4 Dead 2.",
            "review_score": "1"
        },
        {
            "review_text": "A game that is great.",
            "review_score": "1"
        },
        {
            "review_text": "Head and shoulders above L4D 2 in just about every way. Great game!",
            "review_score": "1"
        },
        {
            "review_text": "Why is there a '4' in the name of the game???",
            "review_score": "1"
        },
        {
            "review_text": "***WARNING***  Buy Left 4 Dead 2; it has the same exact weapons, characters, and maps plus more for literally the same exact price.  It IS a fun game, though. Also, look for it on sale because they both usually go down to about $5 during the big Steam sales.  But for real, I wasted $5 on this game. There's no real value to this one since L4D2 is just a better version of it in every way.  SERIOUSLY, THERE IS NOOOOOO POINT TO THIS ONE. EVEN THE SAME EXACT CAMPAIGN AND MAPS FROM HERE CAN BE PLAYED IN L4D2",
            "review_score": "-1"
        },
        {
            "review_text": "The thought of an AI controlled director hand-tweaking your horror experience through a zombie apocalypse is an interesting one, Left 4 Dead misses the boat through it's gunplay feeling far too lightweight and cartoonish despite the relatively terror filled asthetic. Bullets don't so much tear through the zombie horde as they splatter into their fleshy entrails - you might as well be shooting actors with nerf guns - so while it's an exciting idea it's a bit limp to be really enthralling.",
            "review_score": "-1"
        },
        {
            "review_text": "I do not thumb down for the game itself. The L4D franchise is an amazing coop license.  But if like myself you already had L4D2, do not buy L4D, because all L4D missions are present in L4D2, and furthermore, L4D2 have way more weapons than L4D.  So yes, this is more a warning than an real test, but I do not want other people to fall into the trap and think L4D have other mission and since you liked L4D2, you'd buy the first one.",
            "review_score": "-1"
        },
        {
            "review_text": "L4d2 is better but still this is not bad :P",
            "review_score": "1"
        },
        {
            "review_text": "If you like to eat pills, shoot zombies, kill steroid zombies then this is the game for you",
            "review_score": "1"
        },
        {
            "review_text": "Didnt see any problems with it, good game.",
            "review_score": "1"
        },
        {
            "review_text": "Friends+Valve+Zombies. Even though the cast is far more richier and better than the ones on the second game, the second games does has LOTS OF FUN WEAPONS! If I were you I would buy both, just to get the best of both.",
            "review_score": "1"
        },
        {
            "review_text": "lol never played  10/10",
            "review_score": "1"
        },
        {
            "review_text": "it's really fun",
            "review_score": "1"
        },
        {
            "review_text": "ive playd all the campaing of this game more than 40 times and it still is fun to play with friends... although the multiplayer lags alot (i have high speed internet) but its still the best money investment of my life",
            "review_score": "1"
        },
        {
            "review_text": "This game is never ending fun ride, whether you play offline or online.",
            "review_score": "1"
        },
        {
            "review_text": "How can i explain it? Well this Catchphrase should!, 'Old Games are Better than new' I really Would put it at a 9/10. And a 10/10 for It's amazing and Fun campaigns!",
            "review_score": "1"
        },
        {
            "review_text": "Just get the sequel.",
            "review_score": "1"
        },
        {
            "review_text": "its cool i love it",
            "review_score": "1"
        },
        {
            "review_text": "wacthed all trailers aa feels so good",
            "review_score": "1"
        },
        {
            "review_text": "In this gripping tale, you play one of four survivors with a unique personality quirk with three other survivors, and struggle to learn the values of Paracetamol, Aspirin and First Aid in a bleak world where an evil AI Director has engineered the apocalypse to suit its own demands.  It's up to you to lead your motley crew to safety as you journey across the Eastern Seaboard, with Zombies waiting to attack you at every turn, and the AI Director unleashing hell every time it gets annoyed with your progress (or lack thereof).",
            "review_score": "1"
        },
        {
            "review_text": "Great first person shooter where you have to work with your teammates (be they bots or other people) in otder to survive and complete the campaigns. You can play single player, quick game (which throws you into any available game regardless of difficulty or map), online (you get to pick map &amp; difficulty from games with open slots), friends only, survive (how long can you survive wave after wave) and versus.  Of the various options, Versus may be the most difficult. Players are broken into two teams and take turns being survivors and special zombie types. So the survivors opponents are not controlled by AI but actual people. So they can think tactically (and work together). However, learning how to use the special zombie attacks can take a bit of time as they basically close combat. Crunch sucks at being a Zombie.  Like many games, tools are provided to create your own maps &amp; campaign. Several sites are available to post them.  All in all a great co-op FPS game. Crunch give it 9 out of 10.",
            "review_score": "1"
        },
        {
            "review_text": "Favourite versus multiplayer of all time. Nuff said.",
            "review_score": "1"
        },
        {
            "review_text": "this is a great game, but dont buy it because l4d2 has all the exact same things in it inlcuding the maps weapons zombies survivors  but it is still a very good game but it was instantly put in the shadow of left 4 dead 2 on its release",
            "review_score": "1"
        },
        {
            "review_text": "Classic! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "There's a certain charm about this game that keeps bringing me back.   ...PILLZ HERE.",
            "review_score": "1"
        },
        {
            "review_text": "nice game with stunning graphics!",
            "review_score": "1"
        },
        {
            "review_text": "When I Started Playing Left 4 Dead , It Was Amazing",
            "review_score": "1"
        },
        {
            "review_text": "Zombies Everywhere ♥♥♥♥ing awsome!!",
            "review_score": "1"
        },
        {
            "review_text": "Join match  Carry team till end of game  Get kicked for their friends to join  10/10 Would get kicked again",
            "review_score": "1"
        },
        {
            "review_text": "9/10 Pretty Good.",
            "review_score": "1"
        },
        {
            "review_text": "Pro +Detailed, aesthetic. +Incredible replay value +Near perfect co-op game +Versus mode +Immersive audio  Con -Bad AI -Small weapon variation -No melee weapons  9/10, Amazing.",
            "review_score": "1"
        },
        {
            "review_text": "Addicted!",
            "review_score": "1"
        },
        {
            "review_text": "Ever wondered how you would survive the zombie apocalypse? This game lets you live that dark fantasy but you best bring some friends along, you're going to need them.",
            "review_score": "1"
        },
        {
            "review_text": "No read someone else reviews",
            "review_score": "1"
        },
        {
            "review_text": "You can kill your team8s, ++++++",
            "review_score": "1"
        },
        {
            "review_text": "Very good game. GET L4D2 THOUGH. Your getting both games and more because you can play the L4D1 Champains in L4D2. Would recommend. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "nice game has kinda bad graphics and alot of people who cheat but still great game 9/10",
            "review_score": "1"
        },
        {
            "review_text": "  8.5/10 TJBs",
            "review_score": "1"
        },
        {
            "review_text": "well its not good as killing floor but since has all mods and fun maps play with buddys i give 10/10",
            "review_score": "1"
        },
        {
            "review_text": "PROS: - Has achievements - Great buy for people wanting to own the entire series - People still play it  CONS: - Practically 100% obsolete if you own Left 4 Dead 2 - Has fewer features than Left 4 Dead 2:  -No workshop (but has addon support)  -Only weapons are Uzi, Pump Shotgun, Hunting Rifle, M16, M1014 Auto Shotgun, and Dual Pistols. No Melee weapons - Has the same price as Left 4 Dead 2  Just get Left 4 Dead 2. Literally everything that makes L4D great is in L4D2 somewhere.",
            "review_score": "-1"
        },
        {
            "review_text": "Get left for dead 2 because it has both the new maps and left for dead (1) maps. This game is useless",
            "review_score": "-1"
        },
        {
            "review_text": "get L4D2 there is no reason to play this over it. Still a good game though",
            "review_score": "1"
        },
        {
            "review_text": "Saw trailer, hooked in New and fun gameplay at first Outdated now, sad",
            "review_score": "-1"
        },
        {
            "review_text": "Just buy L4D2 since that pretty much has everything in L4D",
            "review_score": "-1"
        },
        {
            "review_text": "Not my kind of game...I like open sandbox games with exploration options. This game is nothing but run from zombies and kill zombies. So disappointed that I purchased it...maybe my son will play it so at least it isn't a total waste. My fault for not doing more research on it before buying.",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥♥♥♥t.",
            "review_score": "-1"
        },
        {
            "review_text": "One of the best games to ever be made in my honest opinion. One game to have in any Hall Of Fame Vault. Left 4 Dead is a CO-OP first person shooter game. The game uses Valve's well known Source engine, released in 2008. Left 4 Dead is probbably one of the best zombie games you will ever play. #keepitsteamy",
            "review_score": "1"
        },
        {
            "review_text": "It's practically dead. You'll definitely find more people on L4D2 ever since it was free on Christmas",
            "review_score": "-1"
        },
        {
            "review_text": "I don't have a clue of How this game makes my keyboard to Stop working after 20 minutes of platino. Wanted to love it. But I can't even play it",
            "review_score": "-1"
        },
        {
            "review_text": "First let me state: I loved this game... It was brilliant.  So why am I giving it a negative review?  Because everything in the first game, is also in Left 4 Dead 2, along with a whole bunch of new content... So save yourself the time/money, and just get Left 4 Dead 2 instead.",
            "review_score": "-1"
        },
        {
            "review_text": "dead and ♥♥♥♥ leave it that way",
            "review_score": "-1"
        },
        {
            "review_text": "I bought the l4d bundle and can only play left 4 dead so I payed double the price for one game when I press it it does not load just said can not load d3d device",
            "review_score": "-1"
        },
        {
            "review_text": "Rather simplistic shooting game. The storyline of the offline single player was non existent. There could've been more weapon choises and different strategies, like sneak kill.",
            "review_score": "-1"
        },
        {
            "review_text": "boy this game won't stop crashing on windows 8.1 because I have it on 1920 x 1080i and it ends up crashing I can't uninstall it I can't do nothing an error will show up saying failed to create D3D device",
            "review_score": "-1"
        },
        {
            "review_text": "Do not buy this game, Valve cut features they promised it would have, made a nearly identical 'sequil', and then wanted t charge you full price for it. Avoid the entire franchise.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't buy it!!! Just buy 'Left 4 Dead 2' instead. The 2nd game have ALL missions from 1st part and more missions, zombies types, wepons etc.",
            "review_score": "-1"
        },
        {
            "review_text": "I have installed L4D and played it once already but when i opened it again it's asking me to install it again but when i tried it says not enough disk. Am I only allowed to play this once after purchase? why does it have to be installed again if I have done that already? L4D2 has the same issue but I havent played that one yet.",
            "review_score": "-1"
        },
        {
            "review_text": "Very good foundation, launched at a good price, a very good first take on small cooperative FPS with a great rythm just so. Too bad it was abandonned this fast for the bling and money of another version while this one still had promised unfullfilled.",
            "review_score": "-1"
        },
        {
            "review_text": "I like to play as francis and i fukd ur mom faget",
            "review_score": "-1"
        },
        {
            "review_text": "Terrible game. My friend and i own mac which is suppose to be supported by left 4 dead but it wouldnt even load. Piece of ♥♥♥♥ game :) dont say that its compatible with a system that it clearly doesnt work on.",
            "review_score": "-1"
        },
        {
            "review_text": "This game encourages violence against african americans by placing louis in front of you anytime you try to shoot, pretty cool.",
            "review_score": "-1"
        },
        {
            "review_text": "Go buy the sequel, the campaign levels from this are included with it for free.",
            "review_score": "-1"
        },
        {
            "review_text": "this game is absolute ♥♥♥♥ing ♥♥♥♥ within 1 game online i was banned for owning some sorry ♥♥♥ scrubs the graphics are ♥♥♥♥ and NOONE plays this online truely beyond disapointed i wasted 20$ dollars on this worthless sack of ♥♥♥♥ and i will hands down never waste money on any more of steams ♥♥♥♥ing garbage again",
            "review_score": "-1"
        },
        {
            "review_text": "this is not a recommendation - i know there must be something wrong with me, but i simply did not enjoy this game. i tried playing offline and online and fighting hoard after hoard left me feeling ... brainless - in fact, i'd rather play one of the zombies.  no sir - i didn't like it",
            "review_score": "-1"
        },
        {
            "review_text": "I know this game is as old as they come, but they messed the survivor's AI up to the point where it is impossible to finish a campaign on the hardest difficulty in Single player. Believe me, trying to do so is a waste of time, I just wasted 3-4 hours trying to let them redeem themselves and that is unfortuneately 3-4 hours I will never see again, all because I was too shorthanded... The AI would refuse to pick up first aid kits and would never watch my back which is unfortunate considering you have to lead them forward in order to progress. The biggest loss in playing this game is that I know some lazy game developer cheated me out of whatever teensy amout of money my dumb ♥♥♥ spent on this game.",
            "review_score": "-1"
        },
        {
            "review_text": "All of this game contents already in L4D2, buy this only for collection (or achievement if you want it) purpose not for the content.",
            "review_score": "-1"
        },
        {
            "review_text": "Why is this game asking me to review it when i dont even own it? Logic right?",
            "review_score": "-1"
        },
        {
            "review_text": "'Are you excited about zombie multiplayer survival shooter called Left 4 dead? Yes, who made?! Valve. Well ♥♥♥♥...'  It could be a good game, if not for Valve. Valve through their career made alot of bad games like Counter-strike and Half-life, but people was still hoping for zombie shooter to be decent (because its a simple ♥♥♥♥ing job to do) But Valve failed again, big time! We play as four people who immune to zombie virus, they need to kill all zombies on their way and escape the danger. I saw trailers, and was excited. But in the end they made survivors more like superheroes with no weapon recoil at all. We can just speedrun the map even on multiplayer against other players. Multiplayer promised alot more, we can play against survivors using special zombies with special skills (jump on survivor and scratch him, touch survivors with tongue, puke on them, and crash them with FISTS OF FURY!!!)  NPC zombies are no threat to you, running ragdolls. Maps are boring and small, designer should burn in hell (if it exist) Also playing with stranger is a bad ♥♥♥♥ing idea, you cant read thoughts you know? Someone will shoot you in the back and pretend it was accident, or even attract some zombies by 'accident'. You must have a good friends, because only good friends will stand this ♥♥♥♥ game because you ♥♥♥♥♥♥♥♥♥♥♥♥ decided to play it and waste your money! There is so many cheaters now and only a few protected servers, and their protection worth ♥♥♥♥...  0/10  Valve, you should stop making games. No one needs your VR and Half-life 3. Leave games alone!   ",
            "review_score": "-1"
        },
        {
            "review_text": "i played this with a depressive friend because i was forced",
            "review_score": "-1"
        },
        {
            "review_text": "Conflicting features make gameplay a unentertaining chore. You can't have a game that demands team play yet rewards players for the number of competing kills they make, as it encourages players to not team play. Level design can be fun and the models and textures are nice. Inconsistent and imbalanced gameplay make a potentially great team game a bore.   /uninstall",
            "review_score": "-1"
        },
        {
            "review_text": "Better play Laft 4 Dead 2",
            "review_score": "-1"
        },
        {
            "review_text": "bad graphics and not fun waste of money i hope i get my money back",
            "review_score": "-1"
        },
        {
            "review_text": "So much replay value.",
            "review_score": "1"
        },
        {
            "review_text": "Just started playing the game and it's amazing! Love the ease of play and the pace. I haven't had a chance to play multi-player but looking forward to it. If you're looking for a game that you can just pick up, kill zombies and have fun, then I highly recommend Left 4 Dead. My only complaint is that is seems to kill my mic on Skype when I play.",
            "review_score": "1"
        },
        {
            "review_text": "I highly recommend this game. It may be a bit old now, but it doesn't matter. 4 player campaign on Expert is immense, as is 8 player versus when you know all 7 of the other players. Buy it now!",
            "review_score": "1"
        },
        {
            "review_text": "This one is better LEFT alone. Get the 2nd one instead.",
            "review_score": "1"
        },
        {
            "review_text": "Great fun, lots of action. I love playing this with friends and family.",
            "review_score": "1"
        },
        {
            "review_text": "10/10. Classic.",
            "review_score": "1"
        },
        {
            "review_text": "Intense action ",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. An all time classic and landmark game in local and online co-operative play.",
            "review_score": "1"
        },
        {
            "review_text": "This is teh ♥♥♥♥, its what made zombies what they are today=D",
            "review_score": "1"
        },
        {
            "review_text": "awsome game",
            "review_score": "1"
        },
        {
            "review_text": "It's Left 4 Dead. I mean 'cmon.",
            "review_score": "1"
        },
        {
            "review_text": "Sometimes you just want to play a game where you wipe out hordes and hordes of zombies, and this is one of the best of those.",
            "review_score": "1"
        },
        {
            "review_text": "more guns and i could enjoy game longer!",
            "review_score": "1"
        },
        {
            "review_text": "This game is like a hobbit. You can learn all that there is to know about it in a month, and yet after a hundred years it can still surprise and amuse you.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing Co-op. Better than the second in my opinon,",
            "review_score": "1"
        },
        {
            "review_text": "I went into Left 4 Dead expecting it to be mostly hype. I WAS WRONG. This is the best zombie murder game ever made. I highly suggest single player. Your team ALWAYS has your back. You can't say that about real players. Sometimes they jump in your way but it's only because they are trying to get a better vantage point. I suspect you could sit back and kinda watch the game as your team sprays bullets and body parts but why would you? I should have figured Valve thinks of fans above profit. Speaking of, before Steam I had a PS3, two in fact, and wouldn't you know they both took a ♥♥♥♥? I may never play another profit hungry console again. Did I mention, BUY THIS GAME.    4 out of 4",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games I have ever played and certainly one of the best multiplayer games!",
            "review_score": "1"
        },
        {
            "review_text": "8/10  Few games will ever live up to this as a great online team oriented game. Grab a friend or three and head out against the hordes of zombies that are before you... and trust me, you will never look at the word, 'Witch,' the same again. If you don't own this game, you need to.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, highly suggest multiplayer.",
            "review_score": "1"
        },
        {
            "review_text": "Incredible fun game. Really fun. 10/10 Of course, cooperating with friends.",
            "review_score": "1"
        },
        {
            "review_text": "That game is great piece of teamwork play to get through the level.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun, High Octane Thriller, L4d Left me on the edge of my seat, anticipating a hunter around the conrner, or watching my back from smokers, and the tank attacks make it all the more epic, i would ask for more Gameplay features like in left for dead 2, but for it's time left 4 dead will always be on my list of Great games! 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Left 4 Dead is just a perfect game. Its got great multiplayer, a pick up and play feel thats almost casual, but intense enough for the hardcore players, and hands down the best co op around. pick this game up if you dont have it already! stop reading this and go kill some zombies!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Solid game, super fun to play with friends and decent amount of blood and gore for the time that was develop. Great amound of content and add-ons is a plus.",
            "review_score": "1"
        },
        {
            "review_text": "You won't always think Left 4 dead would be the same as the second one. But i personally think it is. The graphics are... kinda the same, Left 4 dead has some slight mist through it, and Left 4 dead 2 has great graphics. I recommend both games.. But for me i love Left 4 dead. Left 4 dead 2 is very fun, i don't have it, but i always play on my brothers. I just love seeing zombies.. well basically i love scary movies and scary games. Sometimes i can't even handle them.. :P Anyways i would totally recommend this game, especially to those, who love zombies!:)",
            "review_score": "1"
        },
        {
            "review_text": "Why do so many 6 year olds play this game? Seriously I can't find a good survival game without getting screamed at by some kid who doesn't even have downstairs-hair. I mean who lets someone that age play an 'M' rated game anyway? Most of them I can hear drooling on their mic which ARE VERY LOUD. I'm not exactly great at the game but these little ♥♥♥♥♥♥s can't understand what 'GET IN THE SAFEROOM' means.",
            "review_score": "1"
        },
        {
            "review_text": "really good zombie game  ",
            "review_score": "1"
        },
        {
            "review_text": ":|",
            "review_score": "1"
        },
        {
            "review_text": "I love this game  ",
            "review_score": "1"
        },
        {
            "review_text": "I played this game for over 600 hours and can say I got my money worth on it. I however quit playing when L4D2 came out (which included all the old maps). double thumbs up for replayability. See my L4D2 review for more info.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game. I personally prefer this over Left 4 Dead 2. You shouldn't get this version though, as no one plays this anymore and it does not have as many features (such as enemies, maps, weapons) as Left 4 Dead 2. Get the newer version if you can, but if you can't this game is still very enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "get 4, play rotoblin best team game u will ever play pz",
            "review_score": "1"
        },
        {
            "review_text": "The game is good.   However...  You need decent people to survive trough the missions, because the AI is terrible.  It's punisable because of that.   And the lack of missions makes it a bit repeditive.   But when you find a lobby with good people, it becomes a really good game.   However again it is quite old and the 2nd one already has the missions from the first one.  So either buy that or this, my choice is to pick the 2nd",
            "review_score": "1"
        },
        {
            "review_text": "Epic zombie game with awesome co-op gameplay. I loved the characters and story. Multiplayer is epic and you get to play as the Infected which is awesome. Buy it for the multiplayer, single player can be a bit boring with the AI. Would of liked more weapons to use. Epic zombie game, definitly recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Great first person zombie shoot em up, if your coming for a great story you may want to look elsewhere but if your coming for some great b-movie fun with lots of action then settle in! The multiplayer is strong there is usally always someone online playing. I have enjoyed the time I have put into the game and its always something I come back to!",
            "review_score": "1"
        },
        {
            "review_text": "Zombies. Guns. Need I say more?",
            "review_score": "1"
        },
        {
            "review_text": "really good game! bunch of zombies and its at a good price! Time to shoot me some zombies",
            "review_score": "1"
        },
        {
            "review_text": "Awesome coop romp.",
            "review_score": "1"
        },
        {
            "review_text": "in the context of having played L4D2, i prefer L4D1's slight simplicity.  just downright, stupid fun with only Hunters to worry about (if you have terrible reflexes) or Smokers (if you have terrible aim).",
            "review_score": "1"
        },
        {
            "review_text": "This game is Left 4 Dead, and by this point it does not need an introduction. What I can say about it though, is that it is a whole lot better than the 360 version. With the creative community coming up with some of the best mods (weapons, maps, etc) the game only keeps getting better. Being able to play online on these user created maps is always a plus as well. If you have played L4D on the 360 and don't have it on PC, I would HIGHLY recommend buying it.",
            "review_score": "1"
        },
        {
            "review_text": "It's Zombie Killing!! What more could you possibly want?   This game really puts you in the action when it comes to training to survive the Zombie Apocalypse. While other games have 'zombie' add-ons, Left 4 Dead is still the original and the best.",
            "review_score": "1"
        },
        {
            "review_text": "I loved this game the only thing that was annoying was only being able to have one primary and just a normal pistol ",
            "review_score": "1"
        },
        {
            "review_text": "Great game to play with a group of friends.",
            "review_score": "1"
        },
        {
            "review_text": "theres no people playing it :( sad,an epic game like this one...",
            "review_score": "1"
        },
        {
            "review_text": "i love this game tbh i like it on xbox just because the contorls are a bit easier but tbh i like the challenge plus the graphic's here are a bit better i think",
            "review_score": "1"
        },
        {
            "review_text": "A great Co-op zombie shooter. Its a shame it was overshadowed by its predecesor so quickly.",
            "review_score": "1"
        },
        {
            "review_text": "Hella fun with friends!",
            "review_score": "1"
        },
        {
            "review_text": "The perfect 4-player co-op game. Play both campaign, survival and pvp as a 4-player team. Great voice-overs and kill-effects.",
            "review_score": "1"
        },
        {
            "review_text": "L4D is the best competitive shooter ever.",
            "review_score": "1"
        },
        {
            "review_text": "It's a fairly old game, by my and many's standards. It certainly does not have the features that Left 4 Dead 2 possesses, but it's still an amazingly fun game to play, especially with your friends. It holds that type of replayability, without a doubt. Now the question is whether you would get this game, or L4D2. It's a no brainer to go for L4D2, considering it's also on sale for an outrageous $4.99, but that doesn't mean you shouldn't give this game a whirl.",
            "review_score": "1"
        },
        {
            "review_text": "*GET LEFT 4 DEAD 2 AS IT INCLUDES ALL CONTENT FROM LEFT 4 DEAD*  Loved this game when it was released and still love it today! All though you can get this game in LFD2 i still purchased it when it was on a sale and got both for under a fiver! so why the helll not!   This is a great game for COOP players as well as on your own. One of the best zombie games i have played  ",
            "review_score": "1"
        },
        {
            "review_text": "72%",
            "review_score": "1"
        },
        {
            "review_text": "After playing this on the PC, I see the superiority of running this on better hardware. L4D is a great squad based shooter that gets even more fanatic with the more people you play with. The graphics, as well as the cues from some of the stronger characters in the game, always gives the quessy feeling wondering whats around the corner. I love this game, but its hard for me to recommend over it's sequal and expansion back, since the expansion leaves you play the original game with melee weapons and the newer monsters. Awesome game!",
            "review_score": "1"
        },
        {
            "review_text": "9/10",
            "review_score": "1"
        },
        {
            "review_text": "Near enough the same as l4d2 but still is a great purchase",
            "review_score": "1"
        },
        {
            "review_text": "Get Left 4 Dead 2. This is still fun though.",
            "review_score": "1"
        },
        {
            "review_text": "freakin' good !",
            "review_score": "1"
        },
        {
            "review_text": "This game is a blast when playing with a friend. Some of the best fun I've had with multiplayer. I wouldn't get it unless I was palying with a friend, though. Anyways, It's a must play, for sure.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game. Also selling if interested :)",
            "review_score": "1"
        },
        {
            "review_text": "This was the first game that led me to creating my steam account so the feeling of this game. The controls are not clunky. 7/10 at the least.",
            "review_score": "1"
        },
        {
            "review_text": "Its fun when complex strategy goes to s*** and everyone starts screaming.",
            "review_score": "1"
        },
        {
            "review_text": "its great but left for dead 2 has all of the left for dead 1 maps",
            "review_score": "1"
        },
        {
            "review_text": "The game has no other point in my opinion than playing with 3 other friends, especially on LAN (not tried online enough to have an opinion, LAN is always best), and trying the game in ultra hard mode, same level twenty times in a row, laughing big time, creating good memories. Don't take it if you are alone (there are better games for that), but if you can have it for 4 players, I DO recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Cool, old-fashioned zombie shooter. No ragrets",
            "review_score": "1"
        },
        {
            "review_text": "love this game to death",
            "review_score": "1"
        },
        {
            "review_text": "Millions of zombies, and you have 4 buddies to kill them all, what else can you ask for?",
            "review_score": "1"
        },
        {
            "review_text": "Good game, although you might as well just get Left 4 Dead 2 at this point.",
            "review_score": "1"
        },
        {
            "review_text": "yo momma so fat, she bigger than a boomer. yo momma so ugly, she look worse than a smoker. yo momma so mean, she worse than a witch. yo momma so fast, she quicker than a hunter.  Need I say more? 10/10 would dis again",
            "review_score": "1"
        },
        {
            "review_text": "(I play games offline 80% of the time, so my hours on record isn't the same as the amount of time I've actually payed)  Allow me to describe my first L4D experience to you...  Opens the game at 11PM on the day I got it, excited, thinking 'Finally, a new zombie game, I needed one', (Mind you, the only zombie games I've played before this were the TellTale Walking Deads and TWD: Survival Tactics) Suddenly, the Valve logo pops up and scares the crap out of me because I had my TV volume jacked up and the lights were off and the remote was gone. Limping to the main menu, I decide to play Survival mode to adjust myself t the controls. The Hospital level loads, I grab the shotgun and a medkit, bust the glass door and grab a molotov, then read the prompt to 'Call the elevator'. As I make my way to the elevator, I say 'Gee, I wonder where the zombies will come from', I hit the button, the continue 'I hope they don't come out of the elevator! I would never survive that!' My shotgun pointed at the elevstor, I begin to hear the zombies, and I resume my sarcastic rant. Out of nowhere, a hunter bursts out of the wall and kills me instantly.  This game took me by surpise (and made me scream like a tiny baby man).  Essentially, it's a game based on survival through teamwork. Fast-paced, this game requires you to react and keep your eyes on the prize, which is... survival. Easy to learn controls, great level design, and more than just a horde of zombies running at you. The various zombie types is reminiscent of The Last of Us and the combat is similar to that of TWD: Survival Tactics, yet refined. To put it simply, it is what TWD: Survival Tactics should have been without the stealth facors (except the Witch).  8 out of 10, well worth $20  Recommended to anyone who likes fast-paced, teamwork, zombie, or FPS games.",
            "review_score": "1"
        },
        {
            "review_text": "This game got me into pc gaming I found a cyber power magazing at my doctor office and talked my folks into it.I was lucky intel dual core and a nvidia 9600.This game was the best in my book for the longest time .So many mods out for it now too.I tried getting the second one for free when steam did that deal but it crashed before I could download it.Ill have to wait for next time since I was lazy.Great game you can be a special infected story line is great.Spoiler they kill off Bill.",
            "review_score": "1"
        },
        {
            "review_text": "Cr0wned a witch, rekt a tank, and saved a buttload of lives. all with a shotgun  10/10 would get stomped by zombies again",
            "review_score": "1"
        },
        {
            "review_text": "Best game i've played in a while. Even if you have an underpowered PC, buy this game. It will run perfectly. No lag. Fun gameplay. Easily worth a try.",
            "review_score": "1"
        },
        {
            "review_text": "scary, fun, addicting, better than the 2nd one, and pills here! enough said",
            "review_score": "1"
        },
        {
            "review_text": "A good buy with Left 4 Dead 2, Left 4 Dead was and is a great buy for those with extra money lying around, should they be so wealthy. A good zombie title with a great cooperative as well as modding community, it is definitely a game worth checking out. Recommended to those with interest in co-op as well as long and enjoyable mods and maps.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun multiplayer zombie-slaying experience. In fact, one of the 3 zombie games I ever enjoyed (others are Overkill and Dead Rising 2). The game has singleplayer, but I don't recommend playing it, the bots ai often get in your way or don't cooperate, but it is not bad enough to make it unplayable, only mildly annoying. The versus mode is especially fun, as you can play as the special zombies, adding another layer of strategy to the gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "Awesomely game. It's fast paced, often scary, and always fun. One thing to be aware of, though, is that all of its maps are repeated in Left 4 Dead 2, so there's really no reason to purchase it.",
            "review_score": "1"
        },
        {
            "review_text": "such a good game even tho its years old its good to see alot of people still play this game on the pc",
            "review_score": "1"
        },
        {
            "review_text": "Left 4 Dead is the classic cooperative horror shooter from Value software. The game holds up remarkably well despite its age, and the maps are well tried and tested classics: well-balanced, replayable, and atmospheric. The game is darker (literally) and more serious than the sequel, and the campaign is clever enough to allow for some truly emergent gameplay. I would personally have preferred more of a story to link the 4 base campaigns, rather than the disconnected episodes we have here, but that's a petty gripe really. I've played dozens of hours on this on Xbox and, while 4 campaigns would be short for any other game, the fact that they are so replayable is a testament to their design. Versus mode is fun (playing as infected in actually my preferred option) but the few flaws in the game are evident in this mode. Survivors have the definite advantage and are able to camp quite effectively, particularly in the finale of the Blood Harvest campaign. The characters' minimal dialogue is well written and their voice actors (including Jen Taylor) do their jobs very well. A classic with superb replay value and a strong community online.",
            "review_score": "1"
        },
        {
            "review_text": "Left 4 Dead, the first game in the Left 4 Dead series. A nice game, with nice story missions, I haven't played it much, but it's still nice, I viewed a lot of videos on YouTube and I really like it. Of course, it's funnier if you play it with your friends, but you can play it Solo or with random people. This game has: Zombie Apocalypse Shooting A hot girl in your team I recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "It is very fun and has so much content",
            "review_score": "1"
        },
        {
            "review_text": "Enjoyed the gameplay and campaign. Great that they ported the campaigns to the sequel, guess I'll finish my review there.",
            "review_score": "1"
        },
        {
            "review_text": "This game is the game that intoduced me into PC gaming back in 2009. so therefor i love this game it will allways be my first true love sucks we broke up . im with counterstrike now. :(",
            "review_score": "1"
        },
        {
            "review_text": "This game was the ♥♥♥♥ back in the day",
            "review_score": "1"
        },
        {
            "review_text": "Unbeatable co-op fun with a great mod community.",
            "review_score": "1"
        },
        {
            "review_text": "Truly one of the best Multiplayer Firstperson i've ever played. It's so hilarious. I remember the first days it came out, everyone was gaming it, and everyone was diggin' it!",
            "review_score": "1"
        },
        {
            "review_text": "Game is really fun, a lot better than 'No More Room in Hell'",
            "review_score": "1"
        },
        {
            "review_text": "There is no reason to buy L4D2 if you have this game, and vice versa. Though, I've played L4D2, and it just feels like this game.Like nothing was changed at all...",
            "review_score": "1"
        },
        {
            "review_text": "Gets a bit boring once you get used to it, but it's still neato.",
            "review_score": "1"
        },
        {
            "review_text": "very good game but l4d2 instead",
            "review_score": "1"
        },
        {
            "review_text": "l4d is one of the best mp I have ever played.. even after 500 hours.. I could go on for another 500 hours. Make sure you get yourself a good squad and voice.. :D",
            "review_score": "1"
        },
        {
            "review_text": "Hold down left mouse button simulator. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I forgot how good this game is, it was on sale over xmas, picked it up and am amazed how many people still play this game, great fun on or offline!",
            "review_score": "1"
        },
        {
            "review_text": "The original and best Left 4 Dead. Dark horror movie atmosphere, creepy threatening enemies, characters you actually want to play, and addictive as crack.",
            "review_score": "1"
        },
        {
            "review_text": "its a awesome game",
            "review_score": "1"
        },
        {
            "review_text": "Way better than Left 4 Dead 2: This is an original game, where the zombie killing fun all started, and how I met most of my friends on Steam.",
            "review_score": "1"
        },
        {
            "review_text": "A replayable classic. I've been playing this game for years and I'll never grow tired playing it. :D",
            "review_score": "1"
        },
        {
            "review_text": "Not bad good for terrible pcs",
            "review_score": "1"
        },
        {
            "review_text": "Great FPS game for wasting time when bored, enjoyed every moment of it,multiplayer was good and the single player also Nice job.",
            "review_score": "1"
        },
        {
            "review_text": "Really liked this game for the versus and it's community 9/10.  EDIT: Really hated this game because of it's community 0/10.  EDIT 2: I really like this game for it's community 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "The original and the best Left 4 Dead. Great Co-Op, and you get to kill many many zombies.",
            "review_score": "1"
        },
        {
            "review_text": "BUY THIS GAME!!!!!!!! This game is the perfect steam game to get for your first!!! at least get 15 acheivments and then play left 4 dead 2! !!!! This game is fully of zombie killing, horrer thrilling, and head popping action!!! Buy it please anybody who doesn't have it!!!! BUY IT!!!! It's AWESOMENESS!!!!",
            "review_score": "1"
        },
        {
            "review_text": "+",
            "review_score": "1"
        },
        {
            "review_text": "'urgh, it climbs'",
            "review_score": "1"
        },
        {
            "review_text": "Just buy Left 4 Dead 2 instead.",
            "review_score": "-1"
        },
        {
            "review_text": "I mean i was left 4 dead, but otherwise fun and hard game",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best Zombie games I've ever played. Valve did it again!",
            "review_score": "1"
        },
        {
            "review_text": "I love this game I used to play it on my Xbox when I was still a console gamer probably had well over 72 hours in it :p but now that I mainly play on a pc I would recommend that you get left 4 dead 2 even though this game is great that game just has so much more to offer but if you really want this game I would recommend you either wait for a sale or but it on either l4d1 and l4d2 bundle I would also recommend even though this game is fun solo it's much better if you have friends",
            "review_score": "1"
        },
        {
            "review_text": "Everyone should try out this masterpiece...",
            "review_score": "1"
        },
        {
            "review_text": "This is the kind of game where you fine out who your friends really are... and who you should team up with in a real emergency.",
            "review_score": "1"
        },
        {
            "review_text": "it ent good so what is SUPER GOOD     ps l4d2 is better",
            "review_score": "1"
        },
        {
            "review_text": "Left4Dead is hands down, one of the best things anyone ever did with Valve's Source engine! Never get tired of this game.",
            "review_score": "1"
        },
        {
            "review_text": "Spent too much time on this game",
            "review_score": "1"
        },
        {
            "review_text": "One of the best 4 player co-op games of all times. All the better if you like zombie games!",
            "review_score": "1"
        },
        {
            "review_text": "Better than Left 4 Dead 2. Also, the teamplay element is amazing.",
            "review_score": "1"
        },
        {
            "review_text": "I like the team play in this game and you must work as a team to get every one there alive. Besides the game it's self there are countless add-on, maps &amp; campains plus mods of all kinds so you can customize the game to look as you like.  I would reccomend this game to anyone that enjoys zombie apocalypse type games.",
            "review_score": "1"
        },
        {
            "review_text": "So many hours logged on L4D on Xbox 360. Its just like I remembered on PC, but the only problem is why play this when L4D2 has all the same maps and new ones and more modding? 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Even though you get everything Left 4 Dead has got to offer in the sequel, the first installment still rocks. It's gritty and unique design is still engaging, and the characters still makes one of my favorite teams ever. Left 4 Dead really requires teamwork. If you are a lonewolf... you're gonna have a bad time, mate.  Left 4 Dead offers a lot of content, that you could play for hours. And with the adition of mods, you can play it even longer without getting bored.  Though I do really recommend Left 4 Dead 2 more, as you beasically get Left 4 Dead in that one, the first installment still rocks! Do play!",
            "review_score": "1"
        },
        {
            "review_text": "Trades action for suspense, meeting a tank is a showdown unlike the spamfest of the second game.",
            "review_score": "1"
        },
        {
            "review_text": "I've looked around, im yet to find multiplayer games so immersive, so fun and time consuming, that makes you work so closely and take care of your allies so well, this is required gaming.  5/5",
            "review_score": "1"
        },
        {
            "review_text": "it is beter then spile knigts",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best zombies game ever created by mankind, and if you play with me, we'll get far, cuz I pown too many zombies to count!! SAAAAN",
            "review_score": "1"
        },
        {
            "review_text": "IM RELOADIN HERE LET ME PATCH YOU UP OH GOD, NOT FRANCIS GRABBIN PILLS",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. Own it for xbox 360 and PC. cant get enough of it and really enjoy playing with friends.",
            "review_score": "1"
        },
        {
            "review_text": "L4D Its an Good Game with no team Work at all Im 100% Sure your not going to like this. This game is $20 Its an ok price You will meet new friends and Stuff But i really really HATE Tanks And Smokers Lol Gets Annoying To kill. Rate 75/100 Its ok to buy.",
            "review_score": "1"
        },
        {
            "review_text": "This is just an amazing zombie based game, also it's only $15 if you buy L4D2 along with it.",
            "review_score": "1"
        },
        {
            "review_text": "its a good game but its not like left 4 dead 2 this one my real",
            "review_score": "1"
        },
        {
            "review_text": "The game that started it all.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Never actually got to play this until a kind /b/ro bought it for me alongside DayZ, and Left 4 Dead 2. Awesome game. Just get it. You know you want to get it.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ ton of fun for hours, even if it is creating a barrier of witches so your friends in the other team can't advance in the level without having to shoot at them!",
            "review_score": "1"
        },
        {
            "review_text": "best griefing game ever made by valve, highly recommended!",
            "review_score": "1"
        },
        {
            "review_text": "great game fun for hours",
            "review_score": "1"
        },
        {
            "review_text": "After 1500hrs testing this game, I can say its 'meh'",
            "review_score": "1"
        },
        {
            "review_text": "Addicting as all get out. Nothing like mass zombie killing.",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best co-op FPS I have ever played. Recommended for everyone who loves the genre.",
            "review_score": "1"
        },
        {
            "review_text": "This game is in my book one of the best Zombie FPS games!!! the sad part is not very many people play the game like they used too come on people play L4D",
            "review_score": "1"
        },
        {
            "review_text": "8.5/10 ~ It's a lot of fun :)",
            "review_score": "1"
        },
        {
            "review_text": "Kill zombies. They die when you shoot them. Bring some friends.",
            "review_score": "1"
        },
        {
            "review_text": "The first, the Best... the only....   Second game kinda sucks... this one is epic... one of the best games ever...",
            "review_score": "1"
        },
        {
            "review_text": "one of the best games ever :)",
            "review_score": "1"
        },
        {
            "review_text": "I like left foe dead it is cool and you can play with friends and it is cool when you be the zombie the tank is the cool and I like it when the zombie get you",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games ever!!!!!! ",
            "review_score": "1"
        },
        {
            "review_text": "I swear I've reviewed this game before. It went somewhere along the lines of 'buy it 'cause it's good &lt;insert witty remark here&gt;'. So yeah. Buy it. Is good.",
            "review_score": "1"
        },
        {
            "review_text": "Addictive single player, co-op, and multiplayer action gameplay from the makers of Counter-Strike and Half-Life  Versus Mode lets you compete four-on-four with friends, playing as a human trying to get rescued, or as a zombie boss monster that will stop at nothing to destroy them.  See how long you and your friends can hold out against the infected horde in the new Survival Mode  An advanced AI director dynamically creates intense and unique experiences every time the game is played  20 maps, 10 weapons and unlimited possibilities in four sprawling 'movies'  Matchmaking, stats, rankings, and awards system drive collaborative play  Designer's Commentary allows gamers to go 'behind the scenes' of the game",
            "review_score": "1"
        },
        {
            "review_text": "The Blob",
            "review_score": "1"
        },
        {
            "review_text": "Valve....what can i say ...every time i bought a valve's game it'l like if i bought a playable dream :)",
            "review_score": "1"
        },
        {
            "review_text": "I hate this game...................................................................................................................................................................................................................................................................................................",
            "review_score": "1"
        },
        {
            "review_text": "Good game, my very first game on steam. It sucks Valve doesnt support Left 4 Dead anymore.",
            "review_score": "1"
        },
        {
            "review_text": "awesome to play with friends",
            "review_score": "1"
        },
        {
            "review_text": "Damn ♥♥♥♥♥♥, I've never expected to see so hardcore level game, one of the best i've played in my whole life",
            "review_score": "1"
        },
        {
            "review_text": "Grab a friend or three, sit down, and shoot some zombies! Definitely worth it at a sale price.",
            "review_score": "1"
        },
        {
            "review_text": "A game worthy of it's game of the year's",
            "review_score": "1"
        },
        {
            "review_text": "classic game.",
            "review_score": "1"
        },
        {
            "review_text": "Who hasn't played this game? If you have not, and you are at all a fan of shooters or zombies or having fun with your friends, you should get it.",
            "review_score": "1"
        },
        {
            "review_text": "Classic Zombie carnage. Grab some friends some ammo and try to keep from shooting eachother! Well worth the price. Solid gameplay on my xbox 360 controller.",
            "review_score": "1"
        },
        {
            "review_text": "Good team shooter, great atmos and can be fully extended!",
            "review_score": "1"
        },
        {
            "review_text": "Buy this game... it's... great.",
            "review_score": "1"
        },
        {
            "review_text": "This is the essential zombie game, it embodies what we want from these types of games. You want lots of zombies to kill but you also need some quiet times to let you know that everyone's dead and this is the end of days. The Half-Life 2 engine combined with the A.I. known as the director really lets that experience come to a group of freinds. A note on the multiplayer; I would recommend doing one single player chapter before joining a server just so you know what you're doing. While it is a co-operative game you can't always expect your teammates to be understanding of new players. The feeling of overcoming the horde and surviving all the special infected the game could throw at you and you team is just so rewarding. If loved any zombie game or movie you'll love this game.",
            "review_score": "1"
        },
        {
            "review_text": "Skeet and quads nothing else.",
            "review_score": "1"
        },
        {
            "review_text": "Even with all the Custom Worshop Items and L4D1 campaigns available for l4d2...i still keep coming back to this game. for a relexing romp killing waves of zombies. One of the best Zombie games ever made.",
            "review_score": "1"
        },
        {
            "review_text": "Great co-op game to play with friends. Hilarity and rage ensues.",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite co-op multiplayer games to date. Very thematic and you can't beat the zombies vs survivors multiplayer aspect!",
            "review_score": "1"
        },
        {
            "review_text": "Played 21 hours of it, the majority happening before the L4D2 beta came out, so I mised the first big hype. I still come back to it with friends to play a round or two. who doesn't love this game, well worth the purchase.",
            "review_score": "1"
        },
        {
            "review_text": "great game ",
            "review_score": "1"
        },
        {
            "review_text": "Does this epic multiplayer monster need an introduction? Nothing I can say will do it justice - but I'll try.  The original. The masterpiece. Left 4 Dead 2 is a great improvement on many aspects, to be sure, but you just can't beat the old days... when all we had was an M-16 and a Jesus-room to ward off the literal hordes of undead. Now that L4D2 is out and all of the L4D1 maps are available in it - as well as game modes that remove all of L4D2's new items and infected - there really isn't a reason to pick up the first... but it will always have a place in my heart.",
            "review_score": "1"
        },
        {
            "review_text": "Lets face it, only badasses play this game. If you even walk into a room and happen to encounter someone playing this game that automatically makes you a badass by association. If you play this game you just know people are generally a little bit more afraid of you than they would be otherwise, deep down they know, you know that they know, and they know you know!?!?...regardless of their own personal background. They see the glint in your eyes and say to themselves 'omg' then they shake their head and try to shrug off the irresistible urge to crap themselves and are completely haunted and jump at nearly anything that moves for the rest of the day. All because they were in the presence of an individual who survived countless hordes of the most deadly and ravenous zombies to ever exist.",
            "review_score": "1"
        },
        {
            "review_text": "a great zombi killing experince :D",
            "review_score": "1"
        },
        {
            "review_text": "I dont even play this game anymore why the ♥♥♥♥ is this",
            "review_score": "1"
        },
        {
            "review_text": "This is a must if you don't own it already, Many people will suggest that you give this a miss and purchase the 2nd game, However I feel that this one plays better than it's follow up. There are loads of custom maps available for this which will give you hours of game time, The survival mode is awesome with friends. Keep the game alive spread the word to your friends and fill the servers with more players.",
            "review_score": "1"
        },
        {
            "review_text": "Graphics aren't the best, but it is entertaining.",
            "review_score": "1"
        },
        {
            "review_text": "Who doesn't love killing zombies with friends!!!!!Seriously if you dont like this game you are flawed as a human being...:)",
            "review_score": "1"
        },
        {
            "review_text": "it is a really good game i would buy this",
            "review_score": "1"
        },
        {
            "review_text": "Best Co-op game ever. If you like FPS this is a must have.",
            "review_score": "1"
        },
        {
            "review_text": "A good zombie game, there isn't a lot of official maps, but the community around the game made a lot of fun and good maps to dl for free :)",
            "review_score": "1"
        },
        {
            "review_text": "I ABSOLUTELY LOVE THIS GAME!! IT is most definitely worth the money. No lag, well though out, and most importantly you can play with friends!!!",
            "review_score": "1"
        },
        {
            "review_text": "Its very fun good story line and its sequel Left 4 dead 2 is even better i recomend left 4 dead because it has cool charecters cool zombies weapons and more 9/10",
            "review_score": "1"
        },
        {
            "review_text": "buy it. Its amazing.. worth every cent and 10x that. I can't wait for L4D3. Bring it!",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely awesome and fun game! Rep+",
            "review_score": "1"
        },
        {
            "review_text": "This game is great zombie killing fun whether you're by yourself or with friends. It actually left me feeling suspenseful and I'd get goosebumps hearing the witch's cries because I know it's going down if you startle her. I haven't played L4D2 yet, but I hear it's even better than this and I can't wait to play it!",
            "review_score": "1"
        },
        {
            "review_text": "A lot like Super Meat Boy but with less blood and a few more dead things that want to eat your damn face off.",
            "review_score": "1"
        },
        {
            "review_text": "Perfect game for a LAN party!",
            "review_score": "1"
        },
        {
            "review_text": "Great game. fun online co-op experience, good replay value. If you love killing zombies, this is for you :)",
            "review_score": "1"
        },
        {
            "review_text": "Guns, zombies, post-apocalytpic environment and great multiplayer fun await when you buy the Game of the Year Edition! (Also fun in single player.) Be sure to download some of the custom maps! (written in 12/2012)  Now I think it's still just as good...but it's rather dated. Hasn't aged well. And no one plays anymore. Also, new custom maps are hard to find.",
            "review_score": "1"
        },
        {
            "review_text": "I Love this game so much, it stopped me playing Supreme Commander...I thought nothing would ever accomplish that but there you go. Hundreds of fun hours and so many good steam friends I have met through this game. Fun, exciting, and endlessly hilarious. If you dont have it, get it, get the sequel too, join us in the Apocalypse.",
            "review_score": "1"
        },
        {
            "review_text": "awsome game",
            "review_score": "1"
        },
        {
            "review_text": "Not for everyday, short Story. 6/10",
            "review_score": "1"
        },
        {
            "review_text": "Best zombie co-op game out there. Killing Floor is a close second.",
            "review_score": "1"
        },
        {
            "review_text": "Still one of my favourites.",
            "review_score": "1"
        },
        {
            "review_text": "Simple game... kill all the zombies that come on your path and reach the safe house with your team :). You can switch from Easy till Expert. The highest level will give you a real challenge to prove that you are the strongest.",
            "review_score": "1"
        },
        {
            "review_text": "Only two words: zombies rule!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best zombie depictions i have ever seen",
            "review_score": "1"
        },
        {
            "review_text": "I feel the title of this game is almost completely accurate other than they give you guns to prevent the 'Dead' part.",
            "review_score": "1"
        },
        {
            "review_text": "Maybe the best co-op online shooter there is, definetly the best I ever played. If you are a fan of films like 28 days/weeks or Dawn of the Dead you will love the ambiente of the maps and the feel of the whole game, the comments of the four survivors throughout the game adding a lot to their character and are often good for a laugh. And if you are tired of fighting your way through randomly spawned hordes of zombies and special infected - why don't join the 'dark side'? Jump right into a game of versus and eat some brains! ;)   And even with L4D2 there are a lot of players still playing L4D1 so the community is far from dead. I play both and know a lot of people doing the same.",
            "review_score": "1"
        },
        {
            "review_text": "Buy. This. Game.",
            "review_score": "1"
        },
        {
            "review_text": "i like this more than the second one",
            "review_score": "1"
        },
        {
            "review_text": "Nothing does Zombie slaughter better than Left 4 Dead, if you like zombies, gore &amp; shooters then this is the best place to start. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Left 4 Dead set a standard for online gaming. It's FPS and survival at its best. Most of my game time has been spent with bots as the remaining 3 survivors, and I'm NOT disappointed; the AI is excellent so bots are a perfectly acceptable replacement for a friend. I strongly recommend this to all gamers out there. If you like FPSs, then this game WILL meet your standards as an awesome Survival FPS.  Gameplay: 18/20 ... AWESOME (the lack of variation within the weapons is my only complaint) Story: 0/0 ... OMMITTED Graphics: 5/5 ... PERFECT Controls: 5/5 ... PERFECT Sound/Music: 4/5 ... AWESOME   Overall: 91% (32/35) ... AWESOME",
            "review_score": "1"
        },
        {
            "review_text": "My time on this game is not done justice by this account, I've played a few hundred hours of this and L4D2 on xbox and on another account, and it is amazing. Particularly the first game.",
            "review_score": "1"
        },
        {
            "review_text": "This is the greatest game since Super Metroid, the greatest game of all time was released. Really, I have not seen a more refined, perfect game in the past 16 or so years.",
            "review_score": "1"
        },
        {
            "review_text": "Wanna play one of the best co-op game of all time with your friends? And with zombies in it? Here you have it.",
            "review_score": "1"
        },
        {
            "review_text": "A must have for zombie fans!",
            "review_score": "1"
        },
        {
            "review_text": "Left 4 Dead is a zombie apocalypse game where players take control of four different and unique characters who work together to escape the rotting clutches of the fallen. The game is very insistent on tight teamwork, purposefully creating situations that set up teams for failure should they decide to work individually instead of pooling their efforts into one.  The environment in Left 4 Dead is akin to one of a typical suburb while some portion of the game does take place in more rural and business areas. The game has a darker, colder feel to it as it takes place in the night and brings with it, a sense of death and decay, what with all the former residents dead. While it may seem that all hope is lost, players are greeted with the hope that they can make it, defeating any challenges along the way.  In general, Left 4 Dead is best suited towards those seeking a four player cooperative game. It's a great introduction into first person shooters, and plays just as well for veteran gamers.",
            "review_score": "1"
        },
        {
            "review_text": "A very very brilliant co op game and good in single player too.",
            "review_score": "1"
        },
        {
            "review_text": "Old Guy and Biker=OTP",
            "review_score": "1"
        },
        {
            "review_text": "this is a great game, always keeps you moving.",
            "review_score": "1"
        },
        {
            "review_text": "Very good game buy it!",
            "review_score": "1"
        },
        {
            "review_text": "Ahh Left 4 Dead, one of the BEST zombie games out there.   A very famous game made by Valve, and rightly so. The game is extreamly fun with a whole heap of replayablity to role you hands in.   The game is actually quite simple, with the obvious objective GET OUT OF THERE.  Being oldish, there are not many gun's or equipment than its predicessor Left 4 Dead 2 but gun's really aren't so important as long as they Destroy ALL THE ZOMBIESSSS.   Definatly worth the money, playing with friends will be one of the best moments of gaming you'll have.",
            "review_score": "1"
        },
        {
            "review_text": "The greatest game ever! nuff said",
            "review_score": "1"
        },
        {
            "review_text": "In some elements even better than L4D2. Watch out for tank!",
            "review_score": "1"
        },
        {
            "review_text": "The base concept of moving from area to area killing hordes of zombies is nothing new. How they go about making it is remarkable, however. The game forces teamwork and with the help of the ai director you can play this game over and over and over and almost never have two similar situations and the VS is pertty cool to up to 8 players 1 team as the zombies 1 team as the survivors but this game isnt that fun playing solo or with someone you dont know so get this if you have some friends to kill zombies with ya ^^ ",
            "review_score": "1"
        },
        {
            "review_text": "This game is just absolutley AMAZING! I can't wait to try out part 2 on PC.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game, a personal favorite... I mean, someone put it the best: Valve + Zombies = BEST FREAKING IDEA EVAR! This is one of those games that starts out pretty OK'ish, and becomes better as you get better. Also, the desire to complete different achievements has seemed to have overwhelm me, so... Overall, I would give it a 7/10 for not much versatility, but still the ability to play online and get a different experience every game (as the world is generated differently every time you load a campaign). ",
            "review_score": "1"
        },
        {
            "review_text": "this is a very addicting game, keeps drawing me back in for more fun",
            "review_score": "1"
        },
        {
            "review_text": "Oh ♥♥♥♥ yes! The Hours I have wasted on this game. I played the 360 version a lot more until I found a Turbo server.",
            "review_score": "1"
        },
        {
            "review_text": "Every time I play all my friends leave me behind, laugh, and let me get eaten by zombies. Unless you want to be left for dead by all your good friends I would not reccomend.",
            "review_score": "1"
        },
        {
            "review_text": "Great game!",
            "review_score": "1"
        },
        {
            "review_text": "ppl say that you shouldn't buy the game because its obsolete, and Left 4 Dead 2 has everything Left 4 Dead has, but Ill tell you something Left 4 Dead 2 doesn't have: LEGS. ITS ALL ABOUT THE LEGS.",
            "review_score": "1"
        },
        {
            "review_text": "Before I start let me just say that I've only played the single player campaign so I can't comment on the multiplayer. Now, most games usually have a small time period where they introduce the characters and the setting and such... This game does not do that, this game throws you into zombie infested locations and tells you to somehow cross the map without being brutally murdered. Sometimes I do wish this game had a more Story-Driven... you know, Story mode. But that is about the only thing I can complain about. THE GOOD ~Very Intense ~Great Enemies ~Awesome Level Design ~You Can See Your Feet!! THE BAD ~No Real Story ~Limited Weapons THE FINAL OPINION Overall, this game is still great, even in 2014. It may lack a Borderlands level of weapons, And may not have the most detailed story, But L4D is probably the best zombie game ever made. 8.75/10",
            "review_score": "1"
        },
        {
            "review_text": "That girl in the pink sweatshirt is nice. I love sweatshirts.",
            "review_score": "1"
        },
        {
            "review_text": "Best zombie game ever. Hands down. Only complaint is the lack of weapons to choose from.",
            "review_score": "1"
        },
        {
            "review_text": "Stupid amounts of hours spent on this game.",
            "review_score": "1"
        },
        {
            "review_text": "Left 4 Dead... a Valve classic! ",
            "review_score": "1"
        },
        {
            "review_text": "Killing floor did it first / better, trolololololololol recommendation",
            "review_score": "1"
        },
        {
            "review_text": "This game is a classic. You can't call yourself a gamer until you've played this game. The console versions of this game are great if you are feeling lazy, but the PC version is where the true challenge is.",
            "review_score": "1"
        },
        {
            "review_text": "Lots of fun with friends.",
            "review_score": "1"
        },
        {
            "review_text": "Left 4 Dead, the ultimate zombie blaster....  Not really one for the quick 5 minute blasters but enough to keep you occupied for a good hour, enough for a campaign. Not really into the whole multiplayer thing but it keeps the game fresh once you've completed the initial campaigns.  Some of the achievements take a little doing, especially the expert acheives but they're possible at least.  8/10 Graphics 9/10 Audio (gotta love the random statements by the AI) 7/10 Longevity 9/10 Gameplay (The save function aside....)  Just wish there was a save function during campaigns...",
            "review_score": "1"
        },
        {
            "review_text": "Fun with friends",
            "review_score": "1"
        },
        {
            "review_text": "A very fun and intense zombie game to play with friends! Not to mention the creepy special infected! 8/10",
            "review_score": "1"
        },
        {
            "review_text": "A game that teaches you about escalation.  'Let me just silently shine this torch down this corrid...OH HOLY HELL THEY'RE EVERYWHERE!!!'",
            "review_score": "1"
        },
        {
            "review_text": "Still my absolute favorite zombie game to this day. Not much of a story, but great gameplay and very fun.",
            "review_score": "1"
        },
        {
            "review_text": "The key to this game is always reload! You won't have much time to breathe when you have a hoard of zombies coming at ya.. oh and lets not forget the specials like Tanks,hunters, and witches!   Very fun game you can be stuck playing for hours on end. Big servers with 20 people deep make it a bit more exciting join those and watch the crazyness!  Good Luck  Big ",
            "review_score": "1"
        },
        {
            "review_text": "5 out of 5 stars - Violent, action-packed, stressful... It also has awesome co-op fun. Lots of mindless replayability.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game!",
            "review_score": "1"
        },
        {
            "review_text": "One of steam's classic shooters. Has the best opening cinematic. It's fun and you can play as a white chick. Huzzah!",
            "review_score": "1"
        },
        {
            "review_text": "If you can find a better co op zombie franchise I will personally buy you a game. Or diddle your gumdrops. Either way.",
            "review_score": "1"
        },
        {
            "review_text": "Does not work on Macs using Maverick OS. Just a black screen. I want my money back.",
            "review_score": "1"
        },
        {
            "review_text": "If you love zombies and playing survival games, this is the game for you. The game has very cool gameplay, nice characters, and very powerful weapons. I highly recommend this game to anyone!  My score for this game is 10/10  P.S. PILLS HERE, AMMO HERE, WEAPONS HERE, GRENADES HERE, FIRST AID HERE! - Louis",
            "review_score": "1"
        },
        {
            "review_text": "Shoot the feckin zambies.",
            "review_score": "1"
        },
        {
            "review_text": "Still one of my all-time favourite games  Better than L4D2 in my opinion; better atmosphere and gameplay, and a much more appropriate setting.  Feels like a good old-fashioned zombie film. L4D2 feels like a modern zombie comedy with too many cheap gags, and not enough substance.  Understated, under-appreciated, and utterly excellent.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Eh, it's alright.",
            "review_score": "1"
        },
        {
            "review_text": "Arcade Perfect 4 player co op FPS!",
            "review_score": "1"
        },
        {
            "review_text": "Rate 9/10  Best zombie game I have ever played. It's pure Coop PvP game what I like soo much. If u want a lot of zombies, blood, fun, and PvP based game, then this one is for you.",
            "review_score": "1"
        },
        {
            "review_text": "Best Game Ever if you dont have this Get It !!!! LOOTS of you have it though",
            "review_score": "1"
        },
        {
            "review_text": "pretty good. id say left 4 dead 2 is more fun/funnier. but this game has a more interesting campaign.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game  Tnaks valve for making this AWSOME game :))",
            "review_score": "1"
        },
        {
            "review_text": "'I really like the game, but I couldn’t find the stupid cake.'",
            "review_score": "1"
        },
        {
            "review_text": "Bill quit shootin' me",
            "review_score": "1"
        },
        {
            "review_text": "This is good game even if L4D2 is out it is still good fun to play.",
            "review_score": "1"
        },
        {
            "review_text": "Left 4 Dead describes the Iraqi civilians after we the troops out.",
            "review_score": "1"
        },
        {
            "review_text": "Left 4 Dead is easily in my top favourite games. I love pretty much everything about this game; the style, design, gameplay, characters, and music. This game just has something that keeps me going back, and even though it doesn’t have the new weapons and other gameplay changes L4D2 included, I still can’t help but prefer it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is simply amazing, even after all these years. Shooting zombies in coop never gets old.",
            "review_score": "1"
        },
        {
            "review_text": "good game would reccomended getting it",
            "review_score": "1"
        },
        {
            "review_text": "only like 2 levels SUX but the girl is cute hehehe :)",
            "review_score": "1"
        },
        {
            "review_text": "Great fast paced zombie slasher.",
            "review_score": "1"
        },
        {
            "review_text": "An amazing ride that makes cooperation a must. Team up with friends, given that your friends have both a Steam account and a copy of the game, or go solo with computers in an epic fight against thousands of zombies to save your live(s).",
            "review_score": "1"
        },
        {
            "review_text": "Worth it! :) ",
            "review_score": "1"
        },
        {
            "review_text": "Do you think you know your friends? Are they reliable, trustworthy, and a good shot? This game will test even the strongest of friendships.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of, if not the best co-op zombie survival games out!",
            "review_score": "1"
        },
        {
            "review_text": "Tons of bloody corpse fun!",
            "review_score": "1"
        },
        {
            "review_text": "it's a freakin' minecraft RIPP-OFF! but still it's cool ",
            "review_score": "1"
        },
        {
            "review_text": "Crap game Go play Dead island a lot less lag and just plain more fun. Will never understand why ppl like this game.",
            "review_score": "1"
        },
        {
            "review_text": "Awsome game lot of blood haha, my opinion is that its better than L4D2, because the gameplay is more smooth in L4D 1",
            "review_score": "1"
        },
        {
            "review_text": "i really like this gmae because it bring th characters and zombies to life and it is really amazing",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite games of all time!!!!!!!!!!! This is a must buy, and arguably better than its predecesor!",
            "review_score": "1"
        },
        {
            "review_text": "While not the best horror survival game this game honestly delivers some good thrills. Especially in Survival mode when the tank spawns and you realize, 'Oh no! The tank is coming!' and the gameplay is fun and fast. In singleplayer mode it's just as good. Also in multiplayer when your running low on health and the zombies are swarming you it's up to your teamates to save you, so this game includes lots of teamwork. However though while the pros outweigh the cons some of the cons are the fact that singleplayer AND multiplayer both have the same maps. It may also get a little repetive as game rounds do somewhat go the same the A.I can also sometimes be a little stupid, running into walls and sometimes plain out avoiding you, but on that note however Turtle Rock did a great job and I can't wait until their newest masterpieice, Evolve, comes out.  I give this game a 7/10",
            "review_score": "1"
        },
        {
            "review_text": "1 and 2 are the same pretty much.  both pretty good",
            "review_score": "1"
        },
        {
            "review_text": "This game is great. I have played this game before it finally got released. Played it with friends, team, family. I have experienced a lot playing this game back when i use to play a lot. Survivors vs Zombies, can't go wrong with that!",
            "review_score": "1"
        },
        {
            "review_text": "funny game and good to play",
            "review_score": "1"
        },
        {
            "review_text": "The original Coop Zombie shooter. If you haven't played it, you'll probably get everything you need from this game by buying L4D2, but this is what started it all. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Probaply the best zombie apocalypse coop game !",
            "review_score": "1"
        },
        {
            "review_text": "is it a good game? yes  should you buy it? no, the sequel comes with all the levels from this one AND it has steam workshop",
            "review_score": "1"
        },
        {
            "review_text": "I like toast, i also like this game.",
            "review_score": "1"
        },
        {
            "review_text": "i love this game *o* it's life.",
            "review_score": "1"
        },
        {
            "review_text": "Looking for Zombies? Looking for Fun? Just buy it already",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Still holds up great plus there is tons of mods",
            "review_score": "1"
        },
        {
            "review_text": "Amazing, classic games are always better than sequels and whatever. I played L4D2 before I played this game, both are amazing as hell. I also reccomend this game even if L4D2 has more content and new stuff added in it. (Lmao I'm bad at explaining stuff)",
            "review_score": "1"
        },
        {
            "review_text": "This game still holds up to this day and is also fun to play a bit even if you have the 2nd game, so you should get this game if you want a fun zombie game, even if you own the 2nd one, buy this game for your friends and play together, this is a experince you don't want to miss",
            "review_score": "1"
        },
        {
            "review_text": "Awsome game, love it. ",
            "review_score": "1"
        },
        {
            "review_text": "must have co op fps game",
            "review_score": "1"
        },
        {
            "review_text": "Good game, great investment hours of fun",
            "review_score": "1"
        },
        {
            "review_text": "ayo some dude added me on steam after playing with him on here and then i accidently deleted him and he vowed revenge and tried to get me to go on aim. it was scary",
            "review_score": "1"
        },
        {
            "review_text": "it's like Left 4 Dead 2, but characters are kind of better.",
            "review_score": "1"
        },
        {
            "review_text": "it was fun",
            "review_score": "1"
        },
        {
            "review_text": "Screw Halo, if i HAD to buy an Xbox, it would be for this game. I played this game a lot as a kid on my brothers xbox, but had to get both 1 and 2 for $6.00 for my PC....amazing first person zombie shooter, the best without a doubt, and is hours of non stop fun for not only online play, but also single player. Highly recommend...my second fav game of all time",
            "review_score": "1"
        },
        {
            "review_text": "This game has all the great quality's a co-op Zombie game should have: shotguns, M16's, the ability to be funny as heck, and a crap load of zombies. This is definatly gaming at it's finest ",
            "review_score": "1"
        },
        {
            "review_text": "Realizes why did he buy this game when he already has Left 4 Dead 2.  Still rates it 10/10",
            "review_score": "1"
        },
        {
            "review_text": "over 30 hours put into this game and its still better then the nazi zombie ♥♥♥♥ u see on COD. Complete stratagy and teamwork is needed in order to conquer maps at higher difficulties",
            "review_score": "1"
        },
        {
            "review_text": "This game constantly scares the ♥♥♥♥ out of me which is great. Thumbs up on this and part 2!",
            "review_score": "1"
        },
        {
            "review_text": "I was enjoying playing Left 4 Dead until the moded servers showed up.  I don't like them at all. When I create a lobby and start the game, the moded server automatically activates. It happens when I create a lobby or when I join a game.  Can somebody help me by disabling it? I don't like them. I just want to play the defaulted balanced version Left 4 Dead",
            "review_score": "1"
        },
        {
            "review_text": "Online is fun. i get to be the zombie and kill the survivors",
            "review_score": "1"
        },
        {
            "review_text": "Fast pace shooter that will wake you up!",
            "review_score": "1"
        },
        {
            "review_text": "This game was so much fun that despite zero improvement throughout over 231 hours of play, I still kind of like it.",
            "review_score": "1"
        },
        {
            "review_text": "if you don't have it.. you need it. and if you don't own L4D2 you need that too!   Pilots licence.... REVOKED dun dun duuuunnnnnn   It is VERY replayable and you will get lots of game time!",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome!",
            "review_score": "1"
        },
        {
            "review_text": "It's the Zombie/Infected-Apocalypse, baby!",
            "review_score": "1"
        },
        {
            "review_text": "IF YOU DONT BUY IT YOU HATE STEAM LOL",
            "review_score": "1"
        },
        {
            "review_text": "One of the best co-op and zombie game of all time",
            "review_score": "1"
        },
        {
            "review_text": "Good game, but one play it is impossible !!!",
            "review_score": "1"
        },
        {
            "review_text": "Co-op zombie shooter with excellent graphics and story line. Nuff said!",
            "review_score": "1"
        },
        {
            "review_text": "This is my Top Played Game on Steam at 400+ Hours  Simply Put   Buy it!  One of the Best Coop Games Today.",
            "review_score": "1"
        },
        {
            "review_text": "Even though i have both l4d and l4d2 i am still really enjoying this one more then l4d2 and still have more play time than l4d2.",
            "review_score": "1"
        },
        {
            "review_text": "Nothing beats the original Left 4 Dead, if not for the fact it's not censored like the new one (L4D2), the fact you have versus tops the cake - With the many different scenarios and ever changing AI which is always intellegent compared to other AI on zombie games, it makes it a must purchase.",
            "review_score": "1"
        },
        {
            "review_text": "Super fun but difficult to play by yourself... Definitely recommended!",
            "review_score": "1"
        },
        {
            "review_text": "Tells a great story and great zombie slaughtering.",
            "review_score": "1"
        },
        {
            "review_text": "Left 4 Dead is a fun cooperative experience that suffers from the Source engine's warts. Some of the special monsters can make the game incredibly frustrating for somebody playing with a poorly-coordinated team and the map options that come with the game can get incredibly old quickly. The fundamental dynamics of the game, however, are strong and can offer you several fantastic hours of horrified screaming as zombies tear your body apart.",
            "review_score": "1"
        },
        {
            "review_text": "If you like playing coop with a friend and killings lots of mutants / zombies this game is worth picking up. Fast, smooth and despite its age holds up well against newer games even today. Grab it on sale and have fun!",
            "review_score": "1"
        },
        {
            "review_text": "  Got it as a present from one of my friends. One of the best passtimes I have had this month :D especially enjoyed the multiplayer mode, since the game itself was designed as a team game :D",
            "review_score": "1"
        },
        {
            "review_text": "just awesome zombie killing co-op fun times!",
            "review_score": "1"
        },
        {
            "review_text": "i can see my legs ? rly valve",
            "review_score": "1"
        },
        {
            "review_text": "Time to shoot some zombies!",
            "review_score": "1"
        },
        {
            "review_text": "This is the best game I every played, I seen like, I don't get enough. I love me some Zoey. The other friend is ok too. I will tell and play this game with all my friends. This is an great game, if played with friends.I wish the maker of the game will come out with more site's to play on.",
            "review_score": "1"
        },
        {
            "review_text": "I enjoy a challenge so I really just play Expert and Versus. This game makes you think on your feet a lot everytime zombies attack you. Specially on Versus. God such a masterpiece",
            "review_score": "1"
        },
        {
            "review_text": "Go to the second game for a good time. Cheap on sites like ♥♥♥ and ♥♥♥♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "This is the BEST F****** zombie survival game, I've ever played. Forget Resident Evil, Forget Treyarch's zombies. This is all you need. I've never had so much fun in my whole life on a game as I have had with this. Even when I got killed I didn't feel sad or depressed. I give this game top marks.",
            "review_score": "1"
        },
        {
            "review_text": "Although I didn't play much this game on my Steam, I spend hundreds of hours at my friends house just playing it. This was one the most memorable game I ever played..  Thanks.  Maybe I should do this again with L4D...?",
            "review_score": "1"
        },
        {
            "review_text": "This game is a zombie survival title requiring you to remain in your team of four in order to increase your chances of survival. It basically plays like Half-Life 2 and looks like an upgraded version of Counter-Strike: Source. Not sure why the system requirements are much higher than Half-Life 2: Episode Two as the real differences are film grain and slightly more detail in the environment...plus shadows that actually change based on the light source. This game doesn't have quick save so you have to be on your guard the whole time. It can get frustrating near the last level of each campaign where you have to fight off waves of zombie hoards and tank monsters. There are some cheap moments where a tank monster will instantly punish you with zero health then having to restart the level (remember there are no checkpoints) so this game is not without its flaws. There are also a few raging moments where there would coincidently be a witch, hunter and smoker for example and then you get gang ♥♥♥♥♥ from all directions. The difficultly can be a sudden spike up in some cases if you are new to this game on even normal difficulty. There is also a very limited arsenal of weapons like the sniper rifle, m16a2, colt 45, Uzi, pump action shotgun, and auto shotty, pipe bomb and molotov cocktail. If you can tolerate some of these flaws, then this game is worth checking out.",
            "review_score": "1"
        },
        {
            "review_text": "Pills Here!  Kills whole nemy zombie team  -gg  9/8 would pick louis again!",
            "review_score": "1"
        },
        {
            "review_text": "yeah it was gord but could do with more maps",
            "review_score": "1"
        },
        {
            "review_text": "first off all in L4D there is no katana and i se a boomer and somethind beside him.",
            "review_score": "1"
        },
        {
            "review_text": "Left 4 Dead is a 4-Player Co-op Survival game made by Valve. The game consists of a singleplayer/multiplayer campaign, Versus mode where you play as a zombie, and survival mode where you survive for as long as you can.  Pros+  Very Entertaining Teaches Teamwork Good Gameplay Likeable Characters Fun Campaigns   Cons- Graphic Bugs Limited Weapons Almost All Zombie Types Are Pretty Generic Except For The Hunter And The Witch Almost No New Survival Maps No Mod Support   Overall The Game Is Good But I Personally Don't Think Its Worth 20 Dollars More Like 15 Dollars  I Give This Game A 8/10 ",
            "review_score": "1"
        },
        {
            "review_text": "It's more challenging with the abense of melee weapons and some of the top tier weapon and so forth. No chargers or spitters exist here. Some of the maps are different than in L4D2. I highly recommend this game if you liked the second game or you have people that play this game instead of L4D2 to play with. Great taste in the face of gaming I might add.",
            "review_score": "1"
        },
        {
            "review_text": "Best co-op Multiplayer zombie shooting fps game",
            "review_score": "1"
        },
        {
            "review_text": "L4D and its sequel are two of the best zombie games I have ever played (with Dead Rising 2 as another). The campaigns are a good length, allowing for short sittings that get you from start to finish (the ~85 minutes I have on record cover a single campaign, with one death).  I haven't played online multiplayer, but I've played couch co-op on 360, and it's a really good MP; there's an actual incentive to keep your teammates alive (at least the human played ones).  The AI can, unfortunately, be kinda stupid, but that's par for the course. Helpfully, they won't activate horde events by themselves. Unhelpfully, they won't activate *any* buttons by themselves. But generally, they can be counted upon to not do really stupid things (like attacking the normally docile, very dangerous Witch enemy when she's not already aggressive), and they will certainly try to help you out by rescuing you from enemy grapples, and giving you healing when needed.  I would recommend this game to people looking for some fast-paced, zombie-killin' action that doesn't take itself too seriously.",
            "review_score": "1"
        },
        {
            "review_text": "Its hard to comprehend how f.u.cked we would be if this happened in real life.",
            "review_score": "1"
        },
        {
            "review_text": "Best Coop Shooter I played by far!",
            "review_score": "1"
        },
        {
            "review_text": "great gae still play to this day",
            "review_score": "1"
        },
        {
            "review_text": "One hell of a game. Played this numerous times. Can't get enough of it. Anyone know how to download the modded games for L4D? This game is a must for anyone who likes action at it's best. This type of gameplay is my favourite.",
            "review_score": "1"
        },
        {
            "review_text": "The father of streamlined modern co-op, much more enjoyable than its heir.",
            "review_score": "1"
        },
        {
            "review_text": "LEFT FOR DEAD ON THE PC IS A VIDEOGAME FEATURING TOUGH FRAMES and electric movement!Nice low center gravity measures!Within the border areas!  Circling clattering loudly!Megaphone delivery epic pinpoints throughout ur adventure!  licks his fingers in excitement with zombie power!Vroom goes the deluxe boxes of zombies attacking u miles away!  lickety split its time for ozone blood damage ratio outrages!  Great accuracy and aim!Nice overdozen of weapons too choose from!  A wisp of wind,and other elements make it a satisfiyng game to play!  Injuring for realtime is a bonus to not get over with! Tilting runaway backgrounds,and areas indicating solutions,and mazes!  A base of wild and erotic fun!Soaks up applause!Nice rickety amazement!  strumming cool visual effects!Valve does more time on this gaming piece!  epic sound boxes!Headlights of discovery for sure!  A sexy lady to play as,and u get the whole delightful package!  Just dont stumble and quiver like other crater ♥♥♥♥♥♥♥♥s do  I give this game a risk of crashing score 10/10 one of the best multiplayer games u can play,and achieve that smart goal love the burrito master ",
            "review_score": "1"
        },
        {
            "review_text": "Campaign mode is a brilliant co-op experience, and Versus offers original, well-crafted tactical, asymmetrical team-based action gameplay. It's pretty buggy, and there could have been more levels, but it's still extremely good.",
            "review_score": "1"
        },
        {
            "review_text": "Yes for simple yet fun, if not L4D2 is for you with additional upgrades",
            "review_score": "1"
        },
        {
            "review_text": "The single player is fun the first few times, but tends to get repetitive and isn't difficult. The co-op is really where this game gets fun to play. Wait for it on a cheap steam sale or in a combo pack.",
            "review_score": "1"
        },
        {
            "review_text": "Sooooooooo addictive........and as much fun. Works well in single player, but better in multi.",
            "review_score": "1"
        },
        {
            "review_text": "  Left 4 Dead 2 has of Left 4 Dead 1's campaigns with enhanced features, so you'd think there's no reason to play this. Believe it or not, there are reasons to play the original over L4D2's ported campaigns.  Valve fixed some bugs while porting the maps. For example, the air conditioner in No Mercy's first map has a bigger hitbox in L4D2 to prevent sequence breaking. In L4D1 you could just jump off the roof on to the AC and skip a big portion of the map.",
            "review_score": "1"
        },
        {
            "review_text": "  Playing Left 4 Dead is like masturbating. Feels good doing it but later you regret it. And then you keep on doing it",
            "review_score": "1"
        },
        {
            "review_text": "I remember this game from when I was little, I loved it and I still do actually great game",
            "review_score": "1"
        },
        {
            "review_text": "It's quite good.",
            "review_score": "1"
        },
        {
            "review_text": "Hug the Tank! I dare you.",
            "review_score": "1"
        },
        {
            "review_text": "I loved this game soooo much, that not only did I say 'just 5 more minutes', several dozen times... I called in sick the next day just so I could continue the crazy, wave after wave, madhouse, nightmare inducing slaughterfest!! Only replaced by Left for Dead Two when that title dropped. Great games them, great games still.",
            "review_score": "1"
        },
        {
            "review_text": "I loved this game soooo much, that not only did I say 'just 5 more minutes', several dozen times... I called in sick the next day just so I could continue the crazy, wave after wave, madhouse, nightmare inducing slaughterfest!! Only replaced by Left for Dead Two when that title dropped. Great games them, great games still.",
            "review_score": "1"
        },
        {
            "review_text": "it's about zombies .3.",
            "review_score": "1"
        },
        {
            "review_text": "Best Co-Op gameplay experience i've ever had.",
            "review_score": "1"
        },
        {
            "review_text": "Rushed to the safe house but blocked by a witch while you and your teammate's health is below 20% and a horde is called. 10/10 would rush again.  Seriously though, it's really worth it. Get this game and play with your friends and you'll definitely have an enjoyable time. ",
            "review_score": "1"
        },
        {
            "review_text": "This game is pretty good but there are not enough players that play this game anymore :(",
            "review_score": "1"
        },
        {
            "review_text": "This is the game you'll play with your close friends, mess around &amp; have an amazing time with them. I remember playing this on the 360. So fun &lt;3. Now I need friends to play some L4D now... I've nominated this game for 'Just 5 more mintues' Because when your trying to extend you play time for a LITTLE bit to furfil you gameplay or you have to go to unlock the 'All 4 Dead' achievement on that skyscraper map. BUY IT NOW WHILE IT'S $3.99 so for L4D2",
            "review_score": "1"
        },
        {
            "review_text": "I have put almost 300 hours on thid excellent game, mostly on cooperative mode. With its sequel Left 4 Dead 2? it is the king of multiplayers cooperative shooters, or asymetrical versus shooters. However I think tht a lot of people have already played this game now.",
            "review_score": "1"
        },
        {
            "review_text": "its. awesome.",
            "review_score": "1"
        },
        {
            "review_text": "Haven't played it in a long time, nor will I probably touch it ever again, but I can still say that this and L4D2 was a big part of my life, and was one of the first games that brought me into the co-op playing field. A game that really relies on your teammates watching your back, where no matter how skillful you are, you are not going to be able to solo a map on any difficulty. Instead of co-op being merely a suggestion like in COD-zombies.",
            "review_score": "1"
        },
        {
            "review_text": "  The game is awesome it gives me so many memories of when i played it before. The best thing about the game is the characters there cool sort of funny in there own way. Next is the graphic it shoes that the game is not to old to be played",
            "review_score": "1"
        },
        {
            "review_text": "I have been playing this game since either 2008 or 2009 on Xbox 360, and like Left 4 Dead 2, this game is amazing. Although there aren't much weapons compared the second game, that doesn't mean the game isn't fun and shouldn't be played. My only problem with Left 4 Dead 1 compared to the second game is that the versus scoring system's points are too far a part. For example: If you survived a level with all four players, you'd get about 1000 points. If all four of you died just outside of the saferoom, you'd get about 99 points are there's just too much point difference compared to the second game. Another problem would be the lack of players so bring your friends. Other than the versus scoring system, this game is amazing, and I would recommend it to people who don't get bored easily.",
            "review_score": "1"
        },
        {
            "review_text": "Fun as hell !",
            "review_score": "1"
        },
        {
            "review_text": "I don't think there is much that can be said that hasn't already been said about Left 4 Dead. It's a superb game, why don't you have it in your library yet?  My one gripe is the fact that Left 4 Dead 2's implementation of Left 4 Dead 1's levels removes all reasoning to ever want to boot up Left 4 Dead again, which is a real shame and a bit of a stupid decision. It might have made business sense at the time to push Left 4 Dead 2 sales, but now it doesn't make much business sense. Where Valve could have made more money bundling the two games for different expereinces, they killed the need to want to play the first game if you have the second.  That said, Left 4 Dead is still great, great value for money, original in what it was without the fluff no.2 added (if you don't like fluff) and just sheer fun. It also has a great following and plenty of mods, what's not to love?",
            "review_score": "1"
        },
        {
            "review_text": "The best cooperative multiplayer game.",
            "review_score": "1"
        }
    ]
}