{
    "app_id": 50000,
    "name": "Nimbus",
    "release_date": "2010-10-25",
    "developer": [
        "Noumenon Games"
    ],
    "publisher": [
        "Noumenon Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Partial Controller Support",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Indie",
        "Racing"
    ],
    "tags": [
        "Indie",
        "Racing",
        "Puzzle"
    ],
    "achievements": 18,
    "positive_ratings": 179,
    "negative_ratings": 10,
    "price": 5.99,
    "description": "Nimbus is a unique combination of racing & puzzling. The player controls a craft with no means of directly propelling itself and needs to use whatever is scattered around the levels to acquire thrust and reach the goal. Traverse a world map with several distinct islands in order to recover your lost love.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/50000/header.jpg?t=1447353658",
    "minimum_requirements": "OS: Windows XP/Vista/7 Processor: P4 2 ghz or fasterMemory: 512MB RAMGraphics: Shader Model 3 capable card ( NVIDIA GeForce 6 series, ATI 1300XT series or newer )DirectX&reg;: Version 9.0cHard Drive: 670 mbSound: Directx 9.0c compatible",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "F%#$ING AWESOME!!! Until the very end. Outstanding! Good work...",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful, different and addictive. This game is simply awesome, worth each cent. Specially with the 66% off :D",
            "review_score": "1"
        },
        {
            "review_text": "Severely overlooked game.  Buy it if you enjoy skillful maneuvering with a touch of puzzle-like elements.",
            "review_score": "1"
        },
        {
            "review_text": "Its awesome! Never seen such a unique game!",
            "review_score": "1"
        },
        {
            "review_text": "1/10. Game blows. Ignoring the questionable game design, the main premise of this game is to challenge the player with awkward controls. Both in game and out of game (settings). For example, configuring the gamepad is not intuitive--how do you delete a mis-binding to multiple keys?--and no in game keyboard remapping. Stupid! Fortunately, I didn't pay very much for this game, but it was too much. I may revisist this title to give it a second chance, but doubt it. RGH",
            "review_score": "-1"
        },
        {
            "review_text": "Really addicting game",
            "review_score": "1"
        },
        {
            "review_text": "One of the best indie games I've even played, very challenging, extremely fun! JUST PLAY IT!",
            "review_score": "1"
        },
        {
            "review_text": "This game is super fun, much more fun than it looks. Get it for srs.",
            "review_score": "1"
        },
        {
            "review_text": "Such a simple game that so few people know of, yet it is an amazing game for when you just need five minutes of casual fun. Perfect for school breaks :P!",
            "review_score": "1"
        },
        {
            "review_text": "Whatever you may say about this game, I for one consider this a game to swear by... no wait, I meant at. This is a game to swear *at*, repeatedly and profusely as your fingers grow numb and your eyes become bloodshot.  This is a game about cutesy momentum-propelled sentient spaceships, where gasoline does not exist and you must rely on cannons and bouncing pads and other assorted devices to keep your spaceship avatar afloat. Though the the graphics are lighthearted, the game itself is a cruel stern mistress, demanding more and more of your fine motor controls and keen reflexes. In later stages, just one degree of rotation or one millisecond of hesistation can mean the difference between glorious victory and ignoble destruction.  Fortunately, this game has an easy mode, so beginners can have checkpoints and unlimited times to retry a stage and hit the goal. On the other hand, this game features normal and hard modes as well, for the player who demands maddening challenges to triumph over. The game's levels are actually short, and the game can be finished within a day, assuming you finish all the stages in one go. But if you enjoy unforgiving games and testing yourself to beat momentum puzzles as fast and as perfectly as you can, then definitely give this game a go!",
            "review_score": "1"
        },
        {
            "review_text": "Really addicting game",
            "review_score": "1"
        },
        {
            "review_text": "Awesome Indie game. Difficult yet rewarding.",
            "review_score": "1"
        },
        {
            "review_text": "Here is a game that took a simple concept and turned it into a full game experience. With a nice learning curve and fair difficulty, it is worth a bit of your time and money.",
            "review_score": "1"
        },
        {
            "review_text": "This game is super fun, much more fun than it looks. Get it for srs.",
            "review_score": "1"
        },
        {
            "review_text": "Simple: A+, only 4 buttons, left right brakes and reset, Goal: get from A to B.  Casual: A, I can turn this game on at any time to decompress, however there are some levels that just shouldn't be attempted if you have high blood pressure problems.  Difficulty Scale: C, they mark each level with a difficulty from 1-10, I find those markings somewhat arbitrary, you can accidentally stumble across hidden levels with low difficulty only to find them much harder than stated. *SPOILERS --&gt;* the final level throws such a curveball at you it can only be compared to the final level of Trine. It isn't necessisarily difficult per say, but its a massive shift in the pace of the game.  Replay value: B, you can easily get some of the bonus unlocks your first play through, the bonus tokens are very simple in the early levels, and the unlockable cosmetic modifications to your ship are fun, but it isn't going to bring you back if you aren't into that kind of thing.  ran out of room summary 9/10mustown",
            "review_score": "1"
        }
    ]
}