{
    "app_id": 500190,
    "name": "Firefight",
    "release_date": "2016-07-11",
    "developer": [
        "Sean O'Connor"
    ],
    "publisher": [
        "Sean O'Connor"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "World War II"
    ],
    "achievements": 0,
    "positive_ratings": 37,
    "negative_ratings": 12,
    "price": 6.99,
    "description": "Firefight is a World War II real-time simulation game similar in style to the old Close Combat series but brought up to date with better AI, individual soldier modelling, a faster frame rate to give more intense and realistic combat and an easy to use command interface.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/500190/header.jpg?t=1473201411",
    "minimum_requirements": "OS: Windows XP Graphics: DirectX",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I bought Firefight as it reminded me of a game called Close Combat. But don't think of Firefight as a Close Combat clone because it is its own game!  Pros: Easy to get into. Easy Controls. Unique graphics. Fun Gameplay. Many Scenerios. (72 across 9 maps) Beautiful Handmade maps 'New' Kind of stratedgy.  Cons: Infantry Graphcis are small and look alike. If you replay a mission the enemy will be in the same spot. No Skirmish No Multiplayer No Manual/Tutorial  I have to say I enjoy it a lot! It is simple but fun. I have played many wargames like Close Combat (II,III,COI,GTC,LD and more), Men of War, Theatre of War and more. The game has a neat feature during combat where it tells you where your units where hit and by what kinda like a text adventure. Its a cheap game but it is an iOS port. He has promised to improve the game in a varitety of ways (one being multiplayer) and hopefully he will stick to his promise. A good easy to learn game.",
            "review_score": "1"
        },
        {
            "review_text": "I wouldn't say this is a sequel to CC but it does have some features that are way better than CC's for example the a.i is way better. I like how when behind cover your infantry stand up to shoot rather than just stay in one position and how the tanks and infantry find the best place to fire at the enemy. I really love this game.",
            "review_score": "1"
        },
        {
            "review_text": "If you prefer fithging with clumsy engine and stupid pathfindig instead of planing tactics this game is for you.",
            "review_score": "-1"
        }
    ]
}