{
    "app_id": 501090,
    "name": "Design it, Drive it : Speedboats",
    "release_date": "2016-07-26",
    "developer": [
        "Performance Simulations"
    ],
    "publisher": [
        "Performance Simulations"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Leaderboards"
    ],
    "genres": [
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Indie",
        "Simulation",
        "VR"
    ],
    "achievements": 0,
    "positive_ratings": 28,
    "negative_ratings": 8,
    "price": 18.99,
    "description": "Design and drive your own speedboats with simulation quality physics including blowover/chine walk/porpoising dynamics. Popular with real life boat racers. Free drive anywhere or compete on courses through leaderboards. 40+ adjustable design parameters. Solo developer.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/501090/header.jpg?t=1501372051",
    "minimum_requirements": "OS: Windows 7/8/10 Processor: Hyperthreaded Intel CPU, AMD Athlon Memory: 2 GB RAM Graphics: Shader Model 3.0 graphics card (AMD Radeon HD 5870, nVidia GTX 560) DirectX: Version 11 Network: Broadband Internet connection Storage: 2 GB available space Sound Card: Onboard integrated or Soundblaster compatible soundcard Additional Notes: Full water spray effects require a DX11 capable card with Shader Model 5 support.  Product will run on a lower end card but the spray effects will be limited to rooster tails.   VR requires a higher end card, but not as high as Oculus says is required.  Developer is running a 680X card with this product on a DK2 and it maintains 75fps+.",
    "recommended_requirements": "OS: Windows 7/8/10 Processor: Multi-core CPU (Intel Core i5 or i7, AMD Phenom II QUAD X4) Memory: 4 GB RAM Graphics: AMD Radeon HD 7970, R9 280X, nVidia GTX 680 DirectX: Version 11 Network: Broadband Internet connection Storage: 3 GB available space Sound Card: Soundblaster compatible soundcard",
    "reviews": []
}