{
    "app_id": 501190,
    "name": "Axis Football 2016",
    "release_date": "2016-07-29",
    "developer": [
        "Axis Games"
    ],
    "publisher": [
        "Axis Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Local Multi-Player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Commentary available"
    ],
    "genres": [
        "Simulation",
        "Sports"
    ],
    "tags": [
        "Sports",
        "Simulation",
        "Football"
    ],
    "achievements": 16,
    "positive_ratings": 92,
    "negative_ratings": 28,
    "price": 14.99,
    "description": "Axis Football is a an American football simulation featuring innovative aimed passing and massive customization.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/501190/header.jpg?t=1470059285",
    "minimum_requirements": "OS: Windows 7 or higher Processor: Intel Core2 Duo or better Memory: 4 GB RAM Graphics: DirectX 10.1 compatible 512 MB DirectX: Version 10 Storage: 850 MB available space Sound Card: DirectX 9.0c compatible",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "A game that pales in comparison to Madden, but does show enough potential to keep me interested in how this series develops. I don't regret the purchase and recommend this to anyone who prefers PC gaming ot console gaming. The passing mechanics are unique and a little annoying at first but with practice you should get better. Runnning the ball becomes much more difficult the bigger a lead you have and your O-line tends to disengage blocks sooner when you're ahead. Playing on defense is a little bland due to a lack of abilities and diversity when it comes to how players handle, and your D-lineman gnereally move too slow to sack any QB. I've had fun with this game thus far but can't imagine I'm going to invest as many hours as I have already in the first week in the future.  If you want a football game on your PC and don't like EA then please support this small developer.",
            "review_score": "1"
        },
        {
            "review_text": "This football game brings back memories of Front Page Sports 98. It had a complete franchise system so much better than any madden. I think Axis will be made into the best PC football game ever given more updates",
            "review_score": "1"
        },
        {
            "review_text": "This game is not perfect. That said, it fills a gaping hole that is Steam American Footbal games, and it does so well. There is definitely some things lacking (a more dynamic defense, more play options?) but it defintely slaked my thirst for the genre on steam, and from an indie developer, that is something that should be applauded,",
            "review_score": "1"
        },
        {
            "review_text": "One of the best NFL games on Steam since Madden 08 on PC!!!",
            "review_score": "1"
        },
        {
            "review_text": "so far so good :) keep up the good work ... can't wait to see what else you add to this game ... not to mention its shocking how good this game .",
            "review_score": "1"
        },
        {
            "review_text": "Huge improvement from axis 2015.",
            "review_score": "1"
        },
        {
            "review_text": "I played the Flash version of this game for dozens of hours. I was really expecting to love this.  But it just... isn't fun. It doesn't have the same charm as the flash version. It plays identical as the over-head view yet tries to hamfist those mechanics into 3rd person and the result is terrible. You can forgive a lack of jukes/sprinting/etc when it's overhead, but when it goes third person like this, it just looks and feels terrible. There's practically nothing to do on defense but watch.   Whereas the flash game was unique, this is literally a worse Madden. You would be better off downloading Madden 2008 and playing that. Real shame, I love the flash game but this just feels *nothing* like it unfortunately.  If the game was 5$, I could see keeping this. But at nearly $20, I requested a refund.",
            "review_score": "-1"
        },
        {
            "review_text": "  This is one of the best PC football sim games ever shout out to Danny Jugan and Axis Games for making the game and shout out to Dollar Junior for giving me a free copy he is a really good guy.",
            "review_score": "1"
        },
        {
            "review_text": "Madden 08 is better than this trash",
            "review_score": "-1"
        }
    ]
}