{
    "app_id": 502550,
    "name": "Strike.is: The Game",
    "release_date": "2016-07-14",
    "developer": [
        "Freakinware Limited"
    ],
    "publisher": [
        "Freakinware Limited"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Online Multi-Player",
        "Cross-Platform Multiplayer",
        "In-App Purchases"
    ],
    "genres": [
        "Action",
        "Free to Play",
        "Massively Multiplayer"
    ],
    "tags": [
        "Free to Play",
        "Massively Multiplayer",
        "Action"
    ],
    "achievements": 0,
    "positive_ratings": 1024,
    "negative_ratings": 370,
    "price": 0.0,
    "description": "Load your gun and dominate the best multiplayer mobile shooter game!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/502550/header.jpg?t=1473698795",
    "minimum_requirements": "OS: Windows 7 Processor: 2.33GHz or faster x86-compatible processor Memory: 512 MB RAM Graphics: 128MB Graphic Card Storage: 256 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This gave me cancer faster than Keemstar playing the victim card.",
            "review_score": "-1"
        },
        {
            "review_text": "Congratulations Freakinware Limited, you win the 'Most Unoriginal Game' award! I installed this 'game' just so I could give you this award publicly. And here is an award for you Steam... It's the 'Biggest Pile of Stinking ♥♥♥♥' award for making such games available on your platform.  And here's a big ♥♥♥♥ YOU just because!",
            "review_score": "-1"
        },
        {
            "review_text": "-A ♥♥♥♥ COPY LIKE Mitos.is and Worm.is -No settings to lower the music... -You can register with facebook -Same developers , but they changed their names Freakinware Studios to Freakinware Limited -P2W   I don't know how this ♥♥♥♥ game get good votes on greenlight...",
            "review_score": "-1"
        },
        {
            "review_text": "I was going to shoot my self but i thought thta would give the game to much credit",
            "review_score": "-1"
        },
        {
            "review_text": "Would be fun if the enemies stopped teleporting right in front of my face with shotguns. The movement is jittery and I couldn't use my controller. Uninstalling for now.",
            "review_score": "-1"
        },
        {
            "review_text": "horrible 0/10",
            "review_score": "-1"
        },
        {
            "review_text": "Diep.io but cancerous",
            "review_score": "-1"
        },
        {
            "review_text": "counter strike: cenozoic offensive edition: wowie zowie 7 people find this helpful am i famous",
            "review_score": "-1"
        },
        {
            "review_text": "IT SUCKS ♥♥♥♥ THIS ♥♥♥♥ MAN ",
            "review_score": "-1"
        },
        {
            "review_text": "Its a good game for someone who want to relax from his own game. Recommend",
            "review_score": "1"
        },
        {
            "review_text": "I can't login with facebook si says me just sing in and i need to put a new email",
            "review_score": "-1"
        },
        {
            "review_text": "first mitos.is then worm.is now strike.is next is.is  #HYPE",
            "review_score": "1"
        },
        {
            "review_text": "love this game!!! like the .io games ",
            "review_score": "1"
        },
        {
            "review_text": "Spent about as much time playing as the producers spent making the game.",
            "review_score": "-1"
        },
        {
            "review_text": "go play Diep.io  I would place a review for that game here for comparison but that might get this one flagged as off topic.  This game is clunky the guns dont feel like they add much in the way of strategy, no gun = bad, any gun = good. yes they have different tactics but they dont feel particularly varied.",
            "review_score": "-1"
        },
        {
            "review_text": "On word for it : unoriginal. all what tis company doing is to copy from another web-games and put them on steam",
            "review_score": "-1"
        },
        {
            "review_text": "Bad clone of diep.io",
            "review_score": "-1"
        },
        {
            "review_text": "One Word              Amazing",
            "review_score": "1"
        },
        {
            "review_text": "Not that good, at all. A poor attempt to remake Diep.io. Unlike Worm.is  Still, I have to give them some credit. It isn't Mitos.is bad. ★★ / ★★★★★",
            "review_score": "-1"
        },
        {
            "review_text": "Bad game, AK is ♥♥♥♥ing garbage, and doesnt have 30 round magazine. Every gun overtaken by a shotgun seriously",
            "review_score": "-1"
        },
        {
            "review_text": "I have 5 minutes on this game for the review. That is literally the entire reason i downloaded it.     This game continues Freakinware's ♥♥♥♥♥♥ knockoffs of the .io games, this one being an akward mix of diep.io, agar.io, and counter strike, hence the name, strike.is. Somehow they haven't been DMCA'd yet (like the agar.io DMCA went, ha ha) but that should change soon. Honestly, this game is worse than worm and mitos, simply becuase there's TOO MANY PEOPLE!!! Have more servers or something, but the maps are so small (something you like to do) and there are so many people that you just run into someone every 0.1 seconds! Come on, just please don't make Plane.is. Or fly.is, or aero.is.      PLEASE!!!",
            "review_score": "-1"
        },
        {
            "review_text": "horrible ripoff i hope thay burn this -1000000000000000000000/10",
            "review_score": "-1"
        },
        {
            "review_text": "Really fun but the scoring needs to be tweaked, especially on free for all. I can have 6 more kills than someone with the same amount of deaths, but they come in first because they have an 8 person killstreak vs. my 6. Also needs to fix team ballance issues, especially with team fortress mode.",
            "review_score": "1"
        },
        {
            "review_text": "COOL GOOD GAME",
            "review_score": "1"
        },
        {
            "review_text": "great game but way to laggy",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing, its really addicting for all the people who don't reccomend the game. They are probably kids who raged at the game because they are bad at it. The game is really fun and I enjoy playing it, It has a few bugs like the Leaderboard you can sometimes get stuck in. Other than that this game is really challenging. I reccomend this game to anyone who looks at this.",
            "review_score": "1"
        },
        {
            "review_text": "its.lit.fam.",
            "review_score": "1"
        },
        {
            "review_text": "Good addicting fun",
            "review_score": "1"
        },
        {
            "review_text": "It is a game for those moments when you get bored and the day is coming apocalypse and you're bored of life ...... so I recommend",
            "review_score": "1"
        },
        {
            "review_text": "after update this game definently has improved. although the store still has glitches i feel it still has potential as a .io game",
            "review_score": "1"
        },
        {
            "review_text": "If your seeing this review, thank you for clicking the positive section to actually see reviews and not morons screaming their lungs out, i'd like to mention this isnt the original review also, This is a updated version as my old one was pretty bare boned, thank you. ------------------------------------------ This game, on paper, looks like a horrible ripoff, and i can agree with that, But, if you actually play the game, it really isn't, it is quite different.  First of all you don't level up and upgrade to different guns like in diepio, instead, When you spawn in, you get a pistol, and you can run around the map and find i think 6 different guns, I personally enjoy this more than a upgrading tree as it can be awfully confusing to remember what links to what, while here you can find your gun and grab it.  You also dont have unlimited ammo, Instead you grab bullets off of the ground like how you get dots in agario, and you do have to reload, i really like this as it takes more skill and awareness to actually shoot, get behind cover and reload instead of just shooting at whoever for an infinite amount of time.  This is something i really like, You can buy skins with in-game coins, pretty generic, atleast it isnt behind a pay wall, but what is awesome is you can make your own skins! I really like this as using premade skins can get old, and diepio doesnt even have skins.  Also whoever says this game is pay-2-win is a ♥♥♥♥ing moron, You earn coins in-game, and as far as i know you cant buy them, They're scattered around the map and you can also earn them from lootboxes that you get randomly while playing.  There is also a in-game chat, which is cool, and a friends system along with a invite system, Very cool if you want to play with friends, very easy to manage too.  You can buy a starter gun for 200 coins at the shop which as far as i know lasts for 100 matches, you can buy any gun in the game which is sweet.  TL;DR: If you like diep.io, you'll like this. Overall: 7/10  ------EDIT----- here's a list of suggestions and some things that need to be tweaked. I only made this for the devs.  Suggestions = * Tweaks = -  *I think they're should be melee weapons, but some generic stuff like a knife, a sword, etc.  *Here's a gamemode idea: Capture the flag, You get into the enemy's base and capture the point, and theres a decently sized map, nothing special.  *I think you should be able to purchase any gun that can last forever for.....maybe 1000 coins so its fair.  -Shotgun damage needs to be nerfed or the sprint needs to be changed to like a focused shot or something, I got a 20 kill streak in a game i played a minuite ago without even trying.  -The Ability on the machine gun makes no sense, change it into something like the dual pistols, a burst of damage, not a zoom.  -Make team fortress require less players, its hard to find a game without people constantly leaving the queue.  -You can teleport into walls with the tesla gun and the walls shoot you out and you get extra range out of it, please change this.  -This is nitpicking, yes, but make lootboxes drop more often, in mitos.is you get them so often and here you barely get any.",
            "review_score": "1"
        },
        {
            "review_text": "Many People think this game is a Complete Ripoff of Diep.io. It actually is quite diffrent from Diep.io.  I would recomend you to atleast try this out for yourself, as its a free game and its quite fun.  You Play as a Cell with a gun? (Idk why but whatever) and you go around shotting people and collecting better guns and using diffrent abilitys that come with the guns (Ie. the laser rifle allows teleporting, smaller guns allow Sprinting, And bigger guns allowyou to scopeand get high damage shots).  This game is its own game and it is quite addicting and fun to play.",
            "review_score": "1"
        },
        {
            "review_text": "shotguns are to ♥♥♥♥ing op but besides that its a pretty good and addicting game and i recommend this game",
            "review_score": "1"
        },
        {
            "review_text": "I found the game alot of fun, and quite addicting, it's alot of fun to play with friends and I cant wait till the game updates and new features get added, although it can seem like a bit of a cash grab at times",
            "review_score": "1"
        },
        {
            "review_text": "A great game deserves more! I like the gameplay is different from the other games of the same type. from me you positive. Continue to update and are getting new features, new game modes and something to attract players.rii.",
            "review_score": "1"
        },
        {
            "review_text": "I am writing this review for free moneh, this game is crappy doe",
            "review_score": "1"
        },
        {
            "review_text": "This game si so addicting and fun!!!     10/10 would shoot little kid heads again :)",
            "review_score": "1"
        },
        {
            "review_text": "Simple but efficent! It's like a drug!!!!",
            "review_score": "1"
        },
        {
            "review_text": "&gt;went to game &gt;stayed for some more &gt;got 15 lvl &gt;went to store &gt;saw pepe da frog as avatar 4 our circle &gt;uninstalled &gt;killed my self  9/11 would do it again",
            "review_score": "1"
        },
        {
            "review_text": "why did all your games such as mito strike and worm.is throw me out and put me back in?",
            "review_score": "-1"
        },
        {
            "review_text": "I like this game.It is fun to play as circles and shoot other circles.It really makes me think is life one circle or is it a square.I think that Donald Trump should be a skin so I can shoot a circle that looks like Trump.",
            "review_score": "1"
        },
        {
            "review_text": "Not a bad game tbh",
            "review_score": "1"
        },
        {
            "review_text": "Boring game. It's just the .io games with in game purchases But it's not the worst game I've played.",
            "review_score": "-1"
        },
        {
            "review_text": "too lag  I love this game but can't you finding a better server?",
            "review_score": "-1"
        },
        {
            "review_text": "I love this game",
            "review_score": "1"
        },
        {
            "review_text": "It's not that good but still try it",
            "review_score": "-1"
        },
        {
            "review_text": "'Greatest' Overwatch clone I've ever had the grace of playing.",
            "review_score": "-1"
        },
        {
            "review_text": "I dont realy see it as a copy of deip.io i do have to say tho the only reason i have it is for the other two games soo it by it self is eh",
            "review_score": "1"
        }
    ]
}