{
    "app_id": 502750,
    "name": "Quest for Glory 1-5",
    "release_date": "2016-08-29",
    "developer": [
        "Sierra"
    ],
    "publisher": [
        "Activision"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "1990's",
        "1980s"
    ],
    "achievements": 0,
    "positive_ratings": 141,
    "negative_ratings": 11,
    "price": 7.99,
    "description": "The world of Gloriana, with all its wonderful diversity, awaits you.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/502750/header.jpg?t=1472524232",
    "minimum_requirements": "OS: Windows XP / Vista / 7 / 8 / 10 Processor: 1.8 GHz Memory: 512 MB RAM Graphics: DirectX 7 Compatible 3D Card DirectX: Version 7.0 Storage: 2 GB available space Sound Card: DirectX Compatible",
    "recommended_requirements": "Memory: 1 GB RAM Graphics: DirectX 9 Compatible 3D Card DirectX: Version 9.0",
    "reviews": [
        {
            "review_text": "I have played the Quest for Glory series for over 20 years now. After 20 years of playing the series, I still start each game with the same sense of fun I started with. This series is well told, with an entire world, lore, characters, magic and strategies to learn. It would not be an exaggeration to say that this diverse story and characters taught me to not only enjoy reading and storytelling, but learning about the entire cornucopia of mythologies and legends the Coles pulled from when designing this brilliant series.  And you aren't limited in your playing style, and once is far from over! Play as a Fighter who can cast spells. Or next time, a Magic-User who can pick locks! And when you are finished the first game, take your character with you to the next game in the series, and continue the story. Then do it again with games 3, 4 and 5. This feature adds layers upon layers to the replayability of not just one game, but multiple games!  And if anyone loves speedrunning... try this game. There are multiple classes, and avenues, and methods. :) I recommend it to everyone.",
            "review_score": "1"
        },
        {
            "review_text": "I started writing a review before I read the others and realized I was basically saying the same stuff. Therefore, I will make mine short. Quest for Glory is my favorite series of all time (like everyone else that has posted a review). The writing in these games (and many of the other Sierra titles) is simply outstanding. A lot of it is poetic, and there are also MANY puns. I'm just sayin'. You try writing a game where a large portion of the text follows a rhyming scheme.  My Mom once asked me, 'What's a shaman?' I told her it's kind of like a tribal witch-doctor thing. She said, 'How did you know that?' I told her Quest for Glory 3.  When I saw Quest for Glory 5 in a store called Software Etc. it was an insta buy. And mind you this was on a pre-teen lawnmower budget. I probably had to take a mortgage out on my lawnmower to afford it.  I bought this game on GoG. I bought this game on Steam. I own two anthology CDs and have a copy of QFG5 and a QFG5 soundtrack CD that came with one of the anthologies. If it is released for Uplay and Origin, I'll buy it there too. I like this game so much that I was wishing there was going to be another one (or something at least like what they did with the King's Quest reboot that recently came out). Then I got the idea, 'Hey I wonder if there's a kickstarter or something?' Corey Cole does indeed have a kickstarter project. Guess who just pre-ordered his game? MInd you, I NEVER preorder games, as it goes against my moral code. You should preorder it too. No? What if I told you there was a picture of a meep wearing a baseball cap on the site? NO ONE can resist the power of the meeps.  Anyway, I wholeheartedly recommend this game with every fiber of my being. In fact, I like this game enough that if I had outrageous amounts of disposable income, I would buy the rights to QfG 5 and have it redone proper (it's still good, buuut production got cut so it was never truly 'finished').  FINALLY, if you read this in the next couple days there is currently a Sierra humble bundle. I recommend the whole thing for $20, I tried the King's Quest reboot and it's pretty good.",
            "review_score": "1"
        },
        {
            "review_text": "Point &amp; click adventure / RPG hybrid. Adventure/character/story elements are the strongest while RPG is limited. Many puzzles of each game in the series had different solutions based on your character's abilities or your choices. This mix of different elements was and still is unique.",
            "review_score": "1"
        },
        {
            "review_text": "Only game where dying makes you laugh, amazing series that everyone should play at least once in their multiple life times.",
            "review_score": "1"
        },
        {
            "review_text": "So, you want to be a Hero?  This is the game for you. Not necessarily ALL who apply will become heroes.   Please send your resume to The Famous Adventurers' Correspondence School for Heroes, address found in your local adventure guild.  -----------------------------  With that out of the way i'll give a basic rundown of all the games:  QFG 1: (EGA): Baba Yaga Teaches Typing QFG 1: (VGA): Erasmus &amp; Fenrus Teaches Clicking QFG 2: Furries in the Middle East, and learning how to read a map QFG 3: Furries in Africa, and minigame spamming QFG 4: Slav pride world wide, and learning to cope with bugs QFG 5: We're sorry we made this.  Overall a great series with at least 2-3 times replayability since each puzzle has a way to solve it depending on stats.",
            "review_score": "1"
        },
        {
            "review_text": "The Quest For Glory Collection is a convenient way to purchase and play 4 of the best games I have ever played. Is that statement tainted with some nostalgia? Probably. However, I can assure you that I have played the series a number of times throughout my life. That is quite rare for me.  The key to the longevity of my enjoyment of Quest for Glory is its balance between humour, creative storytelling, and emotional weight. Not every moment of the game is laugh out loud funny, but many are. Tropes of heroic adventures are used, but often subverted when doing so serves a greater purpose. Emotional connection to memorable locations and characters is slowly ramped up until the finale act of each game requires true heroism on the part of the characters.  While the graphics of the game in no way hold up to the modern capabilities of computers, that is not necessary for a series so steeped in its own well though out mythology. The storytelling of Quest For Glory is wonderful and entertaining, and in the end that is what we seek when we play games. We wish to be entertained.",
            "review_score": "1"
        },
        {
            "review_text": "I love this series so much!!! So much fun! such a great story!  If you have the opportunity, buy it!!!",
            "review_score": "1"
        },
        {
            "review_text": "Quest for Glory 4 and the remake for 1 are two of the best games ever made. Great story and RPG mechanics, weird but entertaining combat systems, narration rivals Bastion.",
            "review_score": "1"
        }
    ]
}