{
    "app_id": 502770,
    "name": "Voodoo Garden",
    "release_date": "2016-08-04",
    "developer": [
        "M. Hanka"
    ],
    "publisher": [
        "Liu Lidan"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Casual",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Casual",
        "Indie",
        "Simulation"
    ],
    "achievements": 33,
    "positive_ratings": 380,
    "negative_ratings": 124,
    "price": 1.99,
    "description": "Welcome to the Voodoo Garden! You're owner of a little hut in a bustling swamp. With the help of little spirits you can earn powers and gold by producing various voodoo supplies.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/502770/header.jpg?t=1478331992",
    "minimum_requirements": "OS: Windows 7, 8, 10 Processor: 1.6 GHz Memory: 1 GB RAM Graphics: 128 MB Storage: 50 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "A clicker game basically. You make a garden and grow different plants by collecting money. The higher your level, the more money you get. This is definetly a casual game. The achievements are time consuming to get, as you need to get xx amount of things in the game, and may take awhile to get them. It takes alot of clicks to get everything. This is not really my type of game, but compared to some other steam games, it is pretty stable and bug free as i can see.  I got this game for free via a contest for haloween. I must thank the person who gave this to me for the contest.  Recommended for achievement hunting and casual playing.",
            "review_score": "1"
        },
        {
            "review_text": "Have you never had a Repetitive Strain Injury?  Have you never blown up a mouse from mashing the LMB forcefully and rapidly? Have you never raged because bats were stealing all of your stuff? Have you never overfed a cute animal until it become obese enough to kill for a voodoo ritual?  Would you like to?   If you answered 'YES!' to these questions,-   This is the game for you!!!    Okay, seriously...  The game is very well made, and plays very well. The graphics are a good fit for the game, rather simplistic, cute, and colorful. It's an easy game to play, not a ton of real thought needed. Sound quality is good, and sound effects are good, if a bit boring and repetative. Ran very well on a toaster. Probably better on a cell phone or tablet, but not hard on a low end rig.    A TON of clicking.   A TON of clicking and clicking.   Did I mention a TON of clicking?   Cute game, will take forever to grind out some of the achievements, because you have to click the same thing 1000 tines to get them. Very casual, good time waster for long car or bus rides (where you are not the driver), or sitting and waiting for something or someone (great for sitting in a waiting room at the doctor's office).  Not a 'must have' by any means, but still fun, and oddly addictive. In spite of the fact that you know your mouse and clicking finger will regret it later. Not recommended to play while sitting in church or letting your boss catch you wasting time at work (you'll be thrown out on your rump in either case...). But worth it if you get it on a good sale and are looking for mindless clicking to kill some time. And some chickens, rabbits, pigs, and other cute animals. NOT recommended if you have an unnatural fear of sneaky, thieving bats. :D  7/10 overall",
            "review_score": "1"
        },
        {
            "review_text": "This game is one part clicker game with one part idle game, seasoned in with a smidgen of crafting and topped off with adorableness. A great simple game to zone out to. Super affordable, low key and chill background music. Beatable in a short amount of time (I’ve played it about 18 hrs at posting this, seen several people beat it in about 15 or less) in case that would interest you.  Basically: super cute. Recommended buy! :)",
            "review_score": "1"
        },
        {
            "review_text": "Wait until it is on sale, this game is not worth full-price because of how dull it is unless you like games where you stare at one screen clicking stuff very 2 seconds and that is really it.  7 hours and I am only level 16 out of 30, there is an idea of how slow and grindy this game is   + Nice style + Good Theme + Simple  - No offline collecting - Too much clicking - Lack of a tutorial   The game does look nice and at first looks like one of those idle-collector games like Plantera. However the game only collects when you have it open, even if you have spirits (who SLOWLY collect things for you) they will not collect while offline. This make the game boring and seem too much of a grind-fest to be fun.   Spirits will NOT even collect certain items until you have leveled up to a certain level. Because of this you are needed to click on items to get them yourself. To be honet you are quicker anyway, even at max-level your spirits are slow at collecting and this is made worst with the fact you yourself are the only one who can collect items off animails such as frog legs and fangs.  This means you cannot leave it in the background while you do something else unless you only want the low-paying potions which makes leveling up and buying stuff even more painful. The money-making is slow but items cost way too much compared to what you are making.  There is really no gameplay to it but waiting for stuff to grow, collect it and repeat. It would of worked better if it did let you collect offline once you have the spirits and if a certain spirit actually collected parts off animals or scared off the annoying bats -_-  I would not reccommend this unless it put in an idle feature to collect stuff while offline, otherwise I see no enjoyment of a clicking-simulator. Heck there are more fun ones out there that are actually free.",
            "review_score": "-1"
        },
        {
            "review_text": "Fun and has easy achieves :D",
            "review_score": "1"
        },
        {
            "review_text": "i finished the game totally . unlocked all succes . almost 15h of fun , clicking , upgrating , selling voodoo stuff and yelling at thief bat . and for 3 euro ? totally happy  still , its not a IDLE game , its a click game ! at first you will click a lot , once you got spirit , they will help you and collect ressource , but you will still need to click on frog/lizard/snail for get their ressource . game is not perfect , but for quality/price , it totally won   who do the voodoo ♥♥♥♥♥ ? well i do , and i didnt regreted it !",
            "review_score": "1"
        },
        {
            "review_text": "Such a cute little casual game. Good for wasting time here and there. The music is very soothing and never gets old.",
            "review_score": "1"
        },
        {
            "review_text": "You are gonna click a lot. You will get exausted and hate it. But every now and then, you will miss clicking and come back to this ♥♥♥♥♥. Totally acceptable game for a $3.",
            "review_score": "1"
        },
        {
            "review_text": "basically like a other click game and got tired of it quickly",
            "review_score": "-1"
        },
        {
            "review_text": "I had spent a lot of time on Plantera and was looking for another really cute clicker. Compared to Plantera... Voodoo Garden is a lot less relaxing and takes a bit more strategy since you're trying to grow ingredients for potions to make money. Also, you have to do some fast clicking to keep those bats from stealing from your garden. I have found the controls somewhat annoying. Scrolling horizontally is a pain once your garden becomes large enough and sometimes you'll accidentally pick up things you don't want to while you're clicking (Which seems like a huge oversite for a CLICKER game, they should patch it so you have to enable some sort of mode if you want to move/delete things in your garden.)  All in all. It has a really cute style and I would reccommend it to fans of the genre.",
            "review_score": "1"
        },
        {
            "review_text": "This game is very adorable. It has a learning curve, but it's easy to figure out so that's not such a big deal. It's very much about clicking.",
            "review_score": "1"
        }
    ]
}