{
    "app_id": 502880,
    "name": "The Janitor",
    "release_date": "2016-07-19",
    "developer": [
        "VOS Gaming"
    ],
    "publisher": [
        "VOS Gaming"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "Horror"
    ],
    "achievements": 6,
    "positive_ratings": 26,
    "negative_ratings": 77,
    "price": 0.79,
    "description": "Max Taylor, a janitor, who is send to an abandoned asylum once guarded by the army. When he enters he gets in contact with a went-wrong experiment of the government and has to worry about his live! On the way to exit he has to struggle with the horrific manlike creature!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/502880/header.jpg?t=1468913341",
    "minimum_requirements": "OS: Windows XP SP2+ Processor: Athlon 64/Intel Pentium 4 Memory: 3 GB RAM Graphics: DX9 with SM2.0 or higher / minimum of 2gb graphic ram DirectX: Version 9.0 Storage: 3 GB available space",
    "recommended_requirements": "OS: Windows 7 or higher Processor: AMD FX4300/Intel Core i3 or higher Memory: 4 GB RAM Graphics: DX11 with SM3.0 or higher / minimum of 4gb graphic ram DirectX: Version 11 Storage: 3 GB available space",
    "reviews": [
        {
            "review_text": "This game could have some potential but its just too broken honestly. It does have a decent atmosphere but there's a constant groaning in the background that doesn't stop. The monster itself is pretty dumb, not just in appearance but in its behavior as it very very quickly gives up chase and walks into walls constantly.   I honestly can't recommend this game unless you're like me and like checking out broken games. I made a gameplay video so check it out and save yourself some money.   www.youtube.com/watch?v=V0I6CnN8Wbw ",
            "review_score": "-1"
        },
        {
            "review_text": "  Janitor is a short horror game on Unity. If you die - you gonna start from the very beginning. But it's not a problem, because you can speedrun the whole game in 2 (two!) minutes. Of course, if you know what to do, and this is the only real problem of the game. Steam store description gives you the plot (what's the problem to put the text in the game?), but it's still unclear, how to repair an elevator, where to find tools and spare parts and so on. My friend made very helpful   walkthrough . Use it if you get stucked like me. The golem is slow and stupid, it's easy to overrun him, but he doesn't give up and you should turn around really often, if you want to live. It's short, as I said, but it's funny to start again and run around, looking for different interesting things scattered here and there. The game is cheap, so I would recommend it for killing one boring evening.  P.S. There's a ♥♥♥♥♥♥♥ chainsaw in one room! I want to grab it and fight that clay ♥♥♥♥♥♥♥, but can't! Why, developers?!! 8'(",
            "review_score": "1"
        }
    ]
}