{
    "app_id": 502940,
    "name": "Calm Down, Stalin",
    "release_date": "2016-09-08",
    "developer": [
        "Cartboard Games"
    ],
    "publisher": [
        "Cartboard Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Casual",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Casual",
        "Memes"
    ],
    "achievements": 16,
    "positive_ratings": 561,
    "negative_ratings": 84,
    "price": 2.79,
    "description": "Calm Down, Stalin is a game where you directly control your hands to threaten your enemies with nuclear weapons by moving your finger closer to The Button while signing important state papers, answering phone, dealing with your subordinates and most of all - fighting the stress of your position by smoking your pipe and any other available",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/502940/header.jpg?t=1493994838",
    "minimum_requirements": "OS: Windows Vista Processor: 3 GHz 2 Core Memory: 2 GB RAM Graphics: 1GB dedicated DirectX: Version 10 Storage: 500 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Beating a malfunctioning lamp and threatening my enemies with nukes is the highlight of my day.   Then I come home and get to do it again on Calm Down, Stalin.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty short game, but it has some pretty tough and unique mechanics by the end of the game.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Politics Simulation",
            "review_score": "1"
        },
        {
            "review_text": "So much memes. I love this game",
            "review_score": "1"
        },
        {
            "review_text": "This game proves that i can run a country just by smoking my pipe and drinking vodka while threathening filthy Capitalists with a Nuclear Holocaust.",
            "review_score": "1"
        },
        {
            "review_text": "It is rarely happening that a game makes you learn about history while having a lot of fun doing so. I was unable to imagine having all the stress Stalin had. But now that I can joyfully experience what it's like getting through a regular business day of Stalin, I feel much closer to history. I think it is important to learn and understand what happened during the last few decades.  This game's immersive gameplay makes your kids certainly wanna learn more.  This game is a must have and I can imagine it becoming the next big classic hit everyone will still talk about even in 50 years.",
            "review_score": "1"
        },
        {
            "review_text": "Slightly irritating at times. But pure gold. And it's only 4 bucks.",
            "review_score": "1"
        },
        {
            "review_text": "Can somebody help me? When i try to lauch the game, it says : Error. The following components are required to run this program, Microsoft Visual C ++ 2015 Runtime, would you like to install them now? Then, I installed that, and when i runned the game , its said the same thing, everytime i try to launch the game. Can someone help me?  ",
            "review_score": "1"
        },
        {
            "review_text": "This is gameplay",
            "review_score": "1"
        },
        {
            "review_text": "  ♥♥♥♥ BLKYAT (needs work its too repedative atm)",
            "review_score": "1"
        },
        {
            "review_text": "This game has a certain Time limit to win. It stresses you. Test of Time is the award it needs.",
            "review_score": "1"
        },
        {
            "review_text": "I really like the original gameplay.  However, I frequently encounter bugs in the game. For example, some items keep on making a lot of noise when placed on the table, as if they were constantly hitting something, even though they are at rest. Also, I am sometimes unable to pick up items.  In my opinion, this game should therefore still be in early access. Had it been still in early access, then I would have given the game a thumbs-up. However, since the developer and/or publisher has decided to declare the game as finished and release it in its current state, I will give the game a thumbs-down, at least until these issues are resolved.",
            "review_score": "-1"
        }
    ]
}