{
    "app_id": 503340,
    "name": "Dig 4 Destruction",
    "release_date": "2016-08-14",
    "developer": [
        "COLOPL, Inc."
    ],
    "publisher": [
        "COLOPL, Inc."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Online Multi-Player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Casual",
        "Massively Multiplayer"
    ],
    "tags": [
        "Action",
        "Casual",
        "Massively Multiplayer"
    ],
    "achievements": 30,
    "positive_ratings": 102,
    "negative_ratings": 8,
    "price": 8.99,
    "description": "The first of its kind! A first for VR! An intense online multiplayer deathmatch game where you must dig through the earth and excavate weapons to battle your enemies! *Coming Soon to the Oculus Touch!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/503340/header.jpg?t=1480990890",
    "minimum_requirements": "OS: Windows 7/8.1/10 64bit Processor: Intel Core i5-4590 Memory: 8 GB RAM Graphics: NVIDIA GeForce GTX970、AMD Radeon R9 290 DirectX: Version 11 Storage: 1 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Fun shooter with a unique digging mechanic. Only complaint is not enough people playing online but, when I've been able to find people and have a match, it's been a blast. I will keep trying.",
            "review_score": "1"
        },
        {
            "review_text": "Welcome to Dig 4 Destruction! This is the competitive FPS where you giggle like a school girl the whole match.  I like the concept of digging into the ground to find weapons and power ups. The lobby is well made and the whole feel of the game is good.  There is a limitation on maps, but since you will end up by digging most of it away, it doesn't really matter.  The tradeoffs in 1on1 really depends on range and weapon, but most of the time you will be fighting in close range but nothing beats the feel of getting close to your enemy armed with a grenade and a stealth potion and gently placing the grenade next to your victim, pull back a little and see the sucker blow up :D  Or just surprise your enemy with a frying pan and beat the ♥♥♥♥ out of him. My mom would be so proud.  What is already there: -Fun gameplay. -Good animations and graphics. -Good amount of weapons to choose from. -POWER UPS!  What i hope to see: -More power ups -Map editor (would be a good game for that) -Team deathmatch and/or other game modes -more players = more to play with",
            "review_score": "1"
        },
        {
            "review_text": "This game is great!",
            "review_score": "1"
        }
    ]
}