{
    "app_id": 503630,
    "name": "INVASION!",
    "release_date": "2016-10-12",
    "developer": [
        "Baobab Studios Inc."
    ],
    "publisher": [
        "Baobab Studios Inc."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure",
        "Casual"
    ],
    "tags": [
        "Adventure",
        "Casual",
        "VR"
    ],
    "achievements": 0,
    "positive_ratings": 128,
    "negative_ratings": 13,
    "price": 0.0,
    "description": "Narrated by Ethan Hawke and created by the director of Madagascar, INVASION! is a colorful VR animated short about a duo of aliens with grand ambitions to take over our world. Instead, they are greeted by two adorable, white bunnies…..and you are one of them! Come experience what happens!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/503630/header.jpg?t=1481679597",
    "minimum_requirements": "OS: Windows 7 Processor: Intel Core i5 4590 or greater Memory: 8 GB RAM Graphics: GeForce GTX 970 or AMD Radeon R9 290 or better DirectX: Version 11 Storage: 2 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Very well done - adorable and straight to the point.",
            "review_score": "1"
        },
        {
            "review_text": "look if you havent got a decent download speed dont bother, while it is well made, its 6-7 minute run time isnt worthwhile for a 'trailor' that doesnt do much, luckily im not one of those slow downloaders and i got to watch it just to remove it",
            "review_score": "1"
        },
        {
            "review_text": "Super cute, very pixar-ish and thoroughly enjoyable :)",
            "review_score": "1"
        },
        {
            "review_text": "GTX 970, Core i5 2500K, 16GB RAM  This film runs smoothly on my hardware.  The film feels reminiscent of Looney Toons cartoons where Bugs Bunny would always get the better of whomever is trying to hunt him. The animators did a great job at giving life to the few characters in this film. A fun watch.",
            "review_score": "1"
        },
        {
            "review_text": "Very cute short VR film Can't wait for more!",
            "review_score": "1"
        },
        {
            "review_text": "Cute short film that is worth giving a watch. This is a nice film to show to non-gamers who want to try VR. It only lasts around 3-4 minutes but it shows what is possible in VR.",
            "review_score": "1"
        }
    ]
}