{
    "app_id": 503830,
    "name": "The Life Of Greather",
    "release_date": "2016-08-25",
    "developer": [
        "GreatherGames"
    ],
    "publisher": [
        "GreatherGames"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Adventure",
        "RPG",
        "Indie"
    ],
    "achievements": 0,
    "positive_ratings": 14,
    "negative_ratings": 23,
    "price": 1.59,
    "description": "You are just a simple farmer, your wife has not returned. Venture across this open medieval world and find her.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/503830/header.jpg?t=1547435586",
    "minimum_requirements": "Requires a 64-bit processor and operating system OS: Windows 7 , 8 , 10 Processor: Intel Celeron G1840 or equivalent Memory: 8 GB RAM Graphics: Nvidia Geforce Gtx 650 Ti 1GB or equivalent Storage: 1500 MB available space Additional Notes: 1280 x 720 minimum supported resolution",
    "recommended_requirements": "Requires a 64-bit processor and operating system",
    "reviews": [
        {
            "review_text": "The gameplay isn't too bad except for the framerate and the fact that the dagger is hands down the best weapon. It tries to sell itself as a grimdark realistic game, but some of the first enemies you encounter are bandits wearing skulls with golden battleaxes. Fetch quests are used to make the game last longer. They don't even make any sense in the context of what's happening.   There's no music. There are almost no sounds at all. The voice acting isn't the worst but the recording software/hardware seems like it was bad.  The ending was one of the worst endings I've ever seen. I can't recommend the game just because of the ending.  I'd like to see what the dev could do with time and money though. Perhaps a story writer as well.  For $2 it's not the worst game ever.",
            "review_score": "-1"
        },
        {
            "review_text": "spent some time looking for my wife, stabbing cows, stabbing villagers, stabbing guards then i jumped into a lake for a swim but i died great game 5/7 perfect  also graphics are top knotch, first game i played since getting my gtx1080 that managed to drop frames. well done",
            "review_score": "1"
        }
    ]
}