{
    "app_id": 504770,
    "name": "Slavistan",
    "release_date": "2016-07-29",
    "developer": [
        "Free Candy Games"
    ],
    "publisher": [
        "Free Candy Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Stats"
    ],
    "genres": [
        "Action",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Indie",
        "Simulation",
        "Action"
    ],
    "achievements": 0,
    "positive_ratings": 666,
    "negative_ratings": 61,
    "price": 1.59,
    "description": "Hello Comrades ! You think you got what it takes to be tru slav? Then we have game for you ! Prove to all your gopnik friends that you are the superior alpha slav your babushka always wanted you to be.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/504770/header.jpg?t=1470078868",
    "minimum_requirements": "OS: Windows 7/8/10 Processor: Dual core Intel or AMD Memory: 2 GB RAM Graphics: 256Mb or higher Storage: 100 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "9/10 Not enough Uncle Boris.",
            "review_score": "1"
        },
        {
            "review_text": "orn in Austria in 1889, Adolf Hitler rose to power in German politics as leader of the National Socialist German Workers Party, also known as the Nazi Party. Hitler was chancellor of Germany from 1933 to 1945, and served as dictator from 1934 to 1945. His policies precipitated World War II and the Holocaust. Hitler committed suicide with wife Eva Braun on April 30, 1945, in his Berlin bunker.  Early Years  Dictator Adolf Hitler was born in Braunau am Inn, Austria, on April 20, 1889, and was the fourth of six children born to Alois Hitler and Klara Polzl. When Hitler was 3 years old, the family moved from Austria to Germany. As a child, Hitler clashed frequently with his father. Following the death of his younger brother, Edmund, in 1900, he became detached and introverted. His father did not approve of his interest in fine art rather than business. In addition to art, Hitler showed an early interest in German nationalism, rejecting the authority of Austria-Hungary. This nationalism would become the motivating force of Hitler's life.  Alois died suddenly in 1903. Two years later, Adolf's mother allowed her son to drop out of school. He moved to Vienna and worked as a casual laborer and a watercolor painter. Hitler applied to the Academy of Fine Arts twice, and was rejected both times. Out of money, he moved into a homeless shelter, where he remained for several years. Hitler later pointed to these years as the time when he first cultivated his anti-Semitism, though there is some debate about this account.  At the outbreak of World War I, Hitler applied to serve in the German army. He was accepted in August 1914, though he was still an Austrian citizen. Although he spent much of his time away from the front lines, Hitler was present at a number of significant battles and was wounded at the Somme. He was decorated for bravery, receiving the Iron Cross First Class and the Black Wound Badge.  3 GALLERY 3 Images Hitler became embittered over the collapse of the war effort. The experience reinforced his passionate German patriotism, and he was shocked by Germany's surrender in 1918. Like other German nationalists, he believed that the German army had been betrayed by civilian leaders and Marxists. He found the Treaty of Versailles degrading, particularly the demilitarization of the Rhineland and the stipulation that Germany accept responsibility for starting the war.  After World War I, Hitler returned to Munich and continued to work for the military as an intelligence officer. While monitoring the activities of the German Workers’ Party (DAP), Hitler adopted many of the anti-Semitic, nationalist and anti-Marxist ideas of DAP founder Anton Drexler. Drexler invited Hitler to join the DAP, which he did in 1919.  To increase its appeal, the DAP changed its name to the Nationalsozialistische Deutsche Arbeiterpartei (NSDAP). Hitler personally designed the party banner, featuring a swastika in a white circle on a red background. Hitler soon gained notoriety for his vitriolic speeches against the Treaty of Versailles, rival politicians, Marxists and Jews. In 1921, Hitler replaced Drexler as NSDAP party chairman.  Hitler's vitriolic beer-hall speeches began attracting regular audiences. Early followers included army captain Ernst Rohm, the head of the Nazi paramilitary organization, the Sturmabteilung (SA), which protected meetings and frequently attacked political opponents.  On November 8, 1923, Hitler and the SA stormed a public meeting of 3,000 people at a large beer hall in Munich. Hitler announced that the national revolution had begun and declared the formation of a new government. After a short struggle including 20 deaths, the coup, known as the 'Beer Hall Putsch,' failed.  Hitler was arrested three days later and tried for high treason. He served a year in prison, during which time he dictated most of the first volume of Mein Kampf ('My Struggle') to his deputy, Rudolf Hess. The book laid out Hitler's plans for transforming German society into one based on race.  Rise to Power  The Great Depression in Germany provided a political opportunity for Hitler. Germans were ambivalent to the parliamentary republic and increasingly open to extremist options. In 1932, Hitler ran against Paul von Hindenburg for the presidency. Hitler came in second in both rounds of the election, garnering more than 35 percent of the vote in the final election. The election established Hitler as a strong force in German politics. Hindenburg reluctantly agreed to appoint Hitler as chancellor in order to promote political balance.  Hitler used his position as chancellor to form a de facto legal dictatorship. The Reichstag Fire Decree, announced after a suspicious fire at the Reichstag, suspended basic rights and allowed detention without trial. Hitler also engineered the passage of the Enabling Act, which gave his cabinet full legislative powers for a period of four years and allowed deviations from the constitution.  Having achieved full control over the legislative and executive branches of government, Hitler and his political allies embarked on a systematic suppression of the remaining political opposition. By the end of June, the other parties had been intimidated into disbanding. On July 14, 1933, Hitler's Nazi Party was declared the only legal political party in Germany.  Military opposition was also punished. The demands of the SA for more political and military power led to the Night of the Long Knives, which took place from June 30 to July 2, 1934. Ernst Röhm and other SA leaders, along with a number of Hitler's political enemies, were rounded up and shot.  The day before Hindenburg's death in August 1934, the cabinet had enacted a law abolishing the office of president and combining its powers with those of the chancellor. Hitler thus became head of state as well as head of government, and was formally named as leader and chancellor. As head of state, Hitler became supreme commander of the armed forces. He began to mobilize for war. Germany withdrew from the League of Nations, and Hitler announced a massive expansion of Germany’s armed forces.  The Nazi regime also included social reform measures. Hitler promoted anti-smoking campaigns across the country. These campaigns stemmed from Hitler's self-imposed dietary restrictions, which included abstinence from alcohol and meat. At dinners, Hitler sometimes told graphic stories about the slaughter of animals in an effort to shame his fellow diners. He encouraged all Germans to keep their bodies pure of any intoxicating or unclean substance.  A main Nazi concept was the notion of racial hygiene. New laws banned marriage between non-Jewish and Jewish Germans, and deprived 'non-Aryans' of the benefits of German citizenship. Hitler's early eugenic policies targeted children with physical and developmental disabilities, and later authorized a euthanasia program for disabled adults.  The Holocaust was also conducted under the auspices of racial hygiene. Between 1939 and 1945, Nazis and their collaborators were responsible for the deaths of 11 million to 14 million people, including about 6 million Jews, representing two-thirds of the Jewish population in Europe. Deaths took place in concentration and extermination camps and through mass executions. Other persecuted groups included Poles, communists, homosexuals, Jehovah's Witnesses and trade unionists, among others. Hitler probably never visited the concentration camps and did not speak publicly about the killings.  World War II  In 1938Hitler, along with several other European leaders, signed the Munich Agreement. The treaty ceded the Sudetenland districts to Germany, reversing part of the Versailles Treaty. As a result of the summit, Hitler was named Time magazine's Man of the Year for 1938. This diplomatic win only whetted his appetite for a renewed German dominance. On September 1, Germany invaded Poland. In response, Britain and France declared war on Germany",
            "review_score": "1"
        },
        {
            "review_text": "You owe Boris a lot of Polish Złoty's xD (I bought it cuz of Boris) The game shows people the pure slavness!  - Great FULL HD VR graphics - Most realistic slav simulator - It gibs you playings as babushka and bear - Gore, Drugs, Dancing Gopniks - Polan included  Overall score: 1944/1939 Must Have!",
            "review_score": "1"
        },
        {
            "review_text": "Oi blin, buy this game and get +3 slav-ness in your life, RUSH B BLIN!",
            "review_score": "1"
        },
        {
            "review_text": "Needs more characters and minigames. Everything else is SLAVIC AF!!!",
            "review_score": "1"
        },
        {
            "review_text": "I once was a weak and a small ♥♥♥♥♥, after playing this game, I became a big and strong slav. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "10/10 squat (no western spy)",
            "review_score": "1"
        },
        {
            "review_text": "Best thing in my life ive spent 1,99€ for",
            "review_score": "1"
        },
        {
            "review_text": "10/10  Some skinny mofo in a tracksuit said I'm gay for smoking the Mint Cigarette - BAM.",
            "review_score": "1"
        },
        {
            "review_text": "I am definitely not an american spy. Honest.    I'm an english spy, Is that any better? 9/10 Quite Slavic Indeed.",
            "review_score": "1"
        },
        {
            "review_text": "Needs more hardbass and cheeki breeki, then it will be tru slav game",
            "review_score": "1"
        },
        {
            "review_text": "Trading Cards dont work for me at least for now, but the game is awesome. And sometimes gopniks in the bar fight got glitched on the ceiling. Game also needs more modes and unlockables.",
            "review_score": "1"
        },
        {
            "review_text": "Most ridiciolus and realistic representation of a casual Slav's life.",
            "review_score": "1"
        },
        {
            "review_text": "THE BEST 'SUKA BILYAT' GAME EVER. AMERIKANSKI SPY CAN'T SQUAT",
            "review_score": "1"
        },
        {
            "review_text": "Very good game, it contains evrything that makes a true slav.",
            "review_score": "1"
        },
        {
            "review_text": "Only misses russian dashcam crash gameplay, gopniksquat/10",
            "review_score": "1"
        },
        {
            "review_text": "/10/",
            "review_score": "1"
        },
        {
            "review_text": "true slav game confirmed",
            "review_score": "1"
        },
        {
            "review_text": "Pros: *Hardbass *Vodka *Bears *Tracksuits *Squatting *Gopniks *Babushka  Cons: *No kompot *No Boris *No mayonez  Overall rate: 9/10  Squat in peace my gopniks",
            "review_score": "1"
        },
        {
            "review_text": "those memes went way too far",
            "review_score": "1"
        },
        {
            "review_text": "Im Russian,Vodka Is Tradation,Beating the crap out of 38 people and a bear tradation,squating while drinking tradation,KICKING WHILE SQUATING WITH BEARS AND VODKA RUSSIAN TRADATION    10/10 Russian Drinking and bears",
            "review_score": "1"
        },
        {
            "review_text": "Not sure how accurate this is, but still.          YouTube™ Video:  FROM RUSSIA WITH LOVE | Slavistan&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "I have truly made my babushka proud and was able to show the inner slav within me form playing this game. Not for amerikanski spy.",
            "review_score": "1"
        },
        {
            "review_text": "You have to squat and play or it won't work!  10/10 slavs would recommend!  SRBIJA!",
            "review_score": "1"
        },
        {
            "review_text": "Funny game, giving the experience of the true slavic lifestyle. Great for passing the time in small amounts at a time  Pros: +Accurate depiction +Cheap +6 Characters (5 to be unlocked) +Score tracking +Simple but effective art +Funny  Cons: -Lack of content (3 modes) -No easy or hard mode -Once you get past a certain point the difficulty doesn't increase -Only 6 characters  8/10 Good fun in short 5 minute plays. A lack of content to keep people playing for long unless score is that important to you, but a lack of difficulty increasing often makes scores seem invalid. Still funny and worth the cheap price.",
            "review_score": "1"
        },
        {
            "review_text": "Enbrase The slavvyness",
            "review_score": "1"
        },
        {
            "review_text": "am Alexei. This good item for buy. Just before there was an boredom. After transact of pixel interact programs it go empty. Is awe inspire for 2 ruble. Do Transact now.",
            "review_score": "1"
        },
        {
            "review_text": "When in need of happyness, sadness, semechki, vodka, this will help you!",
            "review_score": "1"
        },
        {
            "review_text": "Oi ♥♥♥♥♥, get ready for some slav action",
            "review_score": "1"
        },
        {
            "review_text": "Serious review, it lacks content, 20 mins and I got everything, its not bad but not worth the cash for the moment",
            "review_score": "-1"
        },
        {
            "review_text": "OKAY, SO THIS IS A SLAV GAME... WHY DIDN'T YOU ADD CZECH REPUBLIC ??? CZECH REPUBLIC IS A SLAV COUNTRY, THIS GAME IS ABOUT SLAVS YET YOU DIDN'T ADD IT ????!!!!!! DO IT PLEASE !!! THEN I WILL RECOMMEND THIS GAME TO ANY COMRADE I KNOW !!!!",
            "review_score": "-1"
        }
    ]
}