{
    "app_id": 504800,
    "name": "Sorcery! Part 4",
    "release_date": "2016-09-22",
    "developer": [
        "inkle Ltd"
    ],
    "publisher": [
        "inkle Ltd"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Adventure",
        "RPG",
        "Indie"
    ],
    "achievements": 0,
    "positive_ratings": 38,
    "negative_ratings": 5,
    "price": 6.99,
    "description": "An epic adventure through an open world of monsters, traps and magic. Infiltrate the Fortress of Sorcerers, and create your own unique story where every decision you make is remembered, no matter how small. Cheat death, uncover ancient mysteries, and recover the Crown of Kings - if you can.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/504800/header.jpg?t=1549288184",
    "minimum_requirements": "OS: Windows Vista Processor: 1.4 GHz Memory: 1 GB RAM Graphics: Requires OpenGL 2.1 DirectX: Version 9.0 Storage: 500 MB available space",
    "recommended_requirements": "OS: OS X 10.11 Processor: 1.4 GHz Memory: 1 GB RAM DirectX: Version 10 Storage: 500 MB available space",
    "reviews": [
        {
            "review_text": "You won't believe how long I've been waiting for this part of the series. And I'm glad I bought it the second it got released! If you're considering buying this game, be sure to get the other parts on Steam as well! You won't regret it!",
            "review_score": "1"
        },
        {
            "review_text": "An amazing finish to the great adventure. It's fascinating how they rebuilt and added to the original gamebook and managed to rebuild the original boring ending into something really clever and satisfying.  The possibilities are immense, the secrets innumerable. It will take quite some time for someone to uncover them all and reach the best and fullest ending.  I can't wait to check out all the things that I've missed in   New Game Plus  !",
            "review_score": "1"
        },
        {
            "review_text": "  DISCLAIMER: This is a full review, and NOT a first impressions review like all my other reviews, if you want a better full review, then please read better reviews then mine  ANOTHER DISCLAIMER: Sorcery's reviews are more or less the same as the gameplay mechanics are basically the same in all of the Sorcery games. So please think before commenting about the similarity in the reviews",
            "review_score": "1"
        }
    ]
}