{
    "app_id": 504880,
    "name": "Pixel Puzzles 2: RADical ROACH",
    "release_date": "2016-08-12",
    "developer": [
        "DL Softworks"
    ],
    "publisher": [
        "DL Softworks"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Casual",
        "Indie",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Casual",
        "Indie",
        "Action"
    ],
    "achievements": 26,
    "positive_ratings": 36,
    "negative_ratings": 13,
    "price": 6.99,
    "description": "Pixel Puzzles 2: RADical ROACH is a traditional style jigsaw puzzle game in a RADical style.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/504880/header.jpg?t=1544285512",
    "minimum_requirements": "OS: Windows 10, 8.1, 8, 7, Vista, XP Processor: Intel® Core 2 Duo Memory: 2 GB RAM Graphics: DirectX 9.0 Compatible Storage: 250 MB available space Sound Card: Generic Sound Device",
    "recommended_requirements": "OS: Windows 10, 8.1, 8, 7, Vista, XP Processor: Intel® Quad Core Memory: 4 GB RAM Graphics: DirectX 9.0 Compatible Storage: 250 MB available space Sound Card: Generic Sound Device",
    "reviews": [
        {
            "review_text": "The game has too many problems for me to recommend it. My disappointment with the game is made worse by how much better (or at least on point for the genre) one of the previous installments was: Pixel Puzzles: Japan. To give the game a fair chance, however, I've divided said problems into ones I consider more objective and more subjective. Judge for yourself, how much those points matter to you.  The objective problems first: the playtime is a little on the short side (7 hours with puzzle rotation disabled), the settings do not always work correctly (you have to disable piece rotation after every game launch; sound volume settings don't affect the dev logo), and background colours don't offer enough contrast from the puzzle pictures (making it difficult to spot gaps missing a puzzle piece).  As for more subjective issues: the theme of this one is not particularly interesting, plus I prefer photographs over drawings (Japan, Birds, Space &gt; UndeadZ, Anime, RADical ROACH; besides, with photographs it's easier to get enough detail even in puzzles with higher piece quantity to match pieces without placing them blindly), the music, however pretty good, doesn't really fit the gameplay pace of a jigsaw puzzle, and having one of the later puzzles in sepia robs you of some of the reference for educated piece placement.  Still, I'll be sure to look out for the next game in the series, hoping for something more up my alley.",
            "review_score": "-1"
        }
    ]
}