{
    "app_id": 504980,
    "name": "Elves Adventure",
    "release_date": "2016-08-01",
    "developer": [
        "Patryk Taranek"
    ],
    "publisher": [
        "Patryk Taranek"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "Action",
        "FPS"
    ],
    "achievements": 0,
    "positive_ratings": 40,
    "negative_ratings": 105,
    "price": 1.99,
    "description": "Fate of the hero is in our hands, he is a stranger on new planet. He had occasion to return, but finally he stays and decides to help local people.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/504980/header.jpg?t=1472674792",
    "minimum_requirements": "OS: Windows 7/8.1/10/Vista/XP (32 or 64 bit) Processor: Dual Core 2.0GHz or equivalent processor Memory: 4 GB RAM Graphics: NVIDIA GeForce 400 series or AMD Radeon HD 6000 series, 1GB Video Card (Minimum Shader Model 2.0) DirectX: Version 9.0 Storage: 3 GB available space Sound Card: DirectX Compatible Sound Card with latest drivers",
    "recommended_requirements": "OS: Windows 7/8.1/10/Vista/XP (32 or 64 bit) Processor: Intel Quad-Core (i5 2300) or AMD Octo-Core (FX 8150) Memory: 8 GB RAM Graphics: NVIDIA GeForce 660Ti or greater, AMD Radeon HD 7950 or greater, 2GB Video Card (Minimum Shader Model 2.0) DirectX: Version 9.0c Storage: 4 GB available space Sound Card: DirectX Compatible Sound Card with latest drivers",
    "reviews": [
        {
            "review_text": "   I, in the name of People from Poland, apologize for our 'country-mate' releasing such trash... :(",
            "review_score": "-1"
        },
        {
            "review_text": "  CONS: - Terribly disjointed graphics. No one even attempted to make this look good. - Terribly disjointed levels, with no consistency of theme. - No quit button, no mouse sensitivity slider. PRO: - FOV Slider. Check.  I'm glad I got this free.",
            "review_score": "-1"
        },
        {
            "review_text": "  Elves Adventure tries to be so many things that it's not. It combines several genres and makes it crap. There is no 'incredible story' and the journey is forgettable. Don't get this game.  4/10",
            "review_score": "-1"
        },
        {
            "review_text": "  I would not recommend buying this unless you see it as a donation to a game developing enthousiast rather than a serious developer. As someone said in the discussions 'Steam is not the place to sell your game making lesson results'   No story  Default game making software assets 9in this case game guru) lacking 'AI'  it is not a bad try for a game guru tryout, it would be something if I had made it that I would share with some friends and would be ensured some oohs and aahs, this is not something to sell on a platform like Steam  I was in the lucky position that I got this for free so no money wasted. You gonna buy the game with the above in mind it is actually not that bad",
            "review_score": "-1"
        },
        {
            "review_text": "Its really good game for people who like adventure and action games. I really hope that this game will also have Polish language and many other languages.  I really loved this game. It is very enjoyable and I have a lot of fun  I recommend!",
            "review_score": "1"
        }
    ]
}