{
    "app_id": 50510,
    "name": "Burn Zombie Burn!",
    "release_date": "2010-08-12",
    "developer": [
        "doublesix"
    ],
    "publisher": [
        "P2 Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Partial Controller Support",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "Zombies"
    ],
    "achievements": 15,
    "positive_ratings": 65,
    "negative_ratings": 93,
    "price": 6.99,
    "description": "Welcome to the char-grilled world of Burn Zombie Burn, where the best type of undead is barbequed undead. The goals are simple: keep Bruce alive, as he tries to keep Daisy alive, and get the highest score possible. Standing (well, ambling) in your way is a never ending horde of the rotting, stinking and stupid undead.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/50510/header.jpg?t=1447353339",
    "minimum_requirements": "OS: Windows XP (Service Pack 3), Windows Vista, Windows 7Processor: 1.8 GHz, Dual CoreMemory: 2 GB RAMGraphics: DirectX® 9 compliant graphics adaptor. 512 MB, With Shader Model 3.0DirectX&reg;: DirectX® 9Hard Drive: 2 GB space freeSound: DirectX® 9 compliant sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Just couldn't get into it. It played well, fun to kill mass hordes of zombies, but something was missing...  Perhaps I needed freinds or to play online with strangers. I played an 1.5 hours and unlocked the third mission and found myself not wanting to play it.  The basic idea is there is an 'Arena' level you fight as long as you can until you die. So there is no exploration, no true bosses (big zombie that farts fire though), and each level is nothing more thn a different layout but more of the same.  You can only progress if you get a high enough score to unlock the next area. I spent 45 minutes on one level with a scote off 850,000 and still only got a bronze to unlock the third level.  Overall it is not a bad game, but the fast paced arena combat to get really high scores can make your brain tired because the combat keeps ramping higher and higher with no slow down or breaks. So you can spend an hour in maximum focus... perhaps I am too old for this, lmao !  Not bad, but not for me I guess. And I normally like Smash TV type gameplay and arena combat.",
            "review_score": "-1"
        },
        {
            "review_text": "4/10 - Not terrible, but it doesn't earn thumbs up  The controls were good, graphics were fine. However, No storyline, just mass waves of zombies. This game could really have something if it had multiplayer. This game doesn't though.   Finally, this game is really not worth $10! It's more of a $2.99 base price game. So for those 3 reasons. Thumbs Down.  Worth $2-3     Accidently Reviewed",
            "review_score": "-1"
        },
        {
            "review_text": "Yet another low budget zombie action game that is good for only a few short minutes of time wasting.  Story is again non-existent, music is horrible, and sound effects are 3rd rate. Graphics is very simplistic 3D and the gameplay can be surprisingly difficult.  You basically play a character with a top-down perspective and try to blasts zombies ala Gauntlet style. It can be sometimes quite chaotic with a whole bunch of em on the screen and worst of all, you can't see where you are.   There are very brief moments of fun tho, such as when you run thru a whole bunch of zombies with a flaming torch and watch em burn.   Overall Rating: 3.0 / 10 Not worth to buy even if its on sale. Only good for a couple of minutes of time wasting. Don't bother with this game unless you have absolutely nothing to play.",
            "review_score": "-1"
        },
        {
            "review_text": "I thought I was getting Zombies Ate My Neighbors, what I got was another fenced in isometric clunker of a shoot 'em up game that gets boring in about 2 minutes. Sorry but my vision of the zombie apocalypse isn't restricted to a 15 square foot parking lot / farm / patch of dirt / zzzzzz",
            "review_score": "-1"
        },
        {
            "review_text": "Sort of rubbish. Which is a shame, with just a tiny bit of fiddling it could be loads better. It just reeks of lazy console port. It's really cute, it just...lacks.",
            "review_score": "-1"
        },
        {
            "review_text": "Do Not Buy! Twinstick shooter with broken controller support! The right stick on the controller is not an input so you cannot move and shoot in different directions. Other games in the AZMD bundle have proper controls but this one does not. There are tons of other twinstick games out there, don't buy this to support a dev who has left broken controls untouched for ages.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is like survival most of the time and there is a game mode for defense. If you got time to kill, then this game is for you. The gameplay is a little repetetive. not much weapons, only like 10, same with zombie types. You have to grind alot to get the highest score possible, and getting the developer medals. 6/10 for the graphics and addicting gameplay, but getting the developer medals are close to impossible, but I got them anywhoo.",
            "review_score": "1"
        },
        {
            "review_text": "The kind of game to get those 15 minutes comical relief. The zombies are hilarious, and the pace is always fast.",
            "review_score": "1"
        },
        {
            "review_text": "A fun little distraction if you can get it for $5 or less. My only problem is its a 'play until you lose' game where there dosent seem to be an end to fight to, you just keep going until you run out of lives and add up the score. Would be infinately more enjoyable as a coop game!  3/5",
            "review_score": "1"
        },
        {
            "review_text": "Broken beyond good and evil",
            "review_score": "-1"
        }
    ]
}