{
    "app_id": 505760,
    "name": "Whispers",
    "release_date": "2016-07-29",
    "developer": [
        "Peace"
    ],
    "publisher": [
        "Peace"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "Adventure"
    ],
    "achievements": 0,
    "positive_ratings": 56,
    "negative_ratings": 56,
    "price": 3.19,
    "description": "Whispers is a first-person horror game. You play the role as a caretaker of a house out in the country. You have to keep an eye on the house for your friend. The house is located somewhere in a field away from the city. He left instructions for you to follow.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/505760/header.jpg?t=1548940135",
    "minimum_requirements": "OS: Windows XP / Vista / 7 - Attention: Windows 8,10 may contain errors Processor: Pentium® 4 2,0 ГГц  or Athlon® XP  2,0 ГГц Memory: 2 GB RAM Graphics: Nvidia GeForce 6200 or ATI Radeon 9600 DirectX: Version 9.0 Storage: 1 GB available space Sound Card: DirectX 9 compatible",
    "recommended_requirements": "OS: Windows XP / Vista / 7 - Attention: Windows 8,10 may contain errors Processor: Pentium® 4 2,0 ГГц  or Athlon® XP  2,0 ГГц Memory: 4 GB RAM Graphics: Nvidia GeForce 8600 или ATI Radeon HD series DirectX: Version 10 Storage: 2 GB available space Sound Card: DirectX 9 compatible",
    "reviews": [
        {
            "review_text": "I cannot recommend this game because of two major flaws:  - Frequent crashes: During the 50 minutes it took me to complete the game, it crashed about 8 times. The crashes make you replay much of the game because you can only save in certain spots.  - Very high cost per hour: Without the crashes, it would have taken me about 30 minutes to complete the game, which, at the current full price of 4.99€, means that you are paying just under 10€ per hour of gameplay. ",
            "review_score": "-1"
        }
    ]
}