{
    "app_id": 508290,
    "name": "$1 Ride",
    "release_date": "2016-07-28",
    "developer": [
        "BeHappy Studios"
    ],
    "publisher": [
        "Back To Basics Gaming"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Casual",
        "Indie",
        "Action"
    ],
    "achievements": 0,
    "positive_ratings": 283,
    "negative_ratings": 392,
    "price": 0.79,
    "description": "$1 Ride is a casual game with a fast paced, timing and reflex testing game-play style. Travel through space at warp speed! Collect power ups to increase your speed or risk your fuel to collect money, missiles and more.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/508290/header.jpg?t=1469737159",
    "minimum_requirements": "OS: Windows XP/Windows Vista/Windows 7/8/10 Processor: 1.5Ghz or better Memory: 128 MB RAM Graphics: DirectX 9.0 Compatible Storage: 45 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "It's pretty bad. Complete waste of time and money.  Beware headphone users, on start up it screams its music for the world to hear.  It's very hard to see the objects flying at you in the game.  Your little ship doesn't fly very well at all.  Although it is 59 cents at the moment, I do not recommend this game.  Trust me, you can do better.",
            "review_score": "-1"
        },
        {
            "review_text": "The 1$ ride game also deserves only 1 minute of your life. Concept is solid, but it just couldn't hold my attention span for long. Would recommend if you want to waste a dollar on nothing, but burning that precious dollar with a lighter would be way more interesting.  What else did you expect for this price? This is just another game that shouldn't really be on Steam. (IMO)  This game will probably forever be on top of my library of games, which makes this games even more depressing.",
            "review_score": "-1"
        },
        {
            "review_text": "Same price I paid to ride your Mom.  Not nearly as fun, though.   ",
            "review_score": "-1"
        }
    ]
}