{
    "app_id": 508670,
    "name": "Aircraft War X",
    "release_date": "2016-08-05",
    "developer": [
        "Freshtrax"
    ],
    "publisher": [
        "Freshtrax"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Indie",
        "Action",
        "Simulation"
    ],
    "achievements": 0,
    "positive_ratings": 273,
    "negative_ratings": 231,
    "price": 0.79,
    "description": "The game is dedicated to the air battle.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/508670/header.jpg?t=1538952182",
    "minimum_requirements": "OS: Windows 7 64 bit Processor: Intel Pentium Memory: 1 GB RAM Graphics: intel hd graphics Storage: 200 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Hey, I bought your game in hopes that you could use the money to learn how to make better games. I saw some potential in the screenshots but after a minute or two of playing and I was wrong.  'It will require you to focus and agility.'- I had really believed this sentence. Not only can I not agility very well, but it's hard to focus with the background being camoflauge and the planes also being camoflauge.  The main change the position of the aircraft more often to keep healthy.'- This is also impossible. I can only look in a single direction the entire time, how can I healthy like that? bull crap bro  don't make games. stop don't do it.",
            "review_score": "1"
        },
        {
            "review_text": "This game sucks so much, the online F2P games are way more better than this. There are no options at all and the same ♥♥♥♥ repeats itself. Buy this for steam trading cards.",
            "review_score": "-1"
        },
        {
            "review_text": "!!!!",
            "review_score": "1"
        },
        {
            "review_text": "What could you say about a AAA title like this?   You get what you pay for. After years of hard work I managed to cash out the 0.16 € for this game and the 5 minutes I spent playing it was the best 5 minutes of my life. After Harambe I thought humanity was on the verge of collapsing, but Aircraft War X made me reconsider life. Now I am working in South-Africa trying to save the local panda population. To sum it up playing Aircraft War X was truly an eye-opening experience, it made me a better person, and it will make you as well.  Having problems with your family? Done. Your sex life? Done. Trump or Hillary? Done.  solid 5/7 - Would pay again  //discalimer: may cause cancer//  edit: Now nominated for the “I'm Not Crying, There's Something In My Eye” Award!",
            "review_score": "1"
        },
        {
            "review_text": "  maybe a little bit too expensive game for me. 11/10",
            "review_score": "1"
        },
        {
            "review_text": "OMG THIS GAME IS MUCH FUN!!!! AND IT'S REALLY CHEAP!!! DON'T HESITATE JUST BUY IT!!!",
            "review_score": "1"
        },
        {
            "review_text": "Just shooting around....nothing to accomplished.Not really worth it....",
            "review_score": "-1"
        }
    ]
}