{
    "app_id": 509360,
    "name": "TRESPASS - Episode 1",
    "release_date": "2016-08-04",
    "developer": [
        "VRotein"
    ],
    "publisher": [
        "VRotein"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Adventure",
        "Simulation"
    ],
    "tags": [
        "Adventure",
        "Simulation",
        "VR"
    ],
    "achievements": 0,
    "positive_ratings": 44,
    "negative_ratings": 17,
    "price": 11.99,
    "description": "A room escape adventure, Having lost his memories and without knowing his whereabouts, assist the protagonist in escaping locations related to his past through searching for clues and solving for puzzles. Along the way, find old memories that will shed more light on his mysterious past.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/509360/header.jpg?t=1487302216",
    "minimum_requirements": "OS: Windows 7 64bit Processor: Intel i5-4590 / AMD FX 8350 equivalent or greater Memory: 4 GB RAM Graphics: NVIDIA GeForce GTX 970 / AMD Radeon R9 290 equivalent or greater DirectX: Version 11 Storage: 1 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I have beaten the game. quite interesting. FYI, after the ending, there's a little bonus. though its not a long game, the bonus will be a little help.",
            "review_score": "1"
        },
        {
            "review_text": "Good stuff! I think the escape room genre works really well and Trespass was really atmospheric. Can't wait to see what Episode 2 has in sotre!",
            "review_score": "1"
        },
        {
            "review_text": "Bought the game when it was 40% off.  I have played similar games with these types of controls and they dont seem to cause me motion sickness.  The game seemed to have poor fps and I am running a 1080 so I am not sure if that is the game or maybe my settigns? There are only two puzzles and neither of them were very challenging, so unless an update comes out that adds some more content I cannot really condone purchasing this at full price.",
            "review_score": "-1"
        },
        {
            "review_text": "It's well made, but I beat it in about 15 minutes. I feel that for the price, the game was way way too short.",
            "review_score": "-1"
        },
        {
            "review_text": "I wish it was a little longer and I wish there storyline was fleshed out a little more but for what it's worth, I had a lot of with it.",
            "review_score": "1"
        }
    ]
}