{
    "app_id": 510660,
    "name": "Big Bang Empire",
    "release_date": "2016-08-23",
    "developer": [
        "Playata GmbH"
    ],
    "publisher": [
        "European Games Group AG"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 16,
    "categories": [
        "Single-player",
        "MMO",
        "Cross-Platform Multiplayer",
        "In-App Purchases"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Free to Play",
        "Indie",
        "Massively Multiplayer",
        "RPG",
        "Strategy"
    ],
    "tags": [
        "Nudity",
        "Sexual Content",
        "Mature"
    ],
    "achievements": 0,
    "positive_ratings": 398,
    "negative_ratings": 260,
    "price": 0.0,
    "description": "Conquer the blue movie Olympus in this fun &amp; kinky RPG. Collect ludicrous items, level up your stats and compete with other stars!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/510660/header.jpg?t=1472063950",
    "minimum_requirements": "OS: Windows XP Processor: Intel Pentium or compatible Memory: 1 GB RAM",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Game requires you to wait for completing missions, but you can pay them to finish now!",
            "review_score": "-1"
        },
        {
            "review_text": "Okay Steam.. What. xD  I mean, I would love to see more X rated games on Steam (like old classics ala Playboy: the Mansion, etc.), but this is a browsergame.. I've played it in the past, it's pretty repetitive.. But that's how browsergames are like.  And for some reason I can't log into my old account? (Well nevermind, I just tried logging onto all my emails using their site and it keeps telling me that there were no players bound to the mails.. Maybe it got deleted for inactivity or it didn't have an account system back then.) Still weird that they don't show a possibility of logging into your account when starting the program.. Are you forced to start from the beginning? All I wanted was to see how my old character was doing.. xD  Anyway, not a game I would start over again from 0..",
            "review_score": "-1"
        },
        {
            "review_text": "Think about all the things you would love to see in an adult film industry based game. Now remove all that and add massive timesinks. You now have Big Bang Empire.",
            "review_score": "-1"
        },
        {
            "review_text": "You can't play as girl with a ♥♥♥♥. 0/10",
            "review_score": "-1"
        },
        {
            "review_text": "Yea no thanks. The game is filled with nothing but timers and almost everything costs their premium money which starts to make it pay to win.",
            "review_score": "-1"
        },
        {
            "review_text": "Nope.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't even think about downloading this just for masterbaiting, not worth it.",
            "review_score": "-1"
        },
        {
            "review_text": "Please do not do that.",
            "review_score": "-1"
        },
        {
            "review_text": "Amazing ! Simply Amazing...gave me a 3 day chub!",
            "review_score": "1"
        },
        {
            "review_text": "GREAT GAME INSTALL AND SPEND ALL LIFE SAVINGS ON IT LIKE ME",
            "review_score": "1"
        },
        {
            "review_text": "actually a truly fun little game",
            "review_score": "1"
        },
        {
            "review_text": "Is a good game. I like this game for the sexiest female characters, and the interesting missions.",
            "review_score": "1"
        },
        {
            "review_text": "Thats something weird on steam isn't it &gt;  Well , this game is free , people complaining about having to wait to complete missions.  If you dont like it , thats cool . But its great little game for wasting time .  -You are bored ? play this game .  - Why not ?  - Waste your time  ",
            "review_score": "1"
        },
        {
            "review_text": "The best game I have ever played.",
            "review_score": "1"
        },
        {
            "review_text": "I'm dissipointed in steam for this being a game.   Update: The game somehow slowed down my pc",
            "review_score": "1"
        }
    ]
}