{
    "app_id": 51060,
    "name": "Drawn®: The Painted Tower",
    "release_date": "2011-01-19",
    "developer": [
        "Big Fish Studios"
    ],
    "publisher": [
        "Big Fish Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Casual"
    ],
    "tags": [
        "Adventure",
        "Casual",
        "Point & Click"
    ],
    "achievements": 30,
    "positive_ratings": 87,
    "negative_ratings": 13,
    "price": 6.99,
    "description": "Enter the world of Drawn, and unravel the secrets of the Painted Tower. Overcome challenging puzzles on your quest to save Iris. A curse has locked each floor of the tower, and only the most creative adventurer can find a way through.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/51060/header.jpg?t=1531436636",
    "minimum_requirements": "OS: Windows XP/Vista/7 Processor: 1.0 GHz Memory: 512 MB Graphics: 128 MB DirectX®: 8.1 Hard Drive: 649 MB",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I love this game but it is only the first installment in a series. I hope more chapters will make their way to Steam sometime.",
            "review_score": "1"
        },
        {
            "review_text": "Does this game have its charms? Yes, its façade is beautiful, but that does not outweigh the many problems with the game’s construction. I have played many puzzle games and most have a beautiful exterior. It is generally the story’s depth, the game’s mechanics, and the variety of engaging puzzles that make for a fun puzzle adventure. This game lacked quality in all of the above. Problems: (The Story): This story’s depth runs about as deep as a 3 year old child’s written work. Harsh, but true. The only creativity or beauty seen in this game is visual; that would be fine if this were a pretty painting being sold for 10 dollars and not a puzzle adventure game.  You would be better off grabbing a snack and a movie at your local cinema than playing through this. That would cost the same time and money as Drawn: the Painted Tower, but at least you would have more to say about it than “It’s pretty”.  (Mechanics): As other negative reviewers have said, the game crashes frequently. Also, when you use hints, they come in order of steps needing to be accomplished within a given room. So, if you are at a loss at the end of a room and need a hint, you will have to go through all of the room’s hints to get to the one you are after.  (Puzzles): I don’t know about you, but for me, variety is key in a puzzle game. The variety in Drawn was not so great, but the main problem with some of Drawn’s puzzles is that there are no instructions. So when you do get excited about a hard looking puzzle, your excitement is likely to fade by the time you figure out what exactly you are supposed to do. (In short) Having no instructions was okay a lot of the time, but it was frustrating when a clever looking puzzle was not intuitive.  (Conclusion): Drawn: The Painted Tower is a picture book game for toddlers that frequently crashes, has disappointing puzzles, and will last about as long as a lord of the rings movie. ",
            "review_score": "-1"
        },
        {
            "review_text": "I love this game! its a fun puzzle story. great for wasteing time and the graphics are pretty",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this game to anyone who likes puzzles.",
            "review_score": "1"
        },
        {
            "review_text": "I like the art, the story is pretty generic, the puzzles are okay and the hints are pretty useless. The most annoying thing is how the game is spoonfeeding you information throughout. Still recommend it, though.",
            "review_score": "1"
        },
        {
            "review_text": "Simple puzzler with a great story, beautiful music, beautiful artwork. Definitely something to sit down and enjoy the show while exercising the brain.",
            "review_score": "1"
        }
    ]
}