{
    "app_id": 510790,
    "name": "The Sun Will Rise",
    "release_date": "2016-10-03",
    "developer": [
        "The Sun Will Rise Team"
    ],
    "publisher": [
        "The Sun Will Rise Team"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Free to Play",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Free to Play",
        "RPG",
        "Adventure"
    ],
    "achievements": 0,
    "positive_ratings": 31,
    "negative_ratings": 28,
    "price": 0.0,
    "description": "The Sun Will Rise is a completely free Final Fantasy-style game about depression. Made by an international development team of gamers and mental health professionals, it is designed above all else to be a rewarding playing experience with a positive message behind it.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/510790/header.jpg?t=1475546372",
    "minimum_requirements": "OS: WindowsR 7/8/8.1/10 (32bit/64bit) Processor: Intel Core2 Duo or better Memory: 2 GB RAM Graphics: DirectX 9/OpenGL 4.1 capable GPU Storage: 1 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I haven't played much, but it's pretty fun.   I met the devs on this game up at my local Comic Con, and they were really nice. They said they would feel bad trying to take money from people who are playing this game that had depression or another mental disease in the past, and I thought that was really cool. The concept and really the entire reason this game was made is great, and I love the cause",
            "review_score": "1"
        },
        {
            "review_text": "This is a rpg. You are the captain of the town's guard in a small and sometimes peacefull village. One day a little girl from your village is kidnapped and it is you and your most trusted town's guards job to rescue her. The music is good, the visuals are standard for an rpg maker game but they look nice and the characters are well designed. This game is challanging as all heck if you do not use the spesial item that gives you a different ending and the game becomes too easy. This game is free and does not have acheivements. This is a hard game if you are after the other ending that I could not get. Fighting depression is hard and not everyone can do it, but can you ? If you like hard rpg maker games with only limited cash but eternal potions if you help an old lady then this is the game for you. Have fun, enjoy and send me da potion man :)",
            "review_score": "1"
        },
        {
            "review_text": "Gotta say, just downloaded the game and it's too tough in the begginning. I can't past the third way of bandits in the Sanctuary of Shadows...Dissapointment. Would love to play more to have a better review but I can't advance in the game long enough to gain a reviewable perspective.",
            "review_score": "-1"
        },
        {
            "review_text": "got depression playing this game. enemies were too hard",
            "review_score": "-1"
        }
    ]
}