{
    "app_id": 511690,
    "name": "Duck Force",
    "release_date": "2016-11-17",
    "developer": [
        "Andreas Aust"
    ],
    "publisher": [
        "Andreas Aust"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Casual",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Indie",
        "Adventure",
        "Casual"
    ],
    "achievements": 0,
    "positive_ratings": 8,
    "negative_ratings": 1,
    "price": 6.99,
    "description": "Experience an amazing adventure in the rough stone age, where the bunny people under rule of a maniacal leader strives for the absolute power. Fly through dry deserts and rocky canyons full of challenges and evolve from a lame duck to a majestic flight artists.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/511690/header.jpg?t=1509753243",
    "minimum_requirements": "OS: Windows 7 Processor: i5 Memory: 4 GB RAM Graphics: Nvidia Geforce Gtx 970 Storage: 500 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I bought this game primarily because it's got a duck in it, and I feel that devs who make games with ducks in them are deserving of my support.  There is a lot to like about this game, the graphics look good, the flight mechanics are weird but OK, and of course, the protagonist is a duck. Unfortunately I just can't recommend this right now because of one fatal flaw - it is, literally too 'in your face'.  See, the best way to play this is by flying around with the duck. He flies along right in front of you which is fine, but the problem is that when you speed him up he FARTS RIGHT IN YOUR FACE!  Now, I don't have a problem with fart based locomotion, it beats the hell out of lame teleport mechanics. But this really makes my skin crawl. There's a long smoky looking fart trail which extends from the duck's butt and seems to go right through my forehead, and it hangs around longer than a real life fart. I try and duck (hehe) out of the way, but of course you can't, because you're following right behind the duck. The feeling is hard to describe, but it is very unpleasant and makes the game unplayable, for me at least.  You don't HAVE to follow the duck, you can just let him fly off into the distance and continue to control him, but it's not nearly as accurate (you have to be accurate in this game to pick up coins, etc) and more importantly, it's not nearly as much fun.  I do like this game, but the face-farts are unfortunately a deal-breaker for me. If the farty vapour trail could be turned off or redirected below face level then this would get an instant recommendation... but as it is, even my bias for duck based games is not enough to get this game a thumbs-up.",
            "review_score": "-1"
        }
    ]
}