{
    "app_id": 513230,
    "name": "The Underground Man",
    "release_date": "2016-09-01",
    "developer": [
        "Mehsoft"
    ],
    "publisher": [
        "Mehsoft"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Story Rich",
        "Memes"
    ],
    "achievements": 28,
    "positive_ratings": 1087,
    "negative_ratings": 216,
    "price": 1.99,
    "description": "Moscow: somewhere in the near future. The city and perhaps the Earth's surface has turned into a radioactive ash. Those who decided that they could not exist in such conditions began to live under the ground.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/513230/header.jpg?t=1473190651",
    "minimum_requirements": "OS: Windows Processor: Pentium 4 Memory: 1024 MB RAM Graphics: Intel HD4000 Storage: 204 MB available space",
    "recommended_requirements": "OS: Windows Processor: Pentium 4 Memory: 1024 MB RAM Graphics: Intel HD4000 Storage: 204 MB available space",
    "reviews": [
        {
            "review_text": "Unexpected success from a small indie studio – admit it, you've been waiting for a story like this after all those crappy half-asses indie games that never come out of Early Access.  Mehsoft has set a new benchmark in an enterely new field. What's more interesting, they are not trying to hype using VR or some Unreal 4 technologies. You may argue that they even made a 'step back' and revived post-apocalypse genre.  The game is built around solid dialogue system. It is not an innovation per se, but it's refined to the point of perfection. The story may have a bump or two, but overall it is a wonderful experience – to become one of the Underground Men tribe and risk your life to save the future in a post-apocaliptic world.",
            "review_score": "1"
        },
        {
            "review_text": "I like this game but there is a few things that would make it better such a keypress to complete the dialgue for starting interaction and the ability to skip the tutorial. Otherwise i love the game  and it's really interesting.",
            "review_score": "1"
        },
        {
            "review_text": " I do not think you need to talk about the game. Just buy and enjoy. GOTY 10/10 ",
            "review_score": "1"
        },
        {
            "review_text": "As chief of well-known in USA 'ELITE GAMING BLOG', I proud that games that receive from us such valuable awards as 'EGB GOTY' in other hand receive so much love and support from audience.   Mehsoft, I congratulate you with such success! All our team now awaits for your next work.",
            "review_score": "1"
        },
        {
            "review_text": "Worth to play.",
            "review_score": "1"
        },
        {
            "review_text": "I don't know why so many Americans and Peruvians are butthurt about this game. Are you people serious about leaving negative reviews? This is truly THE game of the 21 century, especially 2015-2016. Full of memes, really hardcore, like stick a ♥♥♥♥♥ up my ♥♥♥ hardcore. Retro, who don't love retro in 2016??? I'm just upset that so many people don't understand this wonder and claim that all positive reviews are spam or fake or made by trolls. This is an indie gem, created in like 3 month if I'm correct. Cherish it like your own kid that you had at a motel with a hooker who has a tramp stamp of 2k16. Love this child and it will love you!",
            "review_score": "1"
        },
        {
            "review_text": "One of the first jokes in the game is about beating a gay man to death and then urinating on his corpse. I continued playing through the f slur and decided to turn my brain off and see if the gameplay was at least fun. It's not. The dialogue is meme centered so if you actually care about having a game that is enjoyable pass on this. It was funny that you had to enter 140 characters in order to start the game but that was about it. I was really excited about checking this out but the description doesn't match the gameplay and also the positive reviews are spam reviews. So this is one of the games that made Steam change the review process congrats your game sucks.",
            "review_score": "-1"
        },
        {
            "review_text": "Troll game. Got refund.",
            "review_score": "-1"
        },
        {
            "review_text": "Omfg... The worst game ever",
            "review_score": "-1"
        },
        {
            "review_text": "Very Bad ! Very Boring ! Some Texts are Bugged !",
            "review_score": "-1"
        }
    ]
}