{
    "app_id": 513320,
    "name": "ALICE VR",
    "release_date": "2016-10-27",
    "developer": [
        "Carbon Studio"
    ],
    "publisher": [
        "Klabater"
    ],
    "platforms": [
        "windows",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "VR"
    ],
    "achievements": 34,
    "positive_ratings": 62,
    "negative_ratings": 82,
    "price": 6.99,
    "description": "Alice VR is a single player story-driven exploration game with puzzles designed to be a unique VR experience. Set on a mysterious planet and inspired by Alice in Wonderland, it's a thrilling, immersive adventure with beautiful graphics and an atmospheric electronic soundtrack.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/513320/header.jpg?t=1556284480",
    "minimum_requirements": "Requires a 64-bit processor and operating system OS: Windows 7 SP1 / 8.1 / 10 (64 bit) Processor: Intel i5 4590 Memory: 8 GB RAM Graphics: NVIDIA GeForce GTX 660 / AMD Radeon HD 7870 DirectX: Version 11 Storage: 12 GB available space Sound Card: DirectX compliant Additional Notes: Game does not support 32-bit Windows systems. Minimal requirements may not be suitable for fluent VR experience",
    "recommended_requirements": "Requires a 64-bit processor and operating system OS: Windows 10 (64 bit) Processor: Intel i7 4770 Memory: 8 GB RAM Graphics: NVIDIA GeForce GTX 970 / AMD Radeon R9 390 DirectX: Version 11 Storage: 12 GB available space Sound Card: DirectX compliant Additional Notes: Game does not support 32-bit Windows systems. Suggested for most comfortable VR experience",
    "reviews": [
        {
            "review_text": "The developers have worked on a patch to allow graphics settings adjustment which was the main complaint of most users here.  graphics -8/10 (vive version) It actually looks very very good with super sampling adjusted to 2.0 for a 1080gtx system. all effects maxed out!  audio- 9/10 (10 is perfect and nothing is perfect.)  controls- Similar to solus project which i like to an extent. No motion sickness on my end.  Ill update this review later.",
            "review_score": "1"
        },
        {
            "review_text": "Just completed this game. While the VR interaction is not very nice and there are some glitches here and there, I have to say it is a fabulous experience!!  The artwork is detailed and varied and there are lots of locations. Puzzles are very simple, but they give you somehting to do while you explore this wonderful and strange world. Aliaising dectracts somewhat from the oterhwise amazing visual experience so I recommend playing at the highest level of supersampling that your graphics card can muster.  If you like things such as Mind: Path to Talamus or the Solus Project, you will love this. A great walk through adventure!!",
            "review_score": "1"
        },
        {
            "review_text": "  Made me exited about VR storytelling",
            "review_score": "1"
        },
        {
            "review_text": "I can't say too much about the gameplay besides the first 30 minutes or so, but I can say the graphics were stunning and very appealing.  Unfortunately, the trackpad-motion design (on Vive at least) was extremely motion-sickness-inducing to say the least. I felt disoriented and motion sick within the first few minutes and I couldn't last any longer than 15 minutes when I first tried it. While I understand a teleportation-based system might make the puzzles less fun and diminish the gameplay, the trackpad movement was simply unplayable to me without sickness.  If you don't get motion sick in VR at all, this might be a great game for you, but I can't recommend it if you are susceptible to VR sickness in any other games.",
            "review_score": "-1"
        },
        {
            "review_text": "I thought I would like it because of the concept and puzzles, however, I cannot even load the game. There is a major problem that won't let me play it.",
            "review_score": "-1"
        }
    ]
}