{
    "app_id": 513340,
    "name": "Through Abandoned: The Forest",
    "release_date": "2016-08-09",
    "developer": [
        "Igor Krutov"
    ],
    "publisher": [
        "Kiss Publishing Ltd"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Puzzle"
    ],
    "achievements": 7,
    "positive_ratings": 60,
    "negative_ratings": 6,
    "price": 1.99,
    "description": "You continue your journey in worlds of Abandoned. Welcome to the Forest, the sacral place in the Ordered. Solve puzzles, find items and a way to use them. Try to reach your brother and have fun.If you haven't played Through Abandoned orginal yet: http://store.steampowered.com/app/389270?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/513340/header.jpg?t=1554237126",
    "minimum_requirements": "OS: Windows XP, Windows 7 or latest Processor: 2.33 Ghz or faster x86-compatible processor, or Intel Atom 1.6 Ghz or faster processor for netbook classes devices Memory: 512 MB RAM Graphics: Will work on integrated videocard Storage: 750 MB available space",
    "recommended_requirements": "Memory: 1024 MB RAM",
    "reviews": [
        {
            "review_text": "  Great point n click game! Def a game to get when its on a bundle or on sale. The art was really nice and well done! Look forward to part 3!  pros Sounds  Art is amazing Soundtrack puzzles  Cons N/A",
            "review_score": "1"
        },
        {
            "review_text": "  If you enjoyed the Submachine Games, this is the game for you. kind of short, but high quality art in it!  It has hard secrets in it. I realy enjoyed it.  the price of 3$ is worth it, compare to other games at that price.",
            "review_score": "1"
        },
        {
            "review_text": "  Dotted with hints of lore and brow-furrowing brainteasers, Abandoned 2: The Forest is a worthy successor to the first point-and-click puzzle adventure in the Abandoned series.   I admit I enjoyed the visual aesthetic of the first over the second, however the richer thematic environments of the second had me engrossed nonetheless. Very excited to see how this story unfolds.",
            "review_score": "1"
        }
    ]
}