{
    "app_id": 513780,
    "name": "Turbo Pug DX",
    "release_date": "2016-09-26",
    "developer": [
        "SnowFlame",
        "Back To Basics Gaming"
    ],
    "publisher": [
        "Back To Basics Gaming"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Includes level editor"
    ],
    "genres": [
        "Casual",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Casual",
        "Runner"
    ],
    "achievements": 27,
    "positive_ratings": 1160,
    "negative_ratings": 348,
    "price": 0.79,
    "description": "Turbo Pug is back and better than ever! In Turbo Pug DX you'll explore a variety of beautiful, passionately crafted environments. Collect treasures, score boosters, unlock other creatures to play as. Unlock secret mini games. Create custom level skins or enjoy skins created by other players.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/513780/header.jpg?t=1474921562",
    "minimum_requirements": "OS: Windows XP/Windows Vista/Windows 7/8/10. Processor: 1.6 GHz. Memory: 200 MB RAM Graphics: DirectX 9.0 Compatible. Storage: 50 MB available space Sound Card: DirectX 9.0 Compatible Sound. Additional Notes: To access leaderboards and online content an Internet connection is required.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "When they said it will be a low price, they werent kidding! Well worth it.  Its the little things that make this game so great. Such as the sound of the pug landing and its little floppy ears.  GJ developers for making another great game!",
            "review_score": "1"
        },
        {
            "review_text": "  This game is AWESOME! I only played for a little while, but I can tell you it's the best in the series!  If you liked the pug series, you will LOVE this!",
            "review_score": "1"
        },
        {
            "review_text": "Where do all these pugs come from?",
            "review_score": "1"
        },
        {
            "review_text": "  You get to play as a cute and adorable pug that you'll come to love instantly. Next thing you know you've devoted your life into protecting this pug. You feel happy with it as if it gave you new meaning to your life, but then you pressed the button at the wrong time and watch as your bundle of happiness explodes into pieces of pixels. You watch helplessly as you hear the thumping noises of the poor pug hitting the obstacle as it disintegrates in front of your eyes. You just sit there and deal with the fact that you just murdered an innocent turbo pug. This game questions your place in this world..  10/10 rest in pieces turbo pug *replay excessively and relive those very moments again*",
            "review_score": "1"
        },
        {
            "review_text": "Turbo Pug has been a series of 'okay' runner cames for 99 cents, but, this game is actually pretty good, especially considering the low price. Good viriaty in characters, good music, good level designs, etc.  Wait I don't have an ironic meme in this review yet.  Uh.   666/10 pugs are satanic",
            "review_score": "1"
        },
        {
            "review_text": "Look on you tube song Who let the dogs out!  And by the way, game is nice looking and have cool soundtrack. Gameplay not so special hard, you only jump.",
            "review_score": "1"
        },
        {
            "review_text": "Is just another game that you break your 'space' jumping on things with a crazy dog running like a freak. Don't buy it, it's boring and I'm completely upset with the lack of gameplay choices.   BUY NYAN CAT, IF YOU WANT SOMETHING IN THAT STYLE.",
            "review_score": "-1"
        },
        {
            "review_text": "THIS GAME IS AWESOME BUT MAKES ME RAGE. A LOT.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Harder and more engaging then super meat boy.",
            "review_score": "1"
        }
    ]
}