{
    "app_id": 514310,
    "name": "SENRAN KAGURA Bon Appétit! - Full Course",
    "release_date": "2016-11-10",
    "developer": [
        "Meteorise"
    ],
    "publisher": [
        "XSEED Games",
        "Marvelous USA, Inc.",
        "Marvelous"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Casual"
    ],
    "tags": [
        "Nudity",
        "Anime",
        "Sexual Content"
    ],
    "achievements": 43,
    "positive_ratings": 490,
    "negative_ratings": 34,
    "price": 14.99,
    "description": "The busty shinobi of SENRAN KAGURA exchange their kunais for kitchen knives in this epic cooking/rhythm showdown! Culinary warfare is carried out via rhythm battles, and players who can create the ultimate Super Dish may be treated to a special feast for the eyes as well.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/514310/header.jpg?t=1539028421",
    "minimum_requirements": "OS: Windows 7 Processor: Intel Core i5 @ 2.90 GHz+ Memory: 2 GB RAM Graphics: Intel HD3000+ DirectX: Version 9.0 Storage: 4 GB available space Sound Card: Direct X compatible sound card",
    "recommended_requirements": "OS: Windows 10 Processor: Intel Core i5 @ 3.60 GHz+ Memory: 4 GB RAM Graphics: NVIDIA GTX 950 or equivalent DirectX: Version 11 Storage: 5 GB available space Sound Card: Direct X compatible sound card",
    "reviews": [
        {
            "review_text": "Dont Look at me with those eyes, its just a cooking battle....  but in all seriousness, i like how the series kinda surprised us with a button Rhythm Game that is actually really enjoyable, you get to play as almost all of your favorite characters from the Senran Kagura Franchise, with Hanzo being the Judge, Being Perfect never felt so rewarding in this game, not only do you get a special bonus at the end, you also get to see hanzo doing hilarious things as he eats his food. like sailing off into space from the middle of the ocean on a sandwhich ship....im serious. it happened.   what makes this game difficult is trying to stay focused! there are so many distractions...(you'll find out what i mean) and if you fail on the third round you lose, doesnt matter how well you did on the first or second, which i find that weird. but it does give a challenge, and thats good. just makes winning that much more rewarding.  Now If you'll Excuse me, i gotta prove that im the best cook.  ;)",
            "review_score": "1"
        },
        {
            "review_text": "WONDERFUL!!!!!!!!!  Except that the game should tell me I can press  ENTER  to exit when I am tired.",
            "review_score": "1"
        },
        {
            "review_text": "It's fantastic. U know it when you enter the cloth-changing room. My appetite has improved.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 recipes, ♥♥♥♥, rhythm... would like to see a vs. mode WILL SAVE ANIME",
            "review_score": "1"
        },
        {
            "review_text": "Had a great meal.  Exact port from the Vita version with 60FPS in 1080p. What more could you want?",
            "review_score": "1"
        },
        {
            "review_text": "Its a mix of all of my faves, the rhythm game genre, cute waifus, and food network. ;w;",
            "review_score": "1"
        },
        {
            "review_text": "Please fix controller detection. I don't like having to unplug my Razer Orbweaver just so that this game recognises my other controller fine.  Apart from that, this is a mediocre rythm game. The selling point is obviously the visuals, but you might as well go play stepmania or something. If you really want for the visuals, just wait for peach beach or whatever it's called. Though I do wonder if that'll again only have mediocre gameplay...  In short:  Why the hell am I playing this?",
            "review_score": "-1"
        },
        {
            "review_text": "Boobs, butts, beats. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "A rhythm game with giant honkers everywhere, what more could anyone ask for?  In all seriousness, Senran Kagura Bon Appetit has some pretty obvious pros and cons that you need to consider before purchasing, but to say I didn't enjoy it would be a complete lie.  PROS: + Enjoyable soundtracks. Mostly Jpop, but also has some hints of traditional Japanese music in them. + Very nice, solid framerate. I have a really crappy computer, but even on the highest settings my computer only hiccups when I take screenshots and when there's a LOT going on on screen (at that point it drops to around 40 fps, but the audio doesn't slug so keeping a steady rhythm isn't hard at all.) + Amusing stories. Keeps the humourous tone throughout the whole game unlike Shinovi. Not that I found that to be a problem, but, given this game's specific mechanics, it wouldn't fit very well if it were otherwise. + Responsive buttons; no input lag. + Massive anime boobs (and one loli for the degenerates.) + You can still molest the girls in the dressing room. + Murasaki.  CONS: - This could just be my computer, but there are a lot of graphical glitches in the background of my game. A lot of the background turns black for some reason. - Repetitive gameplay with no variety. (Aside from the music itself.) - No multiplayer. Can't rekt my friends in a rhythm game with giant anime tiddies. - Stories are really short. Only 3 character interactions (and 2 randomly selected characters) then you're done with that character. - Learning curve is pretty steep in my opinion. For context, in Normal mode, I lost to Rin 7 times before I got past her in Ryona's story, but I full combo'd Minori's song first try, without having heard it beforehand. Take that as you will. - No way to view your gameplay over unless you manually record it, so you can't see Murasaki shaking her booty at you because you have to focus on the buttons so hard :( - Rin's song. Both in-game and in general.  If you're a food fetishist, a Senran fan, or just waiting for Project Diva, I would give Bon Appetit a go.",
            "review_score": "1"
        }
    ]
}