{
    "app_id": 514660,
    "name": "BitMaster",
    "release_date": "2016-10-12",
    "developer": [
        "Vladimir Shlapak"
    ],
    "publisher": [
        "Sometimes You"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Twin Stick Shooter"
    ],
    "achievements": 18,
    "positive_ratings": 119,
    "negative_ratings": 48,
    "price": 1.99,
    "description": "BitMaster is a dynamic and colorful twin-stick shooter which design was inspired by such games as Geometry Wars, Crimson Land and Satellite Reign. Game powered by Unreal Engine 4!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/514660/header.jpg?t=1547238850",
    "minimum_requirements": "OS: Windows Vista and higher Processor: Quad-core Intel or AMD, 2.5 GHz or faster Memory: 4 GB RAM Graphics: NVIDIA GeForce 470 GTX or AMD Radeon 6870 HD series card DirectX: Version 10 Storage: 400 MB available space",
    "recommended_requirements": "OS: Windows Vista and higher Processor: Quad-core Intel or AMD, 2.5 GHz or faster Memory: 8 GB RAM Graphics: Nvidia GeForce GT 650m DirectX: Version 11",
    "reviews": [
        {
            "review_text": "So far a very fun game, seems like a great time killer for days i dont have a ton of time before work. 99 Cents very well spent.   Ill have to do a video reveiw of this sometime after i get a few hours in.",
            "review_score": "1"
        },
        {
            "review_text": "Buy it. Definitely worth your dollar. (or, in my case, totally worth my eighty-four cents.) Only issue I've had with it so far is that the bosses are reaaaaaally hard to beat. Or I just suck at these kind of games. Yeah, it's probably that.",
            "review_score": "1"
        },
        {
            "review_text": "BitMaster a dynamic and bright twin-stick shooter. Where we play for a guy on a flying skateboard, and reflects the waves of enemies and bosses. In the game there are bonuses that can improve the hero and weapons. Each wave gets harder and harder, and these waves 100. Graphics on UE4 looks nice, but it was a little better. Musical accompaniment was pleasant. There are cards, and the game is worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "Seems like a solid game, could use some more ways of progression, since currently all I could do to 'upgrade' my weapons was to pick up the bonuses that spawn every wave, and all they seemed to do was either increase the amount of projectiles fired from one of the 4 weapons, increase the size of the projectiles or just give the weapon a damage boost, which didn't really seem to affect the guns performance much.  Now, there are 4 weapons as I mentioned before, your standard blaster, which from upgrades receives extra projectiles. The second weapon I'd best describe as a curved (banana shaped) projectile, that at higher levels grows bigger, and passes through a few enemies.  The third weapon seems like a rocket launcher of sorts, but the explosion barely deals any AoE, even at level 9. The fourth weapon was one of my favorites, along with the 2nd weapon, this one shoots sort of like, mini rockets, that deal no AoE, but with levels you get more projectiles. The reason I'd describe the projectiles as mini rockets, is because they're angular &amp; slower than the other projectiles.  after wave 20, you get a boss fight, and after beating the boss, you get to choose between four (presumably) random perks.   after choosing your perk, you're thrown back in to the arena where you started, just now there's more enemies spawning &amp; the walls have moved a bit.   after reaching wave 36 or so, I got killed.  That's about as far as I've made it as of now, I do intend to play the game some more, just to see what the other characters do &amp; if they have any differences.   To unlock a second character you need 15.. let's just call them crystals.. I've got no idea on what criteria I'm awarded crystals, but after three runs of the game, I've gained 8 of them.    The game claims to have controller support, but it didn't seem to recognize my xbox one controller, nor does it have rebindable keys.   I had no issues with the keyboard layout that the game uses, except for the odd choice of putting a specific perk (bomb I believe it was called) seemed to be bound to z and 5.. you change your weapons by pressing Q,E,1-4 or right clicking, or scrolling your mouse wheel.. but using a perk (that you might get after wave 20) is bound awkwardly to 2 buttons that aren't easily reachable, especially when your left hand is already stuck on WASD.  all in all, a very good game for its pricepoint, hope they add more content in the future &amp; fix the keybindings &amp; controller support.  p.s. who binds shooting to the bumpers and toggling weapons to the triggers?",
            "review_score": "1"
        }
    ]
}