{
    "app_id": 515020,
    "name": "The VR Museum of Fine Art",
    "release_date": "2016-08-20",
    "developer": [
        "Finn Sinclair"
    ],
    "publisher": [
        "Finn Sinclair"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Captions available",
        "Commentary available"
    ],
    "genres": [
        "Casual",
        "Free to Play",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Free to Play",
        "Simulation",
        "Casual"
    ],
    "achievements": 0,
    "positive_ratings": 203,
    "negative_ratings": 11,
    "price": 0.0,
    "description": "JUST UPDATED: Explore the Second Floor of the Museum! Explore a virtual museum in room-scale VR: see famous sculptures in full, 1:1 scale and see famous paintings without the limitations of glass and security guards.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/515020/header.jpg?t=1552889930",
    "minimum_requirements": "OS: Windows 10 Processor: Intel Core i5-3570K Memory: 8 GB RAM Graphics: Nvidia GTX 970 DirectX: Version 11 Storage: 9 GB available space Sound Card: It'd be nice",
    "recommended_requirements": "OS: Windows 10 Processor: Intel Core i5 6600K Memory: 8 GB RAM Graphics: Nvidia GTX 980ti DirectX: Version 11 Storage: 9 GB available space Sound Card: Why wouldn't you?",
    "reviews": [
        {
            "review_text": "The pamphlet is really annoying. It kept switching between my hands as I was moving about. Otherwise, it's exactly what I was hoping for. The modeling of the statues, the atmosphere, it's all very well done. The paintings look especially good, as if I am looking at the real thing.",
            "review_score": "1"
        },
        {
            "review_text": "A lovely proof of concept that gets me excited about VR all over again, it's definitely worth downloading and exploring. I really hope that the developers continue to expand on it. I'd love to see more paintings in the gallery, and I'm looking forward to the expanded graphic settings options.   There are only two things I would change, if I could:  The pamplet is nice, but it gets distracting and in the way sometimes. It would be nice to be able to hide it, possibly with the trackpad? Press up to pull it out, down to put it away, or something like that?  It would be nice to be able to see the sculptures from different heights. Flying would be ideal, but just being able to jump to a few points in the air surrounding the sculptures would work fine as well.   Thank you so much for sharing this project! ",
            "review_score": "1"
        },
        {
            "review_text": "Very cool, hopefully more exhibits will continue to be added. Thank you for your hard work on this project, Finn Sinclair.",
            "review_score": "1"
        },
        {
            "review_text": "Great demonstration of how VR can be used for non-game experiences. I hope this product (and others like it) get the love and support they need for developers to keep creating content.   I knew from 2nd hand accounts that the Statue of David was very large and that the Mona Lisa was actually quite small but getting the chance to experience them in VR was something pictures and video could never do. Being able to put my face up to the Mona Lisa was very cool knowing that in reality I could never get so close.   Sure, nothing beats actual reality, but I really think this experience provides a glimpse at how VR can be used educationally and culturally, which is important for the technology. Add a few more exhibits and I'd happily pay for this.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely awesome - a fantastic resource for the whole world!",
            "review_score": "1"
        },
        {
            "review_text": "fantastic. well worth your time to download and the disc space required. cant wait to see updates to this",
            "review_score": "1"
        },
        {
            "review_text": "This is a really cool virtual museum of some very important art pieces. The information is informative and interesting, and is concise enough to not be too strenuous to read; as much as I still dislike reading in VR.   Unfortunately, some of the statue models aren't of the highest quality. They're very accurate and beautiful, but they get a little rough if you're too close. The sound effects are a nice touch!  Overall, it's hard to complain about something that's free. I'm not even an art nut and I really enjoyed it.  7/10!",
            "review_score": "1"
        }
    ]
}