{
    "app_id": 515310,
    "name": "Invention 2",
    "release_date": "2016-09-23",
    "developer": [
        "Falcoware"
    ],
    "publisher": [
        "Atriagames"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Zombies"
    ],
    "achievements": 0,
    "positive_ratings": 284,
    "negative_ratings": 193,
    "price": 0.79,
    "description": "While you were on the island exploring the underground laboratory, the infection was busy spreading throughout the world.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/515310/header.jpg?t=1495590543",
    "minimum_requirements": "OS: Windows XP and newer Processor: 2.0+ GHz Memory: 512 MB RAM Graphics: Integrated Graphics Storage: 500 MB available space Sound Card: Integrated Audio",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I played it a while ago forgot to leave a review i bought it for 69p when it was reduced cant complain for that price just a fun little fps game.          YouTube™ Video:  Invention 2 New FPS Zombie Game&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "best buck i ever spent on a game. love the ending!",
            "review_score": "1"
        },
        {
            "review_text": "To be honest, I have really mixed feelings about Invention 2. Sure, it's another typical indie FPS with zombies. No doubt about it. And it's really easy to see that it's made with Unity asset flips. Those who played The Slaughtering Grounds and other indie FPS might recognize the infamous saw-toothed zombie. Also, it will take no more than 30 minutes to beat the game and the ending just leaves much to be desired.  On the positive side, unlike other indie FPS with zombies, Invention 2 features an inventory and scavenging system (weapons, ammos, equipment, food) that show some effort although they are underexploited. At least, the gameplay involves a minimum level of surviving.  Considering its price, Invention 2 is worth a buy and worth your time.  Since the current Steam score does not represent the actual quality of the game, I'll have no choice but to display my review as a negative one.  Rating (for a 1$ game): 7.0  Rating (according to my game preferences): 3.0",
            "review_score": "-1"
        },
        {
            "review_text": "This game sucked. With the exception of Gasp, which if you don't know what it is, it is basically a walking simulator, this is the worst game I have ever played. On the cover it looks like a fun game, the video shows the player mowing down hordes of zombies. it only costs 99 cents, what could possibly be bad about this game? I'll tell you the problem. The hordes of zombies don't make any sense. neither does the map. I came out of the first area and saw three zombies in an alley way. I went and explored that whole alley, killing those zombies along the way. I came back out and sneaked into a weapons shop set myself up with a lit loadout, grabbed all the ammo and went outside feeling confident. maybe like three minutes i realized that the zombies weren't going to stop when a horde of like 15 zombies came out of the alley i had cleared. another problem, you use to mucb ammo for the amount of zombies there are. The weapons will sometimes not hit their target. I'll have a clear shot to the chest against a zombie and it'll just decide not to hit it. It's unacceptable. Your stamina is useless, since you friking run out of it after less than a second, and doesn't regenerate immediately. I can honestly say that, without a doubt, this is the worst game i have ever played, in my entire life. I'm gonna go play some watchdogs now. Anything is better than this trash.",
            "review_score": "-1"
        },
        {
            "review_text": "+ Inventory. + Different weapons. + Fun for first 10 minutes game. + Steam cards :D  - I had to turn off gamepad because stupid glitch. - Ugly graphics and animations. - Extreme short. (25min to complete game) - No ending, outro.",
            "review_score": "-1"
        },
        {
            "review_text": "i played this game for 15 minutes and that is all i needed to get a gist of the gameplay, i found it way too repetitive and unchallenging, the graphics is not very good, the AI is absolutly autistic and the gun animations and sounds are so ♥♥♥♥. overall this game has no depth at all and all you do is repetivly kill zombies over and over. although it costs almost nothing its not worth your time playing. this is a good project but it definately isnt a complete game neither is it something anyone should pay for at this time.",
            "review_score": "-1"
        },
        {
            "review_text": "omfg what is this... even I can do better...",
            "review_score": "-1"
        }
    ]
}