{
    "app_id": 516840,
    "name": "The Tale of Doris and the Dragon - Episode 1",
    "release_date": "2016-09-08",
    "developer": [
        "Arrogant Pixel"
    ],
    "publisher": [
        "Arrogant Pixel"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Comedy"
    ],
    "achievements": 12,
    "positive_ratings": 50,
    "negative_ratings": 4,
    "price": 2.89,
    "description": "The Tale of Doris and the Dragon is an episodic, point-and-click adventure game series featuring an elderly lady named Doris who finds herself in Purgatory after passing away on earth.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/516840/header.jpg?t=1473694170",
    "minimum_requirements": "OS: Windows XP SP2 or later Processor: Pentium 4 or better Memory: 512 MB RAM Graphics: DX9 Capable Graphics Card or better DirectX: Version 9.0 Storage: 300 MB available space Sound Card: Any",
    "recommended_requirements": "OS: Windows 7 or later Processor: Intel i3 or better Memory: 1 GB RAM Graphics: DX9 Capable Graphics Card or better DirectX: Version 9.0 Storage: 300 MB available space Sound Card: Any",
    "reviews": [
        {
            "review_text": "Out of all of the Point and Click games I've played, I've never experienced anything so creative and so humorous like this. The Tale of Doris and the Dragon: Episode 1 was without a doubt the best Point and Click game that I've played in a long time. The artwork, the characters, the gameplay and the story are all amazing, and I'm looking forward to the next episodes!",
            "review_score": "1"
        },
        {
            "review_text": "An unexpected treat, a joyously little thing, and with such great voice acting. It reminded me of what I loved about Pratchett, and it caught me off guard by sharing a more fleshed out view on Grant Morrison's concept of the purpose of a Universe. All in all, lovely. Fun characters, great voice acting, and just an overall sense of  fun .  Really, really good job. I couldn't praise you enough, despite how short it is. Loved it right down to the stylised visuals that reminded me of Another World.  Please make more.",
            "review_score": "1"
        }
    ]
}