{
    "app_id": 517000,
    "name": "Sakura Shrine Girls",
    "release_date": "2016-08-26",
    "developer": [
        "Winged Cloud"
    ],
    "publisher": [
        "Winged Cloud"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Sexual Content",
        "Nudity",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Nudity",
        "Anime",
        "Visual Novel"
    ],
    "achievements": 0,
    "positive_ratings": 109,
    "negative_ratings": 24,
    "price": 6.99,
    "description": "Two cat girls appear before Toru, a skeptical priest in training. One of them carries herself with dignity and grace, while the other lives her days without a single care. With them, Toru slowly realises that there is more to this world than there seems.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/517000/header.jpg?t=1485965532",
    "minimum_requirements": "OS: Microsoft Windows XP/Vista/7/8 (32 bit or 64 bit) Processor: 1.8 GHz Pentium 4 Memory: 1 GB RAM Graphics: 1280 x 720 DirectX: Version 9.0c Storage: 200 MB available space Sound Card: Any audio output",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Like another review said, if you've played some of the other Sakura games, you've played this one. There's nothing particularly innovative about this installment in the series. It took me around 2 hours to get all three endings.",
            "review_score": "-1"
        },
        {
            "review_text": "Hi, Yes I did buy this game with money buy don't worry this game has thick plot, twisting and turning climaxes, and truly lives up to boobs. So if boob do boob and don't forget about panties.   1/10 Worst game ever would recommend",
            "review_score": "1"
        },
        {
            "review_text": "Anime. Check. VN. Check. Post-Apocalyptic. Nope. Nudity. Nope.  Survival horror. Check (if you mean surviving the whole long winded contrived story). 3 endings, 15 minutes. Check.",
            "review_score": "1"
        },
        {
            "review_text": "I own all the Sakura series from winged cloud and I am very pleased with the latest release.   Lovely work especially the enhanced choices you have added to the latest in your Sakura series of visual novels. I am currently following the second path with Nyaoko, 1st being the Cat-girl Guardian Spirit Kayo.  There seems to be 3 paths to take Kayo, Nyaoko and a harem path containing both girls.  * Kayo is a very dignified girl who in training to become one of the spirit guardians of the land. * Nyaoko is a very laid back girl whom enjoys life and is a incurable prankster, and is another of the spirit guardians in training. * Toru is a young priest in training and is a medium whom will be working with these 2 girls.  Each path seems to take about ~2.5 hours although I am a fast reader so may take others longer to play.  It was awesome you also released this as a bundled version allowing people to collect all the series in one go.  I greatly recommend this visual novel and other from the series if you like visual novels. I rate it 5 stars.  I am currently working a CG unlocking guide and will be releasing it when complete. As most the rest of the series from winged cloud has trading cards I believe they may release those shortly to.  ",
            "review_score": "1"
        },
        {
            "review_text": "Fapped to catgirls and saved 90 cents on the bundle. 11/10    ",
            "review_score": "1"
        }
    ]
}