{
    "app_id": 517460,
    "name": "SteamHammerVR - The Rogue Apprentice",
    "release_date": "2017-07-31",
    "developer": [
        "GamestormVR"
    ],
    "publisher": [
        "Showstorm Ltd"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Indie",
        "Strategy",
        "Action"
    ],
    "achievements": 61,
    "positive_ratings": 20,
    "negative_ratings": 10,
    "price": 11.39,
    "description": "London needs a Hero! Can you help save old London Town? A truly immersive story adventure staged in the iconic locations of Victorian London. In your steampunk exo-suit you are armed with ingenious 19th Century weaponry, Seek and Destroy all the foes... You are the SteamHammer!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/517460/header.jpg?t=1528929409",
    "minimum_requirements": "Requires a 64-bit processor and operating system OS: Windows 7, 8, 10 Processor: Intel i5-4590 Memory: 8 GB RAM Graphics: NVIDIA GeForce GTX 970 Storage: 9 GB available space",
    "recommended_requirements": "Requires a 64-bit processor and operating system OS: Windows 10 Processor: Intel i7-4770 Memory: 16 GB RAM Graphics: NVIDIA GeForce GTX 980 Ti Storage: 10 GB available space",
    "reviews": [
        {
            "review_text": "This game is very nice. polished graphics and I like the concept. I am looking forward to seeing what is to come!  A small issue I encountered is to do with the little monitors on the side of your face. I found them to be too close to my face but also too far to the left or the right, making it difficult to focus on the screen without straining your eyes to look sideways or with one eye closed, maybe making it ajustable somehow would be good (Sorry if there is a way and I have missed it)  I Recomend people to try it out!",
            "review_score": "1"
        }
    ]
}