{
    "app_id": 517550,
    "name": "The Enlightened League of Bone Builders and the Osseous Enigma",
    "release_date": "2016-08-29",
    "developer": [
        "INVIVO Communications"
    ],
    "publisher": [
        "INVIVO Communications"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Casual"
    ],
    "achievements": 0,
    "positive_ratings": 16,
    "negative_ratings": 8,
    "price": 0.0,
    "description": "Reckon yourself to be a most esteemed anatomist, do you? Well then immerse yourself in an intriguing Victorian parlour of curios to see how quickly you can piece together Yorick's complete skeleton. There are lots of other things to explore too, so stop your lollygagging and see if you've got the right stuff to join the Enlightened...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/517550/header.jpg?t=1472585673",
    "minimum_requirements": "OS: Windows 7 SP1 or newer Processor: Intel Core i5 4590 or AMD FX 8350 or greater Memory: 4 GB RAM Graphics: GeForce GTX 970 or AMD Radeon R9 290 or better Storage: 512 MB available space",
    "recommended_requirements": "OS: Windows 7 SP1 or newer Processor: Intel Core i5 4590 or AMD FX 8350 or greater Memory: 8 GB RAM Graphics: GeForce GTX 970 or AMD Radeon R9 290 or better DirectX: Version 11 Storage: 512 MB available space",
    "reviews": [
        {
            "review_text": "Only because it's free. Building the skeleton is ok but too easy. A chart shouldn't be necessary. I had it built, and the narrator was acting like I hadn't done it yet. I had to pick it up by the skull and place it back on the hook. The only other thing you can do is pick up objects and throw them around. This is a one-time play for me.",
            "review_score": "1"
        }
    ]
}