{
    "app_id": 517790,
    "name": "Caesar™ 3",
    "release_date": "2016-08-29",
    "developer": [
        "Impressions Games"
    ],
    "publisher": [
        "Activision"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Simulation",
        "City Builder"
    ],
    "achievements": 0,
    "positive_ratings": 315,
    "negative_ratings": 50,
    "price": 4.99,
    "description": "Prove your strength of mind and spirit and you just may be crowned Caesar!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/517790/header.jpg?t=1472585834",
    "minimum_requirements": "OS: Windows XP / Vista / 7 / 8 / 10 Processor: 1.0 GHz Memory: 256 MB RAM Graphics: DirectX 7 Compatible 3D Card DirectX: Version 7.0 Storage: 600 MB available space Sound Card: DirectX Compatible",
    "recommended_requirements": "Processor: 1.4 GHz Memory: 512 MB RAM Graphics: DirectX 9 Compatible 3D Card DirectX: Version 9.0",
    "reviews": [
        {
            "review_text": "Back when games were games. Still have the manual for this. MMmmm physical copies.",
            "review_score": "1"
        },
        {
            "review_text": "Must buy! A classic. I have to admit I didn't even think twice about buying this game, and when I did, downloaded and the title screen came up, a wee tear formed in my eye, It was my childhood returned.   I played this game when it was originally released and I'm that bad of a horder that I still have a hard copy of the game manual.   The only game better in the genre was Pharoah/Cleopatra.     ",
            "review_score": "1"
        },
        {
            "review_text": "I was so happy to see Caesar 3 on Steam! One of the best strategy games ever made, and very unique due to its gameplay. You just dont build simply a theatre next to your casas, the actors have to pass them in order to entertain the citizens. Love it 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun city-builder. Played this when I was about 10, didn't really get it then, enjoy it a lot now.",
            "review_score": "1"
        },
        {
            "review_text": "tottaly reccomend. but can some one patch this might have a few bugs. but for 7 79 you cant argue best bargain for one of the most nostalgic city builders ever.",
            "review_score": "1"
        },
        {
            "review_text": "Definitely my MOST wanted game on steam. Although it may be lacking in the performance issues or resolution compared to other city builder games, having an objectives on building a city seems clearly fresh.",
            "review_score": "1"
        },
        {
            "review_text": "This game is just awsome. Even after so many years. Remember having a portuguese(BR) version of the game that came in a bundle with a antivirus. how to forget when you clicked in a worker and he said 'Como um carroceiro pode continuar trabalhando sem ter o que comer?' 11/10",
            "review_score": "1"
        }
    ]
}