{
    "app_id": 518580,
    "name": "Accounting (Legacy)",
    "release_date": "2016-10-18",
    "developer": [
        "Crows Crows Crows",
        "Squanch Games"
    ],
    "publisher": [
        "Crows Crows Crows"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "VR"
    ],
    "achievements": 0,
    "positive_ratings": 2055,
    "negative_ratings": 116,
    "price": 0.0,
    "description": "The modern field of Accountancy is a serious and honorable profession. Many human beings have spent their lives toiling over the hard science of numbers. Thousands have died so that we may get to the level of understanding that we have today. Thousands have died.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/518580/header.jpg?t=1540209057",
    "minimum_requirements": "OS: Windows 7 SP1, Windows 8.1 or later, Windows 10 Processor: CPU: Intel i5-4590 equivalent or better Memory: 4 GB RAM Graphics: Nvidia GeForce GTX 970, AMD Radeon R9 290 equivalent or better Storage: 1 GB available space Sound Card: yes Additional Notes: VIRTUAL REALITY ONLY",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "As a professional accountant, I can safely say that this game is a remarkably accurate representation of my day-to-day job. It's downright eerie how they captured the nuance of the profession. Two thumbs up.",
            "review_score": "1"
        },
        {
            "review_text": "A walking simulator where you have to actually do the walking with your own actual legs. Bloody outrageous.",
            "review_score": "1"
        },
        {
            "review_text": "I love Rick &amp; Morty and this pretty much brings all of that bizarre humor into the VR world. I had quite a few really good laughs watching/participating in this. I expected it to be more of a passive movie type experience but you actually have to do stuff to progress through it. Don't worry though, I figured it out so you should have no problem.  Stuff I liked:     Rick and morty voices and humor     It also had a slight 'Stanley Parable' feel to it at times     It's Free! Don't wait to download it and try it, DO IT! DO IT NOW!   Things I didn't like:     A little more variety in the dialog and this would be great. It's fun to watch, but after you do one time through you probably won't need to run it again.     Some parts are obvious what to do, other parts are not so obvious. I figured it all out anyway, but it could be better.     There's just not enough of it. I want more... I want like a whole series of this type of stuff where you have to figure your way through the virtual worlds.    So yeah, I don't have much bad to say about it, and it's worth the download and time to run it .... Definitely check it out.",
            "review_score": "1"
        },
        {
            "review_text": "I would pay good money for a longer version of a game such as this.",
            "review_score": "1"
        },
        {
            "review_text": "Short but hilarious experience! Thanks Justin Roiland for keeping me sane while Rick and Morty is still out of season.",
            "review_score": "1"
        },
        {
            "review_text": "I laughed, I cried, 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Classic Rick &amp; Morty style humor - similar to the Interdimensional Cable episodes :) Brilliant and hilarious - just go play it!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best VR 'Games' so far. If you like Rick and Morty, you will love this. Don't spoiler yourself by reading too much about the game or by watching gameplay videos. Just play it! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I could sense the 'Rick and Morty' in this game before i knew there was a reason for it. Made me laugh, make very confused facial expressions and was very entertaining for the very short time it was played for.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥♥♥ coworkers, rude pillow stuck inside a tree, other intersting characters, you get to bone someone, crime, justice, court, talking whiteboard.  10/10 would do accounting again!  I feel guilty for playing such a great game for free... This game is so good that I really feel like I should donate or send money to the developers, and I've never feel like paying for free thing before.  NOW TAKE OFF THE FLESH OF OUR BELOVED KING OFF YOUR ♥♥♥♥ING FACE!!",
            "review_score": "1"
        },
        {
            "review_text": "More. Please. Being insulted in VR is strangely like being insulted in real life, but different.",
            "review_score": "1"
        },
        {
            "review_text": "Yes the gameplay is only half an hour long but it packs that 30 minutes with clever funny writting, colorful environments that looks hand-drawn, and many interactions. It's free so that already makes the game worthy to install. This is just the beginning of Squanchtendo's toe dipping into the pool of VR gaming, and I am already excited to see what they bring us next.",
            "review_score": "1"
        },
        {
            "review_text": "Very very good and suprising dialogue :D",
            "review_score": "1"
        },
        {
            "review_text": "How the ♥♥♥♥ do i get passed the skeleton acid thing. -Amazingly well done game. Would pay to see more.",
            "review_score": "1"
        },
        {
            "review_text": "It's about time the Vive started getting some content. With all the PSVR games you start to wonder why you paid £800 for a headset that could only play tech demo's.  This game shows what a bit of imagination and clever writing can achieve.  It's funny, very weird and I do hope they continue to make VR games. Hopefully the next title will be a couple of hours long. Still i'm tnot complaining this was free after all!",
            "review_score": "1"
        },
        {
            "review_text": "Hey, you, yeah, you. Do you love Rick and Morty? Then you, you better, you gotta play this, man. You need to, you gotta play this game. It's great. Just remember to stay in your personal space, and squanch it up!",
            "review_score": "1"
        },
        {
            "review_text": "I'm pretty sure I just played a 30 minute episode of Rick And Morty. Then Again, I've taken off my VR goggles 5 times now, so it's entirely possible that I'm still in a 4th level VR world, and I'm actually typing a virtual review.",
            "review_score": "1"
        },
        {
            "review_text": "An accurate portrayal of modern accounting practices.",
            "review_score": "1"
        },
        {
            "review_text": "I need more of this in my VR life..",
            "review_score": "1"
        },
        {
            "review_text": "This game... err... challenge... uhh... experience, was interesting...  First off, I would rate the game mature for language and themes. Definitely wouldn't want my kids playing this (don't be fooled by the cute, cartoony imagery on the icon). That being said, the game has moments where you think to yourself, 'this might actually be fun'. I would categorize this title as a puzzle game hiding behind a dirty, hybrid facade of Family Guy and South Park. It's entertaining for it's short lifespan and definitely worth the admission price (free, just in case they decide to start charging for it).   Technically, the game was alright. Most of the scenes were fluid with very few bugs and a decent level of interactivity. I believe they do an adequate job of representing the capabilities of VR.  Overall, I would give this title a 5/10, which isn't bad considering what it is; a 30 minute distraction from reality. Play it once: snicker, tremble, yawn, and then throw it away.",
            "review_score": "1"
        },
        {
            "review_text": "very short game but incredibly funny!",
            "review_score": "1"
        },
        {
            "review_text": "Such a funny and clever VR game!  Please please PLEASE work on another game together!!!!  Please make a full length game! I will happily pay good money for that.",
            "review_score": "1"
        },
        {
            "review_text": "Hilarious experience! :D I can't wait to play Rick &amp; Morty VR now... this was sort of a sneak-peak of that type of craziness.. even though Owlchemy Labs didn't make this. Justin Roiland is in this, and he's a big part of Rick &amp; Morty. Plus, it's free!",
            "review_score": "1"
        },
        {
            "review_text": "An accurate reprisentation of what it is like to use VR and be an accountant of some type.",
            "review_score": "1"
        },
        {
            "review_text": "Almost died laughing playing this. I can't wait for the next Squanchtendo game!",
            "review_score": "1"
        },
        {
            "review_text": "This is now one of the frist games I put first-timers in!",
            "review_score": "1"
        },
        {
            "review_text": "A cool 20 minute silly story, although the constant 'typical whiny voice' from Justin Roiland gets old REALLY QUICK. And unfortunately, some of the things you are to do are a bit too unclear. Other than that I would recommend it",
            "review_score": "1"
        },
        {
            "review_text": "I was left completley speechless at times. The best Vive experience out at the moment.",
            "review_score": "1"
        },
        {
            "review_text": "This game plays with your emotions.",
            "review_score": "1"
        },
        {
            "review_text": "Short, but free and fun",
            "review_score": "1"
        },
        {
            "review_text": "Funny &amp; free, how can you beat that?",
            "review_score": "1"
        },
        {
            "review_text": "This game is excellent. Completely ludicrous plot and voice acting make it the most memorable VR experience ever. A must-play for fans of 'Rick and Morty'-style humor.",
            "review_score": "1"
        },
        {
            "review_text": "Ahhh man, fantastic!",
            "review_score": "1"
        },
        {
            "review_text": "This game was overpriced - don't buy it.   Seriously though, the vast majority of VR games I've paid for don't live up to this one even as short as it is.",
            "review_score": "1"
        },
        {
            "review_text": "Accounting is a VR program that does not understand negative space.  Accounting is a linear procession of simple “find the key” puzzles whose primary impetus is to punish with noise pollution until the player submits.   Accounting is a comedian who’s set is bombing. They can’t read the room. They keep stumbling though the same jokes until the audience feels compelled to leave.",
            "review_score": "-1"
        },
        {
            "review_text": "If you dont mind having the characters contantly yell the F word at you it might be ok.",
            "review_score": "-1"
        },
        {
            "review_text": "I never played just and dumb game !!! u just kill urself all the time such a waste of time !",
            "review_score": "-1"
        },
        {
            "review_text": "A very distubing and strange game. Needlessly violent.",
            "review_score": "-1"
        },
        {
            "review_text": "LOL. It's likew being in the Rick and Morty world. I've had a blast playing that game. It is hilarious, crazy.",
            "review_score": "1"
        },
        {
            "review_text": "Remarkable. A must play.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, very funny yet slightly disturbing, 5/7!",
            "review_score": "1"
        },
        {
            "review_text": "Well worth your time for some original Justin Roiland content. Feels like an episode of Interdimensional Cable.",
            "review_score": "1"
        },
        {
            "review_text": "This game is brilliant ! It is incredibly short though but you can feel that the developers really enjoyed plotting a scheme against the players and they can really play with you now with VR... IT'S GETTING PERSONAL ! And that is where the game is brilliant. I can't say much without spoiling so I'll stay evasive. The narative is great, not in a lyrical sense, more in the way it's really interacting with you and pulling you into this mad world. It's a story in 6 short simplistic scenes, basically a Demo you could say, hence the free aspect of it.  Definitely a very good advertising for the developers that will most certainly do more next ! Good job guys. Now let's see what they can do with a igger project !",
            "review_score": "1"
        },
        {
            "review_text": "Awesome! if you like Rick and Morty this will be right up your alley. I wish there was more.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely hilarious",
            "review_score": "1"
        },
        {
            "review_text": "if you're at all partial to rick and morty style of humour you'll love this. Definitely worth your time",
            "review_score": "1"
        },
        {
            "review_text": "What a great demo game! These developers are talented. ♥♥♥♥ing LOVED it!!! ",
            "review_score": "1"
        },
        {
            "review_text": "What can go wrong with free games? nothing, thats what. if you love Rick &amp; Morty, you will love this game, it got the same humor as the series. only wish it was abit longer than it was, and abit more interactive",
            "review_score": "1"
        },
        {
            "review_text": "clever, funny, well written Because the jokes are all reactions to what the player does (what the F have you done?!), you wish there would be choices for the player to make, that would propell the game to another dimension...dev cost control is likely to blame... or accounting...",
            "review_score": "1"
        },
        {
            "review_text": "I have actually just dropped Accounting class in Highschool :)  it helps relieve the stress...",
            "review_score": "1"
        },
        {
            "review_text": "I think I am now qualified to be an accountant. If you have a vive just get the game lol",
            "review_score": "1"
        },
        {
            "review_text": "This game is short but awesome!",
            "review_score": "1"
        },
        {
            "review_text": "A hillarious VR experience that lasts around 20 minutes. From the same guy who created Rick and Morty. For a free game, this is a great time.",
            "review_score": "1"
        },
        {
            "review_text": "This is so much FUN!!! - you need to TRY IT!!!",
            "review_score": "1"
        },
        {
            "review_text": "I loved it, It was great. Short, Free, Great!",
            "review_score": "1"
        },
        {
            "review_text": "Best experience I have played on VR so far and I have tried almost all of them.",
            "review_score": "1"
        },
        {
            "review_text": "Loved it! It's short, but it's a riot. A no brainer for Rick and Morty fans. ",
            "review_score": "1"
        },
        {
            "review_text": "hilarious, quick, great voice acting, and free",
            "review_score": "1"
        },
        {
            "review_text": "Very short, (roughly 15/20 minutes) but really really really good game, i enjoyed every minute! and it's free!! so get it!",
            "review_score": "1"
        },
        {
            "review_text": "I laughed so hard, this is entertainment at its best :D",
            "review_score": "1"
        },
        {
            "review_text": "Great, very funny",
            "review_score": "1"
        },
        {
            "review_text": "Pretty incredible experience. If you have seen Rick &amp; Morty, you know the type of stuff you're in for. Really funny/weird all the way to the end. 5/5",
            "review_score": "1"
        },
        {
            "review_text": "Funny, great voice acting. Fun ride into the world of VR.",
            "review_score": "1"
        },
        {
            "review_text": "If you have a like for silliness, adventure and free stuff..... This is the best!! Holy ♥♥♥♥ it's good. Can't wait to see what they come up with next.",
            "review_score": "1"
        },
        {
            "review_text": "If you dive into this game, you'll need to roleplay it, to take time to do things because all audio and voices are insane and react to what you are doing. This is extremly pleasant !  PS: if you loose one or two hands, just press your controller until it switch off and turn in on again.",
            "review_score": "1"
        },
        {
            "review_text": "What the hell did I just play? Crazy, crass, insane and funny as hell. The graphics are exactly what VR needs at this resolution, big clean solid textures that add to a lot of presence due to the frame rate staying at a solid 90 fps. Think job simulator, but with a bit more personality and a lot better lighting or bump mapping effects.   This 'game' is a glimpse at true genius, and insanity, and I would love the designers to expand on it and sell a full product as that really was... fun!  It's free, download... and don't let your children play!!! ;-)",
            "review_score": "1"
        },
        {
            "review_text": "I really liked it!",
            "review_score": "1"
        },
        {
            "review_text": "Surpasses the hype and well worth the download. Surprising and delightful at every step and an incredibly memorable experience. A well executed romp through the creator's imaginations. A must have for any adult Vive user. A new standard for games on the Vive.",
            "review_score": "1"
        },
        {
            "review_text": "(spoiler-free review. I suggest you play it yourself or you won't experience it properly)  Equal parts Weird, Confusing, and Hilarious! Not sure how to describe the experience, it's very unique for sure. I was laughing my ♥♥♥ off from the first scene. The dialogue is the best part followed closely by the dynamic situations you find yourself in. I really appreciate some of the things they tried here that would only have impact in VR. Scenes 2 &amp; 3 both use immersion and perspective to create a something I haven't felt in games before. Finally, I was pretty hesistant to experience some of the choices the game forces on you but overall it was cool in retrospect.  Who knows what Squanchtendo's next game will be like... but it will be a strange &amp; magical beast guaranteed!",
            "review_score": "1"
        },
        {
            "review_text": "This is the best thing ever! This is the most Rick &amp; Morty thing you're going to get until the Rick &amp; Morty thing comes out. I'm so confused right now...",
            "review_score": "1"
        },
        {
            "review_text": "Love it!   Try not to watch any vids of the game before you play - much more fun if you discover it all for yourself!",
            "review_score": "1"
        },
        {
            "review_text": "VR is perfect for this kind of games.  Thank you for making it free.",
            "review_score": "1"
        },
        {
            "review_text": "Laughed so hard i almost wet myself !!! Outstanding !!!!! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely awesome so far - I haven't got any further as I need to re-roomscale my room to continue; but yeah - very good!",
            "review_score": "1"
        },
        {
            "review_text": "I shattered a glass lamp playing this. Felt so real.",
            "review_score": "1"
        },
        {
            "review_text": "Why are you reading reviews of this? It's free, go download and play it you smuck.",
            "review_score": "1"
        },
        {
            "review_text": "This is the best game ive ever experienced in VR!  Keep up!",
            "review_score": "1"
        },
        {
            "review_text": "If Tom Green made a VR game then this would be it. It's off the wall and wonderfully original, Not one for minors though! 'Freddy got fingered' meets 'Bad Santa' and had a VR baby! Must buy (It's free)",
            "review_score": "1"
        },
        {
            "review_text": "Short but sweet.",
            "review_score": "1"
        },
        {
            "review_text": "Rikki-Tikki-Tavi, ♥♥♥♥♥♥! Loved every second of this!",
            "review_score": "1"
        },
        {
            "review_text": "holy ♥♥♥♥ this game is amazing",
            "review_score": "1"
        },
        {
            "review_text": "Had to take the headset off halfway through because i had so many tears from laughing. I need more of this kind of hilarious crap.",
            "review_score": "1"
        },
        {
            "review_text": "One of the hest half hour VR experiences i have tried. The easiest way to describe it is that you are basically inside an episode of a rick and morty-esque cartoon (lines sound heavily improvised, but in a good way). Definitely give this a try if you have a vive.",
            "review_score": "1"
        },
        {
            "review_text": "11/10",
            "review_score": "1"
        },
        {
            "review_text": "I haven't laughed like that in a long time. While the game isn't very long, it's super funny. I look forward to the next version!",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥in Hilarious, 10/10 Morty's voice does it for me",
            "review_score": "1"
        },
        {
            "review_text": "Just TRY this. You feal just inside of story ",
            "review_score": "1"
        },
        {
            "review_text": "I saw this game and thout that I was going to learn accounting. I also wanted to tell my friends that I had accounting in VR and that I learned so mutch. But what I got was way better then accounting.  If you want a good game then downloade this, AND IT IS FREE!!",
            "review_score": "1"
        },
        {
            "review_text": "not a lot to do, but very polished for a free game. make sure you have plenty of room to play, I was stuck in one of the first worlds because I couldn't reach a battery needed in the game.",
            "review_score": "1"
        },
        {
            "review_text": "The best narrative VR experience so far.",
            "review_score": "1"
        },
        {
            "review_text": "It's free, it's got squanchtendo backing it and it's just flipping enjoyable. If you are a fan of the humor from shows like Rick and morty, this is a game you gotta play.",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun approx. 20 minute experience, especially if you don't mind being yelled/cursed at!",
            "review_score": "1"
        },
        {
            "review_text": "Accounting is really serious and not fun at all. Go crunch those numbers and remember not to have fun. Nothing crazy will happen.",
            "review_score": "1"
        },
        {
            "review_text": "Loved the humour in this one.",
            "review_score": "1"
        },
        {
            "review_text": "This is my favorite free game!! It has a great use of roomscale and is really funny. It's 30 minutes long which is the lenght of a TV episode so it's great to show people room scale narratives. I can't wait to see more from Squanchtendo!!!",
            "review_score": "1"
        },
        {
            "review_text": "If you enjoy dark comedy then this is for you!",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely hilarious",
            "review_score": "1"
        },
        {
            "review_text": "Great program! I squanched through All my accounting in just 30 minutes and for FREE! I reccomend this to all my accouunting friends. This is a program that is definitly worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "What the ♥♥♥♥ are you doing here?! This is my review! Get the ♥♥♥♥ outta my review!  In all seriousness, the game is fantastic. The writing feels a bit forced, but overall it's a pure gem of an experience. I loved it, and once these guys release a full game, they can ask whatever they want for the price. I'll gladly pay it.",
            "review_score": "1"
        },
        {
            "review_text": "It was an amazing and life changing experience in 40 minutes or less. Can a seminar squanch that? Play it now, for mature? or is that immature audiences?",
            "review_score": "1"
        },
        {
            "review_text": "I'm not sure what just happened but I like it",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the few experiences where I've literally found myself laughing out loud. This is hilarious, and well worth the 10-15 minutes it takes to go through it. Can't wait for more from these guys.",
            "review_score": "1"
        },
        {
            "review_text": "This games is funny as hell. Would love to play more games like this.",
            "review_score": "1"
        },
        {
            "review_text": "An awesome comedy game that will leave you rolling in stitches. A great sense of immersion, this should be anyone's first VR game to see the type of stuff you can do.",
            "review_score": "1"
        },
        {
            "review_text": "Easily the best thing on VR right now.",
            "review_score": "1"
        },
        {
            "review_text": "Hilarious. Playing through this game is like sitting through and episode of Rick and Morty. A must have for VR players that want a good laugh.  I've shown a few friends already and my stomach hurts from laughing so hard.",
            "review_score": "1"
        },
        {
            "review_text": "This is a wonderful fever dream. Why aren't you playing it yet?",
            "review_score": "1"
        },
        {
            "review_text": "The poor man's Rick and Morty VR!",
            "review_score": "1"
        },
        {
            "review_text": "Loved it!",
            "review_score": "1"
        },
        {
            "review_text": "great invention dude",
            "review_score": "1"
        },
        {
            "review_text": "I found myself smiling and laughing in a dark room all by myself. Awesome execution of VR !",
            "review_score": "1"
        },
        {
            "review_text": "Get the ♥♥♥♥ out of my place!",
            "review_score": "1"
        },
        {
            "review_text": "what the ♥♥♥♥ was that",
            "review_score": "1"
        },
        {
            "review_text": "This is not so much a game as it is a weird episode of something you might find on Adult Swim right before Aqua Teen Hunger Force, where your the main character. The wit and humor (with vocal talents) of Rolind of Rick and Morty fame take you through a wild unprdictable series of circumstances that will befuddle your every move. This was so much fun to go through ive done it multiple times even though there are very minor things (dialog) that can change.  This is NSFW, and contains strong language and situations not appropriate for younger players. If you do play do not rush, take the time to let the dialog all play out, it can get crazy. If you enjoy Rick and Morty, you will love this.",
            "review_score": "1"
        },
        {
            "review_text": "Unbelievably fun!",
            "review_score": "1"
        },
        {
            "review_text": "Short but very fun game. If you're a fan of Rick &amp; Morty, absolutely check it out. Even if you're not though, it's definitely worth your time!",
            "review_score": "1"
        },
        {
            "review_text": "I had no idea what I was getting into when I downloaded this game, but it was soooooo worth it.",
            "review_score": "1"
        },
        {
            "review_text": "This will tide you over till the Rick and Morty VR game is released (the humor is so close) i cant wait for it.",
            "review_score": "1"
        },
        {
            "review_text": "Absolute cluster♥♥♥♥: The Video Game",
            "review_score": "1"
        },
        {
            "review_text": "This is so, so, so, so good.",
            "review_score": "1"
        },
        {
            "review_text": "When Lord Harmon decides to do something, it's funny af. This game is no exception. 10/10 Did play again, and again.... And again.",
            "review_score": "1"
        }
    ]
}