{
    "app_id": 518920,
    "name": "Surgeon Simulator: Experience Reality",
    "release_date": "2016-12-05",
    "developer": [
        "Bossa Studios"
    ],
    "publisher": [
        "Bossa Studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements"
    ],
    "genres": [
        "Violent",
        "Gore",
        "Action",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Simulation",
        "Indie",
        "Gore"
    ],
    "achievements": 55,
    "positive_ratings": 103,
    "negative_ratings": 53,
    "price": 14.99,
    "description": "Surgeon Simulator is bringing the ER to VR! The most critically acclaimed and infamous surgery simulation game as you have never seen it before! Featuring all of the surgeries and twisted humour of the original favourite plus a few new surprises...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/518920/header.jpg?t=1526556421",
    "minimum_requirements": "OS: 7,8,10 Processor: Intel i5-4590 equivalent or greater Memory: 8 GB RAM Graphics: NVIDIA GTX 970 / ATI Radeon 290 equivalent or greater Storage: 3 GB available space Sound Card: Yes Additional Notes: Try turning off some effects in the Advanced graphical settings to improve framerate",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "'Huh? What's going on, I just- oh yeah. Bashing someone's skull in with a hammer kills them, huh.'  I don't really need to expand on that thought process, but I'll say that SS:ER is not just a VR port. Much like the Advanced Edition, ER takes everything the previous iteration was and adds more. If you thought the mouse controls were clunky, worry not! This version lets you control the game with your hands and pretty much remains just as clunky but in my eyes that's a good thing.  3D controls add a certain freedom and speed to the game, however, where if previously you could only watch organs fly out of reach you can now simply step over and pick them off the floor, good as new. Not to mention the several new features added such as different camera positions displayed on the in-game screen.  Unless you have a serious aversion to surgery done terribly, terribly wrong, get this game. It's worth it.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game on my vive ever since i got my vive i would think to myself i wonder what surgeon sim would be like it was everything i wanted it to be even the new alien transplant I would reccomend as a must buy for a vive user",
            "review_score": "1"
        },
        {
            "review_text": "If your playing this game make sure you use just your thumb and index finger to pick things up! I was super frustrated at first trying to pick things up. But once you get that down it's loads of fun. Kinda creepy but loads of fun.",
            "review_score": "1"
        }
    ]
}