{
    "app_id": 520990,
    "name": "Barrow Hill: The Dark Path",
    "release_date": "2016-09-22",
    "developer": [
        "Shadow Tor Studios"
    ],
    "publisher": [
        "Iceberg Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Horror"
    ],
    "achievements": 0,
    "positive_ratings": 51,
    "negative_ratings": 16,
    "price": 10.99,
    "description": "Follow the Dark Path into a world of Druidic lore and Celtic myths. It is the Autumn Equinox on Barrow Hill, a time of great power, when the ancient standing stones are at their most powerful and dangerous. You have one night to make the offerings, follow the Dark Path and escape Barrow Hill.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/520990/header.jpg?t=1495796901",
    "minimum_requirements": "OS: Windows XP, Vista Processor: 1.5 Ghz Memory: 1 GB RAM Graphics: 128 MB DX 9.0c compliant video card DirectX: Version 9.0c Storage: 4 GB available space Sound Card: DirectX 9 Compatible Audio",
    "recommended_requirements": "OS: Windows 7,8,10 Processor: 3.0 Ghz Memory: 2 GB RAM Graphics: 256 MB DX 9.0c compliant video card DirectX: Version 9.0c Storage: 4 GB available space Sound Card: DirectX 9 Compatible Audio",
    "reviews": [
        {
            "review_text": "As a fan of this genre, and specifically shadow tor and darkling room style games, I feel compelled to write a premature review given the only review for this game is negative. I'm about 3 hrs into the game so far and it delivers on the same kind of tension the original did. The story is compelling and I would encourage anyone who is a fan of Matt Clark and Jonathan boakes games to give this one a shot. My only complaint is that I am currently unable to progress due to bug. I will amend this review once I finish the game.",
            "review_score": "1"
        },
        {
            "review_text": "Ten years ago I was walking through the chilling and haunting area of Barrow HIll and I never wanted it to end. It had just the right amount of suspense and thrills and gave me goosebumps throughout. When you love a game as much as I loved Barrow Hill you worry about a sequel because the bar is set so high.   Ten years later I enter the world of Barrow Hill again, this time in The Dark Path. It was like time never passed. BH-The Dark Path is every bit as engrossing as the original and does not disappoint. The sound effects are chilling, the atmosphere is haunting and the puzzles are the right amount of a challenge.   I am now eagerly awaiting Bracken Tor. It can't come soon enough!   I highly recommend this game!",
            "review_score": "1"
        },
        {
            "review_text": "To begin: I want to reccomend this game, I really REALLY do. I cannot, in good conscience, do that. PLEASE go play Barrow Hill: Curse of the Ancient Circle instead. It's 10 years older, sure, but is a hugely better game. (It's done, for one thing.)  I am deeply and personally disappointed in Dark Path as a sequel to Barrow Hill: Curse of the Ancient Circle, which was the game that got me into point-click adventures and games in general. I ADORE Barrow Hill-- I recieved it for Christmas back in 2006-- and it shaped so much of my love for gaming. It's been released on Steam now, so it's much easier to come by.  As for Dark Path itself, I guess I'm mostly bitter. I got it the day after release, and have waded through bugs and broken code for a week. Half a dozen re-starts, and being screwed over by unwarned sequence breaking AFTER the v1.01 update really took out most of my generosity for the flaws of this one. It's not as well-populated as its predecessor, uses poorly rendered and shaded digital character models in photos (as opposed to the real-life people you see in the previous game and even in this one), and beats the last game's excellent use of Celtic-flavored lore with the Wicca stick. The area to explore is so much smaller, there's almost nothing to interact with outside of puzzles, much of the voice acting is just poor, and it completely lacks the atmosphere and tension of Barrow Hill: Curse of the Ancient Circle.  As its own game, once the sequence bugs are fixed and we have an actual final product, it could be quite good. But, as a sequel to my favorite point-click horror game: Dismally disappointing. And that's the worst part.  I'm holding out hope for Bracken Tor-- the sequel we were promised, and hopefully the one we deserve-- but I'm legitimately hurt that this was what we were given instead.",
            "review_score": "-1"
        }
    ]
}