{
    "app_id": 521200,
    "name": "Epic Battle Fantasy 3",
    "release_date": "2016-09-01",
    "developer": [
        "Matt Roszak"
    ],
    "publisher": [
        "Matt Roszak"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements"
    ],
    "genres": [
        "Adventure",
        "Free to Play",
        "Indie",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Free to Play",
        "Adventure"
    ],
    "achievements": 60,
    "positive_ratings": 824,
    "negative_ratings": 38,
    "price": 0.0,
    "description": "Epic Battle Fantasy 3 is a silly turn-based JRPG, full of useless NPCs, rabid cats, childish humor, unreasonably large weapons, anime boobs, and other nonsense. And it's totally free!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/521200/header.jpg?t=1474049454",
    "minimum_requirements": "Processor: 2.0 GHz Dual Core or better Memory: 2 GB RAM Graphics: Probably doesn't matter Storage: 150 MB available space Additional Notes: Played with mouse and keyboard",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Wonderful game, the graphics may not be for everyone but it is 6 years old and is still just as enjoyable The game is full of references to other games and objects and the music I find to be amazing  Pros  - Lovely music - Tattled enemies carry over to other save-files/even if you die - Have to think of which gear/skills are best or each boss - Starter gear is still useful late-game   Cons  - GAME OVER screen is painfully slow at fading out to the main-menu - Heavy defense &amp; high attackers half-way through   6 years old or not, play the game. It is free so all you have to lose if your time but isn't that what games are for now days.",
            "review_score": "1"
        },
        {
            "review_text": "Murder Cute Creatures 3.  This is my 5th time finishing the game, played it on kongregate, newgrounds and finally here on steam. I bought and finished EBF 4 already and still waiting for EBF 5 to be finished.  P.S: EBF 3 is FREE.",
            "review_score": "1"
        },
        {
            "review_text": "Overall a very enjoyable game and a good several hours of free fun. Downsides is the menu/inventory system is clunky and some issue due to the old softwear it was made.",
            "review_score": "1"
        },
        {
            "review_text": "I found EBF3 to be a light and adorable old-timey style rpg with a good sense of humor. Gameplay should be familiar to anyone with Jrpg experience, and many of the jokes refer to classic titles. Plenty of 'quests' on which you can go, and lots of achievements to unlock. I enjoyed the soundtrack very much. Found the enemy-strengthening curve to be not what I expected and at first a bit annoying, but in retrospect I thought it was appropriate and provided a good challenge.  Only possible downsides in my opinion are length of play and replayability. I prefer to be casual with my gaming these days, and this provided a weeked of cute, nostalgic fun. You can pick it up and put it down at your own pace since you can save anywhere. If you want something a little longer and more involved this may not be your favorite. Not sure if it will have much replay value, but completely worth a free download.",
            "review_score": "1"
        },
        {
            "review_text": "EDIT (1) : I just played a decent ammount of hours in this version on EPIC difficulty. My review will change and reflect on that. EDIT (2) : Updated the 'VERDICT' to suit the current build. EDIT (3) : Small changes.  NOTE: This review was made for the build 1.1.1.   Epic Battle Fantasy 3 is a parody game and a sequel to the Epic Battle Fantasy series. It's possibly one of the best FREE indie RPG turn-based games out there since it won several indie awards from sites like Armour Games. (Even though it is a little out-datted from Matt's standards) This version has small improvements such as an added the wave counter, status damage color, and other little changes around the game.  PROS: + Incredible Soundtrack (They don't very well though) + Unique and fun equipment system (No equipment is leftout) + Choose your battles (No random battles) + Humorous (Funny text here and there) + Several hours of gameplay and much content (15 hours average to completion) + Good Replay Value (Many difficulties &amp; New Game+) + Several popculture references (From video games to shows) + Optional Exploration (Hidden loot) + Several Unlockable Extras (NPC Maker and other Art) + Optional Sidequests (Not necessary to beat them)  'Meh': * Visuals (Some are low quality while others are pretty) * Story (Nothing special, but not bad either) * Few grammar/spelling errors (Not really noticable) * Minigames (They were a hit and miss really) * Puzzles (Nothing special)  CONS: - Random difficulty spikes (Monoliths...) - Framerate issues (Won't run on a potato)  VERDICT: Epic Battle Fantasy 3 is overall an amazing game and personally a favorite of mine. The series continues to get better and better as each installment is added. Can't wait till EBF5! 8/10  P.S. I don't have the money to get Epic Battle Fantasy 4 or Bullet Heaven 2... It'd be great to play the Steam version of those games. ; - ;",
            "review_score": "1"
        },
        {
            "review_text": "Pros:   It's solid, it works, and its aesthetic is good. Combat is balanced and everything just screams 'Newgrounds'. It's great for a free product. As an archaemimemeologist I say this is a very good ancient meme brought back to life.   Cons:  Comic sans but I guess it fits in a weird way.",
            "review_score": "1"
        },
        {
            "review_text": "Super cute and hella cheesy. just wish I could make the screen bigger than 400x600",
            "review_score": "1"
        },
        {
            "review_text": "played this game long ago back on kongregate, loved it, glad to see it on steam",
            "review_score": "1"
        },
        {
            "review_text": "Cool Game!",
            "review_score": "1"
        },
        {
            "review_text": "Such amazing game from Matt &amp; Phy..  Songs are really good (Especially wings :3 ) Graphics good for an J-Rpg game. Fights and skills are really good. (Especially Moe-Kyun xd) Puzzles not satisfied me but i dont said they are bad...  Now i should play EBF4 &amp; review that game :3  (Oh also you can finish game in 12 hours in epic mode) ",
            "review_score": "1"
        },
        {
            "review_text": "Clickable boob  I recommended it  ",
            "review_score": "1"
        },
        {
            "review_text": "I played this game on browser and got it as soon as I saw it on Steam.. Really fun game to come back to ^~^",
            "review_score": "1"
        },
        {
            "review_text": "Great Game, and free!   10/10",
            "review_score": "1"
        },
        {
            "review_text": "In my opinion it's probably the best free game on Steam.  Definately worth picking up.",
            "review_score": "1"
        },
        {
            "review_text": "Such a adorable and fun game, good for passing time.",
            "review_score": "1"
        },
        {
            "review_text": "Honestly, had i known it was on steam sooner i would've played it then. To me this is one of those titles that while it is free, with it's awesomeness, i dont think it should be free. I also remember back when i played it on the web browser, and it hasn't changed any since.",
            "review_score": "1"
        },
        {
            "review_text": "keep touching the pig and you will get pig molester good game well played",
            "review_score": "1"
        },
        {
            "review_text": "Just play it!",
            "review_score": "1"
        },
        {
            "review_text": "Very fun and easy to play. Best part its Free!",
            "review_score": "1"
        },
        {
            "review_text": "you can play with the girl's boobs and unlock an achievement for that. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I played through this game so many times on Newgrounds before it came to Steam, and I was so ready to throw money at it like I did EBF4. I was actually kind of disappointed when it turned out to be free, but hey, the more people that know about this incredible game and it's phenominal developer, the better.",
            "review_score": "1"
        },
        {
            "review_text": "Fun and cute! Reminds me of Castle Crashers. Love the little hidden shout-outs to other famous RPGs.   My only issue is with the quest items. I can't see what they are when I mouse over the requesting NPC. I'm having to guess based on the silhouette. Would also be great if there were colors in the equipment comparison charts to indicate if something raises (green) or lowers (red) a stat. I have to play the game with the monitor pretty far away as it induces motion sickness so I'm unable to see things clearly.   BUT since it's FREE, I have no real beef with it and really enjoy it. :)",
            "review_score": "1"
        },
        {
            "review_text": "One of the best free RPG's on the web. Classic feel and fun combat.",
            "review_score": "1"
        },
        {
            "review_text": "5/5 Awesome game, and I recommend it to everyone and anyone who likes RPGs!  I actually started the EBF series on EBF 4 (which everyone should buy and play, because it's even better than this game), but have since played and/or beaten all of Matt's games, EBF or not. I still need to clear out the monsters in the last hidden area, but other than grinding to do that, I've beaten this game.  It's a fun, easy, colorful, and well-designed RPG with catchy music and a 'free' price tag to boot. There's lots of stupid humor, immature jokes here and there, and adorable monsters to smack for loots 'n' levels. And to make things even better, he's added a bunch of useful features that were not there on the web version! I absolutely adore the frame rate buttons, and I love that we can now see monster stats at any time during your turn. And Lance doesn't die so much! Woo! The difficulty is well-scaled so even newbies can play and beat it on lower difficulties, while the Epic difficulty can cause you to actual plan your fights and not be impossible!  So what's not to like? As far as I'm concerned, there is nothing horrible about EBF3, though there are a few bad things. The game doesn't look nearly as nice on full screen as EBF4 an BH2 do, but it still looks pretty good. There are a few spelling errors here and there, but nothing major. Plus, you likely won't use several of your equips, but what RPG doesn't have equips you never use? My biggest problem, though, is definitely trying to sell items and having to click 100+ times to get rid of all the bug wings I've collected.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. Download it now and thank me later. It's humor is (meant to be) lame enough that it is funny but game play is worth it. Also the best part is that it's free.",
            "review_score": "1"
        },
        {
            "review_text": "I have played Epic Battle Fantasy on Kongregate and Newsground. I had enjoyed the game and I really liked the soundtrack. So I still give it a praise on Steam, just because the story is unique, comical, (cats) and has positive funny atmosphere.",
            "review_score": "1"
        },
        {
            "review_text": "Highly recommend, short turnbased game thats very well made and FTP",
            "review_score": "1"
        },
        {
            "review_text": "Definitely nominating this for 'Best Use of A Farm Animal'. Love the humor, and the clever references to pop culture. Only issue: I'm still having so much damn trouble beating Akron on Epic!",
            "review_score": "1"
        },
        {
            "review_text": "-Started up game. -Saw Natalie's breasts. -Out of instinct clicked. -Noticed bounce physics. -Continued clicking. -Achievement Unlocked-  Pervert  -Interacted with pig. -Was amazed at the beautiful sound that came from it. -Continued making the pig squeal. -Achievement Unlocked-  Pig Molester   I am officially now a pervert and pig molester. Good game.",
            "review_score": "1"
        },
        {
            "review_text": "characters are too big and moving a little bit moves you to the next map. There's no prompt as to what keys to press and no clear indiciation of any possible quest  Quit after 5 minutes of not liking the game. Not my cup of tea",
            "review_score": "-1"
        }
    ]
}