{
    "app_id": 521470,
    "name": "Magical Otoge Ciel",
    "release_date": "2016-08-26",
    "developer": [
        "batensan"
    ],
    "publisher": [
        "batensan"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Casual",
        "Free to Play",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Free to Play",
        "Visual Novel",
        "Indie"
    ],
    "achievements": 0,
    "positive_ratings": 163,
    "negative_ratings": 14,
    "price": 0.0,
    "description": "Ciel's story in Magical Otoge, a cheesy romantic comedy visual novel series with an overly literal name.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/521470/header.jpg?t=1472565185",
    "minimum_requirements": "OS: XP+ Processor: 1Ghz Memory: 512 MB RAM Graphics: DirectX® 9 Compatible Graphics Card Storage: 180 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I wish I could buy this. ; u ;",
            "review_score": "1"
        },
        {
            "review_text": "If you're looking for a quick otome game fix, this is perfect. Simple, enjoyable, and with good art &amp; characters. Highly recommend!   (Steam glitched or something and didn't record my game time. It took me about 4 hours to complete.)",
            "review_score": "1"
        },
        {
            "review_text": "I have finally finished the full game as of October 26th, so this is the final version of my review! I enjoyed this game far more than I thought I would going in. The characters, the art, the story, THE HUMOR-- all of it is A+ and I totally recommend it. = w = b Hands down, one of the best visual novels I've played, and the most enjoyable one I've played since Dandelion. The humor alone had me laughing so much more than expected. THOSE PUNS WERE TOTALLY WELCOMED, UNSOLICITED OR OTHERWISE. Keep up the good work, and thank you for Magical Otoge Ciel!  Oh, and two more things. One, I like how it's actually stated here that the choices don't matter in advance. I feel less stressed about choices affecting the ending, and instead I can just enjoy each choice and reload to enjoy the others, as well. And two, I like how you get the option to skip to Route Selection after you complete a route. It's very refreshing for a change, and it saves time on having to skip through dialogue you've already read to get to the next route you want to read.",
            "review_score": "1"
        },
        {
            "review_text": "its pretty cool so far the art style is calming to me ^^",
            "review_score": "1"
        },
        {
            "review_text": "Must-Try. Way beyond my expectations. Kudos to developer that shares this free of charge for all to enjoy!",
            "review_score": "1"
        },
        {
            "review_text": "While there are many free games available on Steam, most of them aren’t very good. Visual novels are practically a dime a dozen, but this one stands out with clever humor, a cute art style, and refreshing story line. While Magical Otoge Ciel falls along a thin line of strict visual novel and “game,” with no actual decisions affecting course of the story short of picking which character your character favors, it’s well written and is overall fairly enjoyable.   You can read my full review, with screenshots   HERE.   [bastiongaming.tumblr.com] ",
            "review_score": "1"
        },
        {
            "review_text": "  It's just so charming!",
            "review_score": "1"
        }
    ]
}