{
    "app_id": 522570,
    "name": "The Last Hope",
    "release_date": "2016-08-29",
    "developer": [
        "Atomic Fabrik",
        "Cristian Manolachi"
    ],
    "publisher": [
        "Atomic Fabrik",
        "Cristian Manolachi"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Indie",
        "Simulation",
        "Adventure"
    ],
    "achievements": 10,
    "positive_ratings": 259,
    "negative_ratings": 457,
    "price": 0.79,
    "description": "You made the biggest mistake in human history.Now you are the last hope of the world.Explore U.K,Russia,Germany,Norway,Egypt,U.S.A,Mars,Moon Search fish,fruits,beer,meat if you want to stay alive.Travel through differents Eras of time,face differents kinds of creatures and return mankind back.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/522570/header.jpg?t=1545423211",
    "minimum_requirements": "OS: Windows 7 x64 Processor: Intel Dual Core e8500 3.2ghz Memory: 2 GB RAM Graphics: GT 240 DirectX: Version 9.0 Storage: 4 GB available space",
    "recommended_requirements": "OS: Windows 10 x64 Processor: Intel i5 4460 3.2ghz Memory: 4 GB RAM Graphics: GTX 670 DirectX: Version 11 Storage: 4 GB available space Additional Notes: Game also run on ultra using an Intel Pentium G3460 &amp; GTX 1050",
    "reviews": [
        {
            "review_text": "Initially I had purchased this game thinking it would be another fun, mindless hack and slash game with RPG elements and crafting (like most of my favorite games i.e. minecraft, starcraft, warcraft, guncraft, fruitcraft, and sims online)     I was very surprised to see that this game is not only EDUCATIONAL but ARTISTIC in scale and scope. I have read the reviews and am very disappointed with people's interpretations of this fine work. These people i.e. uneducated plebians, gas station workers, political activisits, burger king seat attendants, grass people, soup kitchen engineer, life hack coachers, staples managers, subway (eat fresh) bathroom guards, etc. simply DON'T understand the inner workings and deeper meanings presented in this fine work.     This fine work is a amalgamtion of all things curltural, hystorical, sexual, timeal, and. It speaks to both our human selves and our animils self very well in that it continues to flesh out the correlation and coronation of selves within to first dominated and engineer a proper rebuttal for one's own lust, greed, love, sex, addiction, and. It properly transcends the inner workings of this fine work, unifying and gratifying for all intents and purposes, the one true meaning behind gaming, and internet culture, forming a single orginism (this is only an example) which never ceases to surprise and astound my visual, spiritual, and sexual senses, and.     I feel as though perhaps most of these negatival reviews simply didn't play through the first level and didn't expwerience the same craftsmanship that I did. And.     This is a time travel story that delves deep into our cultures and has alot to say about us as people, nations, and colors. And      Perhaps this fine work will; be better appreciated in a few years' time. Like a fine whine, or a delicious smoked trout, age is but a number, and only serves to enhance the flavor, taste, palette, and sexual energy of the work.     Please, don't let the naysayers fool you! This si worth your time and worth the $1.99 it costs. It will give you 4+ hours of enjoyment on New Game. new Game + will entitled you to an editional 6.6+ hours of secrets, mazes, bosses, sexual advances and cutscenes, and.   It's worth a try for 2 bucks, right? It's orth a lil tap? It's worth a lil game. Just buy two copies and you ca play the upcoming multiplayer time campaign which is located in Ireland (this game has alot to say about alcohol, so top drinking countries, such as us, ireland, german, russian, bangladesh, etc has alot to say about alchohols)  Give it a chance is all I ask, and.         Thank you for your time, hope this was a helpful review. I am friends with the developer and was paid good money for this review. honestly, about 50% of everything you spend goes to me from here on out so please buy this game so I can line my pockets properly. Please buy 2 or 3 copies minimum. I need the money.  And. ",
            "review_score": "1"
        },
        {
            "review_text": "Something new from what i play usually, I liked it, and story line is very good!!!",
            "review_score": "1"
        },
        {
            "review_text": "  Very good game for 1 man developer. It feels, that from beggining were made some major mistakes in creating the levels(they are big), but when passing the game you see that levles are getting better and better.",
            "review_score": "1"
        },
        {
            "review_text": "Pros: - Creative Idea. - Textures are adequate but there are definitely better out there.  Cons: - I don't remember any statement about this being pre-alpha.  - Menu is extremely limited in functionality. - Poorly written storyline. - The floor on the first level is poorly aligned. You should not have to jump over steps just to get up a ramp in the hallway. - The ambient soundtrack is annoying and repetitive. This game could definitely benefit from better localised and volume balanced ambient noises. - Ceiling fans sound like guillotines. - Door frames have to be jumped over. - The supposedly alive people in the intro level look like animatronic robots, and not the good ones. - Ambient models are ambiguous, not clearly defined as to their purpose. (i.e. was that supposed to be a robotic arm with a camera on it or ...... why would a camera the size of a Buick be on a robotic arm?) - No difficulty modifier. - It looks like the game was made in Garrys Mod, only not that good. - Why did I just get transformed into a viking on a space station? - Was that supposed to be a space station to planet transport tube or did brick walls collide in the middle of the hallway? - Was I supposed to collect animals once I got off the space station? - I couldn't justify spending any more time on the game at this point.",
            "review_score": "-1"
        },
        {
            "review_text": "Well, if you like walking while wearing a horned helmet...have I got a game for you. yes, it's this one and even early on I can tell it sux beyond belief. I've just spent the last 10 minutes walking thru endless, repetitive corridors. that's 10 minutes of my precious, precious life gone. extinguished.   tl;dr it sux is being kind to it and the universe.",
            "review_score": "-1"
        },
        {
            "review_text": "Do not buy this if you are a YouTuber, there are copyright music used, the game is not that much fun, there is nothing that really indicates you run in the right direction and even if you do it does not mean you will win the game. There is no time to watch around you since your thirst kills you 80% of the time...         YouTube™ Video:  The Last Hope Gameplay Walkthrough Part 1 Let's Play 2016 Game Commentary Playthrough&nbsp;",
            "review_score": "-1"
        }
    ]
}