{
    "app_id": 523710,
    "name": "Sword Master VR",
    "release_date": "2016-09-23",
    "developer": [
        "Master Indie"
    ],
    "publisher": [
        "Master Indie"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action",
        "Indie",
        "Simulation",
        "Sports"
    ],
    "tags": [
        "Action",
        "Simulation",
        "Sports"
    ],
    "achievements": 0,
    "positive_ratings": 139,
    "negative_ratings": 55,
    "price": 6.99,
    "description": "Enter the virtual reality sword fighting arena of Sword Master VR! Test your skills with the blade against smart and interactive AI enemies! Unlock new swords and game modes! Prove that you are the sword master!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/523710/header.jpg?t=1494341264",
    "minimum_requirements": "OS: Windows 7 Processor: i5 Memory: 6 GB RAM Graphics: GTX 770 or AMD R9 390 Storage: 550 MB available space Additional Notes: HTC Vive   OR   Oculus Rift with Touch in room-scale configuration",
    "recommended_requirements": "OS: Windows 10 Processor: i7 Memory: 8 GB RAM Graphics: GTX 970 Storage: 550 MB available space Additional Notes: HTC Vive   OR   Oculus Rift with Touch in room-scale configuration &amp; 3rd sensor",
    "reviews": [
        {
            "review_text": "LOVE THIS GAME!!! Before my Achilles gave out I used to love fencing, so I'm always excited to try another sword combat game in VR. While no game can compare to actual fencing, this one really feels like sword fighting. Yes, the AI is simple, but having multiple opponents circling you adds enough difficulty to make up for that once you get to expert level. Also, on expert level this is the best game for exercise I've yet played. Holoball and Holopoint are right up there too, but this one beats them for getting my heart rate going.   I'll compare this to my second favorite sword combat VR game, Vanishing Realms (With the new update that gives you Warriors Challenge Hard Mode). The sword combat in Vanishing realms is pattern based, like the original (I'm dating myself here) Prince of Persia, or Prince of Persia Classic on the Xbox 360. I really enjoy it, but your opponents just stand there for the most part. If the opponents moved around you more, like they do in Sword Master, then I would have to consider that my favorite sword game because the patterns are more complex and some of the attacks are faster.  To the developer:  I would like a mode where the opponents don't forecast their attacks so much, and that attack is faster. This might up the challenge without having to have 3 guys surrounding you.  Also, I would love to see a duelist mode that was more like fencing. To avoid the challenge of making a sword game work in a situation where you cannot apply force to the player’s hand when their sword is supposed to be deflected you could use a right-of-way convention like what is used in foil and saber fencing. The first one to begin an attack gains the right-of-way and, if they land the hit, will score if the opponent dose not parry. Parrying gives the opponent the right of way. The player having lost the right-of-way can no longer score even if they land the hit unless they first regain the right-of-way. Missing with an attack also causes you to lose the right-of-way. So, if your attack falls short your opponent can immediately attack and will score even if you strike again and you both hit at the same time. Not sure how do-able it would be to program this but I would love to see something like this in a sword game.",
            "review_score": "1"
        },
        {
            "review_text": "  Wow, this game is grueling in the best possible way, especially when you have four Ring Wraith looking mofos surrounding you. There is a lot of movement – furious movement – inherent to this game. Imagine bobbing, weaving, attacking, parrying, riposting, spinning and lunging all in the space of 20 seconds and you will have some idea of how physically intense this game really is. On top of that, throw in dual wielding swords, and you can double your pace.   I felt this game working not only the muscular endurance of my arms and shoulders, but quite a lot of the back muscles as well, specifically the lats, traps, and scapula. Expect to feel this game in your core muscle group as well. If you want a real challenge, try out the Survival mode. I took out 32 baddies until I finally succumbed to total exhaustion and got stabbed in the face. I’ve since been settling for working my way through Novice level 6-10 to get a good 20-minute workout that doesn’t leave me uncontrollably weeping. Just restrained weeping.",
            "review_score": "1"
        },
        {
            "review_text": "I've tried a decent amount of the more popular titles for VR and some not so, but this is the perfect VR experience. The game reads your movements like a book, looks top notch, the sound is great, and the fighting is as smooth or as choatic as you want it to be, and the AI will respond accordingly it feels like. For the price tag it would be foolish not to get this.",
            "review_score": "1"
        },
        {
            "review_text": "You wanna chance to live out your last samurai fantasy. Come try this new vr game that just came out today. This Dev is going to make a million bucks. I garuntee 75% of vive owners are buying this game. Its a must have. Youll leave every game win or loose, completely outta breath, adrenaline pumping through your viens. Screaming for glory when u pull off that perfect pary and get that one shot face stab. He coulda asked $25 and I'd still buy. And no i dont kbow him, Im not him, and I did not get this for free. But none the less... Ohhhhhh its time to ROCK OUT WITH UR CO@K OUT!",
            "review_score": "1"
        },
        {
            "review_text": "I have only played this game so far on Novice difficulty level. On novice, I feel this is a physically intense game and can be punishing for me because I am the type to tunnelvision under stress. At times I would have to focus on defending myself from all attacks and tunnelvisioning on trying to maneuver into a better position to keep my 3 opponents within my field of vision. I can't remember now if there have ever been more than 3 in the arena at once, but I do appreciate the ability to shift the odds a little more in my favor by giving me a more tactical view of the arena, this way.  The first 4 or 5 stages of novice are kinda easypeasy whatever, but keep pushing. Once I encountred my first dual wielding opponent, and consequently became capable of ambidextrously waving around two of my varied collection of swords and a machete?, each with their own set of stats to consider for dealing damage in a way that works with my playstyle, I knew I would be putting this VR game onto my favorites list.   Thanks to the devs for putting this together!",
            "review_score": "1"
        },
        {
            "review_text": "Best sword fighting game on VR without a doubt. There was certainly enough variation in enimies to keep me on my toes, there seemed to be a number of different ways of tackling the issue of 'Oh God, please don't kill me'. I found myself mostly fencing with the enimies, but as the game went on I found different ways of stabbing their squishy bits. Knocking shields and swords away seemed very natural, I would definately recomend getting this game.",
            "review_score": "1"
        },
        {
            "review_text": "Awsome game! This is the one of the best sword fighting games in VR. Easy to understand, fast to get into, and playable for hours!",
            "review_score": "1"
        },
        {
            "review_text": "Only picked this up today and haven't played much yet. Based on first impressions, the graphics are a bit shoddy, with lumpy looking opponents and skeletons standing around the side clapping, apropos of nothing. Enemy movements are wooden and fairly predictable, and the hit detection is iffy. To be completely fair, slightly iffy hit detection in sword combat is not a problem unique to this game.  But despite that, for the price I still think it's not a bad proposition if you just want to bash something with a sword for a bit. Whilst something like Vanishing Realms is overall a much more polished game, if you just want something you can fire up for a few minutes here and there and smack some lumpy looking knights around, for a few quid this is perfectly fine.",
            "review_score": "1"
        },
        {
            "review_text": "Lots of fun, starts up easy then get crazy hard, quite a workout too. Took me few level in Expert to realise you could equip a shield in off hand &gt;.&lt; I was like...this is impossible with only a sword!",
            "review_score": "1"
        },
        {
            "review_text": "I waited far too long to buy this. Only spent half an hour or so, but sweating and having loads of fun! Well worth the tenner!",
            "review_score": "1"
        }
    ]
}