{
    "app_id": 525080,
    "name": "The Race for the White House 2016",
    "release_date": "2016-09-08",
    "developer": [
        "Eversim"
    ],
    "publisher": [
        "Eversim"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Local Multi-Player"
    ],
    "genres": [
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Simulation",
        "Strategy"
    ],
    "achievements": 0,
    "positive_ratings": 8,
    "negative_ratings": 11,
    "price": 10.99,
    "description": "Play as a real-world candidate and completely immerse yourself into the 2016 presidential election! Travel around the United States, try to woo voters across the country, create your own political agenda, skillfully manage your campaign budget... and perhaps you will be the next White House occupant!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/525080/header.jpg?t=1473358283",
    "minimum_requirements": "OS: Windows 10, 8, 7, Vista Processor: 1.6 Ghz Memory: 2 GB RAM Graphics: DirectX9 compatible card Storage: 2 GB available space",
    "recommended_requirements": "OS: Windows 10, 8, 7, Vista Processor: 2 GHz Memory: 4 GB RAM Graphics: Nivdia or AMD with 512 Mb ram Network: Broadband Internet connection Storage: 2 GB available space",
    "reviews": [
        {
            "review_text": "First of all I do not mean any offense to anyone, this review is my voiced opinion. At first I wrote a positive review however over time, the game has less.... Thrilling. The game is a good time killer, and addicting (I am very addicted to it, despite starting to dislike it) I often play it if I am about to leave somewhere, etc… but other than that it’s not something I would take with me on my vacation. I wrote a positive review since it was fun at one point, and I was hopeful the devs would fix the problems I mentioned in the other review I made (I took it down), but when they updated it, they do nothing, just update the polls, they don’t even add a way to delete save files, and no mention of any future updates, making me have to exit the game and access the game files (which takes a while for me because even if I organize the files, I have a huge amount of files in the Directory, thus I still have a hard time finding the game files. Uninstalling the game doesn’t work when I try to delete files) Along with the lack of updates, and hard support, for some reason, this game out of all games, makes my PC fan speed up like crazy, when my PC should be running a low quality Graphics game just fine. Im not bothered by graphics (so long as it isn’t arcade DOS style, im fine with Morrowind/Oblivion Graphics) since I feel that people spend too much time on graphics rather than how in depth the game is, and I can run Skyrim with 200+ mods just fine, I had crazy 3GB Minecraft worlds and I did fine with it. Another thing, the game isn’t as in depth as I thought it would be, after a while you know what the AI is going to do. To win all you must do is. 1. Start internet Campaign, 2. Go to locations and say everything half the super PACs want you to say 3. Dump those super PACs after they tell you how their wife would be mad at them and kiss up to their rivals. 4. At every Debate, rally, and event, talk about the Buffet rule. 5. Use money you got from cheating PACs to buy ads that would last days and get people to dislike you if it was real life. I don’t mean to offend anyone in any way, but the game does seem somewhat biased towards liberals. (Im an independent btw, I have liberal and conservative ideals, I don’t support either trump or Hillary I rather not have a political debate on steam reviews) It’s also gotten very hard to lose the game now. You know what to expect. An example to that statement that Trump is always going to talk about reduced taxes or about the common core standards. Hillary will also talk about the buffet rule, her explanation for the buffet rule: 'Nothing is more important than fairness' Which honestly seems like something someone who just learned how to share toys in first grade would say. Which is why it she always seems to get a good head start. The real Trump sounds better while the one in the game sounds like a dying old man. And the Hillary in the game looks nowhere close to the one in real life and seems like she is the second coming of Christ) Overall, I had high hopes for the game, even if the election is less than a month away, but I’ve started to see the game as nothing more than something to do when bored. I guess I learned something again however, which is that nothing is more important than fairness, which is why paying $10 for a game that looks like it is at most 2.50$ USD seems legit.",
            "review_score": "-1"
        }
    ]
}