{
    "app_id": 525610,
    "name": "Hardware Engineering",
    "release_date": "2016-09-28",
    "developer": [
        "Pb Studios"
    ],
    "publisher": [
        "Pb Studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards",
        "Includes level editor"
    ],
    "genres": [
        "Casual",
        "Indie",
        "Simulation",
        "Early Access"
    ],
    "tags": [
        "Early Access",
        "Simulation",
        "Indie"
    ],
    "achievements": 25,
    "positive_ratings": 87,
    "negative_ratings": 68,
    "price": 3.99,
    "description": "Hardware Engineering is a simplified digital circuit design (currently online) game presenting an opportunity to dive into digital engineering with ease. Learn with tutorials and enjoy yourself with challenging designs, sandbox or competitive.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/525610/header.jpg?t=1488266498",
    "minimum_requirements": "OS: Windows 7 (SP1) with .NET 4.0 and Windows Media Player Processor: Intel Core 2 Duo E4500 or Equivalent Memory: 1 GB RAM Graphics: Intel HD Graphics or Better DirectX: Version 11 Storage: 250 MB available space Sound Card: Optional Additional Notes: The game is ONLINE ONLY, and therefore requires a stable internet connection and WMP in order to be played",
    "recommended_requirements": "OS: Window 10 with .NET 4.5 and Windows Media Player Processor: Intel Core i3+ Memory: 2 GB RAM Graphics: Dedicated DirectX: Version 11 Storage: 250 MB available space Sound Card: Optional Additional Notes: The game is ONLINE ONLY, and therefore requires a stable internet connection and WMP in order to be played",
    "reviews": [
        {
            "review_text": "If you were an electronics enthusiast in the 70's or 80's and loved using breadboards, components, small bits of wire, and ttl/cmos logic, then this is the game for you. If you own the TTL or CMOS cookbook you already have the schematics. This would have been your perfect learning tool at the time. If you are expecting unicorns and wizards then this is NOT for you. If you are older than the first mobile phones you will know that moving a component on a breadboard doesn't move the wires. This is NOT VISIO and nor should it be. This is as close as it gets to creating REAL working circuits on a breadboard (without the actual breadboard or power supply). I am extremely impressed but I'm a 70's electronics nerd so you can expect me to be biased. This is NOT for everyone and it's not a 'gamers' game and for those who get stuck, when you run the circuit, examine the logic in the step you are up to. It is not really that hard to figure out from the truth tables. It would be nice to be able to 'splice' wires anywhere and at the moment the wire crossovers can get a bit confusing. One important thing to note, you can create an actual circuit instead of using the predifined components and it will still rate you as successful. A fantastic learning tool. (See my full adder example in the artwork area). I just wish they would speed up the delete. It is a REAL problem. BTW to change wires click 'w' then use the left mouse button. It took me ages to find that out today after they changed it overnight.",
            "review_score": "1"
        },
        {
            "review_text": "Overall a very challenging game, if you are a real EE then it will be easy. Unfortuatly it does have quite a few bugs but i still recommend it if you are looking for a challenge.",
            "review_score": "1"
        },
        {
            "review_text": "I have been playing around 1 hour then i restarted the game. After a restarted I can't connect components by wires. When i'm pressing the middle button then i get a scroll sphere in chrome browser. Please fix it! That's interesting to me.  Radon Try pressing 'w' for wires.",
            "review_score": "1"
        },
        {
            "review_text": "Ok, this is a very good idea for a game but I do feel it needs some work in terms of polish. It's also not much of a game, really an exam in engineering.  Personally I think a few optimisations would be nice to make this more fun and engaging.  1. Too much language in the initial instance and poorly written. 2. Interface is clunky. Click to select, click to drop, MMB for selecting wire points which don't snap properly. Then moving parts around the board don't keep the wires attached. There is huge room for improvement here - though it is a good start as it does looks nice. 3. Design language. Perhaps there's a reason I'm missing but why not use the same image for a NOR chip in the inventory as on the board? 4. Game. Ok, this feels much more like an exam than a puzzle game (though I appreciate this in a way). However, it is a sudden and sharp learning curve for anyone who is new to the subject. Consider making the tutorial a series of levels instead of a tutorial with far more problems to solve in a far longer learning curve.  I like this game, but you do need time and plenty of it - no criticism there. But time spent in a game is usually to enjoy it rather than fight an interface and reach your ability limit before finishing even the tutorial. Though to be fair I am a bit stupid... ",
            "review_score": "-1"
        },
        {
            "review_text": "At this stage it is not reccomended to buy this game. It still needs more work. It would have been better off to release this as a beta build outside of steam.  The UI needs serious work. Symbols for components are different from the parts list when you place them. The english can be confusing to people (Especially if you have no experience with logic) with how it explains things. Wiring can be annoying and for some people has been a bit buggy with things not connecting and reloading saves destroying connections.  Also this game is based on a external server. So you need a internet connection to play and it can be affected by latency. There seems to be lag when placing components but removing a wired connection can take multiple seconds. Load times while not super long seem much longer then what they should be considering little graphical effects and it is not constantly running simulations.  Overall the concept is great and it could be a really fun game but it is held back by bugs, poor UI design and irritating performance. Still on my wishlist but im getting a refund for now.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is crap and does not work. The main menu is glitched as all hell, and only 2 buttons even do anything. 'Levels' and 'Sandbox' are the only buttons that work and they take you to a log-in page which itself is glitched. It is in a loop constantly asking you to sign in. I would HIGHLY recommend NOT getting this game. Every aspect as far as I can see is glitched and bugged. Developers, when you read this, you must fix this. It is absolutly crap.",
            "review_score": "-1"
        }
    ]
}