{
    "app_id": 526490,
    "name": "Higurashi When They Cry Hou - Ch.4 Himatsubushi",
    "release_date": "2016-10-13",
    "developer": [
        "07th Expansion"
    ],
    "publisher": [
        "MangaGamer"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Casual"
    ],
    "achievements": 8,
    "positive_ratings": 121,
    "negative_ratings": 5,
    "price": 4.79,
    "description": "Higurashi When They Cry is a sound novel. The music, backgrounds and characters work together to create a world that is the stage of a novel for the user to read. They laugh and cry and get angry. The user takes the point of view of the protagonist to experience the story.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/526490/header.jpg?t=1552080227",
    "minimum_requirements": "OS: Windows XP Processor: Pentium III 800 MHz Memory: 512 MB RAM Graphics: OpenGL Compatible Card DirectX: Version 9.0a Storage: 500 MB available space",
    "recommended_requirements": "OS: Windows 7 + Processor: Pentium 4 1.4GHz Graphics: DirectX or OpenGL Compatible Card",
    "reviews": [
        {
            "review_text": "  You know, I only hope that they break that cycle.  ... You know, the one of releasing a chapter every 6 months or so.",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed reading this chapter and I recommend it if you are a fan of the series. If you haven't read any of the others, I would recommend you go in order and read this one last.   Chapter 4 changes up the series formula in that it is told from the perspective of a different character and takes place several years before the main story. While it was nice to see this chapter do something different, I found myself unable to connect with the main character. Each of the previous chapters featured one of the main girls as a focus, and this time the spotlight was on Rika. I feel that by changing the formula it made it harder for Rika to shine in the same way that the other girls did in their individual arcs (though that might have been necessary to conceal crucial plot details--time will tell).",
            "review_score": "1"
        },
        {
            "review_text": "Quite a bit shorter than the previous Higurashi chapters, but just as damn good!",
            "review_score": "1"
        }
    ]
}