{
    "app_id": 527730,
    "name": "Bus Tycoon ND (Night and Day)",
    "release_date": "2016-09-23",
    "developer": [
        "FrameLineNetwork"
    ],
    "publisher": [
        "FrameLineNetwork"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Leaderboards"
    ],
    "genres": [
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Simulation",
        "Strategy"
    ],
    "achievements": 10,
    "positive_ratings": 11,
    "negative_ratings": 13,
    "price": 1.99,
    "description": "Start building your passenger bus transport empire between cities all night and day! Bus Tycoon ND (Night and Day) is a passenger transport tycoon game. Start building your transport empire by creating bus routes between as many cites as possible.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/527730/header.jpg?t=1474642405",
    "minimum_requirements": "OS: Windows XP, Windows Vista, Windows 7, Windows10 Processor: Intel core 2 Duo (2Ghz) or faster Memory: 4 GB RAM Graphics: Direct X 9.0c compliant video card with at least 512Mb DirectX: Version 9.0c Storage: 25 MB available space",
    "recommended_requirements": "OS: Windows 7 Processor: Intel core 2 Duo (2Ghz) or faster Memory: 8 GB RAM Graphics: Direct X 9.0c compliant video card with at least 1024Mb DirectX: Version 9.0c Storage: 30 MB available space",
    "reviews": [
        {
            "review_text": "Cut down version of Transport Tycoon deluxe with only buses and no real progression  A group of disparate villages need an integrated bus network and it's up to you to build them one. Sadly this is just a very basic clone. Cities don't expand, routes don't seem to matter and the only thing that effects passenger numbers is the size of the bus stop. A tiny village can have 350 people waiting at the bus stop if you make one big enough.  The bugs, oh the bugs! Stops go blank and stop working, suddenly no one wants to catch a bus at all if you try to upgrade a station without the room to expand. Buses will get stuck navigating a 90 degree bend causing an almighty traffic jam and then just blow up without warning. Roads constantly need repairs until all of a sudden they didn't etc...  There's no real challenge in the game, the graphics are poor, bugs galore and the game doesn't seem to have any goal. Get OpenTTD instead, it's free and vastly superior. ",
            "review_score": "-1"
        },
        {
            "review_text": "  I really love this game. Very relaxing and fun. On the other hand it is a pretty simple game not to complicated which is good.  ",
            "review_score": "1"
        }
    ]
}