{
    "app_id": 527770,
    "name": "Russian SuperHero Dead Ivan",
    "release_date": "2016-10-19",
    "developer": [
        "Anatoliy Loginovskikh"
    ],
    "publisher": [
        "Sometimes You"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Casual",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Casual"
    ],
    "achievements": 17,
    "positive_ratings": 94,
    "negative_ratings": 101,
    "price": 0.79,
    "description": "Somewhere, in the farthest corner of Russia, you can find him: the great Russian superhero Dead Ivan! Surrounded by the most common stereotypes, he's armed with a chainsaw full of magic and is always ready for a fight!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/527770/header.jpg?t=1476899877",
    "minimum_requirements": "OS: Windows XP\\Vista\\7\\8\\10 Processor: 1.2 Ghz+ Memory: 1024 MB RAM Graphics: 256 MB Storage: 100 MB available space",
    "recommended_requirements": "OS: Windows XP\\Vista\\7\\8\\10 Processor: 2 Ghz Memory: 2048 MB RAM Graphics: 1 GB Storage: 100 MB available space",
    "reviews": [
        {
            "review_text": "ok lets be 100% real: i started playing this and was like ''meh'' but not much other than that and continued to play the game. It was pretty bad, but still passable, so i continued playing. I was actually going to finish the game when i realized that it's absolutely broken to the core. Allow me to explain: YOU CAN'T END THE GAME. Seriously, you can't. One level is completely bugged out and the key components won't work properly. The next level has an INSANE difficulty spike from the rest of the game, that makes it impossible to beat given the lack of mana and the absurd damage of the traps (that are EVERYWHERE and you can't dodge, unless you use the sheep spell). Not only that, but the mechanics and the controlls suck too. The story doesn't even exist, as far as i'm aware,and the sound effects are awful. It's so bad it's not even meme material tl;dr: this game is awesome, buy it and refound it",
            "review_score": "-1"
        }
    ]
}