{
    "app_id": 528720,
    "name": "Shu",
    "release_date": "2016-10-04",
    "developer": [
        "Coatsink",
        "Secret Lunch"
    ],
    "publisher": [
        "Coatsink"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "achievements": 42,
    "positive_ratings": 109,
    "negative_ratings": 25,
    "price": 7.19,
    "description": "Shu is a stylish 2.5D platformer set in a beautiful and engrossing world. Guide Shu and a cast of beautifully hand-drawn characters as they run, jump and glide their way across exotic lands, forever pursued by the monstrous and unrelenting Storm. CAN YOU OUTRUN THE END OF THE WORLD?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/528720/header.jpg?t=1525441317",
    "minimum_requirements": "OS: Windows 7 Processor: Intel Core i3 @ 2.13GHz or Equivalent Memory: 3 GB RAM Graphics: AMD Mobility Radeon HD 5000 Series or Equivalent Storage: 3 GB available space Additional Notes: 16:9 aspect ratio monitor",
    "recommended_requirements": "OS: Windows 7 onwards Processor: Intel Core i5 @ 2.13GHz or Equivalent Memory: 4 GB RAM Graphics: GeForce GTX 750 1GB or equivalent Storage: 3 GB available space Additional Notes: 16:9 aspect ratio monitor",
    "reviews": [
        {
            "review_text": "Congratulations on the game Coatsink! Beautiful artwork. Easy to pick up and many ways to approach the levels if you want to challenge yourself more. Love the time trial leaderboard too.",
            "review_score": "1"
        },
        {
            "review_text": "Ah Shu,  From the moment I saw you at EGX and having a go at the demo, I just had to buy you.  This game is amazing, due to the tight platforming and the lucious drawn visuals. It's also a mix between Rayman Origins/ Legends and Donkey Kong Country.  I fully reccomend this game.",
            "review_score": "1"
        },
        {
            "review_text": "A fairly short platformer with beautiful visuals and really nicely done music.",
            "review_score": "1"
        },
        {
            "review_text": "is good.worth money.good job on making a good came devs :)",
            "review_score": "1"
        }
    ]
}