{
    "app_id": 529150,
    "name": "Lazerbait",
    "release_date": "2016-10-13",
    "developer": [
        "Taylor Stapleton"
    ],
    "publisher": [
        "Taylor Stapleton"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Indie",
        "VR"
    ],
    "achievements": 4,
    "positive_ratings": 383,
    "negative_ratings": 11,
    "price": 0.0,
    "description": "Lazerbait is a free arcade strategy game set in virtual reality with one simple goal: capture all the planets to build more ships and destroy your enemies!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/529150/header.jpg?t=1482304122",
    "minimum_requirements": "OS: Windows 7 SP1 Processor: i5-4590 Memory: 4 GB RAM Graphics: GTX 970 Storage: 500 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This is a great VR game. Do not let its simple looking gameplay fool you, this is a lot of fun and rather strategic when playing on the larger maps. You can customize every aspect of the battle, from map size to unit count to the number of players.   Another neat thing is that you can zoom in and out to adjust the scale of things. You can have the enitre battle on a chess board, or get real close to a planet and watch ships the size of trucks fly by. It is super cool.  I would entirely recomend this game.  ",
            "review_score": "1"
        },
        {
            "review_text": "This is great little game. I'm surprised at how simple and how long I spent playing it. Sort of like Pringles. I don't have a huge desire to play it again, but I know once I start it's hard to stop. Worth the play for sure. Thx dev",
            "review_score": "1"
        },
        {
            "review_text": "amazing game, so much fun to play in VR!",
            "review_score": "1"
        },
        {
            "review_text": "Its simple, fun and free. Multiplayer would be awesome.",
            "review_score": "1"
        },
        {
            "review_text": "Fans of realtime strategy, this is a must have! The game is simple yet highly addictive. After getting tired of all the FPS and some novelty games, this one truely got my full attention everytime I pick up the goggles. Excellent job!",
            "review_score": "1"
        },
        {
            "review_text": "Fun and addictive!",
            "review_score": "1"
        },
        {
            "review_text": "Why would you even be reading a review for a free game? Running out of 'space' are you??  This is AMAZINGLY AWESOME!! It will only take me 30 hours to destroy 1,000,000 ships, but time 'flies' when you are in there!",
            "review_score": "1"
        },
        {
            "review_text": "Great game! Space RTS. like risk in space",
            "review_score": "1"
        },
        {
            "review_text": "Had this game on my hd for a while because it was free.. Did not really look that exciting based on the trailer and expected to play it for 5mins before deleting it from my hard drive, but turns out that this game is not only fun, but also very addictive and I can see myself spend hours playing this.  This would be highly recommended even if the devs actually charged money for it.",
            "review_score": "1"
        },
        {
            "review_text": "One of THE best on Vive. There are times when i'm busy and i think 'can i squeeze in a round of Lazerbait?', it's that sort of game.",
            "review_score": "1"
        },
        {
            "review_text": "Why is this free???  Lazerbait has an engaging simple mechanic and you can lose track of time playing it.  If you like VR games, get Lazerbait and give it a try!",
            "review_score": "1"
        },
        {
            "review_text": "Fun and addicting strategy game.",
            "review_score": "1"
        },
        {
            "review_text": "Don't often leave reviews but this game took me by surprise!! Would pay for it, especially if they upgraded it with some multiplayer options. Really awesome strategy mechanics, but the control scheme is the real winner, I love how easy it is to move around the map with the tactile feel buzzing when you grab it. Fantastic job!",
            "review_score": "1"
        },
        {
            "review_text": "This is an awesome game -- have been waiting for good non-'First Person walkaround' game. This has some really fun game elements. This is going to help define this kind of game genre.",
            "review_score": "1"
        },
        {
            "review_text": "A fun, basic strategy game akin to Risk, but in a three dimentional space. You have to move quickly to build up the right balance of forces on each planet, so that you are not leaving areas defenseless. Don't forget the planets behind you.",
            "review_score": "1"
        }
    ]
}