{
    "app_id": 529110,
    "name": "Awkward Dimensions Redux",
    "release_date": "2016-10-21",
    "developer": [
        "StevenHarmonGames"
    ],
    "publisher": [
        "StevenHarmonGames"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Partial Controller Support",
        "Commentary available"
    ],
    "genres": [
        "Adventure",
        "Free to Play",
        "Indie"
    ],
    "tags": [
        "Free to Play",
        "Adventure",
        "Indie"
    ],
    "achievements": 0,
    "positive_ratings": 2182,
    "negative_ratings": 528,
    "price": 0.0,
    "description": "They may be awkward dimensions, but they're my dreams...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/529110/header.jpg?t=1538151875",
    "minimum_requirements": "OS: Windows 7 Processor: 2 GHz Memory: 4 GB RAM Graphics: NVIDIA GeForce 330 or higher with 1GB Memory DirectX: Version 11 Storage: 2 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "NO! WHY IS IT OVER FOR?! I really do hope the developer(s) will make more. This gave me chills, and the experience of it left me speechless. 10/10. Will be playing again!",
            "review_score": "1"
        },
        {
            "review_text": "I got scared when I saw that chicken...",
            "review_score": "1"
        },
        {
            "review_text": "Congratulations for getting this game green-lit.This game is very Unique and I hope you keep up the great work.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting... I feel it is in the same vein as 'The Begginers Guide'... I am interested in his next project",
            "review_score": "1"
        },
        {
            "review_text": "I didn't really enjoy my experience. The controls are not fluid and the audio design is severly lacking in polish. There are too many instances of horrible audio clipping and bad dialogue to start. I hope this developer takes some of the criticism and continues to work, though. There are some really interesting and abstract ideas in this. The barrier to entry is free, so everyone should check it out and help the creator with some good feedback if you have some time. Keep it up!",
            "review_score": "-1"
        },
        {
            "review_text": "Loved it, wish it was longer",
            "review_score": "1"
        },
        {
            "review_text": "Really fantastic game, very interesting with a great soundtrack too.",
            "review_score": "1"
        },
        {
            "review_text": "A visual and audio treat of the senses. The emotions of it all truly hit home to the player, or really, the listener. I commend the creator for the execution of his vision. it is a short game but certainly impactful. I was scared, I felt at peace, I laughed, I cried... not many games can hit so much in such a short amout of time. if you have an hour with nothing to do, play through this. the sound track is beautiful (and free as well)... it played alright on my laptop too, not the best. definitely would have liked to play with AA on. there is a level with smallish text and it was tough to read fluidly without moving my mouse around like a mad man, but that isnt the game's fault (my favorite level of them all.... the one that truly got me).   Do yourself a favor and go on this journey.",
            "review_score": "1"
        },
        {
            "review_text": "I don't really like it, And i don't really get why i should.",
            "review_score": "-1"
        },
        {
            "review_text": "This is an awesome sandbox, i was craving a no limits, no rules game, and this popped up so here i am playing it constantly. reminded me of myself in one of the levels, how i had to move on with my future when it hurt to just try to forget about her, i realize this game has minimal story, but just the pure feeling of 'If you see it you can touch it' makes up for in any quality. by far my favorite free2play game aside from evolve and tf2. PLEASE KEEP UP THE GOOD WORK!!!",
            "review_score": "1"
        },
        {
            "review_text": "Alot of things that weren't fantastic, but it did keep me interested for the hour i was downloading other things in the backround.",
            "review_score": "1"
        },
        {
            "review_text": "&gt;look at alarm clock &gt;12:25AM &gt;turn around &gt;blink &gt;look at it again &gt;it's now 4:41AM &gt;RISE AND SHINE TIME FOR WORK  story of my life.",
            "review_score": "1"
        },
        {
            "review_text": "This game is weird as hell and I thoroughly enjoyed it. It's essentially a series of short vignettes/dreams, each one bringing something surprising or novel. If you enjoy postmodern art and can keep an open mind, it's free and well worth your time.",
            "review_score": "1"
        },
        {
            "review_text": "+nice background music +level skipping available +nice graphic +legit walking sim  -weird story -unclear purpose  it's nice game for you to spend your boring time",
            "review_score": "1"
        },
        {
            "review_text": "This game took me on a wonderful journey and was an complete joy to play. I enjoyed every seconed of wandering throughout the huge levels and magnificently designed world of Awkward Dimensions Redux.",
            "review_score": "1"
        },
        {
            "review_text": "An interesting game, controls are a little bit sticky but it is well worth a little explore...  6.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Eh... I really wanted to like this game. It looked promising from what's on display on the Steam Store, and indeed the first few levels are really interesting - flitting from one reality to another...seeing fragments of unrealised locations before you're off to the next one..  But the game quickly becomes very self indulgent and egotistical. I appreciate that the developer has made this as a form of catharsis...but it just comes across as whiny. I particularly didn't like climbing the ladder and watching the developer throw stuff around a stage for what seemed liked half an hour. Yeah, you got turned down for college. Thousands of people do, but most of them don't feel that they should expect others to sit down and watch your attempts at drama.  What exactly do you expect to happen? Are you hoping that people are going to go 'Wow...he's actually really good! They must have been crazy to turn him down!'? That might have been possible...if you hadn't made it so transparent. If instead you had simply shown us that you're a talented developer by making a small, well crafted game, then it might have worked. But no, you actively shout in our faces 'IT'S NOT FAIR! IT'S NOT FAIR! IT'S NOT FAIR!' as if that will have the result you want. Sorry, but it makes you look like an unhinged petulant teenager throwing a hissy fit because they JUST DON'T REALISE YOUR GENIUS...or something.  Loved the first half of the game, but quickly lost interest once it got 'personal' and whiny.",
            "review_score": "-1"
        },
        {
            "review_text": " Dream Meme Team",
            "review_score": "1"
        },
        {
            "review_text": "play this game when your high.  best high you will ever experience",
            "review_score": "1"
        },
        {
            "review_text": "Okay, so where do I begin? Because I honestly have no idea how to begin, seeing that this game is...I just have no words to describe it. I suppose I could start with saying that in order to get even a remote idea of what this game is, and what it's about, one would have to acually play the game. Other people call this an expirence, and I would agree with that. I have to thank the dev for making this game, because I don't care what people compare this game too, I haven't played anything like it. And I get the idea that it's kinda like 'A Beginner's Guide,' or 'The Stanley Parable,' in the sense that it's a visual narrative rather than a game, but I feel this game does so in a way that is more relatable than other games like it. There was always a level that made me relate to the developer in ways that other games haven't been able to to for me. (Probably because I haven't played many games like this, so what do I know?) Not to mention, I've played this game twice, and still wanna play it again. Because the story that the dev tells is so intresting, I wanna play it again just so I can understand him better. So for those of you who will skip half the levels, or skip any levels for that matter, and only play the game once, that does a huge disservice to the game dev and the work he put into this. But I suppose this wouldn't be a very good reveiw if I didn't give some critique. Hmmmm. Sometimes the dev's voice gets drowned out by the music. And the music is wonderful, don't get me wrong, but I really wanna know what the dev is saying. And it's kinda hard to do that when there are G7 chords going off at Fortissimo in my ear. OH! Before I leave! I you read up to this point, major props to you. And if you decide to play the game a second time, turn on developer commentary. It'll answer quite a few questions.     tl;dr PLAY THIS GAME ITS FREAKING AMAZING!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Starts off really trippy, but it gets good after a while. Pretty fun, definitely one of my favorite games thus far.",
            "review_score": "1"
        },
        {
            "review_text": "This was strange. I'm trying to decide if I liked it or not. I just finished it a minute ago. It was certainly pretentous and certainly dealt with some incredibly cliche topics such as the whole 'no one understands how important art is to me' and 'I'm a teen and the world doesn't understand me.' I feel like if it were the first time someone has done anything dealing with these topics, it would have been more incredible because the game itself is very well made. For a free game, the graphics are nice and it does capture the essence of a dream in a few of the scenes. I just feel like the dev could have taken his appearent great skill in developing games and applied them to a more origional concept. The only reason i'm not recomending it is because i gained nothing from it as a perspective viewer. It was all stuff that has been dealt with in every movie and TV show and video game and book ever made. But don't take my word for it, you should check it out. At the very least, the game is well made and the music is good.",
            "review_score": "-1"
        },
        {
            "review_text": "The game is well made, BUT it seems very bland behind the covers. I know this is sort of a personal diary in the form of a game but I wish it was more. It has a few very mind bending scenes which also make you emotionally connected the game (the breakup level was good). I am new to the indie scene and this one seems quite alright. Would like to try out more of his works, improved and more polished ones. I did expected a slight LSD dream emulator vibe from it.. But was let down by how limited this game felt.",
            "review_score": "-1"
        },
        {
            "review_text": "I get that its being artsy, but it feels like some random indie film made into a slow as molasses game. At one point you are in aroom climbing a ladder while a film plays out before you and in the background are peoples less than favourable reactions to previous works by this developer. They put into words what I feel about this game.",
            "review_score": "-1"
        },
        {
            "review_text": "I get that its being artsy, but it feels like some random indie film made into a slow as molasses game. At one point you are in aroom climbing a ladder while a film plays out before you and in the background are peoples less than favourable reactions to previous works by this developer. They put into words what I feel about this game.",
            "review_score": "-1"
        },
        {
            "review_text": "So I don't normally write reviews but I felt the need to say something this time around. Let me start by saying I do recommend giving this game a go, though not for the reasons you might think.   As a hobby developer myself who has unity in the past for similar projects it was definitly interesting to see how someone else acomplished similar ideas. Mechanically it was a lot of fun to run around in and try and decipher some of the game design tricks the dev used.   My problems are with the actual content of the game. A dream-state game with disembodied doors is lazy. I have seen it far too many times (one of which was something I made in highschool myself). It is a way to have several ideas and design choices without having to come up with a narrative reason for the change other than 'uh its a dream' or 'uh its limbo' or whatever. I don't know if the dev reads all of the reviews (I know I wouldn't) but in case you do, or for some reason you get to mine: Keep doing what you love. But don't put so much of yourself in it. This was very avant garde. And while games have the potential to be art pieces, this feels almost like it tries too hard to be an art piece.   This kind of game is great for practice when it comes to developing games but it is more theraputic for the developer and not actually meant to be played. If you ever do another one of these, give it to close friends, family. Maybe post it on a smaller site like gamejolt or something. But I would avoid putting this kind of stuff on steam.  So if you are game dev I recommend this game, but only so you can see what works and what doesn't. Things like the ladder and the video are far too long the player will get bored easily. But the self-destructing room was a neat little puzzle. (although took me a few tries because the audio is a bit clippy and the audio is essential to figuring out what to do). So yeah, if you are developing games or thinking about it give it a try. But keep in mind this interactive art piece is nowhere near perfect.",
            "review_score": "1"
        },
        {
            "review_text": "Piece of art.",
            "review_score": "1"
        },
        {
            "review_text": "this game is trippy as ♥♥♥♥, like when you using acid or something",
            "review_score": "1"
        },
        {
            "review_text": "There isn't alot to say.   The gameplay itself was very intriguing, and finding this game was an experience. A lowly played game, but portraying the story and the emotions of someone. Like reading a book. I found the artist having a very honest personality, even if some may find it poor.   I enjoyed finding some of the little secrets that were hidden amongst the game that went to secret areas that otherwise cannot be found, even in level selection. One story in particular during this touched with me, and made me really feel.  I understand strong emotion may not portray a good game, but this is a good game, and if the subject may be too poor in some peoples' eyes, its still a game enough to display someone's actual personality and story well enough to even be viewed by others.   Thank you for sharing this experience.",
            "review_score": "1"
        },
        {
            "review_text": "turned into a vent real fast, couldn't finish",
            "review_score": "-1"
        },
        {
            "review_text": "more like art then a game!",
            "review_score": "1"
        },
        {
            "review_text": "Is this worth the money? It's free. So. Yeah.  Is it good? Eh, not really. It's rough as hell around the edges, and it just comes across as one of your standard student films that were made with a good dose of angst and world-weary melancholy. Some of the images are almost headache inducing, and while, some of the music is enjoyable, the overall feeling is.... lacklustre. The levels are slow to the point of irritation, the design is not particularly organic, and the dialogue is forced at best. Awkward was a suitable title, I'll give it that.   Plus, and this is an aside, so stop reading if you just want the gameplay aspects, I read some of the posts the dev made (in response to a negative criticism) and frankly they come across as a bit of an ♥♥♥, stating that 'You [the OP] simply have no patience and expect instant gratification from all video games, but I don't blame you; you were just trained to expect that with most video games.'   Now that strikes me as a bit arrogant, which is my polite English way of saying 'head up the ♥♥♥♥ arrogant', so all 'good job it's your first game' sentimentality fell through the bottom pit floor this game loves to feature. They follow up with 'Everyone is a critic.' Well yes, that's called opinion, and they're much like ♥♥♥♥♥♥♥♥s; everyone has one, we love our own, and don't often like hearing those of others. That steam actively encourages us to be 'critics' and review games should not be lost on the dev. Yes, this may be your catharsis project for all the 'stuff' you 'went through', but then maybe don't be so fragile about it. My dad was a photographer, and he always said exhibits were like nailing your ♥♥♥♥ to a wall for all to inspect and judge. If you're nailing YOUR ♥♥♥♥ to a wall, expect the judgment, favourable or not, and if you're not ready for that, might want to reconsider.",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty awful control menu... somehow ties into my joystick and I can't remove that... just spins (calibration thing, I guess)... so it's unplayable... unless you're supposed to be inside a tornado dream... then it's fine... and you'll vomit as intended.",
            "review_score": "-1"
        },
        {
            "review_text": "This has definitely found it's way into my top 10 games to play while high",
            "review_score": "1"
        },
        {
            "review_text": "This is amazing, great graphics, i got goosebumps so many times whilst playing it, with fear and confusion of how strange it it, truley an amazing creation",
            "review_score": "1"
        },
        {
            "review_text": "I have never played a game that made me feel happy, sad, and scared, all at the same time. However that has now changed. Awkward Dimensions Redux has done something that I have never experienced. 10/10 Would reccomend to anyone that enjoys true works of art.",
            "review_score": "1"
        },
        {
            "review_text": "a suprisingly emotionaly good game love it you should make more steven :D",
            "review_score": "1"
        },
        {
            "review_text": "It's a beautiful game, I can see how much pashion and time you put into this. I love it! Also, how long was I stoned?  11/10",
            "review_score": "1"
        },
        {
            "review_text": "A game about nothing",
            "review_score": "-1"
        },
        {
            "review_text": "Interesting, That's the first thing that came to mind when I started this game. I never got a chance to finish it. I plan on doing so So these are just my first impressions.  It's a good game. It's a game where you have to think about what each dream means. Some dreams are really edgy. If you get scared easily you might want to be warned that it might be a bit creepy for you.  That's really all. It seems a like a very good game and I plan on playing it more and you should too",
            "review_score": "1"
        },
        {
            "review_text": "This game gave me AIDs.",
            "review_score": "-1"
        },
        {
            "review_text": "play when lit",
            "review_score": "1"
        },
        {
            "review_text": "A wonderful surealist videogame. I'd rate it a 8/10 and in my opionion it will be famous for many years to come as a peice of art about life.",
            "review_score": "1"
        },
        {
            "review_text": "Really awesome, artistic game. Worth the time to play through it! Truly an immersive experience that stirs up emotions. Does a great job of comforting the disturbed (and I would think it disturbs the comfortable.) Does a better job of making you understand the developer than most TV shows do with their main characters. 10/10 highly reccomend.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing take with plenty of THC",
            "review_score": "1"
        },
        {
            "review_text": ":)",
            "review_score": "1"
        },
        {
            "review_text": "Got confused But it's free Still got confused... I still don't get the gameplay of this game. And now I want to sleep.. have a nice dream...  p.s: control is awful.. for both mouse and controller sensitivity",
            "review_score": "1"
        },
        {
            "review_text": "This is not really a game, but a series of visual experiences, based on the life and dreams of the developer. That's not to say it's bad though. It's certainly something unusual and mildly interesting.  One problem is there being no loading indicators when choosing a level or choosing 'skip this level' in the pause menu. You may click those multiple times and nothing happens, and then the level repeatedly loads multiple times. In technical terms, don't load the scene asynchonously and then just leave it there!",
            "review_score": "1"
        },
        {
            "review_text": "In shortest terms, this is the most obnoxious game I have ever played.  Here's a list of pros and cons in case you're looking for a review that goes into a ittle more depth.  -Pros   One or two of the levels had some cool gameplay mechanics    -Cons   Takes itself WAY too seriously   Soundtrack was probably good, but the audio quality was a 2/10 at best so I couldn't appreciate it at all   Pretty laggy despite it's simplistic design (this is probably more Unity's fault than anyone else's)   Unfunny 'Dank Meme' references   Tries to pass off as an 'aesthetic' game, when the design is 99% filters (I ♥♥♥♥ you not, one of the levels was built using only default dev textres and then had a 70's colored static filter applied to your screen)   No story whatsoever(what the game tries to convince you is a story is really just a bunch of teenage anxty ♥♥♥♥♥♥♥t)   Some of the levels were way too dark to see   Many imperfections in the level design(wheter intentional or not, intersecting models and textures still look bad; many great games have pulled off a surrealist look without doing this(ie.Antichamber))   The player movement speed is incredibly slow   The level where you have to hold left click to close your eyes was the worst experience I have ever had while playing a game(and I've played through the entire Black Ops 3 campaign on Realistic difficulty)   Unity   Extremely linear gameplay(on a scale from Telltale to David Cage, it probably ranks at about a solid 8)   Almost every single level was needlesly confusing   About a 5 second lag between the time when you enter a door to the next level and when you actually get to the next level    -Overall rating 2.6/10 This game has about as much depth as  This Video      'It's like if Anichamber was made by a photography major' ",
            "review_score": "-1"
        },
        {
            "review_text": "Interesting Interesting InterestingInterestingInterestingInterestingInterestingInterestingInterestingInterestingInterestingInterestingInterestingInterestingInterestingInterestingInterestingInterestingInterestingInterestingInterestingInterestingInterestingInterestingInterestingInterestingInterestingInterestingInterestingInterestingInterestingInterestingInterestingInterestingInterestingInterestingInterestingInterestingInterestingInterestingInterestingInterestingInterestingInteresting",
            "review_score": "1"
        },
        {
            "review_text": "They should pay people to play this game.",
            "review_score": "-1"
        },
        {
            "review_text": "It's weird, but the soundtack is the best and the game is about experiences. This is one experience that all you should try. It's worth it. I know I only have 8 minutes on this at the time of the review, but I am getting more and more time on it.",
            "review_score": "1"
        },
        {
            "review_text": "Badly optimized, pretentious, didn't look too nice in general. Paintings and actual art in the game were good, definitely keep doing that at least. Honestly the most infuriating part of this game has to be the last level, I enjoyed reading the steam reviews the most, and I got teleported away before I was done reading the reviews, and the game just ended, giving me no sense of closure. Try to make your future games a bit more compelling or fun, doesn't have to be both, but it should be at least one. ",
            "review_score": "-1"
        },
        {
            "review_text": "kinda hits the broken hearted and psychedelic part of one, me likey 8/10",
            "review_score": "1"
        },
        {
            "review_text": "It's Akward in a good way, it seems like the dev is just starting a hard trip on his life which is certainly becoming a game developer, dreaming big is not bad, and i kind of understand the situations projected, but you have a long road to go, don't give up, and give it all you got, it's not gonna be easy, but if you are determined and have the will to surpass most people, you might be working with some big brands, at best start a small company, love interests in my opinion are not necessary along the way, focus more on aquiring more and more knowledge, hone your skills, ♥♥♥♥♥es will come later trust me, in the meantime, good luck to you (main dev) and the ones who made this possible.",
            "review_score": "1"
        },
        {
            "review_text": "Since unity made their development tool so easy to use, games like this one are all over the internet. It's just not interesting anymore...",
            "review_score": "-1"
        },
        {
            "review_text": "the second level was creepy and you don't get to do much",
            "review_score": "-1"
        },
        {
            "review_text": "What the ♥♥♥♥ did I just experience",
            "review_score": "1"
        },
        {
            "review_text": "This is like the most teen angst pretentious ♥♥♥♥ I've ever interacted with.",
            "review_score": "-1"
        },
        {
            "review_text": "its free and has it own game-art style",
            "review_score": "1"
        },
        {
            "review_text": "Boring",
            "review_score": "-1"
        },
        {
            "review_text": "KONTOL g ada 1 jam tamat. game ga ada anta ♥♥♥♥.. ♥♥♥♥ ass, just 1hour less finnish this game. this awkward ♥♥♥♥ing game ever.. no destiny..",
            "review_score": "-1"
        },
        {
            "review_text": "If anyone is considering trying this game, I would advise you to instead boot up Minecraft and play that for an hour. You will hear better music. You will see better art/visuals. You will experiance better gameplay. You will be part of a better narrative.  This? This is art for art's sake, which is not art.",
            "review_score": "-1"
        },
        {
            "review_text": "This ''''''''''game'''''''''' only made me cringe. Not in a good way. The description is fairly accurate, but I'm not sure what I expected, because it was not something I enjoyed. Probably good for people who prefer artsy stuff to actual games.",
            "review_score": "-1"
        },
        {
            "review_text": "Not a game. Go be an 'le art xD' ♥♥♥♥♥♥♥ somewhere else.",
            "review_score": "-1"
        },
        {
            "review_text": "why the ♥♥♥♥ is it so dark, cant even play the game to make an actual review, put a flashlight feature coz i cant see ♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "I really enjoyed this game. It started out a bit weak but improved all the weay towards the end. Also for me it's a perfect length for that ype of experience with about 1h. Would be easily woth my money but it's even free.  P.S. Runs perfectly on SteamOS/Linux and the Steam Controller!",
            "review_score": "1"
        },
        {
            "review_text": "This game is very beautiful and relaxing. Very interesting scenarios and the music if fantastic!",
            "review_score": "1"
        },
        {
            "review_text": "Fun game that laves you with your jaw on the floor",
            "review_score": "1"
        },
        {
            "review_text": "Interesting game, but I do feel some levels were either too short and direct and others I had no idea what to do after 10 mins. Still an interesting game to play, especially since it's free.",
            "review_score": "1"
        },
        {
            "review_text": "I regret every moment I spent with this game.  Except for the exploding guard dogs. Those were hilarious.",
            "review_score": "-1"
        },
        {
            "review_text": "I, I, I have no way of describing what this was. The best possible way is, What the front door?......",
            "review_score": "1"
        },
        {
            "review_text": "Really nice free game. Its so deep with raw human emotions of what people go through.  ~deep ~depressing #life",
            "review_score": "1"
        },
        {
            "review_text": "Idk what I just played but..... play it.",
            "review_score": "1"
        },
        {
            "review_text": "it was a really beautiful game, but useing the controler is abit weard, but all in all it was really great very insprasonal",
            "review_score": "1"
        },
        {
            "review_text": "Mmm, not a game i expected but it was very interesting. I would recommend checking it out to get the experience in it and see the work put into it. The graphics and everything about it was amazing, not a game for people that prefer action, shooting or horror games but it's something that's for people that are opened minded and would enjoy seeing a game for what it is than enjoy what they see. I am glad i took time to play this out fully. It's just a beautiful game.",
            "review_score": "1"
        },
        {
            "review_text": "Good Game! I Had A Good Experience Playing This Game. I Hope They Will Make Another Game Like This",
            "review_score": "1"
        },
        {
            "review_text": "Really dope game. Its free to play and has good graphics.",
            "review_score": "1"
        },
        {
            "review_text": "I found myself replaying it to not only find all of the hidden doors but to also understand the game designer alittle bit more which i can relate to his anxieties.  All in all, Very beautiful and such an enjoyable game. Had me tearing up at times. Great music and a beautiful journey. I highly recommend trying it. Really struct a nerve.",
            "review_score": "1"
        },
        {
            "review_text": "This is honestly the one of the best experiances anyone has ever given me. Please do continue your work as I consider this a masterpiece from all things I have ever damn seen. Personally, anyone who is reading this review who is wanting an experiance that'll hurt you so much; do go through this.",
            "review_score": "1"
        },
        {
            "review_text": "This game is very good. But kinda wierd, you sorta get to know whats going on in the guys head. To play this game properly you need to come into it not knowing anything, and have the objective to understande the developer, rather than beat the game. Kind of similar to the Stanley Parable, and the Beginners Guide.",
            "review_score": "1"
        },
        {
            "review_text": "OMFG... i ♥♥♥♥in enjoy this game with a passion i am like loving it. it presents emotions to me. like i can actually feel happyness. its great i just love it. the dev did such a great job on this game i would reccommend alot of my friends to play it ",
            "review_score": "1"
        },
        {
            "review_text": "Shoutout Dong Lee the homie",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games I have ever played. I cannot reccomend it enough, the game outwits me everytime. Even though the answer is right in front of our face, human stupidity always blinds it out.",
            "review_score": "1"
        },
        {
            "review_text": "Being a teen, I went through a very rough patch of anxiety about where I'll be in the near future. Thankfully, I got out of that rut with help from afamily member. This game hits very _very_ close to home for me. I literally had to stop playing at one point and just think.   10/10 Relatable",
            "review_score": "1"
        },
        {
            "review_text": "more of an artificial trippout than a game. 8/10 for trippyness and parkour.",
            "review_score": "1"
        },
        {
            "review_text": "Very interesting game. Some of the puzzles were slightly confusing and I didn't know where to go but then again that's all part of the fun. Great work, would definitley reccomend friends to give this a go.",
            "review_score": "1"
        },
        {
            "review_text": "Its a experience, if you have to have constant action, this game is not for you. If you have patience, then play the game, its free and there is no reason not to. It took me around a hour to complete.",
            "review_score": "1"
        },
        {
            "review_text": "Inventive. A good showcase, with a lot of heart.",
            "review_score": "1"
        },
        {
            "review_text": "Fun and neat little experience for the hour or so of content it delivers. A bit thought provoking as well. Try playing through with the developer commentary as well for additional insight!",
            "review_score": "1"
        },
        {
            "review_text": "So first off, YES you should get this game. Ok, on to the actual review.   PROS: Great soundtrack, it fitted together so well with the game. Short but sweet. At some points it made me consider my choices in life. Very nice style of graphics, it really fitted with the mood of the game. There's a lot more to go over, but I'm lazy, plus I'm trying to keep this review fairly short.  CONS: Really hard to see at some points (Eg: Stealth-sim level) Sometimes very confusing, to the point were you end up quitting the game and coming back to the game later. That's it! I don't really have any other problems with the game.  Things to maybe add: A hint in the pause menu that will give you a point the right way, maybe. Do I recommend this to you? Yes, most definitely.",
            "review_score": "1"
        },
        {
            "review_text": "The game was very interesting and surprisingly well-made. I'm honestly excited to see where you go with your career. Good luck.",
            "review_score": "1"
        },
        {
            "review_text": "There are parts you are going to love. There are parts you are going to hate.  Another, bold - worth playing.",
            "review_score": "1"
        },
        {
            "review_text": "A really good game, you gotta read, listen, and pay attention to catch the clues as to what the story represents. The story represents what it seems like a kid, who designs games, and loves acting. Wouldn't want to spoil the rest of it, so play the game yourself! Really great game, atmospheric, and best of all, free. Only took about 30 minutes at most. It's a walking simulator, with minor puzzle elements. And no it's not a puzzle game. Just play it.",
            "review_score": "1"
        },
        {
            "review_text": "I admit, the game is somewhat buggy. But I am patient iwht games, and I am very impressed how you managed to implement all these really cool features into one game, and using UNITY? That's incredible! I really like levels like Frame, Two Steps Forward, Two Steps Back, the little area in 'Make it Quick', and I loved 'Self Destruct'. This game, besides the bugs, I believe deserves a lot of credit. Even more because you managed to make this and greenlight it while still in highschool.",
            "review_score": "1"
        },
        {
            "review_text": "I... I have no words. This is absolutely beautiful... I may or may not have cried a little :')",
            "review_score": "1"
        },
        {
            "review_text": "Played it. Ended it. =_= Feeling AwKwArD. =_=  If you play this game, somehow you'll want to continue playing it until the end.  Idk why, this is addictive &amp; unique game. :3  And it conveys a great msg to you. :) I'll higly recommend it to you guys!!! I'd rate it 10/10.  P.s it does have great OST acc. to given conditions.... so Yeah.",
            "review_score": "1"
        },
        {
            "review_text": "pretty good game",
            "review_score": "1"
        },
        {
            "review_text": "Such a beast game!",
            "review_score": "1"
        },
        {
            "review_text": "I dunno what there really is to say about this game. I mean... It's free, so you have no reaso.n not to give it a go. Not gonna spoil anything though. 153/10. Play it. NOW!~",
            "review_score": "1"
        },
        {
            "review_text": "In a lot of ways, I relate to this guy. You can be so wrapped up with the day to day expectations of life, or being nervous to tell someone you like how you feel. I have the same dreams that even if no one accepts my passion as an artist or who I am, that just makes me want to do better. Thank you for making this game, I see a big future ahead of you and you helped me see that I also need to work better to achieve my dreams. Keep it up 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This is an experiance, that can out lots of hearts to shame, at least one person has shown negativity, and its ment to show it, it may be 'deep', it may be 'depressing' but this will inspire you. If this is this creators dreams then its fine, there is no need to put negativity on him, nothing is shown through negativity,  Just remember that this experience it ment to show why hatred is here, and why schools tturn people down, if he failed exams, there is no point of making ♥♥♥♥♥ on him, he made this, and i love it, to show inspiration of whom people hate on people who put time and effort in games or experiences, and they shouldnt be here if they do it all the time.  Thank you for reading this fully.",
            "review_score": "1"
        },
        {
            "review_text": "amazing. the game speaks alot for me and i really feel it even though its weird",
            "review_score": "1"
        },
        {
            "review_text": "It's free. It's great.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome heartwarming addictin to play!!",
            "review_score": "1"
        },
        {
            "review_text": "Great game, didnt get it at first but once i realised what the story was about it was very entertaining",
            "review_score": "1"
        },
        {
            "review_text": "good is definitely experience each level represents thoughts the puzzles are not great, but some of them are fun the dialogue felt far too forced some levels were just plain confusing level transitions were okay music was great may sound like I dislike it, but I dont good 'story'? great music, really helped atmosphere levels, even if confusing, were very pretty overall, pretty good game, hopefully some updates come in and improve it. just play it, its like 45 minutes long",
            "review_score": "1"
        },
        {
            "review_text": "Very fun, short, and creative. Kinda creepy though.",
            "review_score": "1"
        },
        {
            "review_text": "gr8 b8 m8 i r8 8/8 no h8 appreci8   :^)ididntcryimastonecoldmemerdontknowwhaturtalkinboutmet:^)",
            "review_score": "1"
        },
        {
            "review_text": "weird but it makes you think about things",
            "review_score": "1"
        },
        {
            "review_text": "Strange game. Don't know what it meant or what it leaves me with. Something I guess. Go ahead and play it.",
            "review_score": "1"
        },
        {
            "review_text": "Very weird funny sometimes very trippy and weird when you're baked. lol.",
            "review_score": "1"
        },
        {
            "review_text": "Unplayable. Waste of internet. Boring. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "'get over her' is way too relatable  also dank memes ",
            "review_score": "1"
        },
        {
            "review_text": "I think that awkward platforming and a few odd mechanics bogged this experience down quite a bit. There were also a couple of scenes that felt like meaningless filler to me. Ultimately, I did use the handy skip level feature twice.  But when the experience was on point, it was very touching to me. Clearly the creator put a lot of himself inside of this. It's deeply personal, and I felt sympathy and sadness. (And sympathetic embarrassment...) As an old jaded gamer, actually feeling something is always a big plus.  I thought the mechanic in one level in particular (Frame) would be pretty cool for a real game, too.  It's free and you can skip anything that really annoys you, so if you're curious about the strangeness in someone else's dreams, it's worth a download. :P",
            "review_score": "1"
        },
        {
            "review_text": "Simply put, this game is genius, beautiful, deep. It's art at its finest and a haunting piece of which. It is rather simple at times, but hey, less is more, right? It is short, but that only makes me appreciate it more. There's 18 levels, and each is a representation of the developer's dreams, fears, memories and anxieties and you need to get through each dream via a door somewhere located in the dream. Each dream differs from the others and the feel for each dream is different as well. Some will have a happier vibe to them like relax at North Berwick, whilst there are darker dreams like two steps and get over her. Overall a great free game that is beautiful and thought provoking. In my opinion this doesn't deserve to be free, it doesn't do the game justice.",
            "review_score": "1"
        },
        {
            "review_text": "This game is so damn good. Yes, the graphics aren't very good, and the mechanics feel weird. But I'm assuming this is only of your first time creating a game. This was very good, the atmosphere was great, the meaning behind it was good and all of the levels were well put together.",
            "review_score": "1"
        },
        {
            "review_text": "amazing. the game speaks alot for me and i really feel it even though its weird",
            "review_score": "1"
        },
        {
            "review_text": "The game made me feel so alone, but I realized it also made me feel like we are one of the same as well.  10/10 Feels trip if you are a normal human.",
            "review_score": "1"
        },
        {
            "review_text": "Very weird game. At the beginning I wanted to write very critical review - about bad level creation, empty maps, repeating textures or very obvious level borders which makes the player feel like he is more in the cardboard game rather than true world. It was obvious to me that the developer is a freshman, just a guy who made few levels and wants to publish them on Steam. I understand it, because I want to do exactly the same.  But then something changed - I found the level with video of a boy (maybe it's the developer? I don't know) tearing apart furiously a bunch of papers. Around me were very critical one-sentenced reviews like 'waste of internet space', 'unoriginal content' etc. This game have a soul and this reason is enough to give it a try.  It's like collection of stories of unknown author. Some are good, some are terrible and put into just to fill the space. I have the feeling that author was inspired by 'The Beginners Guide' and history of Coda and wanted go into his steps - which I respect. In the criticion level we can hear a distorted music from this game. Some levels are quite interesting to explore. Some of them are terrible (but you can skip them from the menu). I hope that in the future an author will make a remake.  Anyway, very interesting experience, especially as free indie game on Steam.",
            "review_score": "1"
        },
        {
            "review_text": "Not from this planet",
            "review_score": "1"
        },
        {
            "review_text": "great game",
            "review_score": "1"
        },
        {
            "review_text": "This is such a beautiful game. So many different emotions displayed by the environments and accompanying music. For the most part, this game is very calming, but there are also more exciting aspects as well.   I also liked it because the 'Get Over Her' level hits pretty close to home.",
            "review_score": "1"
        },
        {
            "review_text": "I Wasted 0.8 hours trying to work out what the point of the game was. lets just say I didn't achieve my goal.",
            "review_score": "-1"
        },
        {
            "review_text": "I loved this game, but someone PLEASE tell me what song was used for the 'get over her' level or where I can find it!",
            "review_score": "1"
        },
        {
            "review_text": "I didn't think that this could be really scary...  Well, I was wrong.   Great game, the soundtrack is awesome! The gallery phase is the one I liked the most.  The extremely light made me sick, tho lol",
            "review_score": "1"
        },
        {
            "review_text": "This game is really cool and random. I suggest that you play this game.",
            "review_score": "1"
        },
        {
            "review_text": "Awkward Dimensions Redux is an interpretive story-driven 'walking simulator' game. You progress through various levels, which are the developers dreams, and each level tells a unique and different story.  Pros: -Visuals are extremely appealing, aesthetic of entire 'dreams that tell a story' is tied together with surreal, out of this world visual displays -Soundtrack adds atmosphere and contributes towards the story well. -Story itself is well written and well paced, although it would appeal to a niche market though, as many would not understand or interpret the story correctly  Cons: -Controls are extremely clunky and sensitive, with no way to adjust it. -Some of the levels feel a bit 'unworked', and left me startled as to what the purpose of it was for quite some time.  Overall, this is a good, atmospheric cinematic display of a developers passion. Give it a look if you have time to spare. 7/10 ",
            "review_score": "1"
        },
        {
            "review_text": "Such an interesting experience I've had with this game. Every level is somewhat unique and memorable.",
            "review_score": "1"
        },
        {
            "review_text": "I was shocked when i was playing this game.",
            "review_score": "1"
        },
        {
            "review_text": "well... its not a game, its an art project. and its free, so get it and try? why would you even read this...",
            "review_score": "1"
        },
        {
            "review_text": "what is this game i love it",
            "review_score": "1"
        },
        {
            "review_text": "I love the concept, but I hate the implementation. I've only played it for a few minutes so far, but that's because it is a bit buggy on my machine (flickering which may be my systems fault).  First, the good: I love games that simulate people's dreams. The breif stories/scenarios are just enough to feel some sort of achievement, but you aren't getting sucking into anything you don't want to. It doesn't seem overdone so far, and there seems to be some basic rules that offer just the right amount of consistancy.  What needs work: At the begining of the game the options are pretty vague. I actually closed the game on my first try and had to go through the unskippable credits again because I thought 'wake up' would start the game. The controls aren't the best. They can be laggy at times and they seem a bit too sensitive, especially with the jump height. The pause menu seems broken as well since it loops different audios depending on the mouse position and it doesn't seem it can close the game from there when I click that option (had to run the kill command). There are also a few lame scenes as well, such as the camera shaking around the alarm clock.   I'm having a hard time saying if I'd recommend it or not. I'll say no for now, as I really think some improvements need to be made, but I am saying that this game and future games have potential.",
            "review_score": "-1"
        },
        {
            "review_text": "A Really strange, fun and unique experience. quite short but varies in story deom love to horror to action to adventure, an amazing game. would definitly play this game again as the music and gameworlds are so refreshing and vibrant. the closest thing i could relate this game to is beginners guide as the music is amazing much like beginners guide 10/10 would play again",
            "review_score": "1"
        },
        {
            "review_text": "not bad. But I think you should reduce the words for this kind of style because graphical illustration is always more impressive.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most weird and truly satisfaying experience in games/art.  I take my time to read the book titles, THAT really got me. Really nice game, not a triple A game but definitly worthty of your time.",
            "review_score": "1"
        },
        {
            "review_text": "This is a game that explored the places of my mind, filling it with amazing visuals and stunning soundtrack. At first i thought it was a horroe game but as i played through the first level i got hooked.  Overall, this is a game that related to how my dreams/minds has gone through. Each level beautifully hitting my eyes as i enjoyed the stimulating atmosphere. There really isnt any objective to this game, simply you just do what your mind tells you to do as you explore level after level. I've listened to the soundtrack and its something you would listen to on the daily. This is an extraordianry game with great visuals, music, and a stimulating experience. 10/10 Looking foward to any future projects!",
            "review_score": "1"
        },
        {
            "review_text": "Honestly this is one of the best games I have played. The developer poured his heart and soul into this game and it's messages. This is a very good game and would recommend it to everyone.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "I have to agree with a prior review; this is not a game, it is an experience. I absolutely loved this and it is clear to see that a lot of work and effort has been put into it. It is fun at times, chilling at times, plain weird at times and made me feel uncomfortable at times but it was a great experience to play this.",
            "review_score": "1"
        },
        {
            "review_text": "I never write reviews on here. Not once. Not ever. And I'm sure as hell not about to start now.",
            "review_score": "1"
        },
        {
            "review_text": "A game of such beauty, introducing so many other emotions upon it.  I have never played a game like this one before. Challenging at times, and the atmosphere changing each level. It's own story entwined. There's not much I can say about this game - maybe it's like taking a nice walk on the beach. The colours, textures, and the way this game was really made - are all so beautiful. It takes your mind off things in the real world, and you focus on this world. I love it.",
            "review_score": "1"
        },
        {
            "review_text": "Love it man keep up the good work n",
            "review_score": "1"
        },
        {
            "review_text": "When i first joined the game, I was expecting something a little bit weird...and I was overhelmed by what I actually got off that game. It's absolutely stunning and ♥♥♥♥ed but. I absolutely love it to peaces and beg the devs to bring out another game of that kind, or extend the current one. Amazing game, great fun and most definitly worth the download! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "... um... erm... well the gameplay was fantastic and it was amazing how one developer made this. The STORYLINE I'm kinda brain-f**ked right now but I played through the whole thing and saw every level. I definetly recommend this for those of which can see the true art in a game. deep...",
            "review_score": "1"
        },
        {
            "review_text": "It's definitly a great game, but just not for me. If you like games that give you a weird/creepy feeling then I recommend this game 100%.  Thumbs up for the game developer.",
            "review_score": "1"
        },
        {
            "review_text": "&gt;good music &gt;beautiful structure &gt;good sense  too personal maybe, can't get it at all.",
            "review_score": "1"
        },
        {
            "review_text": "The game was simple yet with deep thought. (7/10)",
            "review_score": "1"
        },
        {
            "review_text": "This game was honestly the most amazing thing I have played but some of the level scarred the ♥♥♥♥ out of me like the second one and the one about the heist where I got close and the dog started twisting and deforming and barked at me and i ended up skipping the level instantly after that dog while others were super relaxing like the beach while some i had no idea what to do like the one level that was called noise. But other then that it was a trippy and relaxing experience",
            "review_score": "1"
        },
        {
            "review_text": "I really don't understand",
            "review_score": "1"
        },
        {
            "review_text": "Possibly the most emotional and thought provoking game I've ever played.",
            "review_score": "1"
        },
        {
            "review_text": "As far as indie games go this one is pretty good.",
            "review_score": "1"
        },
        {
            "review_text": "first time playe the chicken scared me",
            "review_score": "1"
        },
        {
            "review_text": "I tried to like it, but mehhhh it just doesn't get there  It is a great idea, I really digged into the surrealistic concept and the 'nagivating through dreams' gameplay. However, there is no connection between the dreams or a clear objective or reason to do it. Controls are painful, movement feels very sticky and you will certainly spend a good ammount of time pressing W to get anywhere.  I would only recommend this game to teenagers who are looking for indie stuff to feel so cool and better than the rest. (aka hipsters)  For a similar experience I do recommend The Stanley Parable",
            "review_score": "-1"
        },
        {
            "review_text": "This independent developed game brings up the link between art and gaming. Each level has a story behind that can be interpreted in many different ways.  Not recommended if you're just looking for action.",
            "review_score": "1"
        },
        {
            "review_text": "good game but i was really fonfused nice music tho",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good for a free game. Overall well made. Instructions for each level could help though ",
            "review_score": "1"
        }
    ]
}