{
    "app_id": 529770,
    "name": "Ley Lines",
    "release_date": "2016-12-05",
    "developer": [
        "Miria Studios"
    ],
    "publisher": [
        "Miria Studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Free to Play",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Free to Play",
        "Action"
    ],
    "achievements": 0,
    "positive_ratings": 99,
    "negative_ratings": 24,
    "price": 0.0,
    "description": "You are the last hope of a ruined world, capable of restoring the severed Ley Lines. Throughout the ruined temple of Miria's Heart, attune to and master five unique powers, allowing you to alter gravity, slow time, shift space, and much more.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/529770/header.jpg?t=1481554847",
    "minimum_requirements": "OS: Windows 10, Windows 8, Windows 7 Graphics: NVIDIA GeForce GTX 750 Ti Storage: 2.4 GB available space",
    "recommended_requirements": "OS: Windows 10 Graphics: NVIDIA GeForce GTX 970 Storage: 2.4 GB available space Additional Notes: Best functionality on 1920x1080 Resolution",
    "reviews": [
        {
            "review_text": "A solid foundation for a future puzzle game. Overall was pretty good and I enjoyed playing it. Interesting puzzle mechanics.  And it's short, if you're like me who can't play a game for hours on end :D",
            "review_score": "1"
        },
        {
            "review_text": "This is pretty good for a student project. The gameplay is great and that is the most important part. Unfortunately, the graphics are simple, colorful and have sharp edges; they are just bad enough that they sometimes interfere with gameplay by disorienting or confusing me otherwise. Doesn't cost anything to try the game out, though, so why not?",
            "review_score": "1"
        },
        {
            "review_text": "Story based physics puzzle, is only an hour long, less if you're clever. Loved the graphics style and the story. Its a nice hour long exerience, though I would prefer the story/game to be longer and the puzzles a touch more involved.",
            "review_score": "1"
        }
    ]
}