{
    "app_id": 530390,
    "name": "Slayaway Camp",
    "release_date": "2016-10-25",
    "developer": [
        "Blue Wizard Digital"
    ],
    "publisher": [
        "Blue Wizard Digital"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Casual",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Puzzle",
        "Gore",
        "Indie"
    ],
    "achievements": 50,
    "positive_ratings": 573,
    "negative_ratings": 25,
    "price": 6.19,
    "description": "A killer puzzle game where you control Skullface, a psycho slasher bent on slaughtering camp counselors at the title campground. Slide an adorable voxel murderer around hundreds of isometric puzzle levels to squash, flay, and decapitate hapless victims in this darkly comic homage to 80s horror.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/530390/header.jpg?t=1550258066",
    "minimum_requirements": "OS: Windows 7 Processor: Core i (i3, i5, i7) Level CPU Memory: 2 GB RAM Graphics: Integrated Graphics DirectX: Version 9.0c Storage: 300 MB available space Sound Card: Any on-board sound should work.",
    "recommended_requirements": "OS: Windows 7 Processor: Dual-Core Intel or AMD CPU supporting 64 bit @ 2Ghz+ Memory: 4 GB RAM Graphics: Discrete GPU with 1GB VRAM DirectX: Version 10 Storage: 300 MB available space Sound Card: Something that uses vacuum tubes.",
    "reviews": [
        {
            "review_text": " Happy Halloween Everyone!    After finding out that this title is developed by the founder of  Popcap , among other brilliant indie game developers, there is no wonder why  Slayaway Camp  is incredibly addicting, witty, and very polished.  We've been having such a blast with this game. If you are into campy horror flicks and indie puzzle games, this is a no-brainer. The price-point is wayyy too cheap for a puzzle game that has 15-20 hours of content (...And they just added a few more things yesterday).    Essentially, you really only need one joystick for this game - you play the killer, and need to slide your way around the map to get everyone.  The layers of complexity are unleashed upon you as you progress. You begin using pieces of the level to solve puzzles; things such as using telephones, landmines, and cats. Yes, cats. The different 'enemies' have different behavior and mechanics. The police are optional to kill, but must not be slid into from the front, for example.  Honestly, there really isn't much negative to say about this title. While there is a quick restart button, I requested it be quicker, and they put it on the to-do list. The music and voice acting are top-notch. I mean they freakin' got the actor who played  Jason  to do some voice-acting for gawds sakes. All the campy horror films are present. You earn money throughout the game to buy new kill animations and unlock new playable killers. It's all so awesome.   Pros:  +Awesome fresh idea that brings a novel game mechanic and is really addicting +Learning curve is not bad at all; this is not  Stephen's Sausage Roll  +While you can pick it up for only five minutes, we find ourselves playing for longer play sessions, surprisingly +All the campy horror films and killers are here +Very polished +Too cheap for 15-20 hours of quality content +Controller support is great   Cons:  -Honestly, none that I can think of; I wanted a quicker 'quick-restart' and they added it to the to-do list -Game is probably too violent for younger children   Awesome title that I'm glad I grabbed. I even picked up the extra in-game content.  If this looks even remotely intriguing to you, go for it.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games for horror movie fans ever! Slayaway Camp (yes the name could not fit more) is simple but challenging. The art style is gorgeous and the gameplay is absolutely addictive. The idea of making horror movies in the game itself is awesome and I can't think of anybody who would not like Slayaway Camp.  The game is amazing, the devs are nice. Let us teenagers slice! :D  99/10 &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Alot of fun for the price! Some tricky puzzles too. Can't wait to see some of the later levels. Def a must for horror fans.",
            "review_score": "1"
        },
        {
            "review_text": "I had a chance to play this game on  Kongregate.com  and really enjoyed it. I am glad to see it come to Steam. The game is a great puzzle game combined with a very fun art style and design.",
            "review_score": "1"
        },
        {
            "review_text": "  As someone who grew up in the '80s watching Jason Voorhees slay teenagers, I'm very much the target audience of this game. And it captures the essence of the genre quite beautifully, from the VHS effects, to the music, to the context and those oh-so-glorious killshots. The mechanics are simple enough, Skullface can only move in one of four directions, and he'll move until it runs into something that blocks him, something that kills him, or someone to kill. His inhability to stop is where the challenge comes from. Find the combination of moves that will allow you to kill all the teenagers and then leave without getting killed and before the cops show up can be quite the challenge. Considering his propensity to walk straight into a lake and drown, or into a fire and get burned alive, it's a miracle Skullface managed to last so many movies!   Every segment is just a few minutes long, so bite-sized play sessions are quite possible, always a plus for busy people. The game's learning curve is quite smooth. The first few movies are like satisfying walks in the park. Or slaughters in the park, if you prefer. As you reach the end of the third movie (where I'm stuck), difficulty starts to rank up. Fortunately, the game has a fast-forward feature if you ever find yourself stuck. This'll help you keep things fun until the end.  My main gripe with the game, and it's a rather small one, is that although controller support is there and complete, it's very hard to know which menu item is selected vs. those that are not. So you can start on the option you want, but you'll still to move the controller around to figure out which option is actually selected.   Disclaimer: I received a key to this game from IndieGamerChick's IGCHalloweenParty and GamesMatter. I have no relationship with the creators of this game.",
            "review_score": "1"
        },
        {
            "review_text": "Really great puzzle game, especially given the price point. A few are a bit challenging, but doable. Perfect for a quick game you can hop on and play for a quick 10 minute session. Old slasher flick homage was amusing.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, carefully designed, really addictive, lots of fun references and excellent support from developers.  Totally recommended. ",
            "review_score": "1"
        },
        {
            "review_text": "Really fun puzzler. I'm generally not much of a puzzle game player, but this one has quick levels that keeps the action moving. Very stylish too, all the quick camera cuts between scenes, kills add to the atmosphere. Plenty of blood and gore, tho the voxel-y style keeps things from getting overly gruesome. If you play one voxel based 80's horror game this year, best make it this one -- !",
            "review_score": "1"
        },
        {
            "review_text": "Jim Sterling made me buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "I know my opinion doesn't mean much, but Slayaway Camp is the shiznit, and you should be playing it right now.  If you love cheesy horror movies or puzzle games or any mash of those two up until this point unrelated things, you buy this game that brings them together finally NO I WILL NOT RESEARCH THAT CLAIM JUST ACCEPT IT. Buy now.   Having put some hours in, I feel like I should add some details, but my initial enthusiasm remains and I stand by my initial kneejerk review.   The references are on point. If you're a fan of the horror genre, this game will delight with nods to all the classics and a fair amount of films that don't get much attention.   The game is constantly adding new twists to the formula. I'm on the sixth or seventh movie and it's still throwing new elements into the gameplay. Pacing is just right so it doesn't overwhelm you with gimmicks.  The music is great. Nails 80's horror films to a T.  I wholeheartedly reccomend it.",
            "review_score": "1"
        },
        {
            "review_text": "Highly recommended for fans of horror games. Charming, fun, challenging, and full of references to iconic horror characters.",
            "review_score": "1"
        },
        {
            "review_text": "The Mortal Kombat of Puzzle Games.  Enough said.   10/10.",
            "review_score": "1"
        },
        {
            "review_text": "All the villain wants to do is kill pesky pathetic teenagers. So why don't u join along and help him? After all he is helping out on our generation So grab you mouse Get ready to drag Because Skull face is ready to be mad And he mostly wants a hug Just Make sure he doesn't grab that machete of his Otherwise you may have a problem Chop chop chop Get this game with you good ol' dosh",
            "review_score": "1"
        },
        {
            "review_text": "  Mechanically, this /could/ have been a forgettable puzzle game. Guide your character by go-in-a-direction-until-stopped to meet your objectives then the exit. Maybe 'move' some objects. Keep the *** cats alive. Nobody escapes.  But the presentation is sooo awesome it's really more than the sum of its parts. I love horror flicks, I love the 80s, and I love 80s horror flicks so this is riiiight up my alley! Such flair, screenshots don't do it justice as there's little touches everywhere to create an awesome ambiance while you work on the puzzling. I'm nearing the end of it and have resisted the use of the included hint system so far, I'm having too much fun working on it. Most of the puzzles are not of the hardest variety but there's some nice brain burner sprinkled in for sure.  Nominated in the 'Villain most in need of a hug' award category for 2016 ^_^ Big fan.  Sometimes ppl wish for a 'meh' or 'neutral' option for recommendation. I would wish for a 'F*CK YEAH' in this case :P",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, it reminds me not just the good old slashers of the 80's that i love but an old game on the Turbo Grafx 16 system called Tricky Kick, I loved that game and it was a hard puzzler. You get the same kinda feel here but with a great horror film vibe, the graphics are fitting for it's type and the ambient music is really cool.  I would suggest getting this for a great time away from online soul sucking gaming.",
            "review_score": "1"
        },
        {
            "review_text": "So charming, so full of movie references, so bloody. If you are a fan of puzzles and horror movies, this is a no-brainer.",
            "review_score": "1"
        },
        {
            "review_text": "A challenging puzzler with a wicked sense of humor and gratuitous voxel violence. The game screen can get a little busy and, as a result, all those chunky voxels can become a bit visually overwhelming in some of the levels where there are several different puzzle elements in play at once. Thankfully the game does let you zoom out from the default isometric view to an overhead camera that's much better for surveying the playfield and planning out your moves. Just don't forget to zoom back in to see all of the glorious violence!  And that's pretty much all I have to say about the game that could possibly be construed as negative. Slayaway is one of those rare games with such a tight focus on familiar premise and simple design that it's difficult to find fault with if you enjoy the genre. Some of the puzzles will give your noodle a proper thrashing, and the plethora of unlockables will keep slasher flick fans coming back for more. There's an impressive amount of content on offer here, especially considering the price.  I should note that the game is clearly designed with mobile platforms in mind, but this PC version is very well thought out to the point that you're not likely to even notice. The SE is reasonably priced and comes with some really cool extras including a few papercraft templates for Slayaway characters that I have every intention of putting together and displaying alongside my other game memorabilia.  Until Traveller's Tales decides it would be a great idea to make an M-rated Lego Friday the 13th game (which will sadly never happen), Slayaway Camp is about the best you could hope for. Murder has never been so hilariously adorable.",
            "review_score": "1"
        },
        {
            "review_text": "Cute yet disturbingly brutal dark comedy/horror puzzle game. Hours of simple joy guiding your murderers to fulfil their grim destiny!",
            "review_score": "1"
        },
        {
            "review_text": "Casual, gore, puzzle....A lot of differing concepts that were blended quite nicely together. There's multiple chapter settings, a neat movie theme, tons of gameplay tilesets, and a sizable content shop(note: based on in game currency) The shop has various gore animations and even killer cosmetics.  This is a very good product for the price.  Recommended? - Yes.",
            "review_score": "1"
        },
        {
            "review_text": "surprisingly good and gets quite challenging.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, Simple in it's design but gets quite complex. Plus murder happy fun times. A Good game to play quick between stuff. A palate cleanser if you will.",
            "review_score": "1"
        }
    ]
}