{
    "app_id": 530890,
    "name": "Haydee",
    "release_date": "2016-09-26",
    "developer": [
        "Haydee Interactive"
    ],
    "publisher": [
        "Haydee Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Workshop",
        "Steam Cloud",
        "Includes level editor"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Sexual Content",
        "Nudity",
        "Mature"
    ],
    "achievements": 23,
    "positive_ratings": 2932,
    "negative_ratings": 519,
    "price": 10.99,
    "description": "&quot;Haydee&quot; is a hardcore old-style metroidvania mixed with modern-day third person shooter and platformer mechanics. As well as a sexy character.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/530890/header.jpg?t=1552306158",
    "minimum_requirements": "OS: 64 bit  Windows Vista/7/8/10 Processor: Dual-core 2.3 GHz Memory: 2 GB RAM Graphics: Geforce gts 450 or Radeon HD 6770 Storage: 1 GB available space",
    "recommended_requirements": "OS: 64 bit  Windows Vista/7/8/10 Processor: Quad-core 2.2 GHz Memory: 4 GB RAM Graphics: Geforce gtx960 or Radeon RX 480 Storage: 1 GB available space",
    "reviews": [
        {
            "review_text": "A large portion of what is supposed to make this game 'difficult and challenging' is bad game design and ♥♥♥♥♥♥ choices by the Devs. Let me break down all of the 'Key Features' of this game:  * Six gameplay sections. 160 rooms. -- There are 160 rooms roughly the size of your living room (and occasionally probably about twice the size). And there are 6 different colours that can be used as highlights.  * No regeneration. Use medkits. -- This doesn't really matter because I always had a medkit on me, and the only things you ever really take damage from is falling off of small ledges twice as high as a curb on the side of the road.  * No checkpoints. -- These save points are so few and far between it's harder than Dark Souls. Oh, you fell off the map because of the ♥♥♥♥♥♥ controls? You get the last ten minutes of your game reset. As if no regeneration and ♥♥♥♥♥♥♥t controls weren't enough.  * Limited Inventory. -- I never filled over half of my inventory, maybe I didn't get far enough though.  * Challenging gameplay. You will fail. A lot. -- Because the controls are so bloody horrible you can hardly control your character. This is a platformer. Movement is the ONLY thing they needed to get right, and they failed.  * No handholding. Act on your own. -- A.K.A. we didn't make a tutorial or any kind of screen to view keybinds, you have to press every key on your keyboard in every situation to test them. Jumping is hit and miss, she might grab the wall, she might fall. How are you supposed to find out that you have to double-tap control while facing away from an edge to drop down without googling it?  * This game won't tire to kill you. -- This game will reset your progress every ten minutes because of an enemy that appeared behind you or attacked you from around a corner giving you no time to react to take it strategically (like this game claims to be); again resetting all of your progress for the past ten minutes.  The limited save mechanic is useless considering you never run out of 'Diskettes', it's just a matter of how kind the devs are in where they put them, which is maybe once every 15 rooms. Where you'll probably die at least once every 3 rooms be it by your own stupidity or the game thrusting you into a situation that will kill you if you try to take it strategically. In a game with no ammo, it rewards you for using all of it. The majourity of the 'difficulty' of the game comes from attemping to cross gaps and having Haydee decide she doesn't want to grab the wall; which in turn will earn you the acheivement 'Moron' on it's own. Speaking of dying, you take fall damage from a 3ft drop, apparently robots have made a body 3x as unrealistically bouncy as a person but can't put that bounce anywhere near the legs to absorb a little bit of fall damage. The animation is also rediculous because you basically sit down for a second and pop back up; and this stops all movement for the entire 2 second animation which makes it frustrating to climb down stairs. I can go between slow and fast paced games, but this is the kind of slow when you see someone 90+ years old on the road and they're going a quarter of the speed of everyone else. This is only worsended by the fact that you'll be going this speed constantly, traveling back and fourth between rooms.  Let me list the controls for you: WASD - Movement Space - Jump Space - Grab onto the wall Space - Pull yourself up on the wall Space - Hoist onto the next platform Shift + Space - Give a vague attempt at crossing a gap Ctrl - Crouch 2xCtrl Facing away from a ledge - Climb down Right click - Aim Left click - Make you gun click because you don't have any ammo E - Use (doors, inventories, etc)  As far as I've gotten, there are 2 enemies; a bruiser and a skinny guy with two swords for hands that will never be out of range. Now, as I've said, these appear behind you or attack you from around a corners giving you zero time to react or take it strategically, which you would think the devs would realize as a ♥♥♥♥♥♥ design choice in a game that (apparently) advocates low-ammo strategy for avoiding them.  Now, I generally don't say this, but this game's only selling point is the character (more specifically; the ability to mod the character.) There is no other reason to buy this game. The character is so hypersexualized they were trying to make up for the lack of actual game they had. Don't get me wrong, I love playing lewd/sexy/nude characters in games and generally mod games like skyrim for this because it's fun. But that only works when you have the gameplay to back it up. This game does not. If you want to run around a Portal 2 facility in third person staring at the ♥♥♥ of a naked girl, then buy the game. You will not get any other kind of enjoyment out of this.  As a final note; please read more reviews. The majourity of them are complementing the character. Most of them say absolutely nothing about how horrible the gameplay is.  Examples: 'Really hard to play with one hand.' 'When you start dying a lot, looking at her ♥♥♥ while climbing soothes the rage.' 'As a sexually repressed male, this game made me feel like life is worth living again.' '11/10 jiggle physics tho' 'I saw a robot / android girl with a massive chest and huge ♥♥♥ and said to myself, 'Yes, I want to play as that.''  Do yourself a favour, save the money. If you really want to try it put yourself on a timer and don't go over 2 hours because you'll want to refund your money.",
            "review_score": "-1"
        },
        {
            "review_text": "a large portion of what is supposed to make this game'difficult and challenging' is just play bad game design and ♥♥♥♥♥♥ choices made to ♥♥♥♥ off the player. the limited save mechanic doesnt really serve a purpose as I always had a surplus of them and multiple save files of the same game can render them useless. the 'difficulty' as well as most of the damage you recive in game comes mostly in the form of platforming, seeing as how the game has bottomless pits I seriously wonder what made the devs decide that fall damage was necessary, implementing said fall damage is terrible as the main character cant fall 3ft without losing over 2/3ds her health, there is only 2 enemies I have found spanning the 4 areas Ive seen which are the fast one and the big one, the horrible thing about them is they are ether always placed around corners so you cant react to them or they spawn behind you, seeing as the game is trying to do the onld RE low ammo and advocates avoiding enemies you think they wouldnt put 3 enemies in every room and you would be wrong. honestly this game feels like it ether should have made is a puzzle platformer or a 3rd person shooter. the combination of the two does not work well as the crappy controls and obtuse puzzles just confuse and annoy the player.",
            "review_score": "-1"
        },
        {
            "review_text": "came in for the THICC, stayed for the complex puzzles and surprise rapebots.  its a real gem in the rough, this one, the puzzles are well planned out and the gameplay is just what it needs to be, no ♥♥♥♥♥♥♥t, no overcomplicated story, no cutscenes, just you and the game.  If i have one negative thing to say about this game is that the effects need a little work around. landmines and bullets barely look like they explode or hurt, and all the fences and vents just disappear in thin air when you open them.   i don't generally 'buy' games, if you know what i mean. But this one i considered deserving because of what it is, what it does, and where it comes from. if this game had been published or made by, for example, electronic farts, i wouldn't have doubted for a minute on just getting it somewhere else. the dev has potential and i want that potential to flourish into more good games in the future.",
            "review_score": "1"
        },
        {
            "review_text": "Short Review: Hater are gonna hate, but this is a damn great game! At first, you think that Haydee is gonna be a DOA-style, milk jugs simulator; but you are incredibly wrong. Players have 2 Rooms to enjoy Haydee’s exaggerated sex appeal before the game shows its true colors. To put it simply: This game wants to stomp your head into the ground. Haydee is the modern Metroidvania that we’ve needed for a long time.  Extended Review: This game is gonna stomp your head in. It isn’t here to make friends, to be a power trip, or even to focus on Haydee’s sex appeal. Haydee is a modern Metroidvania game that is ruthless. The is no handholding, no checkpoints, no tutorials, nor regenerative health. It is you versus the mad men who designed this game.  **QUICK TIPS** 1 – You can hang from ledges with the crouch button. 2 – Saving your Progress costs an In-game Floppy Disk, you cannot save infinitely. 3 – If you think you have cleared a Room, you probably missed something. 4 – Get use to Haydee’s “Cat Walk”. Running can lead you into more trouble than you can afford.  Pro) 0 – The Mod Community for Haydee is really out doing themselves. This Teenager’s Wet Dream is getting the proper care she needs. By-the-by, a Zero Suit Samus mod for Haydee should happen; just throwing an idea out there for modders.  1 – Everything in Haydee feels like it was earned. Unlike previous, modern-Metroidvania games, Haydee doesn’t “give” you anything. It makes you work for it. If you want victory, you’ve gotta pull it out of the jaws of defeat.  2 – The gameplay makes sense. Haydee has some unique game designs, but ultimately, the game has a locked set of rules that it plays by, the controls scream Resident Evil Revelations so they are familiar, and the experience does not feel cheap.   3 – The difficulty is ruthless, but fair (for the most part). Similar to the Souls Series, the game does a great job teaching you how tough it is, seemingly, through gameplay. By the time you start getting jumped by more than 3 Robots, the game would have already taught you to anticipate every shadow as a potential enemy.  4 – Haydee is terrifying. I thought this game was just gonna be a “Zelda with Guns and Boobies” puzzle solver, but Haydee is more like Resident Evil Revelations meets Portal. You’re not scared because of hideous monsters, but rather the fact that ALL of your unsaved progress rests on your shoulders. There is so much to lose in Haydee, hours’ worth of work can be gone by not remaining alert.  Cons) 1 – Aiming is off. Sometimes it is pinpoint accurate, but I do believe that there is a margin of error in the reticle and aiming mechanics itself.  2 – The game can be a jackass at times. Occasionally, Haydee will blindside you by throwing in a surprise gang attack in areas where there already was a surprise gang attack. And sometimes those gang attacks happen after a very tedious puzzle.  3 – No alternative outfits in-game. This is nitpicky, but when you see the White Latex Pants, Black Latex Pants, and White Chocolate mods for Haydee herself from the community, you begin to wonder why these weren’t in-game to begin with. Truth be told, I think they need to be patched in as a default option for costume variety.",
            "review_score": "1"
        },
        {
            "review_text": "Thicc robot adventures is a good game  Pros: -Thicc robot -Puzzly -Hardish/Challenging -Kinda spooky? -Shoegaze music -Simple gfx but works well with what its got  Cons: -Knife robot  Tips: -Put your gun away to jump -Remember where mines killed you the last time dummy  Having to turn around to drop down onto a ledge is not a con, it puts robot butt in your face.",
            "review_score": "1"
        },
        {
            "review_text": "This game requires A LOT of patience, in case you were thinking of buying it just for the sex appeal.  PROS:  -Lots of mod support.  -Challenging puzzles if you're into those kinds of games.  -Big booty to stare at while you're solving the puzzles.  -Decent amount of character customization for a puzzle game, there are also mods to add even more customization to the game.  CONS:  -Not enough save locations.  -There isn't any game mode or setting that'll let you save whenever you want.  -The animations, while they are very well done, are a bit slow and your character will sometimes pause halfway through them to show off the booty.  -The controls of the game aren't explained very well so you'll most likely die a lot at first. (Hint: To drop down and hang from a ledge, make your character face away from it then press the crouch button twice)  -There's only one body-type you can choose from unless you use mods.  -The difference between the Softcore and Hardcore game modes aren't explained at all. In hardcore, enemies deal more damage, your weapons will sway around a bit more, the recoil is more unpredictable, and you lose three slots in your inventory.  -You have a limited number of times you can save the game and to get more saves you have to find floppy disks in-game.    Overall, I'd say it's a fun game and worth the price if you enjoy puzzle games. It has a sort of Portal 2 feel to it. There's definitely some room for improvement though. The thing that frustrates me most about this game is that if you make a simple mistake and die, you have to start all over unless you saved the game recently. A new mode that introduces auto-saves or unlimited save disks would greatly improve the game and make it more fun for people who have trouble solving the puzzles.",
            "review_score": "1"
        },
        {
            "review_text": "I would say watch videos on Haydee BEFORE buying it. I personally enjoyed it, and successfully obtained both endings. However that is not to say that I have complaints about this, and (stop me if you've heard this before) is in great need of a map. Part of the 'difficulty' comes from having to remember all the rooms and the layout, when its simply just getting lost and wasting time. I did enjoy getting the Magnum, as it helped with the Blade-Bots so much, especially if you end up panicing (Those who are easily startled I do not recomend this game, especially how suddenly they go off).  I honestly don't really know how to word my review properly, as part of me says this game is great, but the other part of me says don't buy this game (hopefully its just the salt talking)",
            "review_score": "1"
        },
        {
            "review_text": "Holy ♥♥♥♥. I originally got this game as a joke to make a quick video on... and it turned into a full Let's Play. I LOVE this game. It is genuinely fun and challenging... and no.. NOT because of clunky controls or anything. Anyone complaining about this game needs to take a second look PAST the sexy robot lady (which is a plus in my book anyway) and see that there is actually a great game there.  Very Metroidvania-ish. Meaning you'll be wandering back and forth a LOT figuring out things. Lots of Puzzles and Platforming. A bit of third-person shooting thrown in there. Highly recommended for people who don't get easily offended and actually know how to enjoy themselves.",
            "review_score": "1"
        },
        {
            "review_text": "The graphics are quite clean and run very smoothly, it feels polished and minimalist. The environments are quite small and there isn't much to do in each of the rooms. It takes a little bit of time to load between rooms, and you need to go between rooms quite a lot so this is quite annoying. The controls feel pretty solid for movement, but I wish the animations were faster. Mechanically it's interesting as there are a lot of different ways to approach the puzzles.   The character Haydee is some kind of android with extremely large breasts, and flaunts bare legs and a wide rear. If you find these features to be sexually appealing then the game can be enjoyed on another level.  Mods for extra 'Outfits' which are like character skins are also fun to use, and easy to install. If you want you can even make Haydee naked, or reduce her breast size.  I think it's quite a good game. It feels clunky at times, but overall it offers enjoyable content.",
            "review_score": "1"
        },
        {
            "review_text": "janky controls + very few save points + platforming + jumping lighting quick enemies + no direction + huge robo tiddies I had fun for a little bit, but after the first hour or so the game quickly became a chore to play. If its ever on sale i'd go for it, but for now its a solid ehhhhh.",
            "review_score": "-1"
        },
        {
            "review_text": "Okay you have seen the video and gazed at the screenshots. If not go look at em I'll wait. Back? Good. Now forget everything you just saw and heard. If you take anything from my review remember this: Haydee is a great game. The greatness lies in the thought that clearly went into Haydee's design.   Given what Haydee is designed to be and is, a game of moving through an enclosed space in six directions, the controls are perfect. Only thing I would ask for would be a toggle for Haydee's night vision visor to free up some hotbar management. I recommend using the keyboard and mouse, but then I come from an age of digital controllers.   The way in which Haydee interacts with her world is delightful, from the way she looks at the camera, to the tragic animations of her death, and everything in between.    Each zone has a subtle, but distinct feel. Puzzles are well thought out and some have multiple solutions. Haydee is true to the Metroidvania style as you will be going back to previous areas as you acquire the means to access or solve their puzzles.   Overall the aesthetic of Haydee is reminiscent of Portal. A clean white factory or lab, perhaps an AI testing environment. If Haydee herself is the reason you haven't bought this game, then please be aware that she is very moddable and a growing community is doing just that.   Haydee will not hold your hand and is not for everyone, but your persistence will be rewarded, especially if you are paying attention. Haydee's story is simple, straight to the point, and easy to miss. But with Haydee it's more about the journey.   Most importantly the Devs are very helpful and frequently interact with Haydee's community. Which is a big plus given that they have released Hadyee's modding tools.   I recommend you get Haydee if you like a challenge, can deal with the frustration of failure, and enjoy a hard won victory.   Still not convinced? Try the Greenlight demo.",
            "review_score": "1"
        },
        {
            "review_text": "Honestly it reeled me in with gigantic ♥♥♥ and the fact that it looked a bit like an action-y Portal.  This is not that type of game.  Saves are limited, story is unfulfilling, there's no control explanation, and every time you die you have to go back into the pause menu to start a new game unless you saved. Also the first jump of the game has a low ceiling that you will most certainly bump your head on and die to.  It's hard, and that's not a bad thing. I can see people liking it for this reason at all. However, being hard isn't necessarily a good thing either. Don't expect an easy, relaxing time. Play with an extremely conservative mentality and only buy this if you're looking for something extremely hard.  tl;dr play this if you want to feel accomplished, don't play this if you want to feel good about yourself",
            "review_score": "-1"
        },
        {
            "review_text": "Seriously this is one of the most entretaining games I've played in my life. The last time I felt like that for a game was playing Portal 1 and 2. The game has just the right amount of challenge, forcing you to be very careful with every step you take, and to save your resounces (including the save, which is an item that is limited) The puzzles are great, normally in puzzle games there are times that when I get stuck, I look for walkthroughs, but not with this game, the struggle was good and not frustrating. The background music really adds a 'Portal' atmosphere to the game which I loved it. This game was an unique experience that I'll never forget. I wish there were more games like this.",
            "review_score": "1"
        },
        {
            "review_text": "Very, VERY challenging! I would not recommend for people who aren't very patient. In other words, it took me a while to beat the tutorial. Over all Great game! I didn't play it long myself though.",
            "review_score": "1"
        },
        {
            "review_text": "It's like Portal.  But there are no portals.  And there are more butts.  And breasts.  And awkward boners.  But in all seriousness, it's a cool game. It's pretty much a shooter, puzzle, survival, and adventure game rolled into one.",
            "review_score": "1"
        },
        {
            "review_text": "'Moron'  I haven't had a game make fun of me for being bad at it in a very long time.  I can't tell you how inexplicably happy that made me to see, as an achievement, when I couldn't figure out the first bloody jump three times in a row (I got it, though.)  I can tell this game is going to kick my ♥♥♥ later on.  8/10, GG, Haydee.  Also that robot got a fat booty so that's just fantastic.  EDIT: Alright, so, having played a bit more, I do have some gripes.  The camera should be controllable. Binding scroll wheel to a zoom in/out function would solve a lot of problems. I did find out you can press C to swap the camera between left and right, so there's that. Plus its position as being very far to the right or left of Haydee makes some platforming a little trickier than it would have been otherwise.  Haydee's butt is fairly low-poly, but the developer said in a discussion that he'll probably update it.  That's about all, really.",
            "review_score": "1"
        },
        {
            "review_text": "This game would have done well even without a massively endowed character. The platforming is fun and the puzzles are interesting so far. It also pays to explore every nook and cranny of every room. The combat is simple but still engaging, managing your supplies is also very important in this kind of game.  I still think that the character's figure is a tad excessive, I mean, with a rack like that, how would anyone be able to shimmy across ledges, jump across gaps and climb with ease? You'd get sore simply from running around, let alone platform like a pro. It's like having a death wish. Not to mention the garnering biased reactions from feminists.   Maybe the dev will change the character model, maybe not. Definitely like to see more work done to this game though.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ aside this is actually an amazing puzzle game, and the platforming isn't bad like people say it is. I have had no problem quickly jumping from one platform to another. I feel like a lot of hate stems from the fact that this is a sexualised game, which in all fairness it doesn't hide. There's even a censor mode in the options for people who don't want to see anything of the sort; which is enabled by default I might add.   For most people this is a game that will draw you in with the sexualised character, but will keep you playing for the gem of puzzler hidden underneath.",
            "review_score": "1"
        },
        {
            "review_text": "thicc",
            "review_score": "1"
        },
        {
            "review_text": "Cons -This game is hard --Like, really hard, woah ---Like, I spent an hour in a room without knowing I didn't have the right item ----Because I didn't notice a small hole in the ceiling or ledge I could jump and hang off of -The game doesn't tell you that you can crouch away from a ledge to lower yourself  safely  -Bungling a action for any reason can screw you over big time -Saves are far and few inbetween, leading to a lot of time wasted if you die at all -Falling damage can eat half your health, even if it's just barely over the threshold -No map, so if you're not smart like me, you'll get disoriented a lot -You have to navigate blindly in the darkness sometimes, which is scary as balls  Pros +The booty too strong",
            "review_score": "1"
        },
        {
            "review_text": "Purchases like this remind me why my friends don't talk to me anymore.  Despite that, pretty difficult puzzle game that offers you no hand holding whatsoever. I spent 30 minutes wondering how to work the vibrator button. I will never get that time back.  Worth a buy if you enjoy puzzle games and feel completely shameless.",
            "review_score": "1"
        },
        {
            "review_text": "Sexy character in a world where devs are usually scared to offend people, lots of mod support to change how your character looks (check modding section on the steam haydee forums), a great graphics engine that runs well on low-end computers, a large number of zones to explore and a fantastic core puzzle game that's somewhat similar to portal 2 (except without a portal gun and far more difficult).  Ultimately once the T&amp;A novelty wears (actually it never does :D) you have a great puzzle and exploring game, that's not for the faint hearted. You will most likely end up reaching for guides as it starts to get a little difficult to know how to progress but it's still very rewarding and you'll sink a lot of hours into it, getting you moneys worth if you stick with it.  I had a pretty hard time getting into the game initially, it offers very little guidance to get used to the controls and everything, I would suggest watching a video to accompany your first hours play because otherwise you'll most likely rage quit. If like me you're more interested in the puzzles and less in the shooting robots part there is also an unintended cheat to disable damage taken from attacks, which made the game a lot more fun personally.  Great game, I like it a lot.",
            "review_score": "1"
        },
        {
            "review_text": "Cool game, everybody love this game, boing is love, boing is life.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game, it's fun to play, its' tough, and I feel like I've already got my money's worth.",
            "review_score": "1"
        },
        {
            "review_text": "A Very entertaining game I love it. And I hope the developers continue their support for the game!",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥ and ♥♥♥♥♥♥s",
            "review_score": "1"
        },
        {
            "review_text": "This game is the unholy union of portal, darksouls and clickbait.  The general style of the game is reminiscient of portal with strange robot-filled testing facility with little to no context. The difficulty however is dark souls in nature. The tutorial section pulls no punches and no clues are given to any of the initial puzzles, simply assuming that being able to look up the controls is enough for you. Most of the puzzles involve considerable trial and error and with the limited number of saves, (which are often more secrets than regular handouts) and you need to have one hell of a sense of spatial awareness because many of the puzzles take place across several disconneted rooms across different floors.  The story is not made obvious, your first introduction is actually the 'Boot' dialogue that appears on the bottom left of the screen when you click new game with the rest of the happenings being environmental (if you see bodies lying around try and reconstruct what happened).   Basically this game is enjoyable for 2 reasons: 1. It's actually a really good puzzle-platformer if you can resist the urge to declare to everyone that you are not interested in the fanservice of the main character for 5 minutes or more. 2. It's a really good puzzle-platformer that is triggering as all hell to feminists.  So if you want to be part of a counter-culture while secretly taking breaks to rub one out during pauses in the action and feel smart when you finally complete all the puzzles I would reccomend.",
            "review_score": "1"
        },
        {
            "review_text": "I didn't try the game for an extended period but I do not believe I had to.  The game is simple. There is a room go through it... simple enough? Well think again because wverything in this game is here to kill you devs included.   Before people say I am whinning about the difficulty let me explain myself. The game have two main point from what the description say: exploration and combat. Those are the main point of metrovania games. In this game through neither of those are fun.   The climbing is slow and tedious. One failure will make you fall to tour death or eat away 1/3 of your health for falling the height of your character...   Far from being a fair game it is only about trying to survive the devs boogie traps. It is nor fun nor enjoyable.  To be fair there is one thing the devs go well and it is the visuals. The rooms does look strangely futuristic and empty and the character model have a good fluidity to it.   Despite the nice visual I judge this is not a game worth buying.",
            "review_score": "-1"
        },
        {
            "review_text": "The Plot is so THICC and JUICY.  10/10 Would Misoggyknee again",
            "review_score": "1"
        },
        {
            "review_text": "  I wonder how many people will buy this annoying so-called hardcore puzzle thing  if there's no ♥♥♥ and boobs in this game anymore.   My friend sent me this after I bought him DOOM. I finally ended this, now I'm starting to question our friendship.   *10/25  The following is the point I didn't recommend this game.  1. I can accept a game that death is an aspect of gameplay. But in Haydee which is using traditional S/L system rather than checkpoint, it become a trouble.  There's many difficult situations(rooms) where players have to try and try to break through. However, after failed(also means died), it usually took a long way to return from your last save room,  filled with the landform that can easily fall to death even if you got your 100% concentration focusing on every step and jump.  Combine with the limited saving count making player hard to determine saving at the safer place,  the process in Haydee soon become an annoying, inconvenient trick.  2. About the sexy looks of Ms.Haydee, well indeed I felt excited at first, and her boobs completely block the sight to shot enemies again and again, the excitement soon turned to anger.  3. Information of Haydee's story and backgruond is very scarcely, or even none. Maybe it is the methods develops wanted to bring out player's imagination as much as possible, however it can also make players feel confused and lose the motivation to continue the game.     I'm not a well-skilled player. I yelled and screamed happily when I beaten Ornstein &amp; Smough the boss makes me stuck about a month in darksouls, after died 50+ times, but when I finally ended Haydee, I just sighed and uninstalled it.  I hope it just me that too young to feel the sense of accomplishment when playing Haydee.",
            "review_score": "-1"
        },
        {
            "review_text": "this game is alot of fun and challenging as ♥♥♥♥en hell be prepared to die seriously. guys...ladies that bot your playing as is a distraction asuming its a bot &gt;w&gt; with those fleshy bits mabey its a lady who ♥♥♥♥en knows any♥♥♥♥♥ seriously this game will kick your ♥♥♥ and make you think &gt;O&lt;!!!",
            "review_score": "1"
        },
        {
            "review_text": "This game gives me a funny tingle right in the ♥♥♥♥ nozzle",
            "review_score": "1"
        },
        {
            "review_text": "The Dark Souls of robot boobs platforming, a bit of chore to play in some sections that look too-samey though.",
            "review_score": "1"
        },
        {
            "review_text": "great to spank it to after mom turns off all the naughty sites",
            "review_score": "1"
        },
        {
            "review_text": "&gt;be me &gt;be conservitive &gt;filthy liberal scumbag isis loving femnazi neighbor recomends this game to me &gt;clearly is SJW plot to further his matriarchal goals &gt;ease my 400 pounds into chair &gt;chair breaks &gt;buys another chair &gt;blames SJWs for poor quality of chair &gt;opens up his liberalSJWplot.exe &gt;features woman protagonist &gt;sees heavy set female protagonist &gt;sees white body over her swarthy skin tone is false propoganda on how caucasians opress other savage ethnic groups &gt;TRIGGERED.jpg &gt;didn't even need to play the game to see this is filthy propoganda &gt;pull out AK-47 from closet &gt;accidently spills all of my AK-47s onto the floor &gt;leaves AK-47s on the floor along with pizza crusts and perishable food items &gt;goes to liberal scumbag communist Berney supoorter neighbor &gt;he was waiting for me &gt;he asks me how the game was &gt;aim gun &gt;fires &gt;gun flies out of my hand due to recoil &gt;bullet freezes infront of liberal non-cis scumbag &gt;realizes its the work of an enemy stand &gt;stand battle ensues &gt;tfw ORAORAORAORAORAORAORAORAORAORAORAORAORAORAORAORAORAORAORAORAORAORAORAORAORAORAORAORAORAORAORAORAORAORAORAORAORAORA &gt;communist vampire stand user liberal drops steam roller on my head &gt;dies &gt;communist pig lets out the cry of his species &gt;'WRYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYY!!!'   (On a serious note this is actually a pretty good indie title. Puzzles are fun, the exploration is great, 10/10 would play robot bewb game again.)",
            "review_score": "1"
        },
        {
            "review_text": "IGNORE WHATEVER THE SALTY SJWS MAY SAY!!!   The gameplay is solid, slightly unique to me if anything. Since the demo, difficulty has been adjusted greatly, and some other issues have been addressed aswell.  The controls are more responsive than ever, no longer you do need to be smack dab in the middle to hit that jump. Though i would recommend that the devs added a proper tutorial rather than 'Figure it out yourself' sort of segment.  This game is UNFORGIVING, dark souls level of UNFORGIIVNG, you've got limited saves, so hang onto em.  Whenever a fan of thicc robot booty, or just want a great game, Haydee is worth a try.",
            "review_score": "1"
        },
        {
            "review_text": "\\Great 'assets'. No more words./",
            "review_score": "1"
        },
        {
            "review_text": "the shape of haydee is ...... tempting, huge bouncing breasts and huge hips ....　distractiing. a sexy woman focused on some real tough business, it's amazing!",
            "review_score": "1"
        },
        {
            "review_text": "The game is unfair in places, and sometimes I would say it's too challenging too, but it's still a game worth playing. I enjoyed my time with it.  So, I obviously bought the game for the ♥♥♥♥. No two ways about it, I like to watch ♥♥♥♥ bounce, and boy do they. But I came for the ♥♥♥♥, I stayed for the game. See, the thing about Haydee herself is that you start to ignore her voluptuous body after an hour of play, and it just becomes 'her', rather than 'her ♥♥♥♥' or 'her ♥♥♥'.  The game itself is good, too. I like the shimmying around and the progression you go through to get to the end, although just a bit of direction would make the game even better. I'm not asking for an objective marker or anything like that, I'm more asking for something like 'Find the thing in this area'. Sort of like a checkbox more than anything.  One last complaint, Haydee's waist could do with being slightly narrower. When she grabs onto a ledge, it looks like she's really fat. It's the hip-to-waist ratio. Come on, game designers, get with it!  10/10 would fap again.",
            "review_score": "1"
        }
    ]
}