{
    "app_id": 530960,
    "name": "ROM: Extraction",
    "release_date": "2016-12-07",
    "developer": [
        "First Contact Entertainment"
    ],
    "publisher": [
        "First Contact Entertainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "SteamVR Collectibles",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "VR"
    ],
    "achievements": 15,
    "positive_ratings": 74,
    "negative_ratings": 40,
    "price": 14.99,
    "description": "ROM: Extraction puts you into the role of an Extractor where you must Throw, Slow, &amp; Shoot your way to decimate as many extraterrestrial-bots as possible. ROM: Extraction begins as an homage to the classic arcade shooter with more game modes and maps to come!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/530960/header.jpg?t=1499292821",
    "minimum_requirements": "OS: Windows 7 Processor: Intel i5-4590 Memory: 8 GB RAM Graphics: Nvidia GeForce GTX 970 or AMD RX470 DirectX: Version 11 Network: Broadband Internet connection Storage: 10 GB available space Sound Card: DirectX Compliant Sound Card",
    "recommended_requirements": "OS: Windows 10 Processor: Intel i7-4770 Memory: 16 GB RAM Graphics: NVIDIA GeForce GTX 1080 or AMD R9 390 DirectX: Version 11 Storage: 10 GB available space Sound Card: DirectX Compliant Sound Card",
    "reviews": [
        {
            "review_text": "Very entertaining game. The throw, slow, shoot mechanic is extremely addictive and watching bullets fall in slow motion while pounding music plays gets the adrenaline pumping. The visual style of the game is a cool sci-fi aesthetic and it's a minor but engaging addition to be able to see player arms move with the controllers in game. There's not a lot of content here, but what is there is polished and seems very replayable.",
            "review_score": "1"
        },
        {
            "review_text": "nice and polished but expensive for one level only - not enough content yet as theres jsut the one level, the gun is too much hard work to kill somthing too",
            "review_score": "1"
        }
    ]
}