{
    "app_id": 531960,
    "name": "Bloody Walls",
    "release_date": "2016-09-28",
    "developer": [
        "L. Stotch"
    ],
    "publisher": [
        "L. Stotch"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Free to Play",
        "Indie"
    ],
    "tags": [
        "Free to Play",
        "Action",
        "Pixel Graphics"
    ],
    "achievements": 9,
    "positive_ratings": 724,
    "negative_ratings": 229,
    "price": 0.0,
    "description": "The world was plunged into chaos following an accident at a bio-weapon research facility. 100% of the earth's population has been infected. There is an antidote that blocks infection from the airborne strain of the virus, but the effect is temporary.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/531960/header.jpg?t=1522067648",
    "minimum_requirements": "OS: Windows 7 Processor: 800 MHz Memory: 512 MB RAM Graphics: Hardware support WebGL - OpenGL 2.1 (GPU Memory - 256MB) Storage: 127 MB available space",
    "recommended_requirements": "Graphics: GeForce 5xxM Series OR Radeon HD 6000 Series",
    "reviews": [
        {
            "review_text": "So...a review for  Bloody Walls , eh?  Essentially, it's a roguelike title about destroying zombie mutants by manually targeting the enemies' heads with your mouse and firing by clicking, sounds simple enough, right? Well, during the whole game you're given only 1 hitpoint. Get touched, it's over.  There are 3 weapons and 2 kinds of mines in the game. You also have money that expires (there's a counter that tells you when you're about to lose one unit of currency), so you need to puchase a little strategically.  As the game progresses, newer enemies will be introduced, which makes the game even more tricky. In the end, you can manage to finish the game in 10 minutes if you know what you're doing. If not, then it should take an hour or two. If you're feeling too frustrated, the developer himself recorded a playthrough on YouTube to give you a general idea of what to do.  The visuals look decent, though the intro, gameover, and ending screens look great. The blood splatters on the wall (where the game gets its namesake) also adds some charm to the game. The music ranges from creepy (when there are no monsters) to epic (when there are monsters).  The main disappointment with this title is that it's short and a new player won't have the faintest idea what's going on on the first floor.  Bloody Walls  also suffers by being short and with a relatively low replay value. For a precursor to a potential sequel project, it's not too shabby.  6/10 A short, strategic shooting experience and an easy 100% that looks good, sounds great, but suffers from being short and predictable.",
            "review_score": "1"
        },
        {
            "review_text": "Fun and simple!  It might be confusing for a start especially about the objectives, but its a great free game!  Go try it, its free and the music is awesome.  Avoid Dying though, you will start at the beginning and gun mechanics feel wierd.   9/10 Would get bitten by zombies again. :D",
            "review_score": "1"
        },
        {
            "review_text": "Ain't nobody got time for that last level!",
            "review_score": "1"
        },
        {
            "review_text": "eazy game recommended and very eazy achievements",
            "review_score": "1"
        },
        {
            "review_text": "Retro Graphics but a very challenging game ahahaha hard to beat lol lol",
            "review_score": "1"
        },
        {
            "review_text": "Simple concept: the kind that is easy to pick up but strangely addicting because its so simple to get but hard to master. Considering its free to play this ia worth picking up, I mean I stumbled upon it out of nowhere and was quite happy to find something so simple and fun with a apocalyptic noir undertone",
            "review_score": "1"
        },
        {
            "review_text": "A short little retro sidescroller shooter that disguises its puzzle mechanics very well. Admittedly a short game; but definetly worth 30mins - 1hr of your time.",
            "review_score": "1"
        },
        {
            "review_text": "I hate all type of the zombie i must play 2 hour to complete the game, sad",
            "review_score": "1"
        },
        {
            "review_text": "Finished the game in 15 minutes... (word of advice shotgun is bae ingame) usually 1 shot enemy except for big guys. very annoying untargetable enemy units. Use mines for them except for guys that are in the giant ball that has a line down the middle they pop out to attack you so u can target them there, takes like 1 ar and 1 shotgun at 100% damage. good short game",
            "review_score": "1"
        },
        {
            "review_text": "It's a nice little challenging game, but nothing groundbreaking - nevertheless, fun for like half a hour.",
            "review_score": "1"
        },
        {
            "review_text": "Its really dank ",
            "review_score": "-1"
        },
        {
            "review_text": "It is fun :D",
            "review_score": "1"
        },
        {
            "review_text": "Granted, yes, it is free, but that's no reason to be so damn bad. So lets just establish something first: I did enjoy the game for the first few minutes. But after that I quickly realised just how annoying it is. It has a terrible aiming system, requiring you to place your cursor over a moving targets head and then shoot, only to have a ludicrous cooldown time. It bugs the absolute ♥♥♥♥ out of me when I die because of this. Oh, and on the topic of dying, you get killed in one hit. They so much as touch you, and you're ♥♥♥♥ed. There's no save points or checkpoints of any kind. Just die, and go back all over again. It also doesn't help you walk incredibly slow, and even slower when you have multiple items, such as two guns. All in all, just don't waste your time. It took 5 minutes to install, but only 5 seconds to uninstall. Thank ♥♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "-=-Pros-=- -Guns -Zombie Chickens? -=-Cons-=- -Short -No Story -Too long reload time -Not very good action -Barely any colour -Very little Blood Splatters (Even though this is called Bloody Walls)",
            "review_score": "-1"
        },
        {
            "review_text": "No clue why this game is so highly rated. It's ♥♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "Basic side scrolling Zombie shooter. Use Keyboard A &amp; D to move left or right, use your mouse to aim @ Zombies heads and click the mouse to fire. Use ENTER to interact, and talk to the NPCs for missions. Use the elevator to select a level. 4/10",
            "review_score": "-1"
        },
        {
            "review_text": "Shoot, Die, Repeat, Shoot, Die, Repeat, Shoot, Die, Repeat.   A casual and free game. Also enjoyable, try to donate to give the developers some love!",
            "review_score": "1"
        },
        {
            "review_text": "So far it is a great game. Am yet to finish the game. The new update made it so that the bottom of the screen is cut off.",
            "review_score": "1"
        },
        {
            "review_text": "Cool game Lot's of fun when you want something quick",
            "review_score": "1"
        }
    ]
}