{
    "app_id": 533690,
    "name": "Think To Die",
    "release_date": "2016-09-22",
    "developer": [
        "Felip Guimerà"
    ],
    "publisher": [
        "FelGC.GamesDevelopment"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Casual",
        "Free to Play",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Free to Play",
        "Indie",
        "Casual"
    ],
    "achievements": 11,
    "positive_ratings": 198,
    "negative_ratings": 76,
    "price": 0.0,
    "description": "A different and creative casual puzzle game where you have to find a way to die to pass the level. To do so, you have to master different situations, combine objects, and time your actions.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/533690/header.jpg?t=1497471022",
    "minimum_requirements": "OS: Windows 7 Processor: i5 Memory: 4 GB RAM Graphics: &gt; 2 GB Graphics Card DirectX: Version 11 Storage: 1 GB available space Additional Notes: You need DX11 support &amp; an aspect ratio of 16:9, otherwise it will be resized.",
    "recommended_requirements": "OS: Windows 10 Processor: i7 Memory: 8 GB RAM Graphics: 4 GB Graphics Card DirectX: Version 11 Storage: 1 GB available space Additional Notes: You need DX11 support &amp; an aspect ratio of 16:9, otherwise it will be resized.",
    "reviews": [
        {
            "review_text": "I'll make this brief. It needs some polish, but there's no harm in picking this up now for free.  In its' current state, it's buggy and plays a little clunkily. Then again, I'm writing this on release day, so I don't doubt that down the line improvements will be made.  It's easy on the eyes, adopting the 'low poly' style that's risen to popularity recently. The concept is similar to  'Squishy the Suicidal Pig' , in which the puzzles are far more complex, but, then again, holds a price tag higher than  free .  I'm glad to see more single player free-to-play games coming in through greenlight nowadays, so I can't fault this game for that. Give it a go.",
            "review_score": "1"
        },
        {
            "review_text": "My grievances: - Bad music: please just pick a musical mood and stick with it. - Graphically unimpressive - Poor physics and exploits: I've been able to 'crush myself' by hitting my head against the bottom of a physics block while jumping. Also, crates can roll around on the useless voxel residue ('gibs') of a crushed corpse. - Game actually has to have good physics before implementing weird, floating, frustrating physics blocks. - I've seen the concept before: 'Squishy the Suicidal Pig'  On top of this, the game can hardly be considered fun. It's just a bit of a chore.  Pro: - Cool color palatte and background design  Basically, I believe the game has few redeeming qualities, which are inadequate to actually redeem it.",
            "review_score": "-1"
        },
        {
            "review_text": "Riddled with bugs. Unreliable physics. Don't waste your time. EDIT: As requested by the dev, I'll write down some of the bugs. When hugging a wall, or a similar structure, it's near to impossible to jump, as if the spacebar/w key were jammed. Then, on one of the levels with the sleeping guy, one that had about 5 boxes or so, I managed to make the game break in 2 different ways. First, I got the dude stuck *inside* one of the boxes, and just that. I could move him and everything but proved too hard, so I had to restart. After that, I don't exactly remember how, but I got him stuck, yet again, though this time he and the box just drifted away. like they were made out of paper.  Oh, and on one of the first levels that introduce the second guy (the one you can actually control), if you walk towards a place where a switch lifts a piece of wall, then let go as the other guy, you get stuck and can't move to the right unltil you restart the level. And this one is easily reproduced. Hope this clears up some of them.",
            "review_score": "-1"
        },
        {
            "review_text": "Interesting game and kind of fun but lacks polish. Some weird physics issues and geometry glitches. Also no controller support in the menus.  Overall it's worth the price (currently Free). The developer seems to be very active and willing to improve, so consider the 99 cent 'Donation' DLC!",
            "review_score": "1"
        },
        {
            "review_text": "Level 17. When I had to repeat the level due to willy wonka physics and not puzzle design. That was it for me. grandma ain't got time for this.",
            "review_score": "-1"
        },
        {
            "review_text": "'Think To Die' feels like something made at a game-jam and finished at home afterwards. The concept is simple, the graphics are simple, and the controls and collision physics a dodgy. That being said, many of the puzzles are well thought out, and there is a lot of them (is at puzzle 55 at time of writing). Also, although the graphics are simple, the style is well made and fit the game well. Besides, this game is free, so all you have to invest is your time and in this case it is well worth it.",
            "review_score": "1"
        },
        {
            "review_text": "I LOVE IT! I spend too much time on games where you must survive and kill. This is different, you must die. Highly recomend it :D!",
            "review_score": "1"
        },
        {
            "review_text": "I'm the first to comment on this game XD    (This game is meh/10)",
            "review_score": "1"
        },
        {
            "review_text": "What it says on the box.  Some clunky controls, but a great premise with hilarous results.",
            "review_score": "1"
        }
    ]
}