{
    "app_id": 534480,
    "name": "Tropical Girls VR",
    "release_date": "2016-09-30",
    "developer": [
        "Tomilano"
    ],
    "publisher": [
        "Tomilano"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Sexual Content",
        "Nudity",
        "Adventure",
        "Casual",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Nudity",
        "Sexual Content",
        "Simulation"
    ],
    "achievements": 0,
    "positive_ratings": 11,
    "negative_ratings": 23,
    "price": 3.99,
    "description": "Experience amazing moments with beautiful girls on the Tropical Island in the middle of the ocean.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/534480/header.jpg?t=1513686468",
    "minimum_requirements": "Betriebssystem: Windows 7 Prozessor: Intel Core i5-4590 (or equivalent) Arbeitsspeicher: 8 GB RAM Grafik: GeForce GTX 970 (or equivalent) Speicherplatz: 600 MB verfügbarer Speicherplatz",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Super creepy and a complete piece of crap - only reason im not refunding is as a morale lesson to myself - every time i look at it in my Steam library I will remember to never sink to the 'Ah well i'll just buy it how bad can it be' level again :D  Low res graphics. One small island. Glitchy movement where invisible floor levels will suddenly raise you up or drop you down. One girl is standing specifically in one of these places so you're floating above her. The girls always stare at your forehead - its unsettling. Not as unsettling as when you stand behind them and you can actually see the neck mesh twist 180 degrees while the character model stays perfectly still. Or how every one of them remains completely static apart from the neck/head moving backwards (usually through scenery or furniture) to get away from you.   TL:DR - its cheap, but i would be highly critical even if this was free. Its not even a tech demo - its a glitchy mess. Avoid as if its digital-syphillis. Because it is.",
            "review_score": "-1"
        },
        {
            "review_text": "Not interactive and will test your computer, but it's okay. For less than 5 dollars, buy it.",
            "review_score": "1"
        }
    ]
}