{
    "app_id": 536320,
    "name": "The Space Garden",
    "release_date": "2016-10-03",
    "developer": [
        "Max"
    ],
    "publisher": [
        "Max Indie Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Casual",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Casual",
        "Clicker"
    ],
    "achievements": 15,
    "positive_ratings": 17,
    "negative_ratings": 25,
    "price": 1.69,
    "description": "In &quot;The Space Garden&quot; you can build your own garden across the Universe! Discover, acquire and grow your plants with love as you watch them evolve. Collect fruits by yourself or request help from your &quot;helpers&quot;, a race of mini friends who come from nature.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/536320/header.jpg?t=1479430938",
    "minimum_requirements": "OS: XP+ Processor: Intel(R) Pentium(R) CPU 2.13 GHz Memory: 2048 MB RAM Graphics: NVIDIA GTS 450 or better Storage: 200 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Actually this game is fun... it would be fun, when it wouldn't be full of bugs and the last update made it even worse. - saving doesn't work - all helpers are dead when you restart the game - prices are resetting after restarting the game. This means prices start from zero even if you already have built things on your map (which might be good, but it is defenitely not how it should work)  And there are some other things that aren't working fine: - you have a map but you can't click on it to get to the position you still have to move with WASD and moving like that feels very clumsy - there are different kinds of helpers but you only have a picture which explains that they collect fruits. So you can't even tell what is the difference between them (if there is even a difference!?) - helpers die very fast and with the clumsy controls and with &gt;10 planets it takes far too long to revive them. By the time you got around the whole map new helpers died and you have to get around the map over and over again  I hope the bugs got fixed soon because at the moment it is not playable.",
            "review_score": "-1"
        },
        {
            "review_text": "The Space Plantera",
            "review_score": "1"
        }
    ]
}