{
    "app_id": 536920,
    "name": "Groggers!",
    "release_date": "2016-11-10",
    "developer": [
        "Indigo Studios"
    ],
    "publisher": [
        "Indigo Studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Local Multi-Player",
        "Co-op",
        "Local Co-op",
        "Shared/Split Screen",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Casual"
    ],
    "achievements": 15,
    "positive_ratings": 2,
    "negative_ratings": 1,
    "price": 2.79,
    "description": "Groggers is a physics-based action arcade game. You must help your Grogger make it home safely. Some of the bottles will you help you out, others might hurt. Get your Grogger home as fast as you can to collect more bottles to unlock additional zones and new characters.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/536920/header.jpg?t=1483540632",
    "minimum_requirements": "Requires a 64-bit processor and operating system OS: Windows 7 Processor: i3 Memory: 8 GB RAM Graphics: GTX 570 DirectX: Version 9.0c Storage: 300 MB available space Sound Card: Realtek",
    "recommended_requirements": "Requires a 64-bit processor and operating system OS: Windows 7 Processor: i7 Memory: 8 GB RAM Graphics: GTX 680 DirectX: Version 11 Storage: 300 MB available space Sound Card: Realtek",
    "reviews": [
        {
            "review_text": "I really like this game and the whole drunk concept. Good cute graphics and i love the sound track. Really fits the game. Think of a drunken frogger like game. Needs just a few little tweaks here and there and it will be perfect. Game hung up a few times after playing it for awhile but nothing major. I would like to see some holiday dlcs for this game. Halloween, Christmas etc. How about a drunk Dracula and Santa? Haha and a few drunks sitting outside the pub just for fun. Also you really need a controller for this game. Its not happening with a keyboard. Anyways i hope the Devs keep working on this game. Its a lot of fun and i plan on playing it a lot more this weekend!! :)",
            "review_score": "1"
        }
    ]
}