{
    "app_id": 537100,
    "name": "Shuffle!",
    "release_date": "2016-11-22",
    "developer": [
        "Navel"
    ],
    "publisher": [
        "YumeHaven"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Simulation"
    ],
    "tags": [
        "Anime",
        "Visual Novel",
        "Sexual Content"
    ],
    "achievements": 12,
    "positive_ratings": 85,
    "negative_ratings": 15,
    "price": 14.99,
    "description": "The world of the gods, demons, and humans have converged, and magic has become the norm. This is the story of the very busy romantic adventure of a boy called “The man who can become either God, Demon, or Human.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/537100/header.jpg?t=1555567506",
    "minimum_requirements": "OS: Windows XP SP2 and up Memory: 1 GB RAM Graphics: DX9 (shader model 3.0) and up DirectX: Version 9.0",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I love this game Huge fan of the anime You should get it",
            "review_score": "1"
        },
        {
            "review_text": "I own the MG version of Shuffle. Since Mayumi didn't have a route there, I couldn't say no to this one even though I could have waited another few years for Essence to appear.  I found out from the Discussions that this is a renamed version of a PS2 game called 'Shuffle: On The Stage.' This is an all-ages version of the game. That means that the mature content has been blotted out. Sometimes in a humorous fashion as scenes where the panty shots are hidden away are done in a way that you end up thinking that the heroine isn't wearing underwear.  Then we get to the less humorous aspect of the censorship. I've just completed Asa's route. I like the extra scenes. And the basic idea is the same. But then we find that the dark undertones have been toned down by 90% to make it child friendly. I'll say this right now, they don't use a   box cutter  . They use a mystical   necklace     that sucks magic power  ?!   Even worse, the moments leading up to this scene lack the tension that was in the original. The character is just  fine , you just need to fix a  small  problem. How small? Obviously it isn't life threatening if the one in question is up and about the next day.   It was originally a serious problem! They were even hospitalized in the Anime.  . The cheery extra scenes hurt more than help in this regard.  I was particularly impressed with how the CG is the   exact same   as the MG version despite the above changes. I thought it was   losing magic, why is there blood?  .   This game is All-Ages, but that means that the most powerful part of the scene has been defanged and you're left wanting as the scene's impact is inconsistent and feels too much like a joke to be taken seriously.  I'm afraid to try out the other routes because of this...   Gameplay:  10 - 20 hours of gameplay depending on reading speed / degree of completion / usage of skip.  Traditional visual novel setup where you have 1 common route with choices that branches into different character routes.  Unlike Choose-your-own-adventure games, choices do not alter how the common route plays out aside from minor differences to maintain consistency. This means that you'll end up seeing the same scenes and choices on subsequent playthroughs despite making a completely different first choice on the common route.   I should mention that certain choices will reveal hidden scenes where you may be given additional choices. These hidden scenes are key to unlocking certain heroine routes. As I said before though, during the common route your choices do not cause the plot to deviate, so when you find a hidden scene, it will return to the common route eventually.  The key to finding a route is by picking the right combination of choices. Thankfully, for those choices where the end result isn't obvious, this novel does provide a clue after each important choice indicating which girl would end up the happiest. Just gather up as many moments with her as you can.   Graphics:   This game allows you to set a 1920x1080 resolution, but it's sort of a cop out. Unlike the title screen, the game itself has the traditional 4:3 aspect ratio of the original. The rest of the space is filled in with a cloud backdrop on the left and right side of the screen. Even though you don't get HD CG, I'm okay with this since you can fullscreen without getting distorted sprites on widescreen monitors. In the MG version, I had to either play windowed or tamper with my graphics card settings to keep the game's 4:3 aspect ratio.  This visual novel isn't one of the recent ones, so you'll find that while it is voiced, you won't get the dynamic animation that you would find in NekoPara, Go Go Nippon, or Corona Blossom.    Sound:   In a recent patch, the music volume has been dialed down so that it doesn't drown out the voices. The voices still aren't as crisp and clear as I would like though. I'm not sure if it's because it's a port or the VA's are using a low quality microphone, but it feels like the characters are speaking to you from the other end of the room.   Controls:   You can use a gamepad to play. That's nice! Sorta, you can really only use it to advance and select choices. But it allows you to sit farther away from the computer while playing. Maybe even in a reclined pose.   A recent patch has greatly improved the playability of the game. First, the skip key is the [Ctrl] button now. This may seem weird on the english speaking market, but for those that are familiar with Japanese Light Novels, this is the standard skip key.  History can be accessed by scrolling up on your mouse wheel in addition to hitting the 'H' key.  The UI overlay can be hidden with the space key.  The config screen of this PS2 port is limited compared to traditional PC VN's. While you do get the standard stuff, a lot of the quality of life options that you would normally get are missing. For instance, there is no option to skip read/unread messages when skipping. And there isn't an option to continue playing voice when mouse clicked to end text layout. Nor is there an option to lay out text instantly at fastest speed.  The songs in the sound gallery now loop so you can keep your hands off if you want to hear a song again. Yay!   Language:  Japanese Voice. English text, no honorifics.  Translation is okay. English is fluent and typos are uncommon. I'm tempted to call Nerine's shortened-name, Rina, a typo though.    Story:    This part is currently incomplete since I am replaying the game. I plan to look for significant differences between this version of the game and the original Shuffle.   Most of the changes are generally to fit in the 2 new character routes. It makes me happy to see Mayumi with more screen time.  Some scenes have been expanded and moved around. For instance, observer reactions play a bigger part; it helps with the immersion because now we get glimpses of how the bystanders are reacting. Some of them are even voiced with choice lines like 'she's like a doll!'. It's not just the bystanders, the main characters have more moments too.  Certain scenes have been removed like that one with the crazy KKKaede fan and its followup. The 'bodyguards' are given a brief mention in the text, but without the acting you aren't aware of their true danger...  I kinda prefer how the original laid out the routes. In this version of the game, the common route sort of blends into the heroine routes. While you will unmistakably enter a heroine route, common route events will still occur inside of that route.  In the original, this blending didn't happen, once you were on the heroine route the story completely changed.  The reason why this even bothers me is because there is an event with Kareha that's basically bugged. This common route event will still happen even when you are on a heroine's route, and if you pick the 'right' choice, you will find yourself forced out of that heroine's route and into Kareha's.    Conclusion:  (6/10) - Those that haven't played the game are going to wonder what's so great about it as the serious moments have been turned into bad comedy. - Those that have played the MG version will be disgusted at the 4kids quality, it's-not-blood-it's-ketchup, censoring ruining the message. For the Mayumi and Kareha fans, still checking the Mayumi and Kareha routes to see if they're worth playing, but I wouldn't buy this to collect it. - With the new patch, in addition to the thoughtfulness of the screen resolution and gamepad input, the game has become comfortable to play.",
            "review_score": "-1"
        }
    ]
}