{
    "app_id": 537430,
    "name": "Inner Chains",
    "release_date": "2017-05-18",
    "developer": [
        "Telepaths Tree"
    ],
    "publisher": [
        "IMGN.PRO"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure"
    ],
    "tags": [
        "Action",
        "Adventure",
        "Horror"
    ],
    "achievements": 29,
    "positive_ratings": 143,
    "negative_ratings": 155,
    "price": 17.99,
    "description": "An FPS horror game set in a surreal, dark and deadly biomechanical world never seen before. Humankind is just a small part of a hostile universe. Want to survive? Discover its secrets.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/537430/header.jpg?t=1495544899",
    "minimum_requirements": "OS: x64 versions of Microsoft Windows 7 (SP1), 8.1 and 10 Processor: AMD Quad-Core / Intel Dual-Core processor running at 2.8 GHz (AMD Phenom II X4 or Intel Pentium Dual-Core G600 series or newer architectures are recommended). Memory: 4096 MB RAM Graphics: ATI/NVIDIA dedicated/integrated or mobile graphic card, with at least 1536MB of dedicated VRAM and with at least DirectX 11 and Shader Model 5.0 support. ATI/AMD Radeon HD 7700 series and NVIDIA GeForce GTX 700 series or newer architectures are recommended. DirectX: Version 11 Network: Broadband Internet connection Storage: 15 GB available space Sound Card: Integrated or dedicated DirectX 9 compatible soundcard",
    "recommended_requirements": "OS: x64 versions of Microsoft Windows 7 (SP1), 8.1 and 10 Processor: AMD / Intel Quad-Core processor running at 3.5 GHz (AMD FX-8000 series or Intel Core i3 6000 series or newer architectures are recommended). Memory: 8192 MB RAM Graphics: NVIDIA dedicated graphic card, with at least 3072MB of dedicated VRAM and with at least DirectX 11 and Shader Model 5.0 support (AMD R9 380 and NVIDIA GeForce GTX 970 are minimum recommended GPU architectures). DirectX: Version 11 Network: Broadband Internet connection Storage: 15 GB available space Sound Card: Integrated or dedicated DirectX 9 compatible soundcard",
    "reviews": []
}