{
    "app_id": 537700,
    "name": "Octave",
    "release_date": "2016-10-18",
    "developer": [
        "Anate Studio"
    ],
    "publisher": [
        "Anate Studio"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Adventure",
        "Horror"
    ],
    "achievements": 0,
    "positive_ratings": 86,
    "negative_ratings": 31,
    "price": 1.99,
    "description": "Octave is a point 'n click horror-adventure game with elements of action. Dark woods, monsters, paranormal activity, nice puzzles - all this is present in the game.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/537700/header.jpg?t=1477068813",
    "minimum_requirements": "OS: Windows XP and up Processor: 1 Ghz and up Memory: 1 GB RAM Graphics: GeForce 9500 GT (512 MB) or Radeon HD 6450 (512 MB) DirectX: Version 9.0 Storage: 600 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "  Octave: ~~~~~   On the side of the road, on your knees and totally blinded by the high beams of the car stationed in front of you. Pale and petrified as a man comes towards you, pointing a mighty gun at your head. Your life will soon end when . . . a being, a monster; you don’t know what it is but it saved your skin! At an incredible speed you find yourself on your feet running for safety into the woods.  Octave is a horror/adventure/puzzle game where you play a guy who is about to meet his Maker but is rescued by an unexpected being/monster.   After the introduction, you will find yourself in this dark forest. As you move from one screen to the next, you’ll find a rock (I think it is) with a ritual symbol on it. From here, you will have to light candles and avoid several monsters until you reach a house. The house is really the best content of the game I my opinion, with nice puzzles, although they are fairly easy to figure out.   Next you will play in the underworld where you will again have to avoid monsters to get to the final stage, and eliminate a creepy woman by turning her to ashes. How are you going to do it? You guessed it, by lighting candles!  Octave artwork is great and the atmosphere of spookiness and fear is well-done but the game is very short. There is no story in this game; the character does not talk to himself or even have written words on the screen as you go along, which is a bit of a shame. As I mentioned, the house was the best bit for me because of the puzzles, and the game felt like more of a point and click game, which I really enjoyed. The controls could have been more responsive. On a couple of occasions, when I double clicked to make our character run, it did not work too well. My understanding is that Octave has been made by a one man dev and he deserves credit for that.   Positives: ~~~~~~~   - Great artwork - Nice puzzles - Nice soundtrack and atmosphere - Trading cards  Negatives: ~~~~~~~~   - Short game - No story to follow - Needs more puzzles.  I enjoyed Octave but I wished that it had more puzzles and was longer.  6/10  Key provided by developer/publisher for review purposes. Any opinions expressed are entirely my own!    EPIC “THE CPT FROGGY” REVIEWS UP NOW ON ZEEPOND, THE HOME OF THE ALMIGHTY FROG!   [www.zeepond.com]     FOLLOW THE CPT FROGGY CURATOR PAGE HERE  ",
            "review_score": "1"
        },
        {
            "review_text": "I was not sure about this game at first, but once I figured it out I really enjoyed it. The house was my favorite part, Did not finish Hive cuz I kinda suck with the mouse I guess,heehee,",
            "review_score": "1"
        },
        {
            "review_text": "The game actually has very distinct art and overall good atmosphere. For a first release on steam from this dev it's actually decent. There is room for improvement and the game can be improved.  There is is the issue of how short it is and some slight issues with feedback and lack of instructions but to its credit the game doesn't make you game over from ground zero when you fail. So frustration level is not high.  Overall this game is a recommendation if you keep in mind its version 1 and the first game from this particular developer.",
            "review_score": "1"
        }
    ]
}