{
    "app_id": 538590,
    "name": "Sleeping Valley",
    "release_date": "2016-10-08",
    "developer": [
        "White Dog"
    ],
    "publisher": [
        "White Dog"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Commentary available"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Casual",
        "Indie",
        "Adventure"
    ],
    "achievements": 0,
    "positive_ratings": 82,
    "negative_ratings": 158,
    "price": 9.99,
    "description": "Sleeping Valley - a new arcade platformer game In Sleeping Valley you only have one life to live and it's your job to see how far you can take this cute character on his brutally hard journey.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/538590/header.jpg?t=1547139270",
    "minimum_requirements": "OS: Windows 7 or newer Processor: 1.5 Ghz Memory: 1 GB RAM Graphics: 512 MB GRAM Storage: 44 MB available space Sound Card: optional",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "  I will try to express how i felt in the game in long story short. The games rating is i have to say 6/10 and i DO RECCOMEND  Price: In my eyes pretty good  Pros: + Black/White game not alot of these on steam + Pretty good 2D game in my eyes + has good sounds +  Cons -Has small glitches/bugs -diffrent sound effects needs -Has some control bugs/glitches that make game annoying really annoying  Overall: the game is pretty good but has some small bugs that shoud been fixed i definetly suggest buying this one.",
            "review_score": "1"
        },
        {
            "review_text": "  I can't take game seriously, when it has typos inside of it. Especially in title. Screens:        That typo! #1&nbsp;",
            "review_score": "-1"
        },
        {
            "review_text": "Well, if you don't get angry too easily, or even more than too easily, then try and play ;) It's not an easy game, but it doesn't make it great. Graphics style is quite likeable. Handling your character precisely is not possible, so I belive this is the way of making the game harder than it would normally be.  To sum up, I wouldn't pay the whole amount for it, so if you're a serious platformer fan get it when seriously discounted, otherwise look further.",
            "review_score": "-1"
        }
    ]
}