{
    "app_id": 539640,
    "name": "Racecar.io",
    "release_date": "2016-10-18",
    "developer": [
        "Kastriot Sulejmani",
        "Brayden Myers"
    ],
    "publisher": [
        "KasSanity"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Online Multi-Player",
        "MMO",
        "Cross-Platform Multiplayer",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Free to Play",
        "Massively Multiplayer",
        "Racing"
    ],
    "tags": [
        "Free to Play",
        "Racing",
        "Massively Multiplayer"
    ],
    "achievements": 13,
    "positive_ratings": 149,
    "negative_ratings": 123,
    "price": 0.0,
    "description": "Play with other people online! Can you become the fastest racecar?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/539640/header.jpg?t=1530132030",
    "minimum_requirements": "OS: Windows XP Processor: 2.0+ GHz Memory: 512 MB RAM Graphics: OpenGL 2.0+ Support Storage: 60 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Good for being multiplayer snake and achievements.  I observed some de-sync issues in multiplayer.",
            "review_score": "1"
        },
        {
            "review_text": "Racecar.io is pretty much classic snake. I like it, right now its only issue is probably lag at the moment causing some spontaneous deaths. Pretty neat overall.",
            "review_score": "1"
        },
        {
            "review_text": "Racecar.io is a deceptively simple looking cartoon racing game, but quite tricky to play in practise, particularly since you're playing against real people who cut you off and kill you with their trail. However, I ended up being my own worst enemy in most games, since your own trail can kill you too! I enjoyed the 'cardinal points' steering system once I got the hang of it. All around, and enjoyable game.  Make up your own with the gameplay         YouTube™ Video:  Racecar.io - Free Steam Game&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Glorified game of Snake in a modern era!",
            "review_score": "1"
        },
        {
            "review_text": " The Lightbikes are currently in the shop",
            "review_score": "-1"
        },
        {
            "review_text": "dont even attempt to download this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Slither.io for Steam.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't bother with this game if you're planning to play Online.   Pros: -Play VS Bots (I think about 7-8 Spawn) -Online Gameplay -Great looking sprites, Colorful gameplay. -Ability to trap other players just like other games that's already been created online multiple times. (slither.io) -Getting Achievements just for liking a facebook Page, and subscribing to a Youtube Channel. (And I think also following a Twitch Channel. The only 3 achievements I have not gotten.) -Music seems pretty good. (Even though it loops.) -Ability to change your game size window/and Graphics upon booting the game up. -Choose multiple car styles.  Cons:   -When you've died and you go back to the 'enter your username' it's glitched. I can't erase my previous username. -Don't bother playing Online. Latency is no good. You'll trap cars and they'll go right through your line. No point at all unless you're away from them and collecting those little blocks/circles. -Music Loops, can get annoying at times. -You'll end up accidently killing yourself for unknown reasons. -Online Gameplay - A random car will end up lagging in front of you, getting you killed.    Overall Rating:  Controls: 10/10 - Reason why i'm giving this a 10/10 is because they function on how they're suppose to be functioning. You turn left, it'll go left ect. After all you only got 4 keys to push. So that's a perfect. Saw no problems with them.  Game Display: 10/10 - Reason why this is a 10/10 is because it gives you multiple displays to choose from upon booting the game up. This was done well.  Online Gameplay: 2/10 - I'm being generous here giving it a 2. Reason why it gets a 2 is because, you can actually play with other players, and there is usually 3-7 players online. That's it.   Final Input: Don't bother, unless you want quick achievements. in terms of those 3 that i've listed above.",
            "review_score": "-1"
        }
    ]
}