{
    "app_id": 539720,
    "name": "Razortron 2000",
    "release_date": "2016-10-12",
    "developer": [
        "NukGames"
    ],
    "publisher": [
        "NukGames"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Casual",
        "Indie",
        "Racing"
    ],
    "tags": [
        "Casual",
        "Racing",
        "Indie"
    ],
    "achievements": 9,
    "positive_ratings": 578,
    "negative_ratings": 84,
    "price": 0.79,
    "description": "RAZORTRON 2000 is a top down endless racer. Turn on your radio, try to beat your score by runnig as fast as you can on randomly generated tracks before running out of gas, avoiding cars and side barriers.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/539720/header.jpg?t=1553198846",
    "minimum_requirements": "OS: Microsoft速 Windows速 XP or later Processor: Dual Core 2.0 GHZ or Better Memory: 512 MB RAM Graphics: Compatible with DirectX 9 DirectX: Version 9.0 Storage: 100 MB available space",
    "recommended_requirements": "OS: Microsoft速 Windows速 7 or later Processor: Dual Core 3.0 GHZ or higher Memory: 2 GB RAM Graphics: Compatible with DirectX 9 or later DirectX: Version 9.0 Storage: 100 MB available space",
    "reviews": [
        {
            "review_text": "Update: Devs made a stealth patch (unannounced) and the top scrolling speed was slowed down to give players a full second to react to finding fuel stations. Makes it truer to being a casual high score racing game as advertised and actually fun to play. Still has low replay value, but it is worth buying for the soundtrack alone, now that it is included at the base price.  Original Review: It's more of a rage game than casual. Imagine going at the speed of sound and seeing enough of the screen ahead of you to make a 0.3 second reaction. The fuel is a timer, not measured off speed which isn't a bad thing, just something to be weary of considering the gas stations aren't frequent and they can sometimes spawn in areas the player can't reach. Combined with the short reaction time, the gas stations are frequent panic attacks than sighs of relief.  It does fit the bill as a simple racing game and mimics arcade classics, so it isn't terrible. It isn't good and due to not needing much skill to do well in it, lowers the replay value by quite a bit.  For Achievement Hunters only: 3/10",
            "review_score": "1"
        },
        {
            "review_text": "exelent game for a cheep price",
            "review_score": "1"
        }
    ]
}