{
    "app_id": 540510,
    "name": "ISLANDS: Non-Places",
    "release_date": "2016-11-17",
    "developer": [
        "Carl Burton"
    ],
    "publisher": [
        "Carlburton Llc"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Casual",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Casual",
        "Surreal"
    ],
    "achievements": 0,
    "positive_ratings": 226,
    "negative_ratings": 46,
    "price": 3.99,
    "description": "The familiar becomes magical in this critically acclaimed interactive artscape. Explore ten scenes inspired by the everyday and let your expectations of reality be transformed. Carl Burton's other work has been featured in the New York Times, Serial, Colossal, and Medium.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/540510/header.jpg?t=1497295669",
    "minimum_requirements": "OS: Windows 7+ Processor: 1.7 GHz Memory: 4 GB RAM Storage: 250 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Short but relaxing game that makes you feel like you're stuck in someone else's dream. You're clicking around on random things to progress each sequence but you're not sure why. It's definitely not for everyone, in particular if you're obsessed with dollar per hour gameplay and replayability. Personally I thought the 50min was worth the 4 bucks.",
            "review_score": "1"
        },
        {
            "review_text": "ISLANDS presents a number of fictional places in the same kind of 'magical realism' you can find in the superb Kentucky Route Zero, but doesn't add a story -- it just lets you explore on your own. 45 minutes well spent.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful. A refreshing and intelligent use of this software. This is not so much a game as it is an interactive art piece. Great sound work as well.",
            "review_score": "1"
        },
        {
            "review_text": "Hm. A 'game' where you look at pretty colors and click lights. Felt like there was supposed to be more to it, came away feeling like I wasted $4, really. Like I should have been stoned to enjoy what little it had to offer.  Watching a playthrough on Youtube with a calming voice would have been more worth my time. I don't really recommend this unless you like pretty colors and weird, useless ♥♥♥♥.",
            "review_score": "-1"
        }
    ]
}