{
    "app_id": 542340,
    "name": "Slingshot people",
    "release_date": "2016-10-21",
    "developer": [
        "StalkerAlex"
    ],
    "publisher": [
        "StalkerAlex."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Stats",
        "Commentary available"
    ],
    "genres": [
        "Action",
        "Casual",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Action",
        "Indie",
        "Simulation"
    ],
    "achievements": 0,
    "positive_ratings": 593,
    "negative_ratings": 689,
    "price": 0.79,
    "description": "It's fun to shoot people with a slingshot, but beware, they are armed and dangerous!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/542340/header.jpg?t=1548606807",
    "minimum_requirements": "OS: Windows XP/Windows Vista/Windows 7/Windows 10 Processor: Intel Core i3 Memory: 2 GB RAM Graphics: 1 GB DirectX: Version 10 Storage: 2 GB available space",
    "recommended_requirements": "OS: Windows XP/Windows Vista/Windows 7/Windows 10 Processor: Intel Core i5 Memory: 4 GB RAM Graphics: 2  GB DirectX: Version 10 Storage: 2 GB available space",
    "reviews": [
        {
            "review_text": "The best 22 Minutes of my life! pros: +great visuals +amazing soundtrack +after a few minutes you forget that you play at 18fps +there are cobwebs with moving spiders  cons: -to cheap  Would buy again!",
            "review_score": "1"
        },
        {
            "review_text": "Even though it may cost only one dollar...I still in good faith cannot recommend such a game. For starters, there is no objectives. None at all. All you do for the duration of the game is fire a slingshot, or gun, out of a window at poorly modeled characters, that look like rejects from the original Counterstrike.  If you take any damage, regardless of how severe, you will hear a very loud heartbeat, which will not cease until you either heal up to full, or die. This annoying feature was in Elves Adventure, and it was just as bad in that game. The game is glitchy and enemies clip through walls as they run towards you, if they even bother to move at all. Most of the time they just stand there, even after getting hit by a rock, they just stand there. Unbelievably bad enemy A.I.  With really bad games like Kimulator: fight for your destiny or Elves Adventure, at least they are entertaining, cringey, and good for a laugh, but that is not the case here. Nothing redeemable can be found in this title. No thought or planning was put into it. Level design is not existent. Would not be surprised if it was just a map from an asset pack, since it appears as if no effort went into it's creation. It has all the hallmarks of a cash-grab. Would not advice a purchase.          YouTube™ Video:  Slingshot people...Gets Toasty&nbsp;",
            "review_score": "-1"
        }
    ]
}