{
    "app_id": 542780,
    "name": "Drift GEAR Racing Free",
    "release_date": "2016-10-21",
    "developer": [
        "Rock Crow"
    ],
    "publisher": [
        "Rock Crow"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Free to Play",
        "Indie",
        "Racing",
        "Sports"
    ],
    "tags": [
        "Free to Play",
        "Racing",
        "Indie"
    ],
    "achievements": 0,
    "positive_ratings": 45,
    "negative_ratings": 112,
    "price": 0.0,
    "description": "Drifting experience with online leaderboard.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/542780/header.jpg?t=1477034801",
    "minimum_requirements": "OS: Windows XP SP2+ Processor: SSE2 instruction set support. Memory: 512 MB RAM DirectX: Version 9.0c Network: Broadband Internet connection Storage: 100 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I'm glad that I couldn't even pay a dime for this! As a mobile game doesn't mean that Steam gamers need it! Stay on mobile. - The physics are laughable - Same for difficulty, doesn't change anything - The graphics almost good, almost...(I have low requirements, playing Minecraft)...Just too 'sterile'. Fill it with life!  - pls, do not use depth of field that heavy!  - I have a PC way over the requirements, and the whole game is LAGGING! - 3 cars (+lots for teasing to play) and 1 track?... - What's with the gearbox and the engine sound? - Challenges are lie - Calcing drift points AFTER every crash? Is supposed to work like that?  The only positive thing is: takes only 75mb disk space  Check out Drift Streets Japan (or JUR Japan Underground Racing), or if you can, Need for Speed Underground 2! Or GRID2 have Drift pack! But stay away from this! Unless after a huge revamp!  10/10 i would dra...drift again",
            "review_score": "-1"
        },
        {
            "review_text": "This should remain on mobile version. The gameplay sucks.",
            "review_score": "-1"
        },
        {
            "review_text": "its the worst game iv ever played on steam its just ♥♥♥♥",
            "review_score": "-1"
        }
    ]
}