{
    "app_id": 543980,
    "name": "Zombie Exodus: Safe Haven",
    "release_date": "2016-10-28",
    "developer": [
        "Hosted Games"
    ],
    "publisher": [
        "Hosted Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Captions available",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Adventure",
        "Indie"
    ],
    "achievements": 40,
    "positive_ratings": 81,
    "negative_ratings": 10,
    "price": 3.99,
    "description": "Zombies rise again at the dawn of Apocalypse! In this companion to the smash-hit Zombie Exodus, can you survive the early days of society's collapse?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/543980/header.jpg?t=1538627422",
    "minimum_requirements": "OS: Windows 7",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "10/10 Waiting for part 2",
            "review_score": "1"
        },
        {
            "review_text": "Zombie Exodus was quite enjoyable, so imagine my excitement when I learned about Zombie Exodus: Safe Haven.  Without mentioning any spoilers, if you played the demo, you know exactly what to expect. Zombie Exodus: Safe Haven ends very close to the ending of the demo. That being said, it was worth reading the end to that scenario. I must admit the last demo I played was not the last revealed one, so I can't say anything based on those changes, but from what I did play, it was interesting to see the differences in drafts. I was able to prevent different events from happening, and while I'm not sure if this was just due to me playing awfully beforehand, I'm going to write it up as an improvement done by Dattilo.  For those who did not play the demo, Zombie Exodus: Safe Haven is good. It's a Choice of Games/Hosted Games story, meaning this isn't really a, 'game.' It's a novel where you are able to make choices for the main character. No visuals, no sound. For someone who needs high visual or auditory stimulation to enjoy something, this definitely is not for you.  It's worth mentioning that this game is short compared to its predecessor, Zombie Exodus, but it is worth mentioning that this is only part one of the story. The story is creative and the different options that range from occupation, living factors, etc. are fun to test out for different results.  I'd highly recommend this, as well as Zombie Exodus, as they are fine editions to the Choice of Games/Hosted Games selection. Dattilo has done a fine job in writing these and I am happy to support his work.  tl;dr Short but great read.",
            "review_score": "1"
        },
        {
            "review_text": "Loved Zombie Exodus and it was the Gateway game that got me into COGs. The game does have some bugs and is a what I can best describe as a slow start. -Cons- -Skill system locks you into just your prime and secondary skills when you try to start game with extra starting skills.(as lots of others have touched on. I have talked to to the email support and good news there is a patch. Bad news its just not updated on steam yet. Mary who I talked to did say it should be fixed soon tho so here's hoping. -The game is linear. While you can choice between several different characters that only effects intro.(I do think in later parts it will play a huge part but as far as the this game goes bit of a let down.) Its not the worst thing ever but does get repetitive after several play throughs. This is the starting point though and the game has to start somewhere so in the end it is understandable. -Pros- -Everything else  I say that but I'm not really kidding -the story and the writing is great. You can feel that the plot is leading you to something epic and the journey is just getting started. -the NPC are written wonderfully and feel real. The interactions feel life like and the choice they make can shock you as well as play right into what you expect from them. I love the diversity so far. -Romance in the the apocalypse? Please and thank you. It might seem odd to think about dating while zombies are trying to eat you but when the world is ending you find comfort where you can. I've always loved loved loved this aspect in games and ZESH it looks like is setting up to be might impressive in the area. I can see spending way to many hours of my life playing with this mechanic and loving every one of them. So many choices and I will find them all. -skill system is flexible. When they get it working you will be able to be any type of person you wont really. Be a soldier with great weapon training or a hacker thats terrified and allergic to everything.  -Extra bonuses for beating Zombie Exodus was a nice touch as well. You can buy another 25 extra starting skill points for .99 which while I usually hate dlc I'm dealing with this one.  Overall its a great game with a lot more to come. I'm looking forward to the next and the next and the all the parts of the game. This game is very much worth a look as well as his other Zombie Exodus one. If you've never tried one before give this one a try.  -Personal Note- I would love to see a God mode at the end of the game or something. After completing the game say 5, 10 or even 20 times. You can start the game over with the Char's stat's you finished the game with. New game plus but with hopefully near maxed stats. Then you can play through and just see what would happen with the higher stats. Not something you'd have to use if you want to play normally but a gift for completing the game so many times. Would be nice and spice the game back up after putting in what at that point would have to be 100's of hrs.",
            "review_score": "1"
        },
        {
            "review_text": "Though this was only part 1 thus isnt finished, I have to say that this was my favorite Choose your own adventure game so far. There is more sense of freedom of choice in this one. You can put defenses up for your home, be a good, bad guy or something in between. All choices impact the story.",
            "review_score": "1"
        }
    ]
}