{
    "app_id": 547590,
    "name": "Pinball FX2 VR",
    "release_date": "2016-11-29",
    "developer": [
        "Zen Studios"
    ],
    "publisher": [
        "Zen Studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Simulation"
    ],
    "tags": [
        "Simulation",
        "VR",
        "Pinball"
    ],
    "achievements": 36,
    "positive_ratings": 166,
    "negative_ratings": 30,
    "price": 10.99,
    "description": "Creating a brand new way to play pinball that deftly combines the look and feel of digital pinball with the sensation of a real-world experience, Pinball FX2 VR is the premiere place for pinball action in VR!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/547590/header.jpg?t=1530266738",
    "minimum_requirements": "OS: Windows 7 Processor: Intel i5-4590 or AMD equivalent Memory: 6 GB RAM Graphics: NVIDIA GTX 970 / AMD 290X DirectX: Version 9.0 Storage: 900 MB available space Sound Card: DirectX compatible sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "All i can say is wow give me more more more now now now!!!! I originally purchased this game for oculus home and was absolutely blown away by the 3 release tables which were honestly probably 3 of my least favorite pinfx2 tables, VR is amazing tho and so i gave them a chance and they quickly became 3 of my favorites, same with the season 1 dlc, I love the iron and steel pack but wasnt much of a fan of the other 3, but now both biolab and alien invasion are amongst my favs, paranormal is so-so imo but whatever its also alot of fun, at first like many other people i assumed this to be a way to get people to repurchase tables for 2x the price but soon after playing i found myself willing to buy every single pinfx2 table released in VR, and just when i thought it was already top notch it got released here on steam and there is a slew of improvements in the visual quality and i can now run the game at its highest resolution at 90 fps with 8x AA which was impossible for me when running the game on oculus home, this game is a huge win for virtual pinball, zaccaria has also done a great job with their vr support!!  What gives farsight studios??? TPA was first to announce oculus support almost a year ago, now here we are Zen Studios has done an outstanding job as has magic pixel with with the zaccaria VR support!! and still TPA has NOTHING but a bad mockery of the potential VR has, looks like TPA drained the ball on this one, hopefully you guys get something done over there because the ps4 stern app plays like a crappy android port and as one of your biggest fans i cant imagine anyone else is exactly happy with your lackluster efforts, VR should have been top priority if you guys were actually going to be true to your mission statement!",
            "review_score": "1"
        },
        {
            "review_text": "Feels like playing real pinball machines. VR brings a whole new, and amazing immersion to pinball games.  It doesn't feel like playing a pinball video game, it truly feels like playing real pinball. Wow.  My favourite VR purchases so far. Highly recommended for anybody with VR who enjoys (or might enjoy) pinball.    I used to own a real pinball, and now have a custom cocktail arcade machine (with pinball controls on the side) that plays the regular version of FX2. That is very good, but this simply blows it away. The 'pinball arcade machine' is a great pinball video game.,,, but this truly feels like owning and playing REAL pinball machines. Amazing.   Cons? I've heard that some people have problems with fps. I haven't, so can't really comment on that. I'm running a 1070, which seems to do fine. There isn't an option to turn off the animated backgrounds while playing (at least I don't think there is) - the devs may want to consider that - a bit less atmospheric immersion, but likely better frame rates.  My only other (possible) issue, is that the 3 games that come with the base game seem too easy. Part of the joy of pinball is to 'learn' the table... that used to take many (many) quarters. My very 1st game of Epic Quest took about 30 minutes, and put me in 2nd place overall on the leaderboard (I know it's early, but still). After that, I'm not sure how much I want to keep playing EQ, if it going to take that long each time. Pinball should take a few minutes and only 30 once you become a 'pro'. Maybe I just go really lucky, and the other 2 tables do seem better. I'd love to see some real world tabes, or some more of the licensed DLC (the Star Wars tables, please :-)    3 games included in the base game, for the quality and price... no issues. Day 1 DLC? I think that's fine for this type of experience (you're paying for 3, and can buy more if you like. It doesn't take away from the experience of the 3). It would be nice if there was a single table free demo, but Steam return policy makes it easy to try without risk.  I thought I was going to enjoy FX2 in VR, but it is much better than I expected. I will be building a custom standup 'pinball machine front', with buttons on the side, to make the experience even more real.  AMAZING VR pinball experience! Love it!!!!     ",
            "review_score": "1"
        },
        {
            "review_text": "You can't change the view so I guess they want it to feel like you're playing a real (and most amazing) pinball machine.  I use an Xbox controller. I sit down get comfortable. Hold my HMD exactly arms length above my head, reaching for the ceiling. Press X on the controller to reset the view.  Put the HMD back on and it's like you're inside of the pinball machine. (or using view 5 or 6) And you're looking UP for the mostpart with less strain on your neck. And I can get highscores for LONG periods of time. NOT STANDING and feeling like crap. Take my advice or suffice.  I get close and the ball looks a little small. So I IMAGINE a way to SCALE EVERYTHING UP a little bit bigger. Or make the table the size of my YARD!!!  I saw Bio Lab and Earth Defense and said to myself, It's a must-have!  I'm probably one of the biggest Pinball FX2 fans out here. I owned most of the tables on Xbox 360 and a bunch on PC. The Xbox 360 version had Multiplayer AND Split-Screen! PC had NEITHER!!! Huge downfall. But now I see. We have VR now, those guys don't.  Pinball FX always had really detailed tables. You would DREAM to own these tables or even an arcade. I wish a bar had amazing tables like these. If real life pinball wizards don't like Pinball FX it's because the tables make their favorite RL tables look like carboard boxes. NOW in VR you can see ALL the details that most newcomers wouldn't even notice. Now EVERYBODY sees why I like this game so much.  I also notice that little knob on the right side of the VIVE that changes your eye distance. Puting it to the LOWEST (61mm i think) and really close objects are SHARP. I used to think 67-69mm was good, but it's not.  I remember back when I bought an HD LED projector and pointed it 90' on my wall. First game I played was Pinball FX2. My friends thought it was crazy, of ALL GAMES, I was playing a Pinball game on the new projector!  I have a GTX 980 so the best I can run this game is HIGH textures @ 2X MSAA (sadly, I can't handle Ultra. Which looks amazing) This game does have 8X MSAA so there is no need for SS.  Final Thought: Obviously love it. I think alot of people that have never played Pinball FX2, this is the time man. What the hell are you waiting for? Can't wait to see what tables make it into Season 2. BUT I WISH we had an option to upscale everything!",
            "review_score": "1"
        },
        {
            "review_text": "So, the key thing to remember here is that the game comes out to about $5 a table.  All the tables are OK, but the knight quest one I think is the best of the bunch. They did an excellent job with the VR and the controls are pretty good. It is a quality game.  No complaints, I'll pick up the other tables when they are on sale.",
            "review_score": "1"
        }
    ]
}