{
    "app_id": 55040,
    "name": "Atom Zombie Smasher",
    "release_date": "2011-03-14",
    "developer": [
        "Blendo Games"
    ],
    "publisher": [
        "Blendo Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Partial Controller Support",
        "Stats"
    ],
    "genres": [
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Zombies",
        "Indie"
    ],
    "achievements": 41,
    "positive_ratings": 1397,
    "negative_ratings": 180,
    "price": 6.99,
    "description": "The zombie apocalypse is upon us and it's up to you to evacuate everyone before they fall prey to the undead. Conduct massive rescue operations with a helping hand from snipers, artillery crews, orbital bombardments, and more.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/55040/header.jpg?t=1539701724",
    "minimum_requirements": "OS: Windows XP/Vista/7 Processor: 1GHz Memory: 512MB Hard Disk Space: 60MB Video Card: 60MB OpenGL-compatible Optional: Gamepad or Joystick required for multiplayer",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This game is very fun, but bug support is basically non-existant. Errors direct players to the blendogames forum that no longer exists.",
            "review_score": "-1"
        },
        {
            "review_text": "It simply doesn't work",
            "review_score": "-1"
        },
        {
            "review_text": "There are weaponized Llamas in this game. Go get it, boy.",
            "review_score": "1"
        },
        {
            "review_text": "Hard to review a game that wont start",
            "review_score": "-1"
        },
        {
            "review_text": "I just reinstalled this game and I have to say that I forgot how fun it is. AZS is a strange amalgam of tower defense, zombie horde killing, and a puzzle game. You manage a variety of mercenaries to control a zombie outbreak while rescuing civilians. When things take a turn for the worse you can call in the Catbird Cannon and the trusty Llama Bombs to eradicate entire city blocks and the zeds they contain. AZS never takes itself too seriously and that's probably my favorite thing about it. The soundtrack is amazing, the game is super cheap, and I can't reccommend it enough.",
            "review_score": "1"
        },
        {
            "review_text": "Great indie game! And now it's finally working again!!! ",
            "review_score": "1"
        },
        {
            "review_text": "So, I saw the screen shots... Thought it looked pretty meh. So I bought it! And I did not regret that. Game is pretty darn fun for the cost.",
            "review_score": "1"
        },
        {
            "review_text": "So in this game, you are defending a country from zombies...I think? Or maybe it has to do with politics. It's a game where the basics revolve around saving civilians and stopping zombies from overwhelming parts of the map (each is its own specific encounter). Interwoven in this gameplay is a borderline incomprehensible plot involving llama-bombs and all sorts of madness. A cool game to try out for a weird experience.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. Zombie apocalypse game from the government's point of view, roughly. Try to save as many civilians as you can with randomized cities and your random selection of units. Get some really tense moments when the zombies are closing in on your landing zone and the helicopter is flying in. Incoherant story and silly name, but ♥♥♥♥ it. Great game.",
            "review_score": "1"
        },
        {
            "review_text": "Atom Zombie Smasher is fast fun and stylistic game about zambies.What can i say more?Well....nothing.7/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is an awesome mix of RTS and Tower Defense genres, and it''s always entertaining to see what's going to happen in the next stage.",
            "review_score": "1"
        },
        {
            "review_text": "They've patched the game and it now runs perfectly on Windows 10. It's still a blast, one of my favorite zombie themed games. Surprisingly immersive, too.  I recommend starting a new game immediately so that you can set options like casual/hardcore, different victory conditions, and, vitally, the ability to select your own mercenaries each round.",
            "review_score": "1"
        },
        {
            "review_text": "A surprisingly entertaining take on the zombie apocalypse. Fast-paced strategy with almost laughable graphics. In the end, a perfect combination that kept me coming back and engrossed enough to finish it.",
            "review_score": "1"
        },
        {
            "review_text": "it is like uncle attracted to strange corners of house",
            "review_score": "1"
        },
        {
            "review_text": "Look Gubo, behind those trees! ...ZOMBIES!",
            "review_score": "1"
        },
        {
            "review_text": "This is a game that you can run on a ♥♥♥♥♥♥ laptop. what makes it better is the amount of fun it is to play. A race agasint the clock to save as many people from the invading Zeds. Its a tactical game and does require some brain power at times but my God it can fill time. i have racked up hours of play on this and the mods add even more depth to a game that can be as long as you want.",
            "review_score": "1"
        },
        {
            "review_text": "You save one color dots from the other color dots. A pretty fun slightly addictive game. It has different play modes so there is quite a bit of replayability. Great to get if you find it on sale!",
            "review_score": "1"
        },
        {
            "review_text": "He talked to his mother. Moments later, he was eaten alive. But the area was bombrunned with Llamas. And Elephantbirds. That should teach him a lesson. / 10 ★  Pros: -Black humour -Simple, clear and nice idea -Zed &amp; MegaZed -Easy script/mod system Cons: -Too repetitive",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game! Definitely worth anything less than $20.",
            "review_score": "1"
        },
        {
            "review_text": "It's great. Feels good on my mutated ♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "Probably a cool game. I played it at work a few times, much enjoyed it. I can't believe it only took like 90 mins to beat. Kind of made my life feel really unfulfilled from that point on. This game changed me, not in a good way.",
            "review_score": "1"
        },
        {
            "review_text": "Love this game!",
            "review_score": "1"
        },
        {
            "review_text": "Funny game for killing time. There is also a nice feature if you have two additional controllers because you can play with two other ppl on one pc.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most unique and interesting game i play for awhile.",
            "review_score": "1"
        },
        {
            "review_text": "I could not suggest this game more. Interesting gameplay, silly story line and zombies.",
            "review_score": "1"
        },
        {
            "review_text": "ok but i got bored after a few plays probably should be free",
            "review_score": "-1"
        },
        {
            "review_text": "A very enjoyable tactical game, The main goal is to gather enough points from saving X number of people in cities that has a outbreak as well as this you can also hire mercs to combat the zombies as simple as it sounds it isn't since over time you get more than one outbreak at a time and for every victem of the zombie equals a point towards them.  as i said at first this game is very enjoyable in a tactical view, those who don't like planning and thinking ahead in their games should avoid this, But those who love taking tactical decision or deciding wether to save as many civvies or combat the zombies off the area fully to capture that city, will enjoy this game.  Not only is it a Indie game, it also a cheap and easily modable game.",
            "review_score": "1"
        },
        {
            "review_text": "Pointless rouge-like with no progression where you set your own rules and difficulty.",
            "review_score": "-1"
        },
        {
            "review_text": "In short: What you won't found here is pretty graphics or voice acting or deep story. Also it does have steep learning curve and ♥♥♥♥♥♥♥♥ AI for the civilians that will run into the zombies in an attempt to run from them(WTF). For some reason they run to their death faster than they run to their rescue. On the plus side: it's a sorta-roguelike, real time tactics (with planning phase just before the onslaught begins) funny game with minimalistic graphics about surviving a zombie infestation. Also HIGHLY MODDABLE which is great.  The intersting mechanics: each side has it own milestones to achieve and the first side to reach the goal points wins. Some encounters are more defensive (rescue and not really returning fire) and some are all about destroying the other side. It depends on the resources at hand (mostly available mercs), the encounter modifier, the current situation and of course on the player itself.  Can't say I'd recommend it to everyone but for 3$ (when on sale) is at least worth checking out. If the trailer for the game doesn't scare you and you like moddable roguelikes (= high replayability) it is well worth the 10$.",
            "review_score": "1"
        },
        {
            "review_text": "played this when it first came out and it was on sale during the very first summer sale. It was fun and it was great it was a tower like defense sort of game with zombies. Now I try to play it and i get an error and Im to lazy to find a fan fix for it(its there but the devs should have fixed it about a year or so ago)",
            "review_score": "-1"
        },
        {
            "review_text": "The game is a okay game, but mainly it's hard to win at times.",
            "review_score": "1"
        },
        {
            "review_text": "This game is tons of fun, but it won't last more than a couple of hours.",
            "review_score": "1"
        },
        {
            "review_text": "It is a fun game but much like another Blendo's game, there are some compatibility issues. It is a great strategy game overall. You need to evacuate people and have many options to use against the zombies.",
            "review_score": "-1"
        },
        {
            "review_text": "Played dozens of hours of this game. Loved it. Would love to play it again. Haven't been able to boot it in years. Seems there are tons of people who are experiencing the same issue. Downvote",
            "review_score": "-1"
        },
        {
            "review_text": "I couldn't even play this game for an entire hour. Maybe the coop has some redeeming qualities. Not going to take that chance though.",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty good strategy game, Buy it because I said so :3c",
            "review_score": "1"
        },
        {
            "review_text": "I have no idea how to play this game. I'm constantly losing and I feel like I have no control over gameplay. It's frustrating watching people (yellow cubes) turning into zombies (purple cubes), meanwhile you can't do anything. Plot is awful, jokes are weak... Oh man, I hate this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty boring.",
            "review_score": "1"
        },
        {
            "review_text": "World's most pixilated zombies.  10/10 would buy again.",
            "review_score": "1"
        },
        {
            "review_text": "Super fun. It's sorta like a board game for a single player, with a city-evacuation mini-game nested inside it. Despite simplicity of gameplay and graphics, its a lot of fun and requires some pretty deep strategy to save the day. I'd recommend for anyone who appreciates strategy games.",
            "review_score": "1"
        },
        {
            "review_text": "Buy it without hesitation.",
            "review_score": "1"
        },
        {
            "review_text": "A basic but challenging zombie smashing game.",
            "review_score": "1"
        },
        {
            "review_text": "This game gets really difficult; if you are behind in the first couple rounds, you will never catch back up. Also, the game is pretty boring, as it all feels the same. I do not really care for this game, so I would recommend downloading the demo before you decide to pick this up or not.",
            "review_score": "-1"
        },
        {
            "review_text": "Nice and simple RTS. So simple you could call it a Tower Defence game. Still, I see it as an RTS, and that's why I like it.",
            "review_score": "1"
        },
        {
            "review_text": "Llama bombs and surf guitar work so well together.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun, fairly laid-back, often very funny game with lots (LOTS) of options to tailor the gameplay to exactly what you want.",
            "review_score": "1"
        },
        {
            "review_text": "I checked this out thinking, humm, what is this here zombie game. Now, 5 hours later, my bottom hurts from sitting for so long.  I'll probably never go back to the game, but that long campaign was good fun.",
            "review_score": "1"
        },
        {
            "review_text": "Neat little game and not your typical zombie game. Great way to kill time.",
            "review_score": "1"
        },
        {
            "review_text": "Ok game, would've prefered it on an iPad or something.",
            "review_score": "1"
        },
        {
            "review_text": "Definately worth it for the price. Hours of fun",
            "review_score": "1"
        },
        {
            "review_text": "AZS is a great indie game in the tradition of minimalist game going for maximal gameplay. Start off with just a chopper trying to recuse civilians from zombies and slowly build up your roster and level up your units. As the game progresses the zombies become more numerous and harder to control until you need to resort to the ultimate Llama bombs! Great replay value, moddable and fun you can kill 5 minutes or 50 with equal ease. Great fun!",
            "review_score": "1"
        },
        {
            "review_text": "Just a fantastic RTS, you're in for a challenge.  Bombing a city to dust has never been so fun.  Pros: + Alot of replayability + Kickin' soundtrack + Beautiful Style + Excellent time waster + Genocide  Cons: - May get a little difficult - Your ears might start to bleed from the bombs and screams   Not a game for filthy casuals who can't take a beating every now and then.  Overall 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Quirky and addictive with absolutely wonderful art direction.",
            "review_score": "1"
        },
        {
            "review_text": "Such a simple and fun game, definitely a must-try.",
            "review_score": "1"
        },
        {
            "review_text": "This bizzare real-time strategy gem, is absolutely the best casual game available on Steam. Extremely flexible game play, difficulty can be set from easy to impossible with many gameplay variables. Tons of replayability. Frantic, twich-worthy real-time action. The best $10 I ever spent on a game.",
            "review_score": "1"
        },
        {
            "review_text": "Nice indie game. Worth the price.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting and addictive little title. More for casual gamers of the zombie style game play.  Gameplay: 7.5/10 GFX: 6/10 Sound: 7.5/10 Replay: 7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "This a abrilliant indie game. Not easy but provides plenty of challange and replay value. It has a great soundtrack and quirky vignettes added throughout. definitely worthwhile.",
            "review_score": "1"
        },
        {
            "review_text": "Everyone should check this game out. I has a great soundtrack.",
            "review_score": "1"
        },
        {
            "review_text": "I've never had so much fun with pixels!",
            "review_score": "1"
        },
        {
            "review_text": "Its kind of like a tower defense game but without towers and instead of preventing enemies from getting to one point you're trying to prevent a hoard of zombies from converting city survivors into fellow zombies. You use a helicopter to round up nearby survivors and evacate them while you're mercs hold off the zombies. Not all mercs are purely combative though. You have infantry, snipers, and artillery but there are other units like the zombie bait or barricades that don't kill the zombies but rather slow them down. They can also level up and you can select permenant upgrades for them. This game has a uniquie art style and music and although the gameplay graphics are simplistic (purple boxes = zombies, yellow boxes = survivors) it's somewhat charming.  Overall, its a fun strategy game with a zombie twist which is rare.",
            "review_score": "1"
        },
        {
            "review_text": "Never wondered what happen when you mix a full scale zombie invasion and dozen of tactical bombs and mercenaries ?   well...let say it's a bit...messy.",
            "review_score": "1"
        },
        {
            "review_text": "A very light RTS style game where you strategically place randomly selected units such as Snipers or Barricades to protect your helicopters landing zone. You have a minimum amount of people to rescue on each level and anyone touched by a zombie instantly becomes one themselves. This can prove disastrous when you have the majority of the people on the map waiting at your landing zone and a lone zombie comes in and converts the entire lot of them. This really makes you plan your unit placement very carefully, which is really the core gameplay. After the match starts there’s usually not all that much to do but watch, save for a few actions such as changing your landing zone location or redirecting your snipers cover area.  I was surprised by how much I enjoyed this game, this is not even a genre I would consider my favorite. There are quite a few game modes to choose from but I found the game to be very easy if you opt to be able to pick which units you use every match. I found being forced to come up with new strategies when the units were selected randomly to really be the main challenge and fun of the game.  -Playtime- The game is a lot of fun for a fairly short amount of time. While you can play as many campaigns as you want with varying game modes, the core gameplay doesn’t really change much and the game will probably wear out its welcome after about 10-15 hours.  -Achievements- Nothing that different from what you would do during normal gameplay, most are just accumulative achievements. Luring massive hordes with Bait into waiting Dynamite for its kill achievement was fun though. 100% becomes a grind for the 500 Gold Medals, once you have Artillery built up a matches can take less than a minute each but it's still a grind.  Recommended on sale.",
            "review_score": "1"
        },
        {
            "review_text": "I keep coming back to this game. It never gets old. Want more of a challenge? Take away some of your offensive units. Allow for zombie spawns at the center of the city. The point is, you can't go wrong with how replayable this game is for the money. And can we talk about how a soundtrack and sound effects compliment a game to make it that much better? &lt;chef-style&gt; Muah!",
            "review_score": "1"
        },
        {
            "review_text": "Thank goodness this game is playable again, It's a fun time waster where you try to take over infected areas and try to win the zombies at their game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is intense and fun.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun Game cheap and hours of fun ",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME IS AWESOME",
            "review_score": "1"
        },
        {
            "review_text": "It is a pretty fun game, if it goes on sale I would pick it up, even if it doesn't its stills something that is fun.",
            "review_score": "1"
        },
        {
            "review_text": "Mind - it's been about four months since I last played this game. That noted, I highly recommend it, at least when it's on sale.  The game is fun, unique and has an interesting (if not limited) plot. It also has a fairly well developed interface and it can be challenging without being frustrating. It also has a lot of replay value.  Unfortunately, it can get repetitive and I feel that it could use more to 'do', as after a certain point you're just doing the same thing over and over with little to up the difficulty or change game play. It can also walk a fine line between 'way too short and easy' and 'tiringly long and boring', depending on what features you choose to enable or disable from the start. I've also begun to run into a few glitches (crashes), which make playing it challenging.  Still, it's fun and unique, and that makes it a good deal better than most of the content you find.  Over all: 7/10.",
            "review_score": "1"
        },
        {
            "review_text": "This game was recomended to me by my friend. Fun game, Quirky. Inexpensive. Great Soundtrack. Levels are quick. I would recommend this to anyone enjoys a fun nonsensical strategy game. And believe me there is strategy involved.",
            "review_score": "1"
        },
        {
            "review_text": "It's Good.",
            "review_score": "1"
        },
        {
            "review_text": "Hells yeah! I'll respect you less if you don't like this game!",
            "review_score": "1"
        },
        {
            "review_text": "is cool",
            "review_score": "1"
        },
        {
            "review_text": "This games is very fun and it never seems to get old every play is like a new game",
            "review_score": "1"
        },
        {
            "review_text": "I approve of this game",
            "review_score": "1"
        },
        {
            "review_text": "Nice little game. Great atmo despite sometimes simple graphics.  Die zombies!!!",
            "review_score": "1"
        },
        {
            "review_text": "Pretty much a 'Zombie Apokalypse simulator' make sure your helicopter saves a lot of people tell your troopes where to go to stop zombies, Or just Blast them back to hell with bombs.its fun. not the best or worst game ever. but it has its Charm.",
            "review_score": "1"
        },
        {
            "review_text": "A tough-as-nails game that's a lot easier and more fun in local co-op. Just beating the campaign is a big challenge.",
            "review_score": "1"
        },
        {
            "review_text": "This is a really fun game. I have no idea what the story is about, but the game is a riot.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game. It's the kind that you play for short stretches, replaying it endlessly.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting game it involves smashing zombies and saving civilians. different teams of government units set of snipers, artillery etc.  The price is a bit steep for what you get in terms of game mechanics, but I guess people gotta eat. :P  As the game goes on the urgency and peril as more and more sections getting infested and it's your job to try and clear out zones before they get to a point of no return where the whole map gets overwhelmed. ",
            "review_score": "1"
        },
        {
            "review_text": "Get ready and prove your tactic abilities! Great fun.",
            "review_score": "1"
        },
        {
            "review_text": "Played on OS X (Macbook Pro 2011 15'), the game ran great and did not have any bugs that I encountered.  One of my favorite tower defense style games - the element of managining the saving of citizens while killing the zombies added enough complexity and strategy to keep me interested. I also enojoyed the game board mechanic of choosing which areas on a location board you need to control in order to contain outbreaks.  I highly recommend this game if you are interested in twists on the tower defense genre.",
            "review_score": "1"
        },
        {
            "review_text": "Zombies. You might have heard of them. If not, then this game might will not depict graphic images of them, but instead they are represented my pink dots. Lots of them. A refreshing real time strategy game with a simple premise of rescuing as many of the non zombified citizens of a fictional and surreal world. Part pre-plan, part twitch reaction, this game is punishing to those that lose their cool, and pretty satisfying for those that can keep back the zombie plague for just a little bit longer. With unlockable power-ups and aids as you progress, the seemingly ever-present orbital laser beam in tower-defence games is replaced by the innocuously named Llama Bomb. The random naming method in the game fits well into the weird twisted world created by Brendon Chung and his Company Blendo Games.  N.B As an indie developer (being pretty helpful), they have given users the ability to mod the game, and an easy way to insert your own cut-scene comics to make the game your own. Nice. :)",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good hot seat fun!",
            "review_score": "1"
        },
        {
            "review_text": "A very nice little indie game, but difficult. Don't underestimate it!",
            "review_score": "1"
        },
        {
            "review_text": "It's fun, you get to destroy zombies, set in the 60s. Awesome.",
            "review_score": "1"
        },
        {
            "review_text": "Quit an interesting little game, hours of fun if you don't mind the lack of any real graphics ;0).",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely briliant little game! Well worth the purchase. It is the type of game where you can simply play for 10-15 minutes and be happy with that or easily waste 2-3 hours smashing out a long campaign. Very well made.  Quite a nice selection of Mercenary Units to defend cities with. Large easy to use menus and maps make the game simple yet challenging. User made mods to spice up the game play when Vanilla gets old.  8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Interesting, fun, and difficult. Well, difficult for me. I'm not the brightest lol. But it is a neat game. Fun to plan out your placement of units, modify on the run, do challenges, etc.. If you think you'll like it, hopefully you will.",
            "review_score": "1"
        },
        {
            "review_text": "insanly stuipdly fun and the mods are great",
            "review_score": "1"
        },
        {
            "review_text": "So like theres zombies. and this game is like part zombie simulation part tower defense kinda, but not in the stupid 'oh tower defense' kinda way",
            "review_score": "1"
        },
        {
            "review_text": "Minimalistic zombie smashing fun. Regular price of $9.99 is worth it, but if it goes on sale then it's definitely a no-brainer to get it.",
            "review_score": "1"
        },
        {
            "review_text": "No words about this game. Simply a 10 out of 10.",
            "review_score": "1"
        },
        {
            "review_text": "This is a really cool game nerds!  ",
            "review_score": "1"
        },
        {
            "review_text": "It's fun for hours. It's funny, difficult and makes you use strategy to blast the ♥♥♥♥ out of the zombies!",
            "review_score": "1"
        },
        {
            "review_text": "Not just another zombie-killing game!  Taking out all the Zed by nightfall is highly satisfying. This game is solid, and it has a demo! TRY IT!",
            "review_score": "1"
        },
        {
            "review_text": "If you go by screen shots, the game doesn't look like much; but it is highly addictive and a ton of fun. I kept saying to myself, 'Just one more game...just one more.'",
            "review_score": "1"
        },
        {
            "review_text": "Pure fun. Compelling achievements, great gameplay thats both tactical AND tense action, and quirky almost non-sensical storytelling. Play the demo NOW. If you liked it at all, you'll probably LOVE AZS. Theres a bunch of replayability and features you get to play with past the demo time. What more could you ask for only $10?  Llama bombs forever!",
            "review_score": "1"
        },
        {
            "review_text": "Sadly it took the steam Christmas Achivements to get me to play this game. I had way more fun than I expected and look forward to playing it more. It can be a little unforgiving not letting you back out of an area, instead forcing you to 'concede' and lose a round with no progress (which cost me the whole campagin when I didn't realize there was nobody to rescue in the level 4 regoins and was stuck with nothing but explosive charges and mines) but overall really fantastic game. Worth buying and playing.",
            "review_score": "1"
        },
        {
            "review_text": "This game clearly gets its inspiration from board games, but utilizes the key features of a digital game. There's an interesting meta-game and incredibly fun gameplay. If you're a strategist, this game will draw you in. I'm constantly trying to make use of my limited resources in the most efficient way, although sometimes I must accept that casualties are to be had or that the city is lost.",
            "review_score": "1"
        },
        {
            "review_text": "Oh ♥♥♥♥, I was playing this for how long?!  God, I love the music in this game!",
            "review_score": "1"
        },
        {
            "review_text": "The art style and atmosphere are great, and the gameplay is surprisingly compelling. The play style is a mix between puzzle and strategy, with just the right balance between depth and simplicity. Give it a try! The videos don't do it justice.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty cool. A different(est) twist on TD. You're presented with a city block that is about to be attacked by zombies. Your task is to rescue the civilians and kill the zombies. As a bonus, if you kill all the zombies before nightfall, you automagically rescue all the remaining civilians and take control of the territory.  On the big map, it's a bit like Dune 2 or C&amp;C (original flavor). You choose which territory you evacuate this turn.  Overall, a good game. Not awesome, but quite fun. Difficult. Not hard to survive each map, but not easy to capture territory.  B-.",
            "review_score": "1"
        },
        {
            "review_text": "Fight the undead hordes to a surf guitar soundtrack!",
            "review_score": "1"
        },
        {
            "review_text": "Zaaambies here. and nukes. and guns. worth the dosh spent",
            "review_score": "1"
        },
        {
            "review_text": "Stupidly addictive way of killing pixels",
            "review_score": "1"
        },
        {
            "review_text": "The most fun i have had with 46mb in awhile.",
            "review_score": "1"
        },
        {
            "review_text": "The best way to describe this game? How about a Zombie apocolypse simulator through the militaries perspective. Tons of fun!! Now if someone would make this game multiplayer where people take control of the mercenaries...",
            "review_score": "1"
        },
        {
            "review_text": "First off, if you purchase this game DO NOT expect extensive graphics. I honetly believe this game could have been released on Atari(no offense to either). Now, this is an extremelly fun game to play. You can really rack up the hours. You can control the game speed(-/+). You get to unlock different weapons and military, you can then upgrade them to make them more efficiant. There are different lengths of games and you can savegame. I do enjoy it's play, and would recommend to friends.",
            "review_score": "1"
        },
        {
            "review_text": "The strategy in this game is pretty in depth. Placing the right assets is terribly important. I played this game with friends and we had a blast working together on it trying to take down the zombie invasion. Just be ready for a difficult game if you don't tweak the settings in your favor.",
            "review_score": "1"
        },
        {
            "review_text": "Great indie game for those who likes tactics and planning.",
            "review_score": "1"
        },
        {
            "review_text": "Fun, challenging little indie game. Love the controls and the SFX. The are is wonderful for what it.  Must buy if you are a true zombie smasher!",
            "review_score": "1"
        },
        {
            "review_text": "Atom Zombie Smasher is a my favorite Blendo Games title. It's a brilliant casual realtime strategy game that's tense, strategic, flexible, and most of all, a lot of fun. I've heard a few people describe it as 'tower defense', but that's really pigeon-holing it and doing a disservice to a new player's expectations. It's true that a large portion of the strategy is in controlling the flow of the enemy, but it's not nearly as deterministic and simple as that implies. Also there are no towers. The feel of the game is much more about thinking on your feet, and dealing with disasters as they're unfolding in real (or slowed down) time.  You can play any way you want by modifying the campaign settings, letting you restart levels at no cost for that perfectionist victory, or turning on permadeath and a variety of difficulty mods for more intense and less forgiving sessions.  The entire game takes place in the same universe as Brendon Chung's other tiles, including Gravity Bone, 30 Flights of Loving, and Flotilla. Chung's unique humor and sensibilities come through in the form of a large number of vignettes and background articles describing the characters in and around events of the game, and the whole experience is topped off with an amazing instrumental surf rock soundtrack by The Volcanics.",
            "review_score": "1"
        },
        {
            "review_text": "I see a lot of reviews for this game that rave about its difficulty and ingenuity, but at the end of the day it's dots killing dots. The default settings makes the game pretty hard, which is fine for a few rounds, but after a while you get tired of the same dots killing dots over and over, so you decide to try some mods. Then you see how easy it is to make a mod yourself. Then suddenly you got all the achievements.  7/10  ",
            "review_score": "1"
        },
        {
            "review_text": "This game is great fun. It's kind of like Left4Dead mixed with DEFCON.",
            "review_score": "1"
        },
        {
            "review_text": "Addictive till the end!",
            "review_score": "1"
        },
        {
            "review_text": "Brains. Thats it. Pixelated brains. Thank you.",
            "review_score": "1"
        },
        {
            "review_text": "For the price, nice",
            "review_score": "1"
        },
        {
            "review_text": "Perhaps the most entertainment I've got out of $1 in a long time. Quite addicting.",
            "review_score": "1"
        },
        {
            "review_text": "fudge me its hard",
            "review_score": "1"
        },
        {
            "review_text": "This is a really fun simple game. I've put a lot of hours in and I find myself going back to it time and time again!",
            "review_score": "1"
        },
        {
            "review_text": "Very simple and easy to understand top down strategy game. A fair amount of the game is randomized so it always feels fresh. I went into this game for steams summer achievement but found I was still playing it long after the achievement had popped. Quite addicting and very unique in its style and gameplay.   You atart off in a zombie apocolypse and are a commander controlling mercernaries. You pick a place on the map to try and rescue civilians while killing zombies. At first you don't start with much (just a rescue helicopter) but eventually you get demolitions mercs, barricades, mines, infrantry, snipers, artillery and even some super weapons to help you destroy all the zombies on a map. I could go on about how deep the game can get but just give it a try for yourself if you have a few dollars to spare.",
            "review_score": "1"
        },
        {
            "review_text": "Incredibly underrated game. Awesome strategy, smart humor and amusing art style. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "It was fun and I was reinstalling it to play it again, but it crashes on startup with Windows 8. Even more unfortunate is that the devs abandonded it.",
            "review_score": "-1"
        },
        {
            "review_text": "Nintendo-hard zombie killing game. Can you reclaim the map from the hordes of flesh-eaters? Fun for a time, but as my 43 minute play-time attests, I couldn't quite get into it. It's aight.",
            "review_score": "1"
        },
        {
            "review_text": "Update 11.28 02/09/2016  Game has been updated for windows 10 thank you was expecting this, game is a gem.",
            "review_score": "1"
        },
        {
            "review_text": "Simple. Funny. Fun. Buy it now.",
            "review_score": "1"
        },
        {
            "review_text": "Great game but pretty unforgiving. Each decision you make affects the overall game but each loss makes the game harder and harder meaning that when you go on a tilt it's very hard to bring it back. I reccomend it if you like your games with a steep challenge but cool mechanics.",
            "review_score": "1"
        },
        {
            "review_text": "Fun polished casual minigame, plenty of mods, and options. Multiplayer is hotseat only.",
            "review_score": "1"
        },
        {
            "review_text": "Great miny game for only 10 euros, definitly worth it's cost. It's a great way to experience what it's like to try and save a population from a zombie apocalypse. at your disposal you have: A chopper(to save the population): Landmines. Dynamite. Ground soldiers. Snipers Artillery Blockades. obital strikes Each game will give u different variation of these weapons. So game 1 could be like( ground soldiers, blockades and landmines(plus chopper). (2 artillery, soldiers, snipers and dynamite(plus chopper). Like any varitation basicly.  Now in my opinion the first part of the game is the funniest. Like u start with only a chopper then slowly build up unlocking more and more stuff as u progress. Late game is where it falls a bit off in my opinion where all the high level infestations occor. It becomes solely about Artillery, obitals strikes and lama bombs. Infantry,snipers and blockades fall off late game, they are not useless, but just waaay less effective than just bombing. If u take the game on max points. Then the first 20 % of the game will be full with cool new unlocks and stuff, but the rest is just really dry. It's true that u can upgrade stuff with scientist, but like meh, they just give extra stats, not like they unlock a new weapon.  I would therefore recommend that u play this game on low to medium points. Again it was just a little critisme overall this game is really great, good atmosphere and a cool soundtrack as well. ",
            "review_score": "1"
        },
        {
            "review_text": "In brief: The closest genre I can compare this to is a tower defense game but it doesn't really fit there. This is a constantly moving, mechanic changing strategy game that has an interesting story underlying it.   At length: The first mechanic of this game relie on an war-map / risk type of strategy. You must determine which hotspots to evacuate to either stymie the invading horde or attempt to clear the area and regain that territory for points. This is measured with a victory bar that adds point from this macro strategy and the micro strategy below.   The larger part of the game is an evacuation / extermination of a city to determine the fate of the territory. There is an open ended goal system which I feel is very refreshing to tower defense games in that you can succeed the mission by rescuing the minimum amount of people, the maximum amount or killing zombies. There are modifiers built in to change your gaming experience on multiple play-throughs.   On a flavor/aesthetic front this game oozes character. The surfin' style of music and occasional comic interludes gives a light hearted feel despite the crushing decisions you make in this game. And the game is fully aware of it.   My only gripes about the game are #1: The learning curve was rather off. While the freedom of mods in game helped even it out to my style I found casual to easy and normal unwinnable without any mods. Although I may be missing another level of strategy. #2: I'm not sure if there is a gallery for all the articles/comics/jokes the game gives but they are disjointed and while they stand alone, I never felt I got all of them.  All in all this is a nice little game to get into on desktop but this game really shines on a non-gaming laptop.",
            "review_score": "1"
        },
        {
            "review_text": "Great fun with zombies. Well invented game.",
            "review_score": "1"
        },
        {
            "review_text": "Artillery OP 10/10",
            "review_score": "1"
        }
    ]
}