{
    "app_id": 55150,
    "name": "Warhammer 40,000: Space Marine",
    "release_date": "2011-09-08",
    "developer": [
        "Relic"
    ],
    "publisher": [
        "SEGA"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 18,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Warhammer 40K",
        "Action",
        "Third-Person Shooter"
    ],
    "achievements": 60,
    "positive_ratings": 9847,
    "negative_ratings": 998,
    "price": 19.99,
    "description": "In Warhammer® 40,000® Space Marine® you are Captain Titus, a Space Marine of the Ultramarines chapter and a seasoned veteran of countless battles.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/55150/header.jpg?t=1528131586",
    "minimum_requirements": "OS: Windows XP SP3, Windows Vista SP1, Windows 7 Processor: 2.0Ghz Dual core CPU (any Core 2 Duo or AMD X2 or better) Memory: 1GB (XP), 2GB (Vista), 2GB (Windows 7) Graphics: 256MB Video Card using Shader Model 3 (Nvidia GeForce 8800GT, AMD Radeon 3850 and above) DirectX®: 9.0c Hard Drive: 20 GB space free (10 GB free after install) Sound: Laptop and Notebook users will need to download the newest Nvidia 280.26 or AMD Catalyst 11.8 drivers.",
    "recommended_requirements": "OS: Windows 7 Processor: Any Quad-core Intel or AMD Processor Memory: 1GB (XP), 2GB (Vista), 2GB (Windows 7) Graphics: 512MB Video Card using Shader Model 3 (Performance equivalent to an AMD Radeon 5750 or better) DirectX®: 9.0c Hard Drive: 20 GB space free (10 GB free after install) Sound: Laptop and Notebook users will need to download the newest Nvidia 280.26 or AMD Catalyst 11.8 drivers.",
    "reviews": [
        {
            "review_text": "Warhammer 40,000: Space Marine is a 3rd person shooter based in the (suprise!) 40k universe. I've played several Warhammer 40,000 video games. Some were good, others mediocre, and others were so great that I still play them, even several years after their release.  This is one of them.  This is one of the best 40k games, period. It nails everything- from what makes a good 3rd person shooter, to what makes a true-to-lore 40k game.   To start off, This isn't your standard 3rd person-totally-not-gears-of-war game. Whilst most 3PSs focus on a cover system, Space Marine removes that entirely. You ARE the cover. You can wade into a mob of enemies, without dying every 3 seconds. It perfectly encapsulates what makes a space marine a space marine, and lets you experience that firsthand.  The combat is divided into two parts- ranged and melee. You are given a wide variety of weapons to slaughter your enemies in different and uniquely brutal ways. Each weapon feels (and sounds!) exactly how it should. The shot of a bolter, the hiss of a meltagun, and the roar of a plasma cannon. And although the ranged weapons are cool, the melee weapons are even better. Chainswords (chainsaw-swords) evicerate and rend flesh whenever they strike, turning a large horde of orks into a bloody mess very quickly. Thunder hammers, although slow, deal tremendous damage and completly pulverise your enemies. The combat (especially in single player or the horde-mode) is immensly satisfying and one of the best parts of the game.  The game has both a single-player and a multiplayer. The single player has a decently lengthy campaign (10-12 hours) with a pretty good story. It does have its faults (unfinished story arcs that will probably never get finished b/c r.i.p THQ), and the last boss fight is pretty lame. The multiplayer, although good and reasonably well balanced, gets repedative with the 4 maps (excluding expansions). You also can't choose which side you are on pre-match, meaning you might not even get to see your shiny new color scheme for a couple matches. The multiplayer also follows the standard 'level up to improve' philosophy, with special perks unlocked by completing challenges (some of which are brutally difficult without help).   Overall, this is a fantastic 40k game that really makes you feel like you are playing a space marine. It has a few issues (mostly with multiplayer), but you can easily get many hours of enjoyment out of this game. ",
            "review_score": "1"
        },
        {
            "review_text": "A fantastic representation of being a Space Marine in the 40k universe, although it lacked some of the elements i would have expected like RPG mechanics and deep single player customisation i thoroughly enjoyed the aggressive brutal combat and the proper representation of being a space marine.  Relic have produced a visually stunning accurate representation of the 40k universe, the graphics while lacking ultra-high resolution textures and great and are sufficiently good looking. The animation feels weighty and powerful, even just walking around you can feel the heft and sheer Mass of the warrior you’re playing as. If you have ever wanted to take control of a Space Marine, the true space marines of sci fi I might add, this is the game for you.  While multiplayer lacked depth it is a fun distraction, the customisation on display here is pretty great too allowing you to play as any of the chapters you like and even make your own. Im annoyed allot of the options such as the power sword are behind micro transaction DLC but overall the multiplayer is prey fun.  I really hope relic get another chance with this IP, I would love to see a sequel.",
            "review_score": "1"
        },
        {
            "review_text": "Repetitious gameplay, difficult aiming, and some odd game choices cannot hold back the fact that you are a SPACE MARINE. Everything is good when you get to slaughter thousands in the name of the God Emperor. HERESY WILL BE MET WITH EXTERMINATUS.",
            "review_score": "1"
        },
        {
            "review_text": "marine means 'water' and theres no water in space. checkmate, thq",
            "review_score": "1"
        },
        {
            "review_text": "Epic game! Must-have for all   WH40k   fans!",
            "review_score": "1"
        },
        {
            "review_text": "The cut scenes are great. They make you feel like a real space marine.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "It's great title for those who like 3rd person shooters. Story is rather interesting, graphics is quite nice.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most fun single player campaigns I've played in a hack and slash game ever, even more so if you already enjoy the W40K universe. Gameplay is solid with a decent challenge given and intuitive controls. Though not overly difficult, it is still challenging enough that you feel satisfied when you manage to gun down or hack apart the few hundred orks blocking the way to your objective. The devs have done an amazing job with the weapons. Bolters sound and feel exactly like they should when firing rounds into mobs of Greenskins, while ripping them apart with your chainsword is equally satisfying, visually and audibly. For me though nothing beats flying around in a jetpack, thunder hammer in hand, crushing heads into the cement. The rest of the game as far as atmosphere and overall feel goes is supurb, really feels like a Warhammer game and won't leave you disappointed. Storywise the game is nothing mindblowingly original as far as W40K goes but it does keep you interested until the end. Originally meant to be a trilogy, THQ went bankrupt before they managed to make the sequels so we don't ever get to find out what happened to Captain Titus, but even so it's worth playing for the story if you're a fan of the lore. The multiplayer was fun back in the day but is completely dead now so don't get this if that's what you're looking for. I wouldn't say the replay value of this game is especially high, but I enjoyed it enough the first time through to eventually play it again a couple more times, and probably will again in the future, though your mileage may vary. If you're a Warhammer 40K fan or just of hack and slash games in general, I'd say definitely give Space Marine a go, especially when it goes on sale if you're still unsure.  I give it 7 Imperial Aquilas out of 10",
            "review_score": "1"
        },
        {
            "review_text": "After playing this game I feared that I may be a heretic, so I purged myself for the Emperor. 10/10 would cleanse again",
            "review_score": "1"
        },
        {
            "review_text": "Gears of War meets 40K. Not the deepest WH game but you will have a lots of fun. Even the multiplayer is not bad and still alive",
            "review_score": "1"
        },
        {
            "review_text": "RIP THQ. This game was a lot of fun. Wish we would have gotten to see the continuation.",
            "review_score": "1"
        },
        {
            "review_text": "Well if you like to feel like a war machine, this game is for you ;D",
            "review_score": "1"
        },
        {
            "review_text": "When I first heard about this game, I wanted it. I was finally getting an action game from Warhammer instead of a typical RTS that usually happens with Warhammer games. I bounced up and down in joy, I flew across the room and hit my face against a door. In happiness.  But anyways, I was a huge fan of the Warhammer games, and I wanted this game. I picked it up during the 2012 Christmas Sale, and haven't regretted it once. It's one of the few games where I go back and play it after finishing the game. I loved this game, so much. The gameplay involves you slicing orks, stomping a body and making it explode, removing limbs entirely, and just for lack of trying, you can blow their heads off. With a sword. It's one of the few games where it combines melee and ranged combat fairly seamlessly (There are a few holes here and there.), where it makes you feel like neither the melee or the ranged is overpowering the other. I played through the campaign, where I was expecting to just use melee, but that was not the case. I ended up using a variety of ranged weapons to get through the game.  The healing system is rather interesting for this game. You have shields that regenerate out of combat (Like in Halo, for lack of a better comparison.) but your health doesn't regen out of combat. You have to do special kill moves to regenerate health. These can include shoving a chainsword through an Ork's body then moving it upwards and removing pretty much their entire spinal cord. They can also include exploding an ork's face. With your foot. There are some things that could be changed though to make it a more enjoyable experience. For example, you regain the health after the kill move, and you can be killed during the animation. There's no way to cancel the move, but for the most part this doesn't get in the way too much.  This game really made me feel like I could take on an entire horde of Orks by myself and come out barely scratched. I also did that in the game. However, it has a checkpoint system that could be vastly improved. Or at least make cutscenese that you can skip. They stick a checkpoint before an unskippable cutscene then shove you into a fight you could die fairly quickly in, and you have to watch the cutscene again. That's one of the only design flaws.  When I heard there weren't going to be anymore games after this, I was super bummed. I was hoping for Space Marine sequels even after THQ died. And then I read an article saying it had been canceled. Even if we didn't get any sequels, we got an amazing first game.  In short, I loved it. This is one of my most favorite games of all time.",
            "review_score": "1"
        },
        {
            "review_text": "Really good gunplay; mele combat is not quite as good. Game goes on a little bit too long but still recommended. Jump pack sections are excellent. Storyline is predictable if you are at all familiar with 40k. Bonus guest appearance by the Blood Ravens near the end warmed my heart.",
            "review_score": "1"
        },
        {
            "review_text": "Warhammer 40,000: Space Marine is definitely the best game of last month and maybe the best game of 2011 (if you close your eyes and forget about Deus Ex: Human Revolution that is). Kratos from God of War has been dethroned, badassery has a name and its name is Titus. Play it, you will have a unique experience. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "it's a gears of war halo mix except it doesn't suck and you get to serve the emperor  EDIT: it has completely aweful mouse acceleration, like genuinely terrible, I'm tempted to not recommend this game due to that exclusively.",
            "review_score": "1"
        },
        {
            "review_text": "SPACE MARINE!??! One of my all time favorite games. Slicing down ork after ork is fantastic. Everything has a satisfying weight to it. 10/10 all the way.",
            "review_score": "1"
        },
        {
            "review_text": "40.000 Space Marine is an exelent game where to slaughter xeno and heretics for the god emperor of man or slaugheter for the chaos god Khorne  BLOOD FOR BLOOD GOD SKULLS FOR THE SKULL THRONE   The singelplayer is good and fun and the multiplayer is the core ofc but you WILL meet alot of ppl weilding the MELTA GUN or the dam vengance launcher. So to counter that you need to either STRIKE FROM THE SKY BROTHER or use a lasscanon to blast there heretical faces of.  So weither your a part of the Astartes,or Chaos Legions we will still meet on the battle feild where only blood will be skilled and fellow battle brothers will fall all in the name of the GOD EMPEROR OF MAN for in the grim darknes of the 40.000 univers there is ONLY war.  Also ♥♥♥♥ the bonus round in chaos unleashed cus 2 Killa Cans=ork dreadnought",
            "review_score": "1"
        },
        {
            "review_text": "Warhammer 40,000: Space Marine is a third-person shooter set in the universe of Warhammer 40,000 that follows one captain of the Ultramarines, Titus, on his mission on the Forge World Graia, which is under heavy attack by a Ork horde seeking to posses the powerful weapons built in the planet's factories. Later in the game, Titus and his two accompanying Ultramarines, Sidonus and Leandros, must also face the threat of a Chaos Warband lead by a dangerous Chaos sorcerer named Nemeroth.  The main beef of Space Marine's gameplay is using the weapons you are given tocut through the hordes of enemies preventing you from advancing and then proceed in the levels. You are given both long ranged weapons (like pistols or sniper rifles) and close quarters tools (starting from a chainsaw and arriving at a huge electrified mallet): you must learn to switch between the two constantly, given you'll face various kinds of enemies (some of them dangerous on the long distances while others extremely weak if chopped down in close combat). Each weapon has different versions that are unlocked advancing in the game, each with its pros and cons. On top of his health pool, Titus can take advantage of a recharging shield that can protect him against some of the enemy fire and a super mode of some sort: the mode is charged by dishing out damage and, whenever unleashed, allows you to recover health over time and aim at enemies in slow-motion. Finishing enemies when they are weak also allows you to boost your health.  The main campaign is extremely faithful to the Warhammer 40,000 universe, both in design of the environments and characters and the references made to the general lore of the series. It lasts for aboutsix or eight hours or so and, aside from fighting your way through Graia, you can find hidden servo-skulls bearing audio recordings that further expand the game's story. There are three different difficulties (easy, normal and hard), but I'd say that even the normal mode manages to be challenging enough.  Warhammer 40,00: Space Marine also spots a rather interesting multiplayer mode. You can either play as a Space Marine or a Chaos Marine, and the game offers a customization menu that allows you to deeply personalize your marine (armor pieces, colours, insigna, ...). The multiplayer mode offers several game modes, the same you could expect into a big retail multiplayer shooter: capture the flag, capture the control point, ... The mode also features co-op missions. The player actually makes progress in multiplayer thanks to a level system, unlocking new armor pieces and/or weapons and perks as he/she gains more experience. As I'm writing this review and four years after the game's release, Space Marine's multiplayer is still really populated.  Warhammer 40,000 Space Marine, along with the Dawn of War series, is a great example about how a complex series like Warhammer 40,000 can be boiled down in a rather charming game capable of offering a great time both to the fans of the series and newcommers just wanting to enjoy some good third-person shooting action",
            "review_score": "1"
        },
        {
            "review_text": "DEATALED LIKE THE ACTUAL GAME VERY GOOD RUMORS OF A SEQULE COMING OUT",
            "review_score": "1"
        },
        {
            "review_text": "Do you want to be a walking demigod of war and death? If yes, then take the role of one of the Emperor's finest, a Space Marine. Bring wrath and ruin to all that stand against you in this perfect, action packed 3rd person gorefest of an action game.  Seriously though, you need to play this.  ++The Emperor Protects.++",
            "review_score": "1"
        },
        {
            "review_text": "Why not?",
            "review_score": "1"
        },
        {
            "review_text": "Words for the Word God.",
            "review_score": "1"
        },
        {
            "review_text": "Its an awesome game! There aren`t many players and i dont know why! Trust me it is a cool game. (My opinion)  8.4/10",
            "review_score": "1"
        },
        {
            "review_text": "Space Marines!!!",
            "review_score": "1"
        },
        {
            "review_text": "The Codex Astartes names this maneuver Steel Review",
            "review_score": "1"
        },
        {
            "review_text": "balls to the walls fun",
            "review_score": "1"
        },
        {
            "review_text": "I really loved this game, lots of fun, no wimpy cover mechanics, (so inb4 GOW clone - Astartes don't hide). shame the dev went and died, bigger shame is the community now is quite small and the matchmaking is distance agnostic. It's no fun trying to pvp on 500ms when the host is literally on the other side of the planet. If you're going to dip in and grab it, make sure you have some mates who will run with you so you can get a local host, there are plenty of steam groups still playing.",
            "review_score": "1"
        },
        {
            "review_text": "This is a very good game it stays true to the warhammer 40k lore where in Space Marines must endure a trial of mental and physical strength to become a ultra marines this trial intails mastering the following foes and tasks  - The dreaded and feared beast of host mitigation a disgusting foe that knows no sympathy and will ravage your mind with ease.  - The dreaded dungeon of lagsarus where you will meet the most savage of creatures including Brazilious Dreadious, Austlianus Frearous, and the most nightmareish of them all a Russian named Perkov.  - The forest of solitude a lonely place where you will be forced to meditate on your destiny and what you have done to deserve this fate. You will find yourself siting there staring at the crude markings found on special rocks that translate to '0 Possible Games Found' what could these mean ? a riddle that has pleagued the minds of many marines through the ages  (do not buy this game it is terrible)",
            "review_score": "1"
        },
        {
            "review_text": "This game has a very interesting story with very gritty gameplay. The hack-n-slash shooter may not be indefinitely unique but has a very fun story to tag along with. The graphics are decent and well theres nothing like getting covered in orc blood. The controls are decent and fluid, they definitely allow you to adapt easily.   The online i actually see with a lot of bad publicity. It's honestly not that bad. It has some customization to it, and has lots of fun killing in it. It kind of reminds me of like a hack and slash version of Call of Duty. It's very fast paced, however i had 10x the amount of fun on this than i ever had on Call of Duty.   This is more of a game i would wait for on a deal but i still do recommend it for any WarHammer fan!",
            "review_score": "1"
        },
        {
            "review_text": "You get to purge heretics. 40000/10",
            "review_score": "1"
        },
        {
            "review_text": "Twenty five hours spent on this awesome game. I liked reading the novels and LOVED the RTS (at least the earlier ones) before THQ started barfing on the later titles. They didn't water this game down - they really did a good job on it. They nailed the space marine his all his ♥♥♥-kicking glory!",
            "review_score": "1"
        },
        {
            "review_text": "Highly Recommend this game, The single player is pretty good but the multiplayer is awesome. If they could fix lag issues with the matchmaking it would be perfect. Excellent deathmatch game.",
            "review_score": "1"
        },
        {
            "review_text": "Blood+Action = Nice game",
            "review_score": "1"
        },
        {
            "review_text": "This game, this game is so good, the day it released i played it on the hardest difficulty till i smashed it in the face. The ride it took me on was like no other game and the fact i was a mighty space marine, smashing down ork and chaos alike, brought joy to my heart. I wouldn't say its everyones cup of tea, but if you like a challenge, a shooter and warhammer all in 1, there is NO substitute",
            "review_score": "1"
        },
        {
            "review_text": "This had been languishing in my backlog as a pickup from a Summer sale 4 years ago. It's too bad it just now caught my eye as it really is a gem. The combat has it's quirk, but is generally tight and responsive. It was billed at the time as the 'anti-Gears of War' - it's a 3rd person shooter but not intended to require abuse of cover mechanics. Unfortunately, the last quarter of that game punishes the player for playing it that way; ditching melee and focusing on ranged firepower is the only way I was able to beat this very difficult part of the game.  This is also nice in short clipping in at 8 hours, so it doesn't overstay it's welcome. If you like W40K, or 3rd person action games, you can't go wrong picking this one up. Recommended.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would purge again",
            "review_score": "1"
        },
        {
            "review_text": "Space Marine is a stompy-thrashy-splashy good time. Gameplay is entertaining and the multiplayer is full of those awesome 'PSYCH!' moments. The single-player is vaguely forgettable (but still a very nice introduction to Warhammer 40k). Worth it (on sale) for the bloody-roary fun and a must-have for any 40k fan.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game all around. Took me 20 hours to finish single player campaign and still love it. It runs a great multi-player setting with several incredible DLC's. Can't wait to purchase my Dark Templar Armor DLC. Perhaps a Chaos Armor as well.",
            "review_score": "1"
        },
        {
            "review_text": "This game is seriously the most fun you can have with your pants on!  If you want THE quintessential Warhammer 40K experience, this is it. It is brutal, alredanline pumping, blood soaked fun! The game follows a Command Squad of three of the Ultramarines (you play as 2nd Company Commander Titus), called in as reinforcements to the war torn Forge world of Graia. You are big, you are hulking and nothing stands in your way. You ARE a Space Marine and this game gets MASSIVE praise for making me feel like one!  In terms of Gameplay, Space Marine plays a lot like the love child of 'Gears of War' and 'God of War' in relation to its shooting and melee mechanics. The controls are slick, the game looks fantastic and it was very fun to just pick up and play. This coupled with a FANTASTIC story ripped straight out of the 40K universe makes it a must have title.  25 out of 10. Would absolutely reccommend!",
            "review_score": "1"
        },
        {
            "review_text": "Play this game. A rather fun 3rd person shooter. FFS, it's Warhammer, WAAAAGHHHHHH!",
            "review_score": "1"
        },
        {
            "review_text": "I fully admit to being a W40K geek, so finally getting to take control of a Space Marine is pretty much a fantasy fufilled. Relic are regularly known for their RTS but here they have switched to a 3PS and conquered it. The movement is smooth, the arena's are stunning, the game play is tough enough that it makes me curse now and then (always a sign of a good game), and so far I am really enjoying the storyline.",
            "review_score": "1"
        },
        {
            "review_text": "A hack and slash treat with a typical WH40k story (i.e. lots of scenery chewing but in an awesome tongue in cheek over the top way). The game looks decent enough, features a strong voice cast and the gameplay is solid. If you are a fan of games such as Darksiders or a WH40k fan then you should get this. If you want to feel like a baddass Space Marine this game is for you, buy it now it's a little older for a very fun weekend! 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Warhammer40K. A game with a rich history and historic battles. This game let's you BE one of those Marines that you command on the ground. I've heard about the series for years. But I've never had a chance to experience the Ultramarines until now. I'd recommend this game to anyone who wants to simply destroy everything in your path in the most satisfying way possible. It's you against entire Hoards. Gotta love those odds. That's where you call upon the will of the emperor and tear the scourge to shreds in holy fury. This is a great start to get into the War Hammer40K series. I recommend it",
            "review_score": "1"
        },
        {
            "review_text": "One of the Best WH40,000 games, ever",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant third person shooter. excelent multiplayer mode provided you can still find a match. the single player game while still short is very entertaining. don't bother with any DLC, it is for multi only and no one seems to use it",
            "review_score": "1"
        },
        {
            "review_text": "This is defintly a game for warhammer fans. If you know the lore and who each faction is you will enjoy this game. Combat is a hit or miss, being a simple mix of shooting and hacking and slashing with a melee weapon of your choice, if you find that enjoyable you will love this, but if you are looking for complexity, steer clear. All in All, this is a game that dose require some lore to get into but can still function as a great hook to get people into the 40k series. I give it a 7 outta 10 bby",
            "review_score": "1"
        },
        {
            "review_text": "my ♥♥♥ its ok. ",
            "review_score": "1"
        },
        {
            "review_text": "The game has a hammer, some blueishy glowing thing. Smack your way from beginning to end. Dont expect help from some of your soldiers walking behind you all the time. Did I mention the hammer? Its great to kill time, and give you that winning feeling. I mentioned the hammer right? Orcs all the time for you to shoot, and smack. Theres a hammer in the game! So get it and start smacking. And yes, its blue!",
            "review_score": "1"
        },
        {
            "review_text": "Best warhammer game out there. The story line is awesome",
            "review_score": "1"
        },
        {
            "review_text": "I love this game!! ive always wanted it when came out but didn't have a computer to run it or the money. I finally do and it has met and gone beyond my expectations so far even though i am still at the beginning of the game. (this is a very biased review seeing as i am a Warhammer 40k fanboy)",
            "review_score": "1"
        },
        {
            "review_text": "Great TPS game, good for all Warhammer 40,00 fans!",
            "review_score": "1"
        },
        {
            "review_text": "The metacritic rating for Space Marine is about right (74%), but I thoroughly enjoyed it because the developers painstakingly recreated the 40k universe. I don't think I know if another franchise-based game that feels quite as spot on. With that said, the gameplay does have a few issues. Combat borrows heavily from God of War, with the addition of a solid shooter component (sans cover mechanic, thankfully?); which is to say the combat has variety but lacks real depth. Multiplayer has serious ups and downs, due mostly to the lack of dedicated server support and MASSIVE lag issues if the host is not on your content (which happens about half of the time). The 'unlocks' and leveling component offers a few gameplay options without breaking multiplayer. Also included is a co-op 'survival' mode (up to 4 players), which only has a few maps but is a riot when you can pull together a few buds for a match. When Space Marine is on sale, it's a great buy for any Warhammer 40k fan.",
            "review_score": "1"
        },
        {
            "review_text": "Simply.... WAAAAAAGH.",
            "review_score": "1"
        },
        {
            "review_text": "Extremely linear, very one-dimentional, passable storyline, buckets of blood, loads of fun. 7.5/10.",
            "review_score": "1"
        },
        {
            "review_text": "great game",
            "review_score": "1"
        },
        {
            "review_text": "I'm a huge fan of space marines and this game just pulls it off with the whole aspect of a space marine.",
            "review_score": "1"
        },
        {
            "review_text": "Welcome to Warhammer meets Gears of War quite literally. No need to get an Xbox, this game is the perfect suffice and has a good amount of skill and difficulty involved. Fight for power as the noble Space Marines against the bloodthirsty Greenskins in an ever-raging bloody violent war.",
            "review_score": "1"
        },
        {
            "review_text": "Best Game EVER!! Specialy if you are playing with friends! :D ",
            "review_score": "1"
        },
        {
            "review_text": "Great Game the multiplayer can be very laggy and some weapons are Over Powerd but the Zombie mode is great to play with friends and the singelplayer keeps on surprizing me! :D",
            "review_score": "1"
        },
        {
            "review_text": "Great addition to the Warhammer series, recommended for fans and newcomers alike. Online PVP not much to shout about but the single player and Online Exterminatus modes are fun :)",
            "review_score": "1"
        },
        {
            "review_text": "If you are interested in this game check out the   Grand Dawn of War Video Project  [lnotepad.blogspot.co.il] .",
            "review_score": "1"
        },
        {
            "review_text": "One of the best 3rd person shooters I have ever pl.ayed, and hands down the best 'gears of war' clone ever made.",
            "review_score": "1"
        },
        {
            "review_text": "I recently got this for 99 cents at Gamestop for a physical copy. The campaign is worth $5 alone as long as you're a casual fan of Warhammer 40k. Some of the finest brutality to be had here. It's a rock solid campaign, if not a bit brain dead. I actually found a party for the coop/hoarde mode Exterminatus, so I may still keep it installed for some more of that action. Seems like this was a pretty solid product. I loved Dawn of War 2 and this gave me a proper up close and personal Warhammer experience. I knew how all the weaponful should feel because of the RTS game. That in itself was impressive. The attention to detail here deserves praise.  I dabbled in the multiplayer a little and some nights it still finds parties of people but I cant say the multi has hooked me in any way.",
            "review_score": "1"
        },
        {
            "review_text": "You Must Play This If you a Fan Of Warhammer World !",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game after playing the demo for 2 hours. Originally, I purchsed Space Marine for the single player because I had so much fun in the demo; however, upon opening the game program I jumped right in to multiplayer and put 30 hours into intense, satisfying, and sometimes frustrating PvP combat before I even started the single player missions. I've put over 100 hours in to Space Marine and, with the (free) release of the Exterminatus 4-player co-op DLC, I plan spending a lot more time in this game. I hope the game goes on sale soon because this title is one that will always welcome both new and return players.",
            "review_score": "1"
        },
        {
            "review_text": "Great fun when you want something not too intellectually taxing and visually overwhelming.  Might be at times a little repetitive. Occasionally interrupts you to remind that you aren't actually invincible and two grenades in quick succession can kill you. The mechanic where you actually need to violently execute stunned enemies to regain health (and it's actually the only way to regain health) punctuates well that this game knows exactly what it wants to be -- it's that 'murder simulator' you keep hearing about, done earnestly.  Bloodiest game I had the experience playing -- if you consider extreme violence and explosions awesome, you want it.",
            "review_score": "1"
        },
        {
            "review_text": "5 years on this game is still the best you can get if you enjoy warhammer 40000. gameplay online even when laggy feels godtier compared to Endless Crusade - which is currently in alfa.   less weapons, better tuned, rewarding and long singleplayer, two affordable DLCs that give new maps and modes, enables Dreadnought play aswell as being able to play the coop mode as the traitor legions. which is no change in gameplay, but adds a map!  this game was found on  {LINK REMOVED}  ♥♥♥.com  for 2 dollars vanilla. I have no idea who currently holds the Space marine IP (Other than GW) but buying it is well worth it. the game is still very much alive online and the campaign still holds up!  For Russ and the Allfather",
            "review_score": "1"
        },
        {
            "review_text": "Simple, colorful, entertaining, pictures surprisingly well the setting and its mood. I recommend this over many of recent and past WH40K themed games.",
            "review_score": "1"
        },
        {
            "review_text": "whatever some might say about this just being god of war meets gears of war, they're lying. it goes deeper than that with a story I enjoyed more than either of those games, and the multiplayer is quite fun to top it all off",
            "review_score": "1"
        },
        {
            "review_text": "After 2 years of playing in MP I played the story....wow just wow! Shame there will never be a sequal as the story could develop into something special.",
            "review_score": "1"
        },
        {
            "review_text": "There's nothing that ever ceases to make me giggle more than controlling a superhuman wearing a tank for armor, trudging through a bloody spree of wanton destruction.  No really, get this game, I need more friends to either burn, maim and kill, or fight alongside.",
            "review_score": "1"
        },
        {
            "review_text": "Reminds me of gears of war. Great game and a lot of replay value. Multiplayer is pretty cool too.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game for any warhammer fan. Even if you are not a warhammer fan I garentee you will find enjoyment out of this.",
            "review_score": "1"
        },
        {
            "review_text": "The Emperor protects but it never hurts to carry a big gun.  Pretty solid mechanics  Looks great, atmospheric envirmonments  repetitive fun  I have enjoyed the viseral and gritty gore and sound effects add to the immersion, I feel like an astartes.  A linear campaign with few suprises which remains fun all the same, I find myself going through the fights to see the next part of the story, its all straight forwards with regular ammo and weapons drops and some side areas with servo audio logs as your easter eggs.  Theres some fun to be had in stamping on ork heads and unloading bolters into a pack of daemons.  you have standard bolt pistol and chainsword along with your bolters and plasma guns, you get jetpack sections and heavy bolter on the rail and various other weapons to play around with and over come the enemy.   The death moves are very satisfying to me and allow you to regain your health, melee, stun and execute your foe.   The multiplayer is alot of fun with two modes, versus and exterminatus. Its straight forwards PVP and co op wave PVE with some good DLC that adds skins and maps and so on but maybe pick it up in a sale as its mostly for bling.  customize is another nice feature and allows you to create your own schemes and unlock various cool toys.   If youre a fan of warhammer you will most likely enjoy playing through the story regardless of whether or not you like the style of play, which is more like God of War or Gears of War.   It is better to die for the Emperor than live for yourself-so buy this game!",
            "review_score": "1"
        },
        {
            "review_text": "Best warhammer game out there. The story line is awesome",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "If you can get used to the controls (WASD+Mouse) this is a great game. The battle movements are a little clunky for me but I think that's something I can get past with practice. Visually and game play are great.",
            "review_score": "1"
        },
        {
            "review_text": "Blood for the blood god, Skulls for the skull throne, Milk for the khorne flakes. Very average game, but still fun nonetheless, Good single-player campaign - multi-player is a 'neutered' version of Call of Duty's multi-player. Character Customization is good though.",
            "review_score": "1"
        },
        {
            "review_text": "Came for a senseless stress reliever, stayed for a great story and actually still functional multiplayer! Warhammer 40,000: Space Marine turned out to be a fantastic game! I wasn't expecting much but it turns out I love it! I'm a fan of the Warhammer universe, and maybe that gives me a bias as to why I enjoy the game, but compared to other modern third person shooters Space Marine stands strong.  I was even able to jump into a packed multiplayer lobby on the weekend!  I did however foretell the 'plot twist' in the game, but that is probably just because of my lore knowledge.  Overall, and for what it's worth, I'd give Warhammer 40,000: Space Marine a 10/10, waiting on a follow up! For the Emperor!! ",
            "review_score": "1"
        },
        {
            "review_text": "Here's why I think you should get this game. Its subtlely different to anything else. Its remarkably well thought out being very streamlined and optimized. Your two ultramarine buddies can't ever die, and you'd best be a good ultramarine and not die either. For an older game its very nice to look at, the blood splatters when you pop a bolter cap in an ork are very satisfying, colours are nicely saturated and the whole thing has a HDR cartoonish feel to it. There are hordes, proper hordes and if you get overrun the best thing to do is whip out a blade and go crouching hidden tiger dragon all over them which is immensely satisfying. If you're any kind of Warhammer fan you'll love the game, its perfectly in canon. And I, the relentless skipper of cutscenes watched all the cutscenes cos I love the way the endoctrinated uber-fascist space marines go on. Like a mix between borderlands and warframe but plays better then either.",
            "review_score": "1"
        },
        {
            "review_text": "ITS BETTER TO DIE FOR EMPEROR THAN LIVE FOR YOURSELF!!!",
            "review_score": "1"
        },
        {
            "review_text": "Here's why I think you should get this game. Its subtlely different to anything else. Its remarkably well thought out being very streamlined and optimized. Your two ultramarine buddies can't ever die, and you'd best be a good ultramarine and not die either. For an older game its very nice to look at, the blood splatters when you pop a bolter cap in an ork are very satisfying, colours are nicely saturated and the whole thing has a HDR cartoonish feel to it. There are hordes, proper hordes and if you get overrun the best thing to do is whip out a blade and go crouching hidden tiger dragon all over them which is immensely satisfying. If you're any kind of Warhammer fan you'll love the game, its perfectly in canon. And I, the relentless skipper of cutscenes watched all the cutscenes cos I love the way the endoctrinated uber-fascist space marines go on. Like a mix between borderlands and warframe but plays better then either.",
            "review_score": "1"
        },
        {
            "review_text": "A very good exercice for the ones like me that have a stressfull job, its action from the get go until the end, its a diferent gameplay in the Warhammer universe, but i think the main objective was acomplished, deliver entertainement and on that regard, space marine worth it, even at current price with no sale discount.  The graphics not being nothing awesome, they are still good, voice acting very good and the story is good enough to keep you playing, but the strong point of this game is the gameplay full of action, gore and some funny moments with Orcs, who doesnt like Orcs?  If you are fan of this universe theme, space marine will let you experience what you already know in a completly diferent perspective, so il give this game 7.5/8 and recommend you to try out.",
            "review_score": "1"
        },
        {
            "review_text": "could do with a jump button",
            "review_score": "1"
        },
        {
            "review_text": "i ♥ thunder hammer.  10/10, would kill warboss grimskull once and for all.. again.",
            "review_score": "1"
        },
        {
            "review_text": "Hugely underrated game in my opinion. I played it a few times in offline mode so hours didn't get counted, i probably have about 40h playtime.  I really enjoyed the story and the gameplay.   Also considering how unplayably bad most WH:40k games are this is a shining beacon :)  It's not the longest story mode and the multiplayer is not usable(unless you have enough friends to play with) since nobody plays anymore. But it's pretty cheap nowadays so i think it's very worth it.",
            "review_score": "1"
        },
        {
            "review_text": "The ONLY game that made me feel I was a part of the 40K universe. After stepping into the boots of an Ultramarine, the player can really feel the 'weight' of that power armor. Being able to witness first hand the efficient devastation a trio of Ultramarines can pull off makes for one engaging experience. Damn shame that the sequels of a proposed trilogy were cancelled.",
            "review_score": "1"
        },
        {
            "review_text": "if you love Warhammer 40k universe you will love this game  just watch the intro to this game,one of the best intros ever",
            "review_score": "1"
        },
        {
            "review_text": "best $8 ive spent on steam",
            "review_score": "1"
        },
        {
            "review_text": "The DLC is lame and I've never played the single player. But there is something about this game that, over the years, keeps me coming back.  ",
            "review_score": "1"
        },
        {
            "review_text": "orcs, orcs everywhere.",
            "review_score": "1"
        },
        {
            "review_text": "5.5/10 [55%] :(  + Great Intro, Cinematic. + Immersive Universe. + Characters. + Gore, dark concept. + The Idea of It. + Power moves are fun, power kills.  - Too Brown [rusty], boring, same old same old.  - Repetitive.  - Sometimes power moves, can complicate things rather than make it more fun. - *Feels* like, too many gimmicks, not enough simplicity. *times*  - $",
            "review_score": "1"
        },
        {
            "review_text": "A fantastic shooter. Buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "I had a rough time saying this is good rather than bad because I didn't really care for it but it's good, hard and brutalizing, you hardly go a minute without seeing a horde of orks run at you just to die; the singleplayer campaign lasts for about 8ish hours and multiplayer is pretty good with COOP survival mode and versus mode.",
            "review_score": "1"
        },
        {
            "review_text": "Hands down one of my favorite WH40K games to date. Wish GamesWorkshop would make more 3rd or 1st person spacemarine games. Maybe another one with a different chapter perhaps? Graphics could have been better and an ability to jump. But all in all a pretty solid game. Multiplayer community is dead, need more people for Dreadnaught assault",
            "review_score": "1"
        },
        {
            "review_text": "The only one of it's kind in a long running Real-Time Strategy Franchise, Warhammer 40,000: Space Marine puts you in the shoes of an Ultramarine as he infiltrates a planet overun by Ork.  Tight and visceral third-person combat - Slaughter hordes upon hordes of Ork using your Chainsword or shoot them into smithereens with powerful weaponry!  Up to four guns can be carried at all times, with a Bolt Gun as a permanent default. Specific Chainsword attacks cause health regeneration and you also have a Fury Bar, adding more depth to planning out your attacks on the battlefield.  WHAT ARE YOU WAITING FOR? GET YOUR ♥♥♥ IN GEAR, MARINE! MOVE OUT!  9/10",
            "review_score": "1"
        },
        {
            "review_text": "difficult and unreasonable enough to make you rage at some points. like when the enemies around you take out your health in 2 hits.  and the boss battle is by all means low-budget-action-movie ridiculous, but Warhammer 40,000: Space Marine is still a fun shoot-em-up combined with hack-and-slash that is well worth any sales price it goes on now ($10 or less).  also, multiplayer is half-cancer half-worth-a-try. You can customize your own Space Marine mech suit!!",
            "review_score": "1"
        },
        {
            "review_text": "Breaking Ork teeth has never been so satisfying, For the Emperor!",
            "review_score": "1"
        },
        {
            "review_text": "20 hours in. I knew nothing about WH40K   I was a heretic  The Codex Astartes did not support my failures.  Luckily, I have now seen the light that is the Imperium of Man and our glorious emperor.  40K/10 would kill orks with a chainsaw-sword, a chainsword, again.  PS: OMGOMGOMGOMGOMG I GOT A POWER AXE THE GAME IS EVEN BETTER AND I DIDN'T THINK THIS WAS POSSIBLE  40,000,000,000,000K/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is ♥♥♥♥ing awesome",
            "review_score": "1"
        },
        {
            "review_text": "Decent game. The single-player part is a bit boring at times, where you're just walking around, doing nothing. There are also a lot of lifts, with no real function. I think they're there to increase the playtime. Also, I wish there was more variation in environments. About 90% of the game you're inside a building.  The shootouts and close combat are satisfying, but can become frustrating. And the reason for that is when you're executing an enemy, you're still open to enemy fire. So while an execution should increase your health again, most of the times it doesn't even help or even gets worse, resulting in too many deaths. And... well, there aren't too many bossfights. I think there are only 2-3. Disappointing. The graphics are sharp, and the voice acting is brilliant (Mark Strong !) though. But this game could've been so much more. Wait for a pricedrop before buying, unless you're into decent games, of course. (The multiplayer is supposed to be fun though, but I've yet to try it.)  [Rating: 78/100]",
            "review_score": "1"
        },
        {
            "review_text": "Fast paced gameplay that stagnates as the game goes on, insane difficulty curves, poor writing and a predictable plot, and the game ends with a QTE boss battle, after all the build up to an epic battle it ends with a QTE. Also, the game is only about 6 hours long. I would only recommend this game if you happen to see it on sale for very cheap. If this were not a warhammer game, it would have been torn apart by fans and critics.",
            "review_score": "-1"
        },
        {
            "review_text": "Not the GREATEST of Relic's games.  BUT OMG IT IS FUN!  Bolter. Chainsword.  Need I say anything else?",
            "review_score": "1"
        },
        {
            "review_text": "A great game, plenty of potential (that sadly wont and hasnt been expanded on). There is however a decent modding community and it is slowly growing, making it a little more exciting. But as everyone says the multiplayer system is more broken than a Ming vase dropped from a 12 story building. It is barely playable, especially if you live in australia. But even in australia there is dedicated pvp groups etc.",
            "review_score": "1"
        },
        {
            "review_text": "This game is ♥♥♥♥ing brilliant",
            "review_score": "1"
        },
        {
            "review_text": "Take 'blow off some steam after work' to epic levels. Nothing is more satisfying than that.",
            "review_score": "1"
        },
        {
            "review_text": "Not the GREATEST of Relic's games.  BUT OMG IT IS FUN!  Bolter. Chainsword.  Need I say anything else?",
            "review_score": "1"
        },
        {
            "review_text": "It's obvious that Relic and THQ didn't learn any lessons from 'Dawn of War 2'. 'Space Marine' has all the same issues - for the campaign, the AI is simplistic and doesn't scale with difficulty; adding in more health and damage is just the cheap and easy way of making things tougher. For multiplayer, the problems are too numerous to mention, but we begin with the horrible lag issues. Many weapons used in multiplayer are extremely counter-intuitive and broken, most egregiously the plasma cannon. There are also constant issues with terrain collision and inconsistencies with executions. (Captain Titus saws orks brutally in half, for example... with the flat edge of the chainsword.) The few good things to say about 'Space Marine' overall are that they captured the FEEL of being an Adeptus Astartes very, very well. They also kept to the lore as best they could, which isn't easy when the stated goal was to make the game accessible to non-fans of the Warhammer 40K universe. Overall, a 5/10.",
            "review_score": "-1"
        },
        {
            "review_text": "-Gets a super power axe -58328819319029310(real number)orks appear -Kills all of them in seconds and wants to take a brake -An ISIS pig carrying TNT(also called squig)comes out of nowhere -Titus accidently tries to melee him -Terrorist pig explodes and kills Titus -Titus dies happily shouting a quote  10/10 I will serve the emperor again",
            "review_score": "1"
        },
        {
            "review_text": "Heretics n chill",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game for $10 because i loved the Warhammer 40K series. Warhammer made great Dawn Of Wars in RTS modes but when i saw it in third person shooter i was thinking what the ♥♥♥♥? When i took a closer look i saw Games Workshop + THQ. Now that blew my mind. I loved Games Workshop's games and THQ's games so i imediately bought it and played it.  Firstly, the campaign is extraordinary with sublime graphics. The cutscenes had fine graphics and the gameplay was awesome! I could not believe how well developed the questline was. Just like Darksiders 2, there is fast gameplay in the campaign where you start off with a chainsaw and a bolt pistol. Then you start cutting all the bloody orks up and Captain Titus does not give a ♥♥♥♥! Next, throughout the campaign, you develop better weapons and a special skill as well which allows you to restore health. New melee weapons such as the Power Axe and the Power Hammer is unlocked. Some levels even allow you to equip a jetpack! When wielding the Power Hammer and flying on a jetpack, the combos and skills combined are absolutely magnificent. Smashing up Ork boyz and beating the ♥♥♥♥ out of ♥♥♥♥tards who get in your way! When combos are used correctly, you are unstoppable. Through out the game you also discover weapons such as sniper rifles, laser snipers, heavy bolters, plasma pistols, plasma bolters, grenade launchers and lots more! Later in the chapters, the chaos demons and the chaos space marines appear from a portal after Captain Titus was used as pawns by the Chaos lord. Now havoc wrecks the place and Captain Titus has to save the world with his two companions. In the campaign there are 17 chapters! Each chapter last about 15-45 minutes (depending on difficulty and your skill level). After the campaign there is an epic epilogue to it but, we aren't finished yet.  After finishing the campgain there is an online option! In the online section there are 4 main different types of games. Versus, Versus Private, Exterminatus and Exterminatus Private. Versus is basically PVP where you can choose between lots of modes such as capture the point, team deathmatch, free for all, capture the flag and seize ground. The versus servers are still really active filled with players. Versus private is basically versus except it is only for friends and solo. Exterminatus is the co-op survival mode. You can play with 2-4 players on 4 different types of maps. After every 5 rounds you switch to a different map but with harder monsters. In Exterminatus you kill Orks. On the last wave (bonus wave), stage 21, chaos demons and chaos space marines invade you and you must kill them all to win. Exterminatus private is basically exterminatus but with friends/solo only. In multiplayer mode there are 41 levels in total. When you reach level 4 you obtain a place where you can customize you space marine/chaos space marine. When you progress through each level you can unlock more gear, weapons and perks. Armour can be unlocked by finishing really hard challenges or you could buy custom ones from the steam DLC shop for Warhammer 40,000: Space Marine. In multiplayer there are 3 types of main roles:  Tactical: Carries a default bolter and a deafult chainsaw Devastator: Carries a default pistol and a deafult heavy bolter Assault: Carries a default pistol and a defaul chainsaw The tactical is the support. The devastator is the tank and the Assault is the damage per second. The assault usually wields power axes and power hammers or it can wield relic items from the DLC.  This is one of my favourite Warhammer 40,000 games. Games Workshop already makes great RTS and THQ makes great bloody third person gamers such as Darksiders II. If you are a Warhammer 40,000 fanboy, love THQ games, love Games Workshop games, love Darksiders II or if you love thrid person shooters/third person games then you HAVE to buy this game. DO NOT wait any longer buy it now! The only thing that's stopping you is the price -_- Although it is slightly over priced ($39.99) you might want to wait a while until it's about 50%-75%. Stunning graphics, unbelievable gameplay, good multiplayer, great features and epic weapons and classes! MUST PUT ON YOUR CHRISTMAS WISHLIST FOR 2015!!! DON'T LISTEN TO THE ♥♥♥♥ED UP NEGATIVE REVIEWS! BUY THIS GAME NOW 9/10 Chop 2015",
            "review_score": "1"
        },
        {
            "review_text": "I love me some 40K but this is a Clunky snoozefest.",
            "review_score": "-1"
        },
        {
            "review_text": "Dis gaem be top kek of the east side streets homies",
            "review_score": "1"
        },
        {
            "review_text": "In the far future, there will be only war.",
            "review_score": "1"
        },
        {
            "review_text": "Stomp the herecy to dust, literally!",
            "review_score": "1"
        },
        {
            "review_text": "More brutal than the old testament",
            "review_score": "1"
        },
        {
            "review_text": "great visuals, good gameplay and a finely crafted varying storyline.  the difficulty is right up there and not in a good way. artifical difficulty at the hands of greater NUMBERS is all the apparently unskilled combat designers could come up with. oh and did i mention the rubbish checkpoints and heal/finisher times that are not only long and ardious but also allow you to take damage while going in for a healing meale kill.  6/10, good game, but is all grinding and very little enjoyment when (usally) you are in a wave fight where all you do is fight waves of increseingly difficult enimies untill you wonder why you even bothered. on that point i really cannott reccomend.",
            "review_score": "-1"
        },
        {
            "review_text": "I loved this game on playstation but the port to pc is horrible if you have a quad core computer. Stay away from this game on computer and just get it on xbox or playstation.",
            "review_score": "-1"
        },
        {
            "review_text": "Not unless you are a fan or like difficulty spikes. This game is fun but boy are there some downsides. For one the health system is complete garbage there will be so many times you can't heal because if you do you will die during the animation as you must do executions to regain health and you are stuck in a very long animation while a horde of enemies just wails on you for a full 5 seconds. You will normally lose more health than you gain so you will have to do it so many times and hope not to die or really just only use it on the last couple enemies. You will be using your guns so much in this game. The hack and slash sucks as there is a very small amount of combos, the dodge roll doesn't dodge as you still get hit by any swings near you, and your guy swings like he's under an ocean of syrup. Very easy at times and very cheap and frustrating at others with some weapons being completely useless after a certain level and never used again. There is fun to be had but i would definitely say get this on a sale don't pay full price no matter what.",
            "review_score": "-1"
        },
        {
            "review_text": "Quite the nice game",
            "review_score": "1"
        },
        {
            "review_text": "If you like the tabletop and ever wondered what being a Space Marine would be like, then you need this game. It is as close to how they should look and feel as we have.   Simple storyline, but like all 40K gets complicated past just orks. The controls are fun, and a nice variation of well know weapons, and some newer ones mixed with some simple combos makes this great fun.  And the multiplayer is great, who doesn't love Space Marine on Space Marine action?",
            "review_score": "1"
        },
        {
            "review_text": "BROTHER! I AM HIT!  But I don't really care, this game in bloody amazing.  WHY DO YOU NOT OWN THIS GAME!",
            "review_score": "1"
        },
        {
            "review_text": "Really neat game, fun as hell. A point to note is that they managed to make your character both incredibly sturdy, as a space marine should be, yet also vulnerable, in a way I wouldnt have though possible.  Apparently if you are a lore purist, the protagonist will irk you incredibly (he doesnt act as an ultramarine should or something along those lines). But I am not.",
            "review_score": "1"
        },
        {
            "review_text": "great visuals, good gameplay and a finely crafted varying storyline.  the difficulty is right up there and not in a good way. artifical difficulty at the hands of greater NUMBERS is all the apparently unskilled combat designers could come up with. oh and did i mention the rubbish checkpoints and heal/finisher times that are not only long and ardious but also allow you to take damage while going in for a healing meale kill.  6/10, good game, but is all grinding and very little enjoyment when (usally) you are in a wave fight where all you do is fight waves of increseingly difficult enimies untill you wonder why you even bothered. on that point i really cannott reccomend.",
            "review_score": "-1"
        },
        {
            "review_text": "Game is not set in spess, misleading title 0/10 IGN",
            "review_score": "1"
        },
        {
            "review_text": "Warhammer 40k Space Marines is Relics first outing in the 3rd person shooter spectrum of the series and its a competent shooter that's lacking in variety, has a forgettable story with a very sequel bait-ish ending and on top of all that its single player lenght is nothing to write home about, barely passing the 7th hour mark on your first playthrough. All in all it is a commendable effort thanks in large part to the brutal and visceral combat worthy of your time and money.",
            "review_score": "1"
        },
        {
            "review_text": "Burn the heretic. Kill the mutant. Purge the unclean. It is better to die for the Emperor than to live for yourself. Fear denies faith. Foolish are those who fear nothing, yet claim to know everything. Brave are they who know everything yet fear nothing. Happiness is a delusion of the weak.",
            "review_score": "1"
        },
        {
            "review_text": "Just incredible, The visual stuff will make you feel nice. If you are a fan of the Warhammer universe... then this is a must",
            "review_score": "1"
        },
        {
            "review_text": "This game rules the galaxy. FOR THE EMPRAH!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Borrows pretty heavily from popular TPS titles, but a lot of the features are tried and true and even if you've played enough of those games, the setting itself is enough to make it interesting. It felt a bit closed off, given you really only see the Ultramarines and Orcs (with various Chaos entities making their appearance eventually) when theres tons of races and chapters. If you love Warhammer and haven't played this, you probably owe it to yourself. There aren't many titles in the W40k library that focus solely on action so if you want to stop strategizing and just kill some greenskins, grab it on sale for a few bucks.",
            "review_score": "1"
        },
        {
            "review_text": "It's 3rd person action, with the Warhammer license, it can't be anything but good",
            "review_score": "1"
        },
        {
            "review_text": "Gearhammer 40ks of War.  3rd person action shooter in the Warhammer 40k universe. it has aged a good bit, and not to well overall, but let's break it down  Pros:  - great gameplay, every weapon and gadget feels rewarding to use  - Warhammer 40k  - the campaign is engaging  - story is typical Warhammer fare. it's quite fun  Cons:  - as any action game it becomes a bit repetitive  - graphics, especially details, could have used some polishing, sure looks nothing more than   average today  - no real replay value  if you're a Warhammer fan then I think this game is surely a must.  else I'd say it's a decent action game that will keep you entertained for one run. better get it on a sale",
            "review_score": "1"
        },
        {
            "review_text": "The singleplayer offers 6-8 hours of brainless fun. No alternate pathways, no high difficulty settings (hardly any deaths on the hardest difficulty available), quite generic 40k story with the most obvious twists imaginable. It still manages to make you feel like a badass. Biggest letdown: Final boss fight is a quicktime event. Did not try the multiplayer (maybe yet, most likely will not).  Worth a pickup while on sale for a few bucks (would have been disappointed at full price).",
            "review_score": "1"
        },
        {
            "review_text": "I am become death, destroyer of worlds.",
            "review_score": "1"
        },
        {
            "review_text": "Space marines can get pretty cuhrayzee too. Just look at those giant pauldrons go!",
            "review_score": "1"
        },
        {
            "review_text": "I LOVED THIS GAME!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Solid story, mechanics, and immersion. Needs a sequel.",
            "review_score": "1"
        },
        {
            "review_text": "I like this game, but there's a lot wrong with it. For example checkpoint saves. Why? Secondly, random slow down on screen and no FPS drop. Literally, things go slow-mo for no reason at times. And, this problem has existed for a while, too. With QA like this, THQ deserves the slide they're in. The Art department needs a ♥♥♥♥ing raise and employment else where as they did a fantastic job. In fact, all of Relic did great here, but THQ constraints no doubt put a damper on a lot of the awesome, leaving a great game just being good.   The biggest and most daming problem is the multiplayer: No ♥♥♥♥ing dedicated servers? Kiss my ♥♥♥♥ing ♥♥♥. Dedicated servers are ♥♥♥♥ing superior to P2P. Not only that, the game builds up the customization of the player only to LOCK AWAY ALL OF THE ♥♥♥♥ING CUSTOMIZATION. Almost no one plays online, so when you unlock the Customizer, you have ♥♥♥♥ all save for paint jobs. Unlocks are a fad that needs to ♥♥♥♥ing go the way of the dodo.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game great story better multiplayer if u can find a game grab it while it's on sale and march for macragge! This game deserves a sequel",
            "review_score": "1"
        },
        {
            "review_text": "Great singleplayer, but don't expect anything from the multiplayer",
            "review_score": "1"
        },
        {
            "review_text": "Cool and Good.",
            "review_score": "1"
        },
        {
            "review_text": "The story mode to this game is intense.  I remember the feeling I got, walking into an Imperial Guard encampment for the first time. It was like walking as a god among mere mortals.  I had just staved off a small horde of Orcs assaulting their defenses. After wiping them out, the plebian soldiers bowed and saluted - hailing me as their hero as I strode through their halls.  10/10, would be revered as a divine savior and ultimate badass again.",
            "review_score": "1"
        },
        {
            "review_text": "First of all, I'm a big fan of Warhammer 40k setting, tabletop games and PC strategy games; I LOVED the possibility of playing in an action game based in this universe: being a Space Marine, saving Imperial Guardsmen, meeting Inquisitors and defeating Chaos. I hoped it was good. I WANTED it to be good.  ...however, this game is AWFUL.  What we've got here is a boring, linear, repetitive third person action/shooter game. Every area is structured as an 'arena' where you'll fight endless hordes of Orks (with a little variation in the last hours) with no strategy, timing or ability involved.  Again and again. And again. These fights will be EXTREMELY easy, except for some difficulty spikes thrown randomly into the game. When you die you never feel like it was your fault, nor you feel to improve your abilities when you defeat 10 or 15 'Ard Boyz.  Then there's the setting. Every ambient has no details and is identical to the one before and to the next one, meaning you'll be frequently lost and looking for an exit. There's no map, but don't worry: once you've reached an area you won't be able to go back to the previous one, meaning that exploration is absolutely useless. Moreover, you don't get any strategic benefit from the environment, except for some explosive barrels or crates of ammo &amp; granades once in a while, so why bother?  In the end, this game was a huge disappointment for me. Go buy it ONLY if you know and love Warhammer 40k lore and the only thing you want to do for the next 15 hours is press X on your controller. Over and over again.",
            "review_score": "-1"
        },
        {
            "review_text": "Console port. Avoid. The controls are unreponsive and clunky after every action you stand around writing a book before you can move again. I can literally type out explitatives inbetween actions. The original Witcher had better and more responsive controls than this game. The only thing good about this game is the source material.",
            "review_score": "-1"
        },
        {
            "review_text": "That game sucks!!!",
            "review_score": "-1"
        },
        {
            "review_text": "Absolutely wild and bloody! Perfect for those who've allways wanted to play as an space marine. Worth the money. The multiplayer is quite good too, like it!",
            "review_score": "1"
        },
        {
            "review_text": "A perfect type of the 'Bad game'. I paid only 10€ this and I regret.  Don't buy it.",
            "review_score": "-1"
        },
        {
            "review_text": "Can't start the game. Keeps crashing as soon as it loads...",
            "review_score": "1"
        },
        {
            "review_text": "ufortunately this game has a multiplayer that is deader than the emperor due to a craphouse matchmaking system and no peer-to-peer multiplayer, whilst still relying on user hosting. needs a server browser.",
            "review_score": "-1"
        },
        {
            "review_text": "In the Emperor´s name, let none survive.",
            "review_score": "1"
        },
        {
            "review_text": "Hear me out here. I loved this game. Love-D. It became Horrible after it stopped getting updating. Do not even try to play multiplayer. It is buggy, it lags every time, perks never work and the fact that you can't change aiming sensitivity is bad because high sensitivity is bullcrap. The ONLY REASON to buy this game is because of it's great story, coustomization system and the Exterminatus game mode which is co op or solo. Graphics are great, gameplay is great, multiplayer is completely unbalanced, unfair and sucks. I still recommend it though. 6/10",
            "review_score": "1"
        },
        {
            "review_text": "Interesting single player.  Broken, unbalenced, laggy, poor, horrable, uneven... sooooo many bad words multiplayer.   Play it ONLY for single player, dont even BOTHER with multi unless you like being killed non stop by one hit wonders and having only the worst weapons untill you get to like level 30.",
            "review_score": "-1"
        },
        {
            "review_text": "I'm honestly not sure how this is getting such a positive rating. I've got a few hours on this and it's pretty horrendous. The controls are clunky as all get out. I've played other 3rd person games and didn't ahve any issue with them, but this one I just could NOT get into...",
            "review_score": "-1"
        },
        {
            "review_text": "I just want a simple shooter. But this one seems quite corridory and scripty and I do not like to learn dozens of key and mouse button combos for different attacks. It just not for me.",
            "review_score": "-1"
        },
        {
            "review_text": "JUST ♥♥♥♥ MY LORE UP",
            "review_score": "-1"
        },
        {
            "review_text": "Interesting game, but, the overall desire to have a CoD-like feel drove Developers to Create a non-cannon weapon just so they would have a Grenade launcher. Which is very over powering after players learn to compensate for the ingame lag. This, combined withthe copy killer feature, leads to some matches consisting of nothing but Vengence Launchers. Leading to anyone who isn't willing or unlearned in it's use to be smashed by any other players. The survival co-op game play is very entertaining, however, is limited when players come to relize that their weapon Perks can only be earned through PvP game play. The Campaign Feels very true to what I would expect in the perspective of the Space Marine, with the exception of the Chaos forces. The Chaos Marines feel far weaker, even on the Hardest difficulty, leading a Player to just ransack the levels witht he Plasm rifle or the Vengence Launcher.",
            "review_score": "-1"
        },
        {
            "review_text": "The game is rather pretty, the gameplay is okay, the feeling is rather good overall (Marines have 'weight', weapons feel about right). So, I guess hardcore fans of Warhammer 40k can actually enjoy the game quite a lot. As far as I'm concerned, though, I just can't be bothered playing this game any more. It's repetitive, the scenario is... quite standard W40k stuff, situations aren't varied, there's just not much to do. It's quite difficult overall, but not really challenging, since there aren't many different options you can try out: when you stumble on a hard fight, just reload untill you get through. And get to the next.  So... Not a bad game, but with less than 10 hours, after which I'll forget about it asap, I guess it's a 'non recommended'.",
            "review_score": "-1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "It's odd to see soo many postive reviews for this game. If you've been thinking about playing it, and paying full price...I'll tell you right now, don't even bother.  Pros:  1: one of the best melee combat system I've ever seen/felt/played. 2: jetpack tho  cons:  1: railroad linearity. 2: massive frame drops rendering game unplayable. (alt tab will temp fix). 3: 50%ish of the game was either slow walking, running, or standing on an elevator. 4: no quick save function. 5: very... VERY bad textures. 6: steep jumps in difficulty 7: 30$ price tag. 8: multiplayer is a literal joke. 9: enemy AI clip through walls. 10: most guns feel tacked on. 11: can only hold 1 melee weapon at a time. 12: bad voice acting. 13: huge empty area's with no enemy AI.  If you can catch it on a ridiculous steam sale. You need to check out the combat system. other then that, only wasted potential and disappointment lay ahead.",
            "review_score": "-1"
        },
        {
            "review_text": "Decent story, boring gameplay. I was tired with the gameplay in under an hour and just wanted the game to end. I completed it after forcing myself to finish it, but I'm never playing it again. I wouldn't recommend this game unless you've got a hard-on for the Warhammer setting.",
            "review_score": "-1"
        },
        {
            "review_text": "I know people like this game and I can respect their (wrong) opinions, but it feels like we are living the dreams of an inmature 12 year old kid. (To any 12 year old kids reading this, I'm talking about the 12 year olds on Call Of Duty with XBox Live and mics. THOSE people. Please don't be THOSE people....(If you are one of THOSE people, you have my pitty and not much else.)) The combat is ok, but not great in my opinion. I find the story completely unintresting. The multiplayer I found to be a frustrating experience as well, but you might fare better than I did.  If there are 50000 reviews saying that this game is fun, and you greatly associate with the reviewers, then go on ahead and play. Don't get me wrong. It's not a bad game, it's just not my kind of game.",
            "review_score": "-1"
        },
        {
            "review_text": "OMG THIS GAME IS SO AWESOME!",
            "review_score": "-1"
        },
        {
            "review_text": "I recommend this game but only if you are a Warhammer fan. The multiplayer isnt great, and the actual game is pretty short.",
            "review_score": "-1"
        },
        {
            "review_text": "A boring cash-in on the Warhammer franchise, this game somehow makes cutting and shooting Orks an incredible dull experience.",
            "review_score": "-1"
        },
        {
            "review_text": "In the past, I would've called this a really fun third-person hack'n'shoot. But now... now there's just not enough people online to say it's a great game. Which is a real pity.  Oh well.",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty standard action game. I didn't hate iit, but the characters and story bored me, and the setting was not that interesting. It's future sci-fi fantasy and I'm shooting things with a machine gun and chopping them up with a short-word. I guess I just expected more.",
            "review_score": "-1"
        },
        {
            "review_text": "In a world of big, dumb shooters, Warhammer 40k: Space Marine is a brontosouraus made out of lasers.   It don't make a lick of sense, but look at the flippin' lasers!",
            "review_score": "-1"
        },
        {
            "review_text": "Strip away the Warhammer 40,000 IP (Intellectual Property) and you have a standard FPS/shooter. If you love Warhammer 40K, then you will have already brought the game, most likely completed it and moved on to the next thing. Otherwise, there are better offerings out there",
            "review_score": "-1"
        },
        {
            "review_text": "This game sucks and i hate playing it and STEAM is what makes this game sucks so much. Bought the game from bestbuy Steam has jacked my game and went I want to play it I have to ask STEAM if I can play my game or not. I need to log in online to play it. Why do I need STEAM to play my game, I have the disks I did not buy it from STEAM. Also STEAM lies about not looking in your computer. I had other games install, that at one time did not STEAM to play them. After I was forced to intall STEAM to play this game I saw that STEAM had looked into my G drive and found my other games now inorder to play them I have get on line log into STEAM ask to play my games. I hate STEAM and the people that run STEAM don't answer emails or don't give me the infromation I need to stop STEAM from jacking my games.",
            "review_score": "-1"
        },
        {
            "review_text": "This game was just stupid as all hell. The sprites are ugly and Warhammer like usual put out a ♥♥♥♥♥♥ game.",
            "review_score": "-1"
        },
        {
            "review_text": "Loads of fun and challenges, nice cinematics. One of the most eyecatching things of this game is the seamless transition between ranged and melee combat. Highly recommended!",
            "review_score": "1"
        },
        {
            "review_text": "PRO * combat mechanics which are pure fun for an ARPG * sense of awesomeness ('I'm a walking giant of righteous death!') * very good UI quality * very good enemy hit indication and weight of weapons * very smooth and weighty animations  CON * linearity and scripting of levels * cutscenes and non-combat scenes nag away of the game's strenghts (combat!) * story rather shallow * no sense of awesomeness in multiplayer",
            "review_score": "1"
        },
        {
            "review_text": "The game really captures what it's like being a space marine of the Imperium.  You are put up against a hordes of enemies and the only way to gain health is to fight them. The health system works really well and keeps you in the fight and the executions you do to get health back is bloody awesome.  One of my favorite highlights of the SP campaign is the fact you get to see a warlord class battle titan.  The multiplayer is basic but fun. There are currently 2 gamemodes (1 more is coming) Annihilation (team-deathmatch) and Seize Ground (domination). Both are fun to play and when you die you get the option to copy your killer's loadout and see if you can do better with that.",
            "review_score": "1"
        },
        {
            "review_text": "Great story, brutal combat, lots of fun! The campaign was short, but grueling.",
            "review_score": "1"
        },
        {
            "review_text": "It's awesome!",
            "review_score": "1"
        },
        {
            "review_text": "First 40k Game that really captures the feel of the GW universe. Recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Do not miss it if you are a Warhammer 40K's fan, Space Muh-reen?! WAAAAAGH!",
            "review_score": "1"
        },
        {
            "review_text": "This is WAAAAH!!! The orginal bad asses break out in this 3rd person action game, where You'll be outnumbered and out gunned. Luckily you'll have a lot of really neat weapons to dispose your foes with. While the game is fun with a couple of really cool set pieces, it feels just a tad rushed and could have used a bit more time in the baking oven.  PROS -Decent graphics, good enough to run on the average PC -A veriety of really cool weapons -Story is pretty good -JETPACKS!! need I say more? jetpacks make this game so much fun it makes you wonder why they didn't just keep it for the entire game.  CONS -Background and level design is just bland -Music and voice overs are hit and misses. -A few bugs  Rating: 7.8/10",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games this of 2011! Must buy",
            "review_score": "1"
        },
        {
            "review_text": "Short but sweet is the best sum up of this game. From the start, you're thrust into the bloody, violent combat the 41st millenium is famous for. This isnt a game to sit back and snipe baddies, or take pot shots as enemies run by. This game is for those that like to get stuck in and chop your way through the horde. The combat feels powerful, every impact feels like it hurts. Speed is not an asset, your fury and toughness will mean more to you than quick reflexes. Single player campaign could of been longer, or more in depth, but still, it's rewarding and enjoyable. Online play has some issues, but for anyone that's a fan of, or has even just heard of Warhammer 40,000, it'll still be a ball of fun that keeps on rolling. The class-based system lets you pick the play style that suits you best, though you will have to deal with some pretty heavy drawbacks of each class. Dont let the marines' lumbering steps fool you though, once battle is joined, it's fast and violent.",
            "review_score": "1"
        },
        {
            "review_text": "Awsome game.Very interesting and challenging,but rewarding too.",
            "review_score": "1"
        },
        {
            "review_text": "Tons of bloody fun...nothing's better than wading through hundreds of orks, using your jetpack to fly around, and playing a devilishly hard co-op with friends.",
            "review_score": "1"
        },
        {
            "review_text": "Unbelievably good! Every bit of this game is as satisfying as the next.",
            "review_score": "1"
        },
        {
            "review_text": "The campaign is the video game equivalent of a summer action blockbuster: simple and short, but very brutal, visceral, and fun. Space Marine's multiplayer offering is where you should be spending most of your playtime, however. The class customization is surprisingly deep, and the gameplay is both well paced and tactical. The selection of maps is somewhat limited, but the included levels are excellent and provide the player with numerous strategic options.  Anyways, I could keep talking about how great Space Marine is, but I need to go purge some heretic scum.",
            "review_score": "1"
        },
        {
            "review_text": "It's mostly about the same thing - seek and destroy and survive. BUT it was quite fun :) Campaing was quite short but with interesting storyline. I'm more fantasy fan, despite of it I really enjoy it ;) especially brutal combat style with the orkz!  What is the main aspect of this game is it's multiplayer! Just a little bit of COD style with possibility of many skins and it's costumization. That's a big plus! ;) And also there are perks, skills, weapons, classes etc etc. What a pity this game is not so popular (about 300-600 players active in comunity center now even after brutal sales of the whole collection.  For the fans of WH:40K it's an awesome choice! ;) For the others it's a good choice as well, if you like brutal battles against the orks with guns and powers of Chaos.",
            "review_score": "1"
        },
        {
            "review_text": "Best 40k adaption since 'Space Hulk'. ;-)  WIth all it's lore and stuff...But weak multiplayer experience. Don't get me wrong: The multiplayer modes are challenging and most of the time very rewarding. The big 'But' on the other hand? Why didn't they allow us to play the singleplayer campaign with our friends in coop?!   In singleplayer you are always surrounded with two or more NPCs. It can't be that hard, swapping these airheads with real people?  One Star minus, because of the pointless DLC!  8 out of 10*",
            "review_score": "1"
        },
        {
            "review_text": "Rough around the edges with a fair assortment of little things that will get on your nerves, but also a pretty decent, if short, beat 'em up with an engaging mix of shooting and smashing. Get it when it's on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Great Warhammer 40k shooter.Good multiplayer and co-op survival.",
            "review_score": "1"
        },
        {
            "review_text": "AMAZING GAME! the multiplayer is great except for not having dedicated servers and in the campaign you slash at everything with your chainsword  if you think this game is anything like Gears of War you are either ignorant or a ♥♥♥♥ing idiot",
            "review_score": "1"
        },
        {
            "review_text": "Finnished the Single Player campaing in 5 hours. Can only say. I need more.  Action, Bloodshed, and valor on the battlefield!  5/5 Smileys!",
            "review_score": "1"
        },
        {
            "review_text": "A fairly underrated shooter that's gotten a bad rap. Sure the story is kinda lacking, but it has SPESS MAHREENZ. Sure it's an old game that has an almost completely dead online community, but it has SPESS MAHREENZ. Sure what little of the online community is left is plagued with tryhards and ♥♥♥♥♥♥ using the overpowered Vengeance Launcher, but it has SPESS MAHREENZ. Sure the game came out around the same time as Gears of Wat Tree, which also has it's own  'space marines' , but those guys suck and the game was only released for the cardboard box.    Also Sega is bound to add their logo to it eventually. I'm sure that's exactly what's needed to breath some life into this forgotten and mediocre title.   THEY ADDED THE LOGO! NOW IT'S PERFECT GAME!",
            "review_score": "1"
        },
        {
            "review_text": "If you are a person who appreciates the subtleties of the Warhammer multiverse, this game is for you. No better have subtleties been highlighted than smashing an Ork in the face with the Space Marine equivalent of Mjolnir. It even causes people to explode. Get this game. You will feel like the most badass badass to ever do anything.",
            "review_score": "1"
        },
        {
            "review_text": "Enter the world of the Ultramarines as it burns to ashes.",
            "review_score": "1"
        },
        {
            "review_text": "The definitive look-and-feel game for the Grim Darkness of the Grim Dark; as close as you'll get to being a Space Marine. Vague repetitive feeling at times, but worth the playthrough.",
            "review_score": "1"
        },
        {
            "review_text": "A must have for WH40K fans, a fun game for action lovers.",
            "review_score": "1"
        },
        {
            "review_text": "Life is the Emperors currency, spend it well. Might as well spend it playing Warhammer 40k: Space Marine, because this game´s serious fun, with lots of, no, TONS of slaughter and blood and fighting and slaughter... Really good Hack´n´Slay.... Emperor Protects!",
            "review_score": "1"
        },
        {
            "review_text": "Great atmosphere :)",
            "review_score": "1"
        },
        {
            "review_text": "Lots of blood, and I made an all-pink Space Marine for multiplayer.",
            "review_score": "1"
        },
        {
            "review_text": "Was expecting another Gears of WAAAGH! But it turns out removing the ability to use wall high cover makes them nothing alike. Campaign is as much a hack and slash with a large variety of weapons to change things up. All of the Chaos and Space Marine characters are boring but thats just 40k being 40k, thankfully Warboss Grimskull single handedly counter balances that by being the most badass side boss ever. Multiplayer is still active and can be alright if you can get around the mass amounts of capture point camping Devastators. Sharing a leveling and customisation system is a four player arena mode where you fight through mass orcs and capture points together which would have been the games highlight if they had made more levels.",
            "review_score": "1"
        },
        {
            "review_text": "Blending melee and ranged combat, Space Marine is an excellent representation of the 40K brand. Some may scoff at the choice of Ultramarines as protagonists, but they're handled well, not coming off as pompous Mary Sues like they do in the sourcebooks. Multiplayer is dead for the most part, but isn't the highlight anyways, so it's not a huge loss. Fun weapons, hordes of angry greenskins to shred, and plenty of blood for the Blood god.",
            "review_score": "1"
        },
        {
            "review_text": "awesome game !  everything is a bit slow but still very good 9/10",
            "review_score": "1"
        },
        {
            "review_text": "I'll try to keep this short.  I got this game because I've been a fan of the Warhammer 40,000 universe since I was a kid. I played Dawn of War almost religiously and when I saw that this was coming out... I was so excited. But money kept me back from getting it for quite a while.  The campaign has a story line worthy of the Emprah and takes you through the trials of Ultramarines Captain Titus as he purges a forge world of heretics and green skins. It takes 10 hours on Hard, with taking your time looking for Servo Skulls and dying repeatedly at some certain challenging spots. I say if you just rushed it, it'd take 8 hours or less.  This game feels.... AMAZING. The fighting is crisp, bloody, and feels so good. Seeing your enemies blow apart into fine red mist or ripping the jaw off an Ork Nob... let's just say it never got old, even with the repetitive executions. You just don't notice them after a while because you're too busy laughing with sheer glee as you destroy your enemies FOR THE EMPRAH!!  I wish I could double thumbs up this game. If you're not a Warhammer 40K fan, get this game. It'll change your mind. If you ARE a Warhammer 40K fan my question is why DON'T you have this game. It's worth it. If you're cheap, then wait for a sale. But you'll be kicking yourself the entire time that you didn't get it sooner.  The muliplayer has a smaller community now that the game has been out for a while, however, there are still matches every once and a while and they're ALWAYS a load of fun.  Get this game. Smash faces. SPESS MAREENS! ADVAHNCE FOR THE EMPRAAAAAH!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Basically if you are into progressive shooters and fast pace third person fun, this game delivers. I highly reccomend if you are even slightly curious about playing. TONS of customization options and lots of different weapon loadouts.",
            "review_score": "1"
        },
        {
            "review_text": "I've never had as much fun Screaming 'DIE YOU ORC!' as i did in this game.",
            "review_score": "1"
        },
        {
            "review_text": "Gnarly and beautiful. This game blends beautiful war-torn backdrops and over-the-top bloody violence. You play as Titus, one bad mofo for the Space Marines. He's a white hat. You get a very entertaining campaign (immersive) and fun co-op/multiplayer modes. Upgrades abound for online play. Tons of achievements. The game is gorgeous. Complete with fatalities and tons of ork guts. Yay!",
            "review_score": "1"
        },
        {
            "review_text": "IMPERATOR VULT!",
            "review_score": "1"
        },
        {
            "review_text": "doesnt work on windows 10  edit: i reinstalled it and now it workd again",
            "review_score": "1"
        },
        {
            "review_text": "I think after over 30 hours of play time i can give a good reveiw on this game.   First off its 9/20/15, which is many years after this came out. I picked it up for the now outrageous price of 29.99 for a pretty old game. The main reason i got it cause i like tps games and i heard this was simular to GEARS OF WAR, so i scooped it up mainly for multi player. I should let you know that the game is very small on its player base, i mean usually peaks around 200 players on the weekends 120 during after school hours. So you can find games. Usually only on the Controll point maps. I have also heard that the dlc like 'Dreadnaught' nobody is playing, and for good reasons. One of which is that is 9.99 to get a chance to play a dreadnaught mode that nobodys on basically ever. You would have to get a clan or a group or something to play the mode with. The next thing is the servers. you may be asking youself 'Are the servers still even on any more?' the answear is yes. This is because of non-dedicated servers which is a blessing and a curse. It allows the game to always be online without servers, but this also means some lag here and there.   Here is my absolute FAVOURITE part... The customization. its awesome the ways you can change your space marines amour, its colors, etc... So many combos you can do. there is also wepon customization and some perks you can choose from in the loadout section. I think there are 15 wepons to edit your loadout with and at least 20 perks. The charicter DLC and wepon skins DLC are also really cool and i have picked myself up a few of those, which in my opinion ARE worth it if you like making you char a toatal badass in multiplayer.  Campaign is okay i am not a big campaign person in general and mainly bought the game for multiplayer   So if you like the Warhammer series or third person shooters in general i would pick this up.",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game again recently for PC after having it for years on 360. I love the Campaign, and the Co-op mode, but the vs mode of this game is the worst thing ive ever played. Any attempt at balance has been abandoned long ago, and wave upon wave of plasma cannon fire awaits anyone dumb enough to dip in a toe.",
            "review_score": "1"
        },
        {
            "review_text": "This is a fantastic action game that displays some of the best use of the Warhammer 40K IP yet. The combat is raw and thrilling; all the guns feel fantastic and the melee combat, although seemingly shallow on the surface, does have it's own nuances to it that provide an adequate challenge whilst being completely satisfying. Transition from melee and ranged combat is seamless, and all battles are fun to fight. I had loads of fun tearing apart hordes of Orks.  Any third-person action fan or 40K fan in general should pick up this game. I found the PC controls to be better suited for this game. This new series has huge potential and I hope we see a sequel, one day, despite THQ's collapse.",
            "review_score": "1"
        },
        {
            "review_text": "Love it. Very true to the 40K universe.",
            "review_score": "1"
        },
        {
            "review_text": "So much Dakka..... What can me do against such Flashy Bitz?!",
            "review_score": "1"
        },
        {
            "review_text": "The melee healing mechanic makes a nice change from the usual FPS model.",
            "review_score": "1"
        },
        {
            "review_text": "Violent multiplayer fun. A must for any Warhammer 40K fan",
            "review_score": "1"
        },
        {
            "review_text": "This game is a straight up Gears of war clone set in the Warhammer universe. The story is very basic but functional. The graphics look very nice and the sound is reasonably good. The game is also very easy to get into. There is a downside and that's the gameplay itself. Space Marine is to one sided. In the end you'll only fight, fight and fight. It just gets to damn repetive after a while. In the end t think everyone playing this will get bored a little bit and that doesn't do a Warhammer game any justice. Still if you like this franchise you might be amused with this one. Overall rating is about a 7 out 10...",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant game, needs a follow up to clerify the clifhanger ending. Online gaming needs a dedicated server to stop the lag and game crashes. But above all that, still a brilliant game.",
            "review_score": "1"
        },
        {
            "review_text": "endless slaughter is always fun",
            "review_score": "1"
        },
        {
            "review_text": "I love this game but i lost my activation key. how do i get it back so i can play again!? i have my product code but dont know how to get it",
            "review_score": "1"
        },
        {
            "review_text": "Ok. Orks in Space is pretty silly. But you don't have to buy into the Warhammer Universe at all to enjoy this 3rd Person SciFi Shooter. Relic, the superior RTS company, makers of Homeworld, Company of Heroes and Dawn of War, deliver a great, physical experience with this game. The weapons 'feel' great. You shoot, you swing your axe and you stomp on your enemies to finish them! Carnage everywhere. I recommend a rumbling gamepad for the PC version. The task is simple. You walk through great looking, well designed levels spilling Ork blood, while listening to some of the best voice acting in video games, led by British stage &amp; film actor Mark Strong as your character, Titus. The story is that interesting, that I almost want to know more about the Ultramarines and the Warhammer Universe. And then there's 4 Player Co-op and Multiplayer.",
            "review_score": "1"
        },
        {
            "review_text": "Große Jungs in dicken Anzügen. Was will man mehr?   Big guys in big suits. What more could you want?",
            "review_score": "1"
        },
        {
            "review_text": "Killing space orcs with chainsaw swords, axes, hammers and bolters, what more can a man ask for?",
            "review_score": "1"
        },
        {
            "review_text": "If you are the kind that love to go wild and hack and slash, WarHammer 40k Space Marine is the game for you. If you think this is all bout tactical placement and stuff like that, you are wrong. SpaceMarine isn't anything close to the original tactical WarHammer Game. It is just a spin off, a side project that they decided to work on. Although I would really recommend getting this game, I suggest getting it during one of Steam Massive Sales instead. Overall this game is pretty well made and have solid gameplay, but it does have it's flaws.  Ratings Gameplay: 6.5/10 Visuals: 8/10 Storyline: 6.5/10 Overall Rating: 7/10",
            "review_score": "1"
        },
        {
            "review_text": "Definately worth checking out...you won't be disappointed.",
            "review_score": "1"
        },
        {
            "review_text": "I love me some Dawn of War 2 and Warhammer but I wanted to like this game more than I did like it. Being a giant Space Marine is kind of limited in a way... slow to move, empty environment. Had fun playing and enjoyed the story but not a perfect 10.",
            "review_score": "1"
        },
        {
            "review_text": "Great action game for non fans of 40k, and Epic for fans. You truely feel in the fight when you stick your powersword into a nobs mouth... lol",
            "review_score": "1"
        },
        {
            "review_text": "While this game gets pretty repetitive pretty fast, the game still keeps WHAT it is repeating fun, challanging, and engaging. And in terms of fanbase, this game is great for the Warhammer 40k newbies, intermediates, and even the lore junkies",
            "review_score": "1"
        },
        {
            "review_text": "just awesome.  Pros + Lots of action nice looking game great co-op game Cons - Its wants a good audio card or a good processor othersie you will have audip problems Multiplayer is mosly a ghost town Co-op lack of new maps Low weapon variaty  Good game overall!",
            "review_score": "1"
        },
        {
            "review_text": "Don't expect a very deep or ground-breaking game in the story or gameplay departments. Do expect ridiculous amounts of fun bringing glorious slaughter to hordes of orks and traitor scum in the name of the Emperor.   8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Emperor, who art in Tera. Hallowed be thy name. Thy judgment come on xenos, heretics, and traitors.",
            "review_score": "1"
        },
        {
            "review_text": "On the 'pro' side: Brilliant soundtrack, good art, an awesome combat system, and a storyline over three scheduled games (that currently only has one done...).   On the 'con' side: Extremely linear shooter game.  I enjoyed it, worth the money spent on a Steam Sale.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, pick it up while its on sale.",
            "review_score": "1"
        },
        {
            "review_text": "This is my favorite franchise of steam and this one seemed to hit my 100/10 rating  I love this game and you should try it out",
            "review_score": "1"
        },
        {
            "review_text": "Loads of fun and challenges, nice cinematics. One of the most eyecatching things of this game is the seamless transition between ranged and melee combat. Highly recommended!",
            "review_score": "1"
        },
        {
            "review_text": "As a Warhammer 40K Fan, this is the ultimate game. I love it and I really hope there will be a sequel someday if SEGA wants to support it.  I hope Relic is already working on their next Warhammer 40K game.",
            "review_score": "1"
        },
        {
            "review_text": "Best shooter ever",
            "review_score": "1"
        },
        {
            "review_text": "I always wanted to walk in the boots of a Spacemarine, instead of controlling them from topside and Warhammer 40k SpaceMarine doesn't dissapoint. Messy, Gory and simply awesome! For The Emperor!!! \\m/",
            "review_score": "1"
        },
        {
            "review_text": "An Awesome game really just please sega and relic please please please release space marine 2 you really don't know how much we're waiting for this",
            "review_score": "1"
        },
        {
            "review_text": "For the Empire!!",
            "review_score": "1"
        },
        {
            "review_text": "If you like Warhammer 40,000, if you like Space Marines and if you like slaying Orks... this is your game. The story is decent and the gameplay is fun. The only big downside is, that you only fight Orks and Chaos. The 40k Universe has so many Armies that some more alternation woundn't be such a problem and way more fun.  Multiplayer was totally unplayable when I first played it (Peer-2-Peer) so I wouldn't suggest to buy it for the MP part.",
            "review_score": "1"
        },
        {
            "review_text": "As long as graphic glitches don't kill you at the start of mission 1 (NVIDIA bug?), this game is pretty awesome and entertaining. I'll rate it 8/10.",
            "review_score": "1"
        },
        {
            "review_text": "SO MUCH FUN! You hit like a god damn truck, yet the game still manages to be challenging. I absolutely loved how this game painted the conflicts of Warhammer 40k...absolutely awesome! The combination of melee and ranged combat is exceptional, though I think a game like this could (possibly) benefit from some RPG elements; the only reason I say that is because this game just left me wanting to experience more!!  DEFINITELY would recommend.",
            "review_score": "1"
        },
        {
            "review_text": "bolter !!! chainswords!!! dead orks !!! just great !!! 40k mayham !!!",
            "review_score": "1"
        },
        {
            "review_text": "Great fun, good action. A little short, and sometimes a bit repetetive, but overall, lot of fun.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty doubtful singleplayer - can be appreciated by fans of W40K universe only, even in story-line aspects. Multiplayer is a total different story - it OWNS. Surprisingly, there's no place for arcade, it's well-balanced and allows you to play your personal game-style. (no seriously - it ALLOWS, because of huge amount of perks and weapons) FOR THE EMPEROR! - No doubt - Relic did a very good job. PS Special Thanks to Akella for good localization :)",
            "review_score": "1"
        },
        {
            "review_text": "This game is the boss.",
            "review_score": "1"
        },
        {
            "review_text": "get this game",
            "review_score": "1"
        },
        {
            "review_text": "This game is great buy it so I can shoot you in multiplayer. Muhahahhaha",
            "review_score": "1"
        },
        {
            "review_text": "Awesome. The gameplay, visual design, and sound are superb. This is some of the most fun I have had in a multiplayer game for quite some time (cooperative Exterminatus mode is my favorite so far). If you never heard of Warhammer 40,000, you should play this game. If you like Warhammer 40,000, you would be stupid to miss this epic-laden masterpiece.",
            "review_score": "1"
        },
        {
            "review_text": "Fear me for I am Blessed and of the Emperor! I serve Him and His Will! Fear me for I am Space Marine!",
            "review_score": "1"
        },
        {
            "review_text": "40,000/10",
            "review_score": "1"
        },
        {
            "review_text": "Very good game lots of fun and especially as it is still on sale for less than €5 well worth it. Only draw back is the multiplayer side of things that has dropped off. Though having said that I dont think it would take much to kick it off again. All in all worth the money even for just the single player end of things",
            "review_score": "1"
        },
        {
            "review_text": "this is such a great game, Get on it!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Great story single player, Awesome horde mode multiplayer with your own created and customized space marine. Earn more weapons and armor, customize it all. For the Emperor!",
            "review_score": "1"
        },
        {
            "review_text": "This game does not warrant a purchase if you're after the MP side. I got more melee kills as a Tactical than as Assault. I pump round after round with a bolter into an enemy and die from three chainsword attacks. The camera doesn't move with your melee attacks, so you're literally having to attack toward the camera in order to be quick enough to hit the enemy, yet you have no idea if he's rolled away by now.  TSM vs ASM, it's a roll-fest for the TSM and he'll immediately grenade spike if he has them, which WILL kill you. ASM is just a jump/slam spam, over and over. Not like he has to hit you more than just a few times to kill you anyway. I had more kills against tacts using the pistol variant than the actual bolter. ASM vs ASM, slam fest like you wouldn't believe. Most of these end when other players attack from ranged. TSM vs DM, you can pop in and out and throw grenades and win against set-up devs. They just spam rounds until an ASM or TSM out-maneuvers them. Disappointing.",
            "review_score": "-1"
        },
        {
            "review_text": "Multiplayer makes this a grand experience, no doubt. The story has a few holes as far as 40k lore goes, however it does have a distinct action feel for 40k",
            "review_score": "1"
        },
        {
            "review_text": "This game is your friend, it removes heretics.",
            "review_score": "1"
        },
        {
            "review_text": "Best warhammer 40000 action",
            "review_score": "1"
        },
        {
            "review_text": "Great game hope they will make sequels to it",
            "review_score": "1"
        },
        {
            "review_text": "Third person shooter with solid mechanics and great style. It has JET PACK Did I mention it has JETPACK???  The coop and multi is lots of fun besides a few issues 1) Game picks a random player to do client side hosting. Many people can't host 6v6 or 8v8s so you get terrible lag in mp 2) Not enough class variety 3) Caters to noob tube 4) MP (was) almost dead so unless you play at the right times or join a clan you're looking at a really long queue  Other than that a great game to buy with friends on sale",
            "review_score": "1"
        },
        {
            "review_text": "Big marinez of win",
            "review_score": "1"
        },
        {
            "review_text": "This is a lot of fun!",
            "review_score": "1"
        },
        {
            "review_text": "You kill orcs as a space marine what more do you want?",
            "review_score": "1"
        },
        {
            "review_text": "Awsome war",
            "review_score": "1"
        },
        {
            "review_text": "Blood, gore, orks, THUNDER HAMMER + JUMP PACK!  What are you doing? Why haven't you bought it yet?",
            "review_score": "1"
        },
        {
            "review_text": "If you want to simply kill stuff, with some gore, this is an excellent game. Only 4 years old now, it holds up great because killing is timeless.",
            "review_score": "1"
        },
        {
            "review_text": "Good multy !",
            "review_score": "1"
        },
        {
            "review_text": "This is by far one of the best Warhammer 40k games I've ever played, and I've played quite a few. Gameplay is fantastic, visuals are beautiful, and Exterminatus is hella fun, especially when you have an organized group of friends. Voice acting is great, too. The only problem I have with this game is the lag.   To sum everything up, I'd give this game a 9.7/10, but in my opinion, it's best if you buy it when it's on sale.",
            "review_score": "1"
        },
        {
            "review_text": "This game takes place in a setting where you, an Ultramarine known as Captain Titus lead two other men to defend the world from the Chaos and Orks; that's it. There are 16 chapters of this game where you will literally run around, shoot, or beat up people up using your close combat weapon while trying to complete the objective. Overall, the story of this game is bland and the characters are duller than the countours of a sphere, they literally have no character. So far, the game's strongest point is its combat which is extremely fun. You'll have a blast ripping through orks with a power axe or slamming down the emperor's justice upon them using the Thunder hammer, along with destroying large enemies with the Meltagun.  So if superhumans wearing unrealisticly heavy armor beating up Orks and Daemons with a variety of weapons is your type of game, give this game a go.  Oh and nobody plays multiplayer, so hold your breath if you think you're going to play coop mode with anyone else, or have a fair chance of being a balanced match with players your level.",
            "review_score": "1"
        },
        {
            "review_text": "arsekicking good time guaranteed and a treat for gamesworkshop fans, the co-op mode is also addictive",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this game!",
            "review_score": "1"
        },
        {
            "review_text": "The progression of the game was basically like this:  Wait, did I just chainsaw some Ork's face? So much blood! Okay it's getting repetitive. Still reptitive. This looks like the end. Yeah this is the... wait what? Hey this is pretty sweet. The end.  Directed by M. Night Shyamalan.",
            "review_score": "1"
        },
        {
            "review_text": "f*cking great",
            "review_score": "1"
        },
        {
            "review_text": "An exceptional action game! With beatiful graphics, lots of orc blood and a great attention to the details of the Warhammer 40k universe. The strategy games don't show half of the Space Marine's true potential, but in this game you can really feel the great power and thecnics of this warriors. I strongly recommend this game! If you like games like God of War and want to know what REALLY feels like fight with a Space Marine this is the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "Review on the fly  Beautiful game. low amount of bugs if any. keeps a beautiful story mixed will balanced game play and interesting cut scenes. it tells a story of the 40k lore that can be picked up by newbies and veterans alike.   Pros - Beautiful design - strong story - good gameplay - space marines are the best  cons  - voice acting is hit and miss - orks can be very... 'obvious' - short story - my space marine kept hearing a voice of Khorne... saying bad things.. but on the next play through it didnt occure.. i thought i was being stalked by a ghost or daemon.. or something  Now strike in the name of the empire",
            "review_score": "1"
        },
        {
            "review_text": "SPACE MARINES  TAKES MORE THAN THAT TO KILL AN ORC  SPACE MARINES  EE JUST KILLED DA NOB  SPACE MARINES",
            "review_score": "1"
        },
        {
            "review_text": "Adrenalized gun-play, twisting and weaving plot-lines, overwrought character development and a bombardment of on-screen displays, Warhammer 40K Space Marine is a magnificent piece of art. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Space Marine is an amazing additon to the Warhammer 40k gaming universe. This game exceeded my expectations and featured a fantastic single player and multi player experience. In this game you take on the roll of a space marine charged with defending one of your planets that is under attack.   Space marine is a 3rd person shooter which has fantastic combat, excelling at rewarding the player with gratifing kills as well as challenging combat. The story also succeeds in enveloping you into the 40k universe, and was well thought out.  if you are looking for a fun single player campaign, or have ever wanted to play as a space marine battling the odds; This is your game!  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Alright, it's a Third Person Shooter, with focus on action, melee/ranged combat with a variety of weapons and combos, with lots of greenskin and chaos enemies to slaughter. If you look for action and violence to cool off after a stressful day, this is your game. Now the boring part ends. DO YOU WANT TO RUN INTO A METRIC TON OF ORKS AND CHAINSWORD THEM ALL TO DEATH? DO YOU WANT TO JUMP PACK AND THEN STOMP THE ORKS INTO A FINE RED MIST? DO YOU WANT THE KILL THE MUTANT, BURN THE HERETIC AND PURGE THE UNCLEAN IN THE NAME OF THE GOD EMPEROR OF MANKIND? If yes. Go ahead MELEE COMBAT FEELS WEIGHTY AND GOOD You're full of momentum and power as you smash through enemies. NO AWFUL COVER BASED COMBAT. Screw cover, that's for sissies. You're a SPESS MAHREEN YOU ARE THE EMPRAH'S FURY Your cover is manliness and your faith is your shield  AWESOME WEAPONS Bolters feel pretty darn good to fire, it's not some sci fi machinegun, it's a huge freaking weapon fire self propelled mini rockets that will blow up inside your enemie's heads.  Chainswords have a great and angry ROAR as you smash your way through a WAAAAGH!.  And execution animations are repetitive but ever so satisfying.  If you like action? Get it If you like Warhammer 40k? Get it   ps: This game makes you like the Ultrasmurfs a bit more, and has even some Bloody Magpies in the end.",
            "review_score": "1"
        },
        {
            "review_text": "The jocks at my high school played Warhammer at the top of the stairs in front of the biology classroom, so naturally I didn't know what it was, not being a very jockish fellow. Zoom ahead a decade or so and, turns out, if you go to the dentist, and they accidentially put novocaine in your frontal lobe, 40000 Space Marines is a great game to play to put your dopamines back in while your limbic system is drunk. No one told me how many orcs would explode if I just like tapped X furiously for a few hours, but in that way, it's a Skinner Box for the over-roided homunculus. My only complaint is that the spacemarines were not as masculine as I imagined (I mean, where is the nipple armor? xtreme stuntz? the firm handshakes?).",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, multiplayer and singleplayer. ",
            "review_score": "1"
        },
        {
            "review_text": "Should be called Warhammer 40,000 Elevators 'cause that's just how many there are of those damn things serving as poorly hidden loading screens. Feels like I'm back in Metroid Prime on the Gamecube.   However, even tho the game is quite repetitive, it's a really polished third person shooter. Recommending it to everybody.  Just get it on a sale.   Note: Multiplayer isn't even worth it. For the Single player experience only.",
            "review_score": "1"
        },
        {
            "review_text": "You're killing crazy Orcs with your sawblade and rip them apart. What else do you need to know? :D Game falls little bit short ~6h and puts you into the Warhammer-universe. If you don't like an 'dull' hack&amp;slash, don't buy this - otherwise, you'll love it! :)",
            "review_score": "1"
        },
        {
            "review_text": "I owned this originally on my PS3, put so many hours into it and love the game a lot! ^_^ unfortunately i am yet to put similar hours into it on here lol",
            "review_score": "1"
        },
        {
            "review_text": "Nonstop action",
            "review_score": "1"
        },
        {
            "review_text": "If you are a fan of the warhammer games you have a good time with this one. Take control of a spacemarine in a third person action packed shooter. Fight your way onto and through a now ork infested planet in single player, hold off against waves of orks and chaos in Exterminatus or go head to head with other players in Vs.",
            "review_score": "1"
        },
        {
            "review_text": "Still as much fun as a barrel of monkeys. Out of love for the genre and sheer desire to rip some Ork heads off, I just had to install it again. Recently I've been more involved in stealth games, and like with any good balanced diet, there's nothing better than to switch it up with a greasy, unhealthy does of carnage. Beef Carnage.",
            "review_score": "1"
        },
        {
            "review_text": "Ok, here's a proper review/opinion on the game. I think this is by far, one of the greatest Third Person Action game I've ever played BESIDES Darksiders series. The story, as a 40k nutjob as myself, is fantastic even though there are some problems with the connections to the actual 40k lore and logic (though honestly alot of games mess that up). The gameplay makes you feel like a god damn space marine. You don't need cover as the armor is the only cover you'll ever need. The melee attack feels like the touch of the empeor. The only thing I wish they could have work on is the multiplayer. The mulitplayer, I'll be honest, felt a bit tacked and was added at the last minute. Espeically since I did see the alpha build of this game in either 2009 or 2010. What kinda makes me sad about this game is that there probably won't be a sequel which the developer have shared ideas on the story. And to be honest, that the story would be an awesome thing to experience. It might suck but at least we get to see what the interpretation would be like to see that happen.",
            "review_score": "1"
        },
        {
            "review_text": "If you like playing Warhammer 40k then this is a must play. One of the few games where you feel like your playing an actual Space Marine.",
            "review_score": "1"
        },
        {
            "review_text": "An epic game. Battle through legions of orcs and hordes of chaos. I just love Warhammer (both Fantasy and 40k). It is a dark universe filled with the desparate sense of inevitable doom. Enter and relax. And welcome to the desert of the real ;)...",
            "review_score": "1"
        },
        {
            "review_text": "This is a Kick ♥♥♥♥ game i hope there is anohter one.",
            "review_score": "1"
        },
        {
            "review_text": "why do i have to buy the game if its installed onto this computer just on a different user ",
            "review_score": "1"
        },
        {
            "review_text": "God damned ♥♥♥♥ing awesome game from start to finish. Environments are quite repetitive (but pick up near the end) and the combat is usually the same throughout, but I'll be damned if it isn't absolute carnage and a wet dream for a Warhammer fan. Lots of fun.",
            "review_score": "1"
        },
        {
            "review_text": "You get to fly around and split people in half with a chainsword. What more do you need?",
            "review_score": "1"
        },
        {
            "review_text": "Very hard if you dont know what your doing.",
            "review_score": "1"
        },
        {
            "review_text": "For anyone who loves a good shooter game, this is the game for you, especially if you are a WarHammer 40k fan. The campaign is very fun and the story is entertaining for both those who are versed in Warhammer 40k lore and those are not. On the multiplayer side, the 3 classes provide the player many different ways to play and is very fun.",
            "review_score": "1"
        },
        {
            "review_text": "If you were to have only the melee combat, or only the shooting, this game would be merely average. It's the way they are both used fluidly to seamlessly let you go from raining lead onto distant orks, and then with a single button press slamming a chainsword into a nearby orks throat that makes this game so much fun. Multiplayer isn't particularly noteworthy, with fairly generic gametypes, and a small amount of maps (many more are available through DLC, which I've heard great things about), but it still manages to be a fun and worthwhile diversion that I find myself constantly coming back to.  Space Marine hits every note any great action game should. You'll have a great time, and feel like a badass throughout.",
            "review_score": "1"
        },
        {
            "review_text": "Hair-etical smurf captain saves the day!",
            "review_score": "1"
        },
        {
            "review_text": "Recommend it for all fans of Warhammer 40k universe and for all who enjoys 1st person action games. :) Lots of fun",
            "review_score": "1"
        },
        {
            "review_text": "This game is balls-to-the-wall awesome from beginning to end. The phrase 'SPACE MARINE' said with a cockney accent will haunt you to the grave. Buy it. Play it. Love it. Cry for the sequel that may never be. I wish it were longer. 4/5",
            "review_score": "1"
        },
        {
            "review_text": "i didn't know that it is action !",
            "review_score": "1"
        },
        {
            "review_text": "this is the game your dad always thought you were playing on your 'nintendo.' The main character is kinda dadly. The evironments look like they were built from things you can buy at a hardware store. Do I need to say anything else oh yeah it's a hella rad and violent action game.",
            "review_score": "1"
        },
        {
            "review_text": "I think this is the only game I pressed 'new game' immediately after I have finished it. Oh, and I returned to my table top marines.",
            "review_score": "1"
        },
        {
            "review_text": "A fun romp through 40k 's grim offerings, but the fun wears thin pretty fast. though i do want to know what happens to the main protagonist after the game ends, so the game cant have been that bad. :)",
            "review_score": "1"
        },
        {
            "review_text": "I very straightforward shooter, but moderately challenging (on normal, not using the fury ability and seldom using special weapons) and pleasingly brutal. Buy it from the discount. FOR THE EMPEROR!",
            "review_score": "1"
        },
        {
            "review_text": "Halo meets Gears of War is the best way to explain the game play, it's a third person to first person shooter with tons of action, incredible cinematics and very satisfying senses of victory. I'm an avid Warhammer 40K tabletop gamer and this game, much like the Dawn of War series really helps bring the 41st millenium to life and let you really feel just how intense it can get. Absolutely love the game, definite recommend giving it a try even if you don't know the series, there is enough story to fill you in and let you enjoy it even as a novice to the Warhammer universe!",
            "review_score": "1"
        },
        {
            "review_text": "fun game realy hope people enjoy it as i ",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ yes I love this game and you will too",
            "review_score": "1"
        },
        {
            "review_text": "Fun! Dead-simple gameplay, tons of enemies, and beautiful graphics. Only negative? Cheeseball voice acting. Overall, well worth it.",
            "review_score": "1"
        },
        {
            "review_text": "best game out right now",
            "review_score": "1"
        },
        {
            "review_text": "cool game!",
            "review_score": "1"
        },
        {
            "review_text": "As a HUGE Warhammer 40k fan, I can proudly say that this game is bloody AWESOME! While the story isn't the greatest thing ever imagined, it does capture the spirit of the Warhammer 40k universe extremely well, and the action here just can't be beat. Plus, the cliffhanger ending implies a sequel on the horizon (and the multiplayer is pretty fun too). Go buy it now! Do it!",
            "review_score": "1"
        },
        {
            "review_text": "There's a lot of great things going on for this title. Beautiful graphics, good voice acting and visceral intense combat. But for everything right there is something wrong. While the graphics are nice there is a real lack of variety in the level design. I know it's mostly because of the universe but the color scheme is drab and levels are linear. The weapons mostly feel very underpowered and my lord this game is repetitive. If you want to kill orks, this is mana from heaven but that is literally ALL you do. Kill orks, hit switches rinse and repeat. Another gripe, I just killed 2500+ enemies through the course of the game and I'm rewarded with a terribly unsatisfying ending. Do I still recommend this title? Yes but only mildly. Because of the constant checkpoint saves you can jump in, kill some orks and get out so there's that. One last thing, do NOT get the DLC unless you plan on playing MP. It won't do you any good in the SP campaign.",
            "review_score": "1"
        },
        {
            "review_text": "Way too few people play this game. The Online community is too small! :D",
            "review_score": "1"
        },
        {
            "review_text": "Great game full of blood and gore!",
            "review_score": "1"
        },
        {
            "review_text": "My precious ...",
            "review_score": "1"
        },
        {
            "review_text": "If you were to have only the melee combat, or only the shooting, this game would be merely average. It's the way they are both used fluidly to seamlessly let you go from raining lead onto distant orks, and then with a single button press slamming a chainsword into a nearby orks throat that makes this game so much fun. Multiplayer isn't particularly noteworthy, with fairly generic gametypes, and a small amount of maps (many more are available through DLC, which I've heard great things about), but it still manages to be a fun and worthwhile diversion that I find myself constantly coming back to.  Space Marine hits every note any great action game should. You'll have a great time, and feel like a badass throughout.",
            "review_score": "1"
        },
        {
            "review_text": "This is my favorite franchise of steam and this one seemed to hit my 100/10 rating  I love this game and you should try it out",
            "review_score": "1"
        },
        {
            "review_text": "Must have for every WH40k universe fan. However it is just a teardrop of the sea from the ultimate massacre.",
            "review_score": "1"
        },
        {
            "review_text": "Easily one of the best games I have played from steam. Has some flaws like bad checkpoint locations and mobs that corner you and explode, but working as intended.  One thing they do not advertise well is that 'multiplayer' also includes 1 to 4 player coop. Whats important here is the 1 part. You can load a coop map by yourself and level alone if you cannot find coop partners. Its not the best idea, but its much better than coop dying once people move on.  I sat on this game for a long time having no idea how amazing it was. Very polished. Short of some collision detection implementation (mobs being pushed into walls or other objects) this game feels bug free so far. I have never once saw something that was game breaking, which is rare these days.  All the weapons are fun to use. All the environments are interesting and fairly detailed. Story is interesting with enough characters to enrich the experience.  If you have not tried this game, you should. If you are not into warhammer (im not) that will not have any impact on how awesome this game plays.",
            "review_score": "1"
        },
        {
            "review_text": "Personally my favorite FPS",
            "review_score": "1"
        },
        {
            "review_text": "God damned ♥♥♥♥ing awesome game from start to finish. Environments are quite repetitive (but pick up near the end) and the combat is usually the same throughout, but I'll be damned if it isn't absolute carnage and a wet dream for a Warhammer fan. Lots of fun.",
            "review_score": "1"
        },
        {
            "review_text": "The campaign is the video game equivalent of a summer action blockbuster: simple and short, but very brutal, visceral, and fun. Space Marine's multiplayer offering is where you should be spending most of your playtime, however. The class customization is surprisingly deep, and the gameplay is both well paced and tactical. The selection of maps is somewhat limited, but the included levels are excellent and provide the player with numerous strategic options.  Anyways, I could keep talking about how great Space Marine is, but I need to go purge some heretic scum.",
            "review_score": "1"
        },
        {
            "review_text": "I have to admit that I am no fan of Hack and Slay Games... Not even of 3rd Person Action Games... But this Game will crap you from the first minute of play and don`t let go! And if it happen to be that you`re a fan of the Warhammer Universe its a must have! Its not a Button mashing Game and I´m greatfull for that. It just gives the right mixture of Action Battle and the Feeling of being a merciless War Mashine for the Emperor, standing bevor your Enemis without taking Cover or even flinch a bit. Be sure to take a look at the great demo, that will give you a good once-over the game.",
            "review_score": "1"
        },
        {
            "review_text": "A very good and enjoyable game. Set in a fantastic universe, that has alot of fluff and lore. A must for any 40k fan, no matter their allegiance to the Emperor.",
            "review_score": "1"
        },
        {
            "review_text": "Was new to the Warhammer series and enjoyed the game, its got very cool slow-mo moves. The game is very linear, very easy to find what way to go. Port is well done, while it doesn't seem to have any PC exclusive video settings it's very smooth. What I didn't like its that it doesn't really have a good cover system, other than that it's great. Oh yeah, starring the badass Space Marines!",
            "review_score": "1"
        },
        {
            "review_text": "Otherwise known as Gears of Orcs must Die:Featuring Buzz Lightyear  A must play.",
            "review_score": "1"
        },
        {
            "review_text": "(No Spoilers) So, I'm a big fan of Warhammer Fantasy, and as such, I've been exposed to Warhammer 40k a fair bit. This game made me actually go out and build a 40k army (Daemons, btw). It's that cool. It's like a power fantasy mixed into the world of 40k. The first thing you do in the game sets the tone, and the rest of the game does not disappoint.",
            "review_score": "1"
        },
        {
            "review_text": "this will be awesome!",
            "review_score": "1"
        },
        {
            "review_text": "Game has nice Warhammer 40,000 feeling in it. Gameplay is simple and singleplayer campaing is fun hack and slash. Multiplayer is also great fun. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Single player was a blast and even quite a challange at points. Multiplayer was a big let down with laggy connects and broken weapons (Plasma Cannon); haven't played since the Dreadnaught release so maybe its gotten better since then. Other thing about multiplayer is that it is always CSM vs SM on mirrored maps. No dirvesity in maps and no oppotunity to play Orkz or other races. The Last Stand (or what ever it is called) was entertaining if not for seeing what broken item builds worked the best.  Play it only if you are a hardcore 40K fan and even then take it with a grain of salt.",
            "review_score": "1"
        },
        {
            "review_text": "An excellent game. Anyone who enjoys the Warhammer sereis would like it even if it is a fps. The FPS is excellent, its thrilling and amazing. It is a perfect combination of shooting and slashing. Plus there are many types of guns that can wet your appetite. The ending is a bit of a downer but they can rectify that with a sequal which they better make. I'd say this game is wroth 5-10 bucks but only because it is a bit short. Short but extremely exciting.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games I've ever played. Space Marines don't take ♥♥♥♥ from anyone!",
            "review_score": "1"
        },
        {
            "review_text": "wish i had more friends who played this game",
            "review_score": "1"
        },
        {
            "review_text": "One of the best single player shooters I have ever played. If you are into the Warhammer 40k universe, this is a must. In case you are not, good graphics, a decent plot, solid FPS mechanics and a great overall atmosphere await you. I even picked up the soundtrack and listen to it in the car.",
            "review_score": "1"
        },
        {
            "review_text": "It's fun to mass murder orcs, what can I say?",
            "review_score": "1"
        },
        {
            "review_text": "feels true to lore and like you are actually a space marine. well done. recommended! tons of fun. cant wait for the free co-op dlc coming soon.",
            "review_score": "1"
        },
        {
            "review_text": "Just finished and i 'Love This Game!'. Awesomnes in each minute of the game with load of epicnes... if you didnt play it you must to... you must FOR THE EMPEROR!!!",
            "review_score": "1"
        },
        {
            "review_text": "nobody else has this. i feel lonely. get it ",
            "review_score": "1"
        },
        {
            "review_text": "Рекомендует Warhammer 40,000: Space Marine ",
            "review_score": "1"
        },
        {
            "review_text": "Seriously the best of all Wh40k games!",
            "review_score": "1"
        },
        {
            "review_text": "Man, this game is awesome. I don't know why I haven't written a recommendation about it yet :V its just that awesome it is a must play. it has the feel and play that makes you feel like you really are a space marine. The sounds, the action, the carnae makes it a worthwhile playthrough. Even on easy the game is quite difficult. Anything higher and wow, its a real challenge. Online play is fun with friends, my only complaint is the networking and hosting is quite....♥♥♥♥♥♥. Even if I'm the 'Host' i have ♥♥♥♥ net, and others have better net than me :I its kinda crappy but then again my nets ♥♥♥♥ so oh well. The game is worth while playing all in all and I hope it comes out with a sequel sooner.",
            "review_score": "1"
        },
        {
            "review_text": "They don't make em like this anymore. Best Warhammer 40k game ever, really put the universe to a whole new level. It sucks that THQ closed down and now this game will never get the sequel it deserves... or any other good Warhammer 40k game ever... Overall this game was one of the best Hack and Slash I ever got to play.",
            "review_score": "1"
        },
        {
            "review_text": "So much Dakka..... What can me do against such Flashy Bitz?!",
            "review_score": "1"
        },
        {
            "review_text": "I hope they come out with the rest of the series. I love the Warhammer 40K universe, and this game did it complete justice.",
            "review_score": "1"
        },
        {
            "review_text": "Pure awesome Space Marine carnage!",
            "review_score": "1"
        },
        {
            "review_text": "awesome game !  everything is a bit slow but still very good 9/10",
            "review_score": "1"
        },
        {
            "review_text": "A great break from cover based shooters, Space Marine does a good job of remaining faithful to the 40k franchise.",
            "review_score": "1"
        },
        {
            "review_text": "Great controls and an overall very high production value. Be a space marine and smash everything that dares to insult the Emperor by existing. Does what it says on the box. Tactical options are limited and the game can sometimes feel repetitive but combat remains satisfying throughout. The game does a good job of capturing the 40k universe through great levels and classic character tropes. Unfortunately the story is mind-numbingly predictable, but that is the case more often than not with 40k.  If any game in this IP deserves an expanded and beefed up sequel, it's this one.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun single player campaign! Devs need to support the multiplayer for Steam port though. Even though I have friends who play this game, 'invite friends' in private matches doesn't function at all. Also cannot find any public games either :(",
            "review_score": "1"
        },
        {
            "review_text": "great game! buy it and play online! Great multiplayer.",
            "review_score": "1"
        },
        {
            "review_text": "Good game. The MP is fun but probably dead by now (matchmaking :(). Single player campaign was short (~5-6 hours) but well made. Story was very standard Warhammer, nothing exciting. Sound very well done, and the graphics fit the setting very well.",
            "review_score": "1"
        },
        {
            "review_text": "Is it just me or is this game criminally underrated? This game is the best ♥♥♥♥♥♥♥ third person shooter hack and slash hybrid I've ever played and even if your not into 40k JESUS you have to play this sweet hotness.",
            "review_score": "1"
        },
        {
            "review_text": "Its well known that you can immeasurably improve any science fiction scenario by adding a mech-warrior. This game has one. &lt;/review&gt;",
            "review_score": "1"
        },
        {
            "review_text": "Great game, but dont buy it unless its on special, too short sadly, and the online community is dying off too :(",
            "review_score": "1"
        },
        {
            "review_text": "This is what stress relief after a long day feels like, but also what stress generation feels like after encountering the endgame where the CPU cheeses you out with lame tactics. RAGE",
            "review_score": "1"
        },
        {
            "review_text": "well i don't know what to say. GET THIS GAME!!! I'm a hardcore gamer so you better play this or i'll go all purple guy on ya",
            "review_score": "1"
        },
        {
            "review_text": "From a gameplay point of view W40k: Space Marine delivers as an above average TPS with equal focus on satisfying ranged combat and visceral melee combat that never fails to entertain. From a fluff standpoint... well, W40k purists, particularly those of the Ultramarines, might get a heart attack here and there. Ultrasmurfs not being anal-retentive about Codex Astartes? Heresy, I say!",
            "review_score": "1"
        },
        {
            "review_text": "Great game, perfectly in line with the W40K universe. Some clipping issue (hitboxes are sometimes too large), and the AI is lacking (but then again, who said an Ork is smart?). Unfortunately, being a game released in 2011 there are not many games going in 2015 so don't buy it just for that.  It was very exhilarating to slay Orks and Demons by the dozen. Weapons have a good feeling and if you're good at those games you'll have a blast (but play on Hard).",
            "review_score": "1"
        },
        {
            "review_text": "The Codex Astartes approves this game.",
            "review_score": "1"
        },
        {
            "review_text": "Good solid game - eventually got bored in a week.",
            "review_score": "1"
        },
        {
            "review_text": "well the multiplayer blows (and is dead now) cause they use matchmaking and the singleplayer is alright. really average game for a regular person, pretty awesome for a warhammer 40k fan",
            "review_score": "1"
        },
        {
            "review_text": "Although I haven't played it much on the PC, the pc port is just as good as the console in my experience. I'd highly reccomend this game, as while playing as an ultrasmurf sucks the single player campaign is still enjoyable and well tuned for the difficulty modes. The online is also awesome, as after many, very enjoyable hours I got to level 41 without even grinding.  Heavily recomended for 40k fans, and even most shooter/survival game fans.",
            "review_score": "1"
        },
        {
            "review_text": "After beating this game I felt sad that it was over. It was a great game. Not a lot of playtime, under 10 hours for singleplayer. But what it lacked in time, it had in graphics, sound, and story. I'm a bit of a Warhammer 40k fan ranging back from Warcraft 3 days of 40k Tower Defense and then I enjoyed the Dawn of War games. This game has action, blood, and a great system for k+m or controller. Play it for a good weekend of green skin killing!",
            "review_score": "1"
        },
        {
            "review_text": "An unbelievably wild ride as a Space Marine against an endless horde of Orkz. I originally picked it up to try and get into the WH40k universe. What I found was an incredibly immersive, action-packed, memorable and fun experience with a universe lovingly crafted over years. The characters are memorable, the combat is exciting and intense, and I've never felt more badass than when I've been playing the role of Captain Titus.",
            "review_score": "1"
        },
        {
            "review_text": "SPACE MARINES....ATTACK!!!",
            "review_score": "1"
        },
        {
            "review_text": "Nothing else I've ever played has just nailed the feeling of being a powerful walking nexus of violence quite like this game. The Emperor protects.",
            "review_score": "1"
        },
        {
            "review_text": "A truly epic journey through the war-torn universe of the 41st millenium. You can really feel the combat, the visuals are stunning and the voice acting isn't jarring like it so often is in games of this sort. The multiplayer modes are a good addition to the campaign, and add some longevity. I thouroughly enjoyed it. Here's hoping for more warhammer games!",
            "review_score": "1"
        },
        {
            "review_text": "FREAKIN AWESOME!!!!! This game, not to mention the multiplayer, is just a bloody ton of fun. Puns aside, you will not regret this purchase. If you have ever wanted to experience Warhammer 40k 'on the ground' this is it.  GO BUY IT ALREADY!!!",
            "review_score": "1"
        },
        {
            "review_text": "One title that kept popping up in my head whilst playing 40K's Space Marine was Gears of War, and while not as great as GoW it does come damn close as it certainly delivers the goods for being a brutal testosterone pumping 3rd person shooter/slasher. And so it should, for it is the grandaddy of anything oversized with big guns and therefor an ispiration to many. Thought GoW's chainsaw lancer was something revolutionairy, well think again.  Is this enough to recommend it to others though? I say hell yes, especially when you are a fan of the whole Warhammer 40K franchise because Relic did excellent job at representing this long running franchise. And even if you're not then try it anyways because you might end up becoming one during your Ork slaughterfest, like i did.  Like me you might have heard people say that it gets repetative after a while and though i do agree that the gameplay or gameplay mechanics are quite straight forward and not very versatile it did not bother me all that much. Just like with both the Cybertron games in the Transformers franchise the gameplay is fairly solid and that didn't seem to affect the scores that those titles got. I never got quite enough of grabbing yet another Ork and ripping his head off or curbing him with my massive space boots.  The expansive scenery keeps changing every so many chapters and so do the enemies and this does keep you interested. Especially the massive outdoor areas were impressive to walk around in. Massive bridges in the backround, hundreds of space crafts flying over head, a level build around a giant mech that you eventually will have to board, it all feels very grand and you really feel a part of it all. All this plus solid visuals and an entertaining storyline kept me going in wanting to finish my heroic mission in trying to save the planet.  You could finish the game in one go in i'd say roughly 6 to 8 hours or so which maybe not all that much but it's enough that it satisfies. And you could always jump in to the co-up mode or the multiplayers afterwards to extend the fun.  An 8/10 from me and well worth your money if you can enjoy mindless mayhem and slaughter.",
            "review_score": "1"
        },
        {
            "review_text": "Story mode is okay, what really hooked me is Exterminatus Mode. Gonna smash me some ork boys.",
            "review_score": "1"
        },
        {
            "review_text": "Action Adventure molds with the Space Marines 40k universe for a whole lot of fun. Worth your time if you're feeling in the mood to slay Orcs!",
            "review_score": "1"
        },
        {
            "review_text": "I've logged in through a VPN to leave this message and take a look at the store page. Are you reading this, Steam and THQ? I'm jumping through a hoop to leave a comment and check a store page. Going to the dentist is easier for me.  THAT SAID. The game is golden, and sates any cravings for carnage that you might have on a daily basis.",
            "review_score": "1"
        },
        {
            "review_text": "I always wanted to walk in the boots of a Spacemarine, instead of controlling them from topside and Warhammer 40k SpaceMarine doesn't dissapoint. Messy, Gory and simply awesome! For The Emperor!!! \\m/",
            "review_score": "1"
        },
        {
            "review_text": "I highly recommend this game for the hack slash and chainsaw lovers out there, and there is also a really good story plus great 3rd person shooter aspects, a win win in my book.",
            "review_score": "1"
        },
        {
            "review_text": "fun game!   Pros: u can kill tylerdurden in this game :D cons: tylerdurden plays this game :p  oh and u have to really like steamworks-matchplay cause u will be migrating host 98.9999% of the time i think they use  IW.net  lmao",
            "review_score": "1"
        },
        {
            "review_text": "This game shows you what it's like to be a Space Marine, supernatural warriors that make Marcus Fenix and Master Chief look like girls scouts. Raw power in bright blue armour, the Space Marine has no need for chest high walls.",
            "review_score": "1"
        },
        {
            "review_text": "It is a must play for any Warhammer 40K Fan!",
            "review_score": "1"
        },
        {
            "review_text": "Sate your unquenchable thrist for Ork blood as an Ultramarine. Multiplayer still has a community after 4 years and a bit (closing in on 5 now). I recommend this game to anyone who has friends to play the co-op together, I've tried it solo and it is quite fun.",
            "review_score": "1"
        },
        {
            "review_text": "Its dawn of war with less thinking and more killing and orkz",
            "review_score": "1"
        },
        {
            "review_text": "Ground shakes when Captain Titus runs...awesome 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Sometime you need to Bash stuff and shoot things. This works and feels perfectly toward that goal. Well done.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best game ever!",
            "review_score": "1"
        },
        {
            "review_text": "if you want to feel like a bada** with chainsaw this is your game its to bad that no one plays the online no more and the story is on the sort side but this game feels and sounds good.",
            "review_score": "1"
        },
        {
            "review_text": "really repetitive, but fun. Get on sale.",
            "review_score": "1"
        },
        {
            "review_text": "The Codex Astartes approves this game",
            "review_score": "1"
        },
        {
            "review_text": "Little repetitive but it feels amazing and the story is very Grimdark as it should be Really satisfying to play. Also the multiplayer was quite fun but is probably dead now",
            "review_score": "1"
        },
        {
            "review_text": "  Pretty good you play as SPEHS MAHREEHNS STEHL RAIHN/10",
            "review_score": "1"
        },
        {
            "review_text": "Some good ole Ork bashing is to be had, should you dare venture into the land",
            "review_score": "1"
        },
        {
            "review_text": "generic, but surprisingly solid third person romp. shooting orcs is very satisfying, all the weapons pack a great punch, but keep in mind a game cannot be anymore linear than this. Relic is known for their RTSs, not shooters. still, this was surprisingly OK.",
            "review_score": "1"
        },
        {
            "review_text": "An enjoyable, if short, romp. Violent, challenging, and chock full of heresy, just like one would expect froma game under the Warhammer 40k banner. A few portions have some annoying, albeit short, difficulty spikes, but all around very solid. It's linear and basic, but you're not buying this for atmospheric environments and deep storyline, you're buying it to eviscerate orcs and heretics with a chainsword.",
            "review_score": "1"
        },
        {
            "review_text": "Messy, but allot of fun!",
            "review_score": "1"
        },
        {
            "review_text": "Paid 3 cdn $ for collection on G/2/a :)",
            "review_score": "1"
        },
        {
            "review_text": "Space Marine is great for, well, playing Space Marines. The sound and feel of the Bolters - just as violent as you would imagine them to be. After beating the campaign I am quite content with just bringing my heavy Bolter out in the field at the online-horde-modus and hammer away at the filthy greenskins. Its great therapy, really ;)  If youre not really into the WH40K-universe, Space marines falls short im some ways. The Campaign is centered about slaughtering waves of enemies and the story, while solid, is not a blockbuster. At times connection can be less stable in onlineplay as well - so thats that.  If youre a fan, you will enjoy the unlockables, the customisation-options and the gore - then Id say wait for the next sale and get it for 5 bucks.",
            "review_score": "1"
        },
        {
            "review_text": "Nice game :D",
            "review_score": "1"
        },
        {
            "review_text": "Brutal first person hack and slash Very entertaining",
            "review_score": "1"
        },
        {
            "review_text": "Warhammer 40,000: Space Marine.  This game is great in so many ways from the rich atmosphere and storyline. To the exhilarating multiplayer (currently non existant) But as it is now I cannot reccomend it.  Now this is to say I can't reccomend the game if the reason you are buying it is to play the multiplayer aspect alone.   However if you want a great story driven singleplayer campaign revolving around Space marines 'Hulking human beings in even hulkier semi indestructable power armor fighting age old enemies in a near unwinnable war to save their race' then look no further. But if multiplayer/pvp is your desire Then I'd say look away.  Now the multiplayer isn't well... dead? necessarily, But it sure as hell isn't all that alive. Lets say for the most part it's a zombie and not in a good way. (If there is a good way with zombies) No you can for all extensive purposes get into a multiplayer match sadly though you may end up regretting it.   Currently you can only really ever find a pvp match in the most popular game mode 'Seize ground' where all the others are empty.(for the most part)   And when you find a server the game is player hosted from litterally all around the globe. Meaning the host may be in china japan or more commonly russia. (For steamers in russia multiplayer may be alive and kicking)   when you try to connect from halfway accross the world to the only match being hosted the results will have you mad all to hell when you smash an afk guy in the face with a hammer twice! after unloading two pistol clips and a grenade into him only to have him unscathed un-afk and kill you with a single shot from a shotgun-esque heatraygun seconds later.....(ARE YOU ♥♥♥♥ING KIDDING ME RIGHT NOW!)   Now that's not to say multiplayer wasnt fun. Like when I found a good server I was all 'Goody gumdrops batman! did ya see me chainsword that guys head off?! I mean holy ♥♥♥♥ when multiplayer connections in this game were equal it was... euphoric. But you just don't find any games like that anymore. Or if you do they're so few and far between that you'll already be exausted with the game by the time you find one. (my experience)  However for multiplayer in the co-operative game mode 'Exterminatus' witch is pretty much some of the most fun you can have. You may be able to find a match even today.  sadly for me though this doesn't save the games grace.  Really the issue I have with this game is it's multiplayer and to be honest the singleplayer campaign may be enough that I should give a positive review. But I just can't.     PROS:  -Great singleplayer campaign  -Tight singleplayer controls  -Awesome gameplay  -The game world pulls you in  -Encompasing multiplayer customization   -Compelling story/Characters  -Wickedly fun co-op (Exterminatus) if you can find a server.   CONS:  -Non dedicated multiplayer servers  -Player hosted multiplayer (Causes severe lag)  -Lag (You will unload multiple clips on someone just to have them kill you in 1 blow)  -Nearly no playerbase (Hard to find a game, youll be playing 1 game mode in multiplayer)  -Player animation slow down glitch (Forces character to slow down when running/walking for no reason)    As always these are just my views. I recommend watching some gameplay videos, reading some other reviews and doing some basic research before you make a decision.   I hope this review helps you with your purchase descision. Thank you for reading.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is fun, period.  If you're a fan of 40k and wanted to feel the dark and grim future where there is only war, this is it. It feels like Quake and Duke nuke'm all over again. The campaign has a good story that compells you to move forward without stopping for a break.  The sound and explosion are well done. The feeling of immersion is really nice. I love the way the space marine walks and the sound they make. Nice.  I'm not sure about replayability but for me, I bought this as a simple shoot them up in 40k universe. It delivers on that premise.  ",
            "review_score": "1"
        },
        {
            "review_text": "This game is really fun-or so i've been told. unfortunately, i may never find out for myself, because of an irritating glitch that causes the game to almost instantly crash every time i open it, and many others have found they had similiar issues. Relic/THQ, please release a patch and fix that. Thanks. ",
            "review_score": "1"
        },
        {
            "review_text": "Loads of fun.Versus Multyplayer is little lack luster, but none the less fun as nutz. Exterminatus mode brings countless hours of joy.",
            "review_score": "1"
        },
        {
            "review_text": "Purge the unclean! This is the perfect Warhammer 40k experience after the first Dawn of War collection. Another epic story from one of the world's best sci-fi universes told by an action-packed (Gears of War style without the cover system) gameplay with co-op and competitive multiplayer modes. It's awesome in many ways so you should include this on your 'must buy' list.",
            "review_score": "1"
        },
        {
            "review_text": "One of my absolute favorite universes, and a very well done game. traditional hack and slash meets bio-engineered super soldiers. This game was released four years ago and it still has a pretty good online base so that should speak for itself. The best part is this game will run on just about any computer i have an old toshiba laptop that i took with me ona road trip (this thing could probably be beat by most modern toasters) and this is one of the few games it could handle. settings were set to minimal, however it ran without much trouble. You can also use it to get into the warhammer universe because its immersive. there is a whole world of tabletop, RTS, and novels you will fall in love with.",
            "review_score": "1"
        },
        {
            "review_text": "While a bit repetitive, it definitely gives you the weight, impact and atmosphere that you expect from playing a Space Marine. Had a blast with it.",
            "review_score": "1"
        },
        {
            "review_text": "I felt that this game was more inline with the 40k books more than the tabletop. The idea that one Space Marine can cause such damage and be a huge threat all by himself...pretty awesome. Great fun.",
            "review_score": "1"
        },
        {
            "review_text": "It's British Gears of War. And that is alllll you need to know. :D",
            "review_score": "1"
        },
        {
            "review_text": "Great fun to play, the story is enjoyable although short especially as its a continuous game play",
            "review_score": "1"
        },
        {
            "review_text": "One of the best game ever!",
            "review_score": "1"
        },
        {
            "review_text": "Holy emperor, this game has everything from the start till the end, just a bit easy on hard ^^",
            "review_score": "1"
        },
        {
            "review_text": "For any fans of the warhammer 40k universe; this game should not disappoint you. It doesnt bring a lot of new stuff to the table, but with its great representation of orcs and its several bosses this games definitely deserves a big thumb up. Recommended!",
            "review_score": "1"
        },
        {
            "review_text": "Never gets old slaying thousands of orks.",
            "review_score": "1"
        },
        {
            "review_text": "Take your bolt pistol and your chainsword, take your bolter and your granades, and go...  You shall feel no fear.",
            "review_score": "1"
        },
        {
            "review_text": "An excellent, viceral action fighting game. If you like the Arkham games, Halo, and/or the Warhammer 40k universe, get this game.",
            "review_score": "1"
        },
        {
            "review_text": "It is a very good game with a lot of fun, i recommend it for all warhammer 40k fans and all those who want a good action game.",
            "review_score": "1"
        },
        {
            "review_text": "A fun hack and slash game, true to form!",
            "review_score": "1"
        },
        {
            "review_text": "A fun hack and slash game, true to form!",
            "review_score": "1"
        },
        {
            "review_text": "Great Story, Good Gameplay, Great Graphics, Recommended",
            "review_score": "1"
        },
        {
            "review_text": "I've seen the board game. I didn't like it. I thought the characters looked cartoonish and even in this video game they were odd looking. I didn't have high hopes for this game but I thought I would try it out anyway.  Playing it...it was like the game walked up to me, looked me in the eye, slapped me and told me to shut my big fat face.  The game is good!  This isn't the typical 3rd person shooter. In many scenarios you need to think of where you need to move to, stand at, take cover behind...what type of weapon would work best... You just cannot take the approach of 'charge in and kill everything'. You actually need to think. By the second half of the game you will get used to switching weapons in battle to match the conditions. You will also be using grenades regularly. Unlike in a alot of games where I never had to use them at all to finish the game. BTW, for those who are asking on the myriad of boards.... The Vengeance launcher. When you fire you can detonate the bomb by pressing 'R'. If you fire five, the sixth will detonate the oldest bomb in play. If you shoot and hit the bomb with a firearm, that too will set it off. But really, pressing 'R' is the easiest.   Also, there are no 'health items' in this game. At the end/start of certain scenarios you are healed. But in every other part of the game you have to excecute someone to heal or use the rage and hit/shoot people to heal. At first, I thought this was strange. But the game mechanic of it is actually quite appealing. It makes you work to stay alive and not just gobble up potions or etc...  The first thing you will notice about the game is that there is no jumping. Pressing the spacebar only makes you combat roll. At first this ticked me off. But, after playing for a bit, it made sense in the game universe. They are wearing advanced versions of big, heavy and bulky medieval armor. So of course they can't jump. That is why they have the jet packs.  The second thing you will notice is that there isn't the fake, ultra fast reloads you see in most games. Reloading takes a bit of time. It really makes you pay attention to your weapon and switch or use your melee weapon. With your melee weapon you can have various combos depending on which one you pick up. This was kind of a fun thing for me to try out to emulate fighting games.  The third thing...thankfully...is skippable cutscenes. If you've seen it once why watch it again? Unlike in some games I've played here on Steam where you cannot skip the cutscenes...being able to is always a plus and always something I will mention in order to get game makers in the habit of doing so.  Fourth...I had no in game crashes, stutters, drop in FPS or bugs. Insert a choir of angels singing 'Hellelujah!'   Fifth, this is not open world and it will pretty much funnel you from point 'A' to point 'B'. This wasn't so bad as the battles you would envariably encounter didn't feel repetative. The game designers did a FANTASTIC job of varying the opponents and creating different environments in order to get you to do things differently otherwise you would die.  Lastly... I will leave the finer points of the game to the other, better, reviewers on here. But to wrap it up. This game was GOOD. Maybe not great. But definitely worth the money even if it isn't on sale. Will I replay it? Probably not. But the first run through was good so I would very much consider it. Even if not, I will leave this game with good memories of it and a feeling of satisfaction in playing it.",
            "review_score": "1"
        },
        {
            "review_text": "'We March for Macragge!'  'We commend our souls to the Emperor. Let the story of our sacrifice burn across history like a shooting star. For death and for glory... for the Ultramarines!'   If you like Warhammer 40k, then you will enjoy this game. It is a simple 3rd Person Shooter that is pretty much a non stop Hack n Slash Shooty Ork massacre. I really enjoyed this game as this and the Dawn of War series are exactly how I feel the 40k universe should be.  Gameplay: 9/10 Story: 7/10 (was too short, but still a good 6-8 hours) Graphics: 9/10 Ork murdering fun: 9000/10",
            "review_score": "1"
        },
        {
            "review_text": "An excellent, viceral action fighting game. If you like the Arkham games, Halo, and/or the Warhammer 40k universe, get this game.",
            "review_score": "1"
        },
        {
            "review_text": "hack, slash... hack, slash... hack, slach and ENJOY! :D The sound is amazing and the feel of the weapons are amazing! This game gives a lot of fun!",
            "review_score": "1"
        },
        {
            "review_text": "+) Thrilling battle! Especially melee attacks! +) I really liked the idea of having both ranged or melee attacks as useful means of attacking. It depends on the enemies and situations. Lo~ve :D. +) Enough supplies. +) Fury and HP system was good. +) NPCs makes the campaign more fun. +) Good story, It gets you emotionally attached. +) Reasonable checkpoints. +) Good aiming. +) Great loading system. +) Great mapping tips. It never lets you wonder around like an idiot. The ways are easy to find too.  -) Edges of structure and environment is poor. Even though I'm shooting at the open area my bullet gets blocked in the air where there's nothing. Sometimes your target won't get hit for no reason because he's only exposed little bit out of the edge. -) Running was weird. I get that space marines are really heavy with their armors and all but the shaking and the way they run was awkward. -) Moving was a bit bad. It wasn't smooth. Not because the characters were heavy but because controlling wasn't optimized.",
            "review_score": "1"
        },
        {
            "review_text": "Good game, but a bit repetitive. If you like GoW!!!",
            "review_score": "1"
        },
        {
            "review_text": "Got it with the sale, 8 bucks wow lol.  This game is honestly the coolest thing ever and my first real experience with a Warhammer game. This game is from 2011 and looks damn amazing for its age.  Why isn't there more Warhammer games of this type? It's super fun and go go go. Granted a bit repeative but who gives a crap --- I could kill flithy xenos all night long and it would still be a good time.  Highly recommend it, even when not on sale. I REALLY HOPE Sega or whoever develops these games makes more of this genre or something similar.",
            "review_score": "1"
        },
        {
            "review_text": "Go on an unbridled rage-quest for the glory of the Imperium!  Its pretty fun. If you're into 40k you'll love it, if not then you probably won't understand much of it. My only complaint is that it needs better difficulty levels. 'Hard' feels like its medium difficulty. Shootas do quite a bit of damage, but grots/gretchins and boyz can be killed rather easily. On the other hand, its quite fun with your weapons being so impactful to be able to drop boyz left and right if you do some good combos and get some nice headshots.",
            "review_score": "1"
        },
        {
            "review_text": "This game does not warrant a purchase if you're after the MP side. I got more melee kills as a Tactical than as Assault. I pump round after round with a bolter into an enemy and die from three chainsword attacks. The camera doesn't move with your melee attacks, so you're literally having to attack toward the camera in order to be quick enough to hit the enemy, yet you have no idea if he's rolled away by now.  TSM vs ASM, it's a roll-fest for the TSM and he'll immediately grenade spike if he has them, which WILL kill you. ASM is just a jump/slam spam, over and over. Not like he has to hit you more than just a few times to kill you anyway. I had more kills against tacts using the pistol variant than the actual bolter. ASM vs ASM, slam fest like you wouldn't believe. Most of these end when other players attack from ranged. TSM vs DM, you can pop in and out and throw grenades and win against set-up devs. They just spam rounds until an ASM or TSM out-maneuvers them. Disappointing.",
            "review_score": "-1"
        },
        {
            "review_text": "Love this game!  Pros: -Great graphics that realy capture the aesthetics of WH 40k -Awesome gameplay, so far the only game that lets you feel like a badass spacer marine -Great sound effects -Good music -Fun multiplayer with both PvP and PvE modes Cons: -Wish it was longer -Disappointing final boss fight -Minor plot holes -Sequel- never ever :(",
            "review_score": "1"
        },
        {
            "review_text": "Best warhammer 40000 action",
            "review_score": "1"
        },
        {
            "review_text": "Too bad that the MP is dead now. Would love to have a game every now and then",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game. One of the absolute best WH40K shooters of all time. This one is true co-op, epic story, great gameplay, and truly a lot of fun.",
            "review_score": "1"
        },
        {
            "review_text": "THUNDER HAMMER! THUNDER HAMMER! THUNDER HAMMER!  Also the campaign is enjoyable and horde mode is fun.",
            "review_score": "1"
        },
        {
            "review_text": "No game makes you feel more like a member of the Adeptus Astartes than this.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game that really makes you want to hug a big demon off a tower.",
            "review_score": "1"
        },
        {
            "review_text": "A surprisingly fun game. I would describe the gameplay as similar to Gears of War, but with less emphasis on cover and more options for melee.   The 40K universe is brought to life in this game, and it's as violently beautiful as you'd expect. Heads are popped off by bullets and smaller Orks can be shoulder-bashed into nothing. The game encourages you to make violent melee executions as they are the only way to regain health during a heated battle. The game starts off as facing down the Ork horde until the late-game stages, when the focus suddenly shifts to the powers of Chaos, which are a good deal harder. This is a game that really deserves a sequel.   One thing I would note about this game (in my experience at least) is that it can be quite awkward to play with a keyboard and mouse, I would recommend a controller for the smoothest experience.",
            "review_score": "1"
        },
        {
            "review_text": "this game is for the warhammer fans a new start in the genre.  but it is one of the better games that follow the line and its only 1 drawback its short in playtime",
            "review_score": "1"
        },
        {
            "review_text": "Best Warhammer 40k game that is not a Dawn of War. Would face a Waaaaaaagh! again.",
            "review_score": "1"
        },
        {
            "review_text": "Solo campaign is a lot of fun, combat is well done and the graphice are pretty good for its age, decent game",
            "review_score": "1"
        },
        {
            "review_text": "Great online fun, allowing plenty of customization of Astartes Chapters.  It does need more maps, proper servers and allow more players on at a time. Chapter specific customization options would also help.",
            "review_score": "1"
        },
        {
            "review_text": "this game is way better then other warhammer games out right noe. brutal combat, easy controls and amzing customistaion and multiplayer make this game a great buy! ",
            "review_score": "1"
        },
        {
            "review_text": "Is the game amazing? Depends on what you're looking for. I bought it and it's DLC on sale, and all I was looking for was WH40k shooty/stompy/choppy action. 8/10 would buy again.",
            "review_score": "1"
        }
    ]
}