{
    "app_id": 553210,
    "name": "Warhammer 40,000: Space Wolf",
    "release_date": "2017-09-21",
    "developer": [
        "HeroCraft"
    ],
    "publisher": [
        "HeroCraft"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Online Multi-Player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Strategy"
    ],
    "tags": [
        "Warhammer 40K",
        "Turn-Based",
        "Games Workshop"
    ],
    "achievements": 79,
    "positive_ratings": 506,
    "negative_ratings": 231,
    "price": 17.99,
    "description": "Warhammer 40,000: Space Wolf is a card-driven turn-based tactical game which features RPG elements, containing a single player campaign, survival and PvP modes. Win these battles using the arsenal of weapons, abilities and cunning of the sky warriors.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/553210/header.jpg?t=1552297070",
    "minimum_requirements": "OS: Windows 7 Processor: 2.4 GHz Dual Core Memory: 2 GB RAM Graphics: Hardware Accelerated Graphics DirectX: Version 11 Storage: 3 GB available space Additional Notes: DirectX 11 compatible GPU is required to play the game! Attempts on launching the game on systems which do not meet minimum requirements will cause crashes! Integrated GPUs may cause significant FPS drops! The game is not fully compatible with legacy AMD Radeon HD Video Cards which don't support DirectX 12!",
    "recommended_requirements": "OS: Windows 7 Processor: 2.4 GHz Dual Core Memory: 4 GB RAM Graphics: 1 GB Video Card DirectX: Version 11 Storage: 5 GB available space Additional Notes: DirectX 11 compatible GPU is required to play the game! Attempts on launching the game on systems which do not meet minimum requirements will cause crashes! Integrated GPUs may cause significant FPS drops! The game is not fully compatible with legacy AMD Radeon HD Video Cards which don't support DirectX 12!",
    "reviews": []
}