{
    "app_id": 555570,
    "name": "Infestation: The New Z",
    "release_date": "2016-11-22",
    "developer": [
        "Fredaikis AB"
    ],
    "publisher": [
        "Fredaikis AB"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Online Multi-Player",
        "MMO",
        "Online Co-op",
        "Steam Achievements",
        "Steam Trading Cards",
        "In-App Purchases"
    ],
    "genres": [
        "Action",
        "Free to Play",
        "Indie",
        "Massively Multiplayer",
        "RPG"
    ],
    "tags": [
        "Zombies",
        "Free to Play",
        "Survival"
    ],
    "achievements": 63,
    "positive_ratings": 13726,
    "negative_ratings": 14201,
    "price": 0.0,
    "description": "The New Z is a FREE TO PLAY multi-game mode experience. Play BATTLE ROYALE and be the last man standing to win. SURVIVE with friends and gather loot, stash and trade. Go into wars against other groups in a massive OPEN WORLD. Three different separate game modes ALL IN ONE GAME.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/555570/header.jpg?t=1553854344",
    "minimum_requirements": "OS: Windows 7 - SP1 64bit Processor: AMDÂ® A8 3870 3,6 Ghz or IntelÂ® Core â„¢ i3 2100 3.1Ghz or better Memory: 4 GB RAM Graphics: NVIDIAÂ® GeForce GTX 465 / ATI Radeon TM HD 6870 DirectX: Version 9.0 Storage: 10 GB available space Sound Card: DirectX 9 Compatible Card",
    "recommended_requirements": "OS: Windows 10 - SP1 64bit Processor: AMDÂ® FX 8150 3.6 GHz or IntelÂ® Coreâ„¢ i7 2600 3.4 GHz or better Memory: 6 GB RAM Graphics: NVIDIAÂ® GeForceÂ® GTX 950, ATI Radeonâ„¢ R7 360 or better DirectX: Version 9.0 Network: Broadband Internet connection Storage: 15 GB available space Sound Card: DirectX 9 Compatible Card",
    "reviews": [
        {
            "review_text": "There are a lot of negative reviews on this game, so I just wanted to share my perspective being a long time War Z veteran. This is really not a bad game.... I would say that most of the reviews are negative because of the players who have never touched a WarZ game in their life, and expect to dominate in the PvP aspect of things. There's definitely a learning curve involved, but if you're willing to make an effort to learn the mechanics of the game, you'll be fine. Also, WarZ has always had a more arcade like feel, rather than a realistic one. If you don't like that, try a game like Day Z, or Miscreated. Devs seem for the most part active and involved, and are good at communicating with their community, unlike the devs of I:SS. From what I can gather, they seem to care about a lot more than just their pocketbooks. Another thing I was very concerned about was this being a free to play title, with in game purchases leading to pay-2-win tactics. However, I found that this is NOT the case when it comes to this game. Anyone playing for free can be JUST as competitive with a premium player. All in all, I think it's a decent game, and DEFINITELY an upgrade from I:SS Classic. Plus, it's free, and who doesn't like free?",
            "review_score": "1"
        },
        {
            "review_text": "*I have never heard of the New Z before it coming out on steam and tried it out for the first time yesterday*    First off I want to say this game is free. Meaning there should be no reason for you to listen to reviews. You should play it and see if you like it or not.    For a free game it's actually alright. There are no pay to win elements what so ever except being able to buy premium which is like unturned premium, yes you can buy meds and ammo for real life money, but you can also do so with ingame money which is easy to get. In my 3 hours I have well over 150 grand which is more than 20+ dollars can buy.  This game is mainly pvp, with meds that have cool downs to use during fight, barricades to block off bullets, and a sweet arcade feel for combat that is not realistic at all.  Killing zombies is quite rewarding as well and there is a skill gap in this game. You can find clans that go in together and run parts of the map on servers, so skilled gamers will enjoy this game.  Remember this isn't a survival game but a shooter with zombies, where you find loot like meds, armor, guns, etc. and then go to pvp. That's the whole game. But it is fun to play and free. All negative reviewers are â™¥â™¥â™¥â™¥ing stupid or are rating this way to harshly.  Overall: 7/10 *Fun to play with friends every now and then and free*",
            "review_score": "1"
        },
        {
            "review_text": "The servers are a bit unstable. otherwise its easy to gear up and pvp, if you used to play WarZ/ISS i reccomend, if not, do not play.",
            "review_score": "1"
        },
        {
            "review_text": "I nominate this game for game of the decade.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a good free to play alternative to the mainstrem survival horror titles (Dayz, H1, Forest) However this title lacks teh depth of the aforementioned and is more comparable to the likes of Unturned. The lack of depth results in players becoming fully equiped quickly and having no further goals as the game lacks Base building and a crafting system.  Additionally the freemium which this game has adopted could be a turn off for consumers as it does result in many fustrating barriers to entry for free player such as having to wait to be revived after death. It also results in some elements that could be considered pay to win by some however it is mitigated by allowing free players to earn store credit through gameplay which can purchase MOST of the same items.  This game provides a slighty more immersive experience than that of unturned however lacks many of the crafting and base building mechanics which is expected by a game in this genre, however it is still a good survival horror game given its development history and ease of access.",
            "review_score": "1"
        },
        {
            "review_text": "okok so this game is awsome yes but i hate that you have to pay to be black i think all the characters should be free because im a latino im brazilian maybe i want to play a character my skin color but anyways the ex cage fighter has a black body but doesnt have a black head like his body is latino but he has no head option thats latino so it looks weird",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game !! I see alot of hate baout this game yes it was warZ, but it has had alot of updates since then and the name being one, who cares get over it.... this game is heading in a good direction. I have been supporting and playing this game since alpha, and with good updates like this i will continue too.  9/10 GG",
            "review_score": "1"
        },
        {
            "review_text": "As much as I despised 'The WarZ,' This game takes every step in the right direction to correct its prior self. It is fun, exhilerating, and do not believe the people who say it is pay to win. The loot spawns are VERY abundant and within 4 hours i have enough guns to last me and friends for the times to come. I recomend this game to anyone who is looking to have an exciting h1z1 experience, without the lies of having a f2p game (you know, what the h1z1 devs said it would be originally). This game does have a bit too much of an advantage towards players who have more playtime, but beginner servers help a little with that. Overall, bring your friends, because this f2p game is a pleasant experience,   Sound-6/10 GamePlay-8/10 Visuals-7/10 Community-KOS My grade-7/10 ",
            "review_score": "1"
        },
        {
            "review_text": "Infestation: Survivor Stories was by far my favorite game back in the day, minus the cheaters. Infestation: NewZ has brought back memories, old friends, and just a great PVP game in general. With new independent developers that had nothing to do with the old scam â™¥â™¥â™¥â™¥â™¥s, I am enjoying this game to the moon and back. It's sad to see people give out bad reviews because they are either A. bad at the game or B. thinking its the same old devs. Don't listen to the spam negative reviews, check for the honest reviews.",
            "review_score": "1"
        },
        {
            "review_text": "Great pvp game, easy to get into but hard to master",
            "review_score": "1"
        },
        {
            "review_text": "IF i said this game was bad id be lieing, its a propper zombie game with alot of weapon and armor variation and a quite nice size map, HOWEVER if you expect a game like day z... its basicly almost exactly what your are geting except for joker graphics and character controls, it feel to boxie and clunkie on the controles, the running is kind of bad imo then again no game is perfect.  so over all pro:  variety lots of weapons very dayz style kind of fun if you get the hang of it you may like it.  con: feels boxie/1990s style PAAAAAAAPAPAPAPAPAAAAYYYYYYYYYYYY TO WIN AF + in my opinion the game movements are kinda crap  not really a good game if you own dayz.",
            "review_score": "1"
        },
        {
            "review_text": "i have more than 1700 hours in non steam (Real infestation survivor Stories) now what do i think of NewZ?   NewZ is the one 'emulator' that became popular and even got the rights of the game to continiue building it . This game is amazing on PVP'ing and pretty much the developers thought of every little thing. This game deserves a (y) Because the devs are making every thing to make this game more and more popular and IT IS NOT THE SAME GAME AS SERGEI TITOV HAD (trust me its not) and deserves every minute of your gameplay.. i hope the developers continiue creating this game even more and more every single day  now what do i believe? i believe that you should play this game even if you hated the real iss because it is not the same game (not by the same devs) and btw! Fredaikis ! do something about the graphics if possible please. we are not back in 2012 :) much apreciated!  10/10 would play again.",
            "review_score": "1"
        },
        {
            "review_text": "Please don't listen to most of these reviews, they're just mad players from previous WarZ iterations coming back to bash a perfectly good game.  So here's my honest, UNBIASED review.  Pros: -Looks pretty decent. -Well optimized, I get a solid 4K60fps with a GTX 690 -No pay to win -Free -HUGE worlds -Lots of gun and melee weapons -Can be VERY intense  Cons: -Player runs kinda slow. -When I'm in a car and going fast, the game will freeze for 0.5 seconds every 5 seconds or so. -Footstep sounds are sketchy as hell, they lag sometimes, making you think a player is near you. -Too many foreigners playing on NA servers. (Trust me, everyone in a server speaking spanish gets old.. FAST)   ^^ These are far from all the pros and cons, but they're all I can think of after having JUST woken up.   Overall, I'd rate this game a 7.5/10 I'd highly recommend everyone at least take a look at this game, ignoring all the bad reviews.  ",
            "review_score": "1"
        },
        {
            "review_text": "Please don't listen to most of these reviews, they're just mad players from previous WarZ iterations coming back to bash a perfectly good game.  So here's my honest, UNBIASED review.  Pros: -Looks pretty decent. -Well optimized, I get a solid 4K60fps with a GTX 690 -No pay to win -Free -HUGE worlds -Lots of gun and melee weapons -Can be VERY intense  Cons: -Player runs kinda slow. -When I'm in a car and going fast, the game will freeze for 0.5 seconds every 5 seconds or so. -Footstep sounds are sketchy as hell, they lag sometimes, making you think a player is near you. -Too many foreigners playing on NA servers. (Trust me, everyone in a server speaking spanish gets old.. FAST)   ^^ These are far from all the pros and cons, but they're all I can think of after having JUST woken up.   Overall, I'd rate this game a 7.5/10 I'd highly recommend everyone at least take a look at this game, ignoring all the bad reviews.  ",
            "review_score": "1"
        },
        {
            "review_text": "The PVP in this game is great. And guess what, their anticheat works :)",
            "review_score": "1"
        },
        {
            "review_text": "my go to after matches and scrims",
            "review_score": "1"
        },
        {
            "review_text": "Much better than the previous Infestation. A lot of new stuff and most important thing - no hackers AT ALL. And a lot of people on servers. I play infestation 3 years, NewZ is the best. Highly recommend you guys, install and check. And be patient: this game is not easy;)",
            "review_score": "1"
        },
        {
            "review_text": "Playing this game about 2 years, and these guys doing very well their jobs, thanks a lot Fred :3",
            "review_score": "1"
        },
        {
            "review_text": "Kills several players, Items Being Saved. Move a item from my GI 'One, Moment Please.' for 10 minutes.  Good features. Hopefully they can add some other good features like being able to purchase private servers.  xd",
            "review_score": "1"
        },
        {
            "review_text": "Its horrible :D",
            "review_score": "1"
        },
        {
            "review_text": "Uninstall works well",
            "review_score": "1"
        },
        {
            "review_text": "Congratulations on the work of the new developers, the changes you have made were better than 4 years of the old developers.",
            "review_score": "1"
        },
        {
            "review_text": "best part was uninstalling it",
            "review_score": "1"
        },
        {
            "review_text": "lol what the hell is this",
            "review_score": "1"
        },
        {
            "review_text": "As a â™¥â™¥â™¥â™¥er who bought the Legendary pack on the original WarZ, i keep coming back to this game for some â™¥â™¥â™¥â™¥ing reason. Maybe im â™¥â™¥â™¥â™¥ing stupid or maybe this game is â™¥â™¥â™¥â™¥ing addictive despite its flaws, try it and find out for yourself LMAO.  The PVP is very exciting and the zombies are decent enough threat while PVPing, so i guess its okay. This â™¥â™¥â™¥â™¥ was launched in 2012, so dont expect top notch graphics, its free now so who dafuq cares?  ",
            "review_score": "1"
        },
        {
            "review_text": "I keep trying to find a reason to not like this game. If you can get past the upfront gc charade, This game litterally needs no money to win.   I havent played any of the previous series but, I have played many games in this genre IE ( Miscreated, DayZ, Hurtworld, Arma Expacs,)   My first few hours in this game it seems refreshing, I'm not getting spawn camped or having problems with storage.   Grouping seems fine. Plenty of weapons and ammo. I'm not having problems getting head shots or finding people to kill.  I'll update this review as I go but for now I have to give it a thumbs up!!   EDIT...... They seem to be pumping out updates pretty frequently and have been working on the private server stuff. Keep up the good Work !!!",
            "review_score": "1"
        },
        {
            "review_text": "Let me start by saying i have had a strong love of this game since the original games release although that turned to â™¥â™¥â™¥â™¥ rather quickly, and i have played a few of the different emulators. however many problems this game has its difficult for me to find a game similar to all the things us loyal fans love. The PVP just always feels so nice, along with just farming zombies and loot.  I think a big misconception everyone has of this is that it isnt a zombie survival game... it just isnt. people need to drill this out of their brain because it completely isnt, zombies are just existant along side a FULL PVP GAME with loot along side also.   Another big problem people have to complain about with the game is that 'oh i die super quick everytime by somone just after i spawn' the start is hard and tbh it has things you have to learn to pvp right. yes when you have no gear there is the little startup where you have to at least survive to the walk from the forest into a city to get guns. The struggle that follows this is fully geared people who might hang in the cities generally run with medkits/dx's along with riot shields to place giving them an advantage in a fight. then after that is skills that will make people more difficult to kill (health/less damage taken/better weapon stabilisation) but these are part of the grind that you get them from killing zombies.  The early game grind in this game isnt even nearly as bad as other versions of the game with weapons being so common and zombies giving a lot of GD so you can buy things like riot shields and meds if you dont find them yourself. so this complaining is irrelevant imo.  other than all of these yes the game has quite a few bugs which to some people might make them not like the game but i cannot deny that since the original release of the first warz the pvp and farming in this game has been SUPER satisfying to me and there is no PVP/Zombie/Looting game really that exists similar to this and if anything i enjoy the state of NewZ right now a lot better than the original intention of warz as the pvp and stacked gear looting is what i love about this game.  Love it.  ðŸ‘Œ",
            "review_score": "1"
        },
        {
            "review_text": "I not played this game enough but I have to say for now, I am really enjoying this game. I never played any of the other WARZ games but this one I have to say I really like. I own H1Z1 (Don't really like it), Rust (Great Game), DayZ (Great Game) but this one I have to say is diffrent and its a good diffrent!  It's not pay to win it has battle royal really good for a free to play",
            "review_score": "1"
        },
        {
            "review_text": "1+",
            "review_score": "1"
        },
        {
            "review_text": "I started playing this game back when it was called WarZ. Its garbage and its always been pretty much garbage, however this new installment of the game brings some fun into it. Beside all the crappy bugs and server issues there is something about the game that makes it enjoyable. The guns feel nice and if your not looking for a zombie killing challenge and more of a pvp guy than this game is great. Far better than H1Z1 and there garbage guns and player base. Then again this game is also garbage just garbage I like.",
            "review_score": "1"
        },
        {
            "review_text": "It's a good game",
            "review_score": "1"
        },
        {
            "review_text": "Honestly with all the updates this game is now Good",
            "review_score": "1"
        },
        {
            "review_text": "A new twist on an old game. It's free and there are no hackers, I don't know what everyones complaining about...",
            "review_score": "1"
        },
        {
            "review_text": "Decent game. Has some BS elements(Super zombies and no PVE official servers). But other than that it is decent",
            "review_score": "1"
        },
        {
            "review_text": "I Like all the graphics and everything and that's what I usaully go by, but I REALLY THAT THEY WOULD ALLOW ME TO GO BACK TO THE SAME SERVER AND PLAY WITH MY FRIENDS AND NOT PLAY BYMYSELF ALL TH TIME!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Classic game.... Coming from a OG War Z player playing the game since like month 3 but I am glad to play again but please fix the servers... I am tired of having disconnected from server be the only gameplay I get....",
            "review_score": "1"
        },
        {
            "review_text": "It's so much better these days. Just try it it's free so always worth a shot right?",
            "review_score": "1"
        },
        {
            "review_text": "All in all, its a pretty good game. fun, competitive, great coop experience, and especially FREE! Only thing I found annoying is that the big zombies take WAY to many bullets and rounds to kill. for a free game I recommend it its a fun free game i think that people need to stop â™¥â™¥â™¥â™¥â™¥ing about this game, hey at liest you dont have to pay anymore. and dont have to pay to win.",
            "review_score": "1"
        },
        {
            "review_text": "coool games ty",
            "review_score": "1"
        },
        {
            "review_text": "I like PvP and PvE mods in this game but i want to see more if they made survival mod i want people to can build an base to raid them or somthing like tht.  Also they should fix the bugs cuz they are alot.",
            "review_score": "1"
        },
        {
            "review_text": "Worst survival game ever",
            "review_score": "1"
        },
        {
            "review_text": "if you can get past the absolutely GARBAGE charicter models and animations, this is an .....okay....and.....fun.... game , worls better than dayz standalone and is 10 tomes more fun, i recommend but only because the base game taking the engine out of play is fun",
            "review_score": "1"
        },
        {
            "review_text": "Great pvp game, servers can be a bit unstable but always full with 100 pop in eveysever. Plus on the bright side theres no cheaters that ive seen so far.",
            "review_score": "1"
        },
        {
            "review_text": "I like this game and i recomend it but i hate the bug when u kill player itme drops from him and u cant loot it i says itme being saved this bug is crap",
            "review_score": "1"
        },
        {
            "review_text": "Great pvp game, servers can be a bit unstable but always full with 100 pop in eveysever. Plus on the bright side theres no cheaters that ive seen so far.",
            "review_score": "1"
        },
        {
            "review_text": "play nice and good",
            "review_score": "1"
        },
        {
            "review_text": "The game is nether good nor bad if you can do some balance changes and i think if you add a map making mode this will be the new CS",
            "review_score": "1"
        },
        {
            "review_text": "NO HACKERS NOTHING EASY TO PLAY I LOVE , WELL BACK INFESTATION",
            "review_score": "1"
        },
        {
            "review_text": "Game is super fun and i recommend playing with friends! a free version of DayZ and is hacker proof! Might be a bit laggy but if you have a good pc like mine, you should be able to run the game at a solid 60 FPS. Even tho the creator releases cheating tools, That means he is quite familiar with all and different types of hacks which makes the hacker detection stronger! I prefer playing a game that was a good hack protection than a game that has hackers in every server*DayZ,Unturned(recently added battleye), Infestation Survivor Stories and etc.* Alot of people leave their reviews complaining about the lag on the servers...This is because of the limited Regions in the game, When ever i play Infestation New Z i always get about 200+ ping...so this game is preeettyy much CPU Intensive! (THIS GAME IS NOT RECOMMENDED FOR PEOPLE WITH â™¥â™¥â™¥â™¥ PC's OR LAPTOPS)",
            "review_score": "1"
        },
        {
            "review_text": "I cant play bc a got kicked from suspected cheating and i havent killed anyone this is stupid  ",
            "review_score": "1"
        },
        {
            "review_text": "can you add more than 2 server regions only? Thanks!  (I'm not from America and Europe) whenever I join server I can play only 5 minutes(or than 5 min) before auto disconnected. I still recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game for a free to play, regular updates and a good player base.",
            "review_score": "1"
        },
        {
            "review_text": "I really do not know anything about the old version of this game so I can not comment anything about that but me being a new player to this game and downloading it now since it is free I have no problems with it so far besides the loot spawns which should not be that hard to fix. I see a lot of the old devs sucked comments but atleast give these new devs a try to redeem this game. It seems like it has a lot of potential.",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME IS PRETTY GOOD GAME CRASHES ALOT BUT MAYBE ONLY FOR ME HELP  ",
            "review_score": "1"
        },
        {
            "review_text": "Pretty cool for survival",
            "review_score": "1"
        },
        {
            "review_text": "Don't believe this stupid tomfoolery spreaded by the negative reviews.  They seem to lack the basic knowledge about this game.  So lemme give you a lil rundown about the facts about this game: -NO! This is not a reuploaded Infestation: Survival Stories. This is made by an different dev entirely. -NO! There is no P2W, i don't understand how people got this idea in their head.  -NO! This game is not for everyone. It's PVP to the core. Kill or be killed. Get your friends on and go on a rampage.  -NO! This game doesn't look glorius but it runs SO MUCH SMOOTHER than the other games.   I have been part of the WarZ/DayZ/Infestation/DeadZ community for many years and had A LOT of fun in it.  Just keep an open mind and own a few friends or get gud. Then you're miles ahead than most of the people who game this game a negative :P.",
            "review_score": "1"
        },
        {
            "review_text": "Spawned in the game, in less than 30 seconds I got shot by someone.. Nice. 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "Still better than H1Z1",
            "review_score": "1"
        },
        {
            "review_text": "It's not THAT bad..  Only real issue I see is that when you alt+tab, your cursor disappears.",
            "review_score": "1"
        },
        {
            "review_text": "9/11",
            "review_score": "1"
        },
        {
            "review_text": "There is ALOT of hate on this game, but what people need to think about is there is new developers for the game. Yeah it is still the same style of gameplay, looting, PVP, PVE etc. But it is still the same game, Personally I think this game is absolutely amazing, give the game some time and I'm sure people would think around the negative aspects of Infestion, and more into the positive.",
            "review_score": "1"
        },
        {
            "review_text": "I think it's a pretty decent game from what i've played.   The military looks however is waaaaayyyyy too easy to get if you know the right place. I have an alice rucksack filled with guns and on top of that medium armour a nightvision proective helmet and i riot shield.   Another issue, and the biggest one, is the servers, they dissconect so much and sometimes its really hard to reconnect.  But it is free and still fun once you get into the game, the only thing EALLY bringing it down right now are the servers.",
            "review_score": "1"
        },
        {
            "review_text": "keeps saying im suspected for cheating for some reason",
            "review_score": "1"
        },
        {
            "review_text": "Game is fun so far :P",
            "review_score": "1"
        },
        {
            "review_text": "Good for PvP, not too hard to get a decent bank of items built. Don't believe all the negative reviews about â™¥â™¥â™¥â™¥ crashing, it doesn't happen alot, it did at the steam launch but problems at launch are always expected.",
            "review_score": "1"
        },
        {
            "review_text": "good game graphics are not the best but if your looking for a good game to get quick action this is the game for you ",
            "review_score": "1"
        },
        {
            "review_text": "Games pretty tough and the PVP is definitely a learning curve, so new players will find this difficult.",
            "review_score": "1"
        },
        {
            "review_text": "I dont get the negative comments this game as getting, sure the graphics are dated, but come on the game is very fun and addicting, id definitely recommend this to anyone, how can you lose?.....its free!!",
            "review_score": "1"
        },
        {
            "review_text": "They did it nice, because it's f2p now, but it have some bugs and â™¥â™¥â™¥â™¥ like that but im Fan of Infestation. I hope they fix everything in future. I &lt;3 Infestation",
            "review_score": "1"
        },
        {
            "review_text": "I love the game so far. But i see how it can get boring for some people. I'm gonna give some feedback so the devs know what to fix. Here goes:  - First off,the map is either too large / you're moving too slow / nothing's happening so that when you're on foot things can be kept interesting. Maybe make the character a bit faster / make the map a bit smaller. Also make it so that you can see randomly spawned resources on the roads while moving. And maybe add random spawn chance for drivable vehicles on the road. Just to keep things fresh,since there's a lot of complaints of the game just being 'Walk,get resources,die,repeat' and people get annoyed fast and just quit.  - Make the chance for guns spawning smaller. Make it higher for food, ammo and such. When i kill someone, most of the time they're carrying like 20 guns and almost no ammo cuz they dont know what they're doing. They barely have food and things I personally need so it doesnt make sense to kill others most of the time. Also remove some of the guns. Let's say, have 1 pistol, 3 rifles and 2 shotguns. Noone needs so much different ammo types. I say keep the FN Night Stalker Scar. That's one good rifle that'll be good if you keep it.  - Remove the new character starter items. I'm saying this cuz even i exploit this sometimes. When you use a character for a long time,you gather resources and store them in the global inventory. Then since you've got nothing on that character, you make another one and get food, a flashlight and some water. This CAN and WILL be exploited. Make it so that when you create a new character, you start off fresh, like the apocalypse just started. Yes it'll be harder for new players to make progress, but that's what the beginner servers are for,right?  - Make it so that players with over 1 hr playtime CAN'T join beginner servers,since judging by my last statement, if beginner servers are for new players to progress through the game, advanced players can just join and ruin the flow. Also, remove spawn chance for rare items on beginner servers so its also fair for new beginners to not get killed by advanced beginners,if you know what i mean (no pun intended). And kick the players out of beginner servers when they reach 1 hr playtime on a certain character, since you need 1 hr playtime to play on official servers. And if they didnt progress with their first character, they can just make a new one and play on a beginner server again and not do that mistake again.  That's all, i hope the devs read this and do these things cuz they swore they're different and listen to the community. I'll recommend this game and give it a positive review cuz i love it so far. Please listen to me if you're reading this Fredaikis. That's all, have fun!",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME IS FREE SO WHAT Can YOU Say",
            "review_score": "1"
        },
        {
            "review_text": "So i played for about 2 hours trying to get the hang of the multiple controls and getting killed over and over i then spawned in and got lots of good gear and learnt how to use the shop aswell as how to store items. I died again but this time had items .I died again spawning with items again and again from one good loot run until i spawned and so did someone else i shot his body but it did nothing as he had just spawned so we teamed, i then killed 2 people with not much of his help except watch out.My game then crashed and we lost our group bond so I went back to the town and he didn't team with me again walking into the town he shot me. Dead.",
            "review_score": "1"
        },
        {
            "review_text": "I must say this is my first review ever! But this is needed to be said. You gotta love all the haters that got 0.1hours gameplay on this game spreading hate... Yes the game is buggy but it's a working process. The thing is you ppl are expecting way to mush from the game. I downloaded it expecting nothing! first it did not even start, after a day or 2 i tried again and it did work. And im having tons of fun it's a beautiful game but as said you will crash alot of times but stil. Just start again and keep playing and the best thing is IT'S F2P!!! Totally worth downloading 10/10! i only have 9hours ingame but i downloaded it yesterday.",
            "review_score": "1"
        },
        {
            "review_text": "This game is goo but it needs a lot of updates i will cut some slack on this game but developers please fix some of this issues",
            "review_score": "1"
        },
        {
            "review_text": "I definately recommend this game. Its beyond belief that some game like h1z1 would be so highly popular, maybe because this muscle guy is streaming it? This game definately beats genre of 'dayz' games nowdays. Definately is better than dayz standalone.   Look at it this way: This game is TRUMP, and other games are liberals. If you like trump, then play this game.",
            "review_score": "1"
        },
        {
            "review_text": "recommend this one!",
            "review_score": "1"
        },
        {
            "review_text": "Me and my friend have been playing for a few hours now and have had alot of fun. We thought it would be a pay to win game but it isnt it has a amazing amount of guns like honeybadger, famas, p90 etc. It handles amazingly i get fantastic fps and for a new game doesnt crash as much as i thought (finally a good free to play game)",
            "review_score": "1"
        },
        {
            "review_text": "I've been playing this game before Most people have i thinl eihter all the way back in 2013 or 2014 and i've enjoyed it the whole time if u are a pvp'er that likes full skill based games then i suggest you play this game :o",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game :)) been playing it when it wasnt on steam :)",
            "review_score": "1"
        },
        {
            "review_text": "Best  Free to Play  Openworld Survival game!!",
            "review_score": "1"
        },
        {
            "review_text": "Update: I just had my first 5-kill streak here, after following a squad of 3 players for about 20 minutes and about 5 minutes of firefight during which I also shot 2 random guys who came to the place of death of the first trio possibly due to shots having been fired.  This kind of adrenaline rush I only esperienced in the days of DayZ Mod. That was just great. And the amount of loot I was 'rewarded with' (took off the corpses eh) is insane. I hope I can log in tomorrow after work and bring it all to the camp site and stash it in my bank.  Gunplay is really great, something about it 'Just Works'(c), possibly a CS1.6 effect, meaning that the game mechanics are very simple, visual representation too and you're only left with the process happening before you eyes. It's definitely a cool game to spend some 20 mins per day with your friend, I have to bring my GF into this, should be fun.  JUST DON'T GIVE THESE DEVELOPERS YOUR HARD EARNED CASH. If they want it they must fix a lot of things and add more content aside from skins and loot boxes.  -----------------------------------End of UPD   The ground looks like some â™¥â™¥â™¥â™¥ out of Vanilla WoW, no offense to Vanilla WoW.  But the game is already better than DayZ. It's actually fun to shoot. If they fix the graphics, add some real shaders, some fx on it, it can look good and play good.  Oh and also fix the spawns. You walk in a grocery store and walk out strapped with guns and ammunition.",
            "review_score": "1"
        },
        {
            "review_text": "Played this long before it came out on steam, great game. Most likely to become my second most played game taking over the original infestation",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game! Totaly recommend it to everyone",
            "review_score": "1"
        },
        {
            "review_text": "Really Good Game :D",
            "review_score": "1"
        },
        {
            "review_text": "Game is sick, Developer's listen to Community and the PvP is very good! i would still suggest some Beginner PvP Server's for newcomers to PvP there! :)  made a little pvp montage and much more on my YouTube Channel! :)           YouTubeâ„¢ Video:  Infestation: NewZ PvP Montage - GENETICZZ ~ 32&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "The dev team does an awesome job.  Hope to see survival and battle mode in the future!",
            "review_score": "1"
        },
        {
            "review_text": "Infestation: NewZ  Anticheat: Its one of the better ones out there i haven't experienced any cheaters maybe 1 in 2 years of playing on and off. thats it you guys think about the old game Infestation Survivor Stories this isn't the same deal in Anticheat this is something on a different level  PVP: This game has been out for half a decade right now and the die hard players have evolved in skill immense this isn't like csgo but the movement level is huge and what you can achieve in skill level is insane if you want to and are capable of it. is this game beginner friendly yes and no if you accept dying alot in the beginning but get rewarded later on when you get better and play together with your team/friends/clan. is this game fast paced heck yeah it is hella fast you can't hesitate a few seconds before your dead.  PVE: This game is based towards the PVP this isn't for players that like DayZ thier loot system and slow paced gameplay, this game is insanely easy to loot on if you get a little bit knowledge on how to loot. so you can't blame that its to easy to loot. the game is made towards that and the community and the playstyle of how the game is played is based towards it  DEVELOPERS: They're not the same what the people are thinking off. they're completely new guys to everyone here and they're are young and hella experienced in what they're doing. they have been listening to the community from the beginning with some mistakes but you learn from mistakes harder than being perfect from the go. i can ensure you if they keep going they'll make it even better than what it is",
            "review_score": "1"
        },
        {
            "review_text": "Atleast it was made by different devs",
            "review_score": "1"
        },
        {
            "review_text": "It seems to have a pretty solid core for a game, but I didn't have a real oppourtunity to play much due to almost every server I joined getting spawncamped. Perhaps a PvE server or two for new players who would like to get an actual feel for the game?",
            "review_score": "1"
        },
        {
            "review_text": "This game if really fun at times but i would like it more if i could build bases.",
            "review_score": "1"
        },
        {
            "review_text": "Its much better then what WarZ is,  Atleast there are no hackers, always tons of loot and lots of PVP  Some issues with game crashing but i can live with it",
            "review_score": "1"
        },
        {
            "review_text": "It's cool, but all time you got disconnect or killed on spawn time.... this is not cool ;|'",
            "review_score": "1"
        },
        {
            "review_text": "Love it so far ",
            "review_score": "1"
        },
        {
            "review_text": "Alright i will be honest its the same infestation with new guns and â™¥â™¥â™¥â™¥   The Question here is that this MLG Anti Cheat will work or not ?  This is the question that needs to be answered Devs seems to be so proud of this new anti cheat and they say 'its build esspecially for this game' we will see that it has been 1 hours maybe that i played the game seen 3 bans already but fairfight did the same and game was still a Hacker game back in the day  cant say anything before 1 week for this one lets see if it will be cheater filled   i will update the review if i encounter any kinds of cheater or info about this matter  for now its cheater free if you wanted to go back in time and get some fun go ahead and have some fun like old days",
            "review_score": "1"
        },
        {
            "review_text": "Before you see that this is 'infestation' and see my in-game time and assume those same â™¥â™¥â™¥â™¥ guys are back again, take a second, calm down, and do some research on your own. If you did that you'd realize this is in fact NOT the same devs. Another team now has rights to this game. That being said I've seen people â™¥â™¥â™¥â™¥â™¥ing about the cash shop. I have experienced everything this game has to offer and have not paid a dime. I understand the hostilities towards the old devs, everyone hates em. But this game has made some strides since Titov and his entourage and should, at the very least, be judged again with the knowledge that there is no longer a 'Sergey Titov' invlved in its development.  Other games sergey has had his hand in, in case you didn't know and so you can see its pretty much just him : infestation classic (current name of old infestation that everyone would laugh at and â™¥â™¥â™¥â™¥â™¥ about), Romero's aftermath, and shattered skies.",
            "review_score": "1"
        },
        {
            "review_text": "great game people hate this game becuase they always die...this isnt a friendly game youre going to get killed just spend sometime on here looting and banking and shoot and aim not that hard,but one thing is fix the crashing bug please",
            "review_score": "1"
        },
        {
            "review_text": "Well, once I got in to the game after long load times a sniper killed me instantly after I spawned. After you die, you get removed from the server and have to wait 2 minutes before you respawn everytime you die and since it kicks you from the server you have to reload the entire game again. WOOHOO.. So much fun already. started another game and finally got some weapons. Sniper started shooting at me so I ran for the first building which had a small set of stairs to run up before entering. Got stuck on the first step, couldn't move, got sniped. lol.. I'm gonna go ahead and pass for now. Might try it a couple more times but it seemed like a mess first impressions.  Edit: Ok 7 hours later I have to say, I'm changing my thumbs down to a thumbs up. Yes it has it's problems but I found a lot of fun raiding towns getting in gun fights with other players, killing zombies and then getting the heck out of dodge and back to the safe zone to unload all my awesome gear in the storage. I really like the idea of the inventory storage feature. Don't like the pay to play stuff but it's not too bad. I like the open world mode. The stakes aren't really that high because it's fairly easy to find guns so getting sniped randomly doesn't â™¥â™¥â™¥â™¥ you off as much because you can bounce back pretty fast. Once you start making some successful loot runs, then you can just load up your inventory with guns before starting again. I like it. Me and my girl just played for hours and plan on coming back for more. Fun game once you get the hang of it.",
            "review_score": "1"
        },
        {
            "review_text": "You find tons of loot and it has some decent pvp.. so it is kinda good.",
            "review_score": "1"
        },
        {
            "review_text": "I really like it. There is a battle royale mode in it which is extremely fun. Please download it.",
            "review_score": "1"
        },
        {
            "review_text": "Great game but need fixing.It keeps diconnecting me i keep losing my stuff.This is not fair.",
            "review_score": "1"
        },
        {
            "review_text": "Ive been playing this game before it was even on steam, the pvp is really good and the pve is pretty good to but dont really think its a survival game its more of a loot and kill game",
            "review_score": "1"
        },
        {
            "review_text": "Um.... â™¥â™¥â™¥ yeah. Cheaters gone, thanks to new WORKING anticheat. New stuff , beginer servers , come on this is what i needed. Hell yeah , play it rage quit it , do it again!  ",
            "review_score": "1"
        },
        {
            "review_text": "It's a lot better than I expected it to be thats for sure.  Tbh I haven't played War Z now called Infestation: Survivor Stories, especially after hearing about how 'infested' it is with cheaters and such, but I did play Romeros Aftermath also, but I'm giving this a chance this time, and so far I'm really enjoying it despite the negative reviews, and more modes are coming like Survival and Competitive, right now I'm really enjoying Battle Royale a lot and Open World modes, give the game a chance it's free, why not? Start on beginner servers first. KoS isn't much of a thing right now unless you look like a threat or don't use in-game chat or a mic lol, like me. Just try it and see if you like the game, I certainly do!   Hope this review helps some",
            "review_score": "1"
        },
        {
            "review_text": "This game have few bugs and some connections problems and cheaters but i like it",
            "review_score": "1"
        },
        {
            "review_text": "Disconecting soon",
            "review_score": "1"
        },
        {
            "review_text": "I played Infestation survivors stories 418 hours. I would say that they are the same game but F2P. Servers are crappy but if all goes to plan they are fixing that on dec 12. It is not pay to win like some people are saying, its more like csgo where you pay money to get skins (can't buy guns in the store). They do have a premium or a membership that gives you more XP and in-game money for killing zombies.  (In-Game) Servers are bad ATM but they are working on fixing that Dec 12. Ping can fluctuate between 60-1200 from server to server. Sometimes your game will crash (you can die from zombies if you dc in the wrong spot as well as players). This game is KOS or kill on sight if you're new to these kinds of game. I would say this is because a lot of people who played WarZ and Survivor stories are the main reason for this because they brought back the old way. There are a lot of guns so don't worry about not being able to protect yourself. I haven't seen a hacker yet so nothing to report there.   All in all, this is just a cheap F2P game so don't set your hopes too high",
            "review_score": "1"
        },
        {
            "review_text": "Well......  I took a bit of time to read a few reviews on the game before I downloaded it. Most reviews said it was bad to horrible. I thought, theres no way this game could be that bad. I was terribly wrong. Took forever to get into a game and when I did, I got dc'd immediately the first time. Then spent about 10 minutes getting into another. Died almost as quickly as I spawned by shot in the â™¥â™¥â™¥â™¥ing foot. Spent another 10 or so minutes to get in again, same â™¥â™¥â™¥â™¥, spawn killed. I really didn't even get a chance to play.  I will say this, the graphics are bad and I mean really bad. Can't really comment too much on the mechanics because I really didn't get to use do or use anything.   1st impression, this game is nothing more than a steaming pile of dog â™¥â™¥â™¥â™¥. Enjoy!",
            "review_score": "1"
        },
        {
            "review_text": "Doesn't seem very beginner friendly, as soon as I hopped in a world I was spawn-killed, and that happened again immediately after. Had problems installing, the game would repeatedly boot me out telling me to update when no update would actually come. Controls are somewhat 'Ew', and there are a lot of them, wasn't impressed when I managed to get in-game.",
            "review_score": "-1"
        },
        {
            "review_text": "same as aftermath just std , pure cancer the screen shots even is better then the game its self of corse its my opinion and every one has theyr opinions",
            "review_score": "-1"
        },
        {
            "review_text": "I DISLIKED THAT EVERY TIME I GOT INTO THE GAME IT KEPT SAYING KICKED FOR SUCSPITION OF CHEATING I DONT EVEN KNOW HOW TO CHEAT ITS ANEW GAME ANY WAYS",
            "review_score": "-1"
        },
        {
            "review_text": "Worse than I:SS:  This game is basically WarZ except it kicks you off the server every 3 minutes. Uninstalled.",
            "review_score": "-1"
        },
        {
            "review_text": "It takes ten attempts to join a server and I was disconnected after 15 minutes. The gear I picked up was gone after I managed to join again. Otherwise it seems to run just like survivor stories.",
            "review_score": "-1"
        },
        {
            "review_text": "I am one of those guys who bought into WarZ back when it was released for early access through their website, it was what it was back then, seeing how things haven't changed since then but actually gone down hill is disturbing.   The scandal that was WarZ has left an un-removable mark from this â™¥â™¥â™¥â™¥â™¥â™¥ publisher for eternity, they will never create something worth playing, even with 'new developers'. I can't be â™¥â™¥â™¥â™¥â™¥ to spent more time on this review so let me just write down a quick timeline.  War Inc (â™¥â™¥â™¥â™¥â™¥â™¥ military fps) &gt; (re-used textures from War Inc) WarZ is born &gt; â™¥â™¥â™¥â™¥â™¥â™¥â™¥â™¥ &gt; Infestation was born &gt; â™¥â™¥â™¥â™¥â™¥â™¥â™¥â™¥ &gt; ??? was born &gt; â™¥â™¥â™¥â™¥â™¥â™¥â™¥â™¥ &gt; they made a â™¥â™¥â™¥â™¥â™¥â™¥ tactical fps as rainbow 6: siege was the flavour of the month &gt; â™¥â™¥â™¥â™¥â™¥â™¥â™¥â™¥ &gt; they made shattered skies??? &gt; â™¥â™¥â™¥â™¥â™¥â™¥â™¥â™¥ &gt; this atrocious stinking pile of dog â™¥â™¥â™¥â™¥ was born &gt; â™¥â™¥â™¥â™¥â™¥â™¥â™¥â™¥ to come? who knows   IT'S THE SAME AS WARZ JUST WORSE  Shout out to my homeboy sergey titov .!.",
            "review_score": "-1"
        },
        {
            "review_text": "- Crashes - Campers in spawn - You have to wait 3 minutes when u die to play again with your character - More campers - Lag - Map too big to walk - More crashes  Its a bad game, dont play it, it's a waste of time",
            "review_score": "-1"
        },
        {
            "review_text": "â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘ â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘Meâ–‘â–‘â–‘â–‘â–‘â–‘  â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–ˆâ–€â–€â–‘â–‘â–ˆâ–‘â–‘â–‘â–‘â–‘ â–‘â–‘â–‘â–‘â–‘â–‘â–„â–€â–€â–€â–€â–‘â–‘â–‘â–‘â–‘â–ˆâ–„â–„â–‘â–‘â–‘  â–‘â–‘â–‘â–‘â–‘â–‘â–ˆâ–‘â–ˆâ–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–â–‘â–‘  â–‘â–‘â–‘â–‘â–‘â–‘â–â–â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–„â–‘â–â–‘â–‘  â–‘â–‘â–‘â–‘â–‘â–‘â–ˆâ–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–„â–€â–€â–‘â–â–‘â–‘  â–‘â–‘â–‘â–‘â–„â–€â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–â–‘â–„â–„â–€â–‘â–‘â–‘  â–‘â–‘â–„â–€â–‘â–‘â–‘â–â–‘â–‘â–‘â–‘â–‘â–ˆâ–„â–€â–‘â–â–‘â–‘â–‘â–‘  â–‘â–‘â–ˆâ–‘â–‘â–‘â–â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–„â–‘â–ˆâ–‘â–‘â–‘â–‘  â–‘â–‘â–‘â–ˆâ–„â–‘â–‘â–€â–„â–‘â–‘â–‘â–‘â–„â–€â–â–‘â–ˆâ–‘â–‘â–‘â–‘  â–‘â–‘â–‘â–ˆâ–â–€â–€â–€â–‘â–€â–€â–€â–€â–‘â–‘â–â–‘â–ˆâ–‘â–‘â–‘â–‘  â–‘â–‘â–â–ˆâ–â–„â–‘â–‘â–€â–‘â–‘â–‘â–‘â–‘â–‘â–â–‘â–ˆâ–„â–„â–‘â–‘  â–‘â–‘â–‘â–€â–€â–‘â–„â–„â–„â–„â–„â–‘â–‘â–â–„â–„â–„â–€â–‘â–‘â–‘â–‘  â–‘â–‘â–‘â–‘â–‘â–‘NEWZâ–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘ â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘",
            "review_score": "-1"
        },
        {
            "review_text": "Died instantly as soon as I joined the server...Couldn't even walk 3 steps forward. Tried to reconnect to another server and the game keeps disconnecting from server. I tried a few other servers but kept getting the same error. I then restarted the game and tried again but just keep getting the same disconncted from server message over and over again.",
            "review_score": "-1"
        },
        {
            "review_text": "The game could be fun for players that want to play rust, but can't.  I've encountered two big problems.  1. Lowest ping that a sever has is 300m/s (My internet isn't bad.) 2. The game crashed randomly, and i couldnt close the game, i had to restart my computer (Once again, my computer is very good, bf1 runs perfectly on it).  I wouldnt recommend playing this game.",
            "review_score": "-1"
        },
        {
            "review_text": "boring",
            "review_score": "-1"
        },
        {
            "review_text": "Just, terrible. Enough said",
            "review_score": "-1"
        },
        {
            "review_text": "I would rather paper cut my self,then squeeze a lemon on the cut rather than play this game ever again!",
            "review_score": "-1"
        },
        {
            "review_text": "Refuse to refund money when I did not get 2x gc during the event. They said it was already 2x. I said then the game is to expensive then and I can not support it I want a refund. I never spent any of the gc and immediatly asked for a refund. They said once purchases are made they can not be refunded.  As far as the its just okay. A okay made survival game with little depth and bad spawns. No real reward for killing or progression. Running to your teamates could take a hour.  Overall not happy.",
            "review_score": "-1"
        },
        {
            "review_text": "I PLAYED THIS GAME FOR ABOUT 400 HOURS OFF STEAM. JUST DONT PLAY IT. ITS SO CANCER YOU ACTUALLY GET TUMOURS FROM PLAYING IT. ALL THE â™¥â™¥â™¥â™¥ THAT HAPPENED TO ME. - MAKING LOOT PVPING, HAD A FULL MILITARY WITH HEAVY ARMORS, NVGS,DXS, STANAGS 30 - TOOK MORE THEN 20 SECONDS ON 'DISCONECTING SOON' DIED . -1MILLION EXP POINTS NEEDED TO GAIN MORE 5% DAMAGE FROM WEAPONS, EPIC SKILL TREE IS JUST â™¥â™¥â™¥â™¥â™¥â™¥â™¥â™¥ AND SUPER OP GIVING OLDER PLAYERS ADVANTAGE! -'SESSION ACTIVE' FOR 15 MINUTES -'DISCONECTED FROM SERVER' 5X TIMES IN A ROW  BOTH OF THESE HAPPEN DAILY! -PVP SERVERS GETTING SPAWNED BEETWEEN 3 PEOPLE ROUNDED, ALL SHOOTING AT ME BECAUSE THERE ARE CANCER PLAYERS CAMPING SPAWN TO GET EZ KILLS, DIDNT DIE TO THE 3 PLAYERS AROUND ME~, FRESH SPAWN SPAWNS BEHIND ME, DEAD. LITERALLY THE SHITIEST SPAWNS EVER, ITS JUST RIDICULOUS! -SELLING MY SNIPERS AT THE TRADE LOUNGE, ACCEPTED THE TRADE 'DISCONECTED FROM SERVER', LOG BACK IN SNIPERS AND DXS ARE GONE, MADE A TICKET, THEY DIDNT GIVE A â™¥â™¥â™¥â™¥ AND REFUSED TO GIVE ME BACK THE ITEMS. I SPENT AT LEAST 40 EUROS ON THIS SHITY GAME, DONT DO THE SAME ERROR. EVERYTHING ABOUT THIS GAME IS â™¥â™¥â™¥â™¥. IT DOESNT FEEL REWARDING AT ALL HAVING A INVENTORY FULL OF DXS STANAGAS AND â™¥â™¥â™¥â™¥ WHEN U LOSE THEM DUE TO SHITY GAME CRASHES, DISCONECTS, SHITY SPAWNS, SPAWN CAMPERS. DONT PLAY THIS â™¥â™¥â™¥â™¥, JUST LET IT DIE.  SINCERELY NOT A â™¥â™¥â™¥â™¥ING NOOB",
            "review_score": "-1"
        },
        {
            "review_text": "Really â™¥â™¥â™¥â™¥â™¥?",
            "review_score": "-1"
        },
        {
            "review_text": "Please... NOT AGAIN.",
            "review_score": "-1"
        },
        {
            "review_text": "this is shiiiiiiiiiiit game  evry 20 min the game crash lot of cheaters ",
            "review_score": "-1"
        },
        {
            "review_text": "â™¥â™¥â™¥â™¥â™¥â™¥ servers, can't even connect... when I do get in one... gets d/ced a couple minutes later. Running makes the game stutter like crazy.",
            "review_score": "-1"
        },
        {
            "review_text": "I like the game needs to be updated but i cannot recommend right now its so buggy and i understand but needs more UPDATES.....[an updated review will come out later once the next updataes comes out ]",
            "review_score": "-1"
        },
        {
            "review_text": "Same â™¥â™¥â™¥â™¥ like original with more micropayments and cheap battle royale mode.",
            "review_score": "-1"
        },
        {
            "review_text": "has ALOT of problems one it freezes alot , crashes, sometimes item cant be picked up but then again its a free game so wouldnt expect anything more",
            "review_score": "-1"
        },
        {
            "review_text": "worst infestation ever",
            "review_score": "-1"
        },
        {
            "review_text": "bad graphics and its not really that fun when there are just a few ppl going around trying to kill you. its just not that fun when you lose everything cuz someone snuck up and shot you. Why do I want to grind for items i just had just to lose them again?",
            "review_score": "-1"
        },
        {
            "review_text": "Best game ever. It turned me into a zombie CAUSE I FU*KING DIED 5 TIMES IN THE LOADING SCREEN",
            "review_score": "-1"
        },
        {
            "review_text": "this game is absolutely â™¥â™¥â™¥â™¥ing dog â™¥â™¥â™¥â™¥.",
            "review_score": "-1"
        },
        {
            "review_text": "Mother of god....this game is so badly optimized....Even the rocks are floating. 1/10",
            "review_score": "-1"
        },
        {
            "review_text": "Hello, This game is full of S**T... doenst even let me do a character.",
            "review_score": "-1"
        },
        {
            "review_text": "not having or involving imagination or original ideas.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is complete and utter â™¥â™¥â™¥â™¥. I wanted to give it a chance, but of course the first day they were having 'server issues', so i decided to wait it out. played for a little bit but still was not impressed. graphics are horrible, you're lucky to be alive after 10 seconds after spawn since peple just seem to sit there and kill you for no damn reason. (this being mentioned there is no PvE servers at all!) the battle ground spawn is literally the most â™¥â™¥â™¥â™¥â™¥â™¥â™¥â™¥ thing i've ever seen in a video game, it spawns you inside of like 5 other players and everyone just waits right there at the spawn to get kills. there is literally no point in even putting their half-minded thought into creating a map, you'd be better off making it a 10 foot square room and saying here you go guys. you have to try and join a server like 5 times before the game either doesn't crash or make you sit through the long â™¥â™¥â™¥ loading screen just until finish and it notifies you that you have been disconnected from the server. the only positive thing i could say about this game is that it's free, not that anyone would pay money for this peice of â™¥â™¥â™¥â™¥ game created by people with the brains the size of hampsters. I've literally became so mad with this game I dont even care how bad my grammar is in this review, if anything they will understand most of it fully. DO NOT EVEN WASTE YOUR TIME WITH THIS GAME!! they will probably delete this comment or ban me but i dont really care. you have been warned.",
            "review_score": "-1"
        },
        {
            "review_text": "wow.....this game has made dayz look amazing ..... there is NO survival aspect at all and there are too many guns .... so its basically just a deathmatch thats it nothing more nothing less ..... the only saving grace for this deathmatch is i guess it performs well unlike most of these zombie open world things get 60fps on ultra with a r9 390 and a i5   I guess if your just looking for a 100 player open world deathmatch with zombies chucked in then fill ya boots !! BUT if your loooking for a survival game then look else where maby H1Z1 or Dayz but to be fair this is a genre of game that is struggling to be done well",
            "review_score": "-1"
        },
        {
            "review_text": "not having or involving imagination or original ideas.",
            "review_score": "-1"
        },
        {
            "review_text": "Games worse than ever, they added a few new skins and items but there are constant server issues with joining and disconnects. Game also random crashes to desktop now.",
            "review_score": "-1"
        },
        {
            "review_text": "This game gave me osteoperosis",
            "review_score": "-1"
        },
        {
            "review_text": "First off, you run slow as hell in this game.  I loaded in the game and first thing I found was a pistol next things occur whilst I look for someone to kill  ) nothing ) find no one ) barely outrun zombies ) someone finds me tries to shoot me ) dies because can't run away ",
            "review_score": "-1"
        },
        {
            "review_text": "After i open that game.. then i relog.. i cant fvking open that game again.. 'MLG AntiCheat still running' i waited 1hours nothing happened..",
            "review_score": "-1"
        },
        {
            "review_text": "loading times are really long pointless game",
            "review_score": "-1"
        },
        {
            "review_text": "'Experience so far' Soooo... I connect for the first time, BOOOM!! Buy a upgrade for the account to let you have nice things... 'Ok many games have that so its ok'-though I. I try to connect to a new player server, and BOOOM! Fail to connect... After 5 more tries, BOOOM!! It crashes AND it manages to crash the PC aswell... I try to loggin back, BOOOM! Error...",
            "review_score": "-1"
        },
        {
            "review_text": "Get insta kicked for suspected cheating...cant go 15 mins without crash, only good thing this game has going is pvp",
            "review_score": "-1"
        },
        {
            "review_text": "You mean Miscreated, right?",
            "review_score": "-1"
        },
        {
            "review_text": "This game gave me osteoperosis",
            "review_score": "-1"
        },
        {
            "review_text": "Ridicuously bad game. Don't even waste your time with the download.  Started from the moment I loaded it up--a pain in the â™¥â™¥â™¥ to even set your controls. From there, after being harassed with spending money, trying to find a server to play on via the gameplay modes and navigating the server screens (plus, you can only sort by ping which is depicted as bars like a cellular signal) is quite cumbersome. They somehow managed to â™¥â™¥â™¥â™¥ up the basic essentials to like every multiplayer game ever made.  Loading screen bar doesn't actually show loading progress at all. After joining, my ping on the lowest server (US) was 600-2500ms.. I couldn't find a server that dropped below 600ms and most times they were hanging in the ~1500 range and woud even spike to 4500. You can't see this number before actually joining the server, by the way.  It only gets worse from here. The high ping is obvious, even when picking up items/shooting zombies; essentially rendering the game uplayable. I kept going, though, in hopes of making something of the experience. You'll never be able to miss an item as they glow a bright blue. Mechanics of even the basic things like walking/strafing/springing/etc. are pretty bad and shooting guns feels like I'm playing with children's toys; extremely easy to aim and do a lot of damage, but god forbid you actually are able to hit another player that isn't stationary with the delay. People are spamming the global chat, players shoot on sight no matter what, and overall the community seems like a cest pool of inbred â™¥â™¥â™¥â™¥tards.  The inventory system and overall mechanics of items is pretty horrid--an obvious ripoff that they somehow managed to make worse. And, aside from the foilage on trees, there wasn't anything particually worth looking at graphically speaking.  Going to just end the review here, really.. there's nothing about this game that warrants it wasting another second of my life.",
            "review_score": "-1"
        },
        {
            "review_text": "keep in mind this is early accses of the game thre is some bugs but i still enjoy it not rly good visuals but it still good battle royal is soo good made as well servers are some times down but this is for game there is some skins cars but u also need good pc i have i5 4k gtx 750 ti 2gb ram4 gb im getting only 40 fps on ultra",
            "review_score": "-1"
        },
        {
            "review_text": "one of the most WORST GAME I HAVE EVER SEEN MADE &amp; PLAYED ...... YOU CALL THIS A ZOMBIE SURVIVAL GAME LOL. YOU THOUGHT F2P WOULD SAVE YOUR TRASH GAME LOL",
            "review_score": "-1"
        },
        {
            "review_text": "Always failed to get current game build, and also always freez in login screen. RIP my time.",
            "review_score": "-1"
        },
        {
            "review_text": "Tried out the Open World mode.. Walked for about 35 minutes and then got KOS'd by someone full geared when I only had a flashlight.. Poor overall design. Would not recommend at ALL",
            "review_score": "-1"
        },
        {
            "review_text": "- Copy. Paste Another review... the same :v - Try again to join a beginner server - Disconnected - Try to join another beginner server - Disconnected - Try to join an official server - Disconnected for not having a premium account/1hr of playtime - Try joining ANOTHER beginner server - Finally connects - Sit through painfully long loading screen cycling between 2 slides - Game freezes for 30 seconds - Finally in-game - Try to walk around - Game freezes - Let go of W - Game unfreezes - Press W again - Game freezes again - Press shift to sprint - Game unfreezes, then freezes again - Try to disconnect from server - Game gets stuck on disconnecting screen - Force close the game - Uninstall and write this review",
            "review_score": "-1"
        },
        {
            "review_text": "I cant even enter a server and play the actual game...",
            "review_score": "-1"
        },
        {
            "review_text": "I usually never write reviews on games, but I feel that this is important. I have spent MANY hours playing this game now and back when it was first released as WarZ. It has always had many problems, but now it is just terrible. Let me break it down for you.  Spawn in. Get Sniped. Wait. Spawn in again. Get sniped. Wait. Spawn in again. Run 30 feet in any direction. Ooooh an AR with full ammo. Nope, Sniped.  Every player in the game has a 1000 sniper rifles and every time you die it says that you are shot in the head. I have unloaded ENTIRE clips into people only to have them turn around and 1 shot me aimbot style. Lastly, the riot shields are a horrible mechanic. Shoot at someone, they place down a riot shield instantly then aimbot you arounf the side of it with a sniper rifle. This game has changed!!!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "Warz,Infestation survivor stories, Romero's Aftermath, Shattered skies , now Newz? You want to know what all those games have in common? They have everything in common. Its the same game but diffrent names. Nothing has changed other than a new loading screen or updated UI. Only thing diffrent from Newz is the loot tables are ridiculous. Just 2-3 minutes into the game I found a AKM in a â™¥â™¥â™¥â™¥ing diner. What kind of sense does that make? On top of that this game is being developed by a bunch of 15-16 year olds. This game is a scam and Im suprised games like this are allowed by steam. ",
            "review_score": "-1"
        },
        {
            "review_text": "Were you looking for an extremely rushed game with early 2000s style graphics that is basically another one of the thousand Arma/Rust style copies?! If so, you've come to the right place! This game will no more disappoint you than it will underwhelm you! In this gloriously low-poly third/first person shooter, you can wander aimlessly into a decently made terrain with very little thought put into it! Explore (or don't!) expansive forests with about 20 trees, complete with a glorious 2D look! Be amazed at the rushed feel of the game as it tries to leech itself into your wallet! Be at awe of the fact that there is more to buy than there is to do in this game! If you were thinking about tossing your dollars into a fire or spending money on DLC for a game, think no more! This game expertly lets you do both in an environment you wont want to play in for more than 30 minutes! Marvel in this game right now, as it wont last long! Spend your money on DLC and buy the devs more programming tutorials and pizza  NOW! ",
            "review_score": "-1"
        },
        {
            "review_text": "Best game N/A. Load in suspected of cheating, keep disconnecting from server for no reason, loot every where to the point where there is no survival aspect what so ever, and battleroyal is just a orgy of people shooting eachother. Absolutly think this is the best game ive ever played. Nominate this â™¥â™¥â™¥â™¥ for the steam awards!",
            "review_score": "-1"
        },
        {
            "review_text": "ITS â™¥â™¥â™¥â™¥ING BEEN 32 MINS AND STILL HAVE NOT JOINED A SERVER. WTF IS THIS GAME. I THOUGHT IT HAD GOOD SERVER COMMUNITIES ( some containing only 3/100 players -_- ) I would much prefer playing the actually game instead of wasting my time on the menu trying to join a annoying server! Only recommended when the game fixes the â™¥â™¥â™¥â™¥ing servers! There are so many errors with this game, after the new patch, the game has a communication error. Servers need to be fixed",
            "review_score": "-1"
        },
        {
            "review_text": "This is basically War Z re-released. IT was â™¥â™¥â™¥â™¥ back then and its â™¥â™¥â™¥â™¥ now. Dont waste your time or bandwidth.",
            "review_score": "-1"
        },
        {
            "review_text": "worst that the first spawned in the same place 5 times killed by a person that has full kit game sucks worse than its first",
            "review_score": "-1"
        },
        {
            "review_text": "Same â™¥â™¥â™¥â™¥, like the old one, they â™¥â™¥â™¥â™¥â™¥â™¥â™¥â™¥ on the people who plays it.",
            "review_score": "-1"
        },
        {
            "review_text": "10/10 for wasting my time,Main menu lags so bad takes ages for anything to happen,Going to make a free game and hope people to give you money to pay for items you need a game that will accually load.... Not going to spend time working out whats wrong that isnt my job as a customer so to speak",
            "review_score": "-1"
        },
        {
            "review_text": "If you die you spawn in the same spot Every time...",
            "review_score": "-1"
        },
        {
            "review_text": "Just don't even download it, you'll want back the 10minutes of your life you wasted by trying to play the game. Would only recommend this game to people I hate.",
            "review_score": "-1"
        },
        {
            "review_text": "i mistakingly bought infestation 1 when it was on sale years ago and now i cant even play it without seeing a banned account screen  now it decides to show up as a free to play when i cant even interact with the main menu at all, and i mean at all  thanks for nothing again",
            "review_score": "-1"
        },
        {
            "review_text": "From 10 tries to enter any server i entered only once, every time i just enter the server and get disconecterd...  10/10 would be disconnecting",
            "review_score": "-1"
        },
        {
            "review_text": "it was a fun game, played not that long. I am usually a person of dayz and this game is kind of like it.  just not as fun and tactical. first thing I see when I get into a game is a crap ton loot with weapons and armor. not even a minute later I see someone trying to shoot me. hit me once but didnt kill me. luckily I had a lmg and pushed on him and killed the mofo easily. it is only about 30% like dayz but lacks few things to make it good. got few kills after and didn't get killed. usually I die lots but I guess tactical fps games like arma 2/3 got me using my brain in strategy. the only con...got boring fast.",
            "review_score": "-1"
        },
        {
            "review_text": "Disconnected from server",
            "review_score": "-1"
        },
        {
            "review_text": "This game is â™¥â™¥â™¥â™¥ing awful. kicked for suspected cheating and my game screen stutters like a b",
            "review_score": "-1"
        },
        {
            "review_text": "I 'played' this game for about 2 minutes before i either got killed or it trashed my machine.   I know it's free to play but it could be better. I mean, what's the actual aim of the game? I killed 1 zombie, then some hyped up fool with an AK shot me in the face..er, no.   After my 2 minute respawn time-ridiculous-i attempted to rejoin and it froze. I was unable to give my machine any commands so had to perform a hard restart.   Real shame but DELETED.",
            "review_score": "-1"
        },
        {
            "review_text": "Terrible game for beginners. I'm not sure if it's the influx of the steam community or just how the normal community of the game is, but the beginner servers are all flooded with people who shoot first and ask questions later. Spawn placements always seem to set you by at least 2-3 other players all of whom seem to be decked out with gear. Other than that it seems like a great game. PVE servers really mean shoot anyone and everyone that you see.",
            "review_score": "-1"
        },
        {
            "review_text": "was in a battle royal match in the top 10 left change weapon game crashes 10/10 - IGN  but srsly this game is buggy and laggy as â™¥â™¥â™¥â™¥ right now I dont recommend playing this game right now but maybe when they fixed some crash problems",
            "review_score": "-1"
        },
        {
            "review_text": "This Game is utter garbage, 9 out of 10 attempts to loat into a server result in failure. either you get disconnected over and over or decompress fails upon load, or you load into a server and take 40 steps and get disconnected. it is absolutely rediculous that this incomplete garbage is even available to the public. there is only one reasonable coarse of action now for the developers. go to home depot and buy a rope and a stool , and kill your selves.",
            "review_score": "-1"
        },
        {
            "review_text": "This game shouldn't exist tbh but my friend got a legit headshot on a scrub and got banned LOL steam remove this â™¥â™¥â™¥â™¥â™¥",
            "review_score": "-1"
        },
        {
            "review_text": "so i though id give this new and improved version ago...   and in all honestly i was an avid player of the last war z... yes to all it faults it was a rubbish game but yet i always found some fun in it, alot of fun with you had a nice group.  this new and improved version is well.. how can i put it no different! there promise of new game mods etc... but everything has pretty much been re-used a few slight tweaks here and there i.e new hud/sorta.. with all the promises in the original game that would come be it new maps and feature none of it actually did. so i really cant see this doing the same they basically re-released war z with wepon skins   unfortanly i cant give this a thumbs up because it still lacks features it promised with the original game",
            "review_score": "-1"
        },
        {
            "review_text": "Bad game, lots of crashes, bugs, never played for more than 30 minutes straight with my friend, both of us have trouble, great concept, bad developers, hope it gets better, but now, It doesn't deserve my money to buy in-game items nor my time",
            "review_score": "-1"
        },
        {
            "review_text": "Lets start off by saying I NEVER write reviews. This is my first review because I need to let everyone know how crap this game is. I've played this game since the first day of WarZ, and steam releasing this game is a joke. This has even more bugs than WarZ that was rated the worst game of the year. I challenge anyone to play this game for 30 minutes without disconnecting or crashing.",
            "review_score": "-1"
        },
        {
            "review_text": "Cancerous",
            "review_score": "-1"
        },
        {
            "review_text": "Terrible game get spawn killed right off the bat. Have to pay to respawn otherwise you're stuck staring at the main menu. Pay to Win. Just overall a â™¥â™¥â™¥â™¥â™¥â™¥ game.",
            "review_score": "-1"
        },
        {
            "review_text": "The Game is good in general but the community are a bunch of â™¥â™¥â™¥â™¥ we spawn without a thing and they spawnkilling us and looting our little fckg small backpack get a life damn",
            "review_score": "-1"
        },
        {
            "review_text": "this game is a big pile of â™¥â™¥â™¥â™¥   Guys Play h1z1 !",
            "review_score": "-1"
        },
        {
            "review_text": "BAD graphics",
            "review_score": "-1"
        },
        {
            "review_text": "when its loading it crashes my pc please fix this",
            "review_score": "-1"
        },
        {
            "review_text": "its a SCAM its â™¥â™¥â™¥â™¥ it dosent work it dosent have the exe files to play the â™¥â™¥â™¥â™¥â™¥â™¥ game -1/10",
            "review_score": "-1"
        },
        {
            "review_text": "JOGO MANEIRO , PORÃ‰M, SERVIDORES HORRÃVEIS DE LIXO !! PING 2123123123123 TRANSALTE: COOL GAME , GARBAGE FREAKING SHIETTTTTT SERVERS !! PING 123123123123",
            "review_score": "-1"
        },
        {
            "review_text": "I have been playing Original WarZ since the release and have loved playing the game, even though i havent been playing the game anymore when i heard the game is getting shut off dec 15th it was a little sad because i played the game for 3+ years, and once i seen they were promoting the newZ i was disgusted, Fredaikis (owner of this game) has been a primary hacker on the â™¥â™¥â™¥â™¥â™¥â™¥â™¥â™¥â™¥â™¥â™¥â™¥â™¥ community, one of the sites creating all the hacks that would kill you in the original game, now that he got a little money hungry he threw together his own emulator and managed to make it an offical game. A PERSON THAT MADE HACKS FOR WARZ FOR 3+YEARS IS NOW THE OWNER OF THIS GAME. does nobody understand how â™¥â™¥â™¥â™¥ing corrupt this is? the only reason this game has players is because WarZ told people to play it, if you are from orignal Warz/infestation do not play this game, its not what it seems. its filled with stupid mods and skins and to much gear, when the more experienced players have 50k+ vss and snipers its a â™¥â™¥â™¥â™¥ing joke, the game is not fair and nor should it be on steam, it literally has nothing special added to it other than some dumb ingame skins, if you are looking to play a emulator that isnt looking to take your money then go google infectz. im telling you nobody should waste your time downloading this game,",
            "review_score": "-1"
        },
        {
            "review_text": "The War Z, sued. Removed from STEAM for violations back in 2012. Renamed 'Infestation: Survival Stories' the same year.  Nothing has changed. Gameplay is still slow, and boring. Hackers are still rampent. Inventory is a joke. The game now separates to allow new players to actualy learn a bit of the game before PVP outright destroys them. (taking their loot) But other than that, 2 modes STILL unavailable. The EXP/leveling system is poorly managed, and there are too many guns, not enough Melee options.  Oh and if you don't like Microtransactions being pushed on you - don't look at any shops.   I am an original 'The War Z' backer. I had high hopes back in the forums for the game, but it has NEVER once come through with it's promises. The company 'OP Productions LLC' Should simply be sued and forced to pay US for the problems. oh wait, they were sued, back in 2013.  This game is a joke guys. It's not 'changed' at all. It has all the flaws with a new title. The game hasn't fixed any of the game breaking problems it had, nor updated graphics. IT is stuck in 2012, using re-'early realease' as an excuse, and hoping this time you'll spend money in Micro Transactions to keep lining their pockets.",
            "review_score": "-1"
        },
        {
            "review_text": "Disconnected .... again again..",
            "review_score": "-1"
        },
        {
            "review_text": "Infestation: The New Z is an under-developed 'videogame' (it basically is an emulator). It began as a stolen file that was worked on. 'Fredaikis AB' is a non-professional amateur group of persons that simply wants money. In-game assets, news, and even activities done by the developers are offensive and simply should not have the privilege of being on Steam. The owner of the game has created cheats in the past to destroy the competition, that is not fair at all.   Pros:  - Gameplay itself is fun, yet it feels clunky.  - The loot in the game is amazing, it provides a sense of reward.  - Skin and crate system implementation.  Cons: - Non-professional skins (badly executed and designed). - The user interface is very bad. - Irregular development process and development.  - Bad AI. - The cycle is repetitive and there is nothing to do on the world. - The atmosphere feels cheap and non-professional.  - Non-original items.   Note: I have been a veteran player. I've seen what they have done (things such as banning players with no reason, emptying global inventories, etc.) and it is a mess.   Score: 3/10",
            "review_score": "-1"
        },
        {
            "review_text": "This game has 0 tutorial and is very unfriendly to beginers. I spawned in twice and died almost instantanius both times.",
            "review_score": "-1"
        },
        {
            "review_text": "Game made by an autistic russian that lives in the Meme World.",
            "review_score": "-1"
        },
        {
            "review_text": "This is the same stupid game as Infestation: Survivor stories, with the buildings moved around. Oh. I forgot to say it's even more Pay2Win.",
            "review_score": "-1"
        },
        {
            "review_text": "Disconnected from game, Failed to join game, Failed to create character. Only thing that does not fail is the uninstall option?",
            "review_score": "-1"
        },
        {
            "review_text": "This game is DISGRACEFUL! Even a new developing studio but has not changed anything. Still lagging, instan disconnect from the server and graphic very super low. This game and developers should be banned forever!",
            "review_score": "-1"
        },
        {
            "review_text": "Disconnected from game, Failed to join game, Failed to create character. Only thing that does not fail is the uninstall option?",
            "review_score": "-1"
        },
        {
            "review_text": "this game is complete trash.. cant even log in half of the time it says ' game session active, try later' you alt tab and it black screens and you have to restart and then wait a random amount of time to lob back in because of that message. then when you are able to log into the game you click a server and join game gets all the way done then kicks you to the server screen again saying disconeccted from server... this game sucks its free and i still feel like i was robbed, the original one was bad but at least you could log in and 'play'..",
            "review_score": "-1"
        },
        {
            "review_text": "this game is complete trash.. cant even log in half of the time it says ' game session active, try later' you alt tab and it black screens and you have to restart and then wait a random amount of time to lob back in because of that message. then when you are able to log into the game you click a server and join game gets all the way done then kicks you to the server screen again saying disconeccted from server... this game sucks its free and i still feel like i was robbed, the original one was bad but at least you could log in and 'play'..",
            "review_score": "-1"
        },
        {
            "review_text": "Fun for a few hours with mates, especially while premium is free. But it's buggy as hell and I am baffled by the idea that people would pay to revive a character in this game like its a crappy mobile free to play. Free to play is about the only thing its got going for it. Never bought DayZ, H1Z1 or the like so I thought I'd try it. 99.99% of the fun came from just being with friends. Don't even bother if you have no one that will play with you.",
            "review_score": "-1"
        },
        {
            "review_text": "Game was enjoyable at first but the Run speed makes the game unbearable.  Nothing like running for a long time in RL time and dieing to a camping sniper.  I like how to take loot out of server and can use the loot / items in any server as you gear up befre joining servers.",
            "review_score": "-1"
        },
        {
            "review_text": "suck.its dayZ in new name",
            "review_score": "-1"
        },
        {
            "review_text": "SUCK THIS GAME IT SO â™¥â™¥â™¥â™¥â™¥â™¥â™¥â™¥ potato graphix potato server â™¥â™¥â™¥â™¥ this don;t install it",
            "review_score": "-1"
        },
        {
            "review_text": "cant join a server.",
            "review_score": "-1"
        },
        {
            "review_text": "Really crap game, no PvE to speak of. Mostly people with not much else to do are camping towns so no one else can gear up, don't waste your time.",
            "review_score": "-1"
        },
        {
            "review_text": "Ok well the dev's clearly don't know how to make and porperly run a game because when I got it woudn't let me join a server... It would load in and disconnect me. (my internet is really good so it's not that) please fix the game so that I can ACTUALLY PLAY..",
            "review_score": "-1"
        },
        {
            "review_text": "its Rust 2.0, except uglier and with zombies and trigger happy players so if you die, You will not be able to get revenge on that campy â™¥â™¥â™¥â™¥â™¥â™¥â™¥â™¥â™¥â™¥â™¥â™¥ because you'll have to leave the server for 2 minutes until your character revives somehow.  It's all about that sweet and sour call of duty flavored 'I saw him first = kill' situation everytime.        Oh and it's pay to win by the way, so have fun with that.",
            "review_score": "-1"
        },
        {
            "review_text": "TLDR: Same game, another title.  I bought game WarZ long time ago which was from same developers and now here is same game with same textures and code but for free! Besides of that seems like it's become more unplayable then it was before, anticheat doesn't solve problem with cheaters, loot system is way unbalanced.",
            "review_score": "-1"
        },
        {
            "review_text": "First off people you got to realize different developers are working on this game its not the 'scamz' guys we were dealing with last time its a new crew and the games Free to Play how's that a scam? on top of that it's not pay to win upon loging on i thought it was since there was ammo and weapon parts on the shop but those are up for currency you earn not buy those are not premium items as far as i can tell they are in-game cash items. That said i do have issues with the game it's self and can't recommend it at this point i do hope the issues are fixed as this could be a good free to play alternative to zombie survival games.    Biggest problem i have would be the fact enemies can hit you from 3 arm lengths away. Leaving you hopeless when it comes to trying to kite them. They are also fairly fast and your character seems to run fairly slow. This is my biggest reason for not being able to recomend the game.",
            "review_score": "-1"
        },
        {
            "review_text": "It said 'Click anywhere to continue'. I clicked everywhere. After like 15 minutes and a few restarts, it finally disappeared.  I clicked Options. Didn't do a thing. I clicked it multiple times and after 15 minutes, it finally went to options.  I tried to change my settings. Didn't do a thing. After 15 minutes, it finally changed.    Couldn't save though     I tried to press play. Didn't do a thing. After 15 minutes.... Still nothing.  And that children, is why I have 6 minutes on record.",
            "review_score": "-1"
        },
        {
            "review_text": "Has alot of bugs ...DC from server like 5-10 min in the game ..hope they fix it",
            "review_score": "-1"
        },
        {
            "review_text": "I played this game a few times under different names. Only one damn thing has changed. Now, I just cant connect to a server. Everytime I join a server, it loads in, then kicks me off right away, and says 'Could not connect to server' this is trying probably 20 â™¥â™¥â™¥â™¥ing times, in three days. Being uninstalled now.",
            "review_score": "-1"
        },
        {
            "review_text": "Stuck in the main lobby.",
            "review_score": "-1"
        },
        {
            "review_text": "I dont ever bother writing reviews whether the game is good or bad but I need to rant about this one. I dont want to say it, because this game has potential and I have brief periods of fun while playing but this game is just awful. It should have never been released in this current state. Its clear this game was released before it was even remotely ready to get some easy cash from players.   Pros:  Killing stuff feels great and when you get into gun battles with other people its really fun. Getting to keep your loot in a off server inventory so you can always start with something is a nice but I always feel like im grinding to put guns away so each time you spawn you can defend yourself.     Cons: It takes way to long to get into a server. And I constantly get kicked from servers. After you die there is a wait time which is pretty annoying. Even after the revive time has passed the game still says your dead and you cant respawn. When you hit the disconnect button you cant cancel the action. Game bugs out when you try disconnecting from server and lose gear you have been getting for the past half hour. Every time I get killed its from one shot of a sniper from someone hiding behind a tree on the outside of a town.  The boss zombie isnt hard to kill but more than anything its just stupid. Its in the center of every town making is super annoying to try and loot. The agro range of it is too far. You'll be running 100 feet away from it and it will chase you until it kills you. It can run faster than you and after it kills you it camps your loot until it despawns. Ive even been walking in a building and the boss is just casually walking through and just follow you and punch you until you die.",
            "review_score": "-1"
        },
        {
            "review_text": "I can not join any server",
            "review_score": "-1"
        },
        {
            "review_text": "Trash Steam Remove pless!",
            "review_score": "-1"
        },
        {
            "review_text": "Absolute sh!t",
            "review_score": "-1"
        },
        {
            "review_text": "Well I did not expected something so stupid and dumb. Just don't download it it's really not worth it. Graphics are utter â™¥â™¥â™¥â™¥ and mechanics too. Nice waste of 5 gigabytes.",
            "review_score": "-1"
        },
        {
            "review_text": "this game is still a huge turd dont waste your time abosoultey horrible",
            "review_score": "-1"
        },
        {
            "review_text": "...",
            "review_score": "-1"
        },
        {
            "review_text": "yeah its free to download but then u have to rent a server to play so its not free",
            "review_score": "-1"
        },
        {
            "review_text": ":(",
            "review_score": "-1"
        },
        {
            "review_text": "Servers are â™¥â™¥â™¥â™¥.",
            "review_score": "-1"
        },
        {
            "review_text": "The New Z is just repackaged f2p p2w of Infestation: Survivor Stories/WarZ trash.",
            "review_score": "-1"
        },
        {
            "review_text": "Leave this game alone, not worth the time to download.  Due to.... Servers are broken/limited (see below). They've been promising a fix for some time now, nothing yet. No offical PVE servers, only PVP (which with below reason, makes it not worth playing). You've got people playing on the beginner servers with assult/sniper guns, that they certainly shouldn't have on a beginner server, since as a starting player, you start with NONE! There are private servers, but you can only have a private server by paying for it, and most are password protected, so you have no access. Which is fine, if they wasn't the only PVE servers able to play on.",
            "review_score": "-1"
        },
        {
            "review_text": "It would be better if they had oceania servers.",
            "review_score": "-1"
        },
        {
            "review_text": "the server of this game is really bad,i can't join anygame with out disconnect and i have a really goodv internet ",
            "review_score": "-1"
        },
        {
            "review_text": "Game sucks, nothing more to add",
            "review_score": "-1"
        },
        {
            "review_text": "Free to Play? Awesome lets give it a try...  â€¢ Install â€¢ Launch â€¢ Create new character â€¢ Create Scarce lookalike with flannel shirt â€¢ Enter character name â€¢ Bob Ross â€¢ Name already taken â€¢ Enter character name â€¢ Scarce â€¢ Name already taken â€¢ Enter character name â€¢ Spicymeme â€¢ Survivor name cannot contain profanity words â€¢ Enter name Yoshiemota â€¢ Finally a name that isn't taken! â€¢ Play on Official Server â€¢ You need at least one hour of total playtime or a premium account to join this server â€¢ Join beginners server â€¢ Finished loading â€¢ Run 3 metres forwards â€¢ You were killed by MLGcamper â€¢ Exiting in [60] seconds â€¢ I cri everytiem â€¢ Back to main menu â€¢ Wait a bit â€¢ Revive character â€¢ Join new server â€¢ No bandages, no flashlight, no food â€¢ Walk around for 2 minutes â€¢ Wow I haven't been killed yet! â€¢ Hear shooting â€¢ Run towards shooting because why the fâ—˜â—˜k not? â€¢ Guy kills 3 others fully armed with guns â€¢ Pause behind tree and find key bind for voice chat â€¢ Run at him saying 'Ghello my friend.' â€¢ Get killed â€¢ Wait 3 minutes to revive â€¢ Happily Quits game â€¢ Right click Infestation: The New Z â€¢ Delete local content â€¢ Delete â€¢ Cry myself to sleep",
            "review_score": "-1"
        },
        {
            "review_text": "terrible game i was playing in the beginner server went to grab a drik from the fridge and was permenantly banned saying i was cheating this is â™¥â™¥â™¥â™¥â™¥â™¥â™¥â™¥",
            "review_score": "-1"
        },
        {
            "review_text": "Game blows! Do not play!",
            "review_score": "-1"
        },
        {
            "review_text": "1. devs can't reapir simply bugs 2. more and more cheaters appearing - like old iss   dont spend money on this game",
            "review_score": "-1"
        },
        {
            "review_text": "40 sec play time beginner server full shot to deth stuff lost atleast you get 10 rifles when you start game first time or i dont know why i get 10 rifles the menu is 30buttons dont know what they do tutorial or some would be nice but now iam done uninstall and never put it back on hdd",
            "review_score": "-1"
        },
        {
            "review_text": "Why cant i join servers!",
            "review_score": "-1"
        },
        {
            "review_text": "XD i can't play any server after fixed GG",
            "review_score": "-1"
        },
        {
            "review_text": "This game is awful. You spawn in the same place and get killed by a sniper or a group of people right off spawn. You are never able to find friends or move around the map.",
            "review_score": "-1"
        },
        {
            "review_text": "Do not waste your time!!",
            "review_score": "-1"
        },
        {
            "review_text": "â™¥â™¥â™¥â™¥â™¥â™¥ game. Romero after match rip off but more trash",
            "review_score": "-1"
        },
        {
            "review_text": "This game is â™¥â™¥â™¥ its wonky asf and its mostly pay to win the game. And who ever made this broo dont make another game really",
            "review_score": "-1"
        },
        {
            "review_text": "This game sucks â™¥â™¥â™¥, when you spawn in to a server with no items chances are you are going to get shot down. Connecting to a server takes too long, graphics suck, my rating for this game 0/10",
            "review_score": "-1"
        },
        {
            "review_text": "Someone would need to pay ME to play this game.",
            "review_score": "-1"
        },
        {
            "review_text": "fu**ing waist of time",
            "review_score": "-1"
        },
        {
            "review_text": "â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘ â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘Meâ–‘â–‘â–‘â–‘â–‘â–‘  â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–ˆâ–€â–€â–‘â–‘â–ˆâ–‘â–‘â–‘â–‘â–‘ â–‘â–‘â–‘â–‘â–‘â–‘â–„â–€â–€â–€â–€â–‘â–‘â–‘â–‘â–‘â–ˆâ–„â–„â–‘â–‘â–‘  â–‘â–‘â–‘â–‘â–‘â–‘â–ˆâ–‘â–ˆâ–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–â–‘â–‘  â–‘â–‘â–‘â–‘â–‘â–‘â–â–â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–„â–‘â–â–‘â–‘  â–‘â–‘â–‘â–‘â–‘â–‘â–ˆâ–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–„â–€â–€â–‘â–â–‘â–‘  â–‘â–‘â–‘â–‘â–„â–€â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–â–‘â–„â–„â–€â–‘â–‘â–‘  â–‘â–‘â–„â–€â–‘â–‘â–‘â–â–‘â–‘â–‘â–‘â–‘â–ˆâ–„â–€â–‘â–â–‘â–‘â–‘â–‘  â–‘â–‘â–ˆâ–‘â–‘â–‘â–â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–„â–‘â–ˆâ–‘â–‘â–‘â–‘  â–‘â–‘â–‘â–ˆâ–„â–‘â–‘â–€â–„â–‘â–‘â–‘â–‘â–„â–€â–â–‘â–ˆâ–‘â–‘â–‘â–‘  â–‘â–‘â–‘â–ˆâ–â–€â–€â–€â–‘â–€â–€â–€â–€â–‘â–‘â–â–‘â–ˆâ–‘â–‘â–‘â–‘  â–‘â–‘â–â–ˆâ–â–„â–‘â–‘â–€â–‘â–‘â–‘â–‘â–‘â–‘â–â–‘â–ˆâ–„â–„â–‘â–‘  â–‘â–‘â–‘â–€â–€â–‘â–„â–„â–„â–„â–„â–‘â–‘â–â–„â–„â–„â–€â–‘â–‘â–‘â–‘  â–‘â–‘â–‘â–‘â–‘â–‘NEWZâ–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘ â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘",
            "review_score": "-1"
        },
        {
            "review_text": "Now, from a glance it looks like I have 36 minutes of play time on this game. In reality, my playtime is 8 minutes (that's how long it says my character has been played for).    10/10 disconnected from game server simulator",
            "review_score": "-1"
        },
        {
            "review_text": "PLEASE fix this game its fun but it keeps on crashing",
            "review_score": "-1"
        },
        {
            "review_text": "'item being saved' just facing entire army of the world with your only flashlight . trash game",
            "review_score": "-1"
        },
        {
            "review_text": "sh*tty, just another overpopulated shooter pvp.",
            "review_score": "-1"
        },
        {
            "review_text": "This game â™¥â™¥â™¥â™¥ing sucks. Never have I been so infuriated by a game.   I played the WarZ when it was that, the WarZ. I have some awesome memories of that game with a few of my friends and I thought 'Why not, could spark some nostalgic effect'. Long story short, it didn't do that. Even the WarZ was less buggy than this â™¥â™¥â™¥â™¥. Maybe the reason its called the 'NewZ' is because the devs have decided to put some newborn, downsyndrome ridden chimps at the base of producing this steaming pile of excrement.   It'll say I've played for 3.5 hours, 3.4 of which were trying to join a bloody server. The incompetent devs decided to purposly buy â™¥â™¥â™¥â™¥ server or something like that. You'll constantly get 'Disconnected from server' or something like that, and to say that this game has had a few re-issues over the last few years you would have thought they could have overcome this.   Verdict: The game is â™¥â™¥â™¥â™¥. Wait until the devs do something with the game in stead of wanking into eachother's pockets and saying its a prank, which is currently what they're doing.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is okay and a good copy of Day Z, but when you farm up, you'll get sniped and lose all your weapons. It is also very hard to reconnect and even if you connect, the server will disconnect you. And once you die, when you try to reconnect, it says that you're in another game and if you close and open it again, it'll say somebody is in a game with your account.  Overall, Terrible game.",
            "review_score": "-1"
        },
        {
            "review_text": "Massive issues with server stability and frequent crashes to desktop: It feels like this is an early alpha version. 30 minutes to wait for rejoining seem to be normal.  Also, you shouldnt expect a survival game. This is a shooter with strong focus on sniping.  You start farming, suddelny you are instagibbed by a player and again have to wait for another odd 30 mins to reconnect.   ",
            "review_score": "-1"
        },
        {
            "review_text": "Try to enter on a server Wait for loading Disconnects Try 3 more times Eventually got on a server Spawnkilled by someone kosing Try to enter on another server Wait for loading Server is full Quit Uninstall",
            "review_score": "-1"
        },
        {
            "review_text": "Just as â™¥â™¥â™¥â™¥â™¥â™¥ as the first version of this game called WarZ. Playtime: Just created a character to get instakilled 2 seconds into the game by a golden weapon. Summary:The developers decided to re-release WarZ but now with 200% more microtransactions.",
            "review_score": "-1"
        },
        {
            "review_text": "As long as: 1)Respawns sucks, and you got bullet in your head at start 2)We'll find weapons everywhere. 3)You'll don't back epic first WarZ, where Sniper was worth more than your whole life I'll dissuade this game for everyone.",
            "review_score": "-1"
        },
        {
            "review_text": "i press play and nothing opens on screen. task manager says it's still running. how do i fix? the redlist or redlog whatever its called says 000001.041| r3dFile: can't open game.ini 000001.041| Can't open file 'game.ini' if someone knows how to fix please message me",
            "review_score": "-1"
        },
        {
            "review_text": "Downloaded game Started Game Spawned Get â™¥â™¥â™¥â™¥ on in the first 30 seconds by a guy with a P90 - kay Wait 45 seconds for the death screen to close Gets to menu 3 minutes wait time to spawn again Get this cancer out of my PC",
            "review_score": "-1"
        },
        {
            "review_text": "I can't say I hate it, but I can't say I like it either. It is fun and all that, but very glitchy. So I 49% recomend yes, and 51% recomend no just because of all the glitches!",
            "review_score": "-1"
        },
        {
            "review_text": "No more rage, just no... My mouse can not handle it any more.. How it goes: 1. Spawning; 2. Running to the city; 3. Taking some good loot; 4. Dieing from sniper who shoots me from somewhere; 5. Respawning; 6. Trying to run to the city; 7. Dies of player with good loot whitch spawned on my back; 8. Crieing, rage quiting, saying that I wount play this game agan; 9. After 5-10 mins reapeating steps from 5 till 9..;",
            "review_score": "-1"
        },
        {
            "review_text": "i think that this game shloudn't be realeased if it still Has BUGS in. For example i can't join any server without   1. LAGGING  2. Getting kicked because they think i'm cheating in the firts 2 seconds  3. Just Disconnected for Nothing even if my ping good   So i would say fix them freakin game then it can be a FUN GAME",
            "review_score": "-1"
        },
        {
            "review_text": "Complete and utter â™¥â™¥â™¥â™¥ Had to wait like 20 minuets for it to acutally connect to a server but when it did that said it had disconnected me from it and i kept trying and trying Most of the time i spent trying to â™¥â™¥â™¥â™¥ing play the game Do not recommend this Never play it unless you want to die of wait times",
            "review_score": "-1"
        },
        {
            "review_text": "Best crash simulator ever! Even when you get disconnected the game still playing for you cause it says always my game session is active! =D ",
            "review_score": "-1"
        },
        {
            "review_text": "Pointless game. Vehicles don't work. Terrain looks bad. Players shoot first ask questions later. Day Z wanna be really. Unless you subscribe there is nothing there for you. I played for 81 minutes and died 6-7 times. Voice chat does not work. Game lags pretty bad. Had to restart my computer to fix it. Sound effects are ok. No story line, no back story. Game lacks depth, immersion, and an end game. Screen shots you see on the advertisment lean towards false advertising. As far as equipment goes, there's stuff all over wich is good to help the new players but the packed servers make it hard for anyone to have a chance to even get a knife before they are gunned down. Free to play is limited to FTP servers only. The interations with melee weapon vs zombie are poor. Can't really judge distance and it goes through them, then they react. Armor in the game has little use as it protects you from nothing. Would not recomend. But I would recomend they pull this game off until it reaches it's full potential.",
            "review_score": "-1"
        },
        {
            "review_text": "This game sounds like a good idea. Thought I'd give it a try because it's free. So I did. Played like 5 minutes. Found myself a server after around 5-6 failed attempts. Have fun getting kicked by 5/6 of the servers. Anyway, I finally find a server that won't auto-boot me. Gameplay is pretty dark, rarely see a zombie. Finally find one. I hit it 2-3 times and it dies but the voice over of a teenage girl going 'ouch ow oo ow argh' is what really sums this game up, that's the best part. Not even worth the download. This game is trash, I wish I was paid to write a good review. Such a waste of time.",
            "review_score": "-1"
        },
        {
            "review_text": "it banned me forever for no reason and i only played it twice, l why???",
            "review_score": "-1"
        },
        {
            "review_text": "Man, this game need to be fixed... lot of problems in the launcher and in the game!!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "Freemium garbage with players who shoot, punch, or swing at anything that sways in the breeze.",
            "review_score": "-1"
        },
        {
            "review_text": "Its sort of fun... at least when you're playing it. About 75% of the time you spend on the game is fighting random diconnects and crashes. Most of your deaths will probably be to randomly crashing during a fight. The graphics are okay, for the most part, even though characters teleport rather than walk.",
            "review_score": "-1"
        },
        {
            "review_text": "after the recent update the launcher for it is freaking stupid i sometimes have to wait for freaking 10 min for it... and when i enter the game it itended to get laggy and make my screen stuck i think is the map loading problem last time it was not like that",
            "review_score": "-1"
        },
        {
            "review_text": "good zombie game, if it doesn't disconnect you every 5 mins and loses your items you picked up...",
            "review_score": "-1"
        },
        {
            "review_text": "This game keeps crashing after the update screen might me because of server downtime",
            "review_score": "-1"
        },
        {
            "review_text": "Game is so â™¥â™¥â™¥â™¥ing broken. Just tried spawing into different maps like 4 different times and not in the game 2 mins and get sniped by someone before i can even find gear. this is so stupid. please fix this â™¥â™¥â™¥â™¥â™¥â™¥â™¥t",
            "review_score": "-1"
        },
        {
            "review_text": "Tons of chrashes, the roll backs are â™¥â™¥â™¥â™¥ing real.",
            "review_score": "-1"
        },
        {
            "review_text": "Hey There.  This Game is not so bad as it seems. Its like DayZ withut the laaarge maps but DayZ was better. Infestation is full of playerkillers . I started many times with many characters at many servers but i never get any further than 20 Minutes. I didnt starve or died by thirst. I never got killed by a zombie or anything like that. I always died because of playerkillers. Any person i saw just started shooting or hitting each other on sight. Why ? I dont know . Most of the time youre just dead. But the time youre alive you search for stuff and weapons in buildings or little settlements. That part is pretty good but the most annoying thing with this game are the other players who always will kill you on sight. The Graphics are pretty good and it runs smoother than dayZ.",
            "review_score": "-1"
        },
        {
            "review_text": "this game seriously sucks donkey â™¥â™¥â™¥â™¥ way to much pvp. you need to make a pvz server to many â™¥â™¥â™¥â™¥â™¥â™¥ bags getting all wet and killing everyone in the game for apsolutely nothing to gain from it except getting a boner for killing another player for a mre packet seriously need to fix that bs!",
            "review_score": "-1"
        },
        {
            "review_text": "Just a bad game  why?  I just press play and the game doesnâ€™t start I was looking on the forums and oh :O what I just found?  it's normal lots of people are complaining :D I cant even say if the game has a good gameplay yey \\o/",
            "review_score": "-1"
        },
        {
            "review_text": "just like the other infestation games (you know the ones i mean)  well in short just like the other ones  again it's just full of people camping and waiting for you to come by and kill youthe second they see you, there is no teamwork at all, people kill without thinking.  there are hardly any zombies at all, just â™¥â™¥â™¥â™¥â™¥â™¥â™¥s all over the place",
            "review_score": "-1"
        },
        {
            "review_text": "I played this when it was 'WARZ' and left because there were to many cheaters around. I tryed giving The New Z a shot, but i kept getting an error when i tryed launching the game, so i contacted support. Well ... Their support is the worst !!! After 5 days of 'chatting' i kept getting the answer: 'delete that folder and re-install' ... I did that like 10 times ... Then i gave up ... sad support desk ... sad game ...",
            "review_score": "-1"
        },
        {
            "review_text": "If not being able to aim is your gag, then by all means download this. But going from 3rd person to more of a Resident Evil 4 camera AS THE ZOOMED IN RIGHT CLICK, is just horrible. The screenshots are all a lie as the game looks NOTHING like what they show. The graphics aren't TOO bad, but there is ZERO interaction with anything, and the sluggish movement make for just awful escape patterns.   2/10 for the 2 people I kiled during my short time frame playing",
            "review_score": "-1"
        },
        {
            "review_text": "obviously it sucks lol",
            "review_score": "-1"
        },
        {
            "review_text": "This game gave me a brain hemreage and all the known forms of cancer, It stole my chromosons. I feel as if this free to play game should pay me to play it it is that â™¥â™¥â™¥â™¥.",
            "review_score": "-1"
        }
    ]
}