{
    "app_id": 555610,
    "name": "Gunmetal Arcadia Zero",
    "release_date": "2016-11-15",
    "developer": [
        "Minor Key Games"
    ],
    "publisher": [
        "Minor Key Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Action",
        "Indie"
    ],
    "achievements": 11,
    "positive_ratings": 68,
    "negative_ratings": 16,
    "price": 4.79,
    "description": "Unrest brews in the city of Arcadia, and a monstrous enemy approaches.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/555610/header.jpg?t=1555631342",
    "minimum_requirements": "OS: Windows XP SP2 or newer Processor: 1.2 GHz or faster Memory: 128 MB RAM Graphics: GeForce 8 series or equivalent DirectX: Version 9.0c Storage: 100 MB available space",
    "recommended_requirements": "Graphics: Dedicated graphics card Additional Notes: Gamepad recommended",
    "reviews": [
        {
            "review_text": "Just started playing - only at Chapter 2 - but oh man another excellent job by Minor Key Games! The game engine &amp; overall 'feel' of the player character is great!  Very excited to get more into the game - I'll update my review as I find time to explore more!",
            "review_score": "1"
        },
        {
            "review_text": "Short and sweet.",
            "review_score": "1"
        },
        {
            "review_text": "If you enjoy 2D platforming adventure games in the style of the trailer and screenshots posted on this store page, especially if those reminded you of good times with NES-era games like Zelda II, Ninja Gaiden, Castlevania, etc, then you really should grab this.   It only took me a couple hours to complete the 6 levels of the story on my first attempt, but I really enjoyed going back through New Game + to search out all the secrets I missed and items I could not quite afford in my first run. Now, I'm working on outlining a speedrun for myself.   The main game is not particularly difficult - if you have experience with any of the games I mentioned, know that this game will not present you with the same level of frustrating challenge. However, the movement and attack mechanics in GAZ have been refined beyond what was perhaps even possible with the hardware limitations of those early titles, and this is very good fun to play with as a result. The real challenge to GAZ is mastering those mechanics - how fast can you beat it? Can you do it with the limited weapon and mobility upgrades you will be able to afford if your goal is to complete the story in under 30 minutes as one achievement challenges?  Gunmetal Arcadia Zero is apparently a direct prequel to an expanded and procedurally generated follow-up simply titled Gunmetal Arcadia that will release in early 2017. For the price, this game offers a nice introduction to the characters, setting, and various gameplay mechanics developed for GA.",
            "review_score": "1"
        }
    ]
}