{
    "app_id": 559010,
    "name": "Cosmic Sugar VR",
    "release_date": "2016-11-27",
    "developer": [
        "David Lobser"
    ],
    "publisher": [
        "Object Normal"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Free to Play",
        "Simulation"
    ],
    "tags": [
        "Free to Play",
        "Simulation",
        "VR"
    ],
    "achievements": 0,
    "positive_ratings": 241,
    "negative_ratings": 11,
    "price": 0.0,
    "description": "Cosmic Sugar is an elegant, GPU driven simulation space. Vive wands become attractors or repulsors which allow you to craft nebulas. The controls are very simple, but it takes some time to explore all of the possibilities. Thanks to East Forest for the trailer music.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/559010/header.jpg?t=1543969592",
    "minimum_requirements": "OS: Windows 10 Processor: Intel Core i5 4590 or AMD FX 8350 or greater. Memory: 4 GB RAM Graphics: GeForce GTX 970 or AMD Radeon R9 290 or better. Storage: 50 MB available space Sound Card: n/a",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Very fun experience. Makes you feel like you are creating a universe. It could use some polish, for example audio. Considering it is free, it is great fun. Something you would show off to friends while demoing VR.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty boring and ugly. You should go play Project Jump instead.",
            "review_score": "-1"
        },
        {
            "review_text": "Trippy. Put some jams on and enjoy.",
            "review_score": "1"
        },
        {
            "review_text": "Quite beautiful. Can't beat the price! Since you are playing with a system everything is repeatable, The description is on point: if you take a little time to play with it, it can surprise. I hope the techniques show up game envirionments in the future. My thanks to the developer for sharing his creation, keep it up!",
            "review_score": "1"
        },
        {
            "review_text": "Yes very much pls",
            "review_score": "1"
        },
        {
            "review_text": "Cool experience, I suppose its like travelling through the Cosmos and randomly creating universes and exploding them in a second &amp; then watch the after effects.",
            "review_score": "1"
        },
        {
            "review_text": "Cool free title. Its like an interactive big bang simulator.",
            "review_score": "1"
        },
        {
            "review_text": "Wow.... what an experience. I can't beleive this was free. Highly reccomended. I wish there was a way to pause ALL interaction with the enviroment.",
            "review_score": "1"
        }
    ]
}