{
    "app_id": 559450,
    "name": "Demented Pixie",
    "release_date": "2016-12-14",
    "developer": [
        "Molegato"
    ],
    "publisher": [
        "Molegato"
    ],
    "platforms": [
        "windows",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Indie",
        "RPG",
        "Strategy"
    ],
    "tags": [
        "Indie",
        "RPG",
        "Strategy"
    ],
    "achievements": 26,
    "positive_ratings": 7,
    "negative_ratings": 3,
    "price": 3.99,
    "description": "Demented Pixie is a blend between twin-stick shooters and roguelikes with unique visuals and ambientation, packed with content, in which nothing is what it looks like…",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/559450/header.jpg?t=1491737067",
    "minimum_requirements": "OS: Windows 7 Storage: 150 MB available space",
    "recommended_requirements": "OS: Windows 8 Storage: 150 MB available space",
    "reviews": [
        {
            "review_text": " Demented Pixie  is a visually unique rogue-like game in which you take a role of a crazed pixie. Thrown in a deep dungeon for supposedly being crazy, you have to make your way out. It's never that easy, though!  It's not easy, but it's not frustratingly difficult, either.  The learning curve is pretty smooth, as the game introduces more dangerous enemies as you progress. One of the things that really stand out is an element of strategy - unlike many similar games, the enemies, and especially the bosses, in  Demented Pixie  have various attack patterns, so you won't be just blindly spamming your attack (although that works on some enemies too!).  Another feature that requires some thinking is the inventory grid - the pieces of equip are shaped like a simple jigsaw, so you need to fit them together. And with the wide variety of passive abilites, you can really mix and match the equip to fit your playstyle. Nothing too complex though, so don't worry - there's plenty of shooting to be done ;)  One thing that some players might dislike is the amount of visual effects. Your pixie, enemy pixies, all the projectiles, particles falling down for some added atmosphere... it's pretty to look at, but it gets a bit overwhelming at times. Also, accidentally stepping on teleporters can screw you up, as they teleport you into another room instantly which is not always a helpful thing. And trust me, it's easy to accidentally step on one.  All in all, I'm very impressed by the amount of effort that obviously went into this game. Everything works more or less how it should, found only a few minor glitches, nothing big or gamebreaking. Developer is active on the discusion and fast to act in case you'd encounter a bug, which is always a big plus.  Recommended.",
            "review_score": "1"
        }
    ]
}