{
    "app_id": 57620,
    "name": "Patrician IV - Steam Special Edition",
    "release_date": "2010-09-17",
    "developer": [
        "Gaming Minds Studios"
    ],
    "publisher": [
        "Kalypso Media Digital"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Trading",
        "Resource Management"
    ],
    "achievements": 0,
    "positive_ratings": 153,
    "negative_ratings": 129,
    "price": 9.99,
    "description": "You are a merchant in northern Europe in the late Middle Ages when the Hanseatic League was flourishing. Your goal is to rise to the most successful and influential member of the Hanse, ultimately being elected Elderman, leader of the trading league.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/57620/header.jpg?t=1478102145",
    "minimum_requirements": "OS: Windows XP / Vista / 7 Processor: 2 GHz Memory: 1 GB Hard Disk Space: 5 GB Video Card: 256 MB DirectX 9.0c compatible PCIe (Geforce 6 Series/Radeon X1000 Series) Sound: DirectX compatible DirectX®: 9.0c",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "There aren't many games out there, where the point of the game is to traid and to do some capitalistic ♥♥♥♥. One of them is definitely Patrician IV. I've been playing the game for some time now and I think it is time to say something about it.   These games can be boring sometimes, and this or similar kinds of gameplay, are usually part of some bigger game. But the thrill is not in the gameplay, it is in the role that you are playing. In this particular game you take the role of a merchant in medieval times on the Baltic sea. Your goal is to be the biggest merchant of them all. And as far as the story goes that's about it. So, as you can see, there isn't much of a story. But there is a lot of trading to do and you have to industrialize your production of goods and trading roots.    For the gameplay I can say it is simple as far as handling it goes. You don't have any trouble trying to figure out how to do things around there. The mechanics of demand and supply are realistic and you can quickly overproduce or oversupply a market of a city that you came to trade in. So in that way you have to be careful that you always keep them a bit short on supplies.  There is one thing that is in this game and has to be mentioned separately, and that is the naval battles. You can have naval battles with pirates or you competitors, but these battles are not big ones which is little bit disappointing. You can only have fights 3 on 3. Never the less, it is a welcome change in the monotone playing experience.  I am enjoying playing this game, but I think that those who like more action will be bored. That's why I am giving the game 6/10, and I gave it a rating that high just because, I like to play it once in a while when I feel that this capitalistic world is not the best decision that humanity has made.",
            "review_score": "1"
        },
        {
            "review_text": "Economic game. Very involving, well made.   It has an easy, steady pace to it.",
            "review_score": "1"
        },
        {
            "review_text": "Essentially every Anno game ever created...only supplamented with hilariously terrible lip-syncing.",
            "review_score": "1"
        },
        {
            "review_text": "Why don't I see people playing this more? It's ♥♥♥♥ing great!",
            "review_score": "1"
        },
        {
            "review_text": "Patrician 4 doesn't do any favors over Patrician 3. Different engine (once again, 3D doesn't do wonders for such a strategy game), and apparently some features removed. Get Patrician 3 instead.",
            "review_score": "-1"
        },
        {
            "review_text": "Great if you like trading games.  not really for people looking to play a combat heavy game, and not quite as good as patrician 3. 7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Heyyo, I've heard much about the Patrician series so I tried this one out.. it's ok, nothing amazing... kind of a settlement and ship simulator thingy... but It didn't intrigue me a lot.",
            "review_score": "1"
        },
        {
            "review_text": "If you were expecting a worthwhile sequel to Patrician 3, don't bother. The 'campaign' lasts a couple of hours at best and simply ends up throwing you into a free-mode limbo.   If you smashed together the best parts of this game and Port Royale 3, you might have something halfway decent. Both on their own just feel like half-made games and aren't worth your time and money.",
            "review_score": "-1"
        },
        {
            "review_text": "Who hardecodes the mouse keys? Not everyone is right handed. Don't do this.",
            "review_score": "-1"
        },
        {
            "review_text": "It is imposable to tell if your trade is going to make you a profit. you will spend all your money and wonder why your game is over.",
            "review_score": "-1"
        },
        {
            "review_text": "its like a broader version of the guild (less imersion ) but more trading like port royal.",
            "review_score": "1"
        },
        {
            "review_text": "I personaly prefer Port royale as it feels like a game with more content than this one as this pretty much offers trade only but actually has sea combat connected to it.",
            "review_score": "1"
        }
    ]
}