{
    "app_id": 57680,
    "name": "The First Templar - Steam Special Edition",
    "release_date": "2011-05-12",
    "developer": [
        "Haemimont Games"
    ],
    "publisher": [
        "Kalypso Media Digital"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Local Co-op",
        "Steam Achievements"
    ],
    "genres": [
        "Action",
        "Adventure"
    ],
    "tags": [
        "Action",
        "Adventure",
        "Medieval"
    ],
    "achievements": 50,
    "positive_ratings": 473,
    "negative_ratings": 208,
    "price": 6.99,
    "description": "Uncover the mysteries behind the Templar Order! Steam Exclusive Edition includes bonus mission “The Arena”.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/57680/header.jpg?t=1530021417",
    "minimum_requirements": "OS: Windows 7/Vista/XP Processor: 2 GHz Dual Core Memory: 2 GB RAM Graphics: Direct 9.0c compatible graphics card with 256 MB DirectX: Version 9.0c Storage: 5 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "It's a shame that The First Templar doesn't get much credit for it has a quite splendid plot and the fighting mechanisms of two playable characters are solid enough for player to try differnet tactics instead of tapping one mouse button at each strike. There is also some nice, light puzzle solving and sneaking features time to time. Unfortunately I haven't had chance to try co-op with this, but according to what people say it should be even more entertaining. So, is this game something groundbreaking? No.. but I have surely enjoyed playing it !!",
            "review_score": "1"
        },
        {
            "review_text": "Fun co-op game. Got it on sale for 3 dollars. I don't know if I would have paid 20.  Combat is fun once you get the hold of it. Nice longish story for only a 4gb game.",
            "review_score": "1"
        },
        {
            "review_text": "DO NOT BUY THIS GAME! Even $1 is too much. The game wants you to sign up with Facebook to do a friend only game. You can get around this, but even then we constantly disconnect. The idea to use facebook instead of steam was completely idiotic.  The menu is blocky and bulky. The 'bonus' missions are all must do, this game is a rail. The only thing that makes combat hard is that enemy can just leap onto you with attack there is no defense for. The finishing moves are terrible. The abilties are terrible. The story is terrible.  I tried to deal with the online system t oplay with a friend, but it's not worth it.  DO NOT BUY THIS GAME!  ",
            "review_score": "-1"
        },
        {
            "review_text": "This is definitely a cute little game to get if you can get it cheap. (I got it for about .50 USD) It made a pretty decent transition from console to PC and the graphics are still pleasant to the eye. There are a few issues with it, but there are also a few workaround considering how few people currently play. It's definitely a nice casual co-op if you just want to hang out with a friend, or you can solo it just as casually.  PROS: -- Pretty easy controls (keyboard or controller) -- Pretty easy to understand Tips panel and not-in-the-way live time pop ups during gameplay -- Pretty cute humor and plot holes that are a great laugh with a friend -- Decent plot and enviornment transitions -- Co-op is pretty smooth. -- Not too hard, not too easy -- Nice variety between NPC skills  CONS: -- Content issues not worth base price -- Can't make a private match (due to broken facebook link -- make a public and have friend join on you works fine) -- The server HOST has to level up the GUEST player -- Some objectives have small glitches that can bum ya out -- No options to change vertical and horizontal camera axis, making it a large learning curve on keyboard/mouse combo",
            "review_score": "1"
        },
        {
            "review_text": "A decent, fun game with a good amount of historical facts.   My game rating: 74.5 / 100  Graphics: 65 / 100 Whilst character graphics are done fairly well, I feel as if the ground was not given enough details. Graphics could definitely be better, but they still fit in quite well and do not ruin your experience.   Story: 78 / 100 It is true that the story feels slightly unchanging. For most parts of the game you are infiltrating castles or camps, but the story itself does keep you interested and hungry for more. Furthermore, aside of the storyline of the game, it offers you the story of the knight Templars in small portions that you get by discovering stone tablets. I have enjoyed this addition very much as it brings the age of Templars alive and closer to you.  Combat mechanics: 76 / 100 As everything else in the game, combat is developed to that point where you just begin to like it. Trick with the combat module in this game is that there are 3 characters that you may chose to control at any time during the game, and all 3 of them have different skill trees that come with different attacks. As you progress through the game, you may chose to upgrade your attack moves and unlock new ones. Game also offers huge difficulty spikes between the difficulty modes which is great in my opinion. This allows you to chose whether you would like to go through the game without much stress or perhaps chose a more realistic mode. Sometimes you also get awarded with a kill cam. I enjoyed it.  Fun factor: 79 / 100  Is the game worth its price (14eur)? I am not sure, it depends what you are looking for. If you do buy it, do not forget to check out the Arena. Recommendation!",
            "review_score": "1"
        },
        {
            "review_text": "One word ----&gt; Wow.  O bought this game for my last money and i thought it will be boring experience. WRONG! This game catched me for 15 hours and it was a verry good experience.  + 2 ends ( I didn´t expect that)  + funny dialogs + great ARPG + good story about Holy grail  - some chapters are boring ( maybe 2? )  ",
            "review_score": "1"
        },
        {
            "review_text": "Great game that truly shines in coop.  Pros: - storyline is captivating - likeable characters - variety of places that you visit  - light RPG elements - easy to grasp and fun combat - main hero is a badass - combat animations - writing &amp; dialogues - great voiceacting - music is so good  Cons: - map is a mess and it's easy to get lost in a levels - if you want to max it out you will lose hours and hours on looking for hidden things (may be a pro for someone) - occasional difficulty spikes  All in all:  8+/10 - single player experience 9/10 - coop ",
            "review_score": "1"
        },
        {
            "review_text": "Great game and fun with coop..to bad its a little trick in registe but its ok...when its promo dont think twice and now in dlcompae this game whas for 1.29€!!!Have lot missions and outfits to unlock and good combos fight!!!",
            "review_score": "1"
        },
        {
            "review_text": "It´s more entertaining than FarCry3 and Bioshock Infinite. That´s what games are about - entertainment.",
            "review_score": "1"
        },
        {
            "review_text": "The game feels old, like a 2005 PS2 action game. Still, the game is kinda fun. Search for it in a bundle then give it a try.",
            "review_score": "1"
        },
        {
            "review_text": "DO NOT BUY FOR CO-OP.  This game forces you to use facebook for it's friendslist management. On top of no less than 2 other accoutns you must make to play it at all.  In addition to those anoyances/c()ck-blocks for non FB users, the 1920X1080 support was laughable, squeezing the game's movies into a 640X480 box with all the text at the bottom staying persistant so ti laps one over the other making subtitles pointless garbled gibberish.  Wasted mine and my firend's money, dont waste yours.",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this game with the BundleStars reboot 4.0 bundle for 2 bucks. Glad I didnt waste any more money on it. Game requires you to register an account, ok no problem except that the Launcher glitches out and shows the steam overlay behind the text boxes and in front of the buttons that allow you to finish registering. I have tried about 9 times now to get registered, no option to register on the game's website, overall just a lousy ♥♥♥♥ing game launcher.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a good religious game, but not a good action game.  The game can be found in many religious stories and Biblical Literature,so it is a good religious game.  Rigid and stiff movements, and upgrade the system simple,so it is not a good action game.  whatever,I dont hate this game. I enjoyed it.",
            "review_score": "1"
        },
        {
            "review_text": "This Metacritic score makes me VERY sad. A truly underrated action adventure with a load to offer and very interesting and compelling storyline. A rare occurence of consistency in a genre that trades in flash for content frequently. Well worth your time and money.",
            "review_score": "1"
        },
        {
            "review_text": "The voice acting is laughable, not 'so bad it's good' like for example in the Just Cause games or Boiling Point, but simply terrible and out of place. I can't tell if it's a technical problem or the actors are that unprofessional. The animations are awkward and stiff, more so in the cutscenes. The graphics might be okay and in places you can even spot some impressive landscapes of the war, but only if you can get past the low-res textures and numerous glitches. The story seems to be just a means to drive the action and not the other way around as you'd expect. There are some interesting ideas here and there, a few details might get you curious about the outcome, but in the end you'll find it was just a silly plot, too convoluted for its own good and unnecessarily confusing. The characters would be much cooler if they were somehow given a chance to develop properly, unfortunately you won't find much of a distinct personality in any of them, and there are three characters with immense potential and a bit of backstory. Fortunately, the gameplay is a whole lot of fun. Each of the three characters that you can choose to play (when the story lets you) have unique combat skills that you can upgrade, you can use ranged attacks or slash your way with swords and knives, even the stealth missions have their own appeal. Then there's the puzzle solving, which is a great diversion, but the AI shows its awful nature here and it's best to play these sections co-op. While you're at it, play the whole game co-op, because that's where the game shines most. Switch between character with your buddy, earn achievements togheter, and you can even play in split-screen mode. That's awesome. So, if you're bored or waiting for some new triple A title, give this game a try, it's cheap as hell and offers a good value for what is worth.",
            "review_score": "1"
        },
        {
            "review_text": "FOR A DOLLER YOU NAD YOUR FRIEND WILL ENJOY IT",
            "review_score": "1"
        },
        {
            "review_text": "While there are some rough edges, this is a really great adventure game. There are stealth levels, combat levels, and puzzle levels (and occasionally a mix). There are weapons and outfits to collect, but they're just cosmetic so you don't fall behind if you miss one. There are a lot of skills to pick up, with multiple choices at any given time. The story is engaging and there are several twists near the end, but those twists don't come out of nowhere - they make perfect sense in the story. The AI for your companion is pretty decent, although not as effective as a good player.   On the other hand, the checkpoint system is kindof annoying and the plot is very linear (except for one choice you can make at the very end of the game). Overall, the pros outweigh the cons, though.",
            "review_score": "1"
        },
        {
            "review_text": "DO NOT BUY; NOT WORTH $1  Congrats Kalypso for staying in business for 10 Years, but this game didn't even last for 10 years.  Just letting you guys know if you want to invite somebody, YOU NEED TO USE FACEBOOK, DOESN'T EVEN WORK! WHAT THE **** RIGHT?! You need to CREATE A PUBLIC LOBBY and wait until your friend joins.  The game is so clunky with combat and even the skill trees glitch out in coop!  YOU WILL NEED TO MAKE A SEPERATE EXTERNAL ACCOUNT TO PLAY! (KALYPSO ACCOUNT) AND ANOTHER ACCOUNT (INGAME USER). THAT MEANS TWO EXTERNAL ACCOUNT JUST TO PLAY, LOL!  GLITCHY ♥♥♥ WINDOWED MODE SO DON'T BOTHER.   VOICE ACTING... Who were they trying to fool?  In one part of the story, a Bishop tells you to leave the city because it's under attack and then the Bishop disappears! IN THIN AIR! xD  AND ALSO ARABIC NINJAS that have the Scorpion Costume from Mortal Kombat; I'm not even joking!  NO/10  The First Templar and also the Last.",
            "review_score": "-1"
        },
        {
            "review_text": "Clearly an attempt to cash in on better games with the same setting, possibly hoping that someone purchases this by mistake instead of the game they thought they were getting. Not to say this is bad - its the best 'imposterware' title I've played, but just the fact that this game seems to have been made for the express purpose of making aunts or moms buy the wrong computer game for Christmas prevents me from recommending purely on principle.",
            "review_score": "-1"
        },
        {
            "review_text": "I don't know how this game got a 'very positive' rewiew. It runs like hell, and a really bad port. The voice acting is appauling, the animation qualíty is just lackluster. I'm a bit disappointed in calypso. DO NOT BUY THIS GAME!",
            "review_score": "-1"
        },
        {
            "review_text": "Don't buy it, you can compare it with the first Hitman game. Graphics, gameplay it's all old.",
            "review_score": "-1"
        },
        {
            "review_text": "The game doesn't even work. Stay away from it. Waste your money on games that don't instantly crash instead.",
            "review_score": "-1"
        },
        {
            "review_text": "Okay, so where do I get started?  First of all, the graphics! The graphics shouldn’t make or break a game, but it’s definitely in its favour if they look rather good. This game does not look good at all. It’s outdated, looks pretty darn ugly, and to top it off, the animations are rather shocking to say the least. Let me explain: When your character turns from one direction to the other, it should be smooth and look pretty good. What it shouldn’t be doing is snapping from one direction and then to the other instantly. There’s not really any in-between animation and you’re just sort of snapping from one direction to the other, and it just does not look good.  Now, let’s get into the real meat of the game, or what should be the meat of the game, and that’s the gameplay. For a hack and slash game you want some nice, satisfying combat to make you feel like the true badass that you’re playing as, slicing up enemies left, right, and centre. This game does not feel like that at all. The combat feels light and is just kind of boring, it’s nothing too interesting and I’m sure in co-op you’re only going to get the chance to tell your buddy the same thing. The game also takes a crack at stealth, and goes for what most games do with stealth, which is as long as the enemy doesn’t see you; you can sneak up on them and crack their neck. Speaking of cracking necks, this games breaking neck animation is kind of ridiculously fast, and the sound effect they use for it is so short and sudden it just takes away even more from the experience.  The story is rather dull and uninteresting, and left me doing the one thing I rarely do in games and that’s skip the cutscenes, because the way it’s all being told just can’t grab my attention, so I’m not even going to waste my time when it comes to the story.  Lastly would be the audio, and more importantly, the music. The sound effects are okay, nothing special and not particularly good, but they serve their purpose. The music in this game is just another one of those things I don’t take too much notice with. The music hasn’t drawn me in at all, and certainly isn’t something I’d necessarily want to listen to again. Also, on a slight sidenote, there was a moment in the game where I was simply walking in a monastery, and there was literally no sound to speak of. It was utterly silent, no footsteps, and no music, it was just completely silent. A little bit of music would have been nice, but alas, there was nothing.  All in all, this is definitely not a game I recommend. I haven’t enjoyed my time with it, the audio is just okay, the gameplay is plain and nothing special, and the story is just uninteresting. Not a game I would recommend spending your money on. There a many other games that are more enjoyable and more worth your time, and money! ",
            "review_score": "-1"
        },
        {
            "review_text": "Well well well, I'm the First Templar and I don't know why... at least, until the End :)  This game ha received too much negative critics but I'm not confident with critics, so I played It from the beginning to the end, included the special Steam exclusive mission! And it's funny! There are the templars and here they are well represented. The game focuses upon the historical reproduction of the epoc and you will find here a lot of original tables with rules and letters of the past.   This means that you have to forgot magic, skeletons and other stuff, this is a game that wants to recreate the scenario of the ancient and it reaches in my opinion enough well. Graphics is detailed and clear, armor expecially are good, with bump mapping and reflection of the iron. Of course this is a budget game, and a lot of details that you find in colossus like skyrim and Co. are missing. The gameplay is focused on a single working trama that will discover the secret of the Templars, the use of the Inquisition as an army and will let you understand as a first protagonist how man race reaches it's worst during time.  A part this, you will play an amusing action game with 'corridors' level but some secrets here and there, with various scenario that reaches sometimes incredible skyline. I've get fun doing a lot of screenshots and they are really good. You will fight always with a companion that will help you expecially in your morale. You will never feel lost or abandoned because he/she will always be there! strange...  Gameplay is alternate between action, exploring, tracking footsteps, or levels of traps and chests; there is also a stealth mode. Everything I must say, is very simplified, but is a good balance and it'is fun! Moreover you will gain experience to level up both your characters, but you will master the art of combat not so quickly because it's not simple to understand how to engage in the most proficient manner.  The game is long? Yes! it is, I've taken about 16 hours to complete ... just remember to get fun from everything, looking scenario, reading tablets of original manuscripts of the epoc, and so on..  This is a very good budget game, too high for budget and too low for colossus production... a midle budget funny game!  Play it if you want some distraction between a shooter and an Rpg.  Lord Hol Napult's experience: 7/10",
            "review_score": "1"
        },
        {
            "review_text": "THE BEST GAME EVER!",
            "review_score": "1"
        },
        {
            "review_text": "Multiplayer and co-op dont work :/",
            "review_score": "1"
        },
        {
            "review_text": "Not amazing but not horrible a good game to spend some time when you dont have anything else to play.",
            "review_score": "1"
        },
        {
            "review_text": "Very interesting experience. This game really really makes me ambivalent. In my head is only one question: Was it good game or not? +interesting story +good representation of time and historical events (outfits, armors, environment etc..) +good music +great atmosphere (beautiful music and environment)  but  -boring combat system (you need only two buttons to fight) -stupid stealth actions (unrealistic, and in some parts of the game you are forced to use stealth or you cannot pass mission) -sometimes ugly bugs let me complete side missions -i didn't like that big guys looks like a beast in the beginning (i think they don't belong to this story)  My conclusion: This game is good experience for everyone who like stories from history or mysteries about Templar order. For these who goes only for gameplay this game is not so good purchase. But i enjoy it so i recommend.",
            "review_score": "1"
        },
        {
            "review_text": "A bit basic, but a good game. Especially if you can find it in a bundle like I did.",
            "review_score": "1"
        },
        {
            "review_text": "Great little game !",
            "review_score": "1"
        }
    ]
}