{
    "app_id": 57690,
    "name": "Tropico 4",
    "release_date": "2011-09-01",
    "developer": [
        "Haemimont Games"
    ],
    "publisher": [
        "Kalypso Media Digital"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "City Builder",
        "Simulation",
        "Strategy"
    ],
    "achievements": 70,
    "positive_ratings": 8740,
    "negative_ratings": 827,
    "price": 12.49,
    "description": "The world is changing and Tropico is moving with the times - geographical powers rise and fall and the world market is dominated by new players with new demands and offers - and you, as El Presidente, face a whole new set of challenges.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/57690/header.jpg?t=1535973552",
    "minimum_requirements": "OS: Windows XP SP3 (32-bit),  Vista / 7 (32 or 64-bit) Processor: 2 GHz Dual Core CPU Memory: 1 GB RAM Graphics: Shader Model 3.0 (Geforce 6600 or higher, Radeon X1600-Series), 256 MB, DirectX 9.0c DirectX®: 9.0c Hard Drive: 5 GB free hard disk space Sound: DirectX compatible",
    "recommended_requirements": "OS: Windows Vista / 7 (32 or 64-bit) Processor: 2 GHz Quad Core CPU Memory: 2 GB RAM Graphics: Shader Model 3.0 (Geforce 8800 or higher, Radeon HD4000-Series or higher), 512 MB, DirectX 9.0c DirectX®: 9.0c Hard Drive: 5 GB free hard disk space Sound: DirectX compatible",
    "reviews": [
        {
            "review_text": "Random purchase during a steam sale &amp; one of the most enjoyable games I've played in a while. Will appeal to any fan of The Sims/Sims City or even some of the Tycoon games as it has a similar build your own city &amp; run it feel. Good bits of humour &amp; I keep going back to sink more hours into it. Well worth the price.",
            "review_score": "1"
        },
        {
            "review_text": "If you love to deal with issues like finances, unemployement, city growth, hostile factions and a load of other goverment-stuff, this game is for you! Establish and defend your island against various threats.  One of my all time favorites.",
            "review_score": "1"
        },
        {
            "review_text": "You can build a casino and strip club literally 10 feet away from a Church. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Penultimo tells me this is the greatest game in all of Tropico. As Penultimo is my most trustworthy advisor, I believe all the advice he gives me. Thank you Penultimo!",
            "review_score": "1"
        },
        {
            "review_text": "Overall rating: 9/10  By far my favourite city-building sim of all time.  I actually bought this game because I had heard a ♥♥♥♥-tonne of ♥♥♥♥ about how awful the new Simcity was, and I was really craving a Simcity-like game. After playing Tropico, I don't think I could go back to playing Simcity ever again.   Tropico is more or less what Simcity would be if it had a nonsensical, but fantastically humorous storyline. You play as El Presidente, ruler of some island, and the game takes you through a bunch of different and ridiculous scenarios. Describing them would spoil the fun of you finding them out on their own. In the meantime, you have to keep everyone happy - be it the religious group, the nationalists or the environmentalists, which often requires a delicate balance in where you spend your hard-earned dollars.  As for the gameplay, the learning curve is just about where you want it to be. You have a lot of leeway in the earlier missions and the objectives are relatively straightforward, whilst the later objectives can be a little frustrating and even unfair. There was one mission in particular where after playing for hours and completing the initial objectives, I was told that the next objective had to be completed by a certain date - this date had already passed, and I instantly failed the objective. I was... miserable, to say the least.  Unfortunately (or fortunately, depending on who you are), once you get the hang of the game and know what you're doing, things become a little bit too easy. Without trying to spoil anything, I'll just say that some forms of income are much easier to obtain than other forms, which creates somewhat of a conundrum - you WANT to diversify your city because it's more fun that way, but it requires more work for it to be successful.   The graphics are pretty standard for a modern game, although the Caribbean-inspired music was stuck in my head for quite some time.   Overall, I'd most definitely recommend this game for anyone that likes city-building simulation games (be it Sim City, Rollercoaster Tycoon, Theme Park, etc).   ",
            "review_score": "1"
        },
        {
            "review_text": "Another ♥♥♥♥ing game I've brought that forces you to register an account before you can play the damn game. Getting real sick of this ♥♥♥♥ because yet another game I have paid for that I won't play because I have to register an account just to play it single player.  Sad too as I have Tropico 1 to 3 on disk and I really enjoyed playing them so pull your head out your ♥♥♥♥ing ♥♥♥♥ Kalypso and stop being Ubisoft. I shouldn't need to register a damn account to play a Single-player game, I don't want to know that you've released more ♥♥♥♥ing DLC, Your customer support was atrocious when I once tried using it so I don't see how having an account will make a difference at all and I certainly as hell don't want to give my details to you so you can spam my damn inbox with crap you 'Think I would like' so take your privacy policy and shove it.  Quite frankly I'd demand my money back fo this ♥♥♥♥♥♥♥t but I like the game series too much.",
            "review_score": "-1"
        },
        {
            "review_text": "this is probably one of those games where you're like 'eh i might not like it why should i get this'  if you like civ if you like strategy if you like politics if you like anything if you like shrek if you like ike if you like mike if you like spacejam  you will like this game 10/10 would exploit citizens again  ps get in good relations with the middle east, us, and ussr. they give you money all the time trust me.",
            "review_score": "1"
        },
        {
            "review_text": "Light years better than tropico 5.",
            "review_score": "1"
        },
        {
            "review_text": "Got this game for 39 cents. Yup. Worth it.",
            "review_score": "1"
        },
        {
            "review_text": "Have to register an account to play. No big deal, right? Wrong. Try to register, yet it never sends the email for it thus not letting me play. Glad I got it on sale for like, nothing.   0/10",
            "review_score": "-1"
        },
        {
            "review_text": "I tried to establish a communist state; but then I realised that capitalism is human nature and profit is more important than the happiness of my people 8.5/10 a better capitalism simulator than AdVenture Capitalist",
            "review_score": "1"
        },
        {
            "review_text": "Tropico 4 is a fun way to casually waste away tens or even hundreds of hours, at minimum.  It's not a hard game, at least for someone used to the strategy genre - and in fact there is no difficulty setting either. The missions are almost impossible to lose. Instead it just takes more time to win if you're less efficient. If you haven't played the previous installments, there is well plenty enough to explore and keep you busy for quite a while. If you're already familiar with the franchise (I wasn't), then I hear that this installment does not differ very much from Tropico 3 and you might want to treat it, price-wise, more like DLC.  Let me stress that this game is funny. It is riddled with top-notch humour throughout, and the mostly stellar voice acting does justice to the character-specific jokes. I'd even go far enough to call this a good introductory game to the city-building strategy genre: you can easily take your time at every turn, and even if you find the mechanics hard to get around to, the constant jokes should provide a good incentive to stick around.",
            "review_score": "1"
        },
        {
            "review_text": "Just another terrific game in a terrific series of games.",
            "review_score": "1"
        },
        {
            "review_text": "+ Cheeky voice acting and story + Building mechanics are very solid and easy to pick up right away + Natural disasters are annoying, but do break up the monotany a bit + Statistics are easy to follow and allow one to clearly see impact of actions  - Campaign is long and will get repetitive about half-way through - The campaign missions are sometimes inordinately difficult - Steam achievements are bugged (All unlocked achievements unlock all at once next time game is started)",
            "review_score": "1"
        },
        {
            "review_text": "-Enacts 'Gay Marrige' -Religious people get ♥♥♥♥♥♥  -Destroys Cathedral and jails Religous leaders -Enacts 'Free Housing' -Capitalist people get ♥♥♥♥♥♥ -Destroys US embassy and assasinates Capitalist leaders -Enacts 'Praise the US' -Communist people get ♥♥♥♥♥♥ -Runs out of room in Jail, uses Old Fort instead and arrests Commies -Allows more immigrants in  -Nationalist people get ♥♥♥♥♥♥ -Runs out of room in Old Fort, assasinates Nationalists -Destroys military forts for more housing (which is empty because of the amount of people in jail) -Militarist people get ♥♥♥♥♥♥ -Destroys nuclear plant to make another jail to arrest the Militarists -Everyone comes out of jail, with the land being covered in condimoniums -EVERYONE LIVES IN A F#CKING SHACK 12/10 would be caribbean dic(k)tator again",
            "review_score": "1"
        },
        {
            "review_text": "This is the first Tropico game I played and I was coming in without high hopes, but wow this is a good Presidente simulator.  + Challenging missions with different scenarios. + Great Soundtrack. + All the characters have great personalities. + Natural disasters. + Free build with everything customizable. + Easy to learn, difficult to master all the ways to make income and success.  - Repetitive maps in the campaign. - Same buildings used throughout the game.  - When all the game mechanics are understood (after some time), the game is much easier and has little challenge. - Game volume would turn off for no reason randomly on some missions.  I have only finished the main campaign, and I am looking forward to playing the other missions and the Modern Times expansion, as well as the other Tropico games.",
            "review_score": "1"
        },
        {
            "review_text": "Let me play as Fidel Cashflow and create a Cuban cigar trade empire  10/10",
            "review_score": "1"
        },
        {
            "review_text": "A fun and very good city builder, with enough quirks to make it truly stand out. Very easy to pick up and play - this was my first Tropico game, and Im very happy with it.",
            "review_score": "1"
        },
        {
            "review_text": "Very charming humorous game.  Get this and sit down with it in sandbox mode for an entire evening. You´ll have a nice relaqxed time with lots of smiling. Unless rebels. Or desasters. Or elections, those are annoying ;)  I hope the next part gets a more sofisticated infrastructure and public transport system.",
            "review_score": "1"
        },
        {
            "review_text": "A very good city builder but an awlful dictator simulator. As a dictator your would think you have to work more on stability than economy. The truth is in Tropico4, stability is not an issue and your people generally like you.You would not see protest, hard ethical choices. There is no coup, revolution or USA destabilzing your country. Well, maybe there is but I don't think the game represented these elements well. The only thing that is still functioning in this game is economy building, which is fun until at one point you just got ridiculous amount of money and the game got boring. As some has said, this game is too easy to be fun.",
            "review_score": "-1"
        },
        {
            "review_text": "Tornado destroyed my mine trapping my people,China offered to help,their drill broke making harder to get my people free. Choose to blame China for crappy machinary   would do it again",
            "review_score": "1"
        },
        {
            "review_text": "cool game about mexico",
            "review_score": "1"
        },
        {
            "review_text": "Easily one of the best god games out there. The economy structure works very well and without area restrictions. You can literally build your Island city any way you want to. In fact they did so well designing the game that I think that it should be used as a model in schools to give kids a realistic view on how economics work in conjunction with politics, world views and dealing with the various political and social factions. If you like city building sims, this game is definately the one to play.",
            "review_score": "1"
        },
        {
            "review_text": "Tropico 4 is everything Simcity (2013) wishes it was. The solid scenerio design keeps things fun and unpredictable. The well-realized agent and political systems keeps things grounded. The systems are well defined and well explained.  I heartily recommend purchasing the game, even if you have Tropico 3. Tropico 4 is more than a number incriment, the new quest system, and the quick build option change the game consiterably.  As far as the DLC goes, the Modern Times DLC is a must have, the rest, less so, though still worth it on discount.",
            "review_score": "1"
        },
        {
            "review_text": "If you want to: Build a DeathStar Build a Space Elevator Have the USA get mad at you for building them Have the USA send warships to you Be allies with Russia Discover Aliens Build a massive Nuclearbomb shelter, just for yourself Have jets fly through skyscrapers and mountains Have tornado tear through a shabby, wooden shack, and not have a single twig ripped off of it BUT Have a tornado tear through a strong, steel, concrete apartment and have it collapse to rubble Have a tsunami bigger than your island only flip a cargo ship, and spend thousands of $$$ cleaning the oil spill Build Nuclear warheads to scare USA Build a space station Fill in every single gap between your buildings with parks And much, much more Then this is the game for you! 11/10",
            "review_score": "1"
        },
        {
            "review_text": "Do you want to be adored by the people? Promise them the world and deliver it? Have a bare bones educated army only there to repel rebels? Or... Do you want to rule by fear over the people? Tell them to get to the farms and make you money? Just remove the education requirement for the army and make sure they are well cared for. They'll quash any uprisings or rebels. Or... Do you want to go somewhere in between. It's all good in Tropico 4.  When you see reviews of this, you'll see 'bad game it's the same as Tropico 3'. It's a Banana Republic simulator, how different can it actually get? EA Sports games, Battlefield, COD etc all are basically the same game with different maps and this is no different.  It's also not Sim City so don't go in thinking that either. It's not a city, your island will grow to a few hundered people only.  If you haven't played Tropico 3 but are interested in this type of game, it's a 5/5 rated buy now game If you have played Tropico 3 and are interested in this game, it's 4/5 just because there are many similarities from Tropico 3 but that doesn't make it less fun. Just don't pay full price if you got burnt out on Tropico 3.  ",
            "review_score": "1"
        },
        {
            "review_text": "This is such a brilliant strategy game. If you like strategy and a bit of humour in your game then you really need this game in your life. 'My people love me, because I am so beautiful!!'",
            "review_score": "1"
        },
        {
            "review_text": "Highly recommended if you'd like to play a fun and funny city builder that's equally relaxing and challenging. I enjoyed this game immensely, and I will recommend it to anyone looking for a great game.  Downside: the traffic can get a bit out of control.  Upside: so many. - Made me laugh a lot. - The storyline is immersive and makes for interesting situations, just like the randomly generated events and requests that come your way. - Balancing things out in this game is a very enjoyable challenge and I could not name any major problems in this aspect. It's fun and you have to work for it a little, but you get lost in the gameplay easily and it does not feel like a hassle. - The music is great, and even though it's a bit repetitive, you just can't get bored of it. It will get you in a good mood :) - The characters are fantastic. Laughably stereotipical. Love them or hate them, I bet you'll enjoy the dialogues. - The graphics are not jaw-dropping, but some parts of your island can be truly a sight to behold, and it's up to you to build a beautiful city. It's worth it to zoom in on occasion and just enjoy the view. - A very interesting glimpse into the world of politics. You don't have to care about it, I'm just saying, it gave me some food for thought and all I did was have tons of fun.  I do not regret a cent or a second I've spent on completing this game. I'm gonna go achievement hunting now :D Have fun!",
            "review_score": "1"
        },
        {
            "review_text": "Okay, most of you ♥♥♥♥♥♥s are just going to get this game for the cards. You're going to be missing out on finding that one elusive citizen born every 1000 years named 'Juan', whom you want to keep alive and safe by appointing him a very safe desk job and making sure he has access to decent healthcare. This will give you time to raise your secret police to pop a cap in his skull and make his family pay for the bullet, and if they choose not to and decide to take their story to the TV Station then you can just arrest them make and put them to work in the prison farms instead. Why do this? It unlocks an achievement!",
            "review_score": "1"
        },
        {
            "review_text": "It can fills full your holiday, I can say that!!",
            "review_score": "1"
        },
        {
            "review_text": "  God this game is really fun for those either looking for a challenge or just wanting to mess around in sandbox. Controls you can easily get the hang of, and other stuff. But the one thing about this is that, This isn't an average sim city copycat, Its basically something that you have to maintain happiness of your citizens, watch out for natural disasters and trying to get everyone to vote you. And basically means you have to have a healthy clean town, everyone has to be happy and basically there's goals for each thing, but unfortunatly if you do want to play this game you must register an account at their launcher site which is   HERE   [launcher.kalypsomedia.com] ",
            "review_score": "1"
        },
        {
            "review_text": "In my opinion this game is the best in the entire series. You can build a totalitarian (Soviet) state, put everyone in jail and let them work for the state, and then create the perfect paradise for tourists! The best gsme I have ever seen!!!",
            "review_score": "1"
        },
        {
            "review_text": "This game is really fun with very few bugs. The base game plays like an expansion to topico 3; but the modern times add-on is really awesome. I highly recommend the modern times",
            "review_score": "1"
        },
        {
            "review_text": "North Korea - The Game",
            "review_score": "1"
        },
        {
            "review_text": "IT IS AWSOME! GET IT NOW! Build a city with many a different things in it like pubs, apartments, zoo's and drug farms. I would highly recomend you get this game withe all the DLC for a little extra, but it makes it alot more funnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn!",
            "review_score": "1"
        },
        {
            "review_text": "Tropico is a great game, not as a game to make the best island possible becaue keeping everyone happy isn't that hard. The beauty lies in the fact that the game rewards you to be a crazy dictator and still win the scenario. Playing as a religious zealot that keeps the amoral capalist US and the atheistic USSR from your back by running your own nuclear program, manned by your college educated priests with a personal churchbench for every citizen gets you a better score then kissing the behinds of foreign dignitaries while giving out free food for the poor and giving the US cheap oil.  Be an ♥♥♥♥♥♥♥ and be rewarded, that's the way to play and that's awesome.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best economical strategys i have ever played. Have a lot of jokes in it.",
            "review_score": "1"
        },
        {
            "review_text": "   Rig elections    Assassinate/arrest opponents    Misappropriate public money    Build a school between a nuclear powerplant and a chemical factory    Send the army to kill the workers that go on strike    ...   A guide to become a proper nation ruller, not like the democrat ♥♥♥♥♥♥♥. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "There's an easy way to recommend this game: did you like Tropico 3? If yes, you'll dig this, if not, pass. This game's called Tropico 4 but it's nominally an expansion pack to Tropico 3, though a large one at that. Tropico is a nation-building game in the vein of the Anno series, though not nearly as in-depth and with a sense of humor. It features a few new buildings and edicts and some new mechanics, as well as an entirely new campaign. A few of the added structures make things a little easier- like the salt mine, a mine that never runs out, and the chemical plant, a factory that requires no input. The mechanic improvements serve to streamline the gameplay and the added buildings are interesting. The campaign is quite good and about 40 hours long, a decent amount of play can be had. There is of course a sandbox mode if all you wish to build is an island. I very much recommend this game if you enjoy city or nation building games.",
            "review_score": "1"
        },
        {
            "review_text": "Good job. Today August 16th 2014 this game was available for 29p. THE COLLECTORS EDITION. I'm sure it was just a glitch. Im also sorry for buying like a million gift copies still. We forgive you Gabe   99% off SRSLY BRO",
            "review_score": "1"
        },
        {
            "review_text": "I suck at this game. So let's just get that out of the way, I'm TERRIBLE at this game. But I love it, it's a blast. Whether I'm dropping a condo onto a shanty town or I'm hiking the prices of medical care through the roof, life as a dictator is sweet.  There are a ton of missions, each with altering goals but the same game play. You'll have to please your people (Or don't, if you don't want to win and just think it's fun to play that way. No harm no foul) if you want to stay in office long term. It's a great game in a similar style as the city simulations, but with a ton of great humor mixed in. I found myself regularly grinning and laughing at things I'd hear them say on the radio or to my dictator.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic banana republic simulation. My country shares many things with it :-/.  P. S. Modern Times DLC is s.it. Don't buy it!",
            "review_score": "1"
        },
        {
            "review_text": "best city builder game ever ! love the graphics, the music, the gameplay ,this game is rly addictive ;)",
            "review_score": "1"
        },
        {
            "review_text": "The game is well worth the money and you will not regret the time invested in learning all of the nuances and how to create synergy with resources and objectives to maximize productivity and profits.",
            "review_score": "1"
        },
        {
            "review_text": "love it, too much fun to be had here, endless",
            "review_score": "1"
        },
        {
            "review_text": "Decent game, took awhile for me to learn it all, but its all worth it",
            "review_score": "1"
        },
        {
            "review_text": "Found it much more engaging that the SimCity line, fun and easy to play.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game. It's really fun to play. And once you get used to all of the basic controls, it's easy. Although there are some moments where you can get frustrated the overall game is great.",
            "review_score": "1"
        },
        {
            "review_text": "I originally played Tropico. The graphics in 4 are better, obviously, given how old the original Tropico is. Game play so far is not too bad. Still has a few bugs. It is still fun to play and there are more game options, plus the DLC adds to the game. play.",
            "review_score": "1"
        },
        {
            "review_text": "If you like strategy games and city building this is the best for you (if you cant or dont want to buy Tropico5). There is alot to do and a lot to build. You can choose between lots of islands, and you can choose many different ways to rule your island. Its also great that the game has many different DLCs, so you can purchase those and get new outfits, houses and missions. You can also trigger on 'God-Mode' which allows you build a beautifull town without worring about money. I really reccomend if you like strategy games, and you want to have fun for a long time. :)",
            "review_score": "1"
        },
        {
            "review_text": "Tropico lets you be the dictator of your own Tropical Island. As 'el Presidente' of Tropico your will is law. Like in other city-building games you get to choose what to build, what demands shall be met, but also how to deal with unrest. The main differences with a game like Anno are that: 1) Tropico plays a bit more casual when it comes to usage of space, but does let you create roads more freely and 2) you have to deal with your population, 3) you have to deal with the international super-powers to prevent being invaded. Unique in it's setting combined with a unique sense of humour (that extends to their facebook page, example: 'El Presidente takes his hat off for Kim Jong Un! Congrats to such a neatly organized and executed election. At the moment he's thinking about sending over Penultimo for a little worshop'), I can totally recomend this game.   Tropico 4 looks exactly like the third installment and if you buy the game without the expansion 'Modern Times' there is really no difference. The Tropico 4 in a pack is actually quite worth your money if you enjoy city-building games and or government games.   One MAYOR negative point for this game: it comes with terribly annoying DRM. The game is completely singleplayer, there is no multiplayer element whatsoever. You buy the game here on steam, but you still need a seperate account with Kalypso. You need to log-on to Kalypso everytime you boot the game. There is no reason for this. But I'm sticking with the positive review, because I also hope they drop the DRM someday (please email them about it like I did).  When it comes to maturity of this game, when it comes to violence, repression and persecution this game tops them all. The choices you make lead to rebellions. Members of society decide to leave the city and hide in the woods on the island, pick up an AK and fight you. You need an army to quell them, and this gives some action, some firefights in the game (no strategy element) and 'el Presidente' (your customizable ingame avatar, you can even build a golden statue of your avatar!) will also join these fights.  Your will is law. If you do't like religion, dont build any churches and be prepared for angry people demanding a church. You can even 'oust' an entire faction from the island, taking away that faction's voice in sociey (be prepared for rebellions). And if you really hate religion, you can also build labor camps a jails to 're-educate' them or even let the army kill the members of that faction. Same goes for criminals, imprison them, kill them, let them be, your choice. You can just pull out a list, arange it as you see fit and choose your actions on the individuals on that list. And every gamer has a sadistic mind, even if it's hidden away somewhere... and in this game, you can zoom in to streetview level, follow around the individuals whose fate has been chosen and see it take place.  When you first play the game it's quite hard. But once you get the hang of it, it becomes too easy really. It's a great game, but it does have even more potential.  If you had never heard about this game before, like me before Tropico 3, but are interested... try it out. Tropico 5 is coming out in 2014, so there might be a nice sale for part 4 coming!",
            "review_score": "1"
        },
        {
            "review_text": "'It's all work and no play for Presidente.' - El Presidente",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome, it feels like its lacking when you reach mid game to late game in the stages. I find myself doing more waiting then playing.",
            "review_score": "1"
        },
        {
            "review_text": "To be honest this was one of the most enjoyable games i have purchased lately. From beginning to end the quest to subdue the people and generate un ending wealth kept me occupied for days.",
            "review_score": "1"
        },
        {
            "review_text": "With its forced building upgrades and Sim City -esque future building designs, the Modern Times expasion completely ruined Tropico 4 for me. Otherwise it remains a great game with a lovely ambience of banana republic and a great sense of humor. I strongly recommend Tropico 4 vanilla, and advice against any dlc add on.",
            "review_score": "1"
        },
        {
            "review_text": "love this series",
            "review_score": "1"
        },
        {
            "review_text": "Enjoyed the game and only found one con: the game does not have replayability once you beat it. Pro: it will take so long to beat it you still get your money's worth,",
            "review_score": "1"
        },
        {
            "review_text": "Town/city builder + politics + management skills, a little more perfect to city building simulation game.",
            "review_score": "1"
        },
        {
            "review_text": "This is the first Tropico game that I have ever played. I definitely was not disappointed! Playing through the main campaign can get boring about 3/4's of the way through, but once you do the modern times campaign it completely rejuvenates the game and gets you hooked all over again!",
            "review_score": "1"
        },
        {
            "review_text": "Great game if you like simulation games like Sim City. I'm finding myself drawn into each of the scenarios.",
            "review_score": "1"
        },
        {
            "review_text": "great fun, never played anything like it",
            "review_score": "1"
        },
        {
            "review_text": "Launched It. For the first time playing a Tropico game. 5 hours passed and i still don't want to quit it ;D",
            "review_score": "1"
        },
        {
            "review_text": "Very entertaining game. If you are into city/civ builders/sims then you cannot miss out on this one. I am not really into any of those type of games but could not put this one down once I jumped in. The sound, graphics, and design are all very refined. This is one of those games where you wont even realize how long you have been playing because you are having such a good time.",
            "review_score": "1"
        },
        {
            "review_text": "  It's an RTS where you can be an opresssive dictator who abuses his people in one side of your country and have a beautiful tourist atrraction on the other. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "El Presidente came to me in a dream. He was wearing only a white lace robe which did little to hide his bearlike hair. It floated elegantly in the breeze as he came in through my open window. Gently he cupped my head with his powerful hands, and he leaned in towards me. I could smell his breath, cigars and alcohol. He smiled and revealed to me the ultimate truth in life.  'You must build more statues.'",
            "review_score": "1"
        },
        {
            "review_text": "I have not played Tropico 1 or 2, I started with 3 and loved it. Once again Tropico delivers a fantastic city builder / economic management game and for those of you who have played Tropico 3, you will find that in terms of the interface and the graphics, not a great deal has changed. The graphics are slighty prettier (but then they were pretty good in 3 imho) and there are a couple of tweaks to the interface that might take 30 seconds or so to get used to, but thats about it.  What it does bring however, is more depth in terms of gameplay and a more story orientated campaign to play through. There are a number of new buildings which have been introduced with their own functions, but for me the biggest improvement in the gameplay is the way the scenarios work. When campaign missions are initially presented, it isnt like 3 where you have to hit a specific goal or goals persay, more that in order to reach your goals you will have to fulfill and complete a number of in game missions in order to win the scenario. Along side this are a vast number of other missions that will pop up, which if you complete might award you money, faction respect, foreign power respect etc etc; you get the idea. This makes playing through the campaign (and even doing the sandbox island) a lot more fun.  I have only 2 minor complaints; I wish the stats that you are presented in the almanac could be drilled down into more. I love stats and being able to have a little more depth would be great. The second, is that I miss the radio DJ from Tropico 3 :(   On a final note, I would totally reccomend that anyone buying this (especially if you are coming off the back of Tropico 3) would do well to have a look at one or two of the guides available on steam. When I started I found that I was playing as if it was tropico 3 and not really utilising all the buildings and infrastructre very well. Looking at the guides help me understand certain aspects of the game better and also highlight why certain things I tried didnt work etc.  Anyway, I love this game.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "This has to be one of the best games i've played ever- it's not too serious, not too silly, it's VERY in-depth, and you can play this for HOURS without even a hint of boredom. Reccomended.",
            "review_score": "1"
        },
        {
            "review_text": "Very recomneded if you like tongue-in-cheek simulations. An unnamed 'Tycoon' took Sim city to a tropical island and romanced her. From this unlikely union came their love child - Tropico. :)",
            "review_score": "1"
        },
        {
            "review_text": "This is a TRUE City Sim besides The Sims.  Listen to me, it's one heck of a simulator,",
            "review_score": "1"
        },
        {
            "review_text": "Very Addicting and extremely fun",
            "review_score": "1"
        },
        {
            "review_text": "One of my all time favorite City-builder / Government sims. A really solid game with a lot of humor and great music to boot. The Modern Times DLC is a must get as well.",
            "review_score": "1"
        },
        {
            "review_text": "To start off - THIS IS THE BEST CITY BUILDER I HAVE PLAYED.   I purchased this a while back, but didn't play much. After buying SimCity 2013 and playing some of that (and enjoying it for the most part), I decided to return to Tropico 4.  The music in this game is amazing. Having a latin background, the music is really well picked for the game. I love all the options that you have in this game for buildings, laws etc. Gameplay is great, graphics are great, and maps are all very well sized and laid out. Much better than SimCity (map size was really my only complaint in that game).   Anyways, if you like city builders, do yourself a favour and check out Tropico 4, or 3 for that matter. You won't regret it.",
            "review_score": "1"
        },
        {
            "review_text": "Very recomneded if you like tongue-in-cheek simulations. An unnamed 'Tycoon' took Sim city to a tropical island and romanced her. From this unlikely union came their love child - Tropico. :)",
            "review_score": "1"
        },
        {
            "review_text": "This is quite an enjoyable game. Think a mexican styled Sim City. It's surprisingly addictive. Graphics aren't bad, gameplay is good. It's been a long time since I've played a Sim City styled game and I'm glad I picked this one up. I find it quite relaxing in comparison to a lot of other games I usually play. I can sit back, build my city slowly or quickly, whatever I feel is suitable. I'm only upto the 3rd or 4th campaign mission so far, but it seems like a good pick up to me at this point.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty much improved from Tropico 3, a lot of contents is recycled though. If you loved Tropico 3 to death or didn't buy the full Tropico 3 collection then this is a must buy. If you only merely 'liked' Tropico 3 then you might want to wait for a price drop (there should been a discount for Tropico 3 owners ala RO2).",
            "review_score": "1"
        },
        {
            "review_text": "Loved it",
            "review_score": "1"
        },
        {
            "review_text": "One of those games that you will LOVE if you like city building games!  I own Tropico 3 and now Tropico 4 with all the dlc,because I want to support the developers of this awesome game!  Seven hours of play time in one day!  Rating 9.3/10",
            "review_score": "1"
        },
        {
            "review_text": "Fun for everyone, more fun if you speak Spanish.",
            "review_score": "1"
        },
        {
            "review_text": "Best game in the Tropico series, in my opinion. Good latin-themed background music. Enjoyable banana-republic setting. A bit on the easy side, so somewhat more enjoyable for the casual player. A fair amount of replayability with the different leader traits and customizable scenarios. Great game overall!",
            "review_score": "1"
        },
        {
            "review_text": "This game will suck away all your free time.",
            "review_score": "1"
        },
        {
            "review_text": "Kinda like Sim City + The Sims. In a way. But much better.  Graphics are easy on older computers. Soundtrack is insanely catchy and very upbeat. The humor of the game is awesome. Tons of replayability.  10/10, would dictate again.",
            "review_score": "1"
        },
        {
            "review_text": "Overall, everything is great. Awesome simulation of a mayor or 'president'. If you like economy and ♥♥♥♥, go and play this game.",
            "review_score": "1"
        },
        {
            "review_text": "  It is a neat game that's fun to play. If you're into economy and management, then I suggest that you pick up this game! ",
            "review_score": "1"
        },
        {
            "review_text": "Playing this Tropico is alot of fun, its different than the 3rd but non the less very enjoyable. There seems to be less bugs about buildings versus terrain, its good thats resolved. Though the secret to this game seems to be changing the import limit to max and starting a weapon factory with some local power to run the extras to make it more viable. the return on it is phenomial.  In the end its not the latest but all the new stuff and the rearranged stuff are all great in their place! I do find it odd you get your achievements at the start of the next session, oh and having to make a third party account may seem trivial btu im sure its free information they sold to a third party.  Because why else do you need something so pointless to run a game. Its great to play solo but nothing here is for online co op with friends.",
            "review_score": "1"
        },
        {
            "review_text": "Best country/government simulator ever. I love passing the Same Sex Marriage ediet and ♥♥♥♥♥♥♥ off the crazy religious regime :P",
            "review_score": "1"
        },
        {
            "review_text": "one of the best citybuilding game ive ever played.",
            "review_score": "1"
        },
        {
            "review_text": "I don't think I need to get into what makes Tropico unique - there are plenty of places to read about that. Let me just say that this is the best building game I have ever player - despite the fact that it is so much more forgiving than Tropico 1 was. The feel is great, the interface is easy to use, the voice acting is excellent (by far the best in the series and miles ahead of the dreadful Tropico 5), and as with all the games in the series you can win in so many different ways.",
            "review_score": "1"
        },
        {
            "review_text": "Who hasn't wanted to build an empire large enough to crush the rebellion of your adoring citizens?",
            "review_score": "1"
        },
        {
            "review_text": "Now that Fidel is dead I'M THE ONE TRUE COMANDANTE",
            "review_score": "1"
        },
        {
            "review_text": "Bought the 'Steam Special Edition' and after the installation you are FORCED to register the game and you can't play without clicking a link in the activation email. I'm waiting since 3 hours for the email, I tried 3 different accounts now.   - Screw this forced activation - Screw this email system  - Screw the company and anti-piracy system   Go pirate it somewhere, at least you won't have to wait for hours to actually play it, even though you paid for it.  Edit: My activation email just arrived. 25 hours later. That's a new record, innit?",
            "review_score": "-1"
        },
        {
            "review_text": "Very good simcity like game with a very cool and funny setting/premise",
            "review_score": "1"
        },
        {
            "review_text": "If you at my achievements, you can see that: 1. I unlocked a huge chunk of achievements in a single day 2. I have achievement for Modern Times, even though I haven't bough it (at the time of this writing)  Well, that's because I used to pirates this game. AND I LOVE EVERY BIT OF IT. I LOVE IT SO MUCH I FEELS GUILTY AND MAKES ME BUY IT. I'm planning to buy all the DLCs and Modern Times in the next sale to finally redeems my sins.   Now I'm going to sit on that corner and look thoughtful.",
            "review_score": "1"
        },
        {
            "review_text": "I played the original many years ago and skipped the others jumping directly into this version after getting all of the Tropico collection as a bundle (minus 5). I would have to say its brill, well worth the small amount of pennies I spent on it. El Presidento would be proud of the settlements I've build the rebel fighters I've killed all the time playing the East versus West game of your “both my friends honest”! But if you want some satirical humour in your city building style strategy sessions then this is well worth the investment of time and cash, thumbs up!",
            "review_score": "1"
        },
        {
            "review_text": "Hey, Senorita! Senorita Carlita, you want to go with me to Mexico. Ah come on ... I'm Carlito!  Me me me wanna you wanna everybody wanna wanna Go Go Go! (x2)   Who's that boy, want to be amigo? (Carlito! Carlito!) Who's the boy I'll never let go? (Calacar-lito! Calacar-lito!)  Who's the boy? Come and dance, amigo! (Carlito Carlito, Cala-carlito!) Who's that boy? Take a chance on me now - we want you so.   Every night I'm walking walking very far I'm very tired. Have no rest and no siesta - manana. I come to you in my sombrero im a tex-mex hero.  Senorita say caramba now it's fiesta time. Senorita say caramba now it's fiesta time. Hey! Lets mi run away! Across Rio Grande with you hand in hand. The night is so dark so bright are the stars, there's got to be magic - come say who you areeee areee...  Me me me wanna you wanna everybody wanna wanna Go Go Go  Who's that boy, want to be amigo? (Carlito! Carlito!) Who's the boy I'll never let go? (Calacar-lito! Calacar-lito!)  Who's the boy? Come and dance, amigo! (Carlito Carlito, Cala-carlito!) Who's that boy? Take a chance on me now - we want you so.   I can sing and I can dance I'm very nice and hot and spicy. I have the looks and I can cook a taco. (Carumba) Very famous gringo help mi blingo on my guitarra. Senorita say caramba, now it's fiesta time.  Hey! Lets mi run away! Across Rio Grande with you hand in hand. The night is so dark so bright are the stars, there's got to be magic - come say who you areeee areee...  Me me me wanna you wanna everybody wanna wanna Go Go Go  Who's that boy, want to be amigo? (Carlito! Carlito!) Who's the boy I'll never let go? (Calacar-lito! Calacar-lito!)  Who's the boy? Come and dance, amigo! (Carlito Carlito, Cala-carlito!) Who's that boy? Take a chance on me now - we want you so.   Everybody got to have a Carlita Fiesta  Me me me wanna you wanna everybody wanna wanna Go Go Go  Who's that boy, want to be amigo? (Carlito! Carlito!) Who's the boy I'll never let go? (Calacar-lito! Calacar-lito!)  Who's the boy? Come and dance, amigo! (Carlito Carlito, Cala-carlito!) Who's that boy? Take a chance on me now - we want you so.  (Me me me wanna you wanna everybody wanna wanna Go Go Go)  Who's that boy, want to be amigo? (Carlito! Carlito!) Who's the boy I'll never let go? (Calacar-lito! Calacar-lito!)  Who's the boy? Come and dance, amigo! (Carlito Carlito, Cala-carlito!) Who's that boy? Take a chance on me now - we want you so.   Hey senorita where you going? You wanna be my Carlita?",
            "review_score": "1"
        },
        {
            "review_text": "I am not sure how to rate this game. I found most of the game to be entertaining. It had intresting starting maps and buildings you could construct. After a few hours though, it became a very boring game. There is just not that much to do.",
            "review_score": "-1"
        },
        {
            "review_text": "Not possible to get past the launcher, due to their email activation not working, may edit this review once i am actually able to play the game.",
            "review_score": "-1"
        },
        {
            "review_text": "When I became president, housing for my people was free, healthcare was universal regardless of income, food was free, jobs were plenty and relationships with foreign powers were at an all time high.   I did my best to ensure the security of the people, and will continue to do so.",
            "review_score": "1"
        },
        {
            "review_text": "Get it on sale. Not a bad time killer.",
            "review_score": "1"
        },
        {
            "review_text": "man was compaling abaout taxes so i killed his friends and family,then i sent him prison to teach him a lesson.",
            "review_score": "1"
        },
        {
            "review_text": "You can arrest 20 yr old pregnant women in this game and sentence them to life in a work camp so they have their baby but as soon as it comes out they take it and she never gets to see it again haha. Get this game i rate it 6.18/9.11",
            "review_score": "1"
        },
        {
            "review_text": "Yes, it's much better than the 3rd!",
            "review_score": "1"
        },
        {
            "review_text": "Game requires a separate account before it will run. Currently the servers seem to be completely overloaded and not sending out the mandatory confirmation e-mail for that account. Completely unable to play the game (been waiting for 12 hours now). Ridiculous for a single player game.  Edit: Day and a half later, finally the email arrives. Still absolutely ridiculous to require this for an offline game.",
            "review_score": "-1"
        },
        {
            "review_text": "Great Game!! Recommended!",
            "review_score": "1"
        },
        {
            "review_text": "' In politics stupidity is not a handicap -Napoleon Bonaparte ' ",
            "review_score": "1"
        },
        {
            "review_text": "my people haven't ate a food for a week, they're going to die?",
            "review_score": "1"
        },
        {
            "review_text": "Ok I got the full pack with all the DLC'S and this game is great, I mainly play it when I want to take a break from FPS and action games, just something to calm me down. Music 10/10 and there are millions of challanges, I have never tried any other games from this series but this one has made me think its one worth getting and if you hate tycoons (like me) theres much more to it than that and I would recomend it. As I got this in a trade I am so happy about this game, so dont read any other reveiws because my review is all you need to know-BUY THE GAME NOW better with DLCS",
            "review_score": "1"
        },
        {
            "review_text": "How to hate communism. 2 ways 1. Read History 2. Play this game and build a communist economy. Have fun living in shacks ( ͡° ͜ʖ ͡°) MVIIIs",
            "review_score": "1"
        },
        {
            "review_text": "Solid game, easy to run and a great time killer.",
            "review_score": "1"
        },
        {
            "review_text": "I've just started playing Tropico 4, and thought today, 'Hmmm, Castro can't be far off 90 now'. Lo-and-behold, Sky News have today announced he's turning 90.  Oh, and it's a great game.  Viva Castro!",
            "review_score": "1"
        },
        {
            "review_text": "  Basically Sim City with an island skin. Nothing special. The characters are somewhat funny. I got it on Humble Bundle for free. I'll probably play my heart out and then forget about this game.",
            "review_score": "1"
        },
        {
            "review_text": "Every POTUS should have to play through a campaign of Tropico before entering office. 5/5",
            "review_score": "1"
        },
        {
            "review_text": "Nice game ...... Can Friend with soviet ....... can become Communist .... 10/10 Putin (Would nuke America Again) :D",
            "review_score": "1"
        },
        {
            "review_text": "I have not played any earlier or later game in this series so I can not compare this one to them. The game is charming and fun for a little while but the game play gets monotonous rather soon, aspecially in the campaign mood. The constant bossanova music drives me crazy after an hour or so, but I guess that is a matter of taste. The satire is funny now and then, but of a rather expected kind, no real suprises there.   Overall a nice game, but nothing that really nails it for me, and yet worldbuilder games are my cup of tea. If you feel the price is right for you can get it and have a little fun with it, but there are others worldbuilder games that offer more replayability.",
            "review_score": "1"
        },
        {
            "review_text": "Oh you want my email to play a singleplayer game? How about 'no'?  Yes I'm aware it's trivial to bypass. Don't care.",
            "review_score": "-1"
        },
        {
            "review_text": "Best 4X I've played since Brave New World.",
            "review_score": "1"
        },
        {
            "review_text": "The russian agent is a qt.  Also, less importantly, the gameplay is good.",
            "review_score": "1"
        },
        {
            "review_text": "IDk my menu things kkep flashing in game and all and it idk how to fix it so far this wasted my money and i really want to play if any1 can help please tell me ",
            "review_score": "1"
        },
        {
            "review_text": "15 euros game for free ??? OK",
            "review_score": "1"
        },
        {
            "review_text": "great game",
            "review_score": "1"
        },
        {
            "review_text": "I played this game for hours figuring it out without the help of the tutorial because I'M A MAN not really i just didn't bother with it .my dad also plays this game all the time, he's played over 1000 Hours on it i honestly don't know how he hasn't gotten bored with it yet. I would give this game a 76/100",
            "review_score": "1"
        },
        {
            "review_text": "You need this game. I need to play this game. Brb.",
            "review_score": "1"
        },
        {
            "review_text": "I'm new to the Tropico games, and this one was a good buy for around 7$ for all DLC. It was totally worth the money. I can see myself putting in alot of hours playing this game 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "This game is the best city building simulator - it may seem cartoonish at first, but the mechanics are anything but.   Immerse yourself fully in it as you bring a poor and undeveloped but resource rich(or poor) country to become and economic powerhouse while balancing the needs of the many against the needs of the few, and of course, the foreign powers.  Or - you could just go full hitler and shoot anyone who does'nt like you. It's all up to you!",
            "review_score": "1"
        },
        {
            "review_text": "My graphics card couldn't handle Tropico 5 so I opted for 4. So far, I'm pretty much addicted. Loving this game.",
            "review_score": "1"
        },
        {
            "review_text": "  One of the most entertaining city builders i have ever played.   Received it for free in the Humble Bundle promo but would totally buy it.  Now let's see if we can have 'Accidents' for all members of a faction.",
            "review_score": "1"
        },
        {
            "review_text": "  It's possible to be an honest man with honest elections and honest political speeches.  That's boring. Don't do that.",
            "review_score": "1"
        },
        {
            "review_text": "Never playing Tropico before, but this one is different city-building game...",
            "review_score": "1"
        },
        {
            "review_text": "An excellent game for those that like managing an island. As dictator of the island, you control what gets built an where, and it's up to you to make a successful island nation. The campaign provides a nice series of tasks, taking you from island to island to complete objectives.",
            "review_score": "1"
        },
        {
            "review_text": "Have played each game in the Tropico series and would have to give this game a 9.2/10. Excellent small city building game based in the Caribbean, where you are a dictator and manage everything from your citizens everyday lives to a thriving industry based under both tourism with basic resource gathering and factory production to really roll out the profit. There is also considerble detail put into the game's detail and mechanics. The only real drawbacks I've found are your citizens are quite lazy so one must carefully plan out there city, less they begin running into traffic problems or workers not arriving at their jobs quickly enough. The 'Modern Times' dlc addresses such an issue with subway systems, which as another note, the dlc truly enchances this game to an amazing and well balanced gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun to learn, by all means! It's an attractive, well-themed, humorously tongue-in-cheek city sim. The radio personalities, the music, and the graphics all contribute to an entertaining experience that will keep you riveted for easily ten maps.  However, once you've got the basics down - about 15 missions into the campaign, if you've bothered - there's really no reward for you to keep playing. Every island follows the exact same pattern, every playthrough is identical. The campaign missions themselves are really pathetic, with a lame plot for each mission stretched over way too many pointless and time-wasting checkpoints. The auto-generated faction and foreign power tasks are predictable and lame as well, and utterly ignorable most of the time.  The biggest challenge in the game comes from street planning - no joke. By the time your economy has matured, the layout of roads on your island is the only thing that can shut you down. If you have too many intersections, say goodbye to ever turning an export profit ever again. No one seems to be sure if these traffic management problems were entirely intentional, or an idea that snowballed into a monstrosity. I'm told the Modern Times expansion's 'Metro' building helps with this, but truly, why bother?  Tropico 4 offers no reward for mastery or sustained interest, but can offer about 20 hours worth of good clean fun. It's worth picking up on sale if nowhere else, but I'd steer clear of the DLC; save yourself a few bucks.",
            "review_score": "1"
        },
        {
            "review_text": "The Best Game for Genre City Builder/Simulation Mayor,Tycoon City",
            "review_score": "1"
        },
        {
            "review_text": "In my opinion, this is the best game in the series. While the models of the buildings closely resemble the ones from Tropico 3, the game experience is better.  The game has a campaign that teaches players the basics while presenting them with challenges. The storyline is full of funny moments and dialogs, and allows you to be the presidente you want to be even while trying to accomplish the challanges.  Sandbox mode finishes off an overall good gaming experience with do-what-you-wish fun.   All in all Tropico 4 offers dozens and dozens of hours of fun. 8/10.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing Strategy City Building Game!",
            "review_score": "1"
        },
        {
            "review_text": "Totally worth playing its fun",
            "review_score": "1"
        },
        {
            "review_text": "Very nice game, can be quite an experience to times",
            "review_score": "1"
        },
        {
            "review_text": "A very fun game",
            "review_score": "1"
        },
        {
            "review_text": "i believe i purchased this and i didnt even get the copy????",
            "review_score": "-1"
        },
        {
            "review_text": "hard game to understand. will hopefully get the hang of it soon",
            "review_score": "-1"
        },
        {
            "review_text": "A very fun game",
            "review_score": "1"
        },
        {
            "review_text": "this is the best dictator game ever :D",
            "review_score": "1"
        },
        {
            "review_text": "Have played each game in the Tropico series and would have to give this game a 9.2/10. Excellent small city building game based in the Caribbean, where you are a dictator and manage everything from your citizens everyday lives to a thriving industry based under both tourism with basic resource gathering and factory production to really roll out the profit. There is also considerble detail put into the game's detail and mechanics. The only real drawbacks I've found are your citizens are quite lazy so one must carefully plan out there city, less they begin running into traffic problems or workers not arriving at their jobs quickly enough. The 'Modern Times' dlc addresses such an issue with subway systems, which as another note, the dlc truly enchances this game to an amazing and well balanced gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "Bought this game for 40 cents some number of years ago. Worth every penny for my 40 minutes of gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "1 Started with a shack 2 Did everything you do in minecraft 3 Built Secret HeadQuater 4 Killed An old Lady 20/10 would kill old lady again",
            "review_score": "1"
        },
        {
            "review_text": "  One of the most entertaining city builders i have ever played.   Received it for free in the Humble Bundle promo but would totally buy it.  Now let's see if we can have 'Accidents' for all members of a faction.",
            "review_score": "1"
        },
        {
            "review_text": "If this game was a spoon  It would be a good spoon",
            "review_score": "1"
        },
        {
            "review_text": "It's ok.",
            "review_score": "1"
        },
        {
            "review_text": "If you like Tropico 3, you will probably like Tropico 4 too, simply because it is essentially the same game with same things added. If you don't know T3, get it first. Besides little innovation compared to T3, there are two more things that are not that great in T4. First, the main campaign has only a couple of islands that are being reused in later missions. It wouldn't be so bad if it weren't for the second problem, the repetitive gameplay. Once you get the game, every mission feels a bit samey. This is improved with the DLC, but most missions can be solved in a similar way with a little bit of consideration of the random or not so random events.  Recommend if you like Tropico 3.",
            "review_score": "1"
        },
        {
            "review_text": "Very lame, non-expansive sim. Over-emphasis on the dumb characters and advisors just makes you cringe the whole time. By whole time, I mean the 20 minutes before you get bored with the begginer mechanics.",
            "review_score": "-1"
        },
        {
            "review_text": "Tropico 4 &gt; Tropico 5 tbh",
            "review_score": "1"
        },
        {
            "review_text": "Hours of playability without any boredom. One of my favorite go-to games.",
            "review_score": "1"
        },
        {
            "review_text": "Spent time on tropico became dictator invaded by US 10/10 would be invaded again",
            "review_score": "1"
        },
        {
            "review_text": "best game of all time 11/10 recommended by the Presidente him(her)self  plantations op  screw all those poor people building shacks all over my island",
            "review_score": "1"
        },
        {
            "review_text": "Very entertaining building simulation game!",
            "review_score": "1"
        },
        {
            "review_text": "Game is great, but requires you to register and login to additional services. You have to mess around with firewalls or system files to play without it. I'm not signing up for another service on top of steam just for one game.",
            "review_score": "-1"
        },
        {
            "review_text": "Love this game, better than sims imo",
            "review_score": "1"
        },
        {
            "review_text": "So, you need to register to play this game. Come on, this is Steam, don't force custom launchers and logins on customers... Thumbs down. (You can firewall the login launcher or turn off your internet, as a work around.)  Good + WIP  Bad - WIP",
            "review_score": "-1"
        },
        {
            "review_text": "You can be a Communist.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "A fun time killer. Think of SIMS but as a dictator controlling and building an island empire. The opposite of Just Cause. The game works fine and runs smooth. Grab on a sale. Great time killer and addition to any collection. I have been gaming for about 20 years +. This game would make my top 100. 7/10 (no game is perfect).",
            "review_score": "1"
        },
        {
            "review_text": "gets boring really fast. faced a bad bug that prevented me from building the fisherman house",
            "review_score": "-1"
        },
        {
            "review_text": "  Demolished every building and road. Eliminated everyone until I was the only person alive.",
            "review_score": "1"
        },
        {
            "review_text": "Great game for those who like ruling with love or an Iron Fist. Who like creating societies of their own devising and deciding the fate of all around you. In this game you are like god. Decide who lives , Go to war , ♥♥♥♥ around with natural disasters. In tropico 4 you can be either a powerful dictator or can choose to build a democracy keeping all citizens happy. I recommend this game to those who like the rewarding feeling when you see your city fully functioning. The complex city management might drive away some gamers but this is the sort of game for me. ",
            "review_score": "1"
        },
        {
            "review_text": "this game gave me brain damage, i really just want to kill myself right now, im gonna put ♥♥♥♥♥ in a toaster and jump in the pool, but other than that 'hey that's pretty gud' I recommend buying it so you can get into a civil war with rebels, and begin killing them, trust me this game gave all my soldiers PTSD, now ♥♥♥♥ off and buy it",
            "review_score": "1"
        },
        {
            "review_text": "its really easy to make people happy..... really no challenge.... id say get tropico 5",
            "review_score": "-1"
        },
        {
            "review_text": "My Island was taken over by rebels 10/10",
            "review_score": "1"
        },
        {
            "review_text": "game casuses you to register after you purchased on steam",
            "review_score": "-1"
        },
        {
            "review_text": "fun, but not worth more than the .38 cents i paid for it",
            "review_score": "1"
        },
        {
            "review_text": "I tried.. I really did.. but all this game made to me is almost bore me to death.",
            "review_score": "-1"
        },
        {
            "review_text": "GIVE US JUANITO BACK!!! I FUXKING MISS HIM AND HIS SARCASTIC TUNE!!",
            "review_score": "-1"
        },
        {
            "review_text": "Can't start it, but specs of laptop are perf (Mac). Lovin it. Just great.",
            "review_score": "-1"
        },
        {
            "review_text": "im always a big fan of 'City builders' games. you are on an island making cities, buildings and other things. You do have to listen to the people sometimes and ask what they want or need. otherwise you might lose it. like in sim city. there are also dangerous stuff, like 'tornadoes, flood, volcano' and so go on. There are some challenges or mini quests that you may do to get some respect and earn extra money.  but is an okay game, im not fan of these developers company, i do like the games, i just dont like them. They ruin it for me what they have done with tropico 5.  but ill give this a 7/10",
            "review_score": "1"
        },
        {
            "review_text": "  Alternate version for simcity",
            "review_score": "1"
        },
        {
            "review_text": "No, I don't want a Kalypso account.",
            "review_score": "-1"
        },
        {
            "review_text": "you have to have internet and join thier stupid ♥♥♥ cult to play this game.",
            "review_score": "-1"
        },
        {
            "review_text": "WHY THE ♥♥♥-♥♥♥♥♥♥♥♥, GOD DAMN ♥♥♥♥ DO I HAVE TO REGISTER SOME ♥♥♥♥♥♥♥T ONLINE ACCOUNT TO PLAY A SINGLE-PLAYER GAME!? I DON'T WANT TO ♥♥♥♥ING ENTER A MOTHER♥♥♥♥ING PASSWORD EVERY SINGLE ♥♥♥♥ING TIME I WANT TO SEE LITTLE PEOPLE MILL AROUND AND WATCH NUMBERS ON GRAPHS GO UP AND DOWN!  ♥♥♥♥ THIS GAME",
            "review_score": "-1"
        },
        {
            "review_text": "Great game. Much better than Tropico 5 unfortunately.",
            "review_score": "1"
        },
        {
            "review_text": "3RD PARTY DRM (on Windows but not on MacOS)",
            "review_score": "-1"
        },
        {
            "review_text": "whoever made this ♥♥♥♥♥♥♥ game should kill themself jesus christ",
            "review_score": "-1"
        },
        {
            "review_text": "its the same as tropico 3 with 2 new buildings, fun for a single playthrough if you have not already played tropico 3, if you have it is pretty boring.",
            "review_score": "-1"
        },
        {
            "review_text": "SUCKS! Keeps Crashing on my Mac computer every 5 minutes into the game. Such a dissapointment",
            "review_score": "-1"
        },
        {
            "review_text": "I am not sure how they messed this up, some place between poor texture quality anoying island radio, and being boring. Magically tellaporting goods and people to and from docks is also pretty annoying. Some how having most of the difficulty sliders to easy and population to low hard makes the difficulty at 90%+ which is still pretty darn easy for the record. maybe I will try and find a mod that makes it more like the orginial, maybe its not worth my time. Finally the added layer of DRM is BS it says its to update the game and get deals, with how badly you screwed this up I am not intrested in your 'deals' and the updates you mean that steam provides for you? get over your self.",
            "review_score": "-1"
        },
        {
            "review_text": "Castro is back and he's hornier than ever. Play as tiny island nation Tropico 4 and make it too THE TOP. However be warned because war is a danger.",
            "review_score": "-1"
        },
        {
            "review_text": "benjagamer 584 weeks ago bride of chucky la novia de chucky﻿ Reply 3   (subscribe to my utube channel braxterverse ) :)))",
            "review_score": "-1"
        },
        {
            "review_text": "Perfect game for when boredom strikes",
            "review_score": "1"
        },
        {
            "review_text": "I've loved Tropico ever since the 1st one. This series has always had a great sense of humor that keeps you playing long after you're finished with the campaign. Watching the people go about their lives, and watching them not carrying your goods to the docks, well it keeps it interesing. In 4 they really spruced things up with events and DLC that make themselves very worth the purchace.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a Fidel Castro simulator.  10/10 would dictate again  ",
            "review_score": "1"
        },
        {
            "review_text": "  For people that didn't think they'd like city builders. More approachable than Sim City and certainly funnier. Get it while on sale and it's definitely worth it.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best city managing games i have ever played. I didnt play it for much long but enjoyed it for the time i played it.",
            "review_score": "1"
        },
        {
            "review_text": "Very similar to the previous Tropico games but really updated the graphics and the mechanics. There is a nice load of scenarios to play through and actually a plot of sorts to follow.  For the most part, I have to say that with each Tropico game (apart from 2) they are just updating the one before it with better graphics etc. Have not really bought something truly new to the table in a while but still a really enjoyable game.",
            "review_score": "1"
        },
        {
            "review_text": "WARNING: This game requires you to sign up for a Kalypso account in order to play it and puts a bunch of ♥♥♥♥♥♥♥t in your way so you can't just start playing the game without logging in to their DRM.",
            "review_score": "1"
        },
        {
            "review_text": "This is a wonderful game, fun and casual. It's biggest disadvantage is play-time. Once you are done with the campaign (ok it's not that short but still) there's literally no point in playing again.",
            "review_score": "1"
        },
        {
            "review_text": "relaxing.",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game after Sim City's disaster of a launch as I wanted a city building game. This game is very fun to play and you can easily waste a whole day building a tropical paradise, I wouldn't pay more than £5 for this game though.",
            "review_score": "1"
        },
        {
            "review_text": "Takes a couple of hours to really get into the swing, but a very fun game!",
            "review_score": "1"
        },
        {
            "review_text": "City-building sim with social and political considerations, wrapped in irreverent tongue-in-cheek humor. Surprisingly detailed and lots of fun despite being a bit too easy once you learn the ropes. Grab it on a sale.",
            "review_score": "1"
        },
        {
            "review_text": "can not register new accouny.conyinue button does not doanything.",
            "review_score": "-1"
        },
        {
            "review_text": "i keep coming back to the island for another go at it. its another game i continue to play from time to time. love this game. i dont care for much of the new games, this is a great builder game.",
            "review_score": "1"
        },
        {
            "review_text": "Quirky fun game. Good engine, and addictive to play.",
            "review_score": "1"
        },
        {
            "review_text": "My first tropico game! I thought it was a good game! still playing it as we speak! recommend for sure",
            "review_score": "1"
        },
        {
            "review_text": "A simple, yet challenging game. A strategy game the redefines its catagory. This game is about you, being El Presidente, a dictator that rules the tropico islands. How you play and run your country, is all up to you. You even have to consider political positions and trading with foreign countries. The whole game have express very detail parts of a countries in a humorous ways. You'll be laughing and thinking hard all along, fun and challenging. The best thing is, it even serves an education purpose.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game Love It!",
            "review_score": "1"
        },
        {
            "review_text": "If you played Tropico 3 this game will look very familar to you. It is more of a Tropico 3.1 then a Tropico 4. The graphics, game play, voice acting and UI are identical to Tropico 3. There are a few more advance buildings in Tropico 4 and new missions, but other then that not much difference between the two titles.   If you were a big fan of Tropico 3 or if you never played the series before this is a good title for you. Yet, if you already have Tropico 3 and just like to play sandbox games you might want to pass on this title.",
            "review_score": "1"
        },
        {
            "review_text": "I hope this game can/able to invade other countries",
            "review_score": "1"
        },
        {
            "review_text": "Haven't played much of Tropicio 4 but is already worth the money invested. Once I get through this game will be buying Tropicio 5 next.",
            "review_score": "1"
        },
        {
            "review_text": "Fun city builder.. the theme allows it more lattitude in what you can do .. how many city builders let you eliminate unhappy citizens with secret police??",
            "review_score": "1"
        },
        {
            "review_text": "An easy way to spend hours. THe campaigns are nicely done though it is easy to follow the tourist path to get lots of money. THe Modern times segment adds some newer technologies but the game really does not change.",
            "review_score": "1"
        },
        {
            "review_text": "Lovely, awesome game :)",
            "review_score": "1"
        },
        {
            "review_text": "Fun addictive.. Easy to play for hours and loose track of time.",
            "review_score": "1"
        },
        {
            "review_text": "Tropico 3 with a little more.",
            "review_score": "1"
        },
        {
            "review_text": "Never play this game if you have other plans. You blink and 9 hours went by.",
            "review_score": "1"
        },
        {
            "review_text": "Great political strategy. Endearing characters. Good story. Music WILL get on your nerves. Ended up turning music off, playing my own music through speakers, and just having sound effects through laptop speakers.",
            "review_score": "1"
        },
        {
            "review_text": "educate children to become obedient then pay them $1 an hour to slave away in my tobacco farms.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Do it in name of The People or Yourself... You have the Power!",
            "review_score": "1"
        },
        {
            "review_text": "For those who love the god-game genre I would recommend this game. You can micro-manage to quite a high degree but within certain limits. I found it hard to get my population to move exactly along the lines that I had set out, especially regarding where they take up residence or where they would work, but then I have this tendency to be a benevolent ruler in games like this. The game does allow you to take quite a laid back approach to running things so even for the casual god-gamer this is certainly playable and sure to provide a time-sink that will last many an hour.",
            "review_score": "1"
        },
        {
            "review_text": "So much time spent playing this game it's ridiculous. Love it. My first perfect game on Steam achievement wise too! Viva El Presidente!",
            "review_score": "1"
        },
        {
            "review_text": "As far as I can tell, this is the last Tropico installment, at least for now. Collectively, the “new” Tropico has been a great series and has born again a classic game and genre. However that is as a whole. Individually, these games feel incomplete. That is especially true when the DLCs are not included. I’ll just say that as for Tropico 3, the Absolute Power DLC is a must. And the Modern Times DLC is the same in regards to Tropico 4. Yet Tropico 4 amazingly improved on Tropico 3. Despite the fact that the core is unchanged, the small and subtle changes are more of refinements. I honestly feel like these two games are actually very different, despite the vast rehashing of graphics and copied game play core. Tropico 3 was about island nation development, and Tropico 4 is about Presidente’s development. And yes, that is drastically different. If you’ve played Tropico 3 and liked it, I see no need to get this title. If you played Tropico 3 and loved it, then grab this game too. If you haven’t played either, grab only Tropico 4 and ALL the DLCs (especially while on sale). 85%",
            "review_score": "1"
        },
        {
            "review_text": "I like strategies, but this is definitely one of my favorites. This is a definite purchase and I would recommend it to my friends who like a good strategy",
            "review_score": "1"
        },
        {
            "review_text": "Tricky at first but a fun game to wrestle with. So many different factors, is a game for experienced players",
            "review_score": "1"
        },
        {
            "review_text": "excelent game, much better tutorial than previous games, great graphics and alot to do. keeps you amused for hours with great music and funny quotes. very polished and well thought out, if you like city builder or mangement games definetly buy this one.",
            "review_score": "1"
        },
        {
            "review_text": "A Utopia simulator where you can enforce your political agenda on your populace with an Iron- wait, why did Polygon dislike this series again?",
            "review_score": "1"
        },
        {
            "review_text": "Amazing Game. Super addicting.   I started from Tropico 2 and this is the second in the series that I've played. The add ons make the game a lot more fun. I also could not get enough of the modern times expansion. I've lost entire days to this game. The voice acting is very well done. What could have been a very monotonous and repetative city building game was made interesting with the well developed story. 10/10 Best Castro Simulator on the market.",
            "review_score": "1"
        },
        {
            "review_text": "Even though repetitive at times, still a very addicting and sometimes funny game.",
            "review_score": "1"
        },
        {
            "review_text": "The game refuses to send me a verification email to let me PLAY the game. I've tried on Yahoo, Gmail, and Hotmail.",
            "review_score": "-1"
        },
        {
            "review_text": "This game, though simple, is addictive. But I'm not sure there is really a way to lose at it.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game would spend hours playing!!",
            "review_score": "1"
        },
        {
            "review_text": "This is worth playing, it's more casual than Tropico 3, but actually that is part of the charm. Also it is cheap now because of Tropico 5.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games ever. I love it and it makes my smile and smell strawberries. If I had 1000000000000 dollar would give to Kalypso. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Will not run on my new macbook pro w/retina + yosemite. Others are having this problem as well.",
            "review_score": "-1"
        },
        {
            "review_text": "Excellent. Better than Sim City with a few pathetic chuckles put in.",
            "review_score": "1"
        },
        {
            "review_text": "Tropico 4 is a game worth playing if you have time and patience. The difficulty within the game lies in learning the progression of income through resource gathering/farming, import and export industry, and tourism. Understanding the finer points of these mechanics may take many hours and lots of restarted levels and scenarios. Happiness, poltical standing, and foreign affairs are fairly easy to manage once you have a basic working knowledge of the game mechanics. Many people will be very much put off of the game because of the DRM, space management, the construction mechanics, and road traffic pathing.",
            "review_score": "1"
        },
        {
            "review_text": "I got to dictate and rule over a tropical island, got overthrown by some rebels when i refused to feed the people and everyone was dying.   10/10 would play again.",
            "review_score": "1"
        },
        {
            "review_text": "Much better than those silly simcity games and copies of them. Very realistic, but it also has clever jokes during gameplay. Missions are logical, the game is challengeing enough . Some of the expansion packs are worthless on their own, but if you want to try everything with a society that comes to your mind as a dictator you can go on and buy these expansions too. Funny to see every single voters electing you except the one that is supposed to be your rival. After the election why not just kill him? :) The main thing i miss is the opportunity to make wars, expand outside the island that you rule and a little bit more complex almanac. Tropico 5 has the war option already, but that game is not as deep as this one.",
            "review_score": "1"
        },
        {
            "review_text": "You can execute anyone you want, whenever you want. 10/10 - Would Dictate Again",
            "review_score": "1"
        },
        {
            "review_text": "This game gameplay-wise is pretty good. It's certainly fun and you do get the feeling of progression that you should from a city builder style game. This game also has a lot of character and atmosphere, too. It's definately a game I'd recommend to fans of city builders, especially those fond of tropical settings.  So yes, I recommend this game, but whilst it has an element of fun to it, a lot of aspects of the setting are not to my personal preferences. It feels too much 'rich guy lording over peasants', especially when you start out with a bunch of guys living in shacks without electricity. And whilst yes, you can turn that all around, the game does feel more favoured toward those wanting to play with elements of corruption in their leadership. So it feels quite out-of-place with my personality. Plus I have no affinity to the tropical hispanic setting. So if that sort of atmosphere is as unfitting to you as it is to me, you may be better off looking elsewhere.  Final verdict: a game I'd recommend to those who are at least neutral toward the setting and atmosphere. And whilst yes, I may continue to play this game, I'd personally never buy it (I was given it as a gift). But that's just me.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ all the ♥♥♥♥♥es :D ",
            "review_score": "1"
        },
        {
            "review_text": "i got this game and its DLC dirt cheap and it's super fun",
            "review_score": "1"
        },
        {
            "review_text": "Have you ever wanted to make that Evil laugh like muahahahahaha!? This is that game.  Your control everything.",
            "review_score": "1"
        },
        {
            "review_text": "this game is great imo i think it is much better then sim city it is worth checking out",
            "review_score": "1"
        },
        {
            "review_text": "I was introduced to this series many years ago and as with many of my other favorite fanchises have followed through ups and downs. As for this particular game it is exactly what I expected and more. I have spent countless hours working on the different islands. My best description for this game is 'Take SimCity, Age of Empires, and Cuban Cigars and put them together and you have this game'",
            "review_score": "1"
        },
        {
            "review_text": "great game love it",
            "review_score": "1"
        },
        {
            "review_text": "Are you a rebel? Funny island sim with a lot of humour. The missions (campaign) make the game interesting for me, dunno if I would play it when I've finished them, maybe a sandbox game now and then. But I'm halfway through the main missions and still gotta play Modern Times. I heard that the expansion was even better, so I'll update when I know more :)   The missions aren't exactly hard, maybe if you crank up the difficulty, but I'm fine with this relaxed way of building my island. The game offers a lot of variation: different types of industry, people and factions to attend to, some international business and now and them a natural disaster. It's fun to try out different play styles, like building a tourist trap or rum and cigar exporting business.  So far the best buy in a long time!",
            "review_score": "1"
        },
        {
            "review_text": "I love city builders and nation building sim games, and Tropico 4 combines both for one of the best experiences every produced. The humor that doesn't simply drip but gushes from every pore further adds to the replayability and fun of this game. I played the Original Campain and the Modern Times Campagin months ago, and came back recently to tackle the extra missions, and the charm is still there. Takes forever to build stuff, running into the red happens easily and way too often whcih can lead to spiral of death until the rebels come, a coup storms the palace, or the superpowers finally dispatch troops. But when everything comes together, it's a great feeling of achievement and pride as I bring a impovrished island to glory and power.  Though, if you really dig down and strip away the humor and fun, you are still left with a solid game, only dealing with dark and depressing subject matter: executions, labor camps, the seemingly never ending struggle between the US and USSR, the threat of being overthrown and disposed. It's not a 'historical' game, but many of the things that took place are based on history and events of the Cold War in the Caribbean, so I have to give props to that.  It's a great game, and worth every dollar thrown at it, all of course from my secret Swiss Bank Account.",
            "review_score": "1"
        },
        {
            "review_text": "it is so hard to profit in this game after playing hours you will be only remembering sounds of dictators :)",
            "review_score": "1"
        },
        {
            "review_text": "Never has such a stereotypical game ever been so fun to play. Want to screw with your 'peasant' farmers? heck, murder them all.... it really is up to you.",
            "review_score": "1"
        },
        {
            "review_text": "much better voice acting than tropico 5, and with content stripped away for DLCs I can't see why anyone would choose the newer one over this masterpiece!",
            "review_score": "1"
        },
        {
            "review_text": "Best Tropico game ever made.Much better Than tropico 5. U have to try to own an island sooner or latter.But dont listen to your advicers  they are strange.  To put down a revolt suggestion is 'burn all farms so they would starve' and its matter of time till all starves lol.  9/10 Really solid game",
            "review_score": "1"
        },
        {
            "review_text": "A fun and in depth city builder with lots to do. If youve ever wanted to run your own island then this is the game for you. Be a manical dicator or a beloved leader each had its strengths and weaknesses. In most scenarios you build a city from the ground up relying on resource gathering, industry and tourism to create a sustainable economy. This game is very similar to tropico 3, in fact it seems like this is a dlc for that game but its still pretty fun over all. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "How you build, drive or run your nation if your the president.? You will find it if you play Tropico",
            "review_score": "1"
        },
        {
            "review_text": "this game is the best",
            "review_score": "1"
        },
        {
            "review_text": "Enjoying this game. It has gotten repetitive but I still like this game.",
            "review_score": "1"
        },
        {
            "review_text": "nothing like supressing the people :D",
            "review_score": "1"
        },
        {
            "review_text": ":)",
            "review_score": "1"
        },
        {
            "review_text": "WARNING: This game requires you to sign up for a Kalypso account in order to play it and puts a bunch of ♥♥♥♥♥♥♥t in your way so you can't just start playing the game without logging in to their DRM.",
            "review_score": "1"
        },
        {
            "review_text": "i loooooovvvvvveeeee tropico, really like how you can play how you like, pro us, or ussr, iron fist, or loveing and peaceful",
            "review_score": "1"
        },
        {
            "review_text": "You can make 'accidents' happen.",
            "review_score": "1"
        },
        {
            "review_text": "Mostly an engine upgrade.",
            "review_score": "-1"
        },
        {
            "review_text": "Good Game, it has a lot of neat things in the game and is a good challenge.",
            "review_score": "1"
        },
        {
            "review_text": "Never fear! Presidente is here!",
            "review_score": "1"
        },
        {
            "review_text": "This game is a great find for any sim city/civ type player. This is a funny, complex game that I am very glad I purchased.",
            "review_score": "1"
        },
        {
            "review_text": "I remember when I played 'Tropico: Mucho Macho Edition' or something like that as a kid on my ghetto ♥♥♥ poor people's computer way back in the day. I had no clue what I was doing and the highlight was unlocking cheats and spamming as many soldiers and rebels as I can and observe the massacre. I loved it.   Now, however, I'm an adult. You know what sucks about being an adult? You need more out of games to really enjoy them, yet you don't have the time to enjoy the lengthy ones that try to do just that, give you a lot of game. You know, this series does a good job meeting half way. It's not your typical strategy game that requires mastering a bunch of skills, it's a simple simulation game where you run an island civilization from third world country to first world. You basically do what you should already be doing as an adult, budgetting, but for fun purposes.  You manage your money to buy things that make you money in the long term. You do your best to satisfy people on the way in order to protect your image and seat as the island leader. All the meanwhile, you have various political factions that have expectations from you, and you cannot satisfy EVERYONE so you gotta pick based on long term self gain rather than personal preference sometimes. You gotta spend money on stuff that actually costs you money and does nothing more than satisfy people's needs or desires.   There is a lot of games of this genre that does that. This series, especially this particular title, does it very well however by using humor and a fun atmosphere to make the game feel so enjoyable. It's hard to explain, but this series is just really special unlike others within the genre that sorta go for the same thing as the typical 'Sim City' clone.   There is some cons, however. I feel you're not really in control of your population to the extent I'd like. Sometimes, there is even bugs that causes the game to create unnecessary building deletes and the likes. There is DLC that ruins some missions, such as the plant gathering prison for people that are sent to prison. Even though they're prisoners, that structure does not count them as prisoners but as farmers. This is terribly frustrating, but it is one of very few extreme flaws with the game.   I could make a huge wish list of what I'd like to see in the game, but I feel like it is unnecessary. Ultimately, I wish there was more options as a successful dictator/ruler. There is a handful ways of making it, such as tourism or mass amount of economical buildings, or farms, etc. I always feel there should be some evil ways to do it. I always just have a massive amount of plantations and a massive amount of bunkers. This is the only way to be a successful 'evil' leader. Enslave the people that refuse to be soldiers and make money off of them. I mean, this is fun but it's so boring and I feel evil can be expanded upon with, perhaps, other consequences that are not game ending.   It's also worth noting these structures I just listed, Bunker and Plantation, are overwhelmingly overpowered. This game isn't pay to win, but those structures definitely make it a lot easier to play. They're both so exploitable, it's sad to see their heart not go into making them balanced.   It's also sad to see that dlc be so expensive. Luckily, I got the complete collection as a discount long ago. In fact, I only owned a handful of DLC from the collection at the time, but they kindly updated my account with their new DLC at the time, meaning I wasn't entitled to some of the DLC they gave me, but they did anyways. I doubt this was intentional, but I just think it's great they didn't attempt to correct that mistake, assuming it was a mistake. Regardless, I feel like most of these dlc's should have been a part of the main game and they could easily have made expansions worth buying instead. The future dlc, or modern times they may have called it (don't remember) is a great example, that's a great one.  The game series also allows map editting. You can basically make your own missions, which gives the player pretty complicated control. You can make virtually every mission you can think of, it's that flexible. You can also check out the maps in their own online thing to download ones made from other players. It's a decent system and I've downloaded maybe twenty maps, but only liked about two of them. I would say that it's a good added touch, but I wish there was some way to have users leave tags and give the ability to search for said tags. I sometimes think certain maps were highly voted for because of reasons that conflicts with my personal play style.  I cannot think of anything else more to say without rambling further. It's a good game for anyone that enjoys this genre. The gameplay is solid, the replay value is great, the flaws are fairly minimal, and the asking price is decent (I'd argue even lower than the game's actual value even despite its age). It has a handful of bugs that are frustrating, but it's good.  9/10  Pros- Good amount of control, far from perfect but still good Gameplay is simple yet there is many complex decisions the player can make The atmosphere is very colorful and enjoyable. The game has a good sense of humor. The economy isn't overwhelmingly complicated to learn. Anyone that is capable of budgeting to save up for a video game can play this. Map editor  Cons- Handful of bugs and balance issues, particularly with the game's dlc. There could be MORE options for sociopaths that basically wants to overwork people. I don't know what else to put here. I really like this game.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "Dictator simulator with great soundtrack,characters and activities. And of course the city/island building is one of the best i ever saw.",
            "review_score": "1"
        },
        {
            "review_text": "I didn't know what this game was when I first looked at it. I'm also not one to really branch out and try new games. But I have been very impressed and satisfied with Tropico 4. I'd recommend it to those who like mixtures of city sims and games like Civilization.",
            "review_score": "1"
        },
        {
            "review_text": "Its Fun. ",
            "review_score": "1"
        },
        {
            "review_text": "it's fun, but not too serious.",
            "review_score": "1"
        },
        {
            "review_text": "Great but don't buy - always go for the newest Tropico, Presedente!",
            "review_score": "1"
        },
        {
            "review_text": "  Not my cup of tea. The style seemed odd(My opinion) the tutorial seemed kind of broken. It told me to get a building permit but for some reason it required a minister of economy(which it didn't tell me to do) Also it kind of bugged me that I had to make an account to play the game. Now this is just view. Also it was free on Humble Bundle so I can't really complain.",
            "review_score": "-1"
        },
        {
            "review_text": "If you ever wanted to own a third world tropical island and try to make it successful, this is the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "this is a great country management simulator. throws out some good challenges.",
            "review_score": "1"
        },
        {
            "review_text": "  I really liked Tropico 3 (long time ago) but Tropico 4 isn't quite the upgrade. In fact, after launching the game and going through the tutorial I was wondering if I didn't get mistaken and launched the 3, but no. The game itself is nice, but lack a lot in both strategy and replayability. Sure, you can still play to get the achievements but I'm no achievement pursuer and after constructing almost every single building in one 'free play' session (100% difficulty, no god mode) and achieving 90+% vote at the last 4 elections + every single faction and foreign countries having a 100% respect rate towards me, I didn't feel like playing this again. The campaign missions are okayish but nothing memorable and there's way too many DLCs for a game like this (I could pay twice the price of the game only for DLCs, that's not really right...). Graphics are okay (though I felt cheated when seeing stuff in the opening video that felt like it was made with the game but actually wasn't, no people in the balloons for example) but except for the nice tropical feel of the colors it the rendering engine don't feel up to the 2011 standard. Got it for free so I won't complain about the price but this game is just very average. Not bad, not good, I'll remember the jokes in it for a bit of time and then it'll probably just rot away in my Steam Library. 5/10",
            "review_score": "-1"
        },
        {
            "review_text": "one of the best tropicos yet, apart from the pirate thingy.",
            "review_score": "1"
        },
        {
            "review_text": "  Positive:  &gt; It was free &gt; Beautiful Graphics &gt; Country Simulator &gt; Custom Islands   Negative: &gt; Small maps   9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Awesome city builder. great sense of humour!",
            "review_score": "1"
        },
        {
            "review_text": "Good casual game. Easy to learn and fun to play.   I recommend if you like to be a mayor/president/dictator of your own island.",
            "review_score": "1"
        },
        {
            "review_text": "I've spent so much of my time buried in this game it's crazy, all the little goal keep me saying 'I'll get off after.. twenty more minutes' but never follow through and this is one of teh few games that actually makes me burst out laughing from it's comedy.",
            "review_score": "1"
        },
        {
            "review_text": "Epic, awesome , just dont even think twice about buying it , JUST DO IT!",
            "review_score": "1"
        },
        {
            "review_text": "Buil your own City !! Buildings Everything !",
            "review_score": "1"
        },
        {
            "review_text": "This is the best sandbox game ever!!!! This is a must if you like sandbox-building games.",
            "review_score": "1"
        },
        {
            "review_text": "I spent like 8 hours on this game in the first day, it's so addicting from the start!!  I love playing the sandbox but I discovered that I also love the challenge of the missions and the campaigns as well.  I get so immersed in this game that I lose track of time (and sleep) and end up playing all night so beware of that... lol",
            "review_score": "1"
        },
        {
            "review_text": "I dont even own this game",
            "review_score": "1"
        },
        {
            "review_text": "Great game, looking forward to Tropico 5.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ing awesome game, 10x better than sim city or anything like it.",
            "review_score": "1"
        },
        {
            "review_text": "Hey man, buy this game and the rum will never be gone!",
            "review_score": "1"
        },
        {
            "review_text": "Tropico 4 is the last and best in a line of dissapointing games. Tropico, Tropico 2 and Tropico 3 had horrible Gameplay. but Tropico 4 fixed that issue. it is smooth and gains hours and hours of lovely gameplay :) 4 out of 5!",
            "review_score": "1"
        },
        {
            "review_text": "Really good game and gives you a constant challange all the way through best game ive bought in a while 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Hey, is there any other games you can build a tropical government?   I didn't think so  Building a modern dicatorship never been so fun, you can build your empire from the ground up.  Really this is a must buy for any strategy fan, heck its fun for anyone!",
            "review_score": "1"
        },
        {
            "review_text": "Definitely one of the better Strategy games in recent times. Humour is more hits than misses, graphics are pretty and lively and the gameplay is fun and engaging.",
            "review_score": "1"
        },
        {
            "review_text": "The one game that I can leave alone for 15 minutes while I iron my clothes and return a millionaire. The nice part about the Tropico series is that you can be as anal retentive as you want to be to squeeze out the utmost efficiency of your playthrough but you will still succeed in most scenarios with a 'fire and forget' mentality. The strategy game that combines subtle mature humor and childish non-sensicalness (much like Adventure Time) will be a personal favorite for a very, very long time.",
            "review_score": "1"
        },
        {
            "review_text": "This was the first city builder ive played, so i decided to go in the sandbox mode and it was so much fun. I was just sucked into the game but I jut wish their was a few more buildings",
            "review_score": "1"
        },
        {
            "review_text": "Easily one of the best city builder/godmode games out there. The strategy and possibility in this game is near endless. Highly recommend this game for anyone who is into running and controlling stuff. I also like that after you finish the massive amount of missions that come with the game you can also download other peoples already created missions to play longer. Not to mention the fact that you do have the option to create your own sick twisted stories (zombies? why not, flesh eaiting viruses? go for it!) The only downfall to this game is should you choose to go the route of tourism, it does get a little repetitive keeping the tourists happy. But thats ok, every now and then execute someone and your game will balance itself.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game with all its little details. It truly gives you freedom to be a democratic 'dictator' or something not so democratic... oh yes, a real dictator! Great re-playability!",
            "review_score": "1"
        },
        {
            "review_text": "The only game in which I can create Robert Mugabe's Crazy Wild and Fun Retirement Carribbean Island Amusment Park.",
            "review_score": "1"
        },
        {
            "review_text": "I'm new to the Tropico series but have played other real-time simulation games like SimCity and Caesar (the latter of which appears to be the closest parallel to Tropico in my gaming experience). I'm now eight boards into the campaign and have figured some things out. As other reviewers have pointed out, the game is very difficult to lose, but it can be challenging for a new player to determine why their city isn't growing as fast as they'd hope or why certain problems persist (certain buildings constantly lack for workers, etc.). The truth is that despite the slapstick banana-republic-tinpot-autocrat gloss of the game, this is actually a surprisingly deep simulation, and the game will throw a lot of information at you that is easy to lose sight of but important to keep track of. Build-and-forget does not work. Even the soil quality or climate of parts of the island can change, meaning that a zone that was ideal for farming a particular crop at the start of the game may not stay that way.  The most frustrating thing about the game is traffic management. Most specifically, your tinpot dictator and his (or her) crack team of mad scientists and engineers might be able to build a nuclear program or an airport, but are congenitally incapable of building a four-lane road. (One wonders how the planes land if Tropico's scientific community is so deep in its principled opposition to wide stretches of asphalt or concrete.) There are also occasional graphical glitches and stability issues, but nothing too frequent or catastrophic on my 2008-vintage PC.  A solid title and worth the price, especially on a Steam sale.",
            "review_score": "1"
        },
        {
            "review_text": "Fun humor, and wonderful aesthetics. AI can be a little annoying, but endearing. Forget Sim City 2013, this is the city builder you should get.",
            "review_score": "1"
        },
        {
            "review_text": "Anyone who's interested in or enjoys playing simulation-style games will enjoy this. I've had a blast playing this game, and have already spent nearly 100 hours playing it and have yet to complete the main campaign, let alone play a single sandbox game. An excellent take on the city-simulation genre, especially as this game is really a nation-simulation game as well.",
            "review_score": "1"
        },
        {
            "review_text": "It's SimCity with the option to shoot your protesters in the face. BUY ME.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game!  After long time of playing this game I can say only positive words! Fantastic combination of city builder, strategy and fun with lot of options. This is the best Tropico edition since the beginning of this game serial.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome sequel to Tropico 3. Well thought out and intuitive menus. Challenging story mode with the always fun and addicting Sandbox mode. Kalypso added some engaging 'side missions' in story mode to keep the players a bit more attentive than in Tropico 3.",
            "review_score": "1"
        },
        {
            "review_text": "Pros: a humorous city builder You are dictator, as such you get dictator powers Multiple factions and forign factions. have to keep people and forign powers 'happy' Good music Lots of random events make city interesting  Cons: A lot of elements that at first can seem overwhelming, but are easy to get once you play a city or 2. Humor can get old after you play enough It's possible to make everyone like you, which makes development choices seem less important Lot of random events could annoy you.  Another thing to mention is this is not a city builder where your a god. You don't say 'I need a house here' and a house apears, you only place a foundation and you have to wait for builders to make it or spend double the money to instantly build it. This could be a pro or con, so I didn't put it anywhere.  Lot of fun, good pickup if you like city builders.",
            "review_score": "1"
        },
        {
            "review_text": "El Presidente is happy with this game",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game! One of the best strategy building games, even more enjoyable than previous Tropico games. Missions are fun and challenging, but not too challenging that it'll force you to give up and never play again. A must buy for strategy game lovers!",
            "review_score": "1"
        },
        {
            "review_text": "A rather fun economic simulation. Surprisingly, different approaches can be made (as can be seen during the campagn) and humor and music definitly add to the overall game experience. Keep in mind though: This is a game for those days, when The Sims seems to be just too turbulent! This game ranges somewhere between watching grass grow and sorting flour according to its colour. A very nice time dump, but don't expect anything even resembling action!",
            "review_score": "1"
        },
        {
            "review_text": "Tropico 4 provides hours of fun. You have to balance finances, food needs, imports, exports, and other areas of running a government. It is not super complex, it just takes being careful about your expendatures and keeping an eye on what your people want. It will feel complex and challenging at first, but it is easier to manage as you get used to the mechanics.  I am looking forward to trying Tropico 5 after experiencing this game, it would be great to play with and against my friends. :-)",
            "review_score": "1"
        },
        {
            "review_text": "I am a benevolent (or not) dictator of some imaginary, insignificant island in the Carribean. Shall I create a burgeoning communistic dreamland that survives off of the trourists dollars? or work my peons to death in disease infested sweatshops making cigars and little papaya snacks for those same rich foreign tourists? Becaue ultimatley that is what every mission boils down to, how best to take advantagee of post colonial golbalization. plays mostly like a sim city game, but a bit on the carcature side of things.",
            "review_score": "1"
        },
        {
            "review_text": "Great game! I really enjoyed it",
            "review_score": "1"
        },
        {
            "review_text": "I am an communist capitalist asian war hero with a cigar he also owns a hotel     10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game makes me wet.",
            "review_score": "1"
        },
        {
            "review_text": "a game to get lost in! great simulation game. have played previous tropicos and this is by far the best! bring on 5",
            "review_score": "1"
        },
        {
            "review_text": "Heyyo, If you have Tropico 3? Don't buy this game, you're not missing much...",
            "review_score": "-1"
        },
        {
            "review_text": "I like this game. Love the game because I feel like I can be anyone or do anything I like. The only thing I do not care for is that I can't do the campains very well because I like the sand box mode. I can do what I want in the time I want. I alway get kicked out or in jail because I'm one of the player it does not mater what the people want I'm the lead and you do as I say. Thanks for reading this If you have anything you would like to know before you buy this game send me a message I will help as much as I can. I understnad about buying game you are not sure of. Sweetlonglegs.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun. It is known",
            "review_score": "1"
        },
        {
            "review_text": "Superb game. Not as challenging as some city management games, but by far funnier than the rest.",
            "review_score": "1"
        },
        {
            "review_text": "you are the god on the island",
            "review_score": "1"
        },
        {
            "review_text": "ON THAT NEW JOB STATUS",
            "review_score": "1"
        },
        {
            "review_text": "Real good game. The feel of sim city third world style! Definitely worth a try and a reasonable priced at that.",
            "review_score": "1"
        },
        {
            "review_text": "Feels like Tropico 3 with slighty better graphics. Some of the old annoying 'features' have been thrown out, there are some new buildings, and there are now natural disasters. But aside from that, it's really the same as Tropico 3.  Still fun though.",
            "review_score": "1"
        },
        {
            "review_text": "For Simcity and Cities XL lovers alike this is the game for you!! It may not be as hard or strategic as other game but its sure good fun.",
            "review_score": "1"
        },
        {
            "review_text": "if you are looking to spend hours of gaming building up your country. this game provides hours of fun.",
            "review_score": "1"
        },
        {
            "review_text": "It has some really cool improvements like the small tasks guiding you through the missons, but the new desasters can be a real pain in the a**. ^^",
            "review_score": "1"
        },
        {
            "review_text": "An awesome alternative to the SimCity franchise. The Tropical/Carribean soundtrack and theme makes the game incredibly fun and addictive to play. Highly Recomended",
            "review_score": "1"
        },
        {
            "review_text": "This game is great and you should buy it, though the game is really similar to the 3rd one but entertaining any way",
            "review_score": "1"
        },
        {
            "review_text": "Sim City Commie Edition",
            "review_score": "1"
        },
        {
            "review_text": "Similar to Sim City, but better. Same problems but definitely more objectives. A hell of a lot funner and the soundtrack... Is extremely catchy.",
            "review_score": "1"
        },
        {
            "review_text": "Hello future steam readers! If you're looking at this page chances are Tropico 15 is about to come out, and you're excited to get your nostolgia on and play some old Tropico!  My advice for you is this: Just wait a month and buy whatever next Tropico is coming out, it will be the same exact game, except with more features!",
            "review_score": "1"
        },
        {
            "review_text": "Humorous, sarcastic, cynical, gritty, grimy, serious version of Sim City, it's what a city planner would be like living in the third world and on the take with two superpowers breathing down your neck. I especially find having to play the US off against the USSR for survival to be especially amusing.  The Swiss Bank Account is also another nice cynical touch as well.",
            "review_score": "1"
        },
        {
            "review_text": "Very similar to every other Tropico",
            "review_score": "1"
        },
        {
            "review_text": "Fun to play over all good graphics and funny radio broadcasts.",
            "review_score": "1"
        },
        {
            "review_text": "Tropico 4 is great if your a tropico fan. All around easy to play and very addictive the only real downside I found is the inability to update your buildings based on the year ie no condos into modern appartments etc. making it difficult to maintain a functional city after a certain point without careful planning ahead just a heads up though. Otherwise the graphics are about what's to be expected and the overall feel of the game is very loyal to the series (granted its hard to mess that up). All I can say is rule on El Presidente tropico 5 coming out soon",
            "review_score": "1"
        },
        {
            "review_text": "New! Improved! More modern options, a slightly better campaign mode, and all the stuff that you get a DLC pack for - now for the price of a new game... though lately, it's less than DLC - so go get it, and rule people. I don't always oppress people, but when I do - I eat rice pudding.... or something.",
            "review_score": "1"
        },
        {
            "review_text": "I'll be honest, I don't play a lot of large scale simulators. But Tropico 4 was awesome and addicting for many reasons.  Variation of avatar: lots of different bonuses/debuffs depending on which you choose (communist, installed by USA, war hero, kleptomaniac, etc)  Variation of map: although the buildings are generally the same, you can go industrial, tourist, or a combination of both on any map. In addition you can play to the strengths of your avatar(crop boosting avatar, tourist boosting avatar), and you can be successful as a prison/police/secret police/army anti environment dictator or a socialist/hippie/art museum presidente and still have a good time, adapting to each map.  Characters: From Miss Pineapple to knockoff Nixon pseudo-Guevara and exaggerated stereotypes of all nations the game remains playful and varied.  Difficulty: Fun story line, increasing in difficulty each map without becoming boring and repetitive. Each map forced you to play slightly differently or adapt in a way that taught you something about the game you might not have known, making it satisfying to learn and create your island in different ways. By the last map you really feel like more skilled as el presidente instead of building the same hotel every map.  ",
            "review_score": "1"
        },
        {
            "review_text": "Really fun and relaxing game play",
            "review_score": "1"
        },
        {
            "review_text": "Tropico is a city builder with an actual game behind it. You design everything from the roads to where individual buildings are placed, and fund it by creating a strong economy. Then volcanoes will go off (better have a fire station), or the rebels will attack, or your neglect of the intellectuals will seriously hurt your re-election chances. One of the most iconic and fun games available.",
            "review_score": "1"
        },
        {
            "review_text": "Tropico 4 is amazing, housing, welfare, economy, industry, complete control of a island and alot of fun.",
            "review_score": "1"
        },
        {
            "review_text": "Simcity's citybuilding capabilities and diplomacies mixed with the wide variation of stuff you can do, like in Anno games. Great game imo and def worth it now that its on sale",
            "review_score": "1"
        },
        {
            "review_text": "had enough of server issues and traffic jams? Then play this citybuilder in the tropics. A great relaxing game! Must buy for citybuilder fanatics!",
            "review_score": "1"
        },
        {
            "review_text": "Great, fun this game! can't wait for the sequel :D",
            "review_score": "1"
        },
        {
            "review_text": "Funny game, and alot of fun.",
            "review_score": "1"
        },
        {
            "review_text": "Its a SIM CITY type game. Meh.",
            "review_score": "1"
        },
        {
            "review_text": "Tropico 4 provides hours of fun. You have to balance finances, food needs, imports, exports, and other areas of running a government. It is not super complex, it just takes being careful about your expendatures and keeping an eye on what your people want. It will feel complex and challenging at first, but it is easier to manage as you get used to the mechanics.  I am looking forward to trying Tropico 5 after experiencing this game, it would be great to play with and against my friends. :-)",
            "review_score": "1"
        },
        {
            "review_text": "Tropico is pretty much a city builder. (I will accept my promotion to Captain Obvious later.) The thing that sets this series apart from things like SimCity and others is that it is not primarily trying to do that; it's ALSO trying to be a pretty hilarious and it does that job admirably. It should be noted that its humor in no way detracts from how it is well-balanced, and suits a variety of playstyles. Sure, it actively punishes people who play my way (going into crippling debt every six months, making a lot of money when the container ship comes, then going right back into crippling debt), but it in no way actively prevents you from doing it. There's a large variety of possibilities for you to do on the island, the campaign is engaging and somehow even funnier than the sandbox, and there's character customization too. Which is nice! If, on the other hand, you're too lazy for that, there's plenty of dictatorial types for you to pick from, from Che to Fidel Castro to the Voodoo Pizzaman, who I am 95% confident was a real dictator. Personally I'd like to give this game a 10/10. So I will!",
            "review_score": "1"
        },
        {
            "review_text": "Overall though, Tropico 4 was a delightful experience. It made some incredibly useful changes and additions to gameplay while maintaining the heart of the Tropico series. And the annoyances were few and far between enough that this title is worth turning on again and again. Viva la Tropico!",
            "review_score": "1"
        },
        {
            "review_text": "Heaps of fun. Like Simcity but with a grander purpose.",
            "review_score": "1"
        },
        {
            "review_text": "If you liked Sim City, even slightly, you'll love Tropico. Unless you are very mean and bitter person.",
            "review_score": "1"
        },
        {
            "review_text": "City-building sim with social and political considerations, wrapped in irreverent tongue-in-cheek humor. Surprisingly detailed and lots of fun despite being a bit too easy once you learn the ropes. Grab it on a sale.",
            "review_score": "1"
        },
        {
            "review_text": "a haiku review boring, repetetive, but cannot stop playing",
            "review_score": "1"
        },
        {
            "review_text": "They put a finishing touch on tropico 3 and greatly enhanced it with tons of features. Good value for money, even the downloadable content.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥♥in'",
            "review_score": "1"
        },
        {
            "review_text": "However Tropico 5 is more complex than Tropico 4, I enjoy playing this version a little more, also because there is a unity of time, without changing between ages. This is a perfect parody to various dictatorships with funny music and don´t forget to listern to the ingame radio :P",
            "review_score": "1"
        },
        {
            "review_text": "This game, though simple, is addictive. But I'm not sure there is really a way to lose at it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is so addictive and very very fun.",
            "review_score": "1"
        },
        {
            "review_text": "Really recommend this game...This is actually my favorite sim game, and I really hope they release a 5th.",
            "review_score": "1"
        },
        {
            "review_text": "3/5 *** Its more of an expansion pack than a full sequel, but if you love Tropico you might get some more enjoyment out of this. But like I said its really not much different from 3. For newcomers, it is a fantastic city building game with political management elements. By far the political spin the game has makes it for me. I love the Tropico series, and if you like city building games you should for sure check this out.",
            "review_score": "1"
        },
        {
            "review_text": "Great if you love citybuilders",
            "review_score": "1"
        },
        {
            "review_text": "It is a very complicated game to figure out as it is not similar to any other RPG out there. It is refreshing and fun when you figure out how to play, and when you establish a good economy. Definately a fun game for people who want a challenge and fun.",
            "review_score": "1"
        },
        {
            "review_text": "I find this more enjoyable then simcity 5",
            "review_score": "1"
        },
        {
            "review_text": "For all your El-Presidente needs. Better than Tropico 3 but it feels more like an update to the old game rather than an entirely new one...",
            "review_score": "1"
        },
        {
            "review_text": "Better than Tropico 5.",
            "review_score": "1"
        },
        {
            "review_text": "This is very good game  El Presidente for Life!",
            "review_score": "1"
        },
        {
            "review_text": "This is my faveourite out of all the Tropico games including 5 but Tropico 3 had the best Radio and I feel Tropico 5 with its Story is better but this one has all those except the awesome radio and it has more variety in DLC. Recomend you pick all the dlc's for this.  10/10 Would dictate again",
            "review_score": "1"
        },
        {
            "review_text": "68/100",
            "review_score": "1"
        },
        {
            "review_text": "This game is so much better than the competition. Its as simple or complicated as you want it to be, and thats nice because alot of games are getting oversimplified.   I would also like to add, the trade system is very robust, and can be played with strategy or almost completly ignored if you wish (it can run itself and there are tons of ways to prosper). With other similiar games I feel compelled to only build one way because of overly linear trade systems.   Finally, one of the best things is being able to follow EVERY single person on the island from home, to work, to play, to home again; in fact, as time passes, so does their tiny little lives, it makes the sandbox feel much more alive for me. ",
            "review_score": "1"
        },
        {
            "review_text": "This should have been an expansion for Tropico 3",
            "review_score": "1"
        },
        {
            "review_text": "If you have always dreamed of being a Caribbean despot and love government management sims, you have very specific taste and Tropico 4 is the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "Just played for a few hours but the game starts out great. It isn't really easy to start with, but it's hilarious. Enjoy being a dictator !",
            "review_score": "1"
        },
        {
            "review_text": "Became a communist dictator. Everyone still loved me. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "I love it, I love it so much.",
            "review_score": "1"
        },
        {
            "review_text": "I actually bought this game just to achieve an achievement at the christmas sales and i must say i kinda like the game.  I like to build my own city , spend some hours on it and see it beeing destroyed by a tsunami and then some time later by a hurricane it'S really facinating. and very realistc !   anyways, it is easyer to play then cities xl (but therefor not better or worser) , it has a funny side and i really really like krokketjes.      ",
            "review_score": "1"
        },
        {
            "review_text": "Great game, spent hundreds of hours on it. Wait for it to come on special though during a steam sale as they almost always reduce the price of it during every sale.",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this game because El Presidente told me too... This is actually a really fun game with a lot to do! It can be cartoony at times with exaggerations of communism/socialism but can also be serious when you're trying to run a country!",
            "review_score": "1"
        },
        {
            "review_text": "This game would be pretty neat if I could actually play it on my Mac.",
            "review_score": "1"
        },
        {
            "review_text": "They improved Tropico 3 and made it more fun in all ways. It's a very open minded portrait of the banana republics of latin america that allow us to be a people's ruler or just some jackass explorer, while taking enough measures to not lose the power over the island we rule.",
            "review_score": "1"
        },
        {
            "review_text": "Great city sim game, has kept my attention the whole time 40+ hours in, definitely worth a buy.",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed the Tropico-franchise throughout the last installments and picked up T4 during the Winter-sales. Sadly, I was disappointed by what it had to offer. It is not a bad game in itself, it just isn't that much of an improvement over the last Tropico. You have all the same buildings plus a few extra ones with added mechanics (e.g. appoint ministers yourself), yet apart from that it's still the same old game. The graphics are what you'd expect them to be and the humour is still there, though you'll have grown tired of El Presidente-jokes by now. In short: If you have Tropico 3, give this one a miss.",
            "review_score": "1"
        },
        {
            "review_text": "I have been a fan of city builders for quite sometime. I've put in hundreds hours to games like Anno 1404 and 2070, Imperium Romanum, Patrician, Port Royale and SimCity. I found Tropico while looking through Kalypso's library of games and I was curious about this game. It takes place on an island and you take the role of El Presidente and you can be a dictator, a believer in democracy or whatever you want to be. You truly take the reigns on not only your city but how you are viewed among many factions.   Do you want to stop your people from ever having education and raise an army to silence the protestors? You can do that. The Presidente himself can take on multiple personas. From famous individuals like Fidel Castro or a male or female avatar you craft yourself. Pick the style you were elected, pick your traits, all of them change gameplay in some way. While I haven't even put in 20hrs into this game at the time of writing this review, I can tell it's one that's going to keep me coming back for quite sometime.",
            "review_score": "1"
        },
        {
            "review_text": "Great if you love citybuilders",
            "review_score": "1"
        },
        {
            "review_text": "Watched a construction worker run all the way from one end of the island to the other, build a building, and then die. 10/10 would dictator again.",
            "review_score": "1"
        },
        {
            "review_text": "so i was playing Tropico 4.. and there was this guy protesting.. so i executed his entire family and put him to prison.. for i am El Presidente   --------------  another day in tropico 4.. elections are coming.. my opponent is a fisherman. he was really annoying cause his probability of winning is close to mine.. i needed to bribe my faction leaders to win the elections, but i don't want that.. i don't want to spend that much money.. so i ordered my secret police to 'arrange' an accident.. problem solved.. for i am El Presidente.. I AM THE LAW!",
            "review_score": "1"
        },
        {
            "review_text": "A good game if your looking for a bit of fun, some thing to pass the time or just a distraction. Its buildings to get repetitive even though there is the cheap DLC, the DLC is fitted to one theme so it doesnt match. I never really found my self actually paying attention to the 'Story' becuase i really was not intrested. This is a 5.5/10 not bad but not great",
            "review_score": "1"
        },
        {
            "review_text": "The game encourages me to go mad with power, but with all the happy Latin American music and the beutiful tropical island (sometimes with waterfalls and ancient aztec ruins) ... I just can't. I can't bring myself to hurt those happy little tropicans.",
            "review_score": "1"
        },
        {
            "review_text": "Best of the series and if you already own this game it might not be worth buying Tropico 5 as the game itself is just a refined version of Tropico 4.  Saying that it is the best game of this genre I have played since the Sim City (original) back in the day.  Be prepared to lose hours of yrou life if you get into this one ;)  Jacko Rating 8/10 ",
            "review_score": "1"
        },
        {
            "review_text": "I loved this franchise since first game that came out; and it's better with every new rendition! I personally can't get enough of this game and I would highly recommend it to all fans of management and town building games! It's a must have classic with excellent game play and even better ingame music and overall character! And on top of that, you can often find this game on good discounts, and it would be a crime to not buy it when you have a chance! Go and make El Presidente proud!!!",
            "review_score": "1"
        },
        {
            "review_text": "Cant stop playing this game",
            "review_score": "1"
        },
        {
            "review_text": "a lot of fun  recommend for others that like real time tycoon games with a island feel",
            "review_score": "1"
        },
        {
            "review_text": "Very fun, first RTS/city builder that I've actually played the campaign for in a long time.",
            "review_score": "1"
        },
        {
            "review_text": "'You don't have to be a dictator, you can be el presidente, not el dicator'  -me   I honestly like sim city 5 and this game, but this is FAR more complex and hard. While El Presidente is ment to be a dictator, you can be a leader of any kind, even a dictator (lol). I think this game is recomended for politcal people! you should get anyway, it is beautiful",
            "review_score": "1"
        },
        {
            "review_text": "Very cool game",
            "review_score": "1"
        },
        {
            "review_text": "Its no sim city but it will do",
            "review_score": "1"
        },
        {
            "review_text": "I bossed out the demo of this game, it was fantastic. I enjoy having the ability to rule my own country. really worth the price hours of fun, even when completed",
            "review_score": "1"
        },
        {
            "review_text": "holly crap so much fun def getting tropico 5 i am a island god",
            "review_score": "1"
        },
        {
            "review_text": "Must have for every fan of the series. The expansion has an even better campaign.",
            "review_score": "1"
        },
        {
            "review_text": "Fun, silly and tropical. Vacation on your computer :)",
            "review_score": "1"
        },
        {
            "review_text": "Attractive, easy to use, I'd suggest this game for someone who wants to play games, likes puzzles, government tactics and not wanting be exposed to offensive language or violence.   Somehow I found this game to be repetitive even with the DLC's. It took me forever to start making money and when I did I just kept going with it and fulfilling the objectives. Never left one level played it through 2030. I found the choices I made had near immediate impact on gameplay. (As opposed to thinking wow I wish I didn't build that refinery 10 years ago) Would have liked more choices of buildings etc, but loved the management dynamics (taxes, food, edicts, etc).   Might dictate again, after a dentist visit if on a Friday. Aye yi yi.",
            "review_score": "1"
        },
        {
            "review_text": "very addicting game!",
            "review_score": "1"
        },
        {
            "review_text": "Great game! Bought this at $0.39 USD last week. I've several fun hours since!",
            "review_score": "1"
        },
        {
            "review_text": "nothing like supressing the people :D",
            "review_score": "1"
        },
        {
            "review_text": "Hysterical. Just hysterical.",
            "review_score": "1"
        },
        {
            "review_text": "I started playing a game of Tropico at 6AM and finished around 10PM. El Presidente enjoys 14 hour workdays.",
            "review_score": "1"
        },
        {
            "review_text": "Fun, addicting and humorous. You won't regret this buy",
            "review_score": "1"
        },
        {
            "review_text": "you're the president :D",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game if you like city-building. The DLC's are mostly not worth buying individually so wait for when they are all sold as a package.",
            "review_score": "1"
        },
        {
            "review_text": "Who doesnt want to rule a 3rd world country. All hail El Presidente",
            "review_score": "1"
        },
        {
            "review_text": "If you like the Civilization series you should give Tropico a go, it's a fun twist on empire building.",
            "review_score": "1"
        },
        {
            "review_text": "If you like city builders with lots of humor and a decent challenge rating, play the campaign mode of Tropico 4! Also, DLC is very handy when making your cities...  My max pay price: $20, $25 with DLC",
            "review_score": "1"
        },
        {
            "review_text": "If you like Sim City, I would recommend buying Tropico 4. It functions similarily to Sim City, but instead of building a city, you are in charge of your own Carribean island. You must build up an economy, whether it be with mines and factories, crops, or tourism. You must keep your people happy with entertainment, religious buildings, and healthcare. You can rule a democratic paradise, a communist utopia, or a ruthless dictator.  I played a couple of rounds in the sandbox (a mode with no objectives, just build and build and build) and got a little bored of the game. I decided to start the campaign to see how it differed and I find myself going back to play each mission. Each mission is fresh and offers its own comedic problems and continues the storyline. I'm on mission eight of twenty right now, and I am still very much interested.  If you are not a fan of Sim City or other simulators, you probably won't like this game. But if this genre tickles your fancy, I heartily suggest you give it a whirl. Being the ruler of your own island? Sign me up!",
            "review_score": "1"
        },
        {
            "review_text": "Super fun game for anyone who likes strategy/ city-building games. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I find this more enjoyable then simcity 5",
            "review_score": "1"
        },
        {
            "review_text": "I went and made a massive army base with 2 nuclear plants beside it to make it look cool, I treated them well until they done a failed coup and I became more popular. Tourism started to increase a lot after that which was very profitable. 10/10 would get better tourism from failed army coups again.",
            "review_score": "1"
        },
        {
            "review_text": "There is not much invention but still great fun ;)",
            "review_score": "1"
        },
        {
            "review_text": "You play as a dictator on a tropical island. It's a city building game with society control mechanics, production, trade, foreign affairs. I find it very fun, extremely funny, with a cuban flavor. Even if you play a dictator, you can give your citizens a lot of freedom. There is a lot of depth to production and trades. I love the game :)",
            "review_score": "1"
        },
        {
            "review_text": "This game really dosen't get the respect it should. Tropico 4 is a heck of a lot better than the dibacle that was Sim City. It has great Depth, good sandbox mode, good campaign, it has historical accuracy, and it also has a lot of entertaining characters, or you can create your own. There really is no negative with this game!",
            "review_score": "1"
        },
        {
            "review_text": "I’m having a blast with Tropico 4, but I know it’s not for everyone. Tracking stats, managing an economy and building a million projects at once keeps me engaged, but without a little patience to learn the interface it’ll overwhelm many a strategy newcomer.. Still, if you’re the type that’s spent hours with the likes of Civilization or Sim City, or has an unhealthy need to be in control, then it’s time to become el presidente.",
            "review_score": "1"
        },
        {
            "review_text": "Something different, lots of humor and verry consistent in it's look and feel. If you can't afford Tropico 5, play this one.",
            "review_score": "1"
        },
        {
            "review_text": "It's ok you can buy it",
            "review_score": "1"
        },
        {
            "review_text": "Heyyo, If you have Tropico 3? Don't buy this game, you're not missing much...",
            "review_score": "-1"
        },
        {
            "review_text": "Like simcity but not broken and made by moneyhungrey devs. Love it!",
            "review_score": "1"
        },
        {
            "review_text": "Castro visiting church, boosting morale 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Is-a verra nice! Amusing and buildy.",
            "review_score": "1"
        },
        {
            "review_text": "traded with the USSR behind the americans back and also became freinds with the middle east behind americas back, before shooting my minister of education for being a forigner and turning my island into a massive cigar factory with a zoo  11/10 would dictate again",
            "review_score": "1"
        },
        {
            "review_text": "El Presidente! I love this game!   ",
            "review_score": "1"
        },
        {
            "review_text": "Great game. No autosave feature which is extremely annoying. I've lost 10+ hours of gameplay due to random update restarts and power outages.",
            "review_score": "1"
        },
        {
            "review_text": "Look at all those tiny people!",
            "review_score": "1"
        },
        {
            "review_text": "When I first took to this game, it flustered me. I was drop-dead poor for twenty-eight days of each in-game month and hardly meeting the objectives. By the time it hit me, the game had already transitioned out of the agitatingly sparse income pattern to a fairer trickling income pattern.  The early game was meant to be a pain in the ♥♥♥.  All in all, Tropico 4 approaches too many fronts (RTS, City-Builder, Comedy, RPG) and still excels in each of its aspects. If you're looking for a serious city-builder, this game may be too much for you, but if you're just looking for the sheer enjoyment of a well-made game, seriously consider giving Tropico 4 a shot.",
            "review_score": "1"
        },
        {
            "review_text": "Perfect economic strategy.",
            "review_score": "1"
        },
        {
            "review_text": "If you're thinking about buying a Tropico game, choose this one (well...3 is good also). It's an amazingly fun city builder/manager game that you'll play for hours.   -Interesting gameplay -Lots of humor -Good campaign  9/10 I'd say",
            "review_score": "1"
        },
        {
            "review_text": "LOVED IT!!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome and addicting sim. But doesn't change much from tropico 3.",
            "review_score": "1"
        },
        {
            "review_text": "I tried to play this, and it refused to let me play until I signed up for an account and verified the email address I used to sign up. It was pretty annoying to have to wait for 20 minutes to confirm an email for them to spam so that I would be allowed to play a single player game.",
            "review_score": "-1"
        },
        {
            "review_text": "Tropico is one of my all time favourites. It's some city-building/political/economical/tycoon/strategy love-child. Just gets better with all the extra expansion packs. There's a brilliant balance of humour and casual gameplay mixed with serious moments and enough to keep hardcore players entertained. I'll play in a massive week-long binge, forget about it for a while, then find myself craving more and more. Can't recommend this enough!",
            "review_score": "1"
        },
        {
            "review_text": "3/5 *** Its more of an expansion pack than a full sequel, but if you love Tropico you might get some more enjoyment out of this. But like I said its really not much different from 3. For newcomers, it is a fantastic city building game with political management elements. By far the political spin the game has makes it for me. I love the Tropico series, and if you like city building games you should for sure check this out.",
            "review_score": "1"
        },
        {
            "review_text": "Short but good 8/10",
            "review_score": "1"
        },
        {
            "review_text": "After playing this game, I don't think that I want to run a country anytime soon. I do enjoy a good strategy game, and this is for sure a favorite of mine. Trying to balance everything on each Island that you go to can be pretty challenging. For instance, one of the resources that you can obtain is lumber, the more resources and money you make will make the capitalists happy, but destroying forests will ♥♥♥♥ of the environmentalists. Once you know what you're doing, you will have a great time playing this game.",
            "review_score": "1"
        },
        {
            "review_text": "Its funny, nice to play and can do everything between casual citybuilding and hardcore challenges.",
            "review_score": "1"
        },
        {
            "review_text": "Probably my favorite game in my library. It's fun when you know how to get your island economy on it's feet, you can make yourself a communist or a capitalist. Usually when you're a capitalist you have very little opposition, but when I'm communist I have either none, or a very high amount of rebellion. Nonetheless a great game I enjoy playing.",
            "review_score": "1"
        },
        {
            "review_text": "why it takes a lot of time to sync-ing? but overall, the games was good",
            "review_score": "1"
        },
        {
            "review_text": "This game is an Absolute Joy to play, Multiple challenges in campaign mode grants you a new experience every game. The best City building i have ever played, the characters and the narrative are also really well done! 9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Another tedious company forcing you to sign up to their junk mail before even playing the game. With no option to unscribe. After this I gave the game 3 minutes attention but no more. so this is a review for their sign up policy only. game might be ok - i will never know.",
            "review_score": "-1"
        },
        {
            "review_text": "I guess to be a good leader you have too 'feed your people' do you know how much corn costs.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. Best of the series. It has an easy learning curve yet difficult enough to master. Overall I'd say its very fun and I can foresee myself putting many hours into this game. highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "If you don't have a spinning golden statue by the end of it you played it wrong.",
            "review_score": "1"
        },
        {
            "review_text": "El Presidente is waiting.",
            "review_score": "1"
        },
        {
            "review_text": "Can enforce communism with militarism whilst sucking American capitalist ♥♥♥♥.      9/11 Most realistic communist sim ever made.",
            "review_score": "1"
        },
        {
            "review_text": "Approved!",
            "review_score": "1"
        },
        {
            "review_text": "Greatest game!!! Always a Tropico fan!!",
            "review_score": "1"
        },
        {
            "review_text": "Wonderful game. Bring out the inner tyrant within you!",
            "review_score": "1"
        },
        {
            "review_text": "Excellent continuation of the series. Improved upon Tropico 3, and many say it is better than Tropico 5. If you're the serious type interested in creating a viable island government and economy, or the insane, senile, capricious Fuhrer type, you will enjoy Tropico 4.",
            "review_score": "1"
        },
        {
            "review_text": "  It's like Crusader Kings II, except you just focus on one city.",
            "review_score": "1"
        },
        {
            "review_text": "El Presidente, let's make night club to be headquaters of sercet police which performs some accidents on innocent people very often :-)  Verdict: 8.5/10  PS: After some time they will love to eat tobacco :-)",
            "review_score": "1"
        },
        {
            "review_text": "I built a socialist paradise, and it only took 40 years of exploiting ignorant white tourists and uneducated manual laborers to do it!",
            "review_score": "1"
        },
        {
            "review_text": "Step one: Play game. Step two: Send llamas into space. Step Three: Get it to say 'nyan'  420/10",
            "review_score": "1"
        },
        {
            "review_text": "It's tad racist... But overall I liked it.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is better a little better than the third game.(Tropico 3) its have more features like put cocaine in the water supply. But i would recommend getting the Third game only because it the same thing but new features; the music is not as good as the third. And the radio isnt as funny as the Tropico 3. Its still funny, this game is a lot more fun with all the DLCs so get it when its on sale or buy it of any website( *cough* ♥♥♥ *cough*). In conclusion its not a must buy, but it does pass the time",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Surprisingly addictive. A bit of a learning curve though.",
            "review_score": "1"
        },
        {
            "review_text": "'Dictator simulator 4.0' Absolutely love this game. It combines thoughtful city-building with a lot of mechanics (pollution, overusing farmland, citizens revolting) with charming toungue-in-cheek humor. This is a game where you not only build an island civilization, but are also actively encouraged to embezzle the crap out of it.  My one complaint is that it can get a little repetitive sometimes. But every so often you need that little bit of totalitarian power, and this game is perfect for that.",
            "review_score": "1"
        },
        {
            "review_text": "7/10  I found this game fun at first.   Pros: unique story, good mechanics, and challenging objectives. CONS: it gets really repetitive, really quickly. You’ll find yourself generally in debt for the first portion of the mission, then once your economy starts to boom, it becomes extremely easy. That’s the only strategy as well. Start poor, use natural resources, try to not get kicked out of office, build industry, build extra things for happiness, build tourism, and win. Really simple.  ",
            "review_score": "1"
        },
        {
            "review_text": "Good game, but takes alot of time per level &gt;&lt;",
            "review_score": "1"
        },
        {
            "review_text": "Scratches my Sim City itch better than Anno 2070 and Cities. Good soundtrack. Expansions made things a little _too_ easy.",
            "review_score": "1"
        },
        {
            "review_text": "  This is such a great game.",
            "review_score": "1"
        },
        {
            "review_text": "Its Fun. ",
            "review_score": "1"
        },
        {
            "review_text": "9/10",
            "review_score": "1"
        },
        {
            "review_text": "  great game!",
            "review_score": "1"
        },
        {
            "review_text": "  I got this game free on the humble store and was going to just play for a few minutes. Then poof! 13 hours. It ended up being fun. I would recommend getting the newest one on a sale, if you're looking to get into these games.  ",
            "review_score": "1"
        },
        {
            "review_text": "Fun city-building game, with little-fish in a big pond politics thrown on top. You can thrive giving your citizens a paradise or dooming them to a penal colony.",
            "review_score": "1"
        },
        {
            "review_text": "This game has given me a wonderful introduction to the world of city building sims. It's a combination of a good simulation with politics and satire of the entire Cold War. It has bonus value if you've taken a 20th Century history class and get all the references in it.",
            "review_score": "1"
        },
        {
            "review_text": "10 hours straight, nice game :D",
            "review_score": "1"
        },
        {
            "review_text": "A very well made piece of game, I normally don't leave any feedback but for this time, this is one of the few game that can keep me entertain for many hours. It's very satisfy seeing your city growing bigger and prosperous as you keep contribute into it. I've bought the entire series of Tropico but so far I've only played Tropico 4, might as well try the rest in the future though. I recommend this game for preferbly relaxed type player like me. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "I'm the type of dictator that keeps on playing every single map/mission on campaign mode until it's financially stable and everyone is at least 70% happy. All my AI subjects love me /happytears",
            "review_score": "1"
        },
        {
            "review_text": "  smart of them to give this away for free because I just bought 3 of the DLC packs.",
            "review_score": "1"
        },
        {
            "review_text": "  great game",
            "review_score": "1"
        },
        {
            "review_text": "Extremely entertaining video game. Does everything perfect and provides enough content for its price.   Can only recommend if you are longing for a feeling of superiority.",
            "review_score": "1"
        },
        {
            "review_text": "the very best tropico game",
            "review_score": "1"
        },
        {
            "review_text": "Get it now! These peasants aren't going to oppress themselves.",
            "review_score": "1"
        },
        {
            "review_text": "I tried real hard to be the 'good guy' Presidente in this game but, as Penultimo says it: 'It's like trying to find a unicorn.' So screw it, I'll be that badass dictator instead. 12/10 Would declare martial law again.",
            "review_score": "1"
        },
        {
            "review_text": "  I never would have gotten this game if it wasn't free on HumbleBundle, and also if I didn't see my friend playing the first Tropico. I caught the name as I scrolled past on facebook so I told my friend it was going for free, and I got one for myself as well  I don't usually play RTS or city builder games, but this one was surprisingly fun, a bit like SimCity, Civ and something else I can't put my finger on rolled into one. The great music is a plus too  The only thing bad about this game is that you can't control what gets exported and what goes to your people",
            "review_score": "1"
        },
        {
            "review_text": "The best \\'dictator sim\\' I\\'ve played... then again it\\'s the only one, sooo....   \\'It\\'s like Cities: Skylines, but with extra communism!\\'",
            "review_score": "1"
        },
        {
            "review_text": "I've played this game 'by accident' at the beginning. And then i've hardly played any other game until i've finished it.",
            "review_score": "1"
        },
        {
            "review_text": "Fancy yourself a dictator? Power hungry with delusions of grandeur? This is the game for you!  Good strategy game with decent campaign and sandbox modes.",
            "review_score": "1"
        },
        {
            "review_text": "Very addicting game. The campaign is really fun considering how much stuff you have to overcome. The Tornados, the Earthquakes, the Tsunamis, their all fun to deal with. The only thing I don't like, and I would love to see, is something like the island becomes flooded, and you have to save people, or parts of the island become flooded... I also wish there was a workshop for this game, and I think people could create some crazy stuff!",
            "review_score": "1"
        },
        {
            "review_text": "I thought this game was going to be like sim city but it turned out to be way more involved and I like the game play! Being able to manipulate the islanders and how they are helping to progress the empire you are trying to build is an interesting and fun concept!",
            "review_score": "1"
        },
        {
            "review_text": "Lot of resources to explore in this, many ways to build up your island. Inner and foreign affairs, political factions, economy and social aspects of this carribean society are yours to manipulate in order to get the objectives done and your own satisfaction. The base campaign is long and attractive, objectives are a nice push to most mono-oriented players. ",
            "review_score": "1"
        },
        {
            "review_text": "Due to the Autumn sale, I am writing a short review for perhaps one of my all time favorite games.  I realize I play this game wrong, I play as a liberal, democratic paragon, eschewing corrupt banana republic policies. But thats the beauty of this game. Though perhaps nowhere near as challenging as most other City builders, there is nothing more relaxing than guiding my little island paradise on the path of peace and posterity for all. Just beware those rebels! Darn commies never learn the cold war is over!",
            "review_score": "1"
        },
        {
            "review_text": "Very relaxing and fun game to kill my boredom. Easy to play and ♥♥♥♥ the environmentalist.",
            "review_score": "1"
        },
        {
            "review_text": "One of absolute favorite games",
            "review_score": "1"
        },
        {
            "review_text": "Tropico 4 tasks you with building a settlement on an island, gathering resources and maintaining your grasp on the populace.   To advance through each level; of which there are 20, you need to complete a number of tasks to achieve a particular final goal. There's plenty of variety in these missions, and you can see why when you boot up the comprehensive challenge editor. Needless to say, winning levels is more than just gathering so many resources.  It is a bit of a drag how you have to start each mission from the beginning. As such, missions begin with about half an hour of placing down clinics and churches and placating the communists before you can get to the interesting stuff of going through those missions. They won't dissapoint - for example, in one, you have to host the olympics.  You can run your island as a benevolent ruler or a tyrant by enacting laws, denying/permitting elections and executing/arresting your opponents or having a free press.  Recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Tropico 4 has shown me that all dictators need communism because it is cheapest, and all dictators are cheap. It is overall a great game and i would recommend it to anyone who likes city builders and oppression of small caribbean countries.",
            "review_score": "1"
        },
        {
            "review_text": "I own all of the Tropico games, but his is the one I keep coming back to replay. Who doesn't want to be dictator of a small island nation? The Tropico franchise took the city management genere, and made it better. The game's tounge-in-cheek mentality keeps things light, and it is easy to lose track of time when playing.",
            "review_score": "1"
        },
        {
            "review_text": "I've played this game 'by accident' at the beginning. And then i've hardly played any other game until i've finished it.",
            "review_score": "1"
        },
        {
            "review_text": "Very similar to 3, but a decent improvement overall. A charming little city builder game.",
            "review_score": "1"
        },
        {
            "review_text": "Best Tropico of all time. Also one of the best citizen simulations ever made. 10/10  Edit: Note that I played the non Steam version a few hundret hours at least...",
            "review_score": "1"
        },
        {
            "review_text": "Worth.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best city management games I've ever played. Also one of the only city management games I've ever played. But that might change because of this game.",
            "review_score": "1"
        }
    ]
}