{
    "app_id": 57700,
    "name": "Who's That Flying?!",
    "release_date": "2011-01-31",
    "developer": [
        "Mediatonic"
    ],
    "publisher": [
        "Kalypso Media Digital"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Partial Controller Support",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Casual"
    ],
    "achievements": 12,
    "positive_ratings": 98,
    "negative_ratings": 42,
    "price": 3.99,
    "description": "As the mysterious and powerful &quot;Guardian of Earth&quot; your steely eye and HYPER-POWERED LASER ARM have kept the citizens of Earth safe for generations.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/57700/header.jpg?t=1447353865",
    "minimum_requirements": "OS: Windows XP  Processor: 2Ghz or Higher Memory: 1 Gb Hard Drive: 400 mb Sound: Windows compatible sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Remember arcades then this is for you.",
            "review_score": "1"
        },
        {
            "review_text": "6/10  Pros: - Is a 'real release' (Little or no bugs) ++ - Allows holding down button to shoot and has special attacks to add more depth and fun to the game.  Cons: - No multiplayer (Not listed as multiplayer, but would add alot to the game). - Has a survival type gamestyle which the whole game (Campaign/Story included) revolves around as a theme. This would not be a bad thing at all if the game had other modes/gametypes that were not ingrained in this particular mode/style, but it doesn't.  All in all this is a good 'small' arcade game, it has solid coding, can be fun, and has some genuine and creative content in the story/theme and gameplay. The thing for me that stops this game from being a great is mostly the lack of replayability/content.",
            "review_score": "1"
        },
        {
            "review_text": "I rather enjoyed this game. Just an old school 2D flying game with a few quirks. A bit short - at 90 mins I had already beat the game Silver/gold score on all levels and beat several of the challenge levels (not all.) I played with a 360 controller - I recommend this game with a controller, without it - perhaps it would just make you upset. This game is basically a super flash style 2D shooter. I had a blast, although shrot one. - P.S. The big laser makes you feel all funny inside. :-D",
            "review_score": "1"
        },
        {
            "review_text": "Sort'a like a lot of old school shooters on the consoles of 'the good old days' of TV gaming, but with a very stylized look/feel to it, the game's neat, runs/controls well (even on My cruddiest notebook), is easy enough to play, yet poses a challenge even on normal mode... supports the X360 for Windows pad, AND is free so get it now if you liked retro side scrolling shooter games!",
            "review_score": "1"
        },
        {
            "review_text": "If you like side-scrolling shoot 'em up games, then you will like this one. Who's That Flying?! is a really fun game where it starts very simple, where the player shoots at incoming enemies, preventing them from destroying the town. Then becomes really engaging as the enemies start to shoot back and attention would need to be divided between dodging enemy attacks and landing your shots. If you're familiar with Touhou games, then Who's That Flying?! style of play should not be anything new. Some points I liked about this game is the good cartoon looks, challenging at times, and the simplicity yet fun aspects. The only negative side of the game is that controls cannot be reassigned.",
            "review_score": "1"
        },
        {
            "review_text": "Great shooter, pretty much one of the best games you'll get for five bucks. Buy this! Now! ;)  Pros: Great cartoon graphics, funny storyline, easy gameplay, chalenges that keep you playing for hours after you finish story mode.  Cons: Short game, no character customization, hardcore gamers may find this too easy.",
            "review_score": "1"
        },
        {
            "review_text": "Was an awesome game on a friend's machine, but is UNPLAYABLE on mine. Some bug exists which causes the game to be far too fast on faster video cards or at higher refresh rates (or whatever the heck it is). The suggestions on the forums to set VSync didn't work for me, nor did using frame limiting of something like DXTory.  Don't purchase unless the developer fixes this.",
            "review_score": "-1"
        },
        {
            "review_text": "sadly, boring as hell. 02/10",
            "review_score": "-1"
        }
    ]
}