{
    "app_id": 57740,
    "name": "Jagged Alliance - Back in Action",
    "release_date": "2012-02-08",
    "developer": [
        "Coreplay GmbH",
        "Bigmoon Studios"
    ],
    "publisher": [
        "THQ Nordic"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Stats"
    ],
    "genres": [
        "RPG",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "RPG",
        "Tactical"
    ],
    "achievements": 60,
    "positive_ratings": 730,
    "negative_ratings": 345,
    "price": 14.99,
    "description": "A contemporary remake of the much-loved series of turn-based mercenary-themed strategy games.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/57740/header.jpg?t=1533040112",
    "minimum_requirements": "OS: Windows XP (SP2), Vista or Windows 7 Processor: Core 2 Duo Processor (1,8 GHz or better) or similar AMD Memory: 2 GB RAM Hard Disk Space: 3GB HDD Space Video Card: Shader 3.0 compatible graphics card (Ati 2600, Geforce 8800 or similar) with 512 MB RAM Sound: DirectX Compatible Sound Card Known issues: Visual artifacts could be displayed when using the following visual cards: AMD Radeon HD 6000 or GeForce 8800 GT.",
    "recommended_requirements": "Processor: i5 Processor (2,4 GHz or better) or similar AMD Memory: 4 GB RAM or more Video Card: Shader 3.0 compatible graphics card (Ati 5850 and Geforce 460 or better) with 768 MB RAM Known issues: Visual artifacts could be displayed when using the following visual cards: AMD Radeon HD 6000 or GeForce 8800 GT.",
    "reviews": [
        {
            "review_text": "I've tried time and time again to like this game. I install it, play it for a while, and every time I have to uninstall it because I'm so immensely frustrated at the shoddy mechanics. The camera is fine for everything but actually seeing what you're doing, and you need to point and click where you want characters to go based on the camera's view. Point and click, mind you, on any pixel in a large map with thousands of tiny variations in elevation which can mean the difference between spotting and shooting and enemy or being blinded by the tip of a mintue hill. You CONSTANTLY have to deal with adjusting your position so you're behind cover but still able to see and shoot the AI, who by the way, do not have to deal with ANY of what I've complained about so far.  There are so many other small things I could complain about, but the above is what's making me vow to never play this again. Who would have thought a grid system would be make or break for this kind of game.  On the plus side, I really like the idea of a plan and go tactics game.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a 'Plan &amp; Go' style, squad size command, RTS game using the Jagged Alliance theme. If you are good at people/logistic management, you will enjoy this game.  There are a lot of game reviews on Steam that breakdown and list the flaws of the game and make comparison to other similar games; but these are for the 'control freaks' who have failed to realise that just like in the real world, things are never perfect.  If you just accept the flaws of the game (imperfect game rules), play and plan strategy according to the game rules, overcome the problems as you encounter them, ...you will do well in this game.",
            "review_score": "1"
        },
        {
            "review_text": "I have got so much enjoyment out of this game that I really would owe it a more thorough review, but I'll settle for a few thoughts for now.  In my opinion the contemporary reviews were as bad as they were because of the initial lack of the fog of war. That's been taken care of ages ago and that completely changed the game for the better, at least for me.  I see many people still hate it, but honestly I don't know why. The stop &amp; go system works very well, and actually I think it's superior and less artificial as the traditional turn based system. And yes, I played the original JA in the 90's as it came out and enjoyed it, but I enjoy this even far more.  As for the bugs and crashing, I really haven't encountered anything nearly game breaking, only a few minor annoyances.   As for complaints of the game being too difficult unless you skip regions - simply not true. It can be difficult at times if you don't know what you're doing, but all the more satisfying when you finally do.  So here's my lazy effort for a game that has brought so much entertainment to me. The bottom line: Thumbs up!",
            "review_score": "1"
        },
        {
            "review_text": "Lovin the new RT/pause combat system! I can now finish my tactical battles much faster compared to what took me forever in the old school JA and Xcom. Strategic layer is also fun. Crafting would have been nice to have back.   Hopefully the devs continue to develop this game.",
            "review_score": "1"
        },
        {
            "review_text": "I love the original even though it was a bit old when I played it. Graphics were poor and the controls and many interfaces were clunky. I was overjoyed to spot this update in a shop recently and just had to buy it. Afterall, all they had to do was to modernise it and it would be pretty much perfect. The hard bit that many other games fail on, the GAMEPLAY, was perfect. Turns out that the people behind this new thing decided to change the thing that made this game so special in the first place and change it into just another overhead RTS where reactions are more important than brains.  Very disappointing. I'm going to find the original again.",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this as a risk on Amazon for £4 having never played a game like it before... little did i know that two weeks later i would find myself still completely immersed in the game play. The story lacks a little umph!, but the physics of the game are well designed and the real-time plan and go system is a beautiful asset, and apart from XCOM, i have found no similar games to JA:BiA.  The game is well worth buying but not at the price on steam, Buy from amazon for about £2.90 and it will be one of the best buys you will make if you enjoy tactical shooters with a strategic edge and nac for micro management.  Pro's - After re-balancing MOD (but not needed for enjoyable play) - - Excellent and unique interface for plan and go!. - Graphics are more than satisfying for its year. - Lots of Content and great micromanagement. - Challenging with multiple ways to achieve victory. - Openly modded with text config files.  Cons' - - Story lacks any real drive for the final goal. - Before the updates, movement and objects for mercenaries had some flaws. - Bigger cities require beefy processor to handle all the moving objects i.e children and civilians. (Kill all the kids and you will be fine)  ",
            "review_score": "1"
        },
        {
            "review_text": "these puppetmercs will friendly fire other mercs y without tacticalformation options therefore need one by one to Control formation so the game name should be called Jagged Alliance - puppet in action or Jagged Alliance saveload action by the way dictator was killed by wolf machet lol",
            "review_score": "1"
        },
        {
            "review_text": "I'am a big fan of the old JAs, this one is not like them. It lacks the gameplay that made them awesome, it's not well coded, and can be frustrating. But it's alright... If we can see it for what it is, a new way to play JA, it can be fun and challenging. Where turn-based was order and perfection, BiA is chaos and luck, but it is also rewarding when you make it work.",
            "review_score": "1"
        },
        {
            "review_text": "I found the controls and sightlines a little clunky. While the effort in modernizing this classic franchise is applaudable, in the end, this version doesn't offer much beyond the orignals.",
            "review_score": "-1"
        },
        {
            "review_text": "Very difficult. The beginning is a breeze, but later in the game you'll find yourself grasping for resources and man/woman power. High learning curve, and the game will take any openings you give. Not for the faint of heart",
            "review_score": "1"
        },
        {
            "review_text": "Very good surprise. I started with quite negative preconceived ideas, especially compared to JA2. The result is that I really like that game.  - Much more dynamic and ergonomic than JA2 - More accessible too (I found JA2 way too hard anyway) - Still fun and challenging  Some stuff are not great though, especially stealth which is completey broken, but there is a very good rebalancing mod which fixes this.",
            "review_score": "1"
        },
        {
            "review_text": "If you are a great big whiny ♥♥♥♥♥, this game is not for you. It is not something you buy and just walk through in 2 hours. Its challenging in all the right ways and is a great tribute to old school gaming. There are a few things that could be tweaked, such as being able to repair armor, and better behaving militia. This is a great strategy game with the option to have a turn based layout of your actions. The weapons, attachments, and environment are satisfying but not over the top. if you have several hours a day to waste, buy this game, quit your job and, tell your wife your leaving her and play!",
            "review_score": "1"
        },
        {
            "review_text": "it frustraded me more then i liked it. apart from crashing sometimes it's mostly the interface and fighting. it never really did as i expected and the outcome of an action was more depending on luck then on strategy it seemed.",
            "review_score": "-1"
        },
        {
            "review_text": "This game shows that if you can play tactically and have the patience to put in abit of hours you can get somewhere, I have played about 13 hours, restarted many times but now I have a team of 3 and took down a town with 25, so I will recommend this for the main reason that it is hard as hell!",
            "review_score": "1"
        },
        {
            "review_text": "This actually is a very good game, There are very few Turn Based Stratergys these days that add the character bulding elements quite so well. Its a very challenging game that can lead to frustration, sometimes losing hours of saves because one of the guys you spent hours on died! Most of the time you can get them up with a medic but you can quickly take on catastrophic casualties.  The side missions can be difficult and not very well explained, there are a fair few good guides for the faint of heart and if your one of these hardcore types I am pretty sure they can keep you going for a good while.   Supplys can be hard to work out, and the flow of time is very odd at times :D The story really is neither here nore there. If you looking for Depth and story telling this is not the game for you. If you want to spend hours and hours planning your perfect kills then this is the game for you.   Stealth is very hard to master on this game, You always feel like your guys could not hit a cows ♥♥♥♥ with a bango. You learn to never expect your guys to take out a key target with one shot.. I find lining up a fire death squad works great but then you quickly find you have a ton of guys charging in at you.  The AI, is really nothing to write home about, They respond when they hear or see things, this can be quite a long distance too... But if you silently slaughter someone, and run away, they will quite happily step over their dead body.. Just assume they hated them so much they care little they died horrifically.   Overall, the game hits the spot when it comes to upgrading a team, and shooting things turn based style. Lots of options of weapons, Lots of options of entry into buildings, Lots of configurations in building your team.  What is really missing from this game, is your own customed avatar of death. Its by far the one thing i hate, you cant create your very own guy with your own specific set of skills to start you off and that my friends is a damn shame.  OVERALL RATING 80%  Its a good game that has kept me playing about 150 hours, but I have still not completed it! True i keep restarting but who doesnt :D",
            "review_score": "1"
        },
        {
            "review_text": "I feel so ripped off. I bought this for MAC OS. It works ok at first, enough to play over the 2 hours so you cna't get a refund. Then the bugs roll in and the game is unplayable. You waste time trying to find a way around the bugs, but nope its broken. You try to download community patches, but they don't work for MAC / Linux clients. Could have been a great game. But for a MAC user it is a waste of money, I got sold a pile of broken code. Steam should stop selling broken games. Every second game I buy is broken. :( so dissapointed 2/100",
            "review_score": "-1"
        },
        {
            "review_text": "I really loved Jagged Alliance 2 and Jagged Alliance 2 Wildfire and was thus really excited to see the ideas implemented with new graphics.  This game however is so bug ridden, it is almost completely impossible to enjoy playing it. Many features previous games had were cancelled and except for the 'plant c4 here' and 'stop the time' nothing else was implemented.  This is not only bad, but also makes me really sad to be honest.  I really thought I would give it a go and it couldn't be that bad. But it really is. It hurts to say but: do not buy this game!",
            "review_score": "-1"
        },
        {
            "review_text": "Like any other jagged alliance game just with all the fun removed.",
            "review_score": "-1"
        },
        {
            "review_text": "I didd't play original Jagged Alliances, so probably that's why I have no problems with matters like 'killing the franchise'. To be honest, I really enjoyed it, despite some minor bugs, mercs having movement problems and lacking any self-defence instincts. Oh, and the AI lacking intelligence. There's a fine range of weapons, and the shooting itself is nice. Plus, some RPG with developping the mercenaries, some primitive sort of economy, and some interaction with Arulco's citizens. To sum up, for me it's a good mix of action and, let's say, strategy, with some active pause and quasi-rpg. And hell, the menu theme is awesome!",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game purely because I'm a huge Jagged Alliance 2 fan (and Jagged Alliance 1 too - yes I'm that old). It doesn't even come close to capturing the genius of the originals, if you're after a nostalgia trip then you'll be disapointed.  Having said that it's an OK game in its own right, go in with no preconceptions and you'll be fine.",
            "review_score": "1"
        },
        {
            "review_text": "A slap in the face to fans of the original series.  I wasn't expecting much, but this game is a cheap, shoddy cash-in on the name of the Jagged Alliance series and was released in a laughably unfinished state. Two years later, it's still a quasi-playable, buggy mess. Nearly all the sandbox elements that made JA:2 great have been stripped away, leaving what is effectively a budget handheld game masquerading as a fullprice PC title.  Buy the original instead.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a bit of a mixed bag for me, i enjoyed this game but then it seemed to change. A couple of bugs and stupid design choices killed it for me and the combat just felt kind of average. This isn't a BAD game, it's just i personally struggled to have fun.",
            "review_score": "-1"
        },
        {
            "review_text": "It is good, but not as good as old JA2",
            "review_score": "1"
        },
        {
            "review_text": "why will not recommenend this game because the looting system is the worst. You shot 25 guys and get 4 guys and maybe some armor",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥♥♥ game, and more ♥♥♥♥♥♥♥ and buggy linux port",
            "review_score": "-1"
        },
        {
            "review_text": "Best shooting strategy game I've ever played!",
            "review_score": "1"
        },
        {
            "review_text": "I ♥ this game :D just epicness The only 2 minus points are.... No Custom Merc and its a shame its not Co Op Playable , while it could highly be do able , but besides that game still is great but HARD but that makes it more Excited :D",
            "review_score": "1"
        },
        {
            "review_text": "This was a huge waste of money!",
            "review_score": "1"
        },
        {
            "review_text": "It's like MechCommander (MercCommander?), but with OPERATORs and you can pause it to set up ambushes and whatnot.   JA2 purists will probably be disappointed, but fans of real time tactical games like World in Conflict or MechCommander will probably be very pleased.",
            "review_score": "1"
        },
        {
            "review_text": "There's a few things about this game that aren't quite the way I'd have done it... ridiculously low level caps, permanent armor degradation, and no custom mercenaries. If you can get past that, Jagged Alliance - Back in Action was quite possibly the best recent western-style squad based tactical RPG out at the time of release. The terrain is beautiful, and tactically significant. The weapons are varied and each can shine when paired with an appropriate combat style. The combat system is the smoothest and most satisfying attempt to meld real-time action and turn-based planning that I've ever played. Now that it's been patched, you can even adjust the tactical elements and difficulty to match the level of challenge you want. And if you're interested but not sold, Coreplay is among the disturbingly small club of developers that bothered to make a demo to introduce you to their product. Try it and see what you think... just don't charge toward the red marks as soon as the map loads. That's for bulls.",
            "review_score": "1"
        },
        {
            "review_text": "A Cool pausable Real Time Tatics game. if you like squad tatics you should like this one. bit of a Learning curve thou",
            "review_score": "1"
        },
        {
            "review_text": "70/100",
            "review_score": "1"
        },
        {
            "review_text": "It's still worth the money. If you loved the old JA games, this is a great remake. Totally different graphics due to real 3D, new game mechanics, but after you get used to it, it is even more fun than the original game.",
            "review_score": "1"
        },
        {
            "review_text": "Fannntastic,in keeping with the spirit of the series,highly playable,almost totally addictive.These guys knocked it out of the park.one of my favorate games to play or mod,will be playing this one for years to come.I rate this game highly and would recomend it to any and all gamers ",
            "review_score": "1"
        },
        {
            "review_text": "Heyyo, I dunno... maybe it just comes across as too plain... but I didn't like this game... also, beginning of game is scarce of ammo and no good tutorials.",
            "review_score": "-1"
        },
        {
            "review_text": "Descended upon the first mission. Kitted out my guys with pistols. 2 enemy guys ran up to me with planks, ignoring every shot that hit them, then beat me up.  0/10 Would not bring a gun to a plankfight again.",
            "review_score": "-1"
        },
        {
            "review_text": "A MUST have game for any Tactical RTS -  Crossfire is also a must have as well as the old school Jagged Alliance 2",
            "review_score": "1"
        },
        {
            "review_text": "Note, If you are a fan of JA, look at something else. If you are a fan of this, just go away, you will not like what I have to say about this sad, sorry, S.O.B. of a game. Most of my game time is because I left the game on overnight and did not notice until the next morning.  I want to give this a good review, I really do. But in good concience, I can't. In fact I hate the blasted thing. And I have been putting off writing this in hopes that it would be fixed, but so much for that. This is the first Jagged Alliance game I have ever had and at first I liked it, then I actually began playing it. The game is frought with bugs, logic failures and factual errors, alot of them. To begin with the game will crash ittermitantly for no particular reason and it is not my rig (MSI Redline modified by XoticPC). Then there are the other little annoying things, character pictures go all fuzzy and you sometimes pop around the map with lag, but I could live with that if it wern't for the gameplay. Oh god, here it comes. Your characters are absoutly clueless and need major micromanaging to keep them on target. You literally have to hold their hands through every single encouter. Who to aim at, kneel, stand, run, where to go ect. I would not be suprised if they needed instruction on how to wipe their virtal hinies. They will not even return fire unless given explicit orders to fire at a specific target. I can hear you yelling at me through your screen, 'Use the Guard Mode!'. Yes, you could use the guard mode but that does not use the full range of the weapon only acone of what the character can 'see'. With fog of war on this makes sense, with it off, not so much. Another problem, if you order them to move to a location and the dinkleberry pathefinder system doesn't think they can fit in just right, they bounce around in the space like so many pinballs cought between a pair of bumpers. In a combination of these two problems, you can actually kill off your whole squad with friendly fire. If you have lets say six guys lined up behind cover and somebody pops up on your flank while guard mode is on, the far character will actually drill rounds through the rest of the squad like a 10 year old playing CoD. Moving on to the other bits, few of the vanilla guns have proper names, all grenades, cannon shots and tank rounds look like smoke grenades and the reloading is a bit too short for mgs. But the most game breaking thing about this is also the biggest logical error. If you leave the enemy alone long enough, you will be facing a bunch of Navy Seals guarding a garbage dump, no kidding, I saw 6 Spec Ops (Lvl 5 enemies) looking after Queen D's rubish pile. This is just stupid for lack of a better word, there are steep learning curves then there is this. This is worse than unfair, it is just totally illogical. It makes not sense to sit your best guys on your least important junk. I'm sorry but this just kills the game.  For those like myself that like comprehensive stuff, I'll break it down.  Concept 8/10 I like the Idea behind the game, lead a gurrillia war against an opressive dictator with mercs and liberate the country, in other words, every JA game in the cookie oven. Still, it had so much potential and was dropped it in the mud. Tsk, tsk.  Graphics 6/10 They are not bad but are way under par for a title like this made a scant 3 years back. The whole thing just feel kind of janky. This inculudes the buggy gliches and whatnot.  Interface 5/10 Even worse than the graphics, still feels cheap and lacks fluidity to the placement to the buttons and some thigs are missing totally from the interface.  Stability/Moddability 3/10 Mods can be found for this If you look for them, but there are not that many, also, this does not have workshop available. When you do find a mod, only use one, mabe two if they are dissimilar because this is buggy as is and mods are notthe best thing to throw at something like that. Some mods do correct some of the problems with the game, but I have yet to find one that can fix that stupid enemy generator. I run a realism one to correct some of those aforementioned errors but that is like empting the ocean with a pale and shovel. And a good modder should not have to make up for the numerous ♥♥♥♥ ups by the devs.  Gameplay -10/10  Yes, I said negative 10, if you don't like that, tuff turkey. This just kills it for me, like I said above, there are aspects of the game that just make you want to hit something. Incredibly frusterating and totally illogical. The enemy just steamroles you if you do not skip about 70% of the areas and make a mad dash for the finish line. Yes,you can skip most of the game and just go for the jugular, but what is the bloody point of the game if you are just going to end it in 5 game days anyway? P.S. The DLCs are a rip off.  Conclusion (11/5)/10 I ain't breaking out a calculator for this. Bad, it's just bad.  So, the game could have been much better if the Devs game a darn. But as I played the game, I felt that the game had alot of rough edges, almost like it was done very quickly on a beer budget while trying to make a champagne title. Many of the aspects do not make sense and the map looks like an ink blot on constuction paper. In other words, this could be better played if you had Seal Team 6 an a couple of helicopters. Now I know I am going to get a lot of 'learn to play' BS out of the fans of this game, I have one thing to say to you, shut up. If somebody was shooting at you and you had a rifle in your hand would you just sit and stare into space? No you would pull the trigger and not wait for someone to tell you to do it. (Well, I would, if you have a 1000 plus hours on this game, lets face it, you live in your mom's basement and would soil yourself and have a heart attack if someone shot at you). Final take away, DO NOT BUY THIS!!!!!!!!!!   If you want an RTS that has pause and has some RPG elements and feels like a gurrilla type thing, I got nothing for you, can't think of a thing for you sorry.   Update: I have found a mod combo that does make this better and have found it to be more playable. However that does not change my views of the base game for which this review is for.",
            "review_score": "-1"
        },
        {
            "review_text": "Huge amount of bugs, you,ll never finished this game (it's impossible)",
            "review_score": "-1"
        },
        {
            "review_text": "This game is bugged as ♥♥♥♥ for MAC users. I've tried contacting to no avail. I used to love this game, it's super demoralising losing your saved games, and to hae glitches in important interactions. I loved this game back when, don't bother with it now, I want the last 30 hours of my life back. way to blow hard at everything.",
            "review_score": "-1"
        },
        {
            "review_text": "Yeah nice Remake of Commandos. Thought i bought Jagged Alliance but its not ...  Kinda a light version of a game. They took all features out of Jagged Alliance and created a completly new Game. Jagged Commandos",
            "review_score": "1"
        },
        {
            "review_text": "Better than the reviews as vanilla and excellent with Combat Evolved mod!",
            "review_score": "1"
        },
        {
            "review_text": "Awsome game not quite as slow or technical as JA2 but it is a very well done remake and definatly feels like a proper JA game.",
            "review_score": "1"
        },
        {
            "review_text": "The remake of what is probably my favorite game of all time. The plan-and-go system is excellent, graphics are pleasing and the voice overs, although they will never match the original are adequate. The only draw back is the lack of a character creation. Creating your own character was half the fun in Jagged Alliance 2. Without that, I feel less connection to the game.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the better titles sporting the name jagged alliance",
            "review_score": "1"
        },
        {
            "review_text": "Ah the good ole days. Great game for turn based RPG. RNG monster isn't always against you. I wouldn't recommend melee combat. Even with a great merc with perfect stealth you often don't one shot a mob and they end up doing serious damage to your sneaking merc. Much easier to get close and use a silenced handgun. Game gets extremely easy after a couple play throughs when you realize you can pretty much sneak to zones you shouldn't be in to get the best weapons in the game way too early. It is possible to win the entire game with 1-2 mercs. Not bashing this game at all. I love it completely. Really wish there would be a newer one come out with updated graphics and game engine.",
            "review_score": "1"
        },
        {
            "review_text": "This is a very cool game! I loved it before, and I still love it. The only problem for macusers as myself is that this game is a bugfest. The game freezes constantly, and it´s so bad I cannot even play it. I try to load a game, and it freezes. I try to start a new game, and it freezes.  DO NOT BUY THIS GAME for mac before they patch it up real good. If you do you´ll be throwing your money away.",
            "review_score": "-1"
        },
        {
            "review_text": "Big fan of the original. I was sad to find out that this is a far departure. The gameplay is rough as guts and not terribly enjoyable and the graphic update just flat out doesn't work. Give me the original any day. Don't even bother with this one, not even if it's on sale. A completely wasted opportunity.",
            "review_score": "-1"
        },
        {
            "review_text": "I really enjoy this game, and have put many hours into it.  Let me first say, I haven't played too much of the original JA. A lot of the hate tends to do with 'This is nothing like the original'. Regardless I still find this a great game.  Bugs be damned though. Many times I have the discourse of 'God dammit I told you to run!!!'. or 'How the F*** Are they hitting me for half damage and I cant even get a shot off?'   Getting suited for various missions, where unless I have suited my mercs for each various encounter ahead of times, I'm always having to run back to the airport to change for whatever missions (Night, Desert, Woods, Urban) but sometimes the time it take from airport to combat, your are ill prepared (Stock up for a night mission, arrive during the day).  I think this game takes a lot to master, however It has been fun, and has given me hours of enjoyment.  I did buy this with a bundle pack ($6 for the game and DLC). I'd would say this game and it's DLC's are a good $20 well spent, but nothing more.",
            "review_score": "1"
        },
        {
            "review_text": "IF you enjoy slow-paced strategy games, this one is for you. It definitely takes a while to complete and keeps you interested (If you're patient with it), but from personal experience, I lost interest after so much repetativeness. There was just nothing new for me to acquire and nowhere new to explore. Still may get back into this, but after a long break.",
            "review_score": "1"
        },
        {
            "review_text": "Step into the Way Back Machine and grab a copy of Jagged Alliance: Back In Action if you were a fan of JA II or if you just like great strategy/RPG games. It's great to get a good turn based strategy game as they are few and far between these days. So once again it is time to hire and arm your mecenaries and take over another fictional Bannana Republic, Hooah!",
            "review_score": "1"
        },
        {
            "review_text": "Well, I played Jagged Alliance 1 + 2 ages ago. These games are classics! When I read the reviews of this version, I thought omg this doen't look good. But when I saw that the bundle was on sale, ok, why not! Let's try this! I'm happy that I bought it. It's different when you played the first two Jagged Alliance but it will grow on ya. Now, I only play the game with Realistic Rebalancing Mod, because it fixes bugs, ads weapons etc.  + graphics looks nice + healing + repairing is instant + exp system, whenever you do something, you gain xp + tactical screen is nice + you don't have to pay the mercs overy week, just one fee + autosave at start level and before every combat event  - you can't create your own merc anymore - you can only repair guns, so no repairing armor etc. - only one weapon slot (for silencer or scope), so you can't do both",
            "review_score": "1"
        },
        {
            "review_text": "Nice strategy game Little unforgiving but nice",
            "review_score": "1"
        },
        {
            "review_text": "Great mix of Action-strategy, story could be made better, levels are original and offer multiple ways how to complete them, AI is sometimes kinda dumb, but can ale surprise. Great continuation of old commandos by my oppinion",
            "review_score": "1"
        },
        {
            "review_text": "I play this game on a Mac and can only review it on the mac.   I've always wondered how someone can have 50 hours in a game and not recommend it... well now I understand. BUGS! I actually really enjoy this game and the tactical rts/rpg elements, however the game is too buggy and eventually became unplayable after all my saves became corrupted then plain dissapeared. I struggled through the bugs ti complete 55% of the game when my many saves just vanished.   Pros  Fun tactical rts style gameplay with pause decent level up system with rpg feel. you can allocate points to stats or skills as you gain exp wide variety of weapons (many of which just do not work as intended ie rpg has no blast radius) lots of locations large selection of mercs  Cons  Bugs galore. including but by no means limited to: All items dissapear (this bug is tough and even loading a previous save somehow does not restore the lost items.) Unable to enter any buildings in certain towns. Game locks up when interacting with certain NPCs.Characters sometimes do what you tell them...sometimes they just don't (seems not to be affected by increasing stats) weapon stats such as range do not apply correctly (you will have a sniper rifle which will be out-ranged by enemy pistol) Many, Many more...but you get the idea.... lots of bugs.  Voice acting. A couple characters have decent or funny voices...but some of them are unbearable. Tip: Do not choose the merc 'Fox'as your first merc...she will drive you insane.   Broken achievements: Many easy ones do not work others work when they shouldn't. ex I tossed a gas grenade... it hit a tree, even though the path for it indicated it would not hit the tree...the grende dropped at my feet and killed me... the achievemnet for killing a tank with the rocket launcher ticked! Haha, I had not even owned one at this point.  Icons often do not change after switching weapons.  so many things do not work as intended, or not at all  Other thoughts  I had not played any other Jagged Alliance title, so I can't compare to previous releases... but I had fun with this game despite the bugs. I got it in a bundle and probably spent under one dollar on it...so I certainly got my money worth, but I can't recommend it with all the bugs and especially the saves corrupting. I got my moneys worth, although I would say, don't spend more than a few bucks on this AND be ready to encounter a wide variety of bugs that may or may not make the game unplayable. Certainly think twice about purchasing if you plan to play on a mac",
            "review_score": "-1"
        },
        {
            "review_text": "Very good realistic turn-based tactical game.",
            "review_score": "1"
        }
    ]
}