{
    "app_id": 58200,
    "name": "Jolly Rover",
    "release_date": "2010-06-07",
    "developer": [
        "Brawsome"
    ],
    "publisher": [
        "Brawsome"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Point & Click"
    ],
    "achievements": 16,
    "positive_ratings": 249,
    "negative_ratings": 31,
    "price": 6.99,
    "description": "A comedic 2D point and click adventure, featuring a crazy cast of poxy pirate pooches.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/58200/header.jpg?t=1535518841",
    "minimum_requirements": "OS: Windows 7, Vista, XP SP1 &amp; 2 Processor: Pentium IV 1.2 Ghz processor or faster Memory: 256 MB RAM Graphics: Standard DirectX®: DirectX® 9.0c Hard Drive: 160 MB Sound: Standard",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This game is suprisingly good, at first impressions I thought it was going to be a badly put together story and ganeplay, oh how wrong was I!!. Jolly rover reminds me a lot of the monkey island series. The graphics are retro styled and work well with the whole layout of the ganeplay itself. It is narrated throughout which is great as the voices add to the fun of playng, Its not a huge world based game. It has a few locations and three main islands with many explorable parts, not a huge amount of interacable characters but this to me stops it getting boring and clustered. The story is good and the puzzles are fun and not too hard. It is a light ha=earted game but worthy of a 9/10 I would recommend to anyone who wants a casual easy flowing game. If you enjoy click and points give it a try and for the price you cannot lose.",
            "review_score": "1"
        },
        {
            "review_text": "Jolly Rover is fun to play. A nice micture of classic point &amp; click adventure with some casual game elements. Not to difficult, yet not to easy either. It got really funny dialogue with a couple of laughs and great characters.",
            "review_score": "1"
        },
        {
            "review_text": "When i first popped open this title, I lacked a will to continue due to it being outside of my comfort zone (genre wise). Fastforward 16 hours later and it's a title that impressed me all the way to its ending. I recommend if in the mood for some lighthearted adventure.",
            "review_score": "1"
        },
        {
            "review_text": "Yes, a cat is recommending a game with dogs in it... moving on.  It's a funny little adventure game. The story is short and decent enough to deliever, but won't notice till you play a second itme.  The target audience is rather mix; while it looks more appealing for kids, it might be more for teenagers and older as it does give some adult humor here and there, but kids may not notice them as they're subtle. Also, they use the female dog term as it's intended to be... so... something to consider.  Voice acting is good, but at some spots lacks enthusiasm. The music fits the setting and theme. The animation, while limited, gets it's job done and leaves room for the imagination. There's wit and humor in this game, depending who you talk to, interact, or have poor Jolly attempt something.  The puzzles can be a head scracther, but aren't too difficult as they may appear; but if you're really stumped, ask the parrot and feed him a cracker (if you have any) and he'll give you hints to tips or a solution (depending how much you feed him if you find yourself stuck). There is minor back tracking in some circumstances, but that's expected in adventure games.  My only issue, for the achievements anyway, is it's easy to miss a few things that are very well hidden or in places that weren't there originally and won't be able to go back after a certain event till you start over from the start, like finding all the flags or crackers and whatever gets you the highest score in the game. It can be frustrating for achievement hunters, especially since you can't have multiple saves and it only autosaves, but you'll have to grin and bare it if that's your thing.  The price is worth it, overall. I'd pick it up if you like adventure games with a pirate theme to it.  -----  Check out more games I see that deserve more attention from my curator group:  BluePaw's Underrated Games List  Join and/or follow if you wish.",
            "review_score": "1"
        },
        {
            "review_text": "FURRY MONKEY ISLAND  WHAT MORE COULD YOU ASK FOR!?",
            "review_score": "1"
        },
        {
            "review_text": "Simple, cute, amusing point and click. Fun story and characters. I loved playing it.  Scale: 1=despised 2=negative 3=could go either way 4=positive 5=loved  Game design: 4/5 The game is really tight and everything works well. However, there are some extra things needed for 100% that you really have to guess at to accomplish. You need to click everything in every scene twice before you move on to a new area of story because you can't go back, and that doesn't guarantee that you'll find everything because there's no reason for a lot of it. It adds a little replayability because it's a short game, but that's a cheap tactic.  Tone: 5/5 Fun. Cartoony. Pirates. Great things working great together.  Personal skew: 4/5 This is a pretty easy and short game. If you are a hardcore point &amp; click gamer who wants a challenge and for some reason you paid full price for this game, you'll probably feel pretty ripped off. But for me this game was great fun.",
            "review_score": "1"
        },
        {
            "review_text": "This is grade-A 100% pure adventure gaming, ladies and gentlemen. Discoshit.",
            "review_score": "1"
        },
        {
            "review_text": "Light fun adventure game!",
            "review_score": "1"
        },
        {
            "review_text": "Jolly Rover is a perfect example of everything that stinks about adventure games.   The solutions to the puzzles don't always make logical sense; you find yourself just clicking wildly on every item and every square inch of each room until you 'solve' the puzzle. Bor-ing! If the 'humor' was actually funny, or if there was a story to be told, I might have enjoyed Jolly Rover more. But it wasn't, and there wasn't, so I didn't.  Steer clear of this wreck. I suggest the more thoughtful 'Puzzle Agent', instead.",
            "review_score": "-1"
        },
        {
            "review_text": "not worth your money nor your time. There are a lot of indie adventure games more beautiful than this game.",
            "review_score": "-1"
        },
        {
            "review_text": "this is the worst game known to man",
            "review_score": "-1"
        },
        {
            "review_text": "A poor man's Monkey Island. The voice acting and animations are charming. The game is not too hard, and would be a good introduction for someone interested in point and click games. Very cute and very fun.",
            "review_score": "1"
        },
        {
            "review_text": "Jolly Rover is 'point and click' Game. You can combine some item to each other or use Voodoo's magic to solve puzzles. It has some gag and moderate fun. (7.0/10)",
            "review_score": "1"
        },
        {
            "review_text": "Fabulous game in my opinion, would play it again! :) It got a little frustrating at times if there was something you missed and got stuck (I don't like to cheat and use walkthroughs) but that's the same with most games of the genre hey? I like the fact each interactive item had a few different dialogues when clicked, I think I spent quite some time going through them all on everything! (though each one is voiced not just text, so for some I suppose it could become annoying, however a simple click skips his speech). If you like a bit of an adventure, collecting items and putting them together for a purpose, a bit of voodoo lol, or just the fact the game is based on pirates, I recommend this game to you!",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed playing this game. The story was good to follow and it gave me that nostalgia of the old Sierra Online games without being as frustrating. Definitely a must get for all P&amp;C enthusiasts.",
            "review_score": "1"
        },
        {
            "review_text": "My Rating:'★★★★✰'   This is a really fun point and click adventure game. If you're into games sorta like Monkey island then you might really enjoy this one.   It has some really funny humor and it is pretty dark for it's innocent cute puppy dog look. Lots of murder talk &amp; beer drinking in this game. Don't let the cute look fool you, it's a full blown T rated title in my book. Oh and I can't forget the outstanding voice acting in this game. I was really impressed with the voice overs. It made this game super enjoyable to play.  Pirates,♥♥♥♥♥es(literally),boos,murder and bipedal K-9 makes it a real fun play. :^). I really suggest trying out the demo. You might like it.   Difficulty: Not too hard, but some puzzles are thougher than others.  Replay Value: Yes there is some fun to be had over again here.",
            "review_score": "1"
        },
        {
            "review_text": "This is actually a very enjoyable little game. It only takes like 3 hours to beat but then you can play it over with commentary.",
            "review_score": "1"
        },
        {
            "review_text": "It's fun if you like that sort of thing.",
            "review_score": "1"
        },
        {
            "review_text": "Monkey Island with a dog pirate. Cutest game ever.",
            "review_score": "1"
        },
        {
            "review_text": "This point and click adventure took me about 3 or 4 hours to finish. I tried not to cheat or get hints and only needed to twice.  Overall good for what it is, and it was amusing... however at times it was also typical of point and click... sometimes you just combine things to combine them without any logic.   The dialog had voice actors so at least it wasn't all reading. Not bad and casual for those who like this kind of thing.",
            "review_score": "1"
        },
        {
            "review_text": "A pretty good adventure game. The voice acting isn't the greatest, and the game only runs in 800x600, but those are the only downsides that stand out for me, and they're not dealbreakers. It's not very long. I completed my first playthrough in a bit over 4 hours, and I didn't rush through at all. I don't think this is a bad thing, it keeps the story focussed, without too many sidequests and distractions. There's also plenty of hidden goodies to find, but if you're a good adventure player you'll already click on everything, so it shouldn't be too hard to find at least most of them. Still, it's a nice addition. Don't be put off by the dogs. A few puns aside, they could as easily have used humans.  Overall, if you even slightly like adventure games, it's worth the price.",
            "review_score": "1"
        },
        {
            "review_text": "This is an adventure game chock full of charm and wit. Excellent music, pleasant art, and my goodness, is James adorable!",
            "review_score": "1"
        },
        {
            "review_text": "A fantastic point-and-click adventure with intuitive puzzles, great voice-acting, a huge number of branching choices, tons of collectables, and genuine humor. I can't recommend this enough! Monkey Island would be proud.",
            "review_score": "1"
        },
        {
            "review_text": "Sometimes a little too cutesy, sometimes a little too easy, but lots of fun, quirky, and a fling back to the good old days of adventure puzzle games (plus I went to school with one of the voice actors).",
            "review_score": "1"
        },
        {
            "review_text": "Pretty extensive storyline, with multiple different areas to explore. I wish I could go back and load my game at various previous points.",
            "review_score": "1"
        }
    ]
}