{
    "app_id": 58520,
    "name": "Blood Bowl - Legendary Edition",
    "release_date": "2010-10-28",
    "developer": [
        "Cyanide Studios"
    ],
    "publisher": [
        "Focus Home Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player"
    ],
    "genres": [
        "Sports",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Sports",
        "Turn-Based"
    ],
    "achievements": 0,
    "positive_ratings": 675,
    "negative_ratings": 228,
    "price": 7.99,
    "description": "Inspired by the Warhammer Fantasy world, Blood Bowl is an ultra-violent combination of strategy and sports games. The Legendary Edition features 20 playable races, including 11 that are totally new, each offering its own game style! Make a competitive team, train it and buy the best equipment.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/58520/header.jpg?t=1553621680",
    "minimum_requirements": "OS: Windows XP SP3/ Vista SP1/ 7 Processor: Pentium 4 2.4 GHZ/AthlonXP 2400+ Memory: 1GB (XP)/ 2GB (Vista/7) Graphics: 128 MB 100% DirectX® 9 and shaders 2.0 compatible (NVIDIA GEFORCE 6600 / ATI RADEON X700 or higher) Not compatible with SLI. Intel, SIS and Via/S3G graphics controllers non-supported DirectX®: 9.0 Hard Drive: 5 GB Sound: DirectX® 9 compatible Multiplayer Requirements: Internet connection required for online gameplay.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Its a faithful board game conversion that I am certain (despite rampant criticism) does not cheat. Unfortunately, the AI is so bad I sometimes wish it did. Even so, the game is fun in single player and more fun in multiplayer. As for the board game itself, it is strategic and occaisionally random enough to make it interesting. Game balance is kind of wacky (in the board game as well, some teams are difficult to play on purpose) but this only adds to the charm in my opinion. The bragging rights one wins when scoring a touchdown as the Halflings counts as a buff in my book.",
            "review_score": "1"
        },
        {
            "review_text": "I loved this game, Khemris are so fun to play, crushing other players is SO fun! If you liked the boardgame then you must want to get it already, but for the newbies i'll try to describe why this game is so good. The number of teams is really nice because each team represents different playstyle : the humans are pretty much balanced and you'll be able to throw passes or run through the opponent's line whereas elves' playstyle is based mainly on passes and dodging tackles due to their agility, Khemris will try to litteraly crush the opponent's line to get their holder of the ball to the touchdown because they can't do a single pass while gobelins will play dirty by using unconventionnal weapons during the match such as chainsaws, pogo sticks etc... At the beginning you'll be a little lost if you didn't play the board game because nearly nothing is explained, you'll have to read the rules book and that will take you about 1h to get through this but when you master the rules it gets really fun. You should start by playing the campaign mode because that's how you'll learn most easily.",
            "review_score": "1"
        },
        {
            "review_text": "Blood Bowl is an awesome game, full of trolls and orks and violence and football. Or rugby. Kind of a rugbyfootball. I had never played the miniature game, but having grown up in comic and game shops, was exposed to it and always loved the concept. As far as I can tell and from what my buddies tell me, this is very faithful to the core mechanics of the miniature game, as well as the teams available and rules for how to make up your teams.  Don't be fooled by the single player feature, this is a multiplayer game. Unlike most games however, this isn't not a pick up and play game. Don't get me wrong, you can, but this is a game designed around leagues and competition.  There are thousands of laughs to be had and I reccomend this game to anyone who loves tactical strategy titles. When your star player reaches level 5 when most other players in the league are 2 at most, you'll really learn what Blood Bowl is when you watch him die as the medics fail to revive him because an angry fan threw a rock at him.",
            "review_score": "1"
        },
        {
            "review_text": "Love me some Blood Bowl, it really takes me back. I don't quite remember rolling double/triple skulls so often on the board game, though.",
            "review_score": "1"
        },
        {
            "review_text": "I like this game a lot and I even found cake.",
            "review_score": "1"
        },
        {
            "review_text": "I have been a fan of the game since its original version of the mid 80's (which was cardboard cut-outs) and every version since. BB is one of the most well designed games ever produced by Games Workshop, and the classic timed *turn-based* computer version is a faithful emulation of the boardgame. The game has three formats--the classic version of the game, the classic version with some additional rule variants and customization options (which can be fun), and the 'real-time' Blitz version. Of the three versions, the most fun for me is the classic version with or without the variants. I do not enjoy the Blitz version of the game at all. Regardless, the title is worth owning. For me, the replay value is very high and I especially enjoy playing against my son in multiplayer mode.",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun but unforgiving at times. Praying to the Blood Bowl God's may increase your favour and your luck!",
            "review_score": "1"
        },
        {
            "review_text": "  Fun with friends if only i had any but hounstly it is a fun game it's funny and is cool",
            "review_score": "1"
        },
        {
            "review_text": "I have over 500 games in my Steam account, and the vast majority of them are still unplayed. So now I'm dedicating an hour to each of these games and writing a series of One Hour Reviews. An hour isn't very long to judge a game on, so think of this as more of a first impression, and take this review in the spirit in which it's given. Be sure to read other reviews from players who have spent more time in the game.   One Hour Reviews #26 - Blood Bowl: Legendary Edition  I had heard of Blood Bowl, and knew it was based on a tabletop game, but otherwise I did not know anything about it. So going in, I had no idea what to expect.  Since I hadn't played before, I started with the tutorial, hoping it would help me understand how to play the game. After waiting awhile for it to load (longer than I would have expected), it opens with a pair of commentators to explain the rules of the game, with some groan-worthy humor thrown in.  The tutorial starts out simple enough by explaining the basic camera controls, and how to change cameras. Then it covers 'tackle zones' and placing your teams starting positions for the kick off. It also explains the concept of re-rolls, which allow you to re-roll a die result, with each team only getting a limited number of these.  But things quickly get complicated once the actual gameplay starts. The game is filled with all of these different skills that players can have. Each skill acts as a conditional modifier, depending on the situation. For example, when picking up the ball, the game will 'roll a die' and if the roll is too low, then you'll fail to pick up the ball. But, if your player has the 'Sure Hands' skill, then the player gets a second roll when the first one fails.  It seems that pretty much every action in the game has one of these skills associated with it. If I try to pass the ball, there's a 'Pass' skill that lets you re-roll a failed roll. The game also starts talking about stats like Agility, and some kind of 'Agility Table' that is used for skill checks, but apparently you have to read the rules to see that.  Next the tutorial moves onto blocking and pushing past defenders. Now even more skill checks are coming into play. Here the roll is based on the Strength stat, and not only are there skills for influencing the block result, but also whether or not players get injured or not.  As the tutorial continues into movement, dodging and blitzing, and even more die rolls and skills, I can feel my eyes starting to glaze over. By the time the tutorial gets to the first turnover, I am pretty much lost. I'm just kind of reading and nodding along at this point.   Just to give an idea of how quickly the tutorial starts piling on skills, here's one of the things it tries to explain to me: 'Since Krug Painspear has the tackle skill, Jean-Paul mussen is knocked down with a 'Defender Stumbles', even though he has the Dodge skill, which would normally allow him to regard that as a simple push-back.'  The commentators swear that although it sounds complicated, it's all really easy after a few games. I'm not so sure. I'm reminded of this episode of Star Trek where Kirk has been captured by these gangsters, and he introduces them to a card game called Fizzbin. Only the game doesn't exist, and Kirk is making up the rules as he goes, and the gangsters are completely confused as Kirk tries to explain the game. That's exactly how I felt after finishing the tutorial.  So clearly there is a learning curve here. So it comes down to whether or not it's worth spending the time to learn the game. If you are a fan of the board game, then it seems pretty obvious you'll enjoy this as well. If you like tabletop war games in general, and aren't intimidated by rules, then it's also likely you'll enjoy this. But if you are more of a casual player, then this game will likely go right over your head as it did mine.",
            "review_score": "-1"
        },
        {
            "review_text": "To much RNG. If you don't have good luck you literally will not even get a turn :(",
            "review_score": "-1"
        },
        {
            "review_text": "Extermination",
            "review_score": "1"
        },
        {
            "review_text": "Good game.  Singleplayer is not as good but still enjoyable. Multiplayer is my favorite turn based strategy 'experience'.  For 10 bucks you should really pick it up.",
            "review_score": "1"
        },
        {
            "review_text": "It's American Football, Rugby, and Warhammer all rolled into one game. What more could you ask for?",
            "review_score": "1"
        },
        {
            "review_text": "This game is exaclty how blood bowl (tabletop) should be on a pc.  Perfect.",
            "review_score": "1"
        },
        {
            "review_text": "Very long winded and way to many unexplained rules and junk and one match takes years to complete. some of the races are just pointless and suck",
            "review_score": "-1"
        },
        {
            "review_text": "Despite some odd AI issues this is a good representation of the table top game that kept me and my friends amused during our early teens. I'm looking forward to giving Blood Bowl II a shot when it comes out (though I'll probably hold out for the final version or at least the 'Legendary' version if the release schedule is similar to the first). ",
            "review_score": "1"
        },
        {
            "review_text": "The game itself is alright but the thing that brings it down is how it crashes. You can get like 1 game maybe a 2nd but not a 3rd game before it crashes. Since the game doesn't autosave (To what I know) when it crashes you will lose all of your progress, which sucks.  (This is based on a little bit before I wrote this review, so it may or may not useful if they have updated the game)  This game is alright even if you don't fully know how to play. The tutorial isn't to bad for learning the basics.",
            "review_score": "-1"
        },
        {
            "review_text": "A turn based football game set in a fantasy setting. You can manage your team from the lower leagues all the way to the top.",
            "review_score": "1"
        },
        {
            "review_text": "Slow action american football strategy, dont buy",
            "review_score": "-1"
        },
        {
            "review_text": "a good game for bloodbowl fans, for a person who hasnt played the real deal before this, makes me not want to even try it, alot of hassle, really bad tutorial for people that have no clue whats going on , but after ive watched few hours of youtube videos how to play i started to enjoy , the storymode works as a slight tutorial also. But i do say people should try it out if theyre fan of american football and tactical gaming",
            "review_score": "1"
        },
        {
            "review_text": "Seriously, I either want to play some Madden or crush orcs. Not both.",
            "review_score": "-1"
        },
        {
            "review_text": "Like the Boardgame !! Awesome !! Hate it or love it !!",
            "review_score": "1"
        },
        {
            "review_text": "YES Buy the game its amazing, i just play oniline all the time, just make sure you got a good connection, if you are having a spotty connection day dont play server has fits and will kick you from your game.",
            "review_score": "1"
        },
        {
            "review_text": "quite hooked on this. miss the old board game ",
            "review_score": "1"
        },
        {
            "review_text": "You're expected to actually go out and buy physical copies of the rules, which the game will not otherwise explain. That's about all I have to say.",
            "review_score": "-1"
        },
        {
            "review_text": "Others would say this game is a good one, but I say, nope.  Here's why: RNG is not random at all. There's no random anything, because I've seen dice rolls before, for this game on table top, and they aren't nearly this one sided even in the worst of cases (mini wargaming has videos with them playing this table top version, and even then they aren't nearly this bad). Difficulty setting? No reason to lie, its hard, extra hard, might as well not play. Actually, I'm wrong, it goes: don't bother, don't bother, don't bother. No change to difficulty changes any part of the game. Meaning that you put it on easy? It's still going to bend you over, put it on hard, it still, guess what, bends you over. They make dodge after dodge, gfi after gfi, single dice blocks and double against and nothing happens. The player? First dodge fails, or second dodge fails (I haven't done double dodge moves because of this), single dice blocks are attacker down 90% of the time, rerolled into attacker down or both down, and double against? Might as well buy another player at that point.  This is the worst case of RNG I have seen in a game, in forever. There's no reason the dice couldn't be actually ballanced or the rolls be actually random.  I wouldn't buy anything from this dev, so long as it's a game that's supposedly an adaption of a table top game. Since they have BB2, and the reviews are down right ugly for that game, I will not be purchasing or playing this game again.  And if you've gotten this far, and wonder how someone could say such things about this game without playing it for a while? Look at how many hours I've logged, and you can see I have given this game way more time than it actually deserves.  1/10. The one is for graphics, since these, although clunky and weird at times, do make the game look semi nice.  I urge you, as a final note, not to get this game if you haven't already, and if you have, don't get BB2, you can read their reviews and see the issues, but lets face it, they took a turd, polished it, and handed it back to you... What's that saying? Polish a turd, its still a turd?",
            "review_score": "-1"
        },
        {
            "review_text": "It's not worth what you pay. Even on easy mode, everything's against you from the start, the dice all seem loaded, it seems there's not a single roll made wrong on the opponent's team while everything you do is blocked or countered 90% of the time. For a fun game, one that makes you want to play it again, or to have any real value to actually giving it the time of day... Blood Bowl fails, and it does so epically.",
            "review_score": "-1"
        },
        {
            "review_text": "Dice based game is not fun. It degenerates into you failing dice rolls constantly. It is slow boring and does an awful job of actually telling you how to play. To put it simply it sucks.",
            "review_score": "-1"
        },
        {
            "review_text": "If you have ever played the tabletop version of BloodBowl, this game follows the mechanics very closely. Moving can take a little getting used to and the menus are a little clunky.... but you won't lose any pieces.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game if you have ever played Blood Bowl before. Can't wait for Blood Bowl 2 to come out",
            "review_score": "1"
        },
        {
            "review_text": "This game ALMOST goes in my 'Absolute ♥♥♥♥' Category, if it weren't for the game being fun at times....... and by 'fun at times,' I mean when played against yourself........ all and all, I would give it 6/10",
            "review_score": "1"
        },
        {
            "review_text": "If you're familiar with the board game, can get it on sale, and get a friend to occasionally play with you it's a great game! All the customization and rules of the board game, without all the hassle of eraser marks on paper! However, the pacing is rather slow, and the computer AI (even on the lowest setting) is rather brutal. Still, fun for fans of the board game!",
            "review_score": "1"
        },
        {
            "review_text": "You'll spend more time watching this game than playing it. The interface is clunky, the mechanics ponderous, and the dice rolls wholly arbitrary. What should be tactical turns out to be luck-based more often than not, leaving you watching the dim-witted AI labor about the field for another ten minutes. If I'd paid list price for this instead of picking it up in the Humble Bundle, I'd be punching myself in the balls right now.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a good game in principle (although very hard to learn as the tutorial is awful and there's no 'help') but ultimately rendered unplayable by a series of terribly frustrating bugs causing a variety of crashes, endless loops and non-functional features. When you're burning so long trying to finish again with no way to save and reboot, it's pointless. Not impressed.",
            "review_score": "-1"
        },
        {
            "review_text": "Very bizzare, somewhat confusing and the graphics seem a bit dated, but very fun and has a very interesting concept. However, buy this when it is cheap because unless you are HARDCORE fan of the board game or Warhammer, this is not worth $40.",
            "review_score": "1"
        },
        {
            "review_text": "The best game in the whole entire world.  Right here.",
            "review_score": "1"
        },
        {
            "review_text": "Hey! You like action! You like advetture!? You like ♥♥♥♥♥♥ football rpg's, we me ♥♥♥♥ing neither. Avoid this game like the plauge. Avoid it like its AIDS, avoid this game like its super Aids's Aids Aids. This game is ♥♥♥♥. I'd rather ♥♥♥♥ Rosse O Donnel that play this ♥♥♥♥ again. Waiste of god damn money. Would have rather spend that money on charity or some ♥♥♥♥. ♥♥♥♥ this game. 10/10 would play again.",
            "review_score": "1"
        },
        {
            "review_text": "Extraordinary game, really fun to play. An updated graphic version could be neat, but if you want some fun with CabalVision , it is the game :)",
            "review_score": "1"
        },
        {
            "review_text": "An amazing yet infuriating game set in the Warhammer universe. Blood Bowl takes a turn based approach to American Football and with the help of a unique roster of 20+ races and factions, turns it into a violent and chance based struggle to the endzone. The less patient or and those easier to become enraged at RNG may not like it as you live and die by the dice and a single bad role can turn something as innocent to trying to pick up the ball into a bloodbath with multiple players dead and the enemy right at your endzone for the next turn. However, those that play and enjoy the game will learn and be able to do amazing things like kill the ball carrier, then retrieve the ball with another player, pass it to the team's star gutter runner (if you built a skaven team) and have him run all the way down the field dodging numerous defenders... only to break his neck when he trips in front of the endzone since once again, you live and die by the dice.",
            "review_score": "1"
        },
        {
            "review_text": "A great game if you hate yourself and don't like to win at things.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, very addictive.",
            "review_score": "1"
        },
        {
            "review_text": "Blood Bowl, reputedly, is the toughest of all sports.",
            "review_score": "1"
        },
        {
            "review_text": "any fan of Warhammer should be getting this, anyone who has a healthy sense of humor should too, then everyone that appreciates a good game, also get this.  it is simply an amazing game.",
            "review_score": "1"
        },
        {
            "review_text": "Calling all Blood Bowl Board Game players. You have to buy this, and play the classic mode, it's hours of fun! It's the chance to play the board game against a computer or other players, if you love Blood Bowl the board game, you'll love this :)",
            "review_score": "1"
        },
        {
            "review_text": "I bought Blood Bowl in a steam sale for just over a fiver. It's great. Very addictive, incredibly deep and just damn good fun. Strategy meets sports in a bloody mixing bowl of legends...or something.  Busy online community with loads of leagues for competitive play and a lot of options for building your own team any which way you like to test yourself against coaches form all round europe.  Bulging single player with a lot of games and modes and stories and campaigns as well as the multiplayer where you can get a mate round and play hot seat taking turns or go online. This will keep you busy for a while.  Love it.",
            "review_score": "1"
        },
        {
            "review_text": "You can kick a knocked out daemon with a goblin, killing him. I mean, come on.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "I loved this game, Khemris are so fun to play, crushing other players is SO fun! If you liked the boardgame then you must want to get it already, but for the newbies i'll try to describe why this game is so good. The number of teams is really nice because each team represents different playstyle : the humans are pretty much balanced and you'll be able to throw passes or run through the opponent's line whereas elves' playstyle is based mainly on passes and dodging tackles due to their agility, Khemris will try to litteraly crush the opponent's line to get their holder of the ball to the touchdown because they can't do a single pass while gobelins will play dirty by using unconventionnal weapons during the match such as chainsaws, pogo sticks etc... At the beginning you'll be a little lost if you didn't play the board game because nearly nothing is explained, you'll have to read the rules book and that will take you about 1h to get through this but when you master the rules it gets really fun. You should start by playing the campaign mode because that's how you'll learn most easily. Final flaw : sometimes you just wish to play real american football ^^ (and maybe you'll find the commentaries getting a little bit old after a bunch of hours of game)",
            "review_score": "1"
        },
        {
            "review_text": "Blood Bowl is my most favorite board game. This well-polished PC version is very faithful to both the rules and the feel of the Warhammer world. It is a must-have for any Blood Bowl fan!",
            "review_score": "1"
        },
        {
            "review_text": "Blood Bowl: Legendary Edition is a fantasy football video game with the option for turn based or real time game play. This game is an expansion to Blood Bowl that was developed in 2009 by Cyanide and published Focus Home Interactive and is based on the board game 'Blood Bowl' that is produced by Games Workshop.  Blood Bowl: Legendary Edition has a great variety of game modes available for both single player and multiplayer that will keep you entertained for days providing the dice gods don't come down on you too harshly. It is however recommended that you play using Classic mode and playing using turn based due to the fact that blitz mode is an awful edition to the game since it does not fit in well and functions clumsily.   There are a 20 races to choose from in Blood Bowl chaos edition and helps to add a nice variety to the teams for come up against, some races share similar players but overall there is a lot to choose from and picking what team you want to play as can take quite some time.  It is recommended that you purchase Blood Bowl: Chaos Edition due to it having a similar price depending where you purchase it from and adding an extra 3 races for you to play.  Blood Bowl: Legendary Edition graphics are perfectly suitable for what it is trying to achieve and generally looks visually pleasing and adds a fair amount of detail into the surroundings and units, for a game made in 2009 you defiantly can't complain about the graphics.  On lower difficulty settings the AI make irrational moves that tend to lead to costly mistakes, while the higher levels of AI provide some challenge but you most likely will want to look for opposition using multiplayer.  If you want a faithful recreation of the board game Blood Bowl this is the only video game you should currently choose to try out due to the fact that it is quite high quality and is a quite compelling experience overall. I highly recommend that you give this game a try if you like a challenging board game-esque strategy game.  Rating - 8 - A must buy!   Advantages  - Compelling Game play  - Lots of variety - The best of its kind on the market   Disadvantages - Irrational AI at lower difficulties",
            "review_score": "1"
        },
        {
            "review_text": "A fun, if frustrating, game of risk management. Just never play Dwarfs ever.",
            "review_score": "1"
        },
        {
            "review_text": "A fantastic re-creation of the original board game. Great fun, lots of strategy and well worth a play or two. If you are thinking of getting this, yes, it's very good once you understand how to play, but get the Chaos Edition. It's usually a bit more expensive, but it has almost all the teams and new updated rulesets. A much better experience all round",
            "review_score": "1"
        },
        {
            "review_text": "Blood Bowl is an interesting concept and has huge potential, but the single player campaign is punishingly difficult thanks to slavishly following the rules of the board game. Let alone which, the difficulty selection is bass-ackwards; if you set the difficulty to Easy, the opposition will take more chances, and as the game relies on the luck of the dice-roll, this means they'll do better. However, while the randomness of dice-rolling is a weakness in single player, I could see it being a massive benefit in multiplayer. It's just a shame that I have no desire to play this game competetively whatsoever.",
            "review_score": "1"
        },
        {
            "review_text": "If you like football/rugby, turn-based strategy games, and Warhammer or at least two out of the three. Then you should get this or Chaos Edition.",
            "review_score": "1"
        },
        {
            "review_text": "The classic mode is just like the board game, since it essentially is the board game. Having AI opponents is great for when you want to learn how to play and get through a campaign relatively quickly.  Since it's based on an already awesome game, I fully recommend this to anyone who likes turn-based RPG-style board games about fake sports in which players are routinely crippled or killed.",
            "review_score": "1"
        },
        {
            "review_text": "Good game with friends but campaign mode goes on forever and gets quite repetitive.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, very true to the GW classic.",
            "review_score": "1"
        },
        {
            "review_text": "It's alright, but it's hard to learn and everything's a bit vague, it was worth the £1 I spent on it I guess.  6/10",
            "review_score": "1"
        },
        {
            "review_text": "DO NOT BUY. It is rubbish.  This is one of those games where the computer can miraculously pull off game-winning dice rolls ad nauseum and your own rolls are consistently short of what you need. This is not a recipe for happy players.",
            "review_score": "-1"
        },
        {
            "review_text": "I like this game because I win when my opponent's players decide to kill themselves when going for a tackle  Gg, easy",
            "review_score": "1"
        },
        {
            "review_text": "i tryed hard, but i cant beat AI in turn-based. and realtime isnt really fun",
            "review_score": "-1"
        },
        {
            "review_text": "Blood Bowl is one of those games that is hard to determine if you should recommend it or not. Humour is good, gameplay isn't bad either, yet sometimes the game gets just too infuriating for some reason. So I'm going to list the pros and cons of this game, and you can make your mind yourself.  Pros: Good dose of dark humour from the two commentators. Great variety of teams/races to play with. Different play modes, and you can even edit the rules. Blood, violence, and random, untinkable, kills (an elf single-handedly killing a minotaur? Who knew?) Lots of skills, equipment, etc.  Cons: Steep learning curve. Curve is so steep, it could be called a wall. Yes, the tutorial explains most of the gameplay, but there is too much 'For this, reffer to the manual'. Said manual is about 80 pages... Evasion system is maybe too easy. With 4 Agility (base Agi for Agi-based players), there is just about nothing that can stop you Battle system can also be somewhat flawed, as if you are against a strenght-based team, they will only put all their players around the one carying the ball, and due to the odds, you are very unlikely to stop even one of them.  Long story short, if you play this game, expect to lose, expect to get frustrated, expect that what you though to be a good strategy was a bad one. If you are unsure, buy this game while on sale, as it often seems to be.",
            "review_score": "1"
        },
        {
            "review_text": "A game for everyone who likes to play some turn-based strategy, plan tactics and kick som butt!",
            "review_score": "1"
        },
        {
            "review_text": "Very fun. Can't bring myself to get past lvl 2 of story, because the human team's name is The Marauders. The football team I play for is named The Marauders as well. Shame.",
            "review_score": "1"
        },
        {
            "review_text": "If recommend this game to anyone with the patience to take some RNG arrows to the knee. At times the random role can be infuriating but no more than any game involving a dice roll!   It's clunky but a fairly faithful board game adaptation and the league play with friends is brilliant (once you've got it working).  Once you accept some basic strategies (like taking active that don't involve a dice roll first), and that your team will suffer injuries, deaths, bad luck, and start off completely rubbish... the game opens up and is a huge amount of fun.   Would recommend over the sequel at the moment as it appears single player is better and you get more teams for your money.",
            "review_score": "1"
        }
    ]
}