{
    "app_id": 58550,
    "name": "A Game of Thrones - Genesis",
    "release_date": "2011-09-28",
    "developer": [
        "Cyanide Studios"
    ],
    "publisher": [
        "Focus Home Interactive",
        "1C-SoftClub"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Achievements",
        "Steam Leaderboards"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "RTS",
        "Fantasy"
    ],
    "achievements": 75,
    "positive_ratings": 201,
    "negative_ratings": 420,
    "price": 6.99,
    "description": "Immerse yourself into the battles and intrigues between the Houses that shaped the Kingdom of Westeros and keep your spot on the Iron Throne by any means.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/58550/header.jpg?t=1447353977",
    "minimum_requirements": "OS: WINDOWS XP SP2/VISTA SP1/WINDOWS 7 Processor: AMD/INTEL DUAL-CORE 2.2 GHZ Memory: 1024 MB (XP) / 2048 MB (VISTA/7) Graphics: 256 MB 100% DIRECTX 9 AND SHADERS 3.0 COMPATIBLE.  ATI RADEON X1600 XT/INTEL HD/NVIDIA GEFORCE 6600 GT OR HIGHER DirectX®: 9 Hard Drive: 10 GB Sound: DIRECTX 9 COMPATIBLE Internet: INTERNET CONNECTION REQUIRED FOR ONLINE GAMING AND GAME ACTIVATION",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "A fun little juant through the broad strokes of pre-book era Westerosi history. A fun little game, but certainly not a deep and strategic RTS, more of a set-piece manager- moving specially skilled units around to build and maintain alliances is the heart of it, with actual declared war working in a very similar mechanic. Still, depsite the simplistic and somewhat sophmoric gameplay, the game shines with great lore and setting, and should reward loyal fans of the Books and Show.  Make sure you get this on sale, it is certainly not worth a full retail price, offering low replay and a 12 hour or so campaign. Someone looking for a more deep and strategic RTS experince in the GoT world would want to check out the great mods for Civ5 and CKII. The former is a world class standard and far better for war and battle while the latter offers an immersive strategic experience in the delicacies of politics, marriage, and subterfuge. Game of Thrones: Genesis attempts both but really only succeeds in atmosphere. Remember that Halo RTS? Like that, except Game of Thrones and far less exciting.  In summary:  - good graphics and polish - rewards fans of the lore - simplistic &amp; arcadey RTS gameplay - no real depth to game beyond faction 'unique' units - campaign is fun and short - low replayability - not a serious RTS - still a fun little game for fans, if bought for a low sale price",
            "review_score": "1"
        },
        {
            "review_text": "If you like sean bean, he isn't in this game.",
            "review_score": "1"
        },
        {
            "review_text": "Its not a bad game as such, it had a lot of good ideas and concepts but unfortunatly it was not executed especially .",
            "review_score": "1"
        },
        {
            "review_text": "I personally couldnt get into the game, though it was more like I didn't have time to get into it, the game requires a lot of time to get used to as it is more than your simple strategy game and massive armies, its all about the backstabbing and the politics that come with the iron throne, if you have the time and would like to see westeros be molded the way you like, I highly suggest it, but if you are looking for a simple RTS, this is not for you",
            "review_score": "1"
        },
        {
            "review_text": "I was a little dubious that this could be another quick cash in on a popular franchise, and while gameplay can be tedious and repetative at times it's true to the lore and a primarily a fun game to play.  If you're a casual gamer, I'd avoid it. But if you like your games to require deep concetration on the whole map, and your a fan of Martin's works, then pick this up  (Especially since, at time of writing, it's only 3.74 in the sale!)",
            "review_score": "1"
        },
        {
            "review_text": "Don't let thoese screenshots fool you , this game is a joke made by amateurs .",
            "review_score": "1"
        },
        {
            "review_text": "DO NOT BUY THIS GAME!! EVEN if you are a Fan of Strategy and war games, or a fan of the show itself, this game might not be for you. This GAME HAS POOR mechanics, and without a doubt a very complex and confusing gameplay functions. Although the graphics reminds me of Age of Empires, Rise of Nations, this game is nothing like it. It's poorer in quality and taste. Waste of $40.",
            "review_score": "1"
        },
        {
            "review_text": "This game is rough. It has some interesting ideas about how to do video game diplomacy and intrigue, but those ideas are undeveloped, and make the interaction between the houses of Westeros feel like the mere shuffling around of RTS game pieces. It does have an admirable commitment to the series lore, but to get to the lore, you have to play through a dreary campaign which includes frustrating escort missions. You can control a Targaryen dragon, and it feels pretty powerful, but the actual mechanics of doing so are excessively 'gamey' (your dragon has a recharge time, making it less a creature of legend and more of an occasional special ability).  The presentation of the game is subpar, with a lot of tiny details that are just 'off' enough to pull me out of the experience. And the RTS mechanics are a bit undercooked - there's not a lot of unit diversity (or distinctiveness to the units that exist) and the tech tree, such as it is, is mediocre. The most interesting part of the game is the specialized intrigue and diplomatic units, and even then, I find the challenge of not knowing which alliances are real or which units are loyal to be more of a test of mental endurance than a genuine political-style puzzle.  The game is not entirely without merit, but I would not recommend buying it without first seriously lowering your expectations.",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this game the day it came out, however many years ago now. I'm still mad at this buggy worthless cash in. This was the game that taught me to be a better/smatter consumer.",
            "review_score": "-1"
        },
        {
            "review_text": "I try my utmost hardest to never give a thumbs down, I really do.  I have always been a fan of real-time strategy games. I also fell in love with A Song of Ice and Fire when I watched the first season, then immdiately consumed the 5 current books. When this game launched, I was so excited and thought it would be a fantastic game.  Sadly, it was not.  The micromanaging in this game is seriously absurd if you are used to playing ANY other strategy game.  You do not engage in 'battles' per se. From the screenshots it really looks like you can have units engage in battle like in the Total War series. That does not happen here. Instead, you have very specific units scurrying around the map. Send envoy here; send assassin there.   The feedback and interface in-game is horrendous, it is very difficult to keep track of things.  Honestly, avoid this game, even if you are THE MOST die-hard fan of GRRM's work.  If you want a FANTASTIC, lore-friendly (and supplementary) game, look at: The RPG version     That one has actual meat you can sink your fan-driven teeth into.   This one, sadly, is a great disappointment and I sincerely hope no one else wastes their money on this.",
            "review_score": "-1"
        },
        {
            "review_text": "Worst strategy game ever made. It would take all day to explain how much I hate this game. It was nothing but a cash grab, game of thrones as far as games go... is a dead end. No studio is taking it seriously and the owners of the IP and just trying to ride the cash cow instead of worrying about their franchise long term.  Do not play this game.",
            "review_score": "-1"
        },
        {
            "review_text": "No... Dont",
            "review_score": "-1"
        },
        {
            "review_text": "I like GoT but i hate this game lol don't bother with it waste of money.",
            "review_score": "-1"
        },
        {
            "review_text": "boring",
            "review_score": "-1"
        },
        {
            "review_text": "Awful. Poor tutorial. Barely recognizable as anything related to ASOIAF save for the house logo's.  I wouldn't recommend it even to the biggest GoT fan.",
            "review_score": "-1"
        },
        {
            "review_text": "I can't believe I paid full price for this game when it came out. What a dumb move.  This is basically a prettied-up phone game, with no redeeming qualities.",
            "review_score": "-1"
        },
        {
            "review_text": "Ugh why can't they make a decent game for such a great series. They have a tota war for warhammer for crying out loud. And that 'fantasy' was blasted by a giant rock.",
            "review_score": "-1"
        },
        {
            "review_text": "I managed to play 36minutes of this before switching it off and unistalling.  The title is what sells this game to people nothing else. Avoid.",
            "review_score": "-1"
        },
        {
            "review_text": "To some people this game might be the dream of all times, to me though it's boring as hell, the only thing it's about is placing spies in other peoples settlements. Good Strategy game, lacking combat, decent grapichs, lacking any kind of story line.",
            "review_score": "-1"
        },
        {
            "review_text": "Jeez, what a sack of siht. I mean, I really can't say anything more about this train wreck. Taking a fantastic opportunity like this and just smearing dirt all over it. Seriously, just go and get a mod for another better executed stratergy game. Barely any differance in factions and the gameplay just feels repetitive",
            "review_score": "-1"
        },
        {
            "review_text": "If you are looking to have some GoT related fun...stay away from this game",
            "review_score": "-1"
        },
        {
            "review_text": "I Love  A Song of Ice and Fire  novels and have been enjoying the Game of Thrones HBO series. This however, is more like  A Thong of Lice and Mire  The only reason I have 5.9 hours on record is because after the first time I played it put me to sleep for a whopping 4.9 hour nap! WTF?",
            "review_score": "-1"
        },
        {
            "review_text": "Extremely boring! Don't buy.",
            "review_score": "-1"
        },
        {
            "review_text": "sucks donkey ♥♥♥♥♥, seriously it sucks them with puuuuuuuuuuuuure ferocity. Fortunately I didn't buy this, it came free with the purchase of GoT RPG Unfortunately I bought GoT RPG.... That game sucked too, not as terribly bad as genesis, but pretty terrible. I wish my 20 dollars on L4D2 sooner than on this.",
            "review_score": "-1"
        },
        {
            "review_text": "I am die-hard fan of books, but i couldn't stomach this game. While the concept is good, the world feels the same as in books, and there're many great ideas for an RTS game, the execution is sadly awful. I really wanted to like this game, but ... no way. Outdated graphics, no AI to speak of, bad controls/interface, poor combat, no tactics.  It's much better to buy Crusader Kings 2 and play Game of Thrones mod.  Overall it would be nice game around 1999, but I'd still rather play Dune2000 over this turd.",
            "review_score": "-1"
        },
        {
            "review_text": "I would not recommend this game AT ALL. I am a huge fan of the books, and have been since 2005. I love the show, collect the works by Valyrian Steel, and have read more of Mr. Martin's work other than A Song of Ice and Fire. Why he let this game become a reality is beyond me",
            "review_score": "-1"
        },
        {
            "review_text": "This game is bad. Really bad. One of the worst I have ever played in 20+ years of gaming. And they were selling it for $49.99! Seriously, save your money, because you can't get your money back from Steam for a Steaming pile like this game.",
            "review_score": "-1"
        }
    ]
}