{
    "app_id": 58560,
    "name": "Runaway: A Twist of Fate",
    "release_date": "2011-04-21",
    "developer": [
        "Pendulo Studios"
    ],
    "publisher": [
        "Focus Home Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "Point & Click",
        "Mystery"
    ],
    "achievements": 0,
    "positive_ratings": 191,
    "negative_ratings": 34,
    "price": 6.99,
    "description": "Runaway: A Twist of Fate is the adventure game of the year! Featuring a production worthy of a big 2D animated movie, Runaway follows a story full of twists and turns, and packed with comical highlights. All in all, you will be confronted with more than 200 mysteries and puzzles to keep your brain running through a big adventure that you...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/58560/header.jpg?t=1447354126",
    "minimum_requirements": "OS: Windows XP SP2/Vista SP1/Windows 7Processor: Celeron 1.7GHZ/Duron 1.6GHZMemory: 768 MB (XP)/1GB (Vista/7)Hard Disk Space: 8 GBVideo Card: 256 MB 100% DirectX 9 Compatible (1280x720 MINIMUM) ATI Radeon 9800/Intel GMA 3000/Nvidia GeForce FX 5900 or Higher*DirectX&reg;: DirectX 9Sound: DirectX 9 Compatible*SIS AND VIA/S3G Graphics Controllers Non-Supported",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "The twist is that they somehow fixed the series, but was it just in time?  Firstly, Runaway: A Twist of Fate is the third and latest entry in the Runaway series, the point-and-click adventure series by Pendulo Studios where you follow Brian Basco - a shy physics nerd turned into a confident adult capable to stand up for himself - and his attractive girlfriend, Gina Timmins, in their Hollywood-like adventures which take some evident inspirations from a couple of known classics, like Broken Sword in particular.   Split into a couple of acts, this time around the story starts off from nowhere with absolutely no connections to Runaway 2’s ending: Brian is dead and he left a cryptic message to Gina who was supposedly still trapped in some sort of water tank in the previous game. For the first time in this series you take control of Gina, which oddly enough feels like breath of fresh air for this series despite this mechanic being nothing new to the genre. Not only that, but the biggest complain I personally had with this series was how useless Gina was as a character in the past by bringing nothing to the story other than an incentive for Brian to save her -- damsel in distress at her finest. It also did not help her being off-screen for at least three quarters of a game each. But the developers have finally listened and addressed this issue with a newly rewritten Gina who can be clever, reliable, and funny whilst still retaining her woman qualities.  So as Gina, it is your job to find out what actually happened to Brian as you deduce that he is not actually dead. From there on, the story starts building up piece by piece into a satisfying adventure worthy of its title with enough thrills and detective work to suck you in; you really want to know what happens next. I do not know what kind of sorcery the folks at Pendulo Studios dealt with, but whatever it was, the narrative in particular is a massive improvement over the previous games. It has a certain cinematic vibe to it which works surprisingly well with what Runaway: A Twist of Fate is going for, but perhaps the best part is how you are given a certain degree of perspective from different characters on how the plot develops (or developed in the past events) over the course of the game. Without any major spoilers though, the ending does feel somewhat unsatisfying considering the events that occur in the game, even despite being a throwback to Runaway 1’s ending. At the end of the day, considering how Runaway 1’s plot took a while to hook you and how Runaway 2’s was a trainwreck after the first two or so acts, Runaway: A Twist of Fate shows that this series is capable of consistently adequate writing. In actual fact, this is perhaps the most serious Runaway game from a plot standpoint due to its evident shift in tone, but at the price of also being the most mundane from the series as it cut down on the supernatural nonsense and the number of cheesy scenarios. Therefore, fans of the original might miss some of that wacky trademark whilst those who despised Runaway 2’s “Indigo Prophecy”-like approach in storytelling might go through sensations of revelations. Cutting it to the chase, the plot is simply a retcon of the entire story of the series.  Where Runaway: A Twist of Fate truly shines is perhaps when it mocks itself. There are plenty of hilarious, tongue-in-cheek, moments and references where it acknowledges how cheesy the previous Runaway games were and even questions the clichés of the point ‘n’ click genre. Realistically, becoming self-aware of itself should have ruined any of the immersion that the game has to offer, but it actually works in its favour to drive some of the humour from this comedy-oriented flick. Still, when it works, it can generate a chunck of laughter.  Visually, the cartoonish hand drawn backgrounds in here still maintain the unique aesthetics of the series, although they do feel subjectively less memorable (than in Runaway 1) and not as vibrant (as in Runaway 2) this time around. Locations and scenes, which in fact are far less than in the previous two games, are more constrained and definitely a lot smaller in size than before. Furthermore, they are also not as exotic as before since most of setting is mainly based in urban locations. One major criticism in regards to the drawings is that some of the rooms or objects were drawn at really odd angles in respect to the camera, so to speak, making them feel out of place sometimes. The character animations are also much better now.  The puzzles follow the tradition in the Runway series of doing plenty of pixel-hunting and every so often nodding at their illogicality when characters have to “improvise” their way. For our sanity, the developers finally listened to the criticisms received from the previous games and implemented a clever hint system which gives clues (not full solutions) to the player at any given time, along with the ability to highlight all the hotspots in the scene. This allows for a smoother experience than the previous entries without hindering much of the story’s pace. As result, this becomes the easiest and shortest Runaway to complete, clocking around 6-8 hours at most. The only noticeable annoyance with some of the puzzles is when acquiring items before any real motive, thus making certain actions not sequentially logical. This, sadly, ruins a bit of the immersion that is being built. Other than that, Runaway: A Twist of Fate has probably the best puzzles compared to the other two with less temptations of looking up a walkthrough.  As with the shift in tone, the soundtrack returns to the vibes accustomed from the original game which is a satisfying feeling for anyone who unashamedly enjoyed it, especially for its cheesily sang theme tune with synth-guitars. Talking about the audio, gone are the days when you were hearing someone talk as if they were doing so through a tin can, so it is, again, relatively better in most parts than in the previous games. But the most notable observation is the change in voice actors. For instance, Brian does sound different this time around. So you may like this change or not, but I did not find any problems with the new voice actors as far as I am concerned.   In conclusion, Runaway: A Twist of Fate is easily the best and most polished entry in this series, but sadly not the ultimate Runaway experience in my eyes. The way I personally see it is that it spends too much time doing a retcon of the entire series rather than bringing something new to the table. Many of the new features and improvements implemented in here were already present in other similar games of its genre many years prior this. It might as well have been called Runaway 3: The Apology Letter To Fans instead. The only thing that Runaway: A Twist of Fate did was to catch up with modern standards. By fixing many of the series glaring issues (which is commendable), it lost a bit of its charm that made it stand out to other adventure games from its genre, whether you liked it or not. Just when it finished cutting all its badly grown weeds, it ended. Still, I am recommending this game to anyone who fancies a point ‘n’ click adventure game with a good narrative and doable puzzles as it is easily the most accessible of the three games. Luckily, it does not require to have played the previous two to understand the story and recurring characters as everything is explained in it, but in lesser detail. For a better understanding, do play the previous two even if you have to endure their respective flaws.  I believe Pendulo Studios learnt a lot from this experience and I strongly believe, based on how this game played out, that Runaway 4 would have been that ultimate Runaway experience I am craving for. Retain the design polish of this game, but bring back some of those wacky charms of the original.",
            "review_score": "1"
        },
        {
            "review_text": "A fun and lovely looking adventure to be sure, packed full of Pendulo's signature bizarre characters. That said, this final game of the Runaway trilogy has considerably scaled back that casual, oneiric insanity that made The Dream of the Turtle so wonderful -- and as a great lover of pleasantly mad things, I find that ♥♥♥♥ing tragic. Also, A Twist of Fate is about half as long as that game. No, I still recommend this . . . I just can't comprehend what made Pendulo choose 'good' over 'awesome' this time around.",
            "review_score": "1"
        },
        {
            "review_text": "Great point &amp; click game if you liked the others two Runaways. I only found a glitch, played on windows 10.",
            "review_score": "1"
        },
        {
            "review_text": "Silly combinations, a lack of humor or interesting story, this is one of the weaker 'click everywhere' games I've played.",
            "review_score": "-1"
        },
        {
            "review_text": "Not bad at all, much easier thant the firts two, but still nice! love all the runaway games!",
            "review_score": "1"
        },
        {
            "review_text": "The game is OK for an adventure game, however, it has its flaws.  I could not get dragged into the story at all, as I did not cared too much about the main characters. The game starts with the fake funeral of the series main character. The further you get into the game the more plot holes you might spot. As usual in these kind of games, you march on by stealing from people, and distracting people.  Humour is a main part of the game, with a lot of jokes referring to pop culture, e.g. the swap scene in Raiders of the Lost Ark as seen in the promo video. Somehow, these jokes fell flat to me.   Puzzles are of the dialogue and inventory types and no logic or mathematics puzzles. There are only two actions to take on each hotspot on the screen: look and use. Some of the solutions are odd, and some of the situations that arise from those solutions are too. For example, combining a large stick with a ribbon and a disc cutter in order to be able to remotely cut through steel probably does not work in real life. Not every item in the inventory needs to be used.  Hints are provided in-game, and these ones are often useful. Hotspot locations are highlighted at the press of the F2 key. My main gripe with the game is that some screen transitions are not hinted by the mouse cursor. First example of that happens on the second chapter, where you enter a large room. If you click in a nowhere region, you then can see another section of the room. I felt the lack of hotspot in these cases confusing.  Graphics are crisp and vivid, with characters being prerendered. There is an over emphasis on using video.   Voice is everywhere in this game, with lots of extra dialogue that might not end in anything. Many items do even have two different descriptions. Voice acting in spanish was OK, although two or three different lines were spoken with wrong effects being applied, e.g. talking through a telephone was not consistant.  Technically speaking, the game handles screen resolution in an odd manner. The game is drawn at a single resolution, but allows you to change it. A graphical artifact appeared when I used my screen native resolution - two cursors were shown, one for the location at the native resolution and another for the position of the unscaled game resolution.  As a concluding remark, this game is an OK game to me. There was nothing too good or too bad that could deter other people from playing it.",
            "review_score": "1"
        },
        {
            "review_text": "First and foremost - yes, A Twist of Fate is a fitting conclusion (?for now?) of the Runaway series and a quite good, though not great adventure game on its own, well worth playing.  Now that that's done, onto the game. Pendulo seems to have sorted out most though not all complaints from the original elegantly - yeah, the pixel hunting's there, but items can be highlighted now, which helps. Especially with those parts where two pieces of the shelf, labeled the same can be interacted with separately. The gameplay is typical Runaway trigger-happy affair where you need to examine everything, sometimes multiple times, and, often, try everything without much logic initially, but logically retroactively, and, well, slightly more realistic than some (why would you take random thing A until you really need it). I got stuck maybe 3-4 times, and was helped in all but one case (at the beginning), maybe two, by the in-built, nicely integrated and executed in-game hint system you can access at will. Those 'I have no idea what needs to be done' moments are thus reduced to a bare minimum. Muliple users (with password protection) are allowed, so if someone is in need of that (families, roommates, etc), a plus for them.  So, yeah, the game is much more easy than the last two sequels, and also seems to be much shorter. Steam says I spent 10h on the second installment and 5h on this one, only partly due to AToF being easier. 'Playing areas' are smaller for the better part, so it's easier, in those (few) moments where you end up just trying to combine everything with everything, to progress. The story is generally well written and more or less satisfying, answering most if not all the questions left hanging in the air after the second installment. The fourth wall is broken multiple times, and self-ironic bits are commonplace, which is cute. Controlling different characters helps too, no stagnation really.  Pendulo's attention to detail (graphical mainly) is even more evident than before - though the TDotT's beautiful tropical blues, greens were what made the game a joy to play (and countered much of the gameplay frustration), the settings here are a bit darker and, perhaps, less enjoyable, but there are unique touches everywhere, from the backgrounds, through some of the characters to hotspot descriptions (multiple for the same thing). At certain points you can just interact with characters for interaction's sake, puzzles that don't help you progress but help with the story and the atmosphere... or to waste time while you think they should somehow take you forward - again, become better in retrospective. Musically - typical Runaway, ambiental stuff more than fitting for the setting, punctured by non-ambiental stuff with vocals that sticks out less than before - the French song in the morgue was especially effective. Professionally done.  All in all, again, a good adventure game that's not without its flaws - mostly gameplay-wise and, but it bears them well, aware of them, remaining in line with its predecessors. Recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Finally!! The third game in the trilogy managed to rock it! After an awful beginning and an okay continuation, Pendulo finally made it! This game is a really good experience, but to get the story you would still have to torture yourself with the previous ones :/ I have no actual negatives for the story, characters, music, items and environmental manipulation in this game.  Only problem is worth a failing .exe file which crashed my game at exit on four occasions. Sadly, this demonstrates am ongoing lack of will top fix this kind of issues within the Pendulo project.",
            "review_score": "1"
        }
    ]
}