{
    "app_id": 58610,
    "name": "Wargame: European Escalation",
    "release_date": "2012-02-22",
    "developer": [
        "Eugen Systems"
    ],
    "publisher": [
        "Eugen Systems"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Achievements",
        "Valve Anti-Cheat enabled"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "RTS",
        "Military"
    ],
    "achievements": 29,
    "positive_ratings": 1892,
    "negative_ratings": 574,
    "price": 7.99,
    "description": "The New Fatal Error DLC includes a new 5-mission Operation and touch-screen controls.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/58610/header.jpg?t=1552282725",
    "minimum_requirements": "OS: WINDOWS XP SP3/WINDOWS VISTA SP2/WINDOWS 7 Processor: AMD/INTEL DUAL-CORE 2.5 GHZ Memory: 1024 MB (XP)/2048 MB (VISTA/7) Graphics: 256 MB 100% DIRECTX 9 AND SHADERS 3.0 COMPATIBLE.  ATI RADEON X1800 GTO/NVIDIA GEFORCE 7600 GT OR HIGHER DirectX®: 9 Hard Drive: 10 GB Sound: DIRECTX 9 COMPATIBLE Other: INTERNET CONNECTION REQUIRED FOR ONLINE GAMING AND GAME ACTIVATION",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": " Meticulous &amp; enjoyably taxing // Recommended for deep-strategy fanatics",
            "review_score": "1"
        },
        {
            "review_text": "One of the best RTS games that i've ever played. Wargame: European Escalation is set in the cold war around the 1970's in a Nato vs Pact conflict. This game makes you think, such as what units you will need to use in battle. Sure, having a strong group of tanks is nice but you will also need anit-aircraft artillary in case of an oppenent launching an air attack. From what I have seen, there's always a counter unit to a unit. So basically if your oppenent does things right, he could destroy any of your units and you could destroy any of his. It all depends on the strategy you use. The single player has an interesting campaign and is challenging even on the easiest difficulty. There are not many people playing multiplayer, but you can find at least 1-2 matches a day. You are awarded command stars after completing tasks in mission or leveling up in muliplayer. Command stars allow you to purchase new vehicles for your armies. This will leave you playing for hours so you can unlock the tanks you want or a helicopter that looks cool. This game has a friendly community and I strongly recommend it to anyone interested in RTS games, or just strategy games in general.",
            "review_score": "1"
        },
        {
            "review_text": "Ok, so coming as a fan of the RTS genre I enjoyed the game. It was good, not great, but good. I liked that it required a certain degree of strategy aside from 'make more tanks, blow people away.' which is good. I disliked the fact that the AI doesnt really change up its beginning round movements at all so that if you replay something you know where everything is going to be from the start. Secondly, I HATE that the AI somehow knows all about my position and troop movements and has acts in turn to counter everything I try to do. In strategy games that is probably the biggest mistake a developer can make. That doesnt add challenge, it just pisses people off because they're not as clairvoyant as the AI. The player actually needs those scouts and recon units to see jack, while the AI somehow just knows these things and picks off your units making it frustrating to get good scores without playing level over and over. Overall, I would recommend the game, but only to those who already enjoy tough strategy games.",
            "review_score": "1"
        },
        {
            "review_text": "This game is meant for people who not only enjoy RTS but also enjoy extreme realism, if you are not a fan of either of these then wargame is not for you, that being said I myself loved this game it is not only an amazing RTS but also the most realistic RTS I have had the pleasure of playing and I would highly reccomend it.  10 out of 10 stars",
            "review_score": "1"
        },
        {
            "review_text": "9/10 a very fun game to play. grab some friends and start up a server. its easy to host a multiplayer server and ping and response time is great. with two sides to play on ( PACT and NATO) this game can suit someone who still wishes the soviet union was a thing and someone who loves thier good ol' democracy.  Pros: -hundreds of units -level up quickly -thousands of stratagys to adopt -good multiplayer mechanics -lots of maps and game modes (game modes are usually quite similar) -great campagn missions and lots of em Cons: -its hard to get a start at level 1. as most people are lvl 70+ -some guys on multiplayer dont talk - the B-T clan. these guys are really bad. they just rush. dont play with them at all -sometimes there isnt a server running (or its just a B-T server)  other then that i dont got many things bad to say about this game. over all great game.",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoy this game, despite the sometimes insane difficulty. I've had a really hard time playing Warsaw Pact. The AI is merciless and relentless. The graphics work well for it and the game plays quite speedy on a modern PC. I've had no technical problems playing on Windows 10 x64 (or Windows 7 x64).  I'm an old school wargamer and this satisfies that enjoyment and has a modern feel being RTS. So, buy this if: You like semi-realistic RTS, modern warfare, a real challenge, an excellent set of single player campaigns. You may not like this if high-difficulty is off-putting or you are expecting more of a game-style RTS with base building and such.",
            "review_score": "1"
        },
        {
            "review_text": "yes it is a hard game, but not that hard to get the hang of how to play. some of these reviews will scare you away from this game, dont let them. it not hard at all to understand how to play the game, just take your time, dont rush it! its alot of fun.",
            "review_score": "1"
        },
        {
            "review_text": "All around super fun game with decent graphics and well thought through missions. I do highly reccomend getting this game if!  You like strategy.  You like a diverse selection of units.  You like an interesting campaign that actually kinda makes sense.  You like having total control of where your units go and what they shoot at.  You like large well detailed maps and missions.  You like somewhat realistic combat and strategy.  All around an awesome game that I highly recommend buying. Its realistic for the most part and has plenty of diverse maps and units. It has lots of details for each map and you can zoom in or out as much as needed. If you are into heavy strategy games then I think you should at least do some looking into on this game and see if its what you want. Hope this helps!",
            "review_score": "1"
        },
        {
            "review_text": "Yes, I recommend this to any modern RTS fan. Prolly one of the best games in this genre.",
            "review_score": "1"
        },
        {
            "review_text": "This is a unique but very good modern strategy game with a lot going for it. Amazingly detailed backstory, units, strategic elements, resource management and excellent graphics and sound considering how old the game it. But be warned it is a hard slog on the single player campaign, don’t expect any hand holding or nicely nicely approach. I can't praise this game enough, get it now if you love strategy games even more so it’s on sale, thumbs up!",
            "review_score": "1"
        },
        {
            "review_text": "Won't recommand for linux user, there is a major video bug reported but not fixed after more than a month.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game for strategy lovers.  If you think command and conquer is strategy then this game is not for you lol. This is a real strategy game where every aspect of combat has to be monitored correctly and with precise decisions or you will get crush from the minute go.  Highly enjoy this game and would recommend it to anyone who enjoys realistic war strategy games + multiplayer is brilliant!",
            "review_score": "1"
        },
        {
            "review_text": "I always wanted to try this game, but never got around to it. Life was just to hectic for me at the time so I unfortunately never got to experience the massive scale combat of Wargame. That was until my good friend Bishop so generously through the kindness of his faggidy ♥♥♥ heart so graciously provided a digital copy of this glorious and underrated video game. I had once imagined what would happen if the Cold War had changed temperature. With previous titles like World in Conflict (which has very similar gameplay mechanics) I thought I had experienced WW3 as it could of happened on U.S. Soil. But lets get realistic here guys, they arn't just gunna walts right through Europe without a ♥♥♥♥in fight! (Shout out to my boi's in Germany, Britain, and France I guess) When I played my first round of this ingeniusly developed war simulation I had truly felt like I was there. This was the the most accurate depiction of a Cold War Era conflict I have ever experienced. I had PTSD for a week.",
            "review_score": "1"
        },
        {
            "review_text": "I do like this game, but is extremely hard to gain XP and progress in terms of levels. ",
            "review_score": "1"
        },
        {
            "review_text": "it's like the movie 'RED DAWN' but without the americans teens ♥♥♥♥... ",
            "review_score": "1"
        },
        {
            "review_text": "Best campaign of all the Wargame series.",
            "review_score": "1"
        },
        {
            "review_text": "This is an extremely well made RTS! I highly reccomend it!",
            "review_score": "1"
        },
        {
            "review_text": "hours and hours of fun. i think this game will be on the steam for a while. Multi playing. Still not beaten single player.",
            "review_score": "1"
        },
        {
            "review_text": "Jean Kirstein approves of this game.",
            "review_score": "1"
        },
        {
            "review_text": "This game might be OK if they included a tutorial or some indication of how to play. The time it takes figuring it out is better spent waiting for a sequel to World in Conflict.  Do not bother with this unles you have time to burn.",
            "review_score": "-1"
        },
        {
            "review_text": "Bought this game on sale, and glad I did. The gameplay is slower than I'm used to for an RTS, and as such, games take much longer than say, Starcraft. Overall, I'd give a +1 as I deeply enjoy the lage map, huge battle style the game is designed around.",
            "review_score": "1"
        },
        {
            "review_text": "This is totally awesome strategy game!",
            "review_score": "1"
        },
        {
            "review_text": "The best strategy game out there",
            "review_score": "1"
        },
        {
            "review_text": "this is one of the best hardcore strategy games out there i must say this is a game where you need to put your mind to full gear to play this and somehow playing this i got me a good K/D on battlefield badcompany 2 thanks to this game",
            "review_score": "1"
        },
        {
            "review_text": "Sadly, I really want to like this game, but I can't do so out of good heart. It looks fine, sounds fine, plays fine, controls fine, but I found it extremely hard and unfair. I play a lot of stragegy games and I like a good challange, but this game for me was very hard to play because you have little to no chance. Your units seem to be worse than the enemies' units, which would be fine, except they out number you about 10 to one. No matter how many units I call in, they always seem to have ten times as many units, and plus they have air support often when you don't, and captuing and holding an objective is hard enough, and gets even harder when you have to defend three points, while outnumbered, out gunned, and out maneuvered. I nveer got past level three or so, and I gave this game MANY tries, but I could never pull through, as misions can last for hours, with little to no progress made. As much as I want to like this game, I can't, and I have to recommend somehting like 'Men of War: Assault Squad 2' or 'Star Wars Empire at War' or 'World in Conflict' as opposed to this when suggesting a good RTS. Maybe I'm just REALLY bad at this, but I've played a LOT of RTS games, some of which can be very punishing (Men of War on veteran difficulty) and in those I still felt that I had a chance and could make progress and win, but in this I fight for hours and gain nothing but keep losing everything...",
            "review_score": "-1"
        },
        {
            "review_text": "Somehow, the enemy player always fields the direct counter to whatever units you deploy.",
            "review_score": "-1"
        },
        {
            "review_text": "While I appreciate the realism (persistent army between levels, level-up for survivors, fuel, ammo, logistics supply and command centers, lots of hide and seek), which is very nice and made me quite addicted for a while, I eventually quit playing for two basic reasons:  1. At the campaign, you have very limited troops and resources, while the CPU can spawn units forever as long as they have the reinforcements points. So you either rush or die. I don't appreciate STRATEGY when you have to rush. 2. Multiplayer, well ... you know how RTS multiplayer go, but in wargame it is worse because of the limited everything, so only the hardcore players will do anything, a casual player like me have no chance. 3. There are zillions of bugs on the border areas. For instance, enemy units that retreat (rout) outside the map cannot be easilly target, and worse yet, they might just stay there. I lost a couple of cames because some stupid enemy unit retreated near a reinforcement point and any/all supply truck I called in was immediatly captured, but since they spawn outside the map, I could not send troops to capture them back. Some enemy units go to far outside the map you can't even scout/see to try and siege them, wtf  So: campaign: you are infinitelly capped against an infinite oponent, so you have to win while you have troops; multiplayer: hardcore made even more hardcore. No, thanks.",
            "review_score": "-1"
        },
        {
            "review_text": "A-MAZING and hard lol  This game reminds me of Tom Clancy's endwar in many ways. its also slightly like a SUPER LARGE XXL Company of Heroes 2 sandwich.  one thing to note on this game, played it on my Lenovo Yoga 2 Tablet, and the touch controls are on Fleek...or something similary awesome.  Supply Lines are Real, DLC Added Content Is Real(And Much Needed IMO)  If you even consider this you should just by the latest in the installment Wargame: Red Dragon, it includes boats and planes. but this is a wonderful series to start out with and i have had so so results playing Red Dragon on my tablet(slightly added video req's make it slightly glitchy, im sure it works fine and its just my own personal hardware)",
            "review_score": "1"
        },
        {
            "review_text": "This game is great, if i wouldn't suck so much at it. It's probably the best RTS that I've played in a long time. You actually have to use your wits in this game to get the better of your enemies instead of waltzing them with tanks. You have to securely plan your attacks (atleast how i play it) and make sure your troops are supplied and morale is high.   + Very realistic gameplay + Fun to play - Hard to control",
            "review_score": "1"
        },
        {
            "review_text": "Great to introduce yourself in this franchise, an unique campaign",
            "review_score": "1"
        },
        {
            "review_text": "Ok, I bought this and I hated it, the first mission is way too hard for a biginner player and you need those 'stars' to play online. Furthermore there are not more then 4 matches at once.  Buy the Red Dragon Wargame, wich fixes those issues.",
            "review_score": "-1"
        },
        {
            "review_text": "Incredible!!!!! Do it! Press the Buy Now button You wont regret",
            "review_score": "1"
        },
        {
            "review_text": "Very nice game. Learn to play tactic and strategic! Good graphics, enjoyable number of units for both sides. Interesting gameplay, though could have been more handful. Lacks more flexible in-game pause that would have enabled player to appreciate more in-depths maps and units on the battlefield (locked screen instead).",
            "review_score": "1"
        },
        {
            "review_text": "Started playing a year after i bought it, in general, it's a great game, and extremely challenging for starters. I like how certain units do better in certain surroundings, like tanks are great in open areas or hedges, helicopters dominate in open areas, infantry rule the cities/towns/buildings, ATGM and other anti-tank units do well when behind woods on an open field. My only problem is that sometimes the game becomes too challenging to the point where no matter what you do(brings in 10000 tanks to hold alpha objective) you can't seem to win(all the tanks die from one helicopter that they cannot seem to hit ever). Still graphics are extremely good and no unit rules all of them(unless its a helicopter and you don't have AA guns). Oh and btw storming a city with tanks will never work for you but works most of the time for the enemy.",
            "review_score": "1"
        },
        {
            "review_text": "great graphics",
            "review_score": "1"
        },
        {
            "review_text": "It's like a book of military specifications came to life and made a game",
            "review_score": "-1"
        },
        {
            "review_text": "I recommend this game to any one .",
            "review_score": "1"
        },
        {
            "review_text": "It has a pretty ♥♥♥♥ interface. And is a ♥♥♥♥ game.",
            "review_score": "-1"
        },
        {
            "review_text": "I totally recommend this game, it is just awesome!",
            "review_score": "1"
        },
        {
            "review_text": "Great game.",
            "review_score": "1"
        },
        {
            "review_text": "Selecting units by clicking on their always overlapping names is frustrating and pointless.  The game is otherwise enjoyable, the user interface needs some serious work.",
            "review_score": "-1"
        },
        {
            "review_text": "I really don´t understand how a complex RTS can be done without a pause option. For me, that killed the game as soon as you have to control a medium sized force.",
            "review_score": "-1"
        },
        {
            "review_text": "We just bought this Game because its from the same Developers as RUSE, but we where more than frustrated.  In RUSE you can see over all the Time what your Opponents are doing, even if the exact Type of Tank or Planes are unknown until you use a Spy. But you can at least see where they move and how much your Opponents are Building. Also its Perfect that the Tanks and Troops get Bigger when you Zoom out of the Map so you always see them Perfectly  In WARGAME you see Nothing. This means you and your friends are spamming the Troops out of nowhere waiting that 20 Minutes later the PC attacks and you finally see his Troops. Also the Troops are too small when you zoom out so that you see NOTHING.  IF YOU DONT HAVE RUSE ... BUY RUSE AND FORGET THIS !!!!!!!!!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "it is not like the video s of it //////PS/is no sand box",
            "review_score": "-1"
        },
        {
            "review_text": "Kind of a waste of money if you havent played Wargame before  I have never played a wargame before, but i wanted a fun, command and Conquer like game on the computer, so I got this. It seemed fun, and it seemed to have basic strategy elements to the game.   But, I would not recommend it simply because it is not noob-friendly. I spent 30 minutes trying to figure out how to play this game because there is no tutorial. It throws you into the game as if you are supposed to know what you are doing and what the controls are. And personally, I did not enjoy the 30 minutes I spent trying to learn basic controls, and I do not think most people would as well.",
            "review_score": "-1"
        },
        {
            "review_text": "This just felt like a ruse clone, its not a bad game i just feel there are alot of other games on the market that do RTS alot better like company of heroes or the men of war series. If you have all those games then yeah, by all means pick this one up but i would rather spend my time playing a better game. Visuals are nice and has a great selection of cold war era weaponry, but in the end the gameplay gets abit boring, theres no excitement, the cover system for your infantry just doesnt feel right and i prob wont be installing it again as theres nothing here that which makes me want to return, sure theres unlockables like new units, choppers are fun to mess around with but after one play through i had had my fun and moved on to the next game and havnt been back since, thats strange for an RTS. People will disagree, but this is my honest opinion and like i said theres just better games out there so on that basis i cant really recommend it. Its not the worst RTS i have played but its def not the greatest, Overall 6/10",
            "review_score": "-1"
        },
        {
            "review_text": "a bad game not my taste i want a refund for a game that i dont play 22 min.s through it and i just quit its just not my kind of game",
            "review_score": "1"
        },
        {
            "review_text": "your units can actually pee themselves and run away, in real time! just like a real war!",
            "review_score": "1"
        },
        {
            "review_text": "Appear to be good. But I complete reject any game that require to create accout on my steam.",
            "review_score": "-1"
        },
        {
            "review_text": "dame as for 'AirLand....', blood thirsty morons...!",
            "review_score": "-1"
        },
        {
            "review_text": "Rush on it -The guy with 2000 hours on Red Dragon.  (Well it only display 1,4 hours since i played 99% of my playtime on another account)  At least you can scripted scenario with 5 stories ''what if' during coldwar. Got a decent multiplayer, night maps, and many other fun things.  Just buy it.",
            "review_score": "1"
        },
        {
            "review_text": "Eh it was alright",
            "review_score": "1"
        }
    ]
}