{
    "app_id": 60,
    "name": "Ricochet",
    "release_date": "2000-11-01",
    "developer": [
        "Valve"
    ],
    "publisher": [
        "Valve"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Multi-player",
        "Online Multi-Player",
        "Valve Anti-Cheat enabled"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "FPS",
        "Multiplayer"
    ],
    "achievements": 0,
    "positive_ratings": 2758,
    "negative_ratings": 684,
    "price": 3.99,
    "description": "A futuristic action game that challenges your agility as well as your aim, Ricochet features one-on-one and team matches played in a variety of futuristic battle arenas.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/60/header.jpg?t=1528733092",
    "minimum_requirements": "500 mhz processor, 96mb ram, 16mb video card, Windows XP, Mouse, Keyboard, Internet Connection Recommended: 800 mhz processor, 128mb ram, 32mb+ video card, Windows XP, Mouse, Keyboard, Internet Connection",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Pfft.. noobs around, with less than 1 hour of gameplay, recommending Ricochet... IT'S A TRAP!",
            "review_score": "1"
        },
        {
            "review_text": "Servers emptier than my list of plans for the future.  11/10 - Would play again.",
            "review_score": "1"
        },
        {
            "review_text": "An absolute pleasure to play through. Ricochet goes where no other Valve game has ever been before - You take control of Pert Kravelski, another overlooked escapee of the Black Mesa Research Facility introduced in Valve's hit title 'Half-Life' whose goal throughout the entire game is to discover the Saisei code (which I won't spoil for you who don't know what that is).  Since Pert's family was kidnapped by the Task Force which invaded the Black Mesa Research Facility in Half-Life, his goal is to break into the barracks of the Task Force and retreive his family, after wasting each and every soldier in the facility, but there is an extremely poetic, creative and unexpected plot-twist which prevents you from doing so (this is the meat of the story)  The game runs unbelievably smooth for the time it was made, and the graphics are just stunning. I can't fathom why the Valve fanbase completely dismissed this game, as its feature-set, physics, *and* graphics rival that of Half-Life 2.   Buy. This. Game.",
            "review_score": "1"
        },
        {
            "review_text": "&gt;tries to play  &gt;tries to play game with bots  &gt;bots aren't avialiable in ricochet  &gt;tries to join online gmae  &gt;every server has 0 players and most of them are named your mama  great game",
            "review_score": "1"
        },
        {
            "review_text": "This game absolutely changed my life. Some people are waiting for Half-life 3, but I've been waiting for Ricochet 2.",
            "review_score": "1"
        },
        {
            "review_text": "A work of art.",
            "review_score": "1"
        },
        {
            "review_text": "If there was a game that could ever cure cancer, this is the one.  Before playing ricochet I was homeless and on the street, now I am a family man of 3 children, two have become Doctors with a PhD along with being a Lawyer on the side.  My 3rd child is an astronaught who is working towards being the first person to mars.  Without ricochet none of this would have been possible.  Looking forward to Ricochet 2 valve!",
            "review_score": "1"
        },
        {
            "review_text": "Lifesaving.  It all started in the summer of 2000. The sun was shimmering on the chairs of our concerto stage when I, Sanjay, began to get aroused by our head advisor. Kathline. She was 5'2' and 220 pounds with a fantastic body for someone like me. This happened during the begining of my journey through puberty and I detected a sudden flow of blood to my pelvic region. To my surprise, my ♥♥♥♥♥ was erect. I had read that the only way to rid of the stiffness was to cleanse yourself of the white, creamy, fluid inside. I slowly slipped my weiner out of my pants and began to insert it into the opening of my saxophone. Realizing that my ♥♥♥♥♥ did not yet have the gurth to be pleased by the large opening at the end of a saxophone, I walked over to Johnathan and grabbed his oboe. The choir began to reprimand me and tried to take the oboe from me, but I didn't give up. I forcefully thrusted my ♥♥♥♥♥ into the butt of the instrument when, all of a sudden, a magical liquid spewed onto Kathline, my true love. They all laughed at me, yelling at me never to come back.   I hoped the worst was over when school started in September but the stories of 'Sanjay ♥♥♥♥♥ Squirter' reached my school in no time, and I was tormented endlessly. Day to day people would mock me and hold their instruments near their pelvis. Months later, the date November 1st, I was walking home from school when a car approached me with what looked to be a model of me on top. After playing a recording of what sounded like a prepubescent child having an ♥♥♥♥♥♥ my 'model' squirted out some mayo all over the ground.   I was done with my life, ready to give it all up, but then something glorious happened. I spotted a new entry onto the steam store with a game called 'Ricochet'. I decided to give this game a try before I cut my life short. But once I started this glorious creation I couldn't stop. It made me realize that no one could mock me enough to force me to miss out on the greatest game in history. The philosophical value behind this game is much greater than what the creators could have possible imagined.  I thank you and hope for everyone to try this game.",
            "review_score": "1"
        },
        {
            "review_text": "That one game we all have but never play.",
            "review_score": "1"
        },
        {
            "review_text": "I fell out of the map, many times.",
            "review_score": "1"
        },
        {
            "review_text": "I believe this game was named after Rico and Chad, the two guys who are still playing it.",
            "review_score": "-1"
        },
        {
            "review_text": "The game is fine, I really like it, but I find no players to play with. Every server I check is empty or contains one or two BOTs, so I rarely get to play.  What a pity. I hope more people will join the servers. Until then, my review won't be positive.",
            "review_score": "-1"
        },
        {
            "review_text": "Disturbingly daring, this game is the ultimate fantasy of every Tron(tm) and Frisbee(tm) fanatic. Only play when seriously wasted.",
            "review_score": "1"
        },
        {
            "review_text": "  I think This game is fabulous in 2000. Now, I cannot enjoy but even that I recommended because in that time Valve was the best developer in the world I have known. For its sake, everybody should play this game at least 15 minutes.",
            "review_score": "1"
        },
        {
            "review_text": "The only reason im not recommending the game is the price. Me and my friend were lucky enough to get it for free. We had lots of fun with it. But i think Valve became nuts to put a price on THIS. The game might be fun, bur it's surely not worth the 3,99. After a while it gets boring, repeatitative (correct me if i spelled it wrong). Also the game is almost dead. If you play it now there is an average of 0 - 2 players on about 8 servers.  Seriously don't buy this. ",
            "review_score": "-1"
        },
        {
            "review_text": "Ricochet is the best game ever developed! I'd pay a billion dollars just to play Ricochet for 5 minutes! If you do buy this game, be aware that the servers are always too full for you to join, so you may be sitting there for a couple hours (maybe even days) just to get into a game (an extravagant one mind you). I even have a Ricochet jump pad and light frisbee tattooed on my face! I sacrificed getting a job for my whole life just because I love this game! So please do the same and don't buy or ruin your face with some smut like any of the other games they've put out and/or published.",
            "review_score": "1"
        },
        {
            "review_text": "Visually appealing, but a bit frustrating when it comes down to gameplay elements. TRON/ TRON: Legacy meets Deathmatch Classic... with sizziling sound effects.  Oh, and after about 5 minutes, you will already grow sick and tired of the 'falling-to-your-death' death screen. Overall, not too terrible of a game. I honestly expected worse when I first booted up the game.",
            "review_score": "1"
        },
        {
            "review_text": "I was a professional Riccochet player, and this is my story.",
            "review_score": "1"
        },
        {
            "review_text": "i have no idea what i'm doing simulator",
            "review_score": "-1"
        },
        {
            "review_text": "You are a spaceman, your goal is to decapatate other spacemen using laser frisbees. 10/10 GOTY for sure",
            "review_score": "1"
        },
        {
            "review_text": "This game is so good youll be bouncing of the walls!",
            "review_score": "1"
        },
        {
            "review_text": "Truly a masterpiece ahead of it's time, if it was to be released today with modern graphics, every cod kid would play it and tell me how they performed sexual intercourse on my birthgiver.",
            "review_score": "1"
        },
        {
            "review_text": "Ricochet. The greatest game built off the source engine in its entire history. Buy it, play it for the rest of your life.",
            "review_score": "1"
        },
        {
            "review_text": "Ricochet is a multiplayer deathmatch game, which attempts to be original and has virtual/arcade feel to it. It was a free modification for Half-Life, coming along with one of the patches to the game, and from what I know, it was supposed to show new additions to the engine, as well as just being a bonus. Yet now it's being sold on Steam serapately. And in this case, it wasn't a good move.  And well... Player base of this multiplayer game is dead. Completely. And is the main reason not to recommend this for purchase.  Otherwise, the game is not horrible. It was good for what it was supposed to be - bonus mod. You jump between platforms using boosters and throw discs at opponents, either to push them off into void or to kill them. You regenerate discs ammo all time up to 3 of them. Pushing requires 1 discs, thus can be spammed. Decapating disc wastes all 3 'ammo'. There is regular respawning power-up. And with usage of HL Engine advanced maneuvering (air strafing) you can try to outsmart enemies by landing on different platform than what is expected. And most often, you will fall into void due to your own clunkyness. Or bump into another player and fall down together. It's just that it tried to push on art direction of 'arcade/virtual' style too much, thus it lacks any casual fun of 'shoot them the terrorists from awesome guns', nor does it has any pleasent art in levels themselves. Otherwise, nice bonus mod, for 2-4 players DMing.",
            "review_score": "-1"
        },
        {
            "review_text": "Got a triple-bounce kill, 10/10 best game. Ech.",
            "review_score": "1"
        },
        {
            "review_text": "The best game of all time, brought to you by Valve. This game makes The Last of Us, Bioshock, Half Life 2 its ♥♥♥♥♥. Buy this game now, truly next gen was here back in November 1, 2000.",
            "review_score": "1"
        },
        {
            "review_text": "Best game ever.. Half life 2 near Ricochet is ♥♥♥♥ trust me. This game has a varity of weapons so much people playing it When u play u get excited and start to masturbate. When I ran the game for the first time I had an ejaculation",
            "review_score": "1"
        },
        {
            "review_text": "Has 18 running servers, only 1 had any actual players on. Had bots so you would be able to play, though.",
            "review_score": "1"
        },
        {
            "review_text": "Best frisbee simulator. Made me win the championships. 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "This game is like someone got the most beautiful sunset and condensed it down to a playable form.",
            "review_score": "1"
        },
        {
            "review_text": "The greatest game ever made",
            "review_score": "1"
        },
        {
            "review_text": "I love this game! This game is great.",
            "review_score": "1"
        },
        {
            "review_text": "Great game with a great concept. But sadly, there are no active players.",
            "review_score": "1"
        },
        {
            "review_text": "One of valve's best games 11/10",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this game to people who are willing to buy it in groups. The game has a few purposes to it: don't fall, don't get beheaded, and don't get hit. There are two game modes (as far as I know): arena (one-on-one matches) and deathmatch. This game was an idea in which one could make a popular game with a short budget and a simple set of rules. It did successfully but with short lived fame. It's fun to play with friends but keep in mind that friends is all you've got because the community is pretty lifeless with some bots. If you want to play the game, be sure that you have friends who are willing to buy as well. If you get bored, it's not a surprise even with old-community made content because the idea is still the same.",
            "review_score": "1"
        },
        {
            "review_text": "I have owned this game for over a decade and always considered it a joke. But I recently started playing it; and it may just be the greatest game ever made.  I can just imagine the designers saying 'hey, we need to make a game before lunch, let's just make Tron.' And surprisingly enough a movie about being in a video game actually makes a better game than it does a movie - even if it was made in half an hour.  So get together with some friends (go out and make some if you have to - worth), grab a copy of ricochet, and go nuts.  Also watch out for the one remaining hacker in this game - seriously, who cheats at Ricochet?",
            "review_score": "1"
        },
        {
            "review_text": "This game is good. The gameplay is very good, but the graphic is not because this game is old. This game is funny because you can fun with your friends. And unfortunately nobody playing with this game.",
            "review_score": "1"
        },
        {
            "review_text": "Don't buy this game unless you have another person to play with.  If you do, then this game is pretty fun to play.",
            "review_score": "1"
        },
        {
            "review_text": "Valve did a good job at showing what NOT to do.  (just make this f2p) 2.5/10",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games in the history of games.",
            "review_score": "1"
        },
        {
            "review_text": "  Introduction",
            "review_score": "1"
        },
        {
            "review_text": "Very cool old game",
            "review_score": "1"
        },
        {
            "review_text": "I can decapitate people with frisbees. 420/10 Blaze it ♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "This game although being a valve game sucks im sorry i realize peole like it but in my opinion it sucks, all other valve games beat any other companies but this one is one of the worst ones ever",
            "review_score": "-1"
        },
        {
            "review_text": "mm yues, this is good gaem. i feel it in me veins when i ninjachop a person on the samemap. yes i vote 2 out of 5",
            "review_score": "1"
        },
        {
            "review_text": "Its 2016 this game is more dead than Princess Diana",
            "review_score": "1"
        },
        {
            "review_text": "I feel as though many, and I mean many people glossed over this masterpiece. It's better than any game out here today! Better than Fallout 4, that's for sure!   It's gameplay is nice and the players are very competitive.   I think a simple remake of the game with amazing graphics and state of the art mechanicing could easily bring popularity back into it! I hope to see this be the launch title for a possible Source3 engine!!  I think Valve did an amazing job on this game. I just wish more people would appreciate this hard work and effort. I'd give it the GOTY award, if only it counted for games of old.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "+1",
            "review_score": "1"
        },
        {
            "review_text": "░█▄░▄█░█▀▀░█▀▀▀░ █▀█ ░█░█░█░█▀▀░█░▀▄░█▀▀█ ░▀░░░▀░▀▀▀░▀▀▀▀░▀░░▀ ░█░░█░█░▀▀█▀▀░█▀█ ░ █▀█ ░█░░█░█░░░█░░░█▀▄ ░█▀▀█ ░▀▀▀▀░▀▀▀░▀░░░▀░ ▀░▀░░▀ ░█▀▀ ░█▀█ ░█ ░█▀▀ ░█▀▀ ░█▀▀ ░█ ░█ ░▀▀▀ ░▀ ░░░▀ ░▀▀▀ ░░░░░░░░████ ░░░░░░░░█░░█ ░░░░░░░█░░░█ ░░░░░░█░░░░█ ███▄▄█░░░░░███▄ ▓▓█░░░░░░░░░░░░█ ▓▓█░░░░░░░░░░░░ █ ▓▓█░░░░░░░░░░░░█ ▓▓█░░░░░░░░░░░░ █ ▓▓█░░░░░░░░░░░░█ ▓▓█░░░░░░░░░░░█",
            "review_score": "1"
        },
        {
            "review_text": "The worst game Valve made. 9/10 :O",
            "review_score": "1"
        },
        {
            "review_text": "The best game ever. Anyone who has ever lived should buy this game. George Washington and Sylvester Stalone played this to rally the troops in World War II. It's just that awesome.",
            "review_score": "1"
        },
        {
            "review_text": "If you can find a server, this game is surprisingly entertaining in short bursts. No music, just the sound of you shooting off platforms, and your enemy decapitating you with their disk thing. If you have it, give it a whirl, and hope you can find a server with a few players in it.",
            "review_score": "1"
        },
        {
            "review_text": "It's certainly a fun game. You jump around floating platforms throwing discs at eachother, collecting different powerups. The only problem is the game is dead.",
            "review_score": "1"
        },
        {
            "review_text": "If you love the critically acclaimed first person shooter game series of 'Call of Duty', you'll love this game. Its fast-paced gameplay and state of the art high resolution graphics will keep you on the edge of your seat and keep you entertained for hours.  What are you waiting for? Spend all of your grandmother's 401k and bankrupt your home country today!",
            "review_score": "1"
        },
        {
            "review_text": "If you can find a server, this game is surprisingly entertaining in short bursts. No music, just the sound of you shooting off platforms, and your enemy decapitating you with their disk thing. If you have it, give it a whirl, and hope you can find a server with a few players in it.",
            "review_score": "1"
        },
        {
            "review_text": "Valve's most under-appreciated gem.",
            "review_score": "1"
        },
        {
            "review_text": "this game is actually really good it should gain a cult following,it is definetly an underrated gem of the steam community.",
            "review_score": "1"
        },
        {
            "review_text": "Not worth $5.  No one even plays anymore.  Please reduce price to $1 to get more people playing.",
            "review_score": "-1"
        },
        {
            "review_text": "i got vac banned from Ricochet. rip my life :(",
            "review_score": "-1"
        },
        {
            "review_text": "Waiting for Ricochet 2.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Empty servers. Don't care, still Valve.",
            "review_score": "1"
        },
        {
            "review_text": "11/10 best masturbation simulator out there",
            "review_score": "1"
        },
        {
            "review_text": "I have decided to give up all of my life and just play ricochet. I dont need food, i just play ricochet. I dont need to drink, i just play Ricochet. I dont need to fap, I just play ricochet........   MURICA!",
            "review_score": "1"
        },
        {
            "review_text": "This game is so poor. You jump pad to pad and instead of guns, you use rings. Ricochet is the worst game of 2001. Who cares abour Ricochet 2? That game gets older everyday! This game has poor quality, poor sound and poor fun! I do NOT like this game at all!!",
            "review_score": "-1"
        },
        {
            "review_text": "This game has changed my life. As soon as i launched it i got 10 girlfriends, 1,000,000,000 dollars, a free cruise, and a mansion. The gameplay is the most amazing part of it. The amazing storyline and almost surreal graphics are great. The servers always have people playing. I don't understand how people would rather play Half-life 3 than this masterpiece. 100/100",
            "review_score": "1"
        },
        {
            "review_text": "Yeah this game doesn't have lots of players, but with a friend this game can be lots of fun.",
            "review_score": "1"
        },
        {
            "review_text": "This game is as ♥♥♥♥♥♥♥♥ as a senile grandpa that's drunk, that's a wrestler.",
            "review_score": "-1"
        },
        {
            "review_text": "this is a phenomenal game  this is goodd",
            "review_score": "1"
        },
        {
            "review_text": "Mos ♥♥♥♥♥iest game I have ever played. Every server laggs and the only people that plays it are racist five yo's",
            "review_score": "-1"
        },
        {
            "review_text": "is COOOOOOOOOOOOOLLLLLLLLLL!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! but low server  50/20 me",
            "review_score": "1"
        },
        {
            "review_text": "Dead game , No One Playing this game DONT BUY",
            "review_score": "1"
        },
        {
            "review_text": "wish people played this game, its a blast!",
            "review_score": "1"
        },
        {
            "review_text": "i have no idea what this game is",
            "review_score": "1"
        },
        {
            "review_text": "You don't want to play this.",
            "review_score": "-1"
        },
        {
            "review_text": "Best game in existence nothing beats it my fav game of all time ultra ♥♥♥♥ing sexy graphics made on cry engine 3 and next gen gameplay",
            "review_score": "1"
        },
        {
            "review_text": "THE NAME ALONE MAKES ME WANT TO OWN A AMC GREMLIN....WOOOOOOOO!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "-",
            "review_score": "1"
        },
        {
            "review_text": "You wanna be da best ya gotta play da best and dis roight here is it.",
            "review_score": "1"
        },
        {
            "review_text": "After logging a few hours on this game (i think its at a couple thousand, im not sure I only understand frizbees now) I have come to realize that it is deep down an amazing game. The sound effects, particularly the dieing ones, are top notch. The physics are groundbreaking, and the graphics are better than any game I have ever played. Anyone saying this game is garbage is WRONG, this game is life. 10000/10",
            "review_score": "1"
        },
        {
            "review_text": "LIghtsabre fresbies, and watch your step.",
            "review_score": "1"
        },
        {
            "review_text": "There is no one online for playing it. Dead game.",
            "review_score": "-1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is the most underrated internet game of all times. This. Is. The. ♥♥♥♥! It takes some time to get used to, it's old, it's ♥♥♥♥♥♥... but this can be the most entertaining game you've ever played. Forget about Minecraft and all those other indie ♥♥♥♥-games. Ricochet is so bad that it's not good, but just terribly bad, though a little worse than that so it actually gets back on '♥♥♥♥ING AWESOME'-level. Don't ask me how this works, but it does - if you want it to.",
            "review_score": "1"
        },
        {
            "review_text": "its spanish for '♥♥♥♥ing stupid game'",
            "review_score": "1"
        },
        {
            "review_text": "You wanna be da best ya gotta play da best and dis roight here is it.",
            "review_score": "1"
        },
        {
            "review_text": "This Game might be old and under-rated but my GOD is it a lot of fun The game makes no sense and no Major league playing rubbish it's just funny",
            "review_score": "1"
        },
        {
            "review_text": "An everlasting masterpiece that has yet to be beaten, the king of all online games ever. LOLWUT, NO.",
            "review_score": "1"
        },
        {
            "review_text": "This game is by far the greatest thing that valve has ever created. This game is a masterpeice that derserves a proper AAA sequel. After playing this game for a long time, I would reccomend this game to anyone with a PC. This is way better than games such as Counter-Strike, simply because of the fact that this game is stacked with content and the community is thriving. This game is made for the hardcore players, and this is the greatest game of all time!!!",
            "review_score": "1"
        },
        {
            "review_text": "Before abandoning the half-life franchise valve abandoned Richochet. Some true gaming history and a must buy for any self proclaimed valve historian.",
            "review_score": "1"
        },
        {
            "review_text": "This game is worth every penny in my opinion, but one small problem... Nobody plays it, unless you have a few friends to play with you, dont waste your time buying it.",
            "review_score": "1"
        },
        {
            "review_text": "Only bad game by valve but its OK for its time.. even though it COULD of been better. but still i had 3 mins of fun with it.. (2 mins of it was finding someone who plays it)",
            "review_score": "1"
        },
        {
            "review_text": "I would like everyone to have this game just because it is so enjoyable, if your on the fence about buying this game don't be because it is for you!",
            "review_score": "1"
        },
        {
            "review_text": "Throwing frisbees while jumping around, such intense. Get yelled at by a swedish mob of nerds. such game ,such good. 11/10",
            "review_score": "-1"
        },
        {
            "review_text": "The game was just boring, lame, and a waist of 10 minutes... I put it under my 'Crap Games' List!!! And most likely you would too.",
            "review_score": "-1"
        },
        {
            "review_text": "fun to play, not fun to not play.",
            "review_score": "1"
        },
        {
            "review_text": "Ricochet is a weird game. You hop around on platforms in a futuristic setting and throw discs at other players, similar to Tron. This game is rather old, so the graphics aren't the greatest. The sound effects are lacking, and I don't recall any music. The biggest reason that I don't recommend this is because of the lack of servers. There were usually only 3-5 servers while I was playing, and most were empty or had a few bots. It would be nice if there was an offline mode with bots, but like many of the old goldsrc games, there is not. If you really want to try this out, you should definitely wait for a sale or get it in the Counter-Strike 1 Anthology.",
            "review_score": "-1"
        },
        {
            "review_text": "This game ♥♥♥♥ing sucks :DD I think it is a piece of ♥♥♥♥ and can't understand how can somebody like it if there is even one player who likes it. No offence to the fine people who made this one but this is my opinion.",
            "review_score": "1"
        },
        {
            "review_text": "The worst and best game ever made.  That is all folks.",
            "review_score": "1"
        },
        {
            "review_text": "wtf is this ♥♥♥♥. 420/69 would rek with frisbee again m9.",
            "review_score": "1"
        },
        {
            "review_text": "Did people actually play this? ♥♥♥♥, I don't even remember buying it. Getting things for free is cool, I guess.",
            "review_score": "-1"
        },
        {
            "review_text": "Nobody plays this anymore. Also, what the ♥♥♥♥ are you supposed to do anyway?",
            "review_score": "-1"
        },
        {
            "review_text": "4/10",
            "review_score": "-1"
        },
        {
            "review_text": "‌‌‌",
            "review_score": "1"
        },
        {
            "review_text": "The best but worst game... infuriatingly fun... hard yet easy",
            "review_score": "1"
        },
        {
            "review_text": "Server Searching Simulator 2015. Do not recommend buying unless you get it with the Valve complete pack.",
            "review_score": "-1"
        },
        {
            "review_text": "I totally recommand this game. The only lack is not many people play this. It's better to play with friends or maybe even a LAN Party if they have it. This game only requires about 800 MHz small right? So why not and about 16 megs for me at least. Maybe because I had Half Life installed I don't know? But anyways, it's a pretty fun game. Valve needs to make a sequal so there can be a fanbase to this game. I had this game for about 3 years when I bought the Valve pack on a sale. But then I just started playing again yesterday. I will always play this game! ^_^",
            "review_score": "1"
        },
        {
            "review_text": "This game is actually fun and nostalgic, wish there was more maps and mods and also a larger community",
            "review_score": "1"
        },
        {
            "review_text": "I really don't understand the hate for this game. Ricochet is a really great game if you want to game with a few friends for about an hour or so.",
            "review_score": "1"
        },
        {
            "review_text": "Good game but nobody play it",
            "review_score": "1"
        },
        {
            "review_text": "This game is really cool. I would play it much more if there were more players on servers.",
            "review_score": "1"
        },
        {
            "review_text": "what are game!!! legit",
            "review_score": "1"
        },
        {
            "review_text": "This game is desert now, but I enjoyed it quite a lot back in the days. Positive just beacuse Valve developed it and potentially it's a lot of fun. Now it's a place where you can meditate alone. TROOOOOON!",
            "review_score": "1"
        },
        {
            "review_text": "This game changed my life",
            "review_score": "1"
        },
        {
            "review_text": "HOLY SHIIITTT THIS GAME IS LIKE GOD OF WAR, ZELDA, HALO, HALFLIFE:BLUE SHIFT, AND PROTINE POWDER MIXED TOGETHER, ON CRACK WITH A DASH OF DIG-DUG!!",
            "review_score": "1"
        },
        {
            "review_text": "now i can finally train my dogs without discs thanks valve",
            "review_score": "1"
        },
        {
            "review_text": "I love this game this game is my life I would put everything in my life on hold to play this game 100/10! to good to be true!",
            "review_score": "1"
        },
        {
            "review_text": "you do the same thing every game you play with discs and fall thats all.",
            "review_score": "-1"
        },
        {
            "review_text": "Not nearly as bad as many claim it to be. very enjoyable with friends.",
            "review_score": "1"
        },
        {
            "review_text": "To this day I got a very vague understanding of what this game is, what is happening on its (very few) confusing maps and what are you supposed to do in order to progress.  From what I was able to comprehend the challenge consists of  trying to figure out what is going on , aiming your attacks at your fellow players who are constantly on the move and jump around platforms very fast, remembering the map layout so that you can better adjust your movement, and trying not to accidentally fall off into pitch-black nowhere while moving yourself and dodging your opponent attacks.  The attacks themselves are performed by launching some sort of futuristic bola (disc-shaped thingy) at other players with intent to throw them off of their platforms and make you score. Although it doesn’t seem to work all the time (?), or the hit detection is not very good/reliable.  The point is that most of the time you need to “predict” your opponent’s future location and aim your disc accordingly as aiming at players directly would almost never work since the movement speed is just so fast and everything is so chaotic. That’s again why good knowldge of the map is a key since knowing where your opponent would most likely go increases your chances at hitting them with your disc significantly.  But I’m sure there’s more to it as map design is pretty awkward and complicated. The above described process is pretty much all that happens each round of the game.   Anyway , the game design is very convoluted and if I were to describe Ricochet with just one phrase, I’d say it’s an ill-conceived fusion of Tron, unfinished Half-Life Xen levels and Quake deathmatch happening inside some Black Mesa scientist’s drug-induced hallucination.  There are simply much better puzzle games out there ( Portal  being a most obvious alternative) which have better environments, better (sane) game design and better gameplay.  Actually, I’m not even sure how this got officially released. It appears that at some point Valve thought that they actually are making some good game rather than hacking together some perverted deathmatch mode for Half-Life. It should have been released as a free mod at most, serving as an example, – but even then it would still seem weird.  It’s OK if you got it with your Valve pack purchase, but if you are bying it alone you are probably crazy or just very curious.",
            "review_score": "-1"
        },
        {
            "review_text": "Ricochet 2 is Half-Life 3's ♥♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 ign fun love the story mode and the achievment mechanics and the graphics are the best i have seen 2016 (better rpg than undertale tbh) there is nothing better than this game. Play COD? This game is for you. With fast paced disk throwing mechanics, You can throw disks! Like minecraft? The ingame sandbox and crafting system in this game is amazing! I love the survival aspects! The online community is amazing! Everyone is nice, and many people play! SOMETIME YOU CAN FIND MORE THAN 2 PEOPLE PLAYING ONLINE!!! (wow!!)  10/10 would uninstall again",
            "review_score": "1"
        },
        {
            "review_text": "This game is great! I have not played it alot, but the nostalgia is so great! Feels like I´m back in time! To bad there is not that many servers on it, if there were more, it should be even MORE GREAT! Worth the money!",
            "review_score": "1"
        },
        {
            "review_text": "tis' pretty good",
            "review_score": "1"
        },
        {
            "review_text": "Review (or update your review) for a game you've nominated (Steam awards 2016)",
            "review_score": "1"
        },
        {
            "review_text": "A game that will last for years, and years! this is truly a epic game worth playing over and over agien, and to make it more fun play with friends",
            "review_score": "1"
        },
        {
            "review_text": "The player base is really small, but if you can gather a few friends to play it becomes extremely fun.",
            "review_score": "1"
        },
        {
            "review_text": "rly good game fun whit frands",
            "review_score": "1"
        },
        {
            "review_text": "Probably one of the better games Valve has made in recent years. I would say it is right up there with 'League of Legends' and 'Secret of the Magic Crystals' in terms of competitive gameplay..",
            "review_score": "1"
        },
        {
            "review_text": "Just as good as Titanfall. Its good, for 10 minutes.",
            "review_score": "1"
        },
        {
            "review_text": "This is probably one of the most exciting and rewarding games I have ever played in my entire life.",
            "review_score": "1"
        },
        {
            "review_text": "It's fun when there are people online. 8/8 would do m8",
            "review_score": "1"
        },
        {
            "review_text": "Loads game for the first time. 1 server. 1 player. Joins server. Guy is AFK. Jumps over to him and right clicks. Decapitates. 11/10 would jump off the edge of the world for epic death screen.",
            "review_score": "1"
        },
        {
            "review_text": "This game changed my life 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Game looks cool from the waiting screen.",
            "review_score": "1"
        },
        {
            "review_text": "It all started with a serch for a server... i travled far and wide scrolling and scrolling till one day my monitor shon with glory as i had found it... the last server in the game only two people had uncoverd this glory, so i joind them. my pc let out a shudder of joy as it loaded. i felt my hart pump blood around my boody so fast i was dizzy and then... i was in, i looked around to only see butie and i felt a way i had never felt for a game before. i played for a while and then relised. this was the meaning of life... lord gaben had given us a gift that i could not thank him enough for. after a while on the golden server i was top of the leader bord getting a head shot ever few seconds... one of the players took lord gabens name in vain... hes dead now. lord gabens love i say, lord gabens life.",
            "review_score": "1"
        },
        {
            "review_text": "Actually pretty fun, but only if you find people on a server. Half the fun is finding the servers.",
            "review_score": "1"
        },
        {
            "review_text": "Tell me this game isn't the best. I f#@*ing dare you",
            "review_score": "1"
        },
        {
            "review_text": "Ever wanted to decapitate someone with a Frisbee?",
            "review_score": "1"
        },
        {
            "review_text": "Could it be? No. I can't. But maybe? Yes. Another game by valve that had me spewing my guts all of the floor in exitement. My inner soul was touched by Ricochet. There is just something about watching another players head fly off their torso because I threw a purple frisbee at their neck that makes me feel complete. ♥♥♥♥♥♥s occur regularly whilst you play this game. So, have the Kleenex ready and get ready to play Ricochet.",
            "review_score": "1"
        },
        {
            "review_text": "Someone sould make Ricochet: Source or people need to start playing this game again, it was awesome!",
            "review_score": "1"
        },
        {
            "review_text": "This is the reason I joined steam.",
            "review_score": "1"
        },
        {
            "review_text": "This game sucks.",
            "review_score": "1"
        },
        {
            "review_text": "Would call out of 'bounds'/10 again Timeless classic",
            "review_score": "1"
        },
        {
            "review_text": "wtf is this?!",
            "review_score": "1"
        },
        {
            "review_text": "Ricochet is one of the must fun games I've ever played. Too bad it's multiplayer only and almost no one plays it.  Seriously might buy it for people if they hit me up about it. This game really needs new players in it.",
            "review_score": "1"
        },
        {
            "review_text": "I just love this game because you have to wait forever to have someone join you, and yet nobody ever has.",
            "review_score": "1"
        },
        {
            "review_text": "Read the game's description",
            "review_score": "1"
        },
        {
            "review_text": "it's pretty noice",
            "review_score": "1"
        },
        {
            "review_text": "  too much ricochet",
            "review_score": "1"
        },
        {
            "review_text": "Small game=big chaos=rage=why am I still playing=nomination for kms award. :-)",
            "review_score": "1"
        },
        {
            "review_text": "Ricochet 2 comin' April 12 - Gabe",
            "review_score": "1"
        },
        {
            "review_text": "10% Recommended",
            "review_score": "1"
        },
        {
            "review_text": "10/10.",
            "review_score": "1"
        }
    ]
}