{
    "app_id": 603810,
    "name": "A Girls Fabric Face",
    "release_date": "2017-03-10",
    "developer": [
        "Stanislaw Truchowski"
    ],
    "publisher": [
        "TurnVex"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Horror"
    ],
    "achievements": 9,
    "positive_ratings": 67,
    "negative_ratings": 12,
    "price": 1.99,
    "description": "A brutal murder has taken place. To that, you find yourself investigating what has happened through cameras set up in the house. Upon investigating you find yourself determining that not everything is as it seems. In the end, you are faced with an important decision to truly understand what happened to the girls with the fabric face.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/603810/header.jpg?t=1489463178",
    "minimum_requirements": "OS: Windows 7 or higher Processor: i5 + anything post 2012 will suffice Memory: 4 GB RAM Graphics: Anything of fair performance post 2012 should suffice DirectX: Version 11 Storage: 1 GB available space Additional Notes: Any computer with parts made between 2013 - 2017+ should meet the minimum requirements of this game. A good way to test this is to play any of my previous games which are 100% free. If you can run them fine, you should be able to run this fine.",
    "recommended_requirements": "OS: Windows 7 or higher Processor: i5 Memory: 4 GB RAM Graphics: Anything of fair performance post 2015 should suffice DirectX: Version 11 Storage: 1 GB available space Additional Notes: I do my best to create as little performance demanding games as possible, thus, this game should be able to run on and play at a fair performance on any computer with reasonable performance capabilities.",
    "reviews": []
}