{
    "app_id": 6090,
    "name": "Armed and Dangerous®",
    "release_date": "2009-07-08",
    "developer": [
        "Planet Moon Studios"
    ],
    "publisher": [
        "LucasArts",
        "Lucasfilm",
        "Disney Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Cloud"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "Comedy",
        "Third-Person Shooter"
    ],
    "achievements": 0,
    "positive_ratings": 115,
    "negative_ratings": 18,
    "price": 4.79,
    "description": "Meet the Lionhearts. A smack-talking rag-tag band of rebels on an impossible quest. If they can make it through an army of psychotic robots and wall-smashing Goliaths, they just might save the world... if they don't burn it down first.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/6090/header.jpg?t=1542756855",
    "minimum_requirements": "OS: Windows 2000, XP or Vista Processor: Pentium III 1GHz or AMD Athlon 1GHz Memory: 256 RAM Graphics: 32 MB 3D graphics card with Hardware Transform and Lighting (T&amp;L) Compatibility DirectX®: DirectX 9.0b Hard Drive: 4.5 GB of free hard drive space Sound: 100% DirectX9.0 compatible Audio Device",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This game is the funniest game I've ever played. The graphics aren't the best but what do you expect, it's a game from the early 2000's. I honestly think that the developer's were focusing more on the humor than anything else. If you want a good laugh, then I highly recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "Armed and Dangerous follows a very similar line to that of it's predecessor, Giants Citizen Kabuto. An excellent comedy game with the absolutely awesome (yet sadly deceased) Tony Jay voicing an amusing role as an oppressive King, this follows the typical story of rebellion.  The game in itself is short, and it's way too similar to Giants: Citizen Kabuto with base building replaced by turret/railshooting sequences. With those marring marks, the game is still enjoyable enough to play through it, especially for any fan of Planet Moon's work.",
            "review_score": "1"
        },
        {
            "review_text": "'DEATH TO THE SALAD EATERS!!!'",
            "review_score": "1"
        },
        {
            "review_text": "Great game, but it looks like utter garbage on a modern monitor and the highest resolution is ridiculously low, something like 800x600  I would reccommend it if it could AT LEAST go to 720",
            "review_score": "-1"
        },
        {
            "review_text": "Epic shoot em up with humor mostly crude.",
            "review_score": "1"
        },
        {
            "review_text": "Engaging story, great writing, awesome voice acting, and fun shooting action (it has a landshark gun, what more do I need to say). From the folks who brought you Giants: Citizen Kabuto.",
            "review_score": "1"
        },
        {
            "review_text": "Yeah, this is a good game. One that would probably sate one's need for huge guts and appendages going to and fro. There is a gun that shoots a shark. It devastates opponents. Sometimes it misses- but my theory is that it never misses. It just waddles into the deep, dark void, without uncertainty, without hesitation. And it finds itself in the metaphyical realm, waiting to wriggle through...Biding, festering.   But yeah, this game is cool. A solid 7/10 at least, lol",
            "review_score": "1"
        }
    ]
}