{
    "app_id": 61100,
    "name": "Lucid",
    "release_date": "2011-07-19",
    "developer": [
        "YeaBoing"
    ],
    "publisher": [
        "YeaBoing"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements"
    ],
    "genres": [
        "Indie",
        "Casual"
    ],
    "tags": [
        "Casual",
        "Indie",
        "Puzzle"
    ],
    "achievements": 11,
    "positive_ratings": 171,
    "negative_ratings": 53,
    "price": 4.99,
    "description": "Discover a new way to match blocks in this otherworldly, Zen-like, relaxing puzzle experience. Lucid is the world's first Match-All puzzle game, in which you clear areas by combining all the blocks of an area. Enjoy the stunning visuals and relaxing sound effects as you make combos and hunt for the next perfect area to clear.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/61100/header.jpg?t=1447354413",
    "minimum_requirements": "Operating system: Windows® XP, Vista, or Windows 7Processor: Intel® Pentium® 4 at 1GHzMemory: 1GB of RAM (2GB or more recommended for XP, 3GB or more for Windows Vista and Windows 7)Hard disk space: 40MB of Hard Drive SpaceVideo: DirectX 7.0 Compatible or higherSound: DirectX compatible sound chip or onboard audio capability with the latest sound driversDirectX®: DirectX 7.0",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "  I was supplied with this key by the developer, this however did not affect the review.   If you’re looking for a change of page in your gaming style or are already a fan of matching games,  Lucid  may be the title for you to pick up.  The game is simple to get into and learn , offering some mental relaxation as well. There is no story, no bells and whistles or anything of the sort. It’s a matching game where you have to meet certain requirements to clear each level and progress through the game’s fifty-five levels.  Unlike other matching games, this isn’t a match three. You can match two or more colored blocks to have whatever size combo you desire. Using the mouse, you draw lines connecting the blocks you want to erase from the field, something I imagine  would be good on a touchscreen device . The issue I had with the gameplay was that you had to connect the blocks of the same color together, you couldn’t skip one. It’s not a huge deal but when the blocks fall randomly it made it harder to set up combos. The game also has “Lucid blocks” which, when used, will clear the board, either helping you out of a tight situation or ruining a set up you had in the works.  Despite the game mechanics trying to be different than other popular matching games,  Lucid  isn’t really that difficult. You can easily get through half of the game before ever reaching a speed bump. The game also doesn’t offer any other modes of play, once you’ve beaten the main fifty-five levels that’s it. There is also  no level select  if you want to go back and replay a level. The game keeps score for you but the score has no effect on the game and there is no leader board so I’m not sure of the purpose. The title does have achievements on Steam if you hunt for those.  The visuals are trippy, the music is trippy as well, it honestly feels like a psychedelic trip the entire time. While not the best game of its kind, it’s  a fun time-killer . I would recommend grabbing it on sale or in a bundle, the lack of other features or modes really limits the lifespan of this game. It’s a small fish in a big pond, the matching genre is very saturated and  Lucid  could do better. But, it does what it can decently enough.   For more recommendations and reviews on our favourite up and coming quality games follow  Lot's O Giveaway's  group curations  here !",
            "review_score": "1"
        },
        {
            "review_text": "This is a 'match 3' game that does exactly what it says on the store page so anyone expecting more is going to disappointed. It's relaxing, the graphic style is interesting, it's not difficult, the music is ambient, and if the announcer is real, I'd marry her for that voice alone! You play for high scores, and that's pretty much it.  The gameplay is shallow. There is no sense of progression. It's pretty much the same levels over and over.  If you are looking for a similar game with 100% more depth, content, and is cheaper (at the time of this review) check out Heroes of Hellas 3 .... but regardless, I can't thumbs down a game that delivers exactly what was promised, even though I won't be playing it again.",
            "review_score": "1"
        },
        {
            "review_text": "Do not buy.  Cant change res, Levels are set and all unbelievably easy and it takes for EVER to past the easiest ones (which are the same every time)  Don't buy this game.",
            "review_score": "-1"
        },
        {
            "review_text": "poorly made match game",
            "review_score": "-1"
        },
        {
            "review_text": "It's easy AND fun. The two most important things needed in a game. But this one has another key feature; it is also quite relaxing. 'Bet you were not eexpecting that.",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "Great game to relax with.",
            "review_score": "1"
        },
        {
            "review_text": "Fun little time waster. ",
            "review_score": "1"
        },
        {
            "review_text": "I have never played this game, but I bought it because it reminded me of a lucid dream i had about being on an elevator outside in harsh snow conditions. What happened on that elevator, well, I can't explain very easily.. Let's just say that cats who play with laser pointers are the worst snipers in the world.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun game. I found it rather relaxing. I reccommend this game to anyone with only a little bit of free time, this game is a great way to make use of it.",
            "review_score": "1"
        },
        {
            "review_text": "There are flash games better than this..",
            "review_score": "-1"
        },
        {
            "review_text": "Not a bad game to play when you have nothing better to do.",
            "review_score": "1"
        },
        {
            "review_text": "Decent little puzzle game. I got to level 44 before getting tired of it. I wouldn't buy it but I got a free copy so it was worth it.",
            "review_score": "1"
        },
        {
            "review_text": "For a 1.25 on Steam sale this was a great little purchase. As the name implies it's a simple and relaxing match-three type game with a few strategic twists.",
            "review_score": "1"
        },
        {
            "review_text": "nice and relaxing game :)",
            "review_score": "1"
        },
        {
            "review_text": "Dime-a-dozen puzzler. Nothing to recommend it really. Good graphics, but the base unit of puzzle is flawed in this game, easily wedging you into crappy dead ends. I hate puzzlers.",
            "review_score": "-1"
        }
    ]
}