{
    "app_id": 61310,
    "name": "Fractal: Make Blooms Not War",
    "release_date": "2011-11-29",
    "developer": [
        "Cipher Prime Studios"
    ],
    "publisher": [
        "Cipher Prime Studios"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Indie",
        "Casual"
    ],
    "tags": [
        "Casual",
        "Indie",
        "Puzzle"
    ],
    "achievements": 0,
    "positive_ratings": 140,
    "negative_ratings": 44,
    "price": 4.99,
    "description": "Push, Combo, and Chain your way through a pulsing technicolor dreamscape all the while expanding your consciousness at 130 BPM.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/61310/header.jpg?t=1447354040",
    "minimum_requirements": "OS: Windows XP/Vista/7Processor: 1.2 GHz Dual-Core or higherMemory: 2GB or higherHard Disk Space: 50MB",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I've owned Fractal since it was a standalone Flash game (it's since been redone in Unity) - I like the concept and I've played a fair-bit but there are some gotchas with the game as-a-whole which make it hard to recommend to others.  First-up, the game has power-ups which are not explained in any way. You're simply expected to guess what they do!? You shouldn't have to ask in the forums to find-out how a game works!?  The career mode seems designed to teach you how to play (once you figure out the power-ups) and it works upto a point, but by Level 23/24 it's descended into a horrible potluck mess of a thing. Level 24 is, imo, impossible 99% of the time - you need a very lucky layout to be able to clear it (23 isn't much better)  The game is also missing some basic features such as the ability to adjust music/sfx levels and any sort of online highscoring - this seems odd in an otherwise polished product when schoolboy designed games have this stuff?  It's all a bit disappointing really - I struggle to recommend it but I emphasise the the game at the core is a fine puzzle, it's just let down by a feeling of being half-baked and abandoned.",
            "review_score": "-1"
        },
        {
            "review_text": "This is one of those puzzle games that ha a bit of a learning curve, but once you get a feel for it, the game becomes very zen-like.",
            "review_score": "1"
        },
        {
            "review_text": "A neat little puzzle/casual game. I had fun with it, though it does seem fairly luck based compared to some other ones I've played.",
            "review_score": "1"
        },
        {
            "review_text": "Fractal is actually a very stylish looking game but it's missing a few important things; a tutorial. No, the game isn't that hard to figure out, but ask me what the power-ups do and I honestly couldn't tell you. Most of the times I just try to connect them with the other tiles, obviously, and it triggers several combos. It usually takes several tries to finish a level. A tutorial is A MUST. Another thing that bothered me is that if I notice things aren't going my way, I normally ike to retry a level. There's no button for this. There's only a pause button. So in the end I have to click up to 20-30 times in order to restart a level. This definitely needs to be implemented. Also, the text is a bit blurry, even on extremely high quality. If the developer can fix it, it will look smashing. I like the slowmotion endings, they look really cool. Now, would I recommend this game ? Yes and no. If none of my complaints is fixed, then no. If they do decide to fix them; yes.  [Rating: 70/100]",
            "review_score": "1"
        },
        {
            "review_text": "Fun casual puzzle game. Spawn and push hexagons around to clear clusters and witness exciting colorful animations and set high scores, while hypnotic music plays in the background.  Challenging arcade, puzzle, and adventure modes; and innovative game mechanics. If you like spatial reasoning puzzles you'll find this entertaining.",
            "review_score": "1"
        },
        {
            "review_text": "boring",
            "review_score": "-1"
        },
        {
            "review_text": "This game is like an Apple product: sleek. modern, and not nearly as good as it fancies itself.",
            "review_score": "1"
        },
        {
            "review_text": "This game is alright, but it's got a -serious- case of 'trying too hard to be cool.'  The game basically has you using hex-based block matching to score points, with the 'campaign' as tutorial-become-challenge mode of sorts. I'm not the best at hex matching, and that's alright, the game is fine anyway, but the stylization in the messages you get for making matches of various sizes are just really silly. How is a certain pattern of hex-matching 'Old School!'? Why does the game tell me to 'Do that again!' when I match some small cluster that was in no way creative or highscoring? If seeing 'AAAaaaAAaaAAaAAAaaa!!!' flash across my screen is supposed to make the player feel accomplished... well... you get the picture. These messages come seemingly unscaled to the level of match made, and thus lack context in addition to being eye-rolling.  There's a few UI bugs, otherwise fine. No multiplayer mode, which is unfortunate and hurts replayability.",
            "review_score": "-1"
        },
        {
            "review_text": "fun puzzle / casual game with a good difficulty curve. a total steal as part of the humble indie bundle",
            "review_score": "1"
        },
        {
            "review_text": "Very fun and addicting game. It does however turn into an endurance test towards the end which I wasn't a fan of. For what it is meant for, it's very well done and I would recommend it to anyone.",
            "review_score": "1"
        },
        {
            "review_text": "An interesting concept which while frustrating at times is rather fun. It takes a little getting used to and at times I felt the big scores I got were more down to luck than judgement but it's certainly worth a place in anyone's collection.",
            "review_score": "1"
        },
        {
            "review_text": "A kind of musical adventure combined with a puzzle of hexagons!  Fractal offers various types of gameplay which people with a sense for puzzle games will love. You get to move coloured hexagons around a playfield by placing new ones right next to them. The more connect, the more will spawn and move the others by a field in the given direction.  Main goal is to get a bloom, a flower-type of shape out of at least seven of these hexagons. Several power-ups such as exploding tiles, electric tiles, bonus tiles or push-backs are there to make that easier to accomplish.  Three given gamemodes are present, the puzzle, the campaign and the arcade mode.  In the campaign you get to play through 30 levels of randomly generated fields with given conditions, like limited turns or several colours. Goal is to get enough tiles cleared in a given amount of turns to proceed.  In the puzzle mode you have a limited amount of turns, where you get to fulfill puzzles or given conditions in order to unlock harder and longer ones. The fields are not randomly generated.  The arcade mode offers you unlimited turns, but a timer that runs out. By playing and clearing time tiles fast you get additional time and you manage to get higher scores and reach higher levels. This mode is totally recommended if you want to have a fast paced type of gameplay.  As you proceed in a level, the music will change, the closer you are to failing a stage the music will get slower in campaign and faster in arcade mode. The more progress you make, the more you will hear instruments and beats added to the current rythym, racking up combo spices up that beat too.  In general you get a great game with eye-candy, interactively changing music, wonderful game-mechanic and a decent variety of gamemodes that should keep you occupied for a quick game or two, or maybe a long-term sitting for a high-score hunt.  Puzzle away folks, it is fun and worth it!",
            "review_score": "1"
        },
        {
            "review_text": "Very fun and addicting game. It does however turn into an endurance test towards the end which I wasn't a fan of. For what it is meant for, it's very well done and I would recommend it to anyone.",
            "review_score": "1"
        },
        {
            "review_text": "As far as puzzle games go, this may not be the most challenging one out there. It is, however, one of the most beautiful ones I have come across. The best part is the music, which is continuously generated and changes based upon overall playing style.",
            "review_score": "1"
        },
        {
            "review_text": "Just bought this game from X'mas sales a few weeks ago. It's really zen &amp; challenging at the same time.",
            "review_score": "1"
        }
    ]
}