{
    "app_id": 61500,
    "name": "Age of Wonders",
    "release_date": "2010-10-01",
    "developer": [
        "Triumph Studios"
    ],
    "publisher": [
        "Paradox Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player"
    ],
    "genres": [
        "RPG",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "RPG",
        "Fantasy"
    ],
    "achievements": 0,
    "positive_ratings": 334,
    "negative_ratings": 98,
    "price": 3.99,
    "description": "Welcome to Age of Wonders, the authentic turn based fantasy strategy classic that started the hit series. Age of Wonders’ intimate atmosphere with painterly graphics still shines today. The game’s fully patched up, start building your fantasy empire today!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/61500/header.jpg?t=1536656927",
    "minimum_requirements": "OS: Windows Processor: Intel Pentium 166+ CPU Memory: 32MB RAM Graphics: DirectX compatible graphic card Hard Drive: 350MB hard disk",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Age of Wonders and its sequels remains the best of the Master of Magic heirs. The game has a number of races to play, two campaigns with branching points, tactical combat, magic systems and customizable characters. Its citybuilding is simplified, however. I'd recommend it and the rest of its family to people looking for a fantasy 4X style game though at this point they are all a bit dated and are not without frustrating gameplay aspects. But they are inexpensive and still enjoyable. I'd recommend this until something newer comes along to topple it, and so far nothing that I've played has.",
            "review_score": "1"
        },
        {
            "review_text": "If you're into the classic strategy games... this is the game for you! If you play this game for the first time it can be difficult but after a while you will really enjoy the game!",
            "review_score": "1"
        },
        {
            "review_text": "This game is my childhood, i have played this game for 2000+ hours and i still love every hour i spend playing. I have played every map many many times and have even made my own maps with the map editor, and i would highly recomend that anyone thinking about buying this game stop thinking and just buy it.",
            "review_score": "1"
        },
        {
            "review_text": "AWESOME old-school RPG, kind of like a 4X-light type of game. Great compatability with newer resolutions. Super fun gameplay. I used to play this game excessively when I was in middle school. The soundtrack is also super catchy and there's even an in-game playlist editor that lets you pick your favorite in-game tracks.   HIGHLY recommended, especially for such a cheap price. It's a classic.",
            "review_score": "1"
        },
        {
            "review_text": "This is THE best turn-based stategy game I played. The 'Tactical Combat' part is especially good - made to the perfection; makes one to use one's head a lot ;]",
            "review_score": "1"
        },
        {
            "review_text": "I love this game! One of the bests for me. Great strategy game with fantasy and rpg themes. It has singleplayer/multiplayer/singleplayer-campaign and you can play 'classic style turns' or 'simultaneous'. You are represented by the lord of your people and can not let him die. Your character levelup like any good RPG, and his people too. You can choose abilities and powers from a big list to customize your character and make him a good fighter, mage, or ranged attacker... This game offers 12 fantasy races really cool to play. The look is clean and simple. This comes with a map editor too for those who like it. Also this game has female portraits for girls. Negative side: AI is very stuppid and need to 'cheat' to be challenger! It has few official big maps with only 'after the fall' really nice for 12 players. Some units are unbalanced and schools of magic too. The cities do not have many improvements to make. And the worst is: the game crashs some times. For me the downside does not overcome the positive. Sadly games 2 and 3 of this franchise does not have the same qualities. I support a remake of this game with modern graphics.",
            "review_score": "1"
        },
        {
            "review_text": "The only truly fun game of the Age of Wonders series, Does not work well on Vista but does on Windows 7.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing, old school favorite. Slightly buggy, but autosave feature keeps you from losing much progress. 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "Brings me back to my youth. Awesome game still.",
            "review_score": "1"
        },
        {
            "review_text": "Great turned based oldy here. Ive been playing this since i was 8 years old",
            "review_score": "1"
        },
        {
            "review_text": "Underrated classic :)",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game and I would love to play it but unfortunately it is bug ridden. Through fiddling around and looking for solutions I have managed to get it from crashing every second to crashing every 40 min. It is just not playable.   Bottom Line: It's an old game that struggles to work on new systems. ",
            "review_score": "-1"
        },
        {
            "review_text": "I really don't understand how this game could have scored so many positive reviews. They are probably all from people who don't know the original games this one is a pale copy from. If you want some good turn-based strategy, stick to Heroes of Might and Magic 3, or try Masters of Magic.  Ok, now, what is my problem with this game? It really doesn't take long to explain: it just lacks content. It gets boring after few hours. Not only is there nothing I haven't seen before in other games, there are also missing many elements that make other games interesting. For example, there are only two(!) ressources, mana and gold. All upgrades to your cities only produce units, there are no other boons (like, gaining items, some ressources or boosts to hero stats). The AI is rather stupid, even after a few hours of playing it's totally simple to win fights with few losses even when you're outnumbered. The diplomacy screen is a joke, you can't even trade technologies (i.e. spells).  I have to admit that I haven't played long enough to see even a fraction of the spells available, those might still cut it. I'll play on a bit (though bored already) and if they do, I might change my review.",
            "review_score": "-1"
        },
        {
            "review_text": "Despite its age this game remains wonderful. It's the one I enjoyed most of the whole series, thought admitedly I didn't play much of the others. Just ensure that you run it on window mode, that's the only way it works (in windows 7 at least).",
            "review_score": "1"
        },
        {
            "review_text": "A 'classic' game that pretty much belongs in anyone's library if they're into that kind of thing.  The gameplay is straight up turn based strategy with some story text to read between campaign scenarios, and was probably pretty fun in multiplayer back in the old days of early 2000s but any community that used to exist in that regard is probably long gone.  Campaign scenarios can range from ridiculously short to ridiculously hard, and from 30 minute sessions to hours and hours, but is generally pretty fun and has good moosik.",
            "review_score": "1"
        },
        {
            "review_text": "An amazing game that a friend introduced me to during middle school. Finally found it here on Steam years later while in college. Still a fun and fantastic strategy game. Not the most challenging one out there but great if you're looking for something simple to pass the time. Also must recommend the soundtrack for having some great pieces.",
            "review_score": "1"
        },
        {
            "review_text": "Rated 5/7",
            "review_score": "1"
        },
        {
            "review_text": "A classic. 10/10. Beautiful artwork. Beautiful music. I enjoyed the lore and campaign storyline. Very high replayability with using skirmish and lots of races.",
            "review_score": "1"
        },
        {
            "review_text": "old school fun",
            "review_score": "1"
        },
        {
            "review_text": "Old school turn-based strategy game I recommend to all my friends.",
            "review_score": "1"
        },
        {
            "review_text": "Well, to be honest I love this game from a very long time.  It's old but it does never became outdated. And there is a great community (search in the web and you shall find it quite easily) that makes a lot of good maps.  Well I suggest you to start from this one, and if you like the genre and the gameplay go play the other 2 sequels: AoW2 and AoW Shadow Magic. I still don't have played AoWIII so I won't say anithing about it, but for the videos it seems quite cool.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty much in my top 3 favorite games ever. Incredibly solid game with tons of content and beautiful music.  The simplistic artstyle is really pretty and much nicer than the sequels. If you choose to manually fight the battle you get a huge battlefield map where you can position your units and the environment of the battlefield map changes depending on where you picked the battle in the over-world. For example if you engage another unit on a bridge the battlefield map will be a huge bridge etc.   The sequels removed the big battlefield and carefully positioning your units. It made the battles faster but also not as engaging. I would recommend this original game over the sequels which I don't like.",
            "review_score": "1"
        },
        {
            "review_text": "One of the top turn-based strategy games ever made!",
            "review_score": "1"
        }
    ]
}