{
    "app_id": 61700,
    "name": "Might & Magic: Clash of Heroes",
    "release_date": "2011-09-21",
    "developer": [
        "Capybara Games"
    ],
    "publisher": [
        "Ubisoft"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Partial Controller Support",
        "Steam Cloud",
        "Valve Anti-Cheat enabled",
        "Steam Leaderboards"
    ],
    "genres": [
        "RPG",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Puzzle",
        "RPG"
    ],
    "achievements": 14,
    "positive_ratings": 1293,
    "negative_ratings": 157,
    "price": 8.59,
    "description": "Scattered across five different regions, five special heroes must travel their own dangerous paths to grow in strength, unravel a demonic plot & ultimately save the world from chaos.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/61700/header.jpg?t=1447354560",
    "minimum_requirements": "OS: Windows® XP / Windows Vista® / Windows® 7 Processor: 3.0 GHz Pentium 4 or 1.8 GHz AMD Athlon64 3000+ Memory: 1 GB Windows XP / 1 GB Windows Vista – Windows 7 Graphics: 256 MB DirectX® 9.0-compliant card with Shader Model 3.0 or higher (*see supported list) DirectX®: DirectX 9.0c or higher Hard Drive: 1.6 GB Sound: DirectX 9.0-compliant sound card *Supported Video Cards at Time of Release: ATI Radeon™ HD 2000/ HD 3000/ HD 4000/ HD 5000/ HD 6000 series  NVIDIA® GeForce® 7600GS / 8 / 9 / 100 / 200 / 300 / 400 / 500 series",
    "recommended_requirements": "OS: Windows 7 Processor: 2.0 GHz Intel® Core™2 Duo or AMD Athlon™ 64 X2 6000+ or better Memory: 2 GB Graphics: 512 MB DirectX 9.0-compliant card with Shader Model 3.0 or higher (*see supported list) DirectX®: DirectX 9.0c or higher Hard Drive: 1.6 GB Sound: DirectX 9.0-compliant sound card *Supported Video Cards at Time of Release: ATI Radeon™ HD 2000/ HD 3000/ HD 4000/ HD 5000/ HD 6000 series  NVIDIA® GeForce® 7600GS / 8 / 9 / 100 / 200 / 300 / 400 / 500 series",
    "reviews": [
        {
            "review_text": "I enjoyed the challenge of the battle system. Not a conventional match-3 system; it took a while to get the hang of the battle system. Campaign playthrough took 20-24 hours. I enjoyed the Campaign play-through; I don't expect to replay it.  Even after getting the hang of the battle system, the randomness inherent in the battle system resulted in fairly frequent bad luck for me and sometimes very good luck for my opponent. Some of the set battles are rough, even with leveled units.  I needed to fight side battles and do bounties to level my units up enough to complete the Campaign. Some of the set battles are rough, even with leveled units. Just gotta be persistent in retrying. The Campaign mostly doesn't punish you for death or retreating. Even when it did, I just lost a bit of my excess currency-- no big deal.  I like the art style. Very stylistic. No blood or gore. I felt that the females were clothed tastefully, certainly better than most games treat female characters these days. Kid-safe.",
            "review_score": "1"
        },
        {
            "review_text": "I've previously played the DS version of this game and enjoyed it quite a bit. Even after completing the main campaign the quick battles offered plenty of entertainment.   For the lack of any specific term, Clash of Heroes is turn based block matching/puzzle strategy. The game is very pretty and not too hard once you get the hang of it. The story is nothing spectacular. I personally can't remember any of it, but you get to play several characters who all have their upgradeable units, special abilities and mini campaigns that match their theme. The elf dudes have their unicorns and necromancers have their skeletal dragons, you get the idea.  Addendum: The PC version is more balanced than the DS version when it comes to damage dealt by special attacks.",
            "review_score": "1"
        },
        {
            "review_text": "Overlooked turn-based strategy gem. I learned to love it on my NintendoDS, still an awesome game on PC.",
            "review_score": "1"
        },
        {
            "review_text": "Played this ALOT on PS3, both offline and on. Loved it to death. It's about matching colours.  And I gotta say, it feels way better on PC.  Less loading times, smoother graphics and just has an overall better feel to it, and I might be wrong but it feels more challenging, alot more challenging, which by all means is a good thing.  This game is a combination of turnbased puzzle, tactics and quick thinking (online). If you enjoy smaller games, which you can jump in, play 30 minutes, then drop out, this is for you. If you enjoy sitting hour after hour, this may very well also be for you.  Story; not so good. Gameplay; gooood.  ",
            "review_score": "1"
        },
        {
            "review_text": "If you love Heroes of Might and Magic, then think of this as the same game without the constant resource gathering portion of it. All you do in this game is fight. The fighting has a bunch of new strategies such as linking, fusion and special hero abilities. I haven't beaten the game yet, but I'm on almost 20 hours of gametime and am still enjoying the strategical depth of this game. Plus the story fits right into the Might and Magic world and while it's not the primary source of entertainment, it definitely adds to the value of the game.",
            "review_score": "1"
        },
        {
            "review_text": "A turn based puzzle game from the world of Might &amp; Magic. Innovative and fun. Play through the campaign, unlock new chars, battle online in different modes. Totally addicting game. There is also an addon aviable.  I played the non-steam version but there was a good offer: main game+DLC. I wasn't able to resist and playin through the game for the third time.  Need more info? Just look up 'ontheline'  µ® 1337 4u70|2",
            "review_score": "1"
        },
        {
            "review_text": "Arguably the best puzzle/tactics game of the recent generation, Might &amp; Magic: Clash of Heroes is highly addictive because of its elegantly simple yet engaging turn-based strategy gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "Ever since this game was introduced to me by my friend Liam, i've been addicted to it.  It's such a good puzzle game and really rewards clever thinking and forward planning. Think chess meets tetris sort of, It has an awesome multiplayer and...oh my god the music. How can anyone dislike the music?! It's so dramatic and entrancing, i ended up getting the soundtrack just so i could hear it on demand. Totally badass stuff.  Different teams have different abilities and special units, but i much prefer the undead team of vampires, ghosts, zombies etc   The game looks beautiful too; there really isn't anything bad i could say about it. I suppose they could have made a few more music tracks for battles, but i say that only because i love the handful they have already!",
            "review_score": "1"
        },
        {
            "review_text": "An addicting puzzle combat ish game with different factions and heroes to spice it up. The story is surprisingly long, i've clocked 42.4 hours on the game and still fail to kill the final boss. (Do note maybe I just suck at the game :P) It's also great to play while watching a movie/episode since it is turn based and you can just look away when neccesary.",
            "review_score": "1"
        },
        {
            "review_text": "Verdict: This one was a surprise. A beautiful, polished game with excellent presentation, surprising strategic depth and a simple but engaging story. The best Heroes of Might and Magic game for quite some time. 8/10  Story: The story is simple and light but, married with the clean presentation, is still an endearing and somewhat engaging experience. Straightforward but nevertheless interesting characters will appeal to most people, and the big names to Heroes fans in particular. 6/10  Gameplay: I should start this by saying that I hate Match 3 games with a burning passion. But it feels wrong to even call this Match 3; it feels more like genuine turn-based strategy. Each side takes turns moving units around to match three and create ‘formations’, which then attack the other side. This is simple at first but, as you unlock new units and combinations, it becomes much more complex and interesting. It’s a very well-balanced game with offensive, defensive and mixed strategies all being equally viable. 9/10  Graphics: The presentation is excellent, colourful and polished, and the attack animations are powerful. It’s surprisingly fun to see classic Heroes characters rendered in an anime style. 8/10  Sound/Music: The sound is great and the re-mastered soundtrack will cause Heroes fans to reminisce like crazy. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Fun little puzzle RPG. Updated visuals from the original NDS version, the game is a bit lacking in the story department, but the depth of the combat makes up for it.  I consider the original NDS purchase to be well worth it, so at the discounted steam price, I can easily recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "nice time waster puzzle game",
            "review_score": "1"
        },
        {
            "review_text": "Really epic, great strategy game.",
            "review_score": "1"
        },
        {
            "review_text": "awww snap, so chill",
            "review_score": "1"
        },
        {
            "review_text": "- If you like strategy/rpg games, and want a good experience then definitely pick this one up 8.5/10 :D",
            "review_score": "1"
        },
        {
            "review_text": "The gameplay is fun, the battles are like a strategic puzzle game, combining coloured units to achieve an effect. unfortunately, I feel like teh story gets in hte way. there is nothing wrong with the story, it just doesn't interest me an awful lot. I feel like the gameplay could work really well if the story sections were a bit more compelling.",
            "review_score": "1"
        },
        {
            "review_text": "I adore this title. The story is interesting though somewhat basic. It held me interest to the end and didnt dissapoint.  The gameplay is simply amazing. I love the blend of rpg and tatical elements. I have never seen a battle system quite like this and am amazed that there hasn't been more. I will by any DLC or expansions released for this and really hope they make a sequel.  (Played this on ps3 which is why my hours are low. Just bought it again on steam to support this game)",
            "review_score": "1"
        },
        {
            "review_text": "Great game with a good LOCAL (and online) Mutliplayer. Especially it is a different kind of multiplayer game, than most others, this makes it interesting! All in all good combination of puzzle and strategy game. It sure has some luck involved, but this makes the games different. It may get repetitive after some while. But playing it from now and then is always fun.",
            "review_score": "1"
        },
        {
            "review_text": "I bought two copies of this game (for myself and for my wife). This is one of the best quasi-logical turn-based strategy I've ever played. There is a hotseat option if you prefer to use one computer. It may seem that victory to some extent depends on random factors but in fact good strategy makes you able to trick the fate;-).",
            "review_score": "1"
        },
        {
            "review_text": "Really fun game!",
            "review_score": "1"
        },
        {
            "review_text": "While this game should probably be categorized as strategy, not RPG, it's hard not to like the simplicity of the battle system at first glance, and the complexety of it with further practice. The game is fun, though I really did expect something different when I bought it. It's MUCH more a strategy game, mixed with puzzle aspects, than an RPG.  -Caid.",
            "review_score": "1"
        },
        {
            "review_text": "Big surprise, I expected to see a failure and a sacrilege as I'm the old HOMM fan. What I got was a highly addictive game with simple rules and catchy plot. I still didn't beat it, but I'll try it again. Unless you have an anime sickness (it's graphic style reminds of these, though it's a bit westernised) I'd recommend this game to anybody, it's really interesting and. believe me, I'm a demanding player :)",
            "review_score": "1"
        },
        {
            "review_text": "Havnt enjoyed a game like this in a long time, you can just log in whenever and have a quick satisfying battle, and the campaigns quite interesting too, best local coop I own to boot.",
            "review_score": "1"
        },
        {
            "review_text": "Worth playing just for the artwork alone. Add the great strategy game play, RPG elements and an entertanining story and you have something really special.",
            "review_score": "1"
        },
        {
            "review_text": "Good old-school-style RPG without pixel graphic and asian nonsense(Finaly fantasy), music from Heroes V and with unique battle concept, which is fun.",
            "review_score": "1"
        },
        {
            "review_text": "Its Tetris heros time. fun game and very fun 2V2 multiplayer. be warned though, because if you play using the wizard character from the DLC, everyone else needs to have the dlc or the game will crash. other than that. get all of it and enjoy Fists of Hope!!",
            "review_score": "1"
        },
        {
            "review_text": "some texts are missing, so don't really know what happens and when it wants to save game (i guess it was save) i got no idea what im doing, but overall, nice game",
            "review_score": "1"
        },
        {
            "review_text": "I'm a huge fan of puzzle games, and even though the match 3 mechanic has been used on a multitude of other puzzlers; I feel that Clash of Heroes presented it in a way that still feels unique to me. The story is great, and it has a decent play-through time; but the bulk of my over 70 hours of playtime has come from the hotseat multiplayer. You can play a quick 20 minute amazingly fun hot-seat game with a friend with all of the artifacts and characters that you have discovered throughout your single-play through run.  The graphics are charming, the music is enjoyable, it has high replay value and a great puzzle/rpg mechanic. Very much worth it in my opinion.",
            "review_score": "1"
        },
        {
            "review_text": "3.5/5 Puzzelgame with storytelling in form of text. Weirdly inticing gameplay. A M&amp;M lorefans must play. Im not into it but still got me playing it like a 30yo bearded dude who lives in his mamas basement.",
            "review_score": "1"
        },
        {
            "review_text": "I loved this game when it was on DS and it is great to play with family.",
            "review_score": "1"
        },
        {
            "review_text": "This is an excellent puzzle game, worth owning on the DS, and worth buying again on the PC!",
            "review_score": "1"
        },
        {
            "review_text": "An unusually well-crafted and engaging puzzle game which incorporates high fantasy and turn-based gameplay into a seemless blend of superb gameplay. Highly reccomended.",
            "review_score": "1"
        },
        {
            "review_text": "This game took me a bit by surprise. I originally bought it on my android phone because it was on sale and while I liked it I had a bit of trouble getting into it because I had a hard time seeing some of the unit colors clearly on the small screen. When it went on sale on steam over the holidays I grabbed it and have been pleasantly surprised by the mechanics of the game. You can develop your strategies based on how many turns your units take before they attack and what particular strengths they have. Using different types of units can allow you to build up waves of attacks that complement one another. So, I have found that for what I was expecting to be a fun but not terribly complicated game it actually has some decent depth to it.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic RPG strategy blended well with a puzzle game. It's like battle ship meets bejeweled, but in a really smooth way. The game's predecessor is called Critter Crunch, and it follows some simple mechanics!  It features an anime storyboard in between campaign missions. Something 'bout a magic helmet that summons demons 'n ♥♥♥♥  I highly reccomend this game if you like any of the following: Bejeweled, Battleship, Fire Emblem, Yugioh, Puyo Pop, Heroes of Might 'n Magic, and your mom.",
            "review_score": "1"
        },
        {
            "review_text": "I had fun with it.",
            "review_score": "1"
        },
        {
            "review_text": "I first played this game on my brother's ps3 and had been waiting for the steam release ever since. It's a fun twist on the match 3 puzzle games with a greater emphasis on strategy. The 'drops' you get to start each game don't play huge factor in determining advantages, so the role of luck is minimized (but obviously not eliminated completely). Characters' abilities, units, and items are fairly balanced and diverse, and I felt comfortable switching between them all except for the necromancers (even though my experience is that the necromancers were fan favorite when playing online multiplayer). The plot is nothing spectacular, but enough to keep you engaged in the game.",
            "review_score": "1"
        },
        {
            "review_text": "This game Owns!!!!!  Seriously, the mechanics are quite solid &amp; it has a multiplayer via Steam.",
            "review_score": "1"
        },
        {
            "review_text": "buy this ♥♥♥♥. its like chess, only mixed with the ancient games of fire emblem and puzzle quest. ancient.",
            "review_score": "1"
        },
        {
            "review_text": "Very original hybrid of mild RPG and match-3 style games, and the PC version is a nice expansion on the original Nintendo DS version's gameplay.   A great time killer if you want to play it windowed while multi-tasking or don't have the time to get into something deeper.",
            "review_score": "1"
        },
        {
            "review_text": "A pretty simplistic game in appearance that reveals its complexity through a single hour of playtime.  The basic 3-units principle(to make an attack, three vertical units of the same colour, to make walls, three horizontal) gets immensely complex and varied once you add links(having groups of the same colour attack at the same turn) that reinforce your attack, fusions(two attack groups one behind the other fuse into one group twice as strong), and of course Elite and Champion units that require 2 and 4 units to activate them.  Almost every single unit from every single race has a specific capacity, poison, jumping over walls, magical defenses, immunity to attack while charging, hacking the enemy lines/enemy charging power while charging, the variety added to the basic 3-units system makes this an incredibly capable game with possibilities that never seem to be insufficient no matter the circumstances. You can literally be about to be killed by your enemy, call reinforcements, and find yourself gifted with a generous unit placement that allows you to build the walls and defenses you need to just survive and counterattack to victory. There is a freshness in this game that never dies out.  It's actually one of its greatest strengths and weaknesses, how random the battles can go. You can be gifted with a perfect line of units from the very start or have absolutely nothing to go on with. The game can be very frustrating when a perfectly planned attack is ruined by the sudden arrival of an enemy Champion just in the column you're about to use to finish off your foe. It can also be frustrating in the other way: you will call reinforcements to see one of your costly Champion units die immediately at the hands of some basic enemy attack with 2 attack because you couldn't get it moving in time.  As frustrating and unfair as the randomness is, it is also one of this game's best aspects. The only reason I speedrun this game is that it has the merit of never(apart from the tutorials) making me feel like déjà vu. Every battle is at least new enough, no moments in the game feel like I've been here before(except the bosses, of which there are only 4, along with quite a few unfair pre-prepared battles) and even when it does happen, the randomness of the reinforcements usually palliates that very quickly.  Gameplay-wise, it's simply excellent. Having played through the campaign quite a few times for speedrunning, I have yet to find this game to bore me at any point, and it's quite surprising to realise how a simple system can be at the same time constantly demanding and very free. A good example is the fusions: if you want one, with core, Elite or Champion units, you're gonna have to get rid of all your walls first, since you need six tiles to make any fusion and there are only six between the goal your enemy has to hit and your first line.  Beyond that, every hero has got his own superpower which can range from somewhat poor(hello Cyrus) to ridiculously broken when you know how to use them(hello Aidan with lots of walls, Anwen with a clear opening, Markal with two uncharged Death Knights).  Beyond beyond that, artifacts can be found in many flavors in the campaign and then used profusely in skirmishes or online battles. And the variety there is by no means inferior to the one in the units, although I'm sure everyone will end up using ridiculously strong artifacts like the Spider Cloak, Lion's Mane or Celerity Ring.  On a side note, the balancing of the campaigns is a bit poor. Why is Nadia not only ridiculously rich in HP(she starts at level 7 out of 10!), but also given enemies that play defensively, troops that make almost no damage, and is also generously dotted with Academy enemies, who can raise layers of superwalls like drinking a cup of coffee? It makes her campaign ridiculously long and just unpleasant. The times I get for Anwen range under 50 minutes, Godric takes less than an hour, Fiona has a rather long campaign that takes about 1h10 minutes, Aidan has a rather short campaign that also takes less than an hour, and Nadia ends up taking me 1 hour 40 minutes!  Continuing on the bad side, the story is completely ignorable. It's not bad(no big plot holes, awful writing or terrible characters) but absolutely nothing about it feels in any way original. The characters almost feel stereotypical, you have the courageous and honorable big brother, the courageous but more sheltered little sister, the more angsty teenage younger brother, the huntress of the woods, the good student girl who fights the good fight...  All of their personalities can be written in a quick line and although they never made me facepalm(none of the main five anyway), the last thing I wanted was to be tasked with finding an interesting personality trait among them. I don't mind finding needles in haystacks, but this is just impossible.  The story is of the same type, it's nothing awful, but it doesn't convey anything even remotely amusing or deep. It ends in a happy note that works but doesn't really follow the somewhat tragic storytelling we had for most of the game. It's not really light on clichés and nothing about it is worth mentioning. I had a laugh once in the entire game. A giggle, really, at the demon who dies from the volcanic eruption he wanted to see. The rest is skippable. Special mention, though, to the villains: they range from comic relief(Azexes and his forgetful schoolboy behavior) to so obvious it hurts(Carlyle and his fashion for being a general ♥♥♥♥).  Visually, I like the animé art style quite a lot, and the quality of the animations is certainly very helpful at making it a nice game to watch. I do have a serious issue about those: they're long. REALLY long. Sometimes it's ok, but seeing the knight twirl his spear around before charging for the 1000th time has really grown old. Less long animations would've really helped in making the game a lot more fun. The PLAYER TURN and ENEMY TURN screens are also ridiculous, they last something like 3,5 seconds! Talk about a needless loss of time! Those could've simply not existed and all would've been better.   As much as I appreciate the animé visual style for almost everyone, some races are totally failed: the good guys and necromancers are mostly fine, but the magicians' golems or titans look nothing like the machines they are, although that's nothing in comparison to the Demons and how every unit but the hound is failed. Even when lit with flames and about to strike, I find it difficult to take the immense Pit Fiend more seriously than a plushie. Demons look neither scary nor ugly, and that's a true minus for me.  With all that said, the last element is the music. It sucks. No other way to say it. This game has very poor music. Out of five campaigns, forests, a capital city of men, the land of the undead, Hell, and a mighty Magician tower, I remember exactly zero theme songs. Why? Because there aren't any songs. It's all ambients. BAD ambients, with no memorable sounds at all. Whooshing winds and shaking leaves, that's all.  The battle musics are thankfully very varied, however that would be a good thing only if they didn't all suck as well! Out of the eight or so battle themes, there is one I like. The final boss music is fine too. The victory theme(the first 4 seconds of it anyway) and the two former are the only songs I can say I appreciate musically out of the whole game. Having played HoMM5 before, I know that many of these songs were taken from the rest of the franchise and sort of put in this one. It doesn't fit, none of the songs are that good, so it's a game that is terribly uninteresting musically.  A lot more could be said about bad minigames, Sonic 06-type loading times(two loading times into each battle), but I reached the limit. Final word is that despite my complaints, this is an incredibly fun and varied game that always develops into more complexity and fun. Try it.",
            "review_score": "1"
        },
        {
            "review_text": "Played this game as fully as I could. The story was uninteresting but I the puzzles are fun and can be challenging!  Takes skill though when you go head to head with others online.  Seems simple to match colours and shapes but can get frustratingly tricky!  ",
            "review_score": "1"
        },
        {
            "review_text": "A brand new look of the world of Might &amp; Magic. The puzzle-battle system might be inspired by Bejeweled, I think. Anime style is acceptable.",
            "review_score": "1"
        },
        {
            "review_text": "Addictive as hell.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best strategy games out there, though it's just played by few online players",
            "review_score": "1"
        },
        {
            "review_text": "Worth playing just for the artwork alone. Add the great strategy game play, RPG elements and an entertanining story and you have something really special.",
            "review_score": "1"
        },
        {
            "review_text": "Clash of Heroes is a puzzle RPG, where you attack by matching units vertically and defend by matching horizontally. Other things like artifacts and hero-specific spells make the battles more interesting. The puzzle combat is a lot of fun, and the RPG elements add quite a bit to it.  The story wasn't bad... much better than what I expected a puzzle RPG to have. The graphics are colorful, distinct, and done well. The sound was pleasant, though not memorable.  The only real problem I have with it is that a lot of units have unique abilities, and it never tells you what abilities your opponents are using until you get them for yourself. It really sucks when you die because you didn't realize that all Nightmares fire at the same time.  Puzzle game fans should absolutely get Clash of Heroes. It's definitely worth it, even at full price.",
            "review_score": "1"
        },
        {
            "review_text": "It's impressive hwo much fun this weird little thing is. It's the Puzzle Quest followup Puzzle Quest never had: A natural evolution of basic puzzle mechanics and storytelling.  I also know a lot of old-school Might &amp; Magic fans who want to kill the people who made it with pitchforks.  Gaming, you are a cruel mistress.",
            "review_score": "1"
        },
        {
            "review_text": "Insanely fun! I was blown away by this game as soon as I got into the first fight. The gameplay mechanics are perfect. Turn based rpg, puzzle elements, and strategy are blended perfectly without being overly complicated or too simple. Clash of heroes plays a bit like Stratego crossed with Tetris. The cartoon style graphics fit perfectly with the simplistic gameplay. This is what happens when a studio focuses on gameplay and fun instead of sinking half the games budget into HD graphics and advertising. There's a demo here so you have no excuse not to give this a try.",
            "review_score": "1"
        },
        {
            "review_text": "3.5/5 Puzzelgame with storytelling in form of text. Weirdly inticing gameplay. A M&amp;M lorefans must play. Im not into it but still got me playing it like a 30yo bearded dude who lives in his mamas basement.",
            "review_score": "1"
        },
        {
            "review_text": "I remember playing this game on my DS when I was a kid and I was very happy to hear that it was put on Steam!",
            "review_score": "1"
        },
        {
            "review_text": "Its great to play alone and with friends :d",
            "review_score": "1"
        },
        {
            "review_text": "I feel like this game has only started to open up to me. Played it a good bit on DS, then Ps3, now here. It's a great game, and well optimised enough to have open in a window.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great!  This is a tactical puzzle game embedded into a role-playing game story.  -The game mechanic is original (as of my knowing), deep and satisfying. -The campaign is long enough, with a 'standard' but nicely put rpg story. There also are quite a bunch of secondary objectives and challenges that add to the game longevity. -Graphics are clean and cute. ",
            "review_score": "1"
        },
        {
            "review_text": "This game is great. Despite the simplistic plot, it has a certain quirky charm, simple but fun characters, and unique and fun gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "Fun, addictive and simple. Nice puzzles in the middle of a chess like combat.",
            "review_score": "1"
        },
        {
            "review_text": "I'm going to drop the bomb right off the start: I've had very little exposure to the M&amp;M games thus far and I can't say I'm a great fan.  I may have played a few rounds of HoMM3, and a bit of campaign in HoMM5, but all in all, turn-based games aren't really my thing, though I really see the magic that draws people to them.  That being said, I really enjoyed this one.  My ignorance of the M&amp;M lore didn't stop me from immersing myself into this lil' thing, quite the contrary: I'd say it's a great introduction to the world, the characters, and the lore. The storyline is a simple, multi-arc adventure, saving the world included, and the characters and their motivations are simple as well. And it's OK. It doesn't need to be great and amazing and crotch-squeezing and so on, it needs to justify the gameplay and it does that pretty well.  The gameplay itself, mainly focused on combat, is a mixture of 'connect 3' and turn-based battles between armies. It might seem odd at first, but once you get the hang of it it's GOOD. Makes you want to push forward and beat just-one-more-enemy and then it's 3 AM all of a sudden. The only issue here is that it might be a bit repetitive, but during those 5 arcs of the game we take hold of 5 different armies, so you need to re-think your strategy with each one.  It makes a nice break in between bigger games. :)",
            "review_score": "1"
        },
        {
            "review_text": "A nice mix of Tetris and round based classical strategy. Worth a look!",
            "review_score": "1"
        },
        {
            "review_text": "this game for, those who have played the other Might and Magic games, brings an interesting gameplay mechanic that I find to be, well interesting, and I don't know if you'll enjoy it but I sure do :)",
            "review_score": "1"
        },
        {
            "review_text": "Connect 3ish puzzle game worth skipping.  It's clearly designed for a mobile platform and has no business as a desktop pc game.  +tactical connect-3 game. +core game different from standard connect-3 gem games. +colorful +app is stable  -animations waste time. -story wastes time. -repetitive.  -unit variety makes little difference. -button presses and movement intended for mobile game.",
            "review_score": "-1"
        },
        {
            "review_text": "Good game, but not a good game for colour blind people. I hope one day, that if will be possible on Steam to flag a game for not being colour blind friendly.",
            "review_score": "-1"
        },
        {
            "review_text": "Game was meh, much play relies on luck.  That unskippable credits after finish though. Not cool man, not cool. There are probably better puzzle games out there.",
            "review_score": "-1"
        },
        {
            "review_text": "Only small children would like this game. It does not merit its title. This game may be to challenging for the small children who might like it. The game play mechanics are so wrong for the franchise.",
            "review_score": "-1"
        },
        {
            "review_text": "Meh, its ok but not something that's to interesting.",
            "review_score": "-1"
        }
    ]
}