{
    "app_id": 6250,
    "name": "Making History: The Calm & the Storm",
    "release_date": "2007-03-13",
    "developer": [
        "Muzzy Lane"
    ],
    "publisher": [
        "Strategy First"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player"
    ],
    "genres": [
        "Action",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Action",
        "Grand Strategy"
    ],
    "achievements": 0,
    "positive_ratings": 460,
    "negative_ratings": 107,
    "price": 3.99,
    "description": "Making History&reg; delivers the open-ended gameplay of strategy-game classics, but with compelling new economic, military, and diplomatic systems and deep research that lets you play with real historical challenges.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/6250/header.jpg?t=1447350978",
    "minimum_requirements": "Windows XP, 2000 or Vista Operating System, Pentium III or Athlon 1.0GHz Processor, 512 MB RAM, 850 MB available hard drive space, 32 MB Video Card, Internet connection for multiplayer",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Very fun UNTIL you run out of coal during the war, at which point NO ONE wants to sell any and unless you have a 2 billion dollar coushon your economy is going to tank, this was playing as mexico anyway, basically I've found that there is a lot of skipping to the next turn because you have to skew your build more towards economy than military or research, as far as the actual combat goes, eh not TOO exciting but it'll give you a kick the first few times, however Civ V has better looking combat but less realistic strategy so it's a horse a piece, also if you play as mexico... DO NOT ATTACK THE SMALL PEEPS. IDC HOW TEMPTING IT LOOKS DO NOT. YOU WILL RUIN THE REST OF THE GAME FOR YOURSELF.  Solid 7/ 10",
            "review_score": "1"
        },
        {
            "review_text": "Declared war on Cuba, Went bankrupt, got annexed by Canada  15/10 would invade canada first  i didnt think people will notice this lol ok serious review   i only have a little bit of time in this game but i can tell you now that this is a real serious rts, economy is your worst enemy.  Pros -be ANY nation you wish -very indepth administration aspects  -canada is OP -change the course of history (want hitler to win? go for it)  cons -not good for casual gaming -not a very friendly User interface -not as 'addicting' as other rts/4x games such as Civ 5 or AOE  8/10",
            "review_score": "1"
        },
        {
            "review_text": "Hours apon hours of fun, especially if you take up modding. Thats mainly what I had fun with, making little scenarios with new nations and all that. Great game, 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "I had only played the Gold version before and now that I picked this gem on Steam for under a euro I can say - they are very different. At first I thought that the only difference is the lack of some campaign scenarios - mainly the one that starts at 1933 and gives you so much time to develop them unstoppable armies! But after I played one of the shorter ones I came to some conclusions:     the color palettes are a bit off and not so smooth on my eyes - easily changed in the Gold version    the infrastructure is VERY slow to develop - really 72 turns to upgrade one level? And I thought Gold taking 17 turns was slow.    HUGE maintenance costs! Why spend 1/5th of the campaign in upgrading a slot if in the end it will cost half your GDP to maintain? No such problem in Gold.    at first I thought 'Why does research cost so little points? Now I can pump Heavy tanks before everyone else!' - yeah but no - research is compleatly RNG based so even at full IPU those 25 research poins can take 100+ turns to make...    all units have only one combat 'value' which makes gameplay blunt as it doesn't matter what armies you build. In Gold each unit has Attack and Defense - this for instance makes infantry very hard to deal with and while tanks have huge attack power they are probably the first to fall in battle due to low defense.    a lot of other nitpicks that I could point out but they aren't that gamebreaking.   What I am trying to get at is this - there are a lot of balance issues with the game but chances are unless you've played the Gold version, you might not notice some at all and thats good. Just letting you know there is a better version out there that is   currently not on Steam . That being said I still think this series is amazing.  5/10  8/10 for Making History: The Calm &amp; the Storm Gold Edition  Edit: Gold is LIVE on Steam! Pick it up!",
            "review_score": "1"
        },
        {
            "review_text": "This game is very cheap, and for that amount of money you should buy it. People who are interested in such games should TOTALLY buy it.  After finishing the tutorial and some rounds for test you will be able to play it, so it is very beginner-friendly (A beginner like me, I have never played such games before).  In those 23 Hours I started to love this game, I had so much fun with it!  For like 4 Bucks I recommend it by 100%.",
            "review_score": "1"
        },
        {
            "review_text": "ENG:  The game is currently the best in my opinion, but also realistic version of turn-based strategy game, with involvement of the egologia, as well as the state economy. The game also will be able to play in their own State, and the impact on the game completely all potential economic and course of the war. Most similar games such as Civilization game or beyon Earth game, so this also includes similar elements such as industry or army updating with the difference that they have been implemented in this game better. How so?  Above all, I personally very much appreciate the simplicity but, versatility, and it is in this well executed, as opposed to a series of civilization, and that's why I like the game, even better than more of the same game. That's why I like this game!  Includes also quite functional map editor. I highly recommend, especially if you like to play with friends. Forced purchase startegia games lovers, referral! 3  (See also the newer version of the game)   FIN:  Kyseinen peli on mielestäni tällä hetkellä paras mutta, myös realistinen versio vuoropohjaisesta strategia pelistä, jossa on mukana myös egologia sekä valtiotalouden kehittämisestä. Pelissä pystyy pelaamaan myös omalla valtiolla ja vaikuttaa pelissä täysin kaikkeen mahdolliseen talous ja sodan kulkuun. Useimmat vastaavat pelit kuten Sivilisaatio peli tai Beyon Earth peli niin, tämä sisältää myös vastaavia elementtejä kuten teollisuuden tai armejan päivittämistä sillä erotuksella että, ne on toteutettu tässä pelissä paremmin. Kuinka niin?  Ennen kaikkea minä itse arvostan hyvinpaljon yksinkertaisuutta mutta, monipuolisuutta ja se on tässä toteutettu hyvin, toisinkuin siviilisaatio sarjassa ja siksi pidän peliä, jopa parempana kuin useampi vastaava peli. Siksi pidän tästä pelistä!  Sisältää myös varsin toimivan karttaeditorin. Suosittelen eritoten jos tykkää pelata kaverien kanssa. Pakko hankinta startegia pelien ystäville, suositteluni! :3  (Katso myös uudempi versio pelistä)",
            "review_score": "1"
        },
        {
            "review_text": "Finland Stronk Gib oils plox 10/10 would annex russia again",
            "review_score": "1"
        },
        {
            "review_text": "Very good historical game.",
            "review_score": "1"
        },
        {
            "review_text": "Great game to play with 4 or more friends i highly reccomend it.",
            "review_score": "1"
        },
        {
            "review_text": "- Start as Poland - Hmm... we have more spending that make our income deficit. Must export/ import things - Gain surplus income after exporting and importing - Annex Danzig, and German just embargo me - Build a large army. preparing for campaign - Invade Lithuania, Latvia, &amp; Estonia - Soviet upset, declare embargo at me - Build more army - Try to repair relations to Germany by give them free coal, good ennough - Just heard a news, German declare war on Yugoslavia - Invade Slovakia and Czech Republic, in hope to mobilize German army to Yugoslavia - German upset and declare war on me - Poznan and Wroclaw annexed, Danzig reclaimed - Only 2 turns, German has captured Warsaw - German liberate Czech and Slovakia, turns out German give independence to them - German rush forward into my new capital in former Estonia's capital (forget their name, lol) - German liberate Lithuania, Latvia, and Estonia, then give them independence - Poland can't into Europe domination  10/10 Only in this game, German is a true liberator.",
            "review_score": "1"
        },
        {
            "review_text": "- Start as Poland - Hmm... we have more spending that make our income deficit. Must export/ import things - Gain surplus income after exporting and importing - Annex Danzig, and German just embargo me - Build a large army. preparing for campaign - Invade Lithuania, Latvia, &amp; Estonia - Soviet upset, declare embargo at me - Build more army - Try to repair relations to Germany by give them free coal, good ennough - Just heard a news, German declare war on Yugoslavia - Invade Slovakia and Czech Republic, in hope to mobilize German army to Yugoslavia - German upset and declare war on me - Poznan and Wroclaw annexed, Danzig reclaimed - Only 2 turns, German has captured Warsaw - German liberate Czech and Slovakia, turns out German give independence to them - German rush forward into my new capital in former Estonia's capital (forget their name, lol) - German liberate Lithuania, Latvia, and Estonia, then give them independence - Poland can't into Europe domination  10/10 Only in this game, German is a true liberator.",
            "review_score": "1"
        },
        {
            "review_text": "24 of December 1936 United States invaded Cuba that was allied with Communist China and WW2 started. It ended 12 of january 1939 with Norweigan and Sweden joined the Sovietunion and Siam (Thailand) ocupied Japan and Austraila. On the 4 of July 1939 Poland invaded Europé and began an huge advance in Asie leading to a war between Poland and The Siam Alliance.  Great freaking game! Love to turn the history upside down.",
            "review_score": "1"
        },
        {
            "review_text": "I first came across this game in my GCSE History textbook where it mentioned that video-game simulations can help historians to explore what would have happened if one key event had been changed. I proceeded to buy the game as it was very cheap (And still is) and was immediately thrown into the shoes of Stalin and had to fight off Nazi Germany alongside the U.S.A and Britain.   If you're a history lover or a stratedgy lover then this is definitely the game for you as this little cheap and relitively unknown game ranks highly in my top games of all time.   During one playthrough (The one I mentioned before) I had at least 20 hours of gameplay and ended up ending the game in 1979 when Europe was dominated by the U.S.S.R and the U.S.A and it had reached a massive stalemate in the Cold War where the U.S.A had a far superior military force which I (The U.S.S.R) could not match, without the use of nuclear weapons. Instead I had proceeded to go to war with Britain (Somehow the U.S.A didn't intervene) although this war went nowhere, apart from Russia capturing most of Britain's colonies in Asia and Africa. Britain resisted every attempt for a landing on British soil, so I ended the war with London being nuked, causing Britain to surrender.   9/10 - Would dictate again.",
            "review_score": "1"
        },
        {
            "review_text": "making history is fun!",
            "review_score": "1"
        },
        {
            "review_text": "This game is so AMAZZING. I am gonna buy this game for two of my friends so that way they can play with me right now. ",
            "review_score": "1"
        },
        {
            "review_text": "This game for me was so addicting that I had to uninstall it! Even though it is pretty difficult I still have fun trying to challenge myself and to, no pun intended, make history.",
            "review_score": "1"
        },
        {
            "review_text": "Really good, I spent lots of time playing. CO is more funny than singleplay",
            "review_score": "1"
        },
        {
            "review_text": "I single-handedly conquered the USSR as France. 10/10 realistic war simulator.",
            "review_score": "1"
        },
        {
            "review_text": "This is really good game that lets you decide whatever you want to do. You can create the most powerfull alliances or Win wars on your own or just be peaceful and prospering country. I think this is must-have game for everyone who likes strategy games.",
            "review_score": "1"
        },
        {
            "review_text": "great game even though it's old, it's a bit too simple, but if you're interested in ww2 and want to explore different outcomes, it's worth a try",
            "review_score": "1"
        },
        {
            "review_text": "George and Martha are a middle aged married couple, whose charged relationship is defined by vitriolic verbal battles, which underlies what seems like an emotional dependence upon each other. This verbal abuse is fueled by an excessive consumption of alcohol. George being an associate History professor in a New Carthage university where Martha's father is the President adds an extra dimension to their relationship. Late one Saturday evening after a faculty mixer, Martha invites Nick and Honey, an ambitious young Biology professor new to the university and his mousy wife, over for a nightcap. As the evening progresses, Nick and Honey, plied with more alcohol, get caught up in George and Martha's games of needing to hurt each other and everyone around them. The ultimate abuse comes in the form of talk of George and Martha's unseen sixteen year old son, whose birthday is the following day.  Review paid for by: Nabisco",
            "review_score": "1"
        },
        {
            "review_text": "one of my most favorite games, probably. its just like civilization without the supervisors that tell you about stuff. i wish there was a setting to turn them off. it is a bit low on the research of items which is the only con i have of it that and the difficulties to find the one last country the enemy has and you look for 100 turns for the AI to get the victory, but nevermind that back the the research that i really want to talk about. there may not be much and the nukes were a bit of a let down, it takes forever to get them, so you'll play for a long time and get your moneys worth. i played for about 1000 turns (a normal game is only 480 if you start with the lowest time period) in one game to get all the research done with about half the would generating research. sould you buy it? if you like long games about world war 2 and cite builders i guess it was fun and ill certainly continue to play it and hope friends get it too.",
            "review_score": "1"
        },
        {
            "review_text": "This game is Epic  No other game lets you play as the US....but ally with Nazi Germany and invade Britain. Also you can go into the map editor and give nations land. Let's just say fascist Tibet is allied with Germany and is Invading India. First India! Then the world!  All hail your new Tibetan overlord!!!!!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "&gt;Playing as Germany &gt;Invade czechoslovakia, Austria and Denmark &gt;France declares war on me &gt;No problem, I have a big army &gt;France destroys my entire army, invades italy and controls half of Germany in 3 turns &gt; I give up and play another game 12/10 would lose will to live again",
            "review_score": "1"
        },
        {
            "review_text": "This game is great but it gets boring when you play singleplayer constantly . Now don't get me wrong this game is cool and all but it needs more people to play multiplayer because I dont know if its just me but I can't seem to find any servers .",
            "review_score": "1"
        },
        {
            "review_text": "Mod the game -Create my own nation -Change Alaska to the most greatest land region (add oil, coal producer) and made it to be mine -Create an OP unit which only my nation can build it  Start the game -Mass product an OP unit -Germany wipe out the entire Europe -The British empire declare a war on Germany -Alliance with nazi comrade, USSR and the Japanese -USSR leave the alliance -Germany declare a war on the USSR and I decide to join the germans -The war's end with USSR defeated and my nation become the 2nd largest empire -Win countless battles against the US force and the British navy -Blitzkrieg on the US and then UK -Completed World Domination  100/10 would OP again",
            "review_score": "1"
        },
        {
            "review_text": "this is a good game no have new updates but it is very cool",
            "review_score": "1"
        },
        {
            "review_text": "I got 6 on history seven grade tnxx ",
            "review_score": "1"
        },
        {
            "review_text": "A very simple, yet very fun strategy game. Feels good to build up big armies and invade countries, then building bigger armies and conquering continents :D You're not stuck with following history, so you can take (for example) the U.S. and annex Canada just because you want to :P I had several playthroughs with different countries, and the only thing that kinda killed some of them was the fact that smaller countries can't do ♥♥♥♥ xD So when I picked up Portugal and tried to invade Spain, I failed miserably. However, playing with Germany, the United States, the Soviet Union, Japan, Italy,the United Kingdom, and even France, is very, very fun.",
            "review_score": "1"
        },
        {
            "review_text": "Been through hell looking for this game. I used to play it all the time. It is really fun and probably my most favorite wwII game(strategy). This game is definitley worth the money!!!",
            "review_score": "1"
        },
        {
            "review_text": "Good game... until it breaks, happens frequently and alot of bugs cant be fixed easily. So if you like game breaking glitches, well this is for you.",
            "review_score": "-1"
        },
        {
            "review_text": "If it is on sail: Get It. If not, you risk loosing $5 due to current bugs. Only logged 12 hours before the gamee decided to give me the Invalid Licence Key error :/ ",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a rip off - DO NOT BUY IT. I bought the 2007 version a couple of days ago on 50% sale for $5 and today they released the 2015 gold version for the same $5 sale price that has DLC update. What honest devs would do that?   Also, THE GAME DOES NOT WORK, I get an error message that says: 'Could not find valid license key. Please try reinstalling the product. Failed to initiate game engine, The game cannot start.' I tried reinstalling and get the same crap message. THIS IS A WASTE OF MONEY, DO NOT BUY IT.",
            "review_score": "-1"
        },
        {
            "review_text": "The ecenomy system in this game is horribly broken, this is painfully obviouse when you play as a small country. A great example is when you play as Iraq, you have basicaly no food and almost nothing to trade with which means you amass huge amounts of debt.  The weirdest thing being even if your people are starving they still reproduce like mad causing an even bigger deficit. So unless you play as one of the superpowers of the world there is no way to actually play the game, which makes me feel the game is incomplete. So save your money look for a good digital risk game, or perhaps you can find axis and allies?",
            "review_score": "-1"
        },
        {
            "review_text": "Game will not start. I am unable to find a fix.",
            "review_score": "-1"
        },
        {
            "review_text": "Yet another game trying to ride another games coat tails; this game tries it's best to duplicate what Hearts of Iron and it's ilk do. Although graphics aren't the emphasis of these types of games they are pretty weak. The controls are servicable but it's all trial and error since there is no real tutorial. The AI's decision making is fairly random making strategy difficult in the early going and playing as any country aside from the major powers is basically impossible. Spend a little more and get HOI.",
            "review_score": "-1"
        }
    ]
}