{
    "app_id": 6270,
    "name": "Ducati World Championship",
    "release_date": "2007-09-21",
    "developer": [
        "Artematica Entertainment"
    ],
    "publisher": [
        "Strategy First"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player"
    ],
    "genres": [
        "Racing"
    ],
    "tags": [
        "Racing",
        "Simulation"
    ],
    "achievements": 0,
    "positive_ratings": 77,
    "negative_ratings": 100,
    "price": 3.99,
    "description": "Feel the rush of motorcycle racing with Ducati World Championship. Select your machine from over 70 original Ducati models, perfectly simulated replicas of the real thing. With Ducati World Championship you don't have to settle on one model - you can have them all!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/6270/header.jpg?t=1447351133",
    "minimum_requirements": "Supported OS: Windows 2000/XP/Vista Processor: Pentium IV 1.6Ghz ProcessorMemory: 512MB RAMGraphics: 128MB Video Card (ATI 8500, 9000, X series and NVIDIA GeForce 4/FX/6/7 series Video Card)DirectX Version: DirectX 9.0cHard Drive: 4GB HD SpaceInput Devices: Keyboard or Game pad",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Intro video had boobs, would buy again.",
            "review_score": "1"
        },
        {
            "review_text": "This game is gloriously bad, cannibal holocaust bad, if anything, it's worth having just for the sake of saying to others 'I own it!' (and the ost, if you enjoy Gothic Metal)",
            "review_score": "1"
        },
        {
            "review_text": "This game may be old with quite outdated graphics, but I have found it a nice distraction when playing with an Xbox 360 Controller. You will unlock new bikes and drivers via career mode, and all the other modes are interesting in their own ways. Yes, the controls are a little touchy, and a few of the bike setup options seem to make very little difference. The graphics are not pretty or up to date. But with that said, I've been having great fun with it. In career mode, you have driver health and motorcycle damage to keep in check. Almost every race so far in C Class has unlocked either a new bike or a new driver for Championship mode. While I haven't finished the game yet, I have definitely had great fun with what I have played. I usually play very modern driving games like Gran Turismo 6, GRID 2, MX vs. ATV, Motorstorm, etc. Despite it's very visual age, this game is still fun if you like to race. It is a bit strange and is sponsored by a specific motorcycle company. But the strangeness makes it charming and the Ducati sponsorship means great bikes to ride and unlock.  Highly recommended for fans of motorcycle racing games, especially if you don't mind slighty better than PS1 graphics and controls. I think it's great, but your experience may vary.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty funny but sadly im bad for this kinda games xD",
            "review_score": "1"
        },
        {
            "review_text": "Best simulation game ever, they really nailed the sound effects on the bikes. It really feels like you are participating in the Ducati World Championship, a must buy.",
            "review_score": "1"
        },
        {
            "review_text": "I was gifted this game as part of a 'terrible game' contest and let me tell you, it's bad. The controls take a little getting used to and you can customize your bike a million ways, but every track looks like the same grey road under a grey sky (even if you set the weather to 'sunny'. I would have had fun but it was so crazy boring I had to stop.",
            "review_score": "1"
        },
        {
            "review_text": "I was excited to find a pc game that ran on legacy hardware and had single pc splitscreen, but after playing motocross madness and road rash, I felt this game came short in a lot of areas. I remember the controls playing like super hang on and everything else about it just wasn't worth the 5 dollar price tag. If you are looking for some weekend fun you can grab this for $1 or $.50 on the christmas deal, but buy it regular price and you will be disappointed.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is terrible and hard to play. There are seemingly impossible tracks that you MUST pass to continue, and no matter how many times I try and perfect my path to the end, it's still not possible. No wonder this game has a score in the 30s.",
            "review_score": "-1"
        },
        {
            "review_text": "sucks",
            "review_score": "-1"
        },
        {
            "review_text": "Gifted this to my friend, and apologized.",
            "review_score": "-1"
        },
        {
            "review_text": "Astonishingly poor quality semi-polished pseudo re-release of an even older title from the Dreamcast era. This may be the only racing game I have ever played where the game is so easy that it is literally impossible to crash, which is ironic since the game itself crashes so often that I can't even complete a single race. The only positive I can come up with is Lacuna Coil.",
            "review_score": "-1"
        }
    ]
}