{
    "app_id": 63200,
    "name": "Monday Night Combat",
    "release_date": "2011-01-24",
    "developer": [
        "Uber Entertainment"
    ],
    "publisher": [
        "Uber Entertainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Steam Achievements",
        "Partial Controller Support",
        "Valve Anti-Cheat enabled",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Strategy",
        "Indie",
        "Sports"
    ],
    "tags": [
        "Action",
        "Indie",
        "Sports"
    ],
    "achievements": 51,
    "positive_ratings": 720,
    "negative_ratings": 205,
    "price": 3.99,
    "description": "Monday Night Combat is a class-based, third-person shooter… and the most popular lethal sport of the future!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/63200/header.jpg?t=1447353796",
    "minimum_requirements": "OS: XP(SP3)/Vista/Windows 7Processor: 2 GHz ProcessorMemory: 1 GB RAMGraphics: DirectX 9.0c/Shader3.0 compatible, VRAM 512 MB (NVIDIA GeForce 7800 series or ATI Radeon X1900)DirectX&reg;: 9.0cHard Drive: 2 GB of free spaceSound: DirectX 9.0c compatible sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "don't tell anyone but sometimes i play this on tuesdays.",
            "review_score": "1"
        },
        {
            "review_text": "Game is 100% Dead dont buy it",
            "review_score": "-1"
        },
        {
            "review_text": "Completely deserted. Can't find a game in Australia.",
            "review_score": "-1"
        },
        {
            "review_text": "Difficulty: Just Right The Bottom Line: Great Multiplayer/Great Score: 8.0  Note: This Game Been Tried Out And Reviewed In Offline Mode or On Another Steam Account And Or Consoles.  Monday Night Combat is a multiplayer shooter game that incorporates shooter mechanics, tactical tower defense mechanics, and fun mechanics into one package. So did this bizarre mix of mechanics work to the game's benefit or did it just end up being too much for one little game to take in.  Monday Night Combat may be a small game, but it was able to take in a deep breath and work the air through its system smoothly allowing for an entirely new take on multiplayer shooters.  Overall: Monday Night Combat is an enjoyable and unique multiplayer shooter that incorporates a whole lot of different mechanics into a little game. The end result is an engrossing and highly addictive experience that makes it all the worthwhile to explore the depths of indie multiplayer games.",
            "review_score": "1"
        },
        {
            "review_text": "I would recommend this game. However, the playerbase is dead and there has been a peak of &lt;10 players at once in the past 30 days.  It's a fun game, but it is dead.",
            "review_score": "-1"
        },
        {
            "review_text": "Back at release I really enjoyed this game and it offered a lot of run ways to play with different classes that felt balanced. I am not sure how the community is now but it could be fun for a low cost of admission.",
            "review_score": "1"
        },
        {
            "review_text": "Game is good,but haven't seen any ppl online for a while",
            "review_score": "1"
        },
        {
            "review_text": "One of the best class based multiplayer games I've ever played. It's old now but its still fun when people are playing.",
            "review_score": "1"
        },
        {
            "review_text": "better than the sequel and a TOP TIER moba! more people need to play this classic!",
            "review_score": "1"
        },
        {
            "review_text": "Purchase price: $2.50  Seemed like a really slick game but there's hardly any people playing anymore. I assume this is because Super Monday Night Combat is free2play and also on steam. I missed my chance.",
            "review_score": "-1"
        },
        {
            "review_text": "7/10",
            "review_score": "1"
        },
        {
            "review_text": "[The game is dead now, don't buy it]  It may be a fun game, but I don't recommend buying it. According to the achievements, around 40% of the people who own the game can't run it or haven't even played a single round. Plus, the game's popularity dropped to nothing just two weeks after its release. I have 41 out of over 100 friends who own the game, and none have played the game in the last two weeks. Also, only one has played more than 50 hours.  I've yet to play more than two rounds of MNC myself, due to incompatibilities with my computer...I'd like to play, and if I could, I would play it occasionally, but that won't be happening anytime soon. :(",
            "review_score": "-1"
        },
        {
            "review_text": "but it released on a tuesday",
            "review_score": "1"
        },
        {
            "review_text": "This game was garbage when it first released years ago. It was riddled with hackers, specifically head-shot aimbots. The frustration level was over 9000.",
            "review_score": "-1"
        },
        {
            "review_text": "Tower defense meets Team Fortress 2. Some clever new features plus a coop survival mode differentiate itself. Overall, I found it to be a ho hum experience.",
            "review_score": "-1"
        },
        {
            "review_text": "A third-person arcade style class based shooter. Each class has 4 basic perks which they can be upgraded to unleash havoc upon the opposing team. There are two game modes, Crossfire and Blitz. The objective of Crossfire is to destroy the opposing teams money ball while Blitz is a survival type game mode. A fun and fast-paced game that will entertain you for quite a while.",
            "review_score": "1"
        },
        {
            "review_text": "Not worth getting this nowadays, unfortunately.",
            "review_score": "-1"
        },
        {
            "review_text": "When i have to get out of bed in the morning and go to class",
            "review_score": "1"
        },
        {
            "review_text": "It's easy to confuse this game as a TF2 clone considering the cartoon style of the characters, however, the gameplay is nothing like that multiplayer classic. Gone are the massive servers crowded with dozens of players, opting instead for a 6 vs. 6 game where teamwork goes far towards winning the match. Matches are fast-paced and you'll find yourself running through half a dozen matches in a single sitting pretty quickly. It's easy to learn the basics but with a reward system that allows you to customize your characters abilities the more time you put in, you'll find yourself coming back with a new player design every chance you can. I highly recommend this multiplayer experience.",
            "review_score": "1"
        },
        {
            "review_text": "i like this more than tf2, and i really like tf2  amazing turret defense + tf2 gameplay, as well as a lot of individual additions from other current gen games",
            "review_score": "1"
        },
        {
            "review_text": "Six TF2 items plus a Valve-approved game? Why not.",
            "review_score": "1"
        },
        {
            "review_text": "I'd buy that for a piece of bacon!",
            "review_score": "1"
        },
        {
            "review_text": "Monday Night Combat is one of the most fun competitive team games I've ever played.  It plays like a mash-up between TF2 (an FPS) and Dota (quasi-RTS), except not in either of those genres (3rd person shooter/action). Having been a long time fan of Dota, this is essentially that style of game in full 3D. So you'll be pushing bots, creeping enemy bots, and looking to kill enemy pros in order to get money and upgrade your skills.  The gameplay is frantic, strategical, and always a blast to play. But it's really the stylized characters and writing that help to make the experience so memorable. The gameplay is complimented by some hilarious dialogue that really brings the futuristc world of MNC to life. Think a parody of 1984 that's treated with just the right amount of humor and you'll get the picture.   If you're on the fence about MNC, then do yourself a favor and buy it. The learning curve can be a little steep, but the game is always fun and rewarding.",
            "review_score": "1"
        },
        {
            "review_text": "Its like if DoTA and TF2 had a love child.",
            "review_score": "1"
        },
        {
            "review_text": "such a good game! Worth having a look at.",
            "review_score": "1"
        },
        {
            "review_text": "I'm pretty sure this is exactly what happens in the future of the TF2 universe. And that's definitely a good thing.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, third person shooter/tower defense. Revolves around a ball of money contained in a sphere, called the Money Ball. Can play competitively, with both teams trying to get their swarms of robots to the enemy's moneyball to destroy it and win, or co-operatively, protecting the moneyball against increasingly difficult hordes of robots. Killing bots (or other players) gets you money, which you can spend on single-game character upgrades or turrets. And turret upgrades. While most games would pit red team against blue team, this game has ORANGE vs Blue, which is fine by me - orange is blue's actual opposite, after all. The characters don't have as much individual personality as Team Fortress 2's characters (which are hard to beat, kind of an unfair comparison?), but personalities do exist - most visibly with the Support class character. Good for those that enjoy both tower defense and third person shooters. If you prefer tower defense, play Blitz as a Support.",
            "review_score": "1"
        },
        {
            "review_text": "It's not a Team Fortress 2 clone as a lot of people think.  It's a fun arena based third person shooter with a Coop mode against bots.  If you want to think about similar games, maybe if Unreal Tournament (back when it was a future contest) and Team Fortress 2 had a baby, it would be Monday Night Combat but with a 3rd person twist.",
            "review_score": "1"
        },
        {
            "review_text": "Really nice funny game =)",
            "review_score": "1"
        },
        {
            "review_text": "Freaakin awesome action!!! Definetly worth buying:)",
            "review_score": "1"
        },
        {
            "review_text": "Actually a very fun game when played with friends. Like TF2 witht he cartoony graphics but much more fun because of all the game show type stuff that happens during the fighting.",
            "review_score": "1"
        },
        {
            "review_text": "TF2 light. Fun for a little while.",
            "review_score": "1"
        },
        {
            "review_text": "An absolutely fantastic 3rd person multiplayer shooter. Basically, it plays like Team Fortress 2, with it's mix of classes, combined with DoTA. You have bots which you must escort to the opposing team's base to destroy their Moneyball. You also have turrets to defend you Moneyball from the other team's atttack. This gives the game quite a frantic pace as you try to kill other players, kill bots and destroy turrents along with defending your own base.  The game has a fairly large learning curve, in that you'll need to spend some time learning one particular class to get into it. It's a little harsher than TF2 - probably because there are only 6 peeps per team in this game so can't be propped up as much by your teammates. Better players will also dominate you to begin with. Don't worry. Your K/D ratio means nothing and you'll get there eventually.  Once you're past the curve it's a really fun MP game. There are still some issues with Blitz - the co-op mode. Hopefully that's fixed soon.",
            "review_score": "1"
        },
        {
            "review_text": "Great team-based strategy/action game! I would describe it as Team Fortress 2 style gameplay and graphics combined with the strategy and teamwork necessary in League of Legends. Class diversity and working together are essential to win, as each map is split into several 'lanes' where your team's robots (as well as the other team's on their side) spawn, and have a specific route they go depending on their lane. Your job is to clear the way, while watching out for enemy 'Pro' players (the classes are called 'Pros') and killing them if necessary, which it usually is. But don't be fooled, this game is not all about racking up the kills! You will want to lead the robots to the opposing team's 'Money Ball,' which can be considered the home base of their base, and have them attack it while you help. The robots bring down the Money Ball's protective shield, but watch out for Turrets throughout the base! If you find serious players who work together and talk, this game is VERY addicting!",
            "review_score": "1"
        },
        {
            "review_text": "its very much fun and got oodles of style. worth getting . replayability is low unfortunately as its only a multiplayer game. of course if u got loads of ppls u needs ta shoot. this is the one :D",
            "review_score": "1"
        },
        {
            "review_text": "Every day I wake up and cry like a ♥♥♥♥♥ knowing that I have just woken up into a world where MNC is a ded game,  Amazing game. Possibly the most fun I've had with a steam game. But there are no players here or on SMNC.",
            "review_score": "1"
        },
        {
            "review_text": "its like monday night football but for skinny ♥♥♥♥ing ♥♥♥♥♥♥ nerds with no friends who sit on their computer all day so i guess its good for you ♥♥♥♥ing queers",
            "review_score": "1"
        },
        {
            "review_text": "if you ever gonna buy this game just get it on xbox 360 there its still alive beacuse there the devs left that verison before they over patched the game like on the pc version would i rec this game yes but only on the xbox version.   in short ths its by far the funnesy game i ever play its one of those game you dont really get tired of i spend over 4000 hours on the xbox ver. this game its the only reason i have my old xbox 360. as for smnc sure its fun but dosent get close to how much fun this one was  ",
            "review_score": "1"
        },
        {
            "review_text": "This game is so much fun! it's a mix between a tower defense game and team fortress 2, in a third person view.  Overall: 8/10",
            "review_score": "1"
        },
        {
            "review_text": "This is not a TF2 clone!  This is a class based (that's not a TF2 exclusive feature ya 'know) with tower defence elements.  The characters and announcer have some funny dialog. Gameplay is quite easy to learn but very hard to master.",
            "review_score": "1"
        },
        {
            "review_text": "See Valve? This is how you make a fun game.",
            "review_score": "1"
        },
        {
            "review_text": "Once upon a time at a convention a dude just followed me around for five minutes yelling 'traaaaaash boooooat' until a panel started, then he ♥♥♥♥ed off to go see Kevin Smith juggle his man-♥♥♥♥ or whatever. If I ever ran into Monday Night Combat in the street, I would do the same thing to it.  The heckling, not the ♥♥♥-juggling. I assure you my hands would go nowhere near the game's chest, it would be improper.  I suppose I should explain why: game was dead long before SMNC came out, and SMNC is the karmic backlash they deserved for abandoning a playable-at-worst title like MNC without learning from any of its mistakes.",
            "review_score": "-1"
        },
        {
            "review_text": "Probably one of the most fun I have ever had back in the days, too bad it is dead now...",
            "review_score": "1"
        },
        {
            "review_text": "wow that was boring personal rating 2/10",
            "review_score": "-1"
        },
        {
            "review_text": "i buy this game and 1 minutes ago i know this game is free !!!!!!!!!!! ♥♥♥♥♥es",
            "review_score": "-1"
        },
        {
            "review_text": "A lot of fun to play, but multiplayer is pretty much dead. Good for single player fun-and it IS a very entertaining game- you just won't get much multiplayer unless you have a bunch of friends that love it too.",
            "review_score": "1"
        },
        {
            "review_text": "This game is truely fun if you love Team Fortress 2 and team based objective games.",
            "review_score": "1"
        },
        {
            "review_text": "TF2 look but much more strategy and location based teamwork needed to win. Fun game reminds me of SmashTV from way back.",
            "review_score": "1"
        },
        {
            "review_text": "Sorry cant support a game with such shaddy business practices. GG Uber..",
            "review_score": "-1"
        },
        {
            "review_text": "GREAT fun game lots of action",
            "review_score": "1"
        },
        {
            "review_text": "One of the most addicting games I've played, interesting mix of defense and TF2 in 3rd person. Anyone can play this game, even if you can't aim to save your life. Oh... and you get to fight a giant chicken, how can you not want it now?",
            "review_score": "1"
        },
        {
            "review_text": "Fun while it lasted, dead now though.",
            "review_score": "-1"
        },
        {
            "review_text": "Monday Night Combat is a really fun, intersting and challenging game. It is a lot like TF2 with the characters, though the characters have different skills that can be upgraded by attacking more players and earning money from kills. You have a different variety of turrets, and you have bots that aid you in attacking the other side.  It requires team work and skill. Depending on who you have on the arena and who you have on your team, you need to strategise which best tactic to go about attacking the other side. Do you defend more and build turrets, or do you upgrade as fast as you can and attack the enemy base straight away.   It is a fun game that is still a bit of a work in progress, but there is certainly more involved, has a few fun maps and the characters and their different skills, make it really really enjoyable to play. Would like to see more maps and different games in the future, but for now it is a lot of fun for such a cheap game!",
            "review_score": "1"
        },
        {
            "review_text": "This is Tower Defence and multiplayer shooters like you've never seen them before. You can pick a class, build turrets and spawn armies of robots to tear down your enemies.  It also doubles as a multiplayer ordinary Tower Defence as well. Either way, you're sure to have a blast.",
            "review_score": "1"
        },
        {
            "review_text": "This game is basically Team Fortress and DotA combined. Escort bots to the enemy base, kill enemy bots and players to make money, use money to upgrade. Every class has a different role, and some classes hard-counter others.  Weapons have tons of different uses too. The game's surprisingly deep for what it looks like. Only problem is that the Rocket Turrets take waaaaay too much abuse unless you're juiced. Otherwise everything's awesome.  completely worth the 15 dollars",
            "review_score": "1"
        },
        {
            "review_text": "Totally worth the 15 bucks, another great game worth much more than its price like TF2. The classed based push game style is very fun, with 6 classes pushing 'bots' to destroy the enemy's base. The aspects of dota + TF2 and the unique art style make for a great enviroment arena to fight in. Not to mention i got a few hats in TF2 for this. Its all about the multiplayer, and i love it.",
            "review_score": "1"
        },
        {
            "review_text": "DOTA meets Team Fortress 2.   You have to destroy the enemy money ball to win, in order to do this you need to escort your army of bots to the enemy money ball and navigate a series of traps, enemy bots and players.   All the classes are fun and equally overpowered and two people of any class can work cooperatively to destroy an enemy team.  The only downside is the community. People apparently take this colorful, fun and fast paced game as very serious business and you are almost guaranteed one or two people in every match who will treat the game with the seriousness of Counterstrike with the smack talk of xbox live.  This is not too much of a problem however, as the frags come fast and regardless of how good someone thinks they are, you will be killing them... a lot, and you can rub salt in their wounds by taunting them for a bonus.",
            "review_score": "1"
        },
        {
            "review_text": "Good... clean... FUN!",
            "review_score": "1"
        },
        {
            "review_text": "This game is pretty darn fun! Team Fortress style Co-op and tower defense all rolled into 1 to make the funniest more addicting shooter I have played in a LONG time!! A must buy if you like to laugh and blow s#*t up!",
            "review_score": "1"
        },
        {
            "review_text": "sad that nobody plays this anymore. It was a great game",
            "review_score": "1"
        },
        {
            "review_text": "Good idea, poor execution, worse balance. Assassin class is just too good. Period.  Everything from this guys (as far as 2014 goes) is good looking, amazing at first but shallow. This, MNC, Super Monday Night Combat (failed, too moba-lized), Plannetary Annihilation (more like Feature Annihilation and everything is done on servers ...)   ",
            "review_score": "-1"
        },
        {
            "review_text": "This game is no more.",
            "review_score": "1"
        },
        {
            "review_text": "That Game Rules! Better as Team Fortress 2 and you would love IT! Unique Character and Areas. You Need Skill, Tactic and a Great Sponsor to Win this Game! By The Way... The Pitgirl dance only for ME!",
            "review_score": "1"
        },
        {
            "review_text": "AWESOME. Think TF2 as a third-person shooter, mixed with DOTA, all set against a pro sports theme, and you get MNC. RECOMMENDED",
            "review_score": "1"
        },
        {
            "review_text": "Its a very original game, however, its hard to learn, unblanaced and full of bugs ",
            "review_score": "1"
        },
        {
            "review_text": "It's a fun combo of TF2 and DotA",
            "review_score": "1"
        },
        {
            "review_text": "i BOUGHT this game, now i get the 2nd game free. WHY DOESNT ANYONE SAY THATS AWESOME?!?!?!",
            "review_score": "1"
        }
    ]
}