{
    "app_id": 63700,
    "name": "BIT.TRIP BEAT",
    "release_date": "2010-11-02",
    "developer": [
        "Gaijin Games"
    ],
    "publisher": [
        "Gaijin Games"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Partial Controller Support",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Rhythm",
        "Music"
    ],
    "achievements": 26,
    "positive_ratings": 616,
    "negative_ratings": 140,
    "price": 6.99,
    "description": "From gameplay to visuals to music and imagination, BIT.TRIP BEAT is inspired by classic games in every way. Get sucked into a whole new world of sight and sound as you juggle beats and ride the vibe in this modern look at the beginning of it all. BIT.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/63700/header.jpg?t=1478114726",
    "minimum_requirements": "OS: Windows XP SP3 Processor: 2.0+ GHz Memory: 512 MB DirectX®: DirectX® 9.0c and shader model 3 with 128 MB of memory Hard Drive: 100 MB Sound: Any sound card capable of stereo output",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "BIT.TRIP BEAT is actually a really cool rhythm game. I wasn't expecting much with this title, but I'm pleasantly surprised. It's quite addictive, and the difficulty is there as well. The basic concept is kind of like pong, where you hit little dots with your pattle as they come flying toward you, but as the level progresses and the beat gets more intense the patterns the dots come at you increase in difficulty. There are all sorts of neat effects, like disappearing, dots that freeze your pattle, double time, pattle shrink, bouncing dots, etc. It's a lot of fun; however, the levels are extremely long, and if you end up losing, it takes forever to get back to the position you were at when you 'died'. This is unfortunate, because it really discourages you from playing again. So, although it's addictive, it's really only good for pick up and play gaming.   That said, the sound quality and gameplay this game offers is extremely high, just try the 'Test' level on the main menu (which is a Portal reference) and you'll see what I mean. But, while we're on that topic, the menus are needlessly complex and quirky. When you click on an item, a dot crosses the screen and you have to bounce it off your pattle to enter that submenu. It's eye rolling, but that's really the only complaint, besides the length of the levels, that I have.  Pros:  Addictive and fun gameplay High sound quality Good as far as rhythm games go 'Test' level is awesome  Cons:  Soundtrack and level design can get lengthy and repetitive Stupid main menu design  I would recommend grabbing this title. I think it's unique and great for pick up and play gaming. Nice for a 10 minute game, much like a Shmup is. B",
            "review_score": "1"
        },
        {
            "review_text": "BIT.TRIP BEAT is a very well-made rhythm game, which downsides are the hugely frustrating difficulty and the little content. If you buy this on Steam, I dare you to try receiving a 'perfect' score on all levels or even just one level on easy and if you succeed, be very, very proud of yourself, as you'll be part of the 0.4% of people (as of now) who have accomplished this on Steam. Yeah, the game is hard and also tough on the eyes by the way, because of the vibrant moving graphics. It can be quite fun but it also doesn't have that much to offer.",
            "review_score": "1"
        },
        {
            "review_text": "My wrist hurts and my eyes have molten, but this indeed is a particularly espectecular pixelfest! You should not miss on this, I say!",
            "review_score": "1"
        },
        {
            "review_text": "this really applies to all of the bit trip games but it is ♥♥♥♥ing hard and it is a well integrated audiovisual experience. I do not regret the time spent on it.",
            "review_score": "1"
        },
        {
            "review_text": "Possibly the hardest game on Steam. But despite its difficulty, chances are you'll be hooked for hours trying to beat its deceptively simple 3 levels. Oh, and the soundtrack is great.",
            "review_score": "1"
        },
        {
            "review_text": "Interactive single-player pong with progressive 8-bit beats. There are only three levels, but I still keep coming back to play this game, mostly I guess because I'm obsessed with the music.",
            "review_score": "1"
        },
        {
            "review_text": "Funny game tho i rage a lot on it. It's a game where you need to hit small circles and squares with your mouse that comes towards you, its really easy to miss them so i give this a 5/10 rage :@",
            "review_score": "1"
        },
        {
            "review_text": "This is a very tricky game, and I love the music.",
            "review_score": "1"
        },
        {
            "review_text": "Actually really, really good. Get when on special",
            "review_score": "1"
        },
        {
            "review_text": "My first love on the Wii, now on Steam! Awesome Chiptunes + visuals.",
            "review_score": "1"
        },
        {
            "review_text": "It's like a one player game of pong, with a spacey twist. :)",
            "review_score": "1"
        },
        {
            "review_text": "Because music and Pong go REALLY well together! :D",
            "review_score": "1"
        },
        {
            "review_text": "This game is fairly Additive, Worth the money if your into something with abit of a Challenged involved.",
            "review_score": "1"
        },
        {
            "review_text": "If you like Pong you will like this. It's got some cool techno music and it changes depending on how well you are currently doing in the level.",
            "review_score": "1"
        },
        {
            "review_text": "Music + Pong. Addictive, trippy, challenging.",
            "review_score": "1"
        },
        {
            "review_text": "A cheap boring Tetris/Tennis type of game? 'Bah!' you say? Then say no more. This game is fun and very challenging. I enjoy how fast paced it gets and the beats you reflect back to the other side really goes well with the music playing in the background. Keep your wits sharp and your eyesight sharper as BIT.TRIP will definately keep you on your toes! 7/10!",
            "review_score": "1"
        },
        {
            "review_text": "Don't play if you're bad at Pong.  10/10 would die staring at the pretty backdrops again",
            "review_score": "1"
        },
        {
            "review_text": "If you don't get a seizure before completing the 3 levels, you can call this 80s throwback to pong, crazy colours and electric boom boom fun. Having said that this could easily be a free mobile app. Get it on a bundle and don't spend more than a buck on it!",
            "review_score": "1"
        },
        {
            "review_text": "Yes this game is hard. Really hard. If you can't move your mouse easily or play well with controllers, you will hate this game. However, at $0.99 (Holiday sales) you can't really deny it. It's fun, and the music is great.  (and dear lord the Level 3 Boss is hard)",
            "review_score": "1"
        },
        {
            "review_text": "I do recommend the game, but only if it's really cheap. The game is fun for a few quick plays but you will hate it if you play too long.  Sad to say the crazy colors and effects don't work as great here as they do in BIT-TRIP Runner. I personally love pixel-heavy games, but here it feels misused. Again, you won't care too much if you play in small bursts like a mobile game. It just made me want to go play a game that does it really great like Geometry Wars.",
            "review_score": "1"
        },
        {
            "review_text": "DO IT!",
            "review_score": "1"
        },
        {
            "review_text": "This game is fairly Additive, Worth the money if your into something with abit of a Challenged involved.",
            "review_score": "1"
        },
        {
            "review_text": "It has nice visuals and music, but there is some input lag. It also doesn't help that it's a short game. Probably only get it if it's on sale.",
            "review_score": "1"
        },
        {
            "review_text": "First Bit.Trip game I ever played. Recomended 100% to anyone who likes rhythm games!",
            "review_score": "1"
        },
        {
            "review_text": "A trippy, Pong-like music game that lures you into an almost Zen state. Don't buy it unless you're okay with loosing hours of your life with no idea of where they went.",
            "review_score": "1"
        },
        {
            "review_text": "Like an extreme version of pong with simple but trippy visuals and soundtrack makes for a unique gameplay experience. Pretty much the game consisit of sending various blocks or bits flying down at you and your job is to block them using your paddle which you control movements up or downward with the mouse as you hit them you can chain them to gain a higher multiplayer to get more points succesful blocks also create some nice neat sound effects. Provides a challenging but fun experience.",
            "review_score": "1"
        },
        {
            "review_text": "if you can get over the fact that your not playing the wii version with the wii controls, then you'll love this game",
            "review_score": "1"
        },
        {
            "review_text": "Pong on steroids. is pretty fun.",
            "review_score": "1"
        },
        {
            "review_text": "There's something about the visual/audio atmosphere this game creates. Even if you didn't grow up with the Atari or NES, I'm confident you'll find yourself drowning in 1985 just by playing this for a few minutes.",
            "review_score": "1"
        },
        {
            "review_text": "Another sale, another recommendation. (It's really good though, you should buy it)",
            "review_score": "1"
        },
        {
            "review_text": "It's pong on acid.",
            "review_score": "1"
        },
        {
            "review_text": "Great fun. Like pong but to music and much harder!",
            "review_score": "1"
        },
        {
            "review_text": "This is a cool game, it sort of reminds me of Pong. But like Pong, it can get very boring very fast.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful blending of music and hyper-kinetice pong play. Awesomely unique.",
            "review_score": "1"
        },
        {
            "review_text": "If you like Pong you will like this. It's got some cool techno music and it changes depending on how well you are currently doing in the level.",
            "review_score": "1"
        },
        {
            "review_text": "nausea inducing call of duty clone",
            "review_score": "1"
        },
        {
            "review_text": "It's pong on acid.",
            "review_score": "1"
        },
        {
            "review_text": "Personally I am not a fan of this game. The rage inducing controls to the background that can make you miss a lot of shots. The game isn't really meant for me however the price is reasonable enough to buy just to try this game. No matter what the other BIT.TRIP games were very great so buying this game is going to a good place.",
            "review_score": "1"
        },
        {
            "review_text": "The only reason I own this game is because it happened to be a part of that excellent indie bundle. However it's worth noting that the only game in that bundle worse than this is The Ball.  I really can't recommend it to anyone. Awful music game, sub-par pong game. I guess if you have a big boner for 8-BIT RETRO WOW then the presentation might erect your nipples in anticipation but otherwise SKIP along with the rest of the series.  F - -",
            "review_score": "1"
        },
        {
            "review_text": "This game is INSANELY addicting for being so simple. It's probably the best birthday present since my first tablet, and anyone who knows me nows that tablet is a big part of my life. But really, if you have the chance, get this game, it's like Pong, Guitar Hero and Audiosurf had a thresome and somehow managed to have a baby... better yet, 'Pong on Acid,' -however, downside, this game should not be played for hours on end for personal health reasons... the colors!",
            "review_score": "1"
        },
        {
            "review_text": "really addicted, and a really freaking difficult game",
            "review_score": "1"
        },
        {
            "review_text": "It good!",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome! great music, visuals, gameplay, everything! highly recommend.",
            "review_score": "1"
        },
        {
            "review_text": "I'm awful and never finished this game but it will probably last you a couple of hours since it didn't take me long to get halfway through. Good music.",
            "review_score": "1"
        },
        {
            "review_text": "Have you ever thought... 'What if?'  Yeah me too.  Have you ever looked at Pong and thought... 'Hey, this is great. But I think it needs some more... LSD.'  Well, this is it. Yay!",
            "review_score": "1"
        },
        {
            "review_text": "Start with the first level on Easy. Trust me. (Easy mode found in settings.)  How I Found The Game",
            "review_score": "1"
        },
        {
            "review_text": "Underwhelming. It's basically just Pong set to music with annoying backgrounds that often hinder you from seeing the objects you're supposed to hit. If I didn't get this with other games in a bundle, I'd feel cheated.",
            "review_score": "-1"
        },
        {
            "review_text": "If you get this game as a bundle? Okay, you will be amused for an hour or so, it is kind of like Pong and a music game got together and... I don't know who I'm kidding, it's just Pong morphed into a music game. If you seriously love Pong, and I mean, SERIOUSLY LOVE Pong, you'll probably be like, 'Hey! This is cool! Wow, okay, I get it... now this is hard... alright, thanks for the fun, Humble Bundlestar Inde Party Gala Gala Bundle #67! Now, to try this (2D Metroidvania/classical rehash/roguelite) game!'  If you decide to buy this game separately, especially full price? Well, I'm sorry. That was a bad idea. Don't worry, I spent money buying a Star Wars bundle that has games that mostly don't work on modern gaming systems. I, too, know how it feels to buy some useless game that makes you feel bad. We all make mistakes.  At least, in 2015, we can refund our bad decisions. I'm stuck with Jedi Knight 2 and Jedi Outcast staring at me, both of which are laughing at my AMD video card and wondering what the hell widescreen is.",
            "review_score": "-1"
        },
        {
            "review_text": "Decent game. It plays like how I'd imagine playing a game of Pong with the inventor would be. It seems like every time you deflect a shot, the next shot does something crazy different, or it comes faster, etc. I would enjoy it more if the game showed you the different types and their properties before you started the game. Nothing is more frustrating than getting 3/4 through a playsession and lose because the game suddenly has a new 'attack'. In the end, this game just felt cheap.",
            "review_score": "-1"
        },
        {
            "review_text": "The Dark Souls of rythm games, spiced with nauseatingly epileptic visuals that interfere WAY too much with gameplay. I'd stick with the version/-s that support 2-player mode.",
            "review_score": "-1"
        },
        {
            "review_text": "Frustratingly bad Pong",
            "review_score": "-1"
        },
        {
            "review_text": "By 'music game' I figured this would let me use my own music. Nope; enjoy lousy 8-bit 'retro' music to try to play along to. Yawn.",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this game thinking that it was BIT.TRIP RUNNER. It's not. It's basically Arkanoid / Breakout with R-Type style side-scrolling action - all tied to a soundtrack that reacts to your playing. The game isn't BAD, it's just not very much fun beyond the first few plays. Plus there's an obnoxious bug that causes the game to minimize for no reason, which can kill your combo score or even end the game for you (since the game doesn't pause automatically when this happens. This game is mostly for retro hipsters that want to up their nerd cred.",
            "review_score": "-1"
        },
        {
            "review_text": "Sucks monkey balls.",
            "review_score": "-1"
        },
        {
            "review_text": "If there is a game out there with worse mouse acceleration, I can't think of it. I think I spent more time dicking around with different mouse control utilities and Xpadder and stuff like that trying to get the controls to not suck with either the mouse or a 360 controller than I did actually playing the game. I have come to the conclusion that the built-in acceleration curve is so bizarre that it's impossible to work around it. It's too bad, because it's almost a good game otherwise. You know, aside from being unplayable.",
            "review_score": "-1"
        },
        {
            "review_text": "Game speed doesn't adjust to your mouse/keyboard/gamepad sensitivity settings, you either play the way the game wants or you don't play at all. Nice visuals and sound. This game is more punishing than challenging.",
            "review_score": "-1"
        },
        {
            "review_text": "The beats going from right-to-left and you moving up and down to hit them is really not easy to grasp. Why couldn't they just do it like Rock Band...",
            "review_score": "-1"
        },
        {
            "review_text": "I would not buy this game. If you enjoyed Bittrip Runner, you will not enjoy this. The levels are 20 minutes long, bland, sore on the eyes and tedious. I bought it because I liked Runner and there was a christmas acheivement for it. It is ♥♥♥♥ign terrible.",
            "review_score": "-1"
        },
        {
            "review_text": "If there is a game out there with worse mouse acceleration, I can't think of it. I think I spent more time dicking around with different mouse control utilities and Xpadder and stuff like that trying to get the controls to not suck with either the mouse or a 360 controller than I did actually playing the game. I have come to the conclusion that the built-in acceleration curve is so bizarre that it's impossible to work around it. It's too bad, because it's almost a good game otherwise. You know, aside from being unplayable.",
            "review_score": "-1"
        }
    ]
}