{
    "app_id": 6370,
    "name": "Bloodline Champions",
    "release_date": "2011-10-28",
    "developer": [
        "Stunlock Studios"
    ],
    "publisher": [
        "Stunlock Studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "MMO"
    ],
    "genres": [
        "Action",
        "Free to Play",
        "Massively Multiplayer"
    ],
    "tags": [
        "Free to Play",
        "Action",
        "MOBA"
    ],
    "achievements": 0,
    "positive_ratings": 1365,
    "negative_ratings": 226,
    "price": 0.0,
    "description": "Bloodline Champions is a Free-to-Play online PvP Arena game where players engage in short, intense battles of up to ten players divided into two teams. Each player takes control over one of several bloodlines, each with their own unique weapons and abilities. Easy to learn, challenging to master.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/6370/header.jpg?t=1455556466",
    "minimum_requirements": "Operating system:Windows® XP Service Pack 3, Vista, or 7 Processor: Intel® Pentium® IV 3.0 GHz (or AMD equivalent) Memory: 1GB RAM on Windows XP, 2GB of RAM on Windows Vista/7 Hard disk space: 1GB Hard disk space Video: nVidia or AMD/ATI video card with 128MB RAM and Shader Model 3 support (GeForce 6000 series or ATI HD2000 series) Sound: DirectX-compatible sound card DirectX®: DirectX® 9.0c Internet: High Speed Internet (DSL or better) required",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "one of the most overlooked games ever.  this game is perfect.",
            "review_score": "1"
        },
        {
            "review_text": "This was and is a great game. Probably the best PvP game of all time, and I have played A LOT of games.   It has had a few questionable updates, but it IS great, and I wish it would become popular.",
            "review_score": "1"
        },
        {
            "review_text": "A unique arena game viewed from above, Bloodline Champions is a fast-paced, advanced and not the least a very hard game to master. It offers plenty of champions with diverse skillsets through four different archetypes known as ranged and melee dps, tank and healer. This game definitely looks reminiscent of dota-like games, but offer something completely different: fast-paced action from the get-go through short deathmatches, no buying items or spells, all champions are balanced and offer something completely different, both in playstyle and tactics.",
            "review_score": "1"
        },
        {
            "review_text": "Best Game i have played so far. It really is skill based and teh community is really nice especially when you got a lot of friends in it. I recommand playing with some friends you get lots of matches to play and its the best way to build a clan",
            "review_score": "1"
        },
        {
            "review_text": "Intense arena based combat that requires a pretty solid understanding of the game, and also quite a bit of skill!",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game with too small playerbase and long queues",
            "review_score": "1"
        },
        {
            "review_text": "This game is probably the only one of its kind out there. If you're looking to hop right into the action download this game. The download will take less than 30 minutes so why not try it out? The only problem I found in this game is the playerbase. This game is just crazy action packed with high skill level cap and best of all.... no grinding (unless you want that amazing skin). The community can really use some fresh players to help it grow as this game has a lot of potential.",
            "review_score": "1"
        },
        {
            "review_text": "See you guys on battlerite!",
            "review_score": "1"
        },
        {
            "review_text": "This game requires a HUGE amount of skill. Legitimate skill. You need to know your bloodline and a lot of esoteric information in order to even get by in this game.  I've played since shortly after post-beta and I bought most of the characters I wanted back then, and I maxed out my level and all my stats and have nothing to worry about... but for people joining now, you're going to have to either pony up some cash or play for a long time before you can unlock all the bloodlines you may want to play, the minmaxing medals and stat slots, etc.  This game is PLAY2Win, meaning the more hours you have put into the game the better you'll be at it. The upgrades you get from leveling up make you strictly and objectively better than someone who has just started out, so new players WILL start at a disadvantage.  It's an extremely fun game if you're willing to put in time and effort, but it can be discouraging at times.  I of course strongly recommend it (and I'm always looking for people to play it with) but I also strongly suggest that you understand what you're getting into before you join up. There's not a huge influx of new users daily like other more popular free2play games, so you may very well be a small fish in a very large pond.  It's hard to get into, but once you're into the game it's the most fun and addictive game I could ever recommend to somebody.",
            "review_score": "1"
        },
        {
            "review_text": " Short Summary:  Bloodline Champions is an a-typical experiment in the MOBA genre that manage to transcend the overused formula with true innovations and skill based gameplay. Highly recommended to people who wants a different MOBA experience and aren't afraid of investing the time in a hardcore skill-based game. For the casual gamer I would say BLC would pose too much of steep learning curve and a lot of frustration of losing to veteran players.   Extended Review   Been playing this game since early beta, clocking hundreds of hours before the integration to steam so I thought I should give a review of what I consider to be one of the best MOBA games out there, which sadly doesn't get the recognition it deserves.   Bloodline Champions (BLC) isn't your typical garden variety MOBA, in fact it so different that some people don't consider it a MOBA at all because it isn't stylized after DOTA and its clones, but since MOBA is Multiplayer Arena Battle - BLC fits the bill.   What you'll instantly notice is the FPS-driven (top down perspective), WASD movement, mouse-target aiming, heavily skill-based mechanics that aren't to be found in most MOBAs today. A good FPS gamer would have an easier time learning to master the different champions in the game.   The 2nd quite noticeable thing is the lack of lanes, creeps or a base for that matter - did I mention that this isn't DOTA?! - if you cut all the fat from a DOTA game, leaving it with just the characters, their abilities and how they work together in a team you'll get BLC. This is a clash of your team with the opponents team without anything interfering - no RNG, no creeps, no turrets. It's just kill or be killed. There are no levels or items, so all of the micromanaging (which I hate honestly) in other MOBAs and 'best builds' is out of the window - the cards you're dealt comes with your chosen champion and don't change during the match, it's all about knowing how/when to use them (note that there is some customisation to be had outside matches but it has almost zero effect on the actual game).  All of the above translates to matches that are:  1) short (3 rounds that lasts 3 minutes max each),  2) very intensive,  3) 100% reliant on team-work and knowing how to work with your champions. This reliance on team-work can lead to very frustrative games when even 1 player in your team doesn't know what he's doing. It will affect your odds of winning immensely.  There is enough variety of champions to fit any style of gameplay - you got your ordinary melee (assassins, self-healing etc'), tanks, range and support (healers) champs. All champions got their own 6 unique abilities (5 regular and 1 ultimate) that serve different goals - space for example, which is used to jump in shooter games, is a maneuverability action, given you speed or blink you to a destination, R key (for most champions) is used for defense or a reactive ability. Champions are very flavorful, in artistic manner and in how their abilities work-together and for that I salute the developers - they are all so fun to play and explore.   So in conclusion this is obviously a game I highly recommend to most players (with a fair warning to casual players), in an ideal world this game would be played by tens of thousand of gamers and rock the e-sports scene.  PROS + A unique MOBA experience that any MOBA fan should try + Great variety of champions with streamlined interesting abilities  + Team-oriented professional players will find a new home with BLC   CONS - Very reliant on your team which means very frustrating games when even 1 player is bad - Low population of players (not really a con with the game itself) which means you'll see a lot of the same bad players  - Steep learning curve for casual players will lead to endless frustration when facing veteran players. Not casual friendly!",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome! Community rocks! Let everybody know that the game is being revived!",
            "review_score": "1"
        },
        {
            "review_text": "the most intense and fun arena game i have played. only thing that sucks is 220 ping all the way down here in nz. pls give us oceania servers &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Fast paced action, real time strategy, unique champions for different play styles, Bloodline Champions is addicting and loads of fun.",
            "review_score": "1"
        },
        {
            "review_text": "YOU NEED TO ADD A VOICE CHAT LIKE CS:GO / TF2 to this game.... YOU HAVE TO.... it will never be anything until you do. AND YOU KNOW IT. amazing game, needs amazing communication. DO IT PLEASE.",
            "review_score": "1"
        },
        {
            "review_text": ".....",
            "review_score": "1"
        },
        {
            "review_text": "Sincerely *THE* greatest Arena-based PVP game EVER. Literally demanding a higher skill/ability from any gamers who choose to play but not without a great method for teaching/learning the mechanics.   Sadly, this game is dead. Politics. Let's be real, if there were at least 1-more server here in America, it wouldn't have died as horribly as it did.  We might be able to revive this beautiful masterpiece if we can get more people to download/play.",
            "review_score": "1"
        },
        {
            "review_text": "Just started playing this. I was in a U.S server Around 11 am and there were about 20 of us playing. So There still is a community but we need bigger.   Graphics are really good nothing spectacular but well polished. Very fun to play. Does not seem like you have to really pay unless you want to progress futher.   The game system and controls are really smooth. Absolutly no lag what so ever.   Everyone should download and at least try this game so much fun. 5 stars. ...........",
            "review_score": "1"
        },
        {
            "review_text": "Yes, i love this game",
            "review_score": "1"
        },
        {
            "review_text": "Gameplay: The game is all about team based PvP, it's fantastic, unique and very fast paced, i do not know any other game out there in the market that has what Bloodline Champions has, if your looking to a competitive PvP game, this one is the best out there in my opinion. 10/10  Audio: Good sound and music. 8/10  Graphics: It's out dated based on the actual games, but it doesn't matter for me, the gameplay pays it off. 7/10   Lot's of tournaments going inside the game, you can play very fast after you registed yourself, matchmaking works properly, the community is fine, just a ton of fun.  You play to get bloodcoins, with bloodcoins you can buy new champions, amulets and gems to add into the amulets, you level up getting points to spend on your tree of traits making your hero 15% stronger in a few specific stats.  I believe this game will be incredible in the future just get into the game and be one and many more Bloodline Champions.      ",
            "review_score": "1"
        },
        {
            "review_text": "Overall , this game is fun ... if you know how to play it and you are not matched with some hardcore newbs/♥♥♥♥♥♥♥s. I personally don't have any problem with it , but most people do ,since every single ability is skillshot.  What I would like to see here is some more bloodlines , they havent done any updates in aegies. maybe some mods / maps .",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun game, although it needs more players.",
            "review_score": "1"
        },
        {
            "review_text": "I didn't play this on steam but I had to write a review about it on here. It's super fun, the dynamics of the gameplay are still pretty unique, with the exception of XAM that kind of mimic-ed most of the controls and ideas. This game requires high levels of skill and the gaming curve is super high right when you get in (similar to LoL but much harder), but once you master a few characters and get in the hang of it, it's gives you really good gameplay. You play mainly as 3v3 with several different bloodlines and you can upgrade youself slightly out of game with gems and whatnot, but the beauty of the game is that it focuses on the actual teamfights, not farming or solo-laning, which means that each match is usually very fast to finish (maybe 15-30 minutes). The only bad thing about it is the playerbase. NO ONE plays it anymore, which is unfortunate, so Funcom should remarket it and get it on its toes again. But the last time I played was months ago, so the situation might have changed by now.",
            "review_score": "1"
        },
        {
            "review_text": "Its not aweful.",
            "review_score": "1"
        },
        {
            "review_text": "This game is just awesome. It's Dota2, LoL, HoN but there is no farming, only fighting. There are 28 characters to choose from and you battle at 5v5, 3v3 or 2v2 arena till death. Mostly 3v3, as it is the most common one and has ranked play in it. There are also tournaments in the game that give rewards. The normal 3v3 games are fast 3-15min depending on how good the players are. Learning the game is quite easy and if you don't have a lot of time this game is great. Come play it!",
            "review_score": "1"
        },
        {
            "review_text": "Epic hardcore pvp game with graphics that will blow you away.  We should all play this game and make it a bit bigger ourselves.",
            "review_score": "1"
        },
        {
            "review_text": "A non-traditional take on the MOBA scene pits teams against each other in an arena format - Think traditional MOBAS, except without creeps or towers. A competitive game that is suited for the hardcore gaming scene, but easy to pick up.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great and very skill based. The only problem with it is the lack of players. Hopefully this game is better advertised in the future because in takes forever to get into a match (I'm in a lobby as I write this).",
            "review_score": "1"
        },
        {
            "review_text": "Only have played this game briefly thus far. The game is really fun but the queue times are long and the games are short. You pretty much play against the same people every round since there is not a large enough population.",
            "review_score": "1"
        },
        {
            "review_text": "Bloodline Champions gives a fast and competitive take on the MOBA genre, sadly the community is dead. This game should have far more players",
            "review_score": "1"
        },
        {
            "review_text": "This game is very well made. It is much different that LoL or HON. With no items to buy or leveling to worrie about it is like playing WoW arena without having to worrie about gear. Just sheer spec and how well you can battle. GET IT!",
            "review_score": "1"
        },
        {
            "review_text": "Counterstrike plus DOTA. Oh but game is dead now.",
            "review_score": "1"
        },
        {
            "review_text": "This is the best game ever! I really happy that it got second chance in Steam! If BLC receive advertising i will dance!",
            "review_score": "1"
        },
        {
            "review_text": "If it had a better playerbase, it'd be amazing. As it is, people are, for some reason, sort of ignoring it.",
            "review_score": "1"
        },
        {
            "review_text": "holy ♥♥♥♥ i don't even know whats going on why am i dying",
            "review_score": "1"
        },
        {
            "review_text": "Like honestly there is a charm to this game..... even after playing battlerite I still prefer this. Its like the same things that keeps people play a game like WOW",
            "review_score": "1"
        },
        {
            "review_text": "It's free, it's a small download, and it's fun. What more do you want, ya jerks?",
            "review_score": "1"
        },
        {
            "review_text": "If you play WoW and done arenas it is like that and LoL combined. It is a fun arena combat game.",
            "review_score": "1"
        },
        {
            "review_text": "Go and ♥♥♥♥ them in the arena !",
            "review_score": "1"
        },
        {
            "review_text": "9/11 am I reviwer now?",
            "review_score": "1"
        },
        {
            "review_text": "This game is no joke! GET IT!",
            "review_score": "1"
        },
        {
            "review_text": "its a moba but an interesting one weird mexanicks but its fun and its very underated",
            "review_score": "1"
        },
        {
            "review_text": "Great game.",
            "review_score": "1"
        },
        {
            "review_text": "I enjoy drawing the pointy S more then I did playing this game.",
            "review_score": "1"
        },
        {
            "review_text": "So fun yet so easy, too bad not many people play it, but i can easily find a match so im not depressed either.",
            "review_score": "1"
        },
        {
            "review_text": "very nice game",
            "review_score": "1"
        },
        {
            "review_text": "Didn't play much, but had fun with the few games I played. Looking forward to Battlerite!",
            "review_score": "1"
        },
        {
            "review_text": "Good game if your looking to play an hour or so.",
            "review_score": "1"
        },
        {
            "review_text": "like wow arena, except no need to farm gear, all you need is your skill.  probably the best game ever made.",
            "review_score": "1"
        },
        {
            "review_text": "Great rpg style battle arena game where you must aim to direct your spells and attackes at your foe or allies.",
            "review_score": "1"
        },
        {
            "review_text": "Bloodline Champions (BLC) is amazing fun! If you've played DotA or League of Legends, you already know the play style. The free aspect lets you cycle between characters (you can't use the same character all the time) but a few can be unlocked over time.  Imagine LoL but as a Player Vs Player arena. No objectives other than own the other team! It isn't as simple as that, though! Combine amulets powers and the gems for stats that you balance to your playstyle. Top it all off with the skill and reflexes you'll need to win.   Having said that, a healer can own anything if played properly!",
            "review_score": "1"
        },
        {
            "review_text": "One of the most intense games I have ever played in my life.  During moments of your gaming in life you experience tonnes of breath-taking, heartstopping and adrenalinic moments which are temporary. These can be from when you sit together with three other friends, taking over B spot on Battlefield 4 while you get surrounded by 2-3 Squads, leaving you to face them 20/3. Moments like these you can feel your heart pumping, your sweat chilling and your eyes focus like they were on freaking crack.  Or take for example if you played Smite, or any other moba - You spend ages to level up and then to gear your character just so that you can join your teammates in team-fights. The fights in these games can vary heavily - some can be instant pubstomps ending up with you killing your enemy rather quickly, whereas others can take some time and some planning. But then there's also those twitch-moments you have in mobas - you know, those rare moments where everything stands still. You are inches away from dying, your mind is blank and you simply are not sure what to do. The enemy is weak, all at low health but plently of mana.   You are the only one alive in your team and you've got plenty of both mana and health - so you choose to do the greedy thing of charging in - ending up with you being put in one of the stickiest situations that you can be in. Enemy after enemy pounces you and you can feel your heart race as well as you see the impending doom that has fallen upon you. Should you escape to base with barely any health left? Or should you press on and get several kills and turn the tide of the battle? Before you even make a decision you see several ulties, abilities and auto-attacks headed your way - you're simply ♥♥♥♥ed... or that's how the situation would be. There's that odd rare moment when during panic and stressful situations your brain enters a complete clear mode. Call it Zen, call it ♥♥♥♥ing super-saiyan, call it binge-eating ben and jerries and get a crack-like sugar-rush on a Sunday evening, your whole body gets heated but - your mind is clear - you quickly devise a tactic in your head and avoid the first ultimate, then you dive in for the kill just to be interrupted by the second ultimate - which you avoid as well. You enter a focused bloodlust where you will kill the enemy team - not plan to, but will.  We have all felt something like this... however these moments rarely come during these games. It's always one or the other. You either pubstomp or get pubstomped.  That is ... unless you're playing Bloodline Champions.  Every moment, every action, every movement, counts to the thrill in BLC. The moments where time freezes and your blood rushes is every second in Bloodline Champions 2 minute games. With instant-tactics and synergetic gameplay, as a Bloodline Champion you must make sure to know what your teammate thinks as well as they know what you think, because there's rarely any room for vocal tactics. The game is fast-paced and if you're damaged - there's nowhere to run. You were put in the ring to fight to death, not to cower back at your base. When you lose a game in Bloodline Champions then it's not as merciful as the other games, where if you respawn you cozy up in your little Base, you get to live to see the cheers. No, here the winner is the one who isn't lying in a pool of his own blood. The winner is the one who survived - For even when the timer runs out, sudden death approaches, allowing no peace - only victory.  cray-review aside - let's discuss this on a more serious note.  The game is a little relentless against beginners mostly due to the fact that it has a low playerbase. When a new player wishes to play a game then they're usually pinned against players who know how to play already. As for the pubstomping, it can occur in Bloodline Champions as well - Just that when you get a proper fight, it's awesome and it happens quite often. Especially once you get the gist of the game - then it happens almost all the time. You know those blood-rush fights that I wrote of a bit higher up on the review? Yeah they happen really frequently.. you just have to have the patience to learn the game. This could mean to learn every character, which there are 21 of I believe, but once you learn a few you begin to notice a familiar pattern within a lot of the characters. Some of them have similiar abilities - but that have different effects basically.   TL;DR - good game. Play it.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games ever. It's a shame that there are not many people playing this game, because they dont know what they are losing by not playing Bloodline Champions. I rate it 9/10 because of some changes.",
            "review_score": "1"
        },
        {
            "review_text": "Nice game, few champions but with a lot of different spells &gt; &gt; &gt; various kind of gameplay with each champ. Very funny with friends, tournaments and guilds at programm :D ",
            "review_score": "1"
        },
        {
            "review_text": "The only thing the game is lacking is a big player base, one of the most balanced and competetive games I've ever played. I strongly recommend it and it's free to play so there's not reason to no try it out :)",
            "review_score": "1"
        },
        {
            "review_text": "This game is ALL about skill. No last hitting creeps, no building items, no grinding to get stronger with your hero.  You fight as soon as the game starts, the matches are short and entertaining. I hope this game gets some more people because it is awesome",
            "review_score": "1"
        },
        {
            "review_text": "+ Everything is a skill shot (even auto attacks) + 3vs3 arena based MOBA + needs time and skill to master + games are quickly done and its a lot of fun + great feeling to become better and start to pwn others + no pay to win (but you can buy weapon skins, skins etc. with real money)  - tiny playerbase - skilled playerbase or bad matchmaking because of the tiny playerbase?  +++ I love this game! &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "while not jammed pack with players, with an unknown reason to me. this game is by far the most action packed arena style game. if you like to play fast paced games with a heavily balanced set of characters and an out of game growth system that plays well into devloping your play style, this is the game to play. 5/5 10/10 100/100",
            "review_score": "1"
        },
        {
            "review_text": "Fast-paced PVP arena game, comparable to Diablo without the RPG elements ;-)",
            "review_score": "1"
        },
        {
            "review_text": "i would recommend it for people that like tf2",
            "review_score": "1"
        },
        {
            "review_text": "I'd like to play with you in this game, it's really damn awesome. And most important, it's free :)",
            "review_score": "1"
        },
        {
            "review_text": "Might just say 1.9hrs on record at the writing of this review, but I`v played the game even before it came to steam.  Pros. +A truly unique take on the MOBA genre. +High risk, satisfying reward. (As in the learning curve of the game) +Smooth gameplay. +Well aged graphics. +Active devs. +Multiple characters to play as, each with 7 abilities.  Cons. -Not a whole lot of people play it. -Because of the low amount of people playing it has bad matchmaking where you`ll get placed with players better than you in the early stages of the game. -Fairly quiet community in-game.  TL;DR - Game feels great, plays great but it lacks people, so jump on in and bare with the matchmaking for a bit, until you get the hang of it.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 arena game. very addicting though its a bit sad that there isn't enough players which makes it kind a bit elitistic (if that is a word w/e)",
            "review_score": "1"
        },
        {
            "review_text": "This game... Is so... ♥♥♥♥♥♥♥ underrated...   It has intense and epic battles and i you almost never get bored with all the bloodlines to choose from. In this game you can prove your TRUE player skills and no one is stronger than you in any way, only true skills matter.   Bloodline Champions deserves to be recognized and played a lot more! I just don't understand! This game is too awesome!!",
            "review_score": "1"
        },
        {
            "review_text": "This is a very nice Arena game!",
            "review_score": "1"
        },
        {
            "review_text": "this is by far the best pvp oriented game I have ever played. It has a few short commings that I will address as well.  Pros. -fast paced games ( most complete games last 5-6 minutes total) -highly based on personal and overall team skill ( stats do not prove who wins) -no meta ( you don't 'have to have a healer' or tank or w.e pick what you want) - no chat filter  cons. -poor and or lack of management  - win traders -long matchmaking times....  - lack of updates or content -lack of players -lack of players who are willing to practice and quit  -complainers....   That out of the way lets touch on the pros. This game will not have you sitting down for hours just for one match bored out of your mind. Even when lossing it just shows you what you have to work on. As stated this game soley works on your skill. You can litterally miss (or dodge) melee attacks making your skill level determine how good you are. There are prefered team comps however you can pick whatever champions you want as long as you kill their team before they can kill yours. In this game with no chat filter they do not overly babysit you and 'force you to behave.' If someone is being annoying just mute them and be on your way.    Now for the cons. The poor management is probably what gets under the remaining players skins the most. You will often see people typing in channels saying ' if only this game had advertising etc. etc.   Lack of updates show the blatant fact that this game is running on autopilot. Even community driven events would have a highly positive impact on the game. Win traders are a plague in this community, I will not point fingers but it gets under everyones skins when you worked hard to get your rank and someone else got they highest ranks by cheating the system.   This game has a lack of players however I would like to note that many veteran players will re download the game to see the current state. If you were to look at the total amount of people who played just for one season the number is quite high even though the quene times are long...  Tagging along with lack of players is the bigger problem. New players have a huge learning curve as well as having to deal with smurfs and wintraders. It is not easy to begin this game and deal with long quene times so many quit.   And finnally people who whine all day about the game. Some people would probably stick around longer if everyone didn't whine in the public channels.  My conclusion is this game is a very good game however it is an unpolised gem. If you pick this game up and manage to get past the long learning curve you can very well spend a lot of time playing.",
            "review_score": "1"
        },
        {
            "review_text": "PvP. Skillbased only. Ingen luck. Best game ever!",
            "review_score": "1"
        },
        {
            "review_text": "Whoops here's another one of those funny little games.  I do love how people seem to think this game is somehow related to DotA-likes or any of the stuff considering it has no levels no items different movement and so forth. But yeah of course you HAVE to add more ♥♥♥♥ to the cauldron of DOTADOTADOTA IS OUR GAME GOOD YET GUYS but no it wasn't and I really don't know what to say about this game oh yeah it's absolutely ♥♥♥♥ing terrible and has all the skill requirements of Super Button Smash Bros.",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome for people into fast pace arena action",
            "review_score": "1"
        },
        {
            "review_text": "this is by far the best pvp oriented game I have ever played. It has a few short commings that I will address as well.  Pros. -fast paced games ( most complete games last 5-6 minutes total) -highly based on personal and overall team skill ( stats do not prove who wins) -no meta ( you don't 'have to have a healer' or tank or w.e pick what you want) - no chat filter  cons. -poor and or lack of management  - win traders -long matchmaking times....  - lack of updates or content -lack of players -lack of players who are willing to practice and quit  -complainers....   That out of the way lets touch on the pros. This game will not have you sitting down for hours just for one match bored out of your mind. Even when lossing it just shows you what you have to work on. As stated this game soley works on your skill. You can litterally miss (or dodge) melee attacks making your skill level determine how good you are. There are prefered team comps however you can pick whatever champions you want as long as you kill their team before they can kill yours. In this game with no chat filter they do not overly babysit you and 'force you to behave.' If someone is being annoying just mute them and be on your way.    Now for the cons. The poor management is probably what gets under the remaining players skins the most. You will often see people typing in channels saying ' if only this game had advertising etc. etc.   Lack of updates show the blatant fact that this game is running on autopilot. Even community driven events would have a highly positive impact on the game. Win traders are a plague in this community, I will not point fingers but it gets under everyones skins when you worked hard to get your rank and someone else got they highest ranks by cheating the system.   This game has a lack of players however I would like to note that many veteran players will re download the game to see the current state. If you were to look at the total amount of people who played just for one season the number is quite high even though the quene times are long...  Tagging along with lack of players is the bigger problem. New players have a huge learning curve as well as having to deal with smurfs and wintraders. It is not easy to begin this game and deal with long quene times so many quit.   And finnally people who whine all day about the game. Some people would probably stick around longer if everyone didn't whine in the public channels.  My conclusion is this game is a very good game however it is an unpolised gem. If you pick this game up and manage to get past the long learning curve you can very well spend a lot of time playing.",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME NEEDS TO BE REVIVED. ESPORTS IS BECOMING MASSIVE AND THIS SHOULD BE A FRONT RUNNER. RENAME RERELEASE OR WHATEVER YOU HAVE TO DO GET SOME MORE EXPOSURE OUT THERE",
            "review_score": "1"
        },
        {
            "review_text": "Played this all the time it is the best game i've ever had played",
            "review_score": "1"
        },
        {
            "review_text": "Got skill? You'll need it! Give it a shot!",
            "review_score": "1"
        },
        {
            "review_text": "So glad its back !! Best moba ever made",
            "review_score": "1"
        },
        {
            "review_text": "I've enjoyed Dota, HoN, Wow Arena, League, Counter-strike since 1.6, and this game is one of the most fun games I've ever played. It's an Arena in a moba setting, quick and fun death match rounds. Each hero is built with a certain formula in mind (one form of escape, one form of survivability, one form of CC, etc) and it plays very similar to WoW Arena, with way more keybinds than a typical dota game, and healer dynamics that really embrace the role of a 'support'.(Healer can keep someone up indefinitely if left alone, has good CC, has OK support damage) These kinds of Healer mechanics are rarely found in most multiplayer games except MMO arenas like WoW.   It really sucks that not a lot of people play it but hopefully it picks back up again.",
            "review_score": "1"
        },
        {
            "review_text": "This game is ALL about skill. No last hitting creeps, no building items, no grinding to get stronger with your hero.  You fight as soon as the game starts, the matches are short and entertaining. I hope this game gets some more people because it is awesome",
            "review_score": "1"
        },
        {
            "review_text": "Great game 11/10  We have to rebuild the community as Wumbologist PhD. said,if the player base starts increasing Stunlock will have no choice but to invest more in the game and raise it even more and make it even better.",
            "review_score": "1"
        },
        {
            "review_text": "Nothing beats playing Heritage Heroes on a rainy afternoon.",
            "review_score": "1"
        },
        {
            "review_text": "Best arena game hands off. Too bad the game population is small. The only negative thing about the game is that sometimes you will get big ping and it really matters in games like this",
            "review_score": "1"
        },
        {
            "review_text": "Very fun skill based game. All the fun of team fighting in a MOBA without all the grind to get there.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game, Its only based on skills and knowlegde. The skins and champions are amazing, Sadly this game has died and no one really plays, but that doesnt mean my friends dont play it, we have a amazing time laughing and fighting each other. I would have more hours around 200+ since i've played till 2013 but kelp switching accounts over and over, But back to the main point i do recommend playing this game with friends and so but not solo, Takes to long to find a Real Game",
            "review_score": "1"
        },
        {
            "review_text": "I love this game, Its only based on skills and knowlegde. The skins and champions are amazing, Sadly this game has died and no one really plays, but that doesnt mean my friends dont play it, we have a amazing time laughing and fighting each other. I would have more hours around 200+ since i've played till 2013 but kelp switching accounts over and over, But back to the main point i do recommend playing this game with friends and so but not solo, Takes to long to find a Real Game",
            "review_score": "1"
        },
        {
            "review_text": "Best Balanced Pvp game!",
            "review_score": "1"
        },
        {
            "review_text": "if this game only got a little more attention it would be an esport. too bad its dead now.",
            "review_score": "-1"
        },
        {
            "review_text": "A game that I once claimed was the best competitive game I ever played. I played this game for countless hours before it came to steam and I loved it.  That being said, this game was ruined in development. Each hero used to feel very unique, but balance patches made a lot of characters a lot less fun than they used to be (Seeker, Glutton, Blood Priest to name a few).  And the nail in the coffin - the talents/gems/medallion system. Back when heroes had a static amount of health and these numbers were low - about 150 to 200 health - the game was much better. You knew if an enemy used an ability, it would be a certain amount of time before it came back off cooldown. Now with the wonky stat system you can never tell their cooldown, their movement speed or how much damage they are going to do. Game feels very pay to win and was practically abandoned with no updates from the old studio.  This used to be an amazing game, and you might still enjoy it if you didn't know it in its former glory. But regrettibly I cannot recommend it anymore.",
            "review_score": "-1"
        },
        {
            "review_text": "First off, don't let the playtime fool you, I played A LOT of this game when it came out. Before it got to steam.  It was a great game. An incredibly fun, competitive, top-down brawler. It felt good to play - controlling the characters felt very robust and proper, the characters themselves were interesting and so were their abilities. It also had quite a bit of depth combat-wise.   Sadly, at some point they decided to release what for me ended up being a game breaking update. It was basically 'memes and league of legends runes' the update. I kept on playing it for quite a while, I really forced myself but it just wasn't the same. The whole element of farming for these pointless (mostly passive if i remember correctly) upgrades, figuring out the one optimal build to go for, etc. just kind of ruined everything the game used to be: an adrenaline fueled, skill-based, FUN brawler.  If the idea of farming for upgrades for quite a long time or just flat out buying them, figuring out which to use on which heroes in a competitive top-down brawler doesn't seem repulsive to you and what I described in the first paragraph seems like something you'd be interested in, then sure, give it a try. Otherwise, I recommend you stay away. This gem has been sullied.",
            "review_score": "-1"
        },
        {
            "review_text": "-3.5/10 wouldn't even waste the effort it takes to throw this game in the garbage can.",
            "review_score": "-1"
        },
        {
            "review_text": "From what I've seen, fun game and an interesting concept of a different style of MOBA.   However, if you're a new player (like me) it's almost impossible to get a game going with other people. Waiting in the queue time 'Searching for other players' will most likely be your most game time play unless you do singleplayer. You're also not going to get placed in any games with lower experience as you so be prepared to get demolished for your first few games.   Good game, just a dead player base for lower levels.",
            "review_score": "-1"
        },
        {
            "review_text": "Game was great... Then they added level advantage with masteries runes and all the other ♥♥♥♥. And the game is dead now... But it was an awesome game while it lasted",
            "review_score": "-1"
        },
        {
            "review_text": "Not really worth the time. This a MOBA based on the WASD movement keys, QERF keys for abilitites and Left and Right Mouse buttons for attacks, Spacebar for movement spell. F1,F2,F3 to use a magic item.  PROS 1. Semi-Novel Reminds me of a Warcraft II mod where players were mages who created spells and leveled up.  CONS 1. Reviews The reviews from the game all follow a line of 'OMG greatest PvP game ever, too bad too few players, call your friends to join'. If I didn't know better, I would just say it was just botted with the same script.  There was even a player that claimed to play 500+ hours in this game. He only played 46 hours.   2. Fun? What's so fun about this game? I'm sorry what's you fun factor?  3. Tournament Leagues You have tournament leagues and e-sports channels even before you've gotten a sizable player base? I think you're jumping the gun here. They've got a league that goes all the way from Iron to Diamond. Extremely ♥♥♥♥♥♥♥♥.  4. Music Horrid repetitive background music that you can't turn off.  5. Bland Characters are really bland.",
            "review_score": "-1"
        },
        {
            "review_text": "Game was good. Stunlock Killed it long time ago. This is what happens when ♥♥♥♥♥♥ publishers ruin games.",
            "review_score": "-1"
        },
        {
            "review_text": "It's not that funny for me.",
            "review_score": "-1"
        },
        {
            "review_text": "its ♥♥♥♥ 0/10 ",
            "review_score": "-1"
        },
        {
            "review_text": "can someone help me out plz?  im getting a white screen when i join a game. i cant find how to fix it.   plz help i love this game",
            "review_score": "-1"
        },
        {
            "review_text": "It's ♥♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "buged out game with more problems then a jew in a gass chamber",
            "review_score": "-1"
        },
        {
            "review_text": "there is somethinke wrong with it? i can't buy new champs and its want load help pls",
            "review_score": "-1"
        },
        {
            "review_text": "It's a good game, by all means. It's just very difficult to get in a match, because of the dead servers. It's also displeasant to see the huge money cap for unlocking new champions or playable classes being 9000 to the lowest being 6000, and only gaining 100 currency each succesful game. However if you don't mind trying it out on singleplayer and or get lucky to find a game. You should definetly try it. I'd give this game a   -6/10 ~Good system and fun controls, however poorly executed with detrementing skill caps, farming and dead servers. It could've been a greater game.",
            "review_score": "-1"
        }
    ]
}