{
    "app_id": 63800,
    "name": "Delve Deeper",
    "release_date": "2010-09-24",
    "developer": [
        "Lunar Giant"
    ],
    "publisher": [
        "Lunar Giant Studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "RPG",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Indie",
        "Adventure"
    ],
    "achievements": 50,
    "positive_ratings": 225,
    "negative_ratings": 159,
    "price": 3.99,
    "description": "Delve Deeper is a turn-based Adventure/Strategy game for Windows that combines HD pixel art, tile placement, and RPG elements in a bright and humorous atmosphere. Up to four players take command of Dwarf mining teams in this fast and furious dungeon adventure meets devious puzzler, building the map as you play for an ever-changing,...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/63800/header.jpg?t=1447353542",
    "minimum_requirements": "OS: Windows XP SP2 or better, Windows Vista, Windows 7 Processor: 1.4 GHz Memory: 512 MB Graphics: Must Support Shader Model 2.0 DirectX®: DirectX 9 Hard Drive: 60 MB",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Delve Deeper is a game about dwarven greed. But mostly TREASURE! Go down there and grab as much as you can for your most exhalted king. And more importantly, get more than the other teams!  You'll go in with five(5) dwarves, and will need to collect as much loot as you can in games that seem to go by pretty quickly. It's a good game to start up when you're bored or don't know what else to play, or just because you want to grab some more of that sweet gold.  Of your team, you can select 3 classes. The slow, powerful fighters. Fast, but slightly weak scouts, and miners who are a bit average at everything but can haul the most loot. Of course, being dwarves, all classes can mine gold, gems and mithril and carry chests of loot out, but some can carry more than others, and some fight better than others.  And since you are trying to prove you are more loyal to your king and better at extracting riches, you may end up fighting the other dwarven teams as well.   It's a simple game with solid mechanics, where you start your turn with a tunnel piece you can put down somewhere to expand your tunnels, or to unleash a massive horde of goblins into your opponent's tunnels. After that, you move your dwarves and end your turn. After that you fight with whichever dwarves are in tiles with enemies on them. A simple and easy to learn system with plenty of maps and plenty of replayability. And on top of that, it's cheap too  Worth grabbing whenever you have some cash left over for it. It's cheap, amusing to play, has plenty of replayability(So long as you don't play it all the time) and a most worthy king to deliver all your gold to who occasionally comments on things going on in his own special kind of way.",
            "review_score": "1"
        },
        {
            "review_text": "I have to give Delve Deeper a thumbs up. It's basically a board game, and requires board game thinking: cards and pieces and everything. You move around and get gold, count your spaces, open up parts of the area strategically to make you earn more or screw with other players. I played this a while ago and was addicted for a while until that computer died, and I then loaded it up recently to find it still holds up. I got the base game and the DLC because it was so cheap and because I saw the graphics for the characters released free on Open Game Art. I don't understand the low ranking here at all, unless it was the Delver game people lured into a fight about the name after this had already been out. The only bad thing about the game is sometimes waiting for the computer characters to move, but I see now there's a setting for that, so it's my own fault. If you go into this thinking it's going to be an RPG you will be disappointed, sure, but that would be stupid seeing as how there's all the preview stuff available before you buy. If this looks like your type of game, get it. If you want a 3D soldier game with fantasy trappings I'm sure you can find one of those on here instead, and you should.",
            "review_score": "1"
        },
        {
            "review_text": "ENG:  If you like terriaria video game as you like about this game! Relaxed and light play a game, who wants to take a more relaxed and does not want to think too much, turn-based style seasoned treasure hunting game, and enemies, and other goodies, then this is the ideal choice for casual gaming sessions. Includes multi-game support. Testimonial!  FIN:  Jos pidät terriaria video pelistä niin pidät tästä pelistä! Rento ja kevyt peli pelattavaksi, joka haluaa ottaa rennommin eikä halua liikaa ajateltavaa, vuoropohjaisella tyylillä maustettu aarteiden metsästys peli ja vihollisia ja muuta kivaa niin tämä on sopiva valinta rentoihin pelisessioihin. Sisältää monipelituen. Suositteluni!",
            "review_score": "1"
        },
        {
            "review_text": "This game will quit automaticly to desktop before i can finish a game until this is fix i can not recommend this game",
            "review_score": "-1"
        },
        {
            "review_text": "While the idea is extremely attractive - turn-based strategy guiding a team of dwarves through the perils of a mine - the execution falls flat with an opaque interface that half the time takes your indecision as 'AHA I SHALL DO THIS RANDOM THING'. Also, it's unplayably buggy. Too bad - I think I might have liked it.",
            "review_score": "-1"
        },
        {
            "review_text": "There are very few things that make me hate a game straight away. One of those things is instantly recognizing that the game's music was 'created' by typing 'royalty free music' into Google and clicking on the first link that popped up. (Okay, so Kevin MacLeod's website is no longer the number one result, but it's still pretty close.) I understand it's the only good option for somebody unwilling to share profits with a musician, but man, does it suck.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a clever game where teams of Dwarves compete for treasure. It offers a unique stategy element and a bit of comedy. It's easily worth the cost.",
            "review_score": "1"
        },
        {
            "review_text": "turn based strategy. very fun, like a board game. combines tile laying with control over a dwarf team. Only for hotseat multiplayer unfortunately, but great for that.",
            "review_score": "1"
        },
        {
            "review_text": "This game amazes me by its nigh infinite replayablity. I keep waiting for the novelty to wear off, but it doesn't! Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Why would you refuse an opportunity to Delve Deeper?",
            "review_score": "1"
        },
        {
            "review_text": "Free DLC? Imma recommend it!",
            "review_score": "1"
        },
        {
            "review_text": "Just not my kind of game. Its a game where you race for resources by deciding who/where to dig and how long. The goal is go go deep and out perform the other teams.... unfortunately I felt annoyed just trying to learn the game and once I did start to pull ahead on the first couple of levels: I decided it wasn't my thing. I guess watch some Youtube videos and see if you like this sort of thing. Reminds me of a mixture of Final Fantasy mini-games and lemmings.",
            "review_score": "1"
        },
        {
            "review_text": "the only game i did'nt understand 10/10",
            "review_score": "-1"
        },
        {
            "review_text": "idk worth the few cents I paid :T",
            "review_score": "1"
        },
        {
            "review_text": "This game is not fun at all unless you have a friend to play against, and even then the fun is quite limmited.",
            "review_score": "-1"
        },
        {
            "review_text": "DORFAN GAEMS. Clever little turn-based strategy about competing to haul the most amount of treasure in a set number of turns. It's very board-gamey in its precision gameplay of managing limited resources, from building sabotage tunnels that bring nasty monsters into your opponent's base to accounting for the number of turns you'll need to make it to the nearest treasure drop-off point.  Delve Deeper is a very dynamic and compact strategy game perfect for fun half-hour gaming jaunts, plagued only by some inconvenient &amp; occasionally frustrating controls.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun turn-based mining game. Plays a bit like a boardgame. Choose different classes of dwarves and attempt to bring the most treasure out of the mine. Play vs CPU or friends (hotseat only). Lots of variety in the maps and enemies. One of the more unique and continually enjoyable indie games I've played. Highly recommended!",
            "review_score": "1"
        },
        {
            "review_text": "Game is fun but...  It crashes like crazy. It's hard to enjoy a game that always crashes on you. Not to mention no save feature so ALL of your progress is lost.  Oh, and no multiplayer; online anyway. This would be a great game to play with friends but apparently only local friends count.  Big disappointment! BUT, it is fun which makes it worse because it IS an enjoyable game and I WANT to play it. &gt;&lt;",
            "review_score": "1"
        },
        {
            "review_text": "This isn't dwarf fortress i can tell you all that it's pretty boring actually. But at least it tries it's best.",
            "review_score": "1"
        },
        {
            "review_text": "The game gets boring really fast. While it has a lot of potential the potential is mostly lost in the clunky controls and repetative gameplay.  The game consists of building up tunnels to 'Delve Deeper' into a mountain. However a lot of your turns are spent either sitting on a mine or returning to base. You have three different classes, the scout who has more moves, the miner which has more inventory and the soldier which has more health. However since you end up using all your dwarves for just about everything, the you can't really take advantage of the class difference. Also since you can't trade between dwarves, you may a scout obtain soldier relics or something similar.   The controls are by far the worst part of the game though. You select a hexagonal space by centering a giant hexagon in the center of your screen over it. It makes it insanely annoying to do anything. Also it's easy to make unintentional moves when selecting dwarves and moving your camera through the field.  That being said, the game is rather challenging. Even the easy mode AI is a tough fight. Games are not extremely long so you have to make the most of every move. If you're looking to kill some time, you might try this game. However I would not recommend buying it for more then a $1 as it is not a very expansive game.",
            "review_score": "-1"
        },
        {
            "review_text": "Neat little game, turn based strategy, good humor, I got it for a couple dollars, worth it I say!",
            "review_score": "1"
        },
        {
            "review_text": "A fun and hilarious turn-based strategy game. This is coming from someone who hates strategy games.",
            "review_score": "1"
        },
        {
            "review_text": "Oddly addictive. Turn based, questing/puzzler.",
            "review_score": "1"
        },
        {
            "review_text": "Was enjoying my first play of the game but crashed on turn 12/14. Tried playing again and crashed during the first turn.",
            "review_score": "-1"
        },
        {
            "review_text": "First off: I never had any technical troubles with this game.  This is a 2 to 4 player board game on your PC. Don't play this alone. With the right people it is a lot of fun and you will scratch your eyes out over who will get what treasure.  The graphic is nice but nothing special. It really is all about watching your friends dig up a wrong tunnel while you are happy over your nice treasure, only to have it be worth negative gold in the end.",
            "review_score": "1"
        }
    ]
}