{
    "app_id": 63910,
    "name": "King's Bounty: Crossworlds",
    "release_date": "2010-09-17",
    "developer": [
        "Katauri Interactive"
    ],
    "publisher": [
        "1C Entertainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Cloud",
        "Includes level editor"
    ],
    "genres": [
        "RPG",
        "Strategy"
    ],
    "tags": [
        "RPG",
        "Strategy",
        "Turn-Based Strategy"
    ],
    "achievements": 0,
    "positive_ratings": 492,
    "negative_ratings": 47,
    "price": 11.99,
    "description": "King’s Bounty: Crossworlds is the stand alone expansion for the famous King's Bounty: Armored Princess role-playing game that contains an improved version of it, two additional campaigns and world editor.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/63910/header.jpg?t=1553189750",
    "minimum_requirements": "OS: Windows XP/Vista Processor: 2.6 GHz Memory: 1 GB Graphics: nVidia GeForce 6600 with 128 MB or equivalent ATI Hard Drive: 5.5 GB free hard disk space Sound: DirectX-compatible soundcard",
    "recommended_requirements": "OS: Windows XP/Vista Processor: 3 GHz Memory: 2 GB Graphics: nVidia GeForce 7950GT with 512 MB or equivalent ATI Hard Drive: 5.5 GB free hard disk space Sound: DirectX-compatible soundcard",
    "reviews": [
        {
            "review_text": "This game is just too pretty for words, and it runs very well on my almost 5 year old laptop on mostly high settings. Heck, even on all low settings the game is still beautiful.  Now to the gameplay: The combat plays very much like the HoMM series, yet is still quite unique and diverse. I'm someone who finds it rather difficult getting into HoMM-like games because I love that series so much, but this game... is so unique and fun that I can't help but love everything about it. I love the free-roaming, the easy to use interface, the sea faring and quirky humour. I love the different units and all their special abilities, I lovelovelove my dragon which is so useful! Even the music is breathtakingly beautiful and sets the mood so well.  This game is definitely worth the price. I grabbed it on a sale hoping to god it would run okay-ish on my laptop. It does and is worth every cent!",
            "review_score": "1"
        },
        {
            "review_text": "King's bounty is great because it's an army management game, but combined with rpg elements. Other than the Might and Magic series, there aren't a lot of games like it. Where Might and Magic focuses more on resources, city management, and grand strategy, King's Bounty offers the other side of the coin; the loot hunting, skill tree level ups, and a grand world filled with multiple areas/islands to explore. There's a story too, but it's a bit on the light side. You'll find hours of entertainment here if any of the qualities above pique your interest.",
            "review_score": "1"
        },
        {
            "review_text": "King´s Bount Crossworlds is based on the same (successful) receipt of the Legend, focusing on RPG turn-based strategy. The game does not include major changes or updates so if you loved/hated the original you will have the same feelings here. It requires careful planning on how to upgrade your hero, equip her with artifacts and spells and form your army. Upgrading the hero is limited by crystal that have to be consumed to level-up the skill tree. Spell allocation and upgrade is done through the use of (limited in number) crystals and formation of army is limited by leadership, economics and availability of specific army types.  The combination of these elements, and the turn-based character of the battles, add a thick strategic layer that require thinking. If you are rookie you may end up easily without army or resources very early in the game.  Pros: + excellent strategic element, turn-based strategy at its best + nicely done graphics for environment and units + beautiful sound (although one could claim that it is too similar to Legend) + huge variety of units, spells and artifacts + great repliability as mage, warrior or paladin and by combining different kinds of units + nice RPG elements in hero evolution, you end up as a killing machine + minor clever changes with respect to Legend that improved on some cons of the original: ability to fly and thus accelerate travel, more maps with shorter surfaces to cover + one new class of units (lizards) + interesting boss battles that play differently than regular conflicts + companion is an interesting addition, similar to the spirits of Legend  + very similar to Legend, if you loved it (like me)  Cons: - very similar to Legend, if you disliked it - too similar to Legend, especially with respect to the places visited. I would like to see more new places and units - perhaps there are too many spells, some of them never to be used, you can easily spend too many crystals on them, some hero skills seem irrelevant so are many units - most of boss battles require specific tanking approach that can be repetitive. Would like to see distinctly different boss battles - as with Legend if you are new it is very easily to get confused by the game mechanics early in the game. A tutorial could be helpful  All in all, heartily reccomended. As a player who has invested lots and lots of hours in turn-based games I rank this is one at the very top: one of the shining examples, up there with Heroes of Might and Magic III and King´s Bount Legend.  On a side note, for the next chapters of the franchise I would like to see more drastic changes (hopefully not leading to a downhill path as HOMM).",
            "review_score": "1"
        },
        {
            "review_text": "Classic HOMM style gameplay. recommended from a dedicated fan who has played em all since the original C64 kings bounty.",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoy the King's Bounty style of gameplay. It's a delicious blend of RPG and Strategy. It's also a constant struggle, as you try to conquer the map as efficiently as you can--while leveling up skills, equipping useful gear, acquiring magic and managing your choice of units. The gameplay and quests are repetitive to be sure, but it's still so darn addictive. To top it off, the game is also chock full of content, so much so that I'm not sure I'll ever complete it.",
            "review_score": "1"
        },
        {
            "review_text": "Love King's Bounty! I've played hundreds of hours in most of the series and each game is great. Support the devs, buy and play a great game!",
            "review_score": "1"
        },
        {
            "review_text": "best game in the series of King's Bounty; buy this if you want to try the games out, or Vanilla Legends is also a nice starting point.",
            "review_score": "1"
        },
        {
            "review_text": "Much more interesting than the Might and Magic Heros series.",
            "review_score": "1"
        },
        {
            "review_text": "The mini-campaigns were sort of fun. I never replaced AP with the additions, though.",
            "review_score": "1"
        },
        {
            "review_text": "Probably my most favourite strategy games of all times and I've played them all. Thanks to King's Bounty I found a new joy of playing videogames again. On the surface it's a HOMAM ripoff of course but beneath it it's got so much more life, vibrancy, sparkle and new ideas than the ever more listless iterations of HOMAM it has completely overshadowed its old teacher. The Legend, and especially it's perfected sequel Armored Princess, boasts THE best and most enjoyable tactical HOMAM-like combat of all games ever made, no contest.  Unfortunately the publisher decided to milk the series dry and came up with two more sequels, Warriors of the North and Dark Side. Both games have the same exact engine with very few innovations. They're basically glorified custom campaings made in the Map Editor. The sparkle and magic are mostly gone and what we got was lifeless, dull grind, designed without much care or thought, probably by just a fragment of the original team (or maybe just a few interns), just to squeeze a few more dollars from the franchise. Avoid at all costs (Warriors of the North is still passable if you become a KB addict but definitelly avoid Dark Side).  But the first two games are unambiguously great, full of wit and playful brilliance, and will forever remain in my heart.",
            "review_score": "1"
        },
        {
            "review_text": ":)",
            "review_score": "1"
        },
        {
            "review_text": "This game has such a unique elements that seems exciting at first but quickly you will realize how much of a grind it is. The troops you can get are not only limited, but youll have to make trips back and forth to where you can buy them. These 2 elements combine to limit expirementation to extreme levels.   I also have an issue with the battle elements. You have 3 main things to consider/use, your hero spells, your troops, and your dragon. I just dont feel like these 3 systems go well together. There is no cohesiveness. It feels like the troops should be the main focus but your skill tree only empowers one of these things which means you could end up in a situation where your just using your hero spells instead of troops.  The story also takes ages to get going which hampers the expirence even further once youve seen everything the battle system has to offer.",
            "review_score": "-1"
        },
        {
            "review_text": "Identical to mechanics, graphics, music, characters, system, storyline, and enemies. The only thing different from this is the fact that it introduces an 'expansion' to the original game in order to give more storyline. In all honesty, this game is technically an expansion, but it starts and has the exact same beginning, options, characters, and method as the original, where as its 'expansion' only takes place with a separate island and minor side quests. This game could have been easily added as an update and not the exact same. Sadly, like the original, you do not get a choice to select race, only difficulty of game, banner of flag, and style of character (warrior, paladin, mage). This game came in a bundle pack with the others while on sale. I would highly suggest not wasting your time on it.",
            "review_score": "-1"
        },
        {
            "review_text": "This really is an ultimate game: swords and adventure, but hex based combat. It's a great implementation with a lot of depth and texture.",
            "review_score": "1"
        },
        {
            "review_text": "I got this game in a bundle with 4 others for $6 on sale. I have put over 26 hours into the game so far, and while I have gotten somewhat tired of the game, I have thoroughly enjoyed it. What I can't emphasize enough is the value that comes with this game. 26+ hours in, and I still haven't beat the first of the four campaigns; I am probably 75% through the campaign I am in right now. There is easily 100+ hours of content in this game, way more than you get out of most AAA titles, and at around 10-15% of the price (on sale). The graphics remind me of an updated version of Warcraft 3 (which I love), and I really enjoyed the combat. If you are a fan of these types of games, there is no reason why you shouldn't pick up Kings Bounty: Crossworlds.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game series! :)",
            "review_score": "1"
        },
        {
            "review_text": "A bizarre and deeply flawed little game that is perfect just the way it is. This series (all of which are functionally the same game, but Armored Princess is better) is probably more responsible than any other title for me switching to PC from next-gen consoles.",
            "review_score": "1"
        },
        {
            "review_text": "An excellent turn-based strategy. It's better and more clever than Heroes of Might and Magic. It's all combat though; no empire management type stuff. My only gripe is the limited number of a unit type available to buy. It makes it hard to recover from too many pyrrhic victories; you can't just go grind gold to buy more.  + Everything + Enough random generation for several playthroughs - No way to grind if it gets too hard (rare). You're just stuck.",
            "review_score": "1"
        },
        {
            "review_text": "Turn based fights with strange magics and spells. Pretty awesome and I spent too many hours doing it.",
            "review_score": "1"
        },
        {
            "review_text": "Crossworlds is an expansion for King's Bounty: Armored Princess. What Crossworlds does is basically to take the same campaign from the main program and adds all kinds of new troups, enemies (it also introduces new mini-campaigns that I haven't tried yet)... I never played the original campaign of Armored Princess, therefore I started with Crossworlds right away, because I wouldn't play the basically same campaign twice in such short intervals.  The game itself is of a turn based strategy type during fights and real-time when simply moving through the game world. Said environment consists of several diverse islands (inhabited by pirates, orcs, barbarians, dwarfs...). All islands are filled with secrets, treasures, characters, quests, shops, enemies... Islands become available, once certain navigation charts were found. They are then accessible by boat.  The story itself is rather genre-typical, but not bad at all, especially to fantasy fans. It also doesn't take itself too serious.",
            "review_score": "1"
        }
    ]
}