{
    "app_id": 65080,
    "name": "Kaptain Brawe: A Brawe New World",
    "release_date": "2011-01-20",
    "developer": [
        "Cateia Games"
    ],
    "publisher": [
        "Libredia Entertainment"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "Point & Click",
        "Sci-fi"
    ],
    "achievements": 0,
    "positive_ratings": 87,
    "negative_ratings": 30,
    "price": 3.99,
    "description": "Step into the world of interstellar travel, where Space Pirates lurk at every corner. Kaptain Brawe embarks on a journey filled with quests, conspiracies and general chaos.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/65080/header.jpg?t=1529671756",
    "minimum_requirements": "OS: Windows Xp / Vista / 7 Processor: 1 GHZ Memory: 256 MB Graphics: 32 MB 3D DirectX®: 9 Hard Drive: 350 MB Sound: DirectX compatible",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This game was rather enjoyable. I feel like this game is a very good starting point if you are new to point and click adventure games. The reason for this is the game is not too difficult, but there are some pretty good puzzles that make you think (I believe the puzzles are what define this style the most, since other aspects are easily found in other styles of games). I think that there are some games out there that take the puzzles too far to the point of frustration for veteran point and click adventure gamers, as well as those new to these games. For someone like me, I can live with some of these less desirable parts because I have witnessed some truly astounding games of this style! But sadly for some newcomers, they leave before they can see the great aspects that these types of games have to offer. Therefore, I think this game is a good safe start if you are looking to try out these types of games.  On a more negative note, the game sadly was not a very long one, which in turn made the story very short and a little bit under developed. The story turned out to be decent enough, but remember I said decent, not 'the greatest thing since sliced bread'. I was also not super into the style of the art and design of the game, but while I wasn't into how the game looked I have to admit that I think many people would enjoy the art of the game and many would also consider the art to be quite good. One last thing that you will have to live with is reading text. No voice acting. Again, not something that someone who played any of the older Sierra and Lucasarts games would have a problem with, but others might.  So while this game does not fall in my top tier of point and click adventure games, I didn’t feel like it had any glaring problems either and I do believe that the game is worth a try for fans old and new. If you have some spare time pick up this game, sit back, relax, and enjoy your next voyage in space.  Check out my other point and click adventure reviews on my page!",
            "review_score": "1"
        },
        {
            "review_text": "Kaptain Brawe is a 2D point-and-click adventure game in a 'space' setting. You're mostly on different planets that are very much like Earth so it doesn't really feel like you're in space.   The game has 2 difficulty modes: adventure and casual. In casual mode you can get hints if you need them and in adventure mode you can't. That's pretty much the only difference between them. As for the controls, you have just 2 options to choose from: look at something and use/pick up something.  The game doesn't have voice acting so you have to read the subtitles to find out what's going on. I didn't find the story to be that great so I just skimmed through the conversations. The lack of voice acting is probably a good thing, because the quite likely bad voice acting would have made the game worse for me. The music was pretty good though.  Most of the puzzles were pretty simple and easy to figure out. There were a few puzzles where you had to interact with objects that were somewhat hidden in the environment and it took me a while to find them. However, there is a button that shows all the objects on the screen that you can interact with, but I didn't use it. Once I found the 'hidden' thing I needed to interact with, rest of the puzzle was very easy to figure out.   Overall it's a pretty good game. Quite short though as it only took me a bit over 2 hours to complete.",
            "review_score": "1"
        },
        {
            "review_text": "This game is super funny, I really like it!",
            "review_score": "1"
        },
        {
            "review_text": "Amusing... Short... and cheap. Why not waste a few hours on it?",
            "review_score": "1"
        },
        {
            "review_text": "Kaptain Brawe tried to boldly go where others have been before and partially succeeds. I loved the cartoonish style and the throwback to the golden era of gaming, but unfortunately that's where it stops short. The game is not very long (about 7-8 hours), but it's a decent experience overall. The problem is, it could have been much better if it had better story development, more fully-fleshed characters and more entertaining puzzles. I love point and click adventure games, but if I spend too much time combining things at random and when I get bored and look for the walkthrough I don't go 'Damn, I should have thought about that!', but instead 'WTF!', well, that takes away from the gaming experience. To be fair, there are some fun puzzles, that actually add to the story, but I wish there were more of them and more story development to begin with.  I always wonder when I see a game like this, why it fell short of it's potential? For indie projects I assume it's all about the budget, but still... I would recommend this game only for P&amp;C fans and when it's on sale.",
            "review_score": "1"
        },
        {
            "review_text": "A funny game. Point and click mode, find a way in mode...  6.2",
            "review_score": "-1"
        },
        {
            "review_text": "sucks out loud",
            "review_score": "-1"
        }
    ]
}