{
    "app_id": 6510,
    "name": "Lost Planet™: Extreme Condition",
    "release_date": "2007-06-29",
    "developer": [
        "CAPCOM Co., Ltd."
    ],
    "publisher": [
        "Capcom"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Partial Controller Support",
        "Valve Anti-Cheat enabled"
    ],
    "genres": [
        "Action",
        "Adventure"
    ],
    "tags": [
        "Action",
        "Adventure",
        "Third-Person Shooter"
    ],
    "achievements": 0,
    "positive_ratings": 569,
    "negative_ratings": 178,
    "price": 9.99,
    "description": "Driven to the brink of extinction on ice-covered wastelands, humankind fights to survive. Battle to survive against gargantuan alien Akrid and treacherous Snow Pirates on the vast and frozen landscape of EDN III.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/6510/header.jpg?t=1543619216",
    "minimum_requirements": "Windows® XP, Intel® Pentium® 4 supporting HT technology or AMD Athlon™ 64 3500+ or greater, 512 MB RAM (Windows XP) / 1 GB RAM (Windows Vista), 8.0 GB free disk space, 640x480 minimum resolution, 256 MB VRAM, DirectX®9.0c / Shader3.0*, NVIDIA® GeForce® 6600 or greater**, DirectSound compatible. DirectX®9.0c, Mouse, Keyboard, Broadband connection (Internet connection required to play.) Recommended: Windows Vista™, Intel® Core™2 Duo, 1 GB RAM (Windows XP) / 2 GB RAM (Windows Vista), 1280x720 or higher resolution, 256 MB VRAM, NVIDIA® GeForce® 8600 or greater, Gamepad, Xbox 360™ Controller for Windows® * Operation not assured if VRAM is shared with Main Memory. ** NVIDIA® GeForce® 7300 is not supported.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "My favorite part about this game, that I wish we could see in more singleplayer experiences nowadays, is the fact that it doesn't hold your hand. There's no 'FOLLOW' sign hovering above NPCs, there's no slo-mo sequence during boss battles to help you get a better shot, and the game only gives you hints, not explicit instructions, on how to proceed. For example, rather than 'dodge the exploding missiles this boss sends flying at you and aim for its weak spot on its stomach' you get simply get 'keep moving'. The game doesn't tell you how to fight the numerous types of enemies you encounter, you have to figure it out as you go. It's forgiving, but not too forgiving. For example, if you spent all of your energy trying to get through a certain area, there will normally be a station at the end to give you a one-time refill so you aren't completely ♥♥♥♥ed.   The system of necessary, but constantly draining thermal energy is what really makes this game. There will be times when you absolutely have to decide between fighting a group of enemies in order to get the thermal energy they drop, while risking getting hurt and losing even more; or you can try to outrun the enemies, many of which are much faster than you, and leave behind their potentially live-saving thermal energy. There's no 'Restart from Last Checkpoint' option in the menu, so these decisions need to be made quickly and you'll have to live with them afterwards. During boss battles, especially ones where you pilot a mech (which drain your energy at a faster rate), you will quickly find yourself taking note of where all the stores of thermal energy, ammunition, and cover are and incorporating them into a strategy.  I'm not trying to make this game out as some kind of unholy, Dark Souls-esque death grinder, but rather this is the way that I feel that all single players games should be in order to be worth a full $60 price tag. Enough with the in-game hand holding incorrectly called 'hints'. Enough with 'boss battles' that can only be won if you wait for a quicktime event or predetermined action in order to beat them. And even though it came out in 2007, it still looks and plays pretty good. Not enough single player experiences have genuinely hard levels, boss battles, or enemies. If you want a game that will give you a challenge, this is the game for you. A classic action/adventure game, starting off relatively easy and getting more and more difficult as you play through. Capcom is known for making good, challenging games. If only more developers could take a page from how a single player experience should be, at least on the harder difficulties.",
            "review_score": "1"
        },
        {
            "review_text": "Had a ton of fun playing this game!  Pros: - The combat is GREAT, punching akrid in the face with a 30 ton mech is really a nice sensation - A lot of different mechs, each one requiring a complete different approach - Huge Monsters (HUGE) - The graphic is still pretty good even after all this years  Cons: - The story is TERRIBLE, after playing this you will probably appreciate more even Twilight - The final battle, *SPOILER* Whoever designed it should be exile from our planet...after 9+ wonderful hours of game, feeling great in a juggernaut of metal, shooting bullets big enough to pulverize a car, for the final battle you find yourself flying in the brain damaged cousin of gundam, with huuuge energy sword...incredibly UNfunny to use, and slow like a dead frozen pig...using the same TWO attack over and over...and over...and over...and   In the end, it's a good game, to maximise the fun: 1) When a cut scene start, mute the audio and read a comic...or a magazine...or count the cars passing outside, whatever you do, it will be better than following the story 2) Have someone else doing the final battle, don't spoil yourself the memory of the entire game with that atrocity.",
            "review_score": "1"
        },
        {
            "review_text": "Great game and great story first played on xbox now pc the both the same but this game is much prettier the the xbox and it still feel right to play 9/10 on this game and very big boss fights you will love the boss fights",
            "review_score": "1"
        },
        {
            "review_text": "Pros: - Fun game play, weapons, mechs, and HUGE bosses. - If you play games for awesome shooting action and boss battles, you will love this.  Cons: - Horribly hokey story/acting. A slap in the face to intelligent sci-fi narratives. - If you play games for good story and characters, you will be very disappointed.",
            "review_score": "1"
        },
        {
            "review_text": "Background: Kinda enjoyed Lost Planet 3 and had always been interested in playing the first two since before. Not interesting in multiplayer so didn't even try.  The Good: * Big bugs are fun and rewarding to fight * Simple controls and movement with an often useless map * Looks OK for it's age with some has great alien design * Decent story and characters keep things moving * Good weapons and great damage feedback gives impact to battles * Grapple works really well but could have been necessary more often  The Bad: * Graphics look bland and dated in places (not badly so) * Keyboard bindings sometimes ignored by in-game feedback * ConsolePortitus in the menus, movement and gunplay too * Small Bugs feel like cannonfodder and aren't ever a challenge * Walking speed feels sluggish and you rely on jump and slide * Thermal tick down could have been more interestingly used  Impressions: Overall I liked the game and it's design work and mechanics even if it was rather simple to beat and outside of boss battles it's mostly unmemorable.  It might be unfair to expect more from a game of this age but I was left feeling that there was a cracking experience here that was dragged down by console port limitations. To be fair they give you a lot of rendering options for compatibility but sadly it didn't extending into updating the in-game feedback for what keyboard button to press in some situations.  Recommended for:  Conclusion: 6/10. A fun retro console like diversion that feel unambitious. ",
            "review_score": "1"
        },
        {
            "review_text": "A fun game that is enjoyable after all this time, would recommend giving it a try if you enjoyed Lost planet 3 or similar sci-fi shooter games that aren't quite so visceral as Gears of War.",
            "review_score": "1"
        },
        {
            "review_text": "Just finished this game. Based on in game play time, it was about 5 hours, I'd add about another hour for the cut scenes between missions, giving it a whopping ~6 hours total play time for the campaign, a far cry from the 8h42m-9h15m listed on  howlongtobeat.com .  So you'll notice right away, this is a negative review, why? Did I enjoy the game? Were there any issues? How was the story? I'll go over all these below, but the negative review comes from the bottom line- would I recommend this game to a friend...? Nah...  Let's start off with the meat and potatoes of the game.  If you told me at the start this game was an anime episode, I wouldn't have believed you for a second. This is about human life settling on an alien ice planet, fighting vicious, gigantic alien beasts (Akrid).. No effin way this is an anime episode, man... but it is.  The characters are overly cliched, in an anime style and fashion (google Rick or Luka &amp; Lost Planet), and the story was extremely cliched. The main character loses his memory, meets these over-the-top anime characters, and then he immediately goes out to fight aliens and clear out their hives on their behalves. Facility doors open automatically for the Akrid creatures, key characters 1 shot enemies in cut scenes, even when aiming behind their back, and the bad guys don't ever shoot the good guys, even when they're vulnerable. UNGH, there were so many logical pit falls in this game!  Combat wise I think I ran out of ammo once or twice, but it didn't last more than 5 or 6 seconds for me to just run over and pick up another gun off the ground. Your Akrid enemies have red weak points, sometimes hard to hit, especially with the technical issues below. Human enemies use various guns, turrets, and mechs or walkers of various power. Difficulty wise, I played on normal and only died on 1-shot Akrid kills and the final boss. I literally didn't die from any other skirmish or combat. Combat was kinda idiot proof with ammo, guns, and mech suits scattered EVERYWHERE.  Spoiler: The final boss fight you hop in your gundam suit, flying over the planet surface while fighting the enemy gundam with your plasma swords. Yeah.... anime....  Input wise, you'll want to play this game with a controller, as I did, to avoid the confusion of constantly being prompted for Xbox 360 buttons, this is a really negative point for a PC port, this criticism is similar to the one I gave for Dead Light. Keep in mind I didn't have an Xbox controller active when I started playing this game.  Other technical issues plaguing this game included off sync audio during all cut scenes, even after restarting the game, and huge screen tearing issues during fights where big creatures or mech units were supposed to be causing the screen to shake or vibrate. Instead I got full horizontal screen tearing. I almost quit playing the game because of this as it was near impossible to aim at the stupid little red weak spots of the enemies.  Bottom line, would I recommend this to a friend? No. The anime features, overly cliched story &amp; characters, horrible 1 liners, and technical issues aren't worth the fuss. Did I have fun? Yeah, it was ok, but there were a lot of frustrations along the way.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game, boring story, awesome gameplay. It still has pretty decent graphics for it's time, even considered for today. The only issue i have is that it keeps crashing on the DX10 version. At least every 5-7 minutes. If they could find away to resolve that issue, game would be at it's best. 7/10 because of crashes. Without it would have a 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "This game is all about 3rd person combat on foot or in mechs. The weapons and the control of the vehicles is pretty fun. The grappling hook is a nice touch and the thermal energy aspect moves the game forward. I love how you can pick up huge weapons off the ground and attach them, to your mech.  What kills this game is lack of enemy AI, dull level design and poor enemy placement. You'll see the same couple of soldier enemies throughout the entire game and you kind feel pity for them as you gun them down. There are some cliche bosses to break up the monotony. But overall, the whole experience was bland and joyless.  The final boss (level 11) is the worst thing about this game. You have to learn a whole new control system in order to do a contrived aerial boss fight. The battle is scripted in a way that makes is easy to finish if you know the sequence.  The storyline, dialog and voice acting are remarkably lousy so you'll want to skip that. Don't even try to follow the story... there's no payoff and they almosyt never directly relate to the game itself.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game ...and feeling !!!",
            "review_score": "1"
        },
        {
            "review_text": "If you've ever felt like punishing yourself with the abortive remains of what could've been a fun game, then this is the game for you!",
            "review_score": "1"
        },
        {
            "review_text": "  This game has very simple mechanic and one would think that it is very boring. But, oh boy, I love this game. There is something addictive in it. I've got it with my GTX550TI back in 2012 and since then I ocasionaly redo storyline and each time it was fascinating.",
            "review_score": "1"
        },
        {
            "review_text": "THIS IS A BAREBONES PORT. You can change your buttons, but many options are unexplained or lacking (camera turn speed is both poorly lacking and dosen't have a setting up to my shooter standards). If you're okay/ready for that, you may just enjoy yourself. Aside from the bare-port nature, the negatives amount to standard stupid Capcom writing and occassionally frustrating design. A massive worm can kill you in one hit, but can be avoided so long as you're willing to walk around the entire edge of the map. A section with a moving platform might be ended completely if you fail to kill explosive enemies in time. Later bosses can easily force you into no-win scenerios, made all the more frustrating by a lack of any easy 'restart from last checkpoint' button. These things suck, but the shooting is fun, and few games let you use a grapple so 'freely' (the short range you need for the grapple sucks, and you can't use it mid-jump).",
            "review_score": "1"
        },
        {
            "review_text": "Can't even change my mouse sensitivity.",
            "review_score": "-1"
        },
        {
            "review_text": "Now. It's not that it's a bad game, not at all it's a bad port. My biggest issue with this game would be the lack of mouse sensitivity and the crashes now and then ( may just be my issue, no one else seems to be having them as much as myself)   Lost Planet: Extreme Condition is a game best played on a console.",
            "review_score": "-1"
        },
        {
            "review_text": "Generic console shooter with weird physics and slow movement that keeps crashing and wiping out all progress because it doesn't autosave and there's no other means of saving a game.",
            "review_score": "-1"
        },
        {
            "review_text": "It didn't take long to remember why I never finished this back when I first got an xbox 360. The save points are complete garbage forcing you to reply huge sections if you screw up, the movement speed MAY be faster than an elderly turtle, and the story is throw away at best. To top it all off, it's a mediocre PC port. I'd say nah on this one.",
            "review_score": "-1"
        },
        {
            "review_text": "Game PLay is good and effects are great but it really sucks you cannot save the game except on completion of a mission.  3rd mission sucks because after you get everything and are prepared to assualt the worm and it destroys or eats you. IF you get across to the next objective you cannot enter or proceed. Very sad it sucks after the first 2 missions.",
            "review_score": "-1"
        },
        {
            "review_text": "Repetitive, crashes constantly, stale story, worth it if you get it dirt cheap.",
            "review_score": "-1"
        },
        {
            "review_text": "A terrible game with peculiar fans.  If you enjoy:  -Slow movement -Slow interaction -2 weapons only -Slow climbing -Every action being cancelled by all hits in the game, specially the cluncky grappling system. -Bad guns sound effect with no good feeling. -Thermal system that tiks down like a ♥♥♥♥er (at least on hard), which will end you with so much Thermal thing that you are god and you don´t give a ♥♥♥♥ or with an irritating clock of death while you are stunlocked. -Stunlock, perma-stun, etc. You will be Stuned so many times by so many AoE attacks (missiles, rocks,whatever) that is not even funny. -Smoke, so much smoke/snow particles that you wont see a thing, almost all the time, but don´t worry, tha tAI will see you. -Bad AI, bugs are ok i guess but dudes will stand in place and be shot in the face, but don´t worry, they will spame missiles even if they don´t see you antmore (which gnerate a ♥♥♥♥ ton of smoke and stunlock!) -Generic characters -Story...forget about that, is there even a story? -Cluncky controlls (you have to maintain pressed the crouch button to then press jump to dodge, like seriously....) -Mechs are even clunkier, slower, not really more powerfull (specially when you want to go inside one quickly and you characters decides to instead take one of the weapons of the mech). -Boos characters that will not stay still for a freaking second, like absurdly epileptic bosses; this while they spam smoke/snow particles, ♥♥♥♥ton of AoE attacks with stuns, a really slow character that is easly cancelled every action and that has to stop, yes stop running to change a weapon. -Crashing on DX 10 option -Terrible checkpoints. -So much more  I am really serious here, this game has so many issues is not fun. I don´t know what were the standars on 2007 but this game has not aged well on 2014; and i am okay with mindless shooting, i am okay with the preassure (i liked Dead Rising 2 for example), but this game makes no sense, only thing i can think is the game not being so terrible (the issues less apparent ) on Normal Difficulty instead of Hard (although i thin there are even more difficulties.)  I payed 3.75 for this game and regret it, beware, you have to love this game a lot to really like it.",
            "review_score": "-1"
        },
        {
            "review_text": "I'm not happy this game keeps crashing.",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ing giant bugs, space pirates, mecha robot suits, huge weapons, and who could forget that japanese monster movie atmosphere. 10/10 ♥♥♥♥ing buy it ye.",
            "review_score": "1"
        },
        {
            "review_text": "The Epic-est of games Needs more online players 11/10 ",
            "review_score": "1"
        },
        {
            "review_text": "Lost Planet is a 3rd person shooter, where you use a variety of futuristic weapons to fight against giant, alien insects and corporate NEVEC troops. You fight both on foot and in mechs known as VS. This game takes place on an ice- covered world known as E.D.N. III, and most of the levels are in either barren, snowy wilderness, or inside some sort of heavily defended, massive structure.  In terms of gameplay, the most unique feature is the use of thermal energy (T-ENG). When your health is depleted, you use your T-ENG to refill your health bar. Your T-ENG depletes rather slowly over time. When your T-ENG is depleted, your health bar depletes over time, and you will freeze to death. It is an ice world, afterall. You refill your T-ENG by killing enemies or by destorying vehicles/ structures that my contain some form of thermal energy. There are also posts that can be activated to restore a large amount of T-ENG.   One of the strongest points of this game is the story. It isn't particularly complex, but the characters are so enjoyable, that they draw you in, and make you care about them and their ice planet.   Pros: -I loved the characters!   -Most of the gameplay is very fun in a simple, traditional sort of way.   -The T-ENG system is a clever way of reminding you that E.D.N. III is a very cold planet, and it adds a sense of immersion.  -For the most part, the game on normal difficulty has a 'just right' feeling when it comes to challenge. At times it was frustrating, but it rarely ever feels impossible.    Cons: -It's easy to get stun locked at times. This is especially true during boss fights when your VS gets destroyed, and you have to run to an unoccupied VS. You just get hit over and over again by giant rockets and energy weapons, and it feels like you have to stumble and ragdoll your way over to that VS in order to survive.  -Many of the control prompts in the game are given to you with XBOX360 buttons, even if you are using a mouse and keyboard. It can be frustrating to learn how to pilot each VS, since you have to figure out which XBOX buttons correspond to your keyboard keys.  Overall: 8/10   ",
            "review_score": "1"
        },
        {
            "review_text": "its a fun game story's ok but the ending is kinda crap finals boss (without spoilers) is preaty cool multiplayers the best part if i had to say something only play this game with a controller im mostly keyboard/mouse but i find its much easier if you use the controller for this game",
            "review_score": "1"
        },
        {
            "review_text": "My thoughts on Capcom's Lost Planet series. I am going to talk about Capcom's title Lost Planet 3. I believe they went backwards and here are the reasons why: Capcom focused on visuals and large areas of beautiful set design in order to garner sales. Players would be led to believe that because of they way to designed Lost Planet 1, they could explore every square meter! They had visions of grappling large caverns, jumping over stalagmites and swinging from stalactites while slaughtering enemies with interesting and unique weapons. Instead they were given invisible walls, designated grapple spots, generic weapons, predictable AI and bad voice acting (their lips did not sinc with their words). Lost Planet 1 had limited map volume but at least every square meter of it could be grappled. The only problems I had is that the player could not jump AND grapple. I found this annoying and could have made gameplay 100% better. In Lost Planet 1, cover was not a key press used only in certain areas like in Lost Planet 3 nor did I have to find that *perfect* spot to place my grapple. In Lost Planet 1, I could grapple any surface - even enemies for additional damage! I think Capcom looked at Mass Effect 3, saw how much attention they were getting (meaning money) and copy/pasted their combat system without regard to innovation. Mistakes that are made that erodes gameplay most game companies practice: 1. They give you no option for variable FOV and the option to use first person view. 2. They put invisible walls on maps, turning huge beautifully rendered areas into a museum with only limited pathways. 3. Give the player generic weapons that have no real bonuses or drawbacks in choosing one over the other. 4. Giving infinite ammo with no drawbacks. 5. Enemies that have the AI equivalent of Aliens/Colonial Marines. This is probably the second most insulting thing you can say about a game companies implement of AI next to Mind Hack (which is the WORST AI implementation in the history of gaming).If you have nothing to risk, you have nothing to feel good about gaining. Remember the Jedis in the prequels hacking apart the main enemies (droids) by the dozens? Yeah. No tension equates to no elation from victory. Make the AI smarter and more creative.",
            "review_score": "1"
        },
        {
            "review_text": "My first ever digital game and what a game it is/was. This game has a excellent storyline and in my opinion the best in the franchise don't give this title a miss play now. Still has excellent graphics for its age.",
            "review_score": "1"
        },
        {
            "review_text": "NIce game",
            "review_score": "1"
        },
        {
            "review_text": "If you like lost planet then youll like this  ",
            "review_score": "1"
        },
        {
            "review_text": "It's fairly good. I guess a bit dated.   The fights are fun. The variety of vehicles you can use and enemies you fight keeps the game moving. The boss fights can be a bit frustrating, but unique to the rest of the game.   The story is a bit hard to follow, not really hard to follow, but unneccessarily complex for what is basically a platformer/beat-em-up. Didn't care for any of the side characters i guess.   The way the story unfolds will draw you in and make you interested in the fate of the desolate world you're on.   I liked it.  ",
            "review_score": "1"
        }
    ]
}