{
    "app_id": 65530,
    "name": "SpellForce 2: Faith in Destiny",
    "release_date": "2012-06-19",
    "developer": [
        "Mind Over Matter Studios"
    ],
    "publisher": [
        "THQ Nordic"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op"
    ],
    "genres": [
        "RPG",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "RPG",
        "RTS"
    ],
    "achievements": 0,
    "positive_ratings": 125,
    "negative_ratings": 85,
    "price": 13.99,
    "description": "In times of war and chaos you will assume the role of a young man, who is supposed to liberate the entire world of Eo from the new, nameless evil. Along with a group of diverse heroes and a dragon as trustful companions, you will fight to gain information about this mysterious new enemy and thereby discover your own true destiny.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/65530/header.jpg?t=1533041886",
    "minimum_requirements": "OS:Win XP, Vista, Win7 Processor:Intel Pentium ® IV 1.5 GHz Memory:2 GB RAM Graphics:3D graphics card with 128 MB RAM (compatible with GeForce 4 Ti or higher) DirectX®:9.0c Hard Drive:5 GB HD space",
    "recommended_requirements": "OS:Win XP, Vista, Win7 Processor:Intel Pentium ® IV 2.5 GHz Memory:4 GB RAM Graphics:3D graphics card with 256 MB RAM (compatible with GeForce 6600 GT or higher) DirectX®:9.0c Hard Drive:5 GB HD space",
    "reviews": [
        {
            "review_text": "As a massive Spellforce fan, I was really looking forward to Faith in Destiny. However though it was fun to play, it left me a little disappointed. At a glance, everything about this game should mean I loved it. It was classic Spellforce. Except, it wasn't.  Firstly, unlike the other incarnations of Spellforce, I could not create a female character, and there doesn't appear to be a reason for this (no male only references in the storyline etc).   Secondly: It was short. So very, very short. I felt like the story had barely got going before it was over. The whole game feels like a demo for Demons of the Past, not a game in it's own right.  And finally: The extra scenarios. After paying for a game that was almost insultingly short, I was offered 3 extra scenarios. For a fee of course. No thanks, I've forked over enough of my cash already.   It breaks my heart, but unless it comes up on sale, I cannot recommend this game, and I think my journey with Spellforce ends here. I certainly won't be paying full price for the next one.    ",
            "review_score": "-1"
        },
        {
            "review_text": "Not very good to play. This is a weak compination of rpg and rts. You even can't do most of the side quests because it wonät let you revisit areas after leaving them even thou you get needed items later in the game.",
            "review_score": "-1"
        },
        {
            "review_text": "to short for a stand alone... nice resolutions",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely not a bad game, it's only problem was the RTS-RPG mixing ratio, cause when I wanted more RPG I got RTS, and vica-versa. Worth a try.",
            "review_score": "1"
        },
        {
            "review_text": "No! Keep away.  The game mechanic itself isnt bad, but spellforce 2 is lame, from voice acting to a stupid 'trust in yourself tale' haha.  Ok, isnt THAT bad, i have seen worse, but the game is so...mediocre, that you get bored to play. Usually bad games with good tales hold you(even if you are suffering playing) just to see how the tale ends, but after 6h and 40% of game completion i simple gave up. Bad.   4.5 of 10 this RTS is really bad except for its concept art-style.",
            "review_score": "-1"
        },
        {
            "review_text": "I bought universe edition game story is good, playing time is long that is definitely good, it is not ending in hours, but I have never able to finish any game. Because after some point when map is changing in every game (fist game platinium, second game gold edition, faith in destiny - demons past not played yet) I got ACCES VİOLATİON ERROR that is annoying. I cant see any work the correct that bug and steam must take the responsibiliy or nordic games becasue when after played hours , for the one bug games not ending that very annoying",
            "review_score": "-1"
        },
        {
            "review_text": "Spellforce 2: Faith in Destiny is a great game, especially with the addition of Free Mode which allows for many extra hours of gameplay. While the campaign is not perfect, this is because a different company took over the game. It is still quite fun and very much worth playing. I enjoyed it greatly! &lt;3",
            "review_score": "1"
        }
    ]
}