{
    "app_id": 65540,
    "name": "Gothic 1",
    "release_date": "2001-03-15",
    "developer": [
        "Piranha Bytes"
    ],
    "publisher": [
        "THQ Nordic"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Open World",
        "Atmospheric"
    ],
    "achievements": 0,
    "positive_ratings": 3396,
    "negative_ratings": 523,
    "price": 0.0,
    "description": "War has been waged across the kingdom of Myrtana. Orcish hordes invaded human territory and the king of the land needed a lot of ore to forge enough weapons, should his army stand against this threat. Whoever breaks the law in these darkest of times is sentenced to serve in the giant penal colony of Khorinis, mining the so much needed...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/65540/header.jpg?t=1533039524",
    "minimum_requirements": "OS: Windows XP/2000/ME/98/Vista Processor: Intel Pentium III 700 MHz Memory: 256 MB Ram or higher Graphics: 3D graphics card with 32 MB Ram DirectX®: 8.1 Hard Drive: 4 GB Sound: DirectX compatible",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "How to launch game in Windows 7  -install Gothic -find Gothic.exe  (C:\\Program Files\\Steam\\SteamApps\\common\\Gothic\\system) -right click --&gt; Properties --&gt; Compatibility -check box 'Run this program in compatibility mode for:' -choose Windows XP -press OK -play as usual  Great game, you should try it!",
            "review_score": "1"
        },
        {
            "review_text": "This is truly, together with its sequel, one of the best RPGs in gaming history, and probably a game that set standards for lots of games that came after. It has a well thought combat system that once get used to, it makes the game even more fun. Most importantly it has a unique storyline with player choices that DO matter. And despite the lack of graphics, even now a decade after it was released, it is worth a buy for a true RPG fan.",
            "review_score": "1"
        },
        {
            "review_text": "Trouble launching a new game? Use this!         Gothic ½ — SystemPack&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Best game I played in 2014.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing.The atmosphere,locations,story everything.Well voice acting can be bad sometimes.Game got 40+ hours i played till end it was amazing.The ending was bit too easy but still its enjoyable.There is some bugs and all but its ok for 10 year old game.Its the first gothic i played and its my favorite.Gothic have lots of enemies.But the map seems like deserted.Which is a good thing for new players.If you are a fan of gothic you ll know what i mean.Most of the gothics are hard when you start.Most of the enemies will be stronger then you.In this game you can run away from then easily.Just spam the jump button.When you are at level 10 fun begins.Most common enemies wont be stronger then you anymore.But when you are at level 20 it gets harder to level up.Since those enemies are easier and you only got maximum 2000 xp from strongest enemy.You ll grind your way to higher levels.Game doesn't have tutorial so its gonna be hard for new players.But you ll get used to it.Trading is bit complicated.Well when you add the thing you wanna sell.Lets say a sword and accept it you wont get anything.Instead you ll give away your weapon for free.You have to pick the money from the inventory of the guy you are trading then you have to confirm it.Also there are no limit for what you can put in your inventory. 10/10 Gotem",
            "review_score": "1"
        },
        {
            "review_text": "Although pretty old and very buggy, it's one of the best RPG I've ever played on Steam.",
            "review_score": "1"
        },
        {
            "review_text": "Get it. I love this game because it has a good storyline, and unique environment with all those characters cities and monsters. Walking from one town to another; making primary and secondary quests; freedom to choose your character evolution and development; quite a big world - all this make me love the game.  Although the graphics is not as great but this game definitely deserves your time and attention.",
            "review_score": "1"
        },
        {
            "review_text": " The review for Gothic 1",
            "review_score": "1"
        },
        {
            "review_text": "An important note about this game is that it isn't meant to run on Windows 7, 8, or even Vista. It was made back in 2001, and you'd better be prepared to jump through some hoops to get this thing working. I ran this game under 8-bit color mode with Windows XP Service Pack 3 as the Administrator, and even then I couldn't get the opening cutscene to play (the other cutscenes worked fine, though). I can't guarantee that you'll need to do as much as I did, nor can I guarantee that you'll need to do only what I did. Keep that in mind when looking at this game.  Story:  People don't play this genre for the story too often, but it's still there, and still worth mentioning. You play as the Nameless Hero (yes, that's his title), sent to The Colony, a magical island prison, to deliver a letter to the Magicians of Fire. You'll end up joining one of the prison's three camps, the Old Camp, the New Camp, or the Sect Camp, in the process. To say much else would be to delve into spoiler territory, so I'll just say that the story is a lot better than would be expected, but it's still no Dragon Age.  Graphics:  Graphics have come a long way since 2001, and Gothic is nothing if not proof of that. The game looks, to put it frankly, terrible. Models are blocky, the textures are blurry, characters look like they were barfed out of a Dreamcast, forests in the distance are replaced with a really crappy-looking forest picture...thing, and so on. I didn't have much of a problem with it, to be honest, but others most certainly might.  Voices: Terrible, but laughably so. That's really all that can be said about this one.  Combat: Normally, when you start off in an RPG you can swing a sword with ease, but the problem is that said sword is made of dirt and you do no damage. So, you buy an iron sword, put some points into strength, and start movin' on up in the world. In Gothic, however, The Nameless Hero starts off swinging his weapon so clumsily he might as well be on resident drug Swampweed. You overcome this by paying trainers to teach you how to more proficiently use items, but doing so means you're not putting points into Strength. This creates an interesting tossup; is it worth doing more damage if your character can't swing the sword at all? Is it good to flashily swing and spin your weapon if you do so little damage?  Combat is simple, but effective. Block when the enemy attacks, attack when possible. However, the majority of enemies will kick your ♥♥♥ so hard it'll fly off to the Orc Lands until you level up a ton. It can be annoying, sure, but when you finally take that beast down you'll feel fantastic.  Technicality: Oh god. This game has some horrific bugs. It occasionally crashed on me. Oh well, I saved a ton for reasons mentioned above. I can't climb certain ladders due to the geometry of the map. Oh well, there are ways around those ladders. The game repeatedly crashes in a certain late-game area unless you hack the game, turn off the sound, keep playing for about thirty seconds, hack the game again, and turn the sound back on.  ...  Conclusion:  Did I sound like I hated this game? I don't. I actually quite like it. The thrill of powering up and taking on tougher foes can't be easily matched. The story is surprisingly pretty decent and I cared to see the end of it. The bugs were awful, the graphics were painful, and the compatibility was hard to get around, but despite all that, I can't help but wholeheartedly give this game a great thumbs up. You won't get it 'till you try it, but once you take it for a spin, you can't put it down until you see the end.",
            "review_score": "1"
        },
        {
            "review_text": "Legendary old school RPG. The one game that turned me to playing RPGs.  good: story, difficulty, believable world with immersive atmosphere, characters, MUSIC bad: just graphics (from the modern standpoint)  10/10",
            "review_score": "1"
        },
        {
            "review_text": "The Gothic series is a gritty grim dark roleplaying masterpiece from Germany. It is the RPG ultra version of Dark Souls before there was any Dark Souls. It is clunky and didn't age well, but it has infinite amounts of soul and thought. It has been so many years since I first played this and I still remember all characters, as they are memorable. Quests are oldschool, complex and not always evident.  A true masterpiece, which is only outshined by Gothic 2 together with it's expansion.",
            "review_score": "1"
        },
        {
            "review_text": "No reason not to buy it 4 times. It's on sale, go for a 5th copy.",
            "review_score": "1"
        },
        {
            "review_text": "Good RPG with little hand holding.",
            "review_score": "1"
        },
        {
            "review_text": "This game is what Ultima 9 should've been. I guess that doesn't hold much weight anymore though. You can manipulate almost every item in the world, you can smoke from a hooka, sit in chairs, sleep in beds, etc. People get mad at you for entering their house and pick fights with you if you steal from them. It's more fun than modern WRPGs because of how complex the NPC AI is. NPCs aren't just lifeless husks waiting patiently for you to solve their problems.  On top of that it has a great story.",
            "review_score": "1"
        },
        {
            "review_text": "It's 'Escape from New York' in an alternate medieval fantasy reality.",
            "review_score": "1"
        },
        {
            "review_text": "I played this game many times before owning it on Steam.  A very atmospheric and underrated ARPG. Take your time to learn the controls and you won't look back. Gothic 1 was, for its time, a very unexpected surprised both on technological (huge open world ready to be explored from the start, almost no loading screens) and design (day-night cycle, NPCs with their own schedules) levels.  At the beginning you get thrown off into a prison colony where the inmates took control, and the world really feels harsh, unwelcoming and dangerous.",
            "review_score": "1"
        },
        {
            "review_text": "Simply an amazing game! Played a lot a long time ago offline. Now decided to buy it since i had the spare cash. It's just a wonderfull game, nothing more or less. You must grind your way up from scratch. Work your way through every possible quest. When you start you are literally nothing, a worthless piece of ... I have no words for the Gothic series. (1, 2 and 3)",
            "review_score": "1"
        },
        {
            "review_text": "a great RPG that has a great story and dialog and the world is massive with tons of things to do and this game has a real challenge cause your going to die a lot in this game and this is a hardcore RPG like you have to go to a master to learn things like picking locks makeing weapons and guting animals cause you dont know how to do any of that stuff when you start and your going to need to buy tools to gut them and this game has lots of replay value cause your going to have to join one of 3 factions each with there own advantages and when you join a faction it could effect the story and lots of things you do in this game is gonig to effect the story so you have lots of replay value here and now they are some bad things about this game like the controls are kinda strange and the combat takes some getting used to and the graphics suck to todays standard but this is a great RPG if your a fan of this style of RPG and if you played Risen then you should check out gothic",
            "review_score": "1"
        },
        {
            "review_text": "An Open World RPG game done right.   Very cohesive world and story design, an unforgiving play design and no handholding in form of mini maps, waypoint markers and auto-saves. The Gothic 1 stands to remind us how games didn't take a player for a fool and allowed for experimentation and exploration. Dying was a part of learning process and NPC's were genuinely interesting and believable. Great story and atmospheric music.  With some modding it runs well on Windows 7/10 on Dx11 ",
            "review_score": "1"
        },
        {
            "review_text": "Just classic of RPG's that everyone should try to play. Interesting and sometimes fun storyline, almost full freedom, charismatic characters and much more.",
            "review_score": "1"
        },
        {
            "review_text": "Havent played this game yet but to fix the access violation: Turn steam overlay off Check compatability to xp 3 then check box for run as administrator. EZ",
            "review_score": "1"
        },
        {
            "review_text": "I'm recommending this game because it's a classic and had a lot of fun with it in the '00. Problems i have with this version is that it's poorly optimized",
            "review_score": "1"
        },
        {
            "review_text": "If you are no incompetent moron, you should be able to make this game running within 30 mins. Even I could do that in less time. So stop ♥♥♥♥ing crying that it doesn't run when you downloaded it. Or at least, stop giving the BEST RPG ever made a negative rating only because you are to stupid and/or to lazy to watch a god damn youtube tutorial about how to fix it! I am very grateful that I got it here. If you are not willing to spend some time to be enabled to play this game, you're not worth playing it. i mean, it took me more time to figure out how to eat food or equip a weapon in this game than making it run, so unpatient fools like you would never find a way into this game anyway.  All I wanted to say is: If you can't do such an easy thing like using google to figure out how to make the game run, not the game sucks, but YOU suck. Thank you. ",
            "review_score": "1"
        },
        {
            "review_text": "Quite an old game with some really wonky controls, some horrible core issues such as the Access Violation error that you receive upon playing the game, after you can get beyond the horrible controls and extremely unbalanced game-play against monsters that will easily be able to farm you for hours. You will find one of the greatest RPG games ever created an amazing story some amazing character details, This game requires you to actually use your brain to find stuff within the game. If you want to play this game i recommend you buy a notepad and a pencil to write down all the interesting information you find considering this game doesn't give you the slightest hint of where to go in any way. This game is totally awesome but can be pretty complicated at times, This is the game that will make you want to shank your eyes out after a lengthy encounter with a mole rat, If you want to use your mind and totally escape from the hell that is horrible game industry. The story is amazing and is much better than the average casual RPGs such as Dark Souls and Dark Souls 2. BE HARDCORE BE A MAN PLAY GOTHIC.  10/10 would totally spend another 30 hours attempting to kill the same Mole Rat. Totally worth whatever you'd pay for it",
            "review_score": "1"
        },
        {
            "review_text": "A really old game yet amazing story and extremly fun to play",
            "review_score": "1"
        },
        {
            "review_text": "Great game. I loved taking out the Sleeper and roaming the area under the barrier. I have played all Gothics I, II, III and love coming back to those games. If you have not played this game, get it. Visuals are not up to todays standards, but gameplay is nice and difficult as it should be.",
            "review_score": "1"
        },
        {
            "review_text": "When I was young I playing this game all the time :D Just 'best' RPG ever + pls give me Redux edition on Gothic :)",
            "review_score": "1"
        },
        {
            "review_text": "Gothic I is simply one of the best RPG's out there. It has a great story and an amazing open world. You're not limited in the way you interact with the game. If you knock out NPC's they would stand up again and grab a weapon from the ground if there is one. That's great!  The graphics are old and the controls may seem awkward in the first view hours. The only real criticism would be the absence of side quests from chapter 2 on.",
            "review_score": "1"
        },
        {
            "review_text": "  the best game on this world &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "The controls are odd, but not as bad as everyone seems to think. You can unplug your mouse and save some USB bandwidth which can be considered a positive feature.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best RPG games ever. Must play. I always come back to this game.",
            "review_score": "1"
        },
        {
            "review_text": "Love all games from Gothic series (besides Arcania)",
            "review_score": "1"
        },
        {
            "review_text": "Better and cheaper than: Morrowind, Oblivion, Oblivion with Guns, Skyrim, Skyrim with Guns and more importantly, the upcoming TES game. I guarantee it.  Get this and Gothic 2 if you want to play some good games and have fun.  Get Daggerfall if you want to play a non-returded TES game.  Pass on Gothic series if you're a returd who can't play anything but popamole crap.",
            "review_score": "1"
        },
        {
            "review_text": "An amazing RPG with an equally unique atmosphere. A great story, memorable characters, graphics which have aged well and, once you've forced your way through the awkward, archaic controls, a great fighting system (at least compared to other RPG's released in 2001).  The second game has better graphics, a much more player-friendly control scheme and a larger world but nothing beats the atmosphere of this game. Buy it, and experience one of the finest action role-playing games ever produced.",
            "review_score": "1"
        },
        {
            "review_text": "Great for Low Spec Computers!  I have a Compaq Presario CQ56 with Intel Chipset Family video card (look it up for all the specs) and although I've been playing for 3 minutes the game is very very smooth  I had Memory Access Violation which I solved by going to C:\\Program Files (x86)\\Steam\\SteamApps\\common\\Gothic\\system Right-Clicking GOTHIC.exe, compatibility and activating Windows XP (service pack 3) and deactivating the Steam overlay through the game library.  I've had 2 conversations so far (as I said, just started playing) but the conversations are very smooth and it's really immersive so far.  Buy it! With % off or not buy it!",
            "review_score": "1"
        },
        {
            "review_text": "If you are a diehard fan of real old times open world RPG`s, then this is the game for you. Captivating story, interesting quests, great gameplay. Too bad it`s too old and outdated for me but still, you can`t miss it if you wanna play the sequels, Gothic 2 Gold Edition, 3 and 3 Forsaken Gods. Don`t forget, the series continued under the name Risen.  8/10",
            "review_score": "1"
        },
        {
            "review_text": "One of the best RPGs I've ever played.  Its hard to convince people to jump back on old games like this but this game definitely stands up, even though its old, has dated graphics and clunky controls.  It set some benchmarks, it really did. For people who are younger than 20, you dont understand what its like to first experience a true day/night cycle, and to experience actualy A-Life. A game that lives and breaths with or without you. NPCs who go around and do their daily things and live their lives and remember you and your actions. This was one of the first games to ever feature this.  You probably played Skyrim right? Well the settlements in Gothic are just like that, the people live their lives, they do their daily things, they go to bed at night, they might pick fights with out, and they remember your actions. This was BIG back in 01 because no one else was doing it. NPCs around that time just stood there waiting to be talked to, or they may wander around in a room, thats about it, you would never see a NPC from one camp randomly decide to walk to another or patrol around the landscape or hunt.  Another thing that made this game so great was how gritty and mature it was. This isnt a childs game. This is a game in a world full of Convicts. Everyone hates you, and you have to survive tooth and nail. You start out as a true weakling with no training, and really have to work your way up. You cant even take on the weakest of NPCs at the beginning of the game, you may have to resort to stealing and attacking them at night just go scrape your living. You have no idea how to fight, you can barely hold up a sword, and one swing and you're on your ♥♥♥, and guess what... they dont kill you, they loot all your money (ore) and take your weapon, and tell you to ♥♥♥♥ off. Yeah YOU yourself get LOOTED if you lose fights.  And maybe you'll come back a few hours later when you're stronger, and take your revenge for that crude sword you worked so hard to get. It might not be very useful now, but its the principal of the thing, it was the best piece of equipment you could have ever owned at the time, and that ♥♥♥♥ stole it from you.  Seriously, ground breaking game.",
            "review_score": "1"
        },
        {
            "review_text": "Very nice game. Nice idea to create a colony. Nostalgy.",
            "review_score": "1"
        },
        {
            "review_text": "The controls are painful to learn compared to modern games. The mouse controls are minimal and awkward. After getting used to the controls it plays pretty well. The plot is pretty good and the mechanics are as well. It is often difficult to ascertain exactly where you are supposed to go or what you are supposed to do. Shamelessly referring to walkthroughs didn't seem to worsen the game.",
            "review_score": "1"
        },
        {
            "review_text": "16 years since this game launched and still getting tempted to replay it for 457th time.",
            "review_score": "1"
        },
        {
            "review_text": "If it weren't so damn buggy it would be my favorite game ever ",
            "review_score": "1"
        },
        {
            "review_text": "Epiccccc!! My very own Zelda!",
            "review_score": "1"
        },
        {
            "review_text": "Quintessential European classic. Amazing game for its time, somehow not that well known outside of Europe.  PROS: - Great combination of open-world freedom, with consistent quests - Very climatic dystopian vibe - Game is fully voice acted (!) - Memorable characters - Role-Play heavy: Immersive character progression, spells with outside-the-box effects, best armors are tied to factions  CONS: - Ancient key-mapping -- might take a while to get used to (it was designed to be played without a mouse, in a way very similar to playing with a pad) - Problems running on the newest Widnows versions (not too hard to fix, many solutions on youtube/google)  IN-BETWEEN - Bearable graphics (didn't age all that badly, especially when you run it in modern resolutions) - Combat system is original and it might seem unintuitive at first (designed for keyboard/pad)  I also very much recommend Gothic II, which is a true sequel.",
            "review_score": "1"
        },
        {
            "review_text": "the best role playing game ever made",
            "review_score": "1"
        },
        {
            "review_text": "Best RPG ever that i played. Awesome story, huge quest posibilitys. big map. making you use your brains before doing something. must have in your colection.",
            "review_score": "1"
        },
        {
            "review_text": "Classic, very entertaining old school with old keyboard gameplay.  Different combat and interesting history.  Get it on a promotion, careful with windows patches that can break the camera.",
            "review_score": "1"
        },
        {
            "review_text": "The grand rpg",
            "review_score": "1"
        },
        {
            "review_text": "After so many years this game is still fun to play. ",
            "review_score": "1"
        },
        {
            "review_text": "One of the best RPGs of all time. Very difficult to get into it now at first because the controls are much older and different then currently, so you kind of have to relearn. Once you get going though, the story is amazing. Definitly worth your time to go through it.",
            "review_score": "1"
        },
        {
            "review_text": "The entire Gothic 1-3 series is the best RPG I've played, better than Elder Scrolls, the Ultima's, etc. Maybe on par with Baldur's Gate, though the different in gameplay style makes it hard to compare.  Interesting story, no collection type quests, difficult combat until you get the rythm of it, anti-Monty Haul (at 8th level I found a rusty 2h and was excited), decisions have consequences, if you kill a merchant, everything he was offering to sell you is on his corpse rather than magically vaporized, but you have to deal with the consequences of that action....  I started with 3, it was a 2006 release but feels modern. 1 is 2001 and it shows--it doesn't feel modern, the interface is a pain the rear, the combat is impossible until you give up on using the mouse and fight with your right hand on the arrow keys and left on CTRL.... But it's worth trouble.",
            "review_score": "1"
        },
        {
            "review_text": "The archetype of an addictive RPG game.",
            "review_score": "1"
        },
        {
            "review_text": "The game is still amazing, after all those years. Thanks to the community, it can be run on modern configurations. It feels great to relive old memories from back when my PC could run it in 10 fps at best, only this time on a large screen and with super smooth framerate. Recommended purchase for all RPG fans who love a great story and interesting universe.",
            "review_score": "1"
        },
        {
            "review_text": "Controls as intuitive as I remember. If you managed to master this very first step in game. Then rest is more or less piece of cake... Mouse1+w/ 10. Would pick berries again.",
            "review_score": "1"
        },
        {
            "review_text": "Needed some fixing to work on Windows 10 but after fixing it's a good game.",
            "review_score": "1"
        },
        {
            "review_text": "don't buy this game on steam.... I have yet to get it working and have spent several hours trying",
            "review_score": "-1"
        },
        {
            "review_text": "No matter how many different ways I try, I cannot get this to work.",
            "review_score": "-1"
        },
        {
            "review_text": "The game would crash when i try to start a new game. The game needs a lot of patches to get it playable and you have to find else where. Its more trouble than its worth.",
            "review_score": "-1"
        },
        {
            "review_text": "gothic 1 and 2 keeps booting me out of the game and l have a feeling its to do with those patches back then when these old games came out",
            "review_score": "-1"
        },
        {
            "review_text": "it does not works with windows 10",
            "review_score": "-1"
        },
        {
            "review_text": "so i bought the game, and when i come to start it, it doesnt come on, but says its running in my steam library... as well as with Gothic 2...   needless to say im not recommending this game, if you want to play a game similar then look to the ElderScrolls games, namingly Morrowind, Oblivion, and Skyrim.",
            "review_score": "-1"
        },
        {
            "review_text": "ATTENTION: Do not buy this game unless you are willing to spend a lot of time and effort getting it to work!   I bought this game as part of a pack, and tried various times and spent hours to get the game to launch, unsuccessfully. There is a lot of patchwork and addon work to be done, and even if you follow directions that work for some people, there is no guarantee you will ever even see the title screen.  Worse still, if you buy this game and are unable to get it to lauch you will not get a refund! Due to the amount of time it takes for some of us to work on the game in an effort to bring it into operation, you will rack up 'play time' which is actually the game idling in the background/processes menu while you work on it. Steam will count all the time you've spent trying to FIX the game as PLAYING the game, and will not give you a refund.  Unless you are good at following directions and have more than a basic knowledge of running old games on a new computer, save your money for a game you will actually be able to play and enjoy.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is broken, and you probably can't play it.  Yes I know there's a community patch and it can makes the game run perfectly, but they don't even warn buyer on store page (like Fallout 3, for example) and that's unacceptable. If you don't want to tell buyer that your game is broken, then fix it.",
            "review_score": "-1"
        },
        {
            "review_text": "Can't start, just playable if u download 2 patches and even then just without steam",
            "review_score": "-1"
        },
        {
            "review_text": "These older games require so much outside attention that they waste way too much time trying to get them, in some cases, even to start...",
            "review_score": "-1"
        },
        {
            "review_text": "'Windows 7/8 users' do not buy this!!! Waste of money... The game doesn't load beyond the main menu. Tried to run in compatibility mode or deactivate steam's interface ingame doesn't works either, the game keeps crashing to desktop. If anyone knows a way to make this playable in Windows 7 please PM me, I will apreciate it. Thanks... NOTE: Same problem with Gothic 2 :( ------------------------------------------------------------------------------------------------------------------------------------------ 'Usuarios de Windows 7/8' no compren esto!!! Es una pérdida de dinero ... El juego no se carga más allá del menú principal. Trato de ejecutar en modo de compatibilidad o desactivar la interfaz de Steam tampoco logra funcionar, el juego se bloquea constantemente al escritorio. Si alguien sabe una manera de hacer esto jugable en Windows 7 por favor enviarme un PM, lo voy a apreciar. Gracias ... NOTA: El mismo problema con Gothic 2 :(",
            "review_score": "-1"
        },
        {
            "review_text": "Great game, just don't buy it on steam if you're using win7 or any newer OS. It won't start.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't buy it. Don't play it. Too many bugs in this game. After avoiding a lot of them, when I was almost finishing it, I got a crucial one.",
            "review_score": "-1"
        },
        {
            "review_text": "I can't speak for the game's actual quality due to how little time I was able to put into the game, but I can say I won't recommend this version of Gothic.  Its a pain in the ♥♥♥ to get running. Straight installation and trying to play, the game probably won't work for anyone. While not everyone will have to fight a tiger and climb a mountain to get the game running, I did. I spent more time fiddling with this game trying to get it to run, and crashing, than playing it, and when I got it running it was running at a consistent 10-20 fps.  If you know you actually want to buy this game and play it, go for the GoG version. GoG actually puts time into their releases of older games. I heard their version of Gothic 1 actually runs without having to do any outside BS.  Either version you play, you're probably going to have some issues that come with playing an old game on a modern OS, but the Steam version kicks harder than the GoG version.",
            "review_score": "-1"
        },
        {
            "review_text": "Wow, thanks for making me waste my ♥♥♥♥ing money on this game that won't even let me start a game, everytime I try to start up any of the Gothic games it just says VIOLATION and kicks the game and everything. Thanks, Steam",
            "review_score": "-1"
        },
        {
            "review_text": "does not work correctly. very much a hassle.",
            "review_score": "-1"
        },
        {
            "review_text": "Too old to play.",
            "review_score": "-1"
        },
        {
            "review_text": "I cranked up Manson and queued up Bauhas, and all for nothing. There is nothing fecking black or gothic about this entire fecking game. It's all swords and dungeons and dragons and nerd garbage.  All fellow REAL goths should stay away from this travesty.",
            "review_score": "-1"
        }
    ]
}