{
    "app_id": 65560,
    "name": "Painkiller Redemption",
    "release_date": "2011-02-25",
    "developer": [
        "Eggtooth Team"
    ],
    "publisher": [
        "THQ Nordic"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "FPS",
        "Shooter"
    ],
    "achievements": 0,
    "positive_ratings": 206,
    "negative_ratings": 196,
    "price": 4.49,
    "description": "Welcome to a world of pain. Heaven is once again in danger and threatened by a reckless army of hell spawn monsters - and they will stop at nothing.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/65560/header.jpg?t=1533041333",
    "minimum_requirements": "OS: Windows XP / Vista / 7 Processor: 2.4GHZ+ (per core) Memory: 2GB or better Graphics: Radeon 3800 / Geforce 7800 or better DirectX®: 9.0c (included) Hard Drive: 6GB Sound: Required",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Compared to Resurrection it is a masterpiece! Took me 4 hours on normal difficulty level to complete it. On a sale for 1,25 € it is a good choice.",
            "review_score": "1"
        },
        {
            "review_text": "By the time I've made this review, I've only played 16 minutes. And I can safely say this is the best five bucks I ever spent.",
            "review_score": "1"
        },
        {
            "review_text": "Changelog:  Fixed 3rd level name. Now It's 'Refinery' instead of wrong 'Rafinery'.",
            "review_score": "1"
        },
        {
            "review_text": "Changelog:  Fixed 3rd level name. Now It's 'Refinery' instead of wrong 'Rafinery'.",
            "review_score": "1"
        },
        {
            "review_text": "bought this game on a sale which comes included with the complete pain collection. i'd say there isn't much to it besides killing demons and soldiers. it's a great twitch shooter overall. if you're going to get this game, come in expecting to just kill things. don't come in expecting much of a storyline. i will update my review after playing more.",
            "review_score": "1"
        },
        {
            "review_text": "Apparently it is a bunch of fan made levels. For some reason sold as a full game. In summary, just a waste of time even to install this 'miracle'. It is totally repetitive, extremely short and deprived of any imitation of imaginativeness and ideas. It makes no sense to bother with  Redemption , neither the fun will be innovative, nor it will allow you to feel any entertainment. It is better to once again reach for any of the previous Painkiller games.",
            "review_score": "-1"
        },
        {
            "review_text": "It's like someone tried to cram the endles hordes of enemies from a Serious Sam game into the multiplayer maps from Painkiller, then sell it as a new game without any playtesting. I don't know what the hell they were thinking, but it's nothing remotely like the original...and nothing remotely like a good game.",
            "review_score": "-1"
        },
        {
            "review_text": "Spawn, kill demons.  Spawn aganin and kill more Spawn one more time and kill everything. I regret this decision",
            "review_score": "-1"
        },
        {
            "review_text": "It is just the worst.",
            "review_score": "-1"
        },
        {
            "review_text": "wast of space not worth it",
            "review_score": "-1"
        },
        {
            "review_text": "sucks, repetitive 'shooter' best throw a box to save ammo simulator",
            "review_score": "-1"
        },
        {
            "review_text": "I don't know what the Painkiller devs are thinking.... It's another dev team that done this game. This game is a joke. Even I alone could do it better then this. All in all very small levels with very long repeated spawning until you want to puke. This game should be called: Spawn me to dead!",
            "review_score": "-1"
        },
        {
            "review_text": "I tried to play this game, oh god I tried but I can only get about 5 min into the first level before windows says:   'Redemption.exe Has Stopped working.'   This happened on both my old XP rig and my Win7 Pro (X64) rig. Crash Simulator is what it sould be renamed to as it crashes again, and again, and again.   I have never passed the first level  (Or even half of the first level)  because of the  ****ing crashes!!! ",
            "review_score": "-1"
        }
    ]
}