{
    "app_id": 65730,
    "name": "Take On Helicopters",
    "release_date": "2011-10-27",
    "developer": [
        "Bohemia Interactive"
    ],
    "publisher": [
        "Bohemia Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Captions available",
        "Partial Controller Support",
        "Includes level editor"
    ],
    "genres": [
        "Simulation"
    ],
    "tags": [
        "Simulation",
        "Flight",
        "Open World"
    ],
    "achievements": 0,
    "positive_ratings": 340,
    "negative_ratings": 260,
    "price": 11.99,
    "description": "The brand new helicopter game from independent developers Bohemia Interactive – creators of the award-winning military-Sim series Arma 2. Built upon over 10 years of experience in cutting-edge simulator development, Take On Helicopters immerses players within beautifully rich landscapes and an authentic flight model.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/65730/header.jpg?t=1521643035",
    "minimum_requirements": "OS:Windows XP Processor:Intel Dual-Core 2.4 GHz or AMD Dual-Core Athlon 2.5 GHz or faster Memory:2 GB RAM Graphics:NVIDIA GeForce 8800GT or ATI Radeon 4850 with Shader Model 3 and 512 MB VRAM or faster DirectX®:dx90c Hard Drive:20 GB HD space Sound:DirectX 9.0c compatible audio-card",
    "recommended_requirements": "OS:Windows Vista, Windows 7 Processor:Intel Dual-Core 3GHz or AMD Dual-Core Athlon 3GHz or faster Memory:4 GB RAM Graphics:NVIDIA GeForce 9800GT or ATI Radeon 5850 with Shader Model 3 and 1024 MB VRAM or faster DirectX®:dx90c Hard Drive:20 GB HD space Sound:DirectX 9.0c compatible audio-card Other Requirements:Broadband Internet connection",
    "reviews": [
        {
            "review_text": "I don't understand why there are so many negative comments on the game, I've played Microsoft Flight Simulator X and Longbow II as well as Take on Helicopters, and all have their strengths and weaknesses, but this game felt like I was actually learning to fly a helicopter as some of the fast paced missions stumped me for a bit, but with persistence and saving at key points, it has been a very good experience.  Should I play this?: If you enjoyment of being immersed in a good story, and upgrading the various helicopters to take on more missions, this will not disappoint. The military sims are enjoyable, and definitely challenging, but seem to hurry past the learning to fly and focus more on combat. There is a good mix of civilian, transport, and law enforcement/military missions which allow you to earn money and buy all the upgrades, there can be an issue if you sell a helicopter you need, so picking up extra missions is helpful. I would do often walk around inspections of each heli before taking on a mission to significantly lower the repair bill.  Realism: Without a doubt, this is the most realistic feeling physics in a flight simulator I've played to date. With flight Simulator X I almost feel the helis were an afterthought addition because it lacks certain flight physics that require the constant adjustments required to keep the helicopters in flight. In Take On Helicopters, the wind and added weight of personnel and cargo changes how the helicopters fly, the copters accrue damage and can feel like a rickety bucket of bolts, giving an impending doom feeling before they ultimately reach maximum entropy and fall out of the sky. I had more than a few instances where I killed the Huey because I failed to properly finesse them through the trial without burying the throttle and burning out the engine.  Bugs: Every simulator has it's glitches, I've seen more glitches in Flight Sim X than I have in TOH. Only one instance have I seen a glitch and pressed escape, then selected skip in the menu.",
            "review_score": "1"
        },
        {
            "review_text": "I wouldn't recommend this game to anyone. Only to people who love to fly a helicopter with a bit more realism. And it's doing a decent job.",
            "review_score": "1"
        },
        {
            "review_text": "very nice game for people who like piloting a lot and want to be pilot :]",
            "review_score": "1"
        },
        {
            "review_text": "Bit of a cautious thumbs up, I got this game really cheap in a bundle quite some time ago. Played for a few mins, had awful performance issues and the controls were abysmal on a 360 pad...  Fast forward a little while and I bought a HOTAS stick and throttle along with a better graphics card. The difference was astounding. There was still another little issue though - using the hat switch for headlook is horrible. Fast forward a little more time and I got my hands on an EDtracker head tracking device. This was the final piece of the puzzle! With reliable head tracking and a half decent stick setup the game really begins to shine and also opened my eyes to a much more immersive experience in Arma 2/ Day Z mod.  Anybody familiar with BI games knows what to expect, a diamond with little bits of ♥♥♥♥ on it :D TOH is no exception, god awful voice acting and the usual performance issues on lower end hardware but with a little forum scouring you can maximize the experience you will have with a bit of tinkering.  *For anyone using high DPI settings in windows you will have end up with the missing mouse pointer bug. THIS is what completely did my head in with the game for a looong time, persevering with the methods needed to do any menu clicking (like starting a damn game session) especially graphics setup was a royal pain in the ♥♥♥♥ing ♥♥♥♥. I found the solution to this from a completely different game but the solution works here also. Turn your DPI from 150 to 149 and your mouse will magically reappear :)",
            "review_score": "1"
        },
        {
            "review_text": "Best helicopter simulator ever",
            "review_score": "1"
        },
        {
            "review_text": "It's Arma 2 Without the guns and with more Helicopters, It's a fun enough game if you can get used to the controls but since my computer wants to catch on fire while playing I can't fully enjoy it (Arma 3 runs fine but 2 has issues, I have no clue how that works).",
            "review_score": "1"
        },
        {
            "review_text": "I got on to play expecting helicopters. Ended up with a tractor on the first go. 10/10 would play again.",
            "review_score": "1"
        },
        {
            "review_text": "First of all the game is still broken after 5 years. My cursor doesn't work in the game and it was a common problem when the game launched. I tried to recommended solutions, but they didn't work.  After blindly managing to choose in the menu options, I was greeted with some incredibly boring gameplay.  Nope.",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty poor game. Slow and boring.",
            "review_score": "-1"
        },
        {
            "review_text": "FLY A ♥♥♥♥ING ♥♥♥♥ AROUND ♥♥♥♥ING SEATTLE ITS LIKE ARMA 2 WITH BETTER ♥♥♥♥ING GRAPHICS AND MORE REALISTIC HLEICOPTER FLYING THE ♥♥♥♥ING DAMN ♥♥♥♥♥♥ ♥♥♥ CRAPPY ♥♥♥♥ CARS ROLL AROUND IN SEATTLE IN THE MIDDLE OF A ♥♥♥♥ING WAR LIKE IT IS ♥♥♥♥ING IRAQ WAR WHAT THE ♥♥♥♥ IS UP WITH THAT ♥♥♥♥ ANYWAY THIS IS OK BUT IT NEEDS MORE KEBAB FROM SIBERIA OK THIS IS THE END OF THE ♥♥♥♥ING REVIEW ARE YOU ♥♥♥♥ING HAPPY YOUR DONE READING THIS ♥♥♥♥ING ♥♥♥♥? OK THIS IS THE REAL END WAIT I FORGOT SOMETHING. THIS GAME NEEDS MORE HELICOPTERS IT IS THE ♥♥♥♥ING SAME ♥♥♥♥ING ♥♥♥♥♥♥ ♥♥♥ ♥♥♥♥♥♥♥♥♥♥♥♥ HELICOPTERS WITH ♥♥♥♥♥♥ ♥♥♥ ♥♥♥♥ING ♥♥♥♥ SKINS AND ♥♥♥♥♥♥ ♥♥♥ SONGS ON THE ♥♥♥♥ING ♥♥♥♥♥♥ ♥♥♥ RADIO FROM RADIO SHACK ♥♥♥♥♥♥ ♥♥♥ SHOP SUCK MY ♥♥♥♥ ANYWAY THIS IS THE REALLY REAL END.",
            "review_score": "1"
        },
        {
            "review_text": "FIX YOUR DAMN GAME - LAZY CARELESS NOOBS  IF you have desktop scaling set to on - and most high resolution setups demand it - the mouse pointer stops following the mouse movement. Impossible to play and OH SO difficult to fix?? NOT!!  NOT GOOD ENOUGH",
            "review_score": "1"
        },
        {
            "review_text": "I looked for my house. It wasn't my house. 10/10 Random Model.",
            "review_score": "1"
        },
        {
            "review_text": "Ever wanted to fly a helicopter? Well, this is the game for you!",
            "review_score": "1"
        },
        {
            "review_text": "why is it download 15 gigs ? hmm",
            "review_score": "1"
        },
        {
            "review_text": "Whenever I want to reminisce about the old times with my AMD cpu, I play this game on max volume with my house heater set to 90°F.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ performance poorly Optimized",
            "review_score": "-1"
        },
        {
            "review_text": "This is great for a Helicopter sim, but the price is a bit crazy especially considering this is not a lot more then an Arma 2 mod. The menus, the map, the options and most everything else is not 'new' it's all reused sources from ARMA. Very little attempt to even hide it. That's quite sad IMO to create something and call it BRAND NEW with so many reused assets.",
            "review_score": "-1"
        },
        {
            "review_text": "Bunch of ♥♥♥♥, very unstable, and doesn't work properly through steam yet.That would be the worst BI project. If you really thinjk you want it, and ready to support BI with their BS then purchase through bohemia store on the web.",
            "review_score": "-1"
        },
        {
            "review_text": "This game has been my main source of entertainment for the 5 yers. This will definitely win Game Of The Year for sure!",
            "review_score": "1"
        },
        {
            "review_text": "Can you even call this another game? It's basically an Arma 2 mod labeled as another game. (if you don't believe me remove all the files in the 'Addon' folders)  Controls are overly complicated and poorly coordinated. File size is ridiculously huge due to the fact that it's Arma 2 with a ton of files needed to make this horrible helicopter game.  I don't recommend this game to anyone. 0/10.",
            "review_score": "-1"
        },
        {
            "review_text": "really ? ",
            "review_score": "-1"
        },
        {
            "review_text": "Its fun to mess around with other than its a meh from me",
            "review_score": "-1"
        },
        {
            "review_text": "Worst $2.49 I've spent on a game. The fact that this game costs $20 without a sale is absurd. It has the most confusing controls of any first person game I've ever played. I was too frustrated to even get past the tutorial because the instructions were extremely unclear. It was even disorienting to walk around in the game because of the over the top motion blurr and absurd interface.",
            "review_score": "-1"
        },
        {
            "review_text": "Probably the worst game to ever be created.",
            "review_score": "-1"
        },
        {
            "review_text": "This game really sucks",
            "review_score": "-1"
        },
        {
            "review_text": "2tecxhy4me",
            "review_score": "-1"
        },
        {
            "review_text": "this is one off the best helicopter game i played for a long time  play`s very good with xbox 360 joypad, my rateing for this game 9/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is great! I am admittedly having issues early on with a challenge - hover over a spot over the water - without and visual references besides the HUD spot and its distance from ya - yeah its tough - maybe a new track ir would help - even better... GROUND! lol - |I'm whining - that's my struggle - the game though?   Well - considering I love simulators and often find myself not really having anything to do in them - 'awesome heli/plane - flies realistic - totally! .... ok - looks nice outside - ok - now what? it gets old! I use FSEconomy web site to make my x-plane and ms-flight sim more fun - as you then have passengers, people in the community own FBO's on airports all over - you can too - etc... fly freight, buy planes, fuel... makes it fun....  Anyway - this game does that from the start. Voices sound drab or whatever? Dialog sounds 'c movie' - I' think its great. The fact that |I'm not reading subtitles and their is enough animation and stuff... well - keeps me entertained... and then the missins to go with the story - awesome!   I think its better I'm stuck on a mission then ripping thru the game - if it finishes - I might be stuck without much to do - that would stink! I haven't got that far...so I don't know how this will pan out - but its a fun simulator/game hybrid - and I think most of it is all spot on flying wise - pretty much.   It can be frustrating in any computer simulation to fly a helicopter, plane and whatever else because you want to turn your head all over all the time whenever and not getting that - well - even with track ir (which helps) its kinda trickier in a game they say - you can't feel forces etc... ) Anyway - moving your head fast, exact is as important as the controls - as the whole need for hand eye coordination is at a premium when you're airborne and dirt is racing by your shoulder only feet below! Moo wah hhahah Weed Whacking the lawn!   This game is a kick - I don't think you'll hate it if you like helicopters a lot, flying a lot, etc - but note this does kinda lean toward difficult to fly helicopter simulation - so - prepare to practice a bit and get a joystick and pedals if you can! Track IR even bettter! Maybe occulus workjs too - I dunno - but those shutter glasses on LCD screens... versus the tube kind - nope - yuk - don't bother! get a vr helmet first!   Great Game!",
            "review_score": "1"
        },
        {
            "review_text": "If you have played Arma games or just like flight sims this game is for you the makers of Arma Bohemia Interactive these helos will be used in Arma 3 as flying these birds better get your practice in while you can. LOL",
            "review_score": "1"
        },
        {
            "review_text": "Personally love the game particularly for compatibility with other content using the ARMA engine. Physics might not be fully-fledged real, but it's still a challenge for anyone unfamiliar with flight sims.",
            "review_score": "1"
        },
        {
            "review_text": "You should definitely try this game if you are interested in aviation :)",
            "review_score": "1"
        },
        {
            "review_text": "I think its a fun game if you love flying",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the worst games I've ever bought, and I'm a big ArmA player and fan.   It's amazing to me that this game has been out since 2011 and it's clearly unfinished. Let's start with the Seattle map. It's a screen print from Google earth with a few hills and buildings. On one mission for the campaign you have to fly to a number of golf courses; one of which has a flat, screen print club house! The AI cars driving on the map are non-collidible. You can drive through all of them. The motorboat has no engine sound. The fps is absolutely appalling - even worse than ArmA 2 OA... The campaign script is naive and poorly written, the characters laughable and badly acted.  The flight mechanics are reasonably good. It's quite like ArmA 3 advanced controls. You don't fly around with your finger firmly pushed on the collective like in ArmA 2. You have to add and subtract torgue or lose control. This I rather like.  The buildings, as one can expect are mainly from ArmA 2 and A2OA.  If only BI knew how to optimize and game engine or would at least employ some people who did, this would be a start.  I can not recommend this game, I'm afraid. It's just too shoddy and unfinished.",
            "review_score": "-1"
        },
        {
            "review_text": "4/5 stars  Impossible to to hover with my keyboard and mouse. Makes the story impossible.   Free roam and the details is what I love.",
            "review_score": "1"
        }
    ]
}