{
    "app_id": 65780,
    "name": "ARMA: Gold Edition",
    "release_date": "2011-07-13",
    "developer": [
        "Bohemia Interactive"
    ],
    "publisher": [
        "Bohemia Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 16,
    "categories": [
        "Single-player",
        "Multi-player"
    ],
    "genres": [
        "Action",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Simulation",
        "Action",
        "Military"
    ],
    "achievements": 0,
    "positive_ratings": 548,
    "negative_ratings": 209,
    "price": 5.99,
    "description": "ARMA: Gold is pack of ARMA: Armed Assault and an expansion pack ARMA: Queen's Gambit. ARMA is a first person tactical military shooter with large elements of realism and simulation. This game features a blend of large-scale military conflict spread over large areas alongside the more closed quarters battle.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/65780/header.jpg?t=1525874784",
    "minimum_requirements": "Minimum OS: Windows XP or Windows Vista Processor: 2.5Ghz Intel P4 or AMD Ahtlon processor Memory: 512MB RAM Graphics: NVIDIA Geforce 6600GT with 256MB VRAM Pixel Shader 2.0 or ATI Radeon x800 with 256MB RAM Pixel Shader 2.0 DirectX®: DirectX 9.0c Hard Drive: 6 GB Sound: OpenAL sound compatible audiocard",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Do not buy this game expecting to be playing multiplayer the servers were run by gamespy and they have shut down but if you are looking for a single player MILSIM go ahead and buy its a great game :)",
            "review_score": "1"
        },
        {
            "review_text": "The multiplayer has died, but it is still good for playing with friends. The campaign missions are OK. I just wish that the online community for this game was still there.  6/10",
            "review_score": "1"
        },
        {
            "review_text": "This is the only game i have played that has no limits i would buy it for editor, great war sim, and city life rp if you really want but overall i give it a 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Old but still good, it has every mechanic like in arma 2 and 3, even highly detailed injures, worth buying, highly modable, big replay ability",
            "review_score": "1"
        },
        {
            "review_text": "ARCADE WIZARD'S REVIEW  FUN: 4/5  GRAPHICS: 3/5  SHOULD YOU BUY IT?: YES  SURE THIS AN OLD GAME. IT'S STILL ENJOYABLE. ESPECIALLY AT 90% OFF OR A SIMILAR DEAL. COMING FROM A CONSOLE WORLD INTO PC GAMING, ARMA IS INSANE JUST BASED ON THE FACT THAT A GAME LIKE THIS HAS NEVER BEEN RELEASED ON CONSOLES. IT'S LIKE CONSOLES ARE ALLERGIC TO CERTAIN GAMES AND NEED AN EPI-PEN FOR A REACTION. I LOVE THE PACING OF THE GAME, EVEN THE WAITING. THIS NEVER, I MEAN NEVER HAPPENED IN ANY CONSOLE GAME. CONSOLES IS LATIN FOR, 'THE PAST'.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, Arma II is better in terms of gameplay and Arma III is even better but the game holds up, the map is pretty good. The game itself is cool but the gameplay can sometimes feels weird if you compare it to Arma II and/or Arma III. The game is still totally worth playing though. I'd suggest it to anyone who likes the Arma series, tactical, military, strategy and shooter games.  8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Pro: Often on sale for under $3 Mission editor Low syste spec needed FPS so you don't have to deal with all the CS *holes Fairly good sized mod community  Con: No cards No workshop (but the community is good) Dated game Near dead multiplayer Some bugs on new systems  Overall: 5/10 +2 mod community, +2 editor, -1 no cards, -1 near dead multiplayer = 7/10 If your looking for a modable FPS, grab this game on sale. It's currently listed for $10.99 CDN but I've seen it under $3. ",
            "review_score": "1"
        },
        {
            "review_text": "Shot entire team. Squad leader was cool with it. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "ARMA: Gold Edition is just that  GOLDEN  As if any more explanation would be necessary, but I will give it anyway.  This game was a literal gift to me and thanks to the good will of a friend. We decided to play this game due to the absolute crappiness of our PCs at the time. So really we played this out of necessity than anything else. By some miracle it turned out this game has a ridiculously fun and longlasting cooperative game mode. WARFARE. Many great memories have been had there. I would list them but they are too many in number and too crazy in content to by included in a steam review. All the strange situations you find yourself in are the reason I went so screenshot happy with this game.  Playing this oldie was a gamble at first, but it turned out to be a gem. I'm still yet to find an equally fun but simple experience on the later ARMA games.   10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is really really good. good graphics good gameplay good campaign buy it",
            "review_score": "1"
        },
        {
            "review_text": "Tactical FPS with good graphics and any computer can run it! not made for Trickshoters, People that go alone and for people that dont like tactics. Multiplayer is dead but the game is still fun  2.5/3",
            "review_score": "1"
        },
        {
            "review_text": "Feels alittle like ARMA 2, but with audio issues for me!",
            "review_score": "1"
        },
        {
            "review_text": "Like the game, its a bit buggy but once you turn the graphics up all the way you can have a fun time with it. Its a sim and an old one at that so be prepared for pedalbin mouths and so serious you can't take it serious dialog",
            "review_score": "1"
        },
        {
            "review_text": "Doesnt work on windows 8.1 but i know thist game kicks ♥♥♥ :D",
            "review_score": "1"
        },
        {
            "review_text": "The first arma I played!",
            "review_score": "1"
        },
        {
            "review_text": "Very amateur feeling, glad I paid almost nothing for it. The controls are clumsy no matter how they're configured, the AI is far from intelligent, the voice acting is ANNOYING and the gameplay is just overall sorely lacking. I've played better indie games made with far less staff.",
            "review_score": "-1"
        },
        {
            "review_text": "This game may be a decent war simulator however due to the multiplayer being dead as soon as you finish the missions or campain thats it. Im lucky to find one person a server. Honestly I would save for arma 2 or 3 as those are both popular versions. As well if u have two sources for graphics e.g nvidia and intel hd then every time you open it you need to right click and choose what graphics to run it with and if you dont well lets just say then you have issues such as everthing being black",
            "review_score": "-1"
        },
        {
            "review_text": "Somehow I received a broken game where nothing is actually visible and everything's pretty much a black screen. Can't change settings whatsoever.",
            "review_score": "-1"
        },
        {
            "review_text": "I do not really like this game. But this is just my point of view.",
            "review_score": "-1"
        },
        {
            "review_text": "I cant get to the screen ill tell u yes when i get a full screen to play on I WANT MY MONEY BACk",
            "review_score": "-1"
        },
        {
            "review_text": "The squad system is broken, the controls are all over the place and the mouse aiming is incredibly difficult to fine-tune properly. Those are three pretty important things that the majority of PC games, ESPECIALLY first person shooters, get right (except for the squad system, not every game has one, but most games that do, hey, at least it works in those games) and, since it's been a pretty long time since the original game's release, I doubt we'll get a fix for any of these issues. This game had so much potential...",
            "review_score": "-1"
        },
        {
            "review_text": "Very bad controls, overly complicated and crazy enemies. There's something call overly realistic when you die from a single bullet shot.",
            "review_score": "-1"
        },
        {
            "review_text": "  Nope",
            "review_score": "-1"
        },
        {
            "review_text": "I have wanted this game for years, and i finally get it and I get the black screen, If you can fix this problem ill give it a 10 but since i litterally cant play it after spending 2 bucks and theres nothing to review it is a big fat zero. I would like you all to fix this problem but dont be selling a product that doesnt work please.",
            "review_score": "-1"
        },
        {
            "review_text": "I have to say, I'm impressed. I've played many games that were old, most were fun...ish. But this game? I love it! It does -however- remind me of the Far Cry series (not that the gameplay is the same, but that 1 and 3 were great, but 2 was the B-grade movie that didn't come to the theater). I definetly recommend this game to people that love simulators, and have patience (you know, that thing that CoD players lack). This game represents real-life military strategy, and is NOT recommended to people that play CoD, or people that rage to often (WARNING: this game will probably give you a headache even if you enjoy it, especially the continous un-needed radio talk in campaign).",
            "review_score": "1"
        },
        {
            "review_text": "Enemy -stop- Five o Clock -stop- Open -stop- FIRE! Serious stutter intensifies.",
            "review_score": "1"
        },
        {
            "review_text": "this game good for who can't run arma 2 or 3 because they don't have good computer's so i found it really good despite of dead community members,this game still good game",
            "review_score": "1"
        },
        {
            "review_text": "its good but iv got a glitch where i cant here sounds ? plz fix ? ",
            "review_score": "1"
        }
    ]
}