{
    "app_id": 67370,
    "name": "The Darkness II",
    "release_date": "2012-02-09",
    "developer": [
        "Digital Extremes"
    ],
    "publisher": [
        "2K"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 18,
    "categories": [
        "Single-player",
        "Co-op",
        "Steam Achievements",
        "Partial Controller Support"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "FPS",
        "Action",
        "Gore"
    ],
    "achievements": 50,
    "positive_ratings": 11992,
    "negative_ratings": 1234,
    "price": 19.99,
    "description": "An intense first person shooter that delivers a twisted and gripping narrative of tragedy, modern crime drama, and supernatural horror.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/67370/header.jpg?t=1526508309",
    "minimum_requirements": "OS: Windows XP/Vista/7 Processor: Intel Core 2 @ 2GHz / AMD Athlon 64 X2 4200+ Memory: 1.5GB RAM  Hard Disk Space: 10GB Video Card: 256MB NVIDIA GeForce 8600 / ATI Radeon HD 2600 Sound: DirectX Compatible Additional: Requires installation of Visual C++ 2008 Redistributable, DirectX and nVidia PhysX version 9.11.1107 (included with download)",
    "recommended_requirements": "OS: Windows XP/Vista/7 Processor: 2.4 GHz Quad Core processor Memory: 2GB RAM  Hard Disk Space: 10GB Video Card: 512+ MB NVIDIA GeForce 9800 GTX  Sound: DirectX Compatible Additional: Requires installation of Visual C++ 2008 Redistributable, DirectX and nVidia PhysX version 9.11.1107 (included with download)",
    "reviews": [
        {
            "review_text": "It doesn't take you long to be pulled into the story. The Darkness 2 does a great job of immersing you into the feelings and thoughts of the main character, which is a rarity in modern day gaming. Often you are very disconected from the story and the emotions of the characters. Lately, the only other game I have played that did such a great job of pulling you in, emotionally, was BioShock Infinite.  Beyond the story, which while nothing especially impressive, what is there is enough and is well orcestrated. The most impressive feat is the game's ability to put you in the shoes of the main character and really doubt what is real and what is not real (in the game).  The gameplay is top notch though and if you enjoy shooters where you run from one area to the next and have to clear all the waves of enemies, then this is a game for you. The gunplay is fun and has impact and the tentacles are well implemented so that they are not overpowered and yet are still very fun and exciting to use.          YouTube™ Video:  Atratzu Reviews: The Darkness II - Back in black!&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Really great game. But seriously, they need to add the 1st game on Steam.",
            "review_score": "1"
        },
        {
            "review_text": "its not hentai dont worry",
            "review_score": "1"
        },
        {
            "review_text": "You cant control the darkness Jackie, noone can  The Darkness II  about game pretty decent FPS shooter with coop campaign, if you got friend this can be game for you  Positive +graphic, I like the comic style of graphic its actually fits the game +voice acting are pretty good +your 'demon' power can be upgraded which is really cool +playtime: well I would say 15 hours ( havent finished yet) +this is one of game that all achievs can be aquired while not smashing your head  +coop: I was suprised that my room didnt crashed not even once  +grab a friend and play this  Negative -Price 29,99 euro, the game is good but in my opinion it doesnt worth that money, If I want to buy you it I would go 17 euros or less  but this game worth of giving a shot  ",
            "review_score": "1"
        },
        {
            "review_text": "The Darkness II pretty good game...   Gameplay:",
            "review_score": "1"
        },
        {
            "review_text": "One of the best FPSs I've ever played: above the average story, quad-wield weapons to slice and shoot your enemies into pieces, nice graphics. Additionally to campaign there are so called Vendettas which can be played on- or offline and they add minor information to the main storyline. This game is worth every minute you spend on it.",
            "review_score": "1"
        },
        {
            "review_text": "Played this recently and while I can't speak for multiplayer, the campaign was great although short. I only found two bugs while playing. One where you have to turn v sync on to get through a vent section, and another where I would attack with the darkness and have a blurry vision unless I restarted my checkpoint (only happened during the attack on mansion mission.  While the darkness 2 is shorter and more linear than the darkness 1, it's still a fun and good game overall. Would recommend especially when on sale",
            "review_score": "1"
        },
        {
            "review_text": "Finally i finished this game just now, its kinda short, fortunately there are new game plus mode and co-op up to 4 players if you want to complete the achievements.  This game tells a story about a demon-infested mobster Jackie Estacado, who being attacked by a group called Brotherhood who want to take The Darkness (the demon inside Jackie's body). First time i see Jackie, its kinda remind me of Tian, a character from manhua Feng Shen ji, cause Tian have 2 dragons on his back, just like Jackie does. And this Darkness thing is a badass, its really fun playing with it, we are not just shoot the enemies with guns but it can allow you to perform variety of gruesome executions (its really gore, decapitate and dismember the enemies) with things surround us like poles, car doors, even trash bin. lol We can upgrade the darkness for several power up like black holes, more health, extra ammo, shield, flies swarm etc. yeah its kinda overpowered when we have several extra limbs to fight with enemies but it still has a weakness, light, when we covered with light the darkness will dissapear immediately.  One thing that keep me playing is the story, the story make you keep curious and interested, the loss of jenny (jackie's girlfriend), his father and the struggle to control the darkness it the main plot in this game. the moment i loved the most when we are at asylum and they said Jackie are sick and delusional, with all characters at the asylum with their roles and several clues like The Darkness comics book, picture on the wall, its make you really think which one is the reality, is Jackie made things up? is he really a patient or a leader of a mobster?, is the darkness really exist? its make me play this game till finished it.  Overall this game is good, not so special but if you like something dark, violent, brutal, gore and fleshy, this FPS is worth your time, probably wait for some discount. 7/10.  ",
            "review_score": "1"
        },
        {
            "review_text": "Where the hell's the sequel everyone's been asking for",
            "review_score": "1"
        },
        {
            "review_text": "This game was so much fun! I went through it twice for the difficulty achievement, and the second playthrough was maybe even more enjoyable than the first, which is a rare thing for me. Did the Vendetta missions as well, the 'multiplayer' characters are heaps of fun and have interesting personalities and things to say. The only flaw this game has, in my opinion, is that it seems to have been cut short - it won't take you too long to finish it and it ends with a cliffhanger. I think they could have completed the story in this one and not waited for the Darkness 3, which, judging by the things I've read while googling it, probably won't even get made. But really, I can't recommend this game enough to both RPG and FPS fans, as well as people who enjoy a solid story that will leave you wanting to know more about it, the world and the characters.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a well made game and I enjoyed playing it the entire game. You are playing as the boss of an Italian mafia that get special powers, powers that belong to the dark side. The gameplay and the combat is well made, the combat can be challenging some times when face a certain types of enemies. The graphics of this game is pretty good and also unique - a nice change from other games ( the graphics are like comics, contrary to other games who try to look realistic ). The game also present a boss fights that can be challenging. In addition to all of this the power of the darkness are very powerful and are very fun to use. Those powers can be upgraded for different uses and there also upgrade for the weapons that is used in the combat. The story himself is avarage - some cult try to take your powers. Even though the story lacks the game is extremely fun to play and the story get a great dark aspects to it.  My Score: 8/10",
            "review_score": "1"
        },
        {
            "review_text": "I have beat this game 6 times in a row and can't stop playing, the story is so good it never gets old for me. The gameplay is very good and smooth.  I think any FPS fan should get this game and also anyone who likes to destroy things.",
            "review_score": "1"
        },
        {
            "review_text": "  Brutality!  Darkness II is about jacki who is head of mafia group,or is a mental patient.However He has darkness power which is Two powerfull monster on the left and right side of his shoulder that trying to controll Jacki!  During game you can easily kill your enemies with your gun,or Darkness will do this.There are some features that allow you to upgrade your ability and Darkness' ability.Darkness can throw everything such as a door,a fan etc.  If you worry about Darkness I story,before Darkenss II starts You can see what happend for Jacki in Darkness I and why he is in this situation now which is very good to have a better connection with story,however I think story was so stereotype,Jacki want to save his love? or She already dead? some people want to steal Darkness,although end of the story was not bad and probably you will ask He was really a Mafia boss?!  I didn't play coop part ,but looks like It's fun with your friends.  Less than 5hrs you can finish this game which is very awful for a 30$ game,so it's better to buy it on sale!  However It was very good experience and I recommend it if price goes lower than this!",
            "review_score": "1"
        },
        {
            "review_text": "Georgeous Graphics, interesting story line, game commands are pretty intuitive FPS, and action is smooth during conflicts. This game is a definite keeper",
            "review_score": "1"
        },
        {
            "review_text": "Ok, so I was expecting a regular FPS. But, I was wrong, Darkness II was a bit of a shocker to me, it was really good, kinda short maybe, but fun and had a solid story.  Story: (Trying not to make spoilers) The game is based on a comic series called, yep, you guessed it, The Darkness. You play as Jackie Estacado, a mafia boss that possess the forces of darkness.  Jackie tries to keep his darkness at bay, but after a rival mafia tries to kill you, you have no option but to start a war and unleash the darkness within you upon your enemies. But, when you unleash the darkness, you also cut a deal with it, and there's a price to pay at the end...  Graphics: The game graphics reminded me Borderlands but more realistic, and i like it :) kinda gives you the feel of a comics (which it is based on a comic series)  Gameplay: The game is FPS and RPG of some sort, where you gain XP from kills and level your skills, but apart from the guns and black magic you also have 2 tenticals that devours, kill, cutting off heads and ripping the limbs of people (Tons of blood and gore) When you are not cutting and killing, you also play as your little lackey, which is more stealthy than just killing everybody. Also, there are some levels that are purely for the story, they are short but very fun and delivers the awesome story to you, I loved those parts!  Conclusion: This game kinda surprised me, I loved the story, the cut-scenes are great, the gameplay is fun, the graphics are very nice and feel you get is very good. and even though it's short (took me about 6 hours to finish the game on Hard, but you can play it and make different decisions), it's really good! Play it!  ***There's also multiplayer but I didn't play it honestly, for no reason really*** ",
            "review_score": "1"
        },
        {
            "review_text": "its not hentai dont worry, (Some might consider it that but dont worry... You kick ♥♥♥ and for once your not watching ♥♥♥♥.... your the giver :) 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Simple as ♥♥♥♥, but uniquely fun as hell in its own way",
            "review_score": "1"
        },
        {
            "review_text": "Uh Not too sure what to write here so heres a recipe for Pancakes instead  Ingredients: 1 1/2 cups all-purpose flour 3 tablespoons sugar 1 tablespoon baking powder 1/4 teaspoon salt 1/8 teaspoon freshly ground nutmeg 2 large eggs, at room temperature 1 1/4 cups milk, at room temperature 1/2 teaspoon pure vanilla extract 3 tablespoons unsalted butter, plus more as needed  Now to make it 1. In a large bowl, whisk together the flour, sugar, baking powder, salt, and nutmeg. 2. In another bowl, beat the eggs and then whisk in the milk and vanilla. 3. Melt the butter in a large cast iron skillet or griddle over medium heat. 4. Whisk the butter into the milk mixture. Add the wet ingredients to the flour mixture, and whisk until a thick batter is just formed 5. Keeping the skillet at medium heat, ladle about 1/4 cup of the batter onto the skillet, to make a pancake. Make 1 or 2 more pancakes, taking care to keep them evenly spaced apart. Cook, until bubbles break the surface of the pancakes, and the undersides are golden brown, about 2 minutes. Flip with a spatula and cook about 1 minute more on the second side. Serve immediately or transfer to a platter and cover loosely with foil to keep warm. Repeat with the remaining batter, adding more butter to the skillet as needed. 6. Procedure for adding fruit to pancakes: Once the bubbles break the surface of the pancakes, scatter the surface with sliced or diced fruit, or chocolate chips, nuts, etc. Flip with a spatula and cook for 1 minute more, being careful not to burn toppings.",
            "review_score": "1"
        },
        {
            "review_text": "Uh Not too sure what to write here so heres a recipe for Pancakes instead  Ingredients: 1 1/2 cups all-purpose flour 3 tablespoons sugar 1 tablespoon baking powder 1/4 teaspoon salt 1/8 teaspoon freshly ground nutmeg 2 large eggs, at room temperature 1 1/4 cups milk, at room temperature 1/2 teaspoon pure vanilla extract 3 tablespoons unsalted butter, plus more as needed  Now to make it 1. In a large bowl, whisk together the flour, sugar, baking powder, salt, and nutmeg. 2. In another bowl, beat the eggs and then whisk in the milk and vanilla. 3. Melt the butter in a large cast iron skillet or griddle over medium heat. 4. Whisk the butter into the milk mixture. Add the wet ingredients to the flour mixture, and whisk until a thick batter is just formed 5. Keeping the skillet at medium heat, ladle about 1/4 cup of the batter onto the skillet, to make a pancake. Make 1 or 2 more pancakes, taking care to keep them evenly spaced apart. Cook, until bubbles break the surface of the pancakes, and the undersides are golden brown, about 2 minutes. Flip with a spatula and cook about 1 minute more on the second side. Serve immediately or transfer to a platter and cover loosely with foil to keep warm. Repeat with the remaining batter, adding more butter to the skillet as needed. 6. Procedure for adding fruit to pancakes: Once the bubbles break the surface of the pancakes, scatter the surface with sliced or diced fruit, or chocolate chips, nuts, etc. Flip with a spatula and cook for 1 minute more, being careful not to burn toppings.",
            "review_score": "1"
        },
        {
            "review_text": "I love the arcade style gameplay, i enjoy the story although it could have been better and most importantly, im a huge fan of the gore involved. The execution animations are pretty awesome and even though the game is pretty straightforward and some might find it simplistic, its good to just go in, kill some bad guys in a badass way and finish the missions.  The co-op is also pretty good, playing with your friends is awesome. That ending doe...8/10.",
            "review_score": "1"
        },
        {
            "review_text": "  The Darkness II  is a great shooter with a gloomy and interesting story.",
            "review_score": "1"
        },
        {
            "review_text": "Short but sweet",
            "review_score": "1"
        },
        {
            "review_text": "The Darkness II is an awesome game. It has got very gory elements, a great dramatic storyline focused around the loss of love, and also a great horror atmosphere. And do not forget your little helper, who - apart from having tons of funny comments - can ♥♥♥♥ on dead enemies. Sooo, instant buy. :P",
            "review_score": "1"
        },
        {
            "review_text": "The Darkness 2 has passable gameplay with about 10 weapons, half of them being what I would consider upgrades of a lower tier. It has a low replay value with not much to do after beating the Story and Vendetta/Hit List Missions (about 9-10 hours altogether). The best thing it has going for it and why I recommend the game is the single player Campaign portion of the game.  There is very little stalling in the plot. The game starts with the reveal of a new enemy and has about 3 objectives that are logical to progressing before starting the arc with the big bad guy. To me that is very efficient at getting to the point. I was nervous every time a sentimental moment happened, worried if the game would do a cheap jumpscare. It compelled me to care about what was going on and that is a rare feeling for me to have with dramatic stories like this.  Each time you can go back to your base, the other characters have different things to tell you that aren't always related to what you are doing, such as the story told about eddie when Jackie and Vincent are catching up. If you are into playing a game and exploring the subtle changes, you will be rewarded for your time. The plot constantly attempts to mess with your judgement of the situation and makes every chance for a choice an uneased gut check.  Check the game out when you have the opportunity to pay attention to the dialogue and really grasp the story. It was inspired by a comic book series and plays like reading an interactive graphic novel.",
            "review_score": "1"
        },
        {
            "review_text": "Fret not if you've never played the original Darkness. While many allusions are made its way, The Darkness II has you covered with a concise recap.  The first Darkness was a mess of a game, marred with terrible voice acting, animations, controls, gameplay, and numerous other bugs. The Darkness II, a product by another team of developers, is fortunately an exemplary sequel, fixing nearly every flaw and adding major improvements in ways unimaginable.  Graphically, The Darkness II's cel shading is simply beautiful, fitting right in with its comic book counterpart. The animations are smooth and the over-the-top violence is a blast to watch. Controls, especially during combat, flow extremely well, even in the face of the overwhelming number abilities available.  While the single player campaign isn't too lengthy, the game doubles its duration with the inclusion of a cooperative mode offering 18 missions and 4 new, unique characters. There's simply a lot of content to be found.  Grade: B",
            "review_score": "1"
        },
        {
            "review_text": "Rather fun and very interesting shooter, with an unique twist. The 'monstrous' controls feels rather good and the game did not disapoint me on the unique aspect and feel it promised and delivered. The only sad part about the game, IMO is that the main storyline is too short, you play through everything wanting more and poof, you only have the vendetta (MP) and hitman missions left to do. I cleared it twice and do not regret my purchase, definitely recommended. When a game leaves you wanting more, it is doing something good...",
            "review_score": "1"
        },
        {
            "review_text": "Fret not if you've never played the original Darkness. While many allusions are made its way, The Darkness II has you covered with a concise recap.  The first Darkness was a mess of a game, marred with terrible voice acting, animations, controls, gameplay, and numerous other bugs. The Darkness II, a product by another team of developers, is fortunately an exemplary sequel, fixing nearly every flaw and adding major improvements in ways unimaginable.  Graphically, The Darkness II's cel shading is simply beautiful, fitting right in with its comic book counterpart. The animations are smooth and the over-the-top violence is a blast to watch. Controls, especially during combat, flow extremely well, even in the face of the overwhelming number abilities available.  While the single player campaign isn't too lengthy, the game doubles its duration with the inclusion of a cooperative mode offering 18 missions and 4 new, unique characters. There's simply a lot of content to be found.  Grade: B",
            "review_score": "1"
        },
        {
            "review_text": "This game is a great game, the gameplay is probably my favorite part about the game, and the story got better and better as it went on (except the ending, which I found like it came out of nowhere and made me feel like it wasnt the actual ending) the only problems i have with it is that the game was too short, which only took me 4 or 5 hours to complete on normal. And the ending, which I indicated before.  Overall, I loved this game and had a lot of fun with it, but I really want to see a Darkness 3 so they can finish the story properly.  Another problem I had with the game is that vendetta did not work, everytime my friend tried to join the game would crash. Just a heads up.",
            "review_score": "1"
        },
        {
            "review_text": "i love this game i mean it was confusing at first but once you get the hang of it it is a awesome game to play ",
            "review_score": "1"
        },
        {
            "review_text": "Snakes are my wings",
            "review_score": "1"
        },
        {
            "review_text": "Darkness 2 , is one of the best games I have ever played , It includes only single player but the gameplay is just unbeliveable, I recommend this game to anyone who seeks for good gameplay which does not include multiplayer. If the game had even more gameplay in it , I would compare it to all Assaisin's creed games together , as the game has so much good stuff about it.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 &lt;3ing awesome.   77/100 metacritic !? SRLSY ?!   this game deserves AT LEAST 90/100   Pro:    Awesome   I loved it   nice story   You can stomp your enemies with your tentacles  Cons:    too short :C    ",
            "review_score": "1"
        },
        {
            "review_text": "Seems alright filled with story, action, wierd demon heads, guts, blood. It is must if you like ocult and 'wierd' ♥♥♥♥ idk much about story at this point but I belive I am for a treat regarding it.  Idk have anyone else noticed frames in cutscenes 66.6 xD laughed my ♥♥♥ off",
            "review_score": "1"
        },
        {
            "review_text": "NOTE: Despite my short playing time, I have in fact completed this game. I also own a copy on Xbox 360, and this is the copy I completed.   The Darkness II is a phsycological horror first-person shooter sequel to The Darkness, a console only game released back in 2009. The original game was interesting despite its flaws, and was a highly enjoyable game in terms of story and gameplay. Its sequel, The Darkness II, goes above and beyond to deliver an absolute gem of a gaming experience, and a masterpiece of the art form.  You play as Jackie Estacado, the head of a feared crime family, who is the host to an ancient evil known as The Darkness - this evil resides inside Jackie and gives him supernatural powers. Jackie constantly wrestles for control, and The Darkness forced him to stand by and watch as his girlfriend, Jenny, was murdered.  Jenny's murder is the driving force of this entire game. Throughout the game, Jackie experiences hallucinations of Jenny, and interacts with her as she if she never died. These moments are the soul of the game; Jackie and Jenny are beautifully acted, and you can genuinely feel the emotion in these scenes. This made the story a compelling and enjoyable one, and I felt personally compellled to stick this game through to the end. In between cutscenes and interaction with Jenny and other NPC's, Jackie will engage in numerous combat situations. This game uses a unique and innovative combat system, in that the player is able to 'quad-wield'; the player is able to dual wield one handed firearms in combination with the demon tendrils produced by The Darkness. These tendrils let you rip, slash, throw, tear and stab your enemies in a variety of highly entertaining ways, but be warned that these kills are extremely gory and not for the faint hearted. In fact, the entire game is extremely dark, and contains very dark subject matter beyond the usual video game. The player also has to avoid street lights and other artificial lights and shoot them out where possible, as you cannot regenerate health or use Darkness abilities whilst in the light. This game is beautiful in every aspect. The game engine employs a distinct comic-book inspired aesthetic like the Borderlands games, and it really helps make the game look and run nice at the higher settings. Substantial effort and polish has gone into the production of this game, and it really shows; character models look and move realistically, and environments are dazzling to look at. In addition to the perfected single player campaign (which I have been careful not to spoil) there is a mini co-op campaign, which allows you to play with 3 friends and use a wide range of guns and abilities to kill enemies. This mode emphasises fun and action, and lacks the depth of the single player campaign. However, it was certainly fun, and I didn't feel like it detracted from the campaign in any way. Overall, The Darkness II is a masterpiece of the gaming industry. A brilliant, well constructed tale of love and loss and eventually redemption, this is a game for the ages. I can't recommend it any more than I already have, which is why this game earns a 10 / 10.",
            "review_score": "1"
        },
        {
            "review_text": "The Darkness II is without a doubt a gem in the game history. In my opinon this game has two quite different sides, the one being the quite graphic mutilation drawn upon human/hellish beings with your powers, the other is the romantic part where you try to retrieve your love back in your arms once again.  The graphics are quite impressive, and the whole texture has it's own touch from the great artists who worked on this game, you will notice a few lines on a otherwise blank surface, and as they've done that with almost each possible template it gives this certain dark, somewhat grim look.  The music and atmosphere is definitely well suited for the certain areas, the fighting music really pumps up your will to just push forward and slice and dice your way through with nothing but your Dark unholy powers!  I don't know why, but they decided to put in some comic relief with your AI-controlled sidekick The Darkling, he makes a fistful of jokes and laughs every now and then, so it's not all that dark~ I do however think that if the game went fully dark with no jokes squeezed in what so ever it would have been quite good as well.  The deep and intense storyline builds up and is actually something understandable for once (played alot of games with rushed dialouges and story so I ended up understanding nothing) I won't tell much about it because it's a true experience to discover what's going on!  This game deserves a steady 10/10 from my side. I wish I could go into more detail but that would truly ruin the fun and excitement for exploring :)  ~Lyh flare   [DO NOT HOVER YOUR MOUSE OVER THE TEXT IF YOU DON'T WANT A SPOILER!]    I am a bit slow at these games because I enjoy the scenery need every dialouge and cutscene fully so after roughly about 1½ hour with nothing but fun and mutilating you wake up at the asylum hospital... That truly blew my mind.   ",
            "review_score": "1"
        },
        {
            "review_text": "Fun game with fun game macanics",
            "review_score": "1"
        },
        {
            "review_text": "A ver good game with an interesting gameplay and story line. Strongly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "There's not much I can say about this game. Basically, it's good. Action is good, sound design is good, plot and story are both at a very high level. It's enjoyable to play. Some minuses are here, though.  Such as: it's short as ♥♥♥♥. You barely get used to your skills, and then - pow, ha-ha. It's over. A lot of meaningless charaters. Why should I give a ♥♥♥♥ about some lady thoughts and advices, if I barely see her throughout the gameplay? I can't get it. Still, if I had to rate it from 1 to 10, where 1 means Dota 2, and 10 - TLoU, it would take place somewhere around 6-7. Definetely worth buying with a discount, definetely not worth it's full price. Thank you.",
            "review_score": "1"
        },
        {
            "review_text": "GUYS YOU HAVE TO PLAY VERY BLOODY BUT A GOOD STORY",
            "review_score": "1"
        },
        {
            "review_text": "this is a kick ♥♥♥ game and the price is well worth it",
            "review_score": "1"
        },
        {
            "review_text": "Great game! Great story! If you're a fan of the comic, you won't be disappointed.",
            "review_score": "1"
        },
        {
            "review_text": "No other game does a better job of making you feel like you have four arms than The Darkness 2. You can be grabbing a car door, slashing an enemy, and shooting two weapons independently all at the same time. And you'll have to, because some of the fights get tough!",
            "review_score": "1"
        },
        {
            "review_text": "This is a good game. That's really all that needs to be said, but I am looking at it from a different angle than most folks.  I lost my wife to Leukemia a couple of years ago so I identified with what Jackie was going through regarding his girlfriend. I especially identified with the talks he had with his aunt (I believe it was his aunt, it's been a while since I played the game). I still have regular talks with my mother in law (she is widowed as well).  I was pleasantly surprised with the effort put into the story of this game, which is something that I don't encounter very much in video games these days.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great for the first hour. Not worth $30. Gets extremely repetitive.",
            "review_score": "1"
        },
        {
            "review_text": "Singleplayer game lasts just FIVE hours, so I defiantely wouldn't pay full price for it. Great story and really enjoyed it but unless it's on a seriously awesome deal I can't recommend picking it up at full price - glad I paid just £4 for it now.",
            "review_score": "1"
        },
        {
            "review_text": "A very good game with excellent fighting mechanics, The Darkness II is a very good game. A decent story, although not the best around, is also a huge part of this amazing game. The power that is given to you almost makes you feel invincible, but doesn’t take away from the challenge. Although I will admit that this game is not very long, giving you maybe 6 hours of game play on the single player campaign tops, and the fact that there isn’t much of a reason to replay the single player again unless you want to use the amazing abilities you gain. But to counter that statement, if you have another friend that can get this game, there is a very decent coop experience with new characters with new abilities to play with, giving the game a lot more hours of fun to experience. It’s a decent game and its very fun, although probably not worth the 30$ price tag, this game is still a must own, and if you can find it on sale for $10~$15 or less, you should definitely get this game.",
            "review_score": "1"
        },
        {
            "review_text": "Frankly, with The Darkness II, I wasn't really expecting much. Probably just another demon fueled super action shooter right? Wrong. Well, right AND wrong. The Darkness II IS a kickass super action shooter, with a pretty compelling storyline to boot. I'm not saying this is some amazing story that will blow your mind, but I literally beat the game in two sittings (Each being about 3 hours-ish, so yes the game isn't very long either). Overally the Mechanics were great, the art style was somewhat similar to the Bordlerands games, but with a little more realistic look I suppose.  Gameplay - 8/10 Good action fun Story - 8/10 Compelling though short Bugs or issies - WILL NOT RUN ON MAC must use Windows.  All in all I recommend this game for story lovers who want some graphic human dismemberment without the mindlessness of some other games with gore to this degree.",
            "review_score": "1"
        },
        {
            "review_text": "  The Premise",
            "review_score": "1"
        },
        {
            "review_text": "Good game, but short. Completed the game on hardest difficulty in 6 hours. The graphics are really nice since it uses cell-shading. The storyline is simple and enjoyable with some really interesting and funny characters such as Darkling, Johnny. Gameplay is excellent, no complains here. You can tear very enemy with your demonic arms, throw all kind of items at them, also later you can get more abilities, like use swarm of insects or drop vortex that will suck all around it and slow motion headshot are awesome. Oh and The Darkness 2 is very gory.",
            "review_score": "1"
        },
        {
            "review_text": "This is a REALLY good game, highly reccomend it for a good story based singleplayer the mechanics are interesting and some of the controls are a little odd but its in the end generaly good overall. 10/10 jt needs to ♥♥♥♥ing play this. so annoy him.",
            "review_score": "1"
        },
        {
            "review_text": "It's pretty short but there's a few modes to put some time into after the campaign is finished. It's probably the most fun I've had with an fps in a good while.",
            "review_score": "1"
        },
        {
            "review_text": "Overall I would say about 8/10. Love the story and the way you upgrade Jackie. The combat however is a bit stale. The boss fights are all pretty much the same. But if story is more important to you then I would definitely check this game out.  Pros: Good graphics Great story Great audio and voice acting  Cons: combat gets a bit stale towards the end Repetitive enemies and bosses",
            "review_score": "1"
        },
        {
            "review_text": "Probably one of the most entertaining single-player games. You don't need to play the first one to play this one.",
            "review_score": "1"
        },
        {
            "review_text": "This game is one of those great weekend games that you can pick up and beat In just a couple of days,  The combat is fast and fun and very violent, all the way from the starting credits to the final battle (depending on what you choose, but no spoilers).  All the action of the game is supplemented by short trips to your home base, were you can talk to other characters in the game for tid bits of lore and comments on your current objectives, there are also a few little mini games you can play that will help you get in some target practice...... ill just call it that lol.  The game also features simple rpg mechanic that gives you the chance to upgrade skills depeneding on your play style, the game rewards you for killing in varied and unique was and its great fun to try out all the new tactics that you will unlock as you progress further along in a skill branch.  Only CON I can say with this game is the length, if you power your way through as I did on a second playthrough with some skills under your belt you can EZLY beat the game in about 4 hours, however if you take the time to test out new skills (BLACK HOLE FTW!!!), take time to talk to all the characters in the game, which I suggest you do on first run, the game can EZLY last for a good 8 hours.  I would say the overall experience is worth the asking price, but if you see it on sale, pick it up with out a doubt.  7/10, would give it a 8/10 if the game was just a bit longer.     ",
            "review_score": "1"
        },
        {
            "review_text": "Landed in a mental hospital multiple times because I ate people's hearts. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "One of my favourite. JaaCKIEee COme TO THe DaRKNESSs",
            "review_score": "1"
        },
        {
            "review_text": "At time of writing this game has been in bundles 3 times, which is how I got it. Really fun little shooter with good story line and really out there set of powers and nice art style which means it will not look dated any time soon.  Finished the main story in about 6-7 hours and have started the vendetta missions now.  At full price it is far too expensive but next sale or bundle grab and have a blast.  UPDATE: Vendetta is built around coop play, as older game online is dead. You are fine up to the boss then things ramp difficulty stupidly :( Shame as would be great entension to the main story",
            "review_score": "1"
        },
        {
            "review_text": "I loved the game! Really awesome! Only problems are a few glitches but other than that this game is really good. Glitches are sometimes when you talk to someone, their head spazzes out a bit. Also on some of the quests I don't think I followed them as intended (e.g. at one point I was able to kill some guys through a window on the roof before jumping down and reaching the quest marker, glitching out the game so I couldn't press the button to open the gate and let the darkling drive that truck through the clown door.)  The game had good character development, the storyline was good, although at points a little predictable, and the controls were easy to learn and use.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games i've played in awhile. Keeps you on edge the whole game very good graphics and i love the comic book look the dev's gave the game. I would give this game 9.5/10 and HIGHLY recommend this to a friend any day.",
            "review_score": "1"
        },
        {
            "review_text": "A very fun and different FPS with an interesting story. Has a lot of guns to pick, a lot of blood and gore, and enemies to fight later on in the game.",
            "review_score": "1"
        },
        {
            "review_text": "The game features a short campaign and a short co-op experience. It's a lot of fun, has some funny dialog, clean graphics, and NICE sound effects.",
            "review_score": "1"
        },
        {
            "review_text": "Liked: Story -A very strong narrative drives the game. It is your typical girl meets boy, girl gets killed boy gets mad story but it does not get cliched  Powers -The main protagonist has some interesting powers.  The Monkey ofcourse! Cell shaded graphics -They add atmosphere to the game Fast Game play     Could be better: Mouse control feels a bit stiff and off.  Gun Play -Lots of Guns in the game, but they all seem to behave the same way in their respective classes/categories Graphical Glitches -Sometimes the entire screen just becomes unfocused &amp; blurry. I suspect this is when coming down of aiming down and the game simply does not register this. Escaping back to the menu solves this    ",
            "review_score": "1"
        },
        {
            "review_text": "ITS COOL CUZ YOU CAN KILL PEOPLE AND EAT THEIR HEARTS WHILE YOU STILL CAN LOOK BADASS AND SHOOT PEOPLE WITH YOUR DUBBLE SMG AND YOU CAN PICK UP DEAD PEOPLE AND THROW THEM AROUND LIKE AND DO FUNNY STUFF WITH THEIR CUT OF LIMBS LIKE PUT IT UP SOME OTHER ♥♥♥♥♥♥♥♥♥S ♥♥♥ SO BUY IT RYT FRIGGIN NAO",
            "review_score": "1"
        },
        {
            "review_text": "Not a long game, but it is a good game. Check it out on discount. Worth $10, not $30.",
            "review_score": "1"
        },
        {
            "review_text": "A short game that's far removed from the original with lots of flaws (the minutes long blur effect, overtly long walking sections, super dumb story, etc.) but a fun game nonetheless. If you can pick it up for €5, don't hesitate.",
            "review_score": "1"
        },
        {
            "review_text": "A really fun first person shooter adaptation of the comic book by the same name, The Darkness 2 brings the pages of the comic book to life through beautiful cel-shaded-ish graphics and over the top gore. The gunplay is solid and satisfying.",
            "review_score": "1"
        },
        {
            "review_text": "After I realized the full power of the tentacles, no girl in my town ever looks at me the same.  6.9/10, would play again.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game but very gruesome I recommend not letting little children watch or play this game",
            "review_score": "1"
        },
        {
            "review_text": "Short but a really fun and solid FPS with an interesting plot.",
            "review_score": "1"
        },
        {
            "review_text": "Only problem was that it was too short.  Otherwise this game was great.  A must play during a sale.",
            "review_score": "1"
        },
        {
            "review_text": "I ripped a guys spine out through his ♥♥♥♥.   10/10",
            "review_score": "1"
        },
        {
            "review_text": "Personal Rating: 8 of 10  Awesome game! This masterpiece excels in every possible way. Apart from your convention gun blasting FPS, this game allows you to quad wield by adding 2 tendrils that you can use simultaneously with your guns. The gameplay is really refreshing and I typically liked the graphics style that uses cel-shading to give it a 2d-ish comical look.  The plot is rather straight forward but the way the story is presented with the incredible in-game voiced dialogue really captivates brings out each character.  The game is rather narrative where there are plenty of dialogs, but they are so well done you won't be bored. The level design are rather short although each of them stands out since they tend to have different settings. There are quite a variety of enemies to keep things interesting and I think the length of each level is just nice to keep players from getting bored.  The developers also added other game modes that you can play with friends with new characters and skills. I said friends because there are no one online anymore.  There are a couple of minor bugs which i encountered such as weapons dropped below ground and prevents you from picking up and the graphics jerk sometimes (during non-combat moment/close up with NPCs). The game also has almost zero replay value. This game had tonnes of potential. After each mission you head back to your mansion. And I think the game can use some upgrades apart from skills where you can manage back in the mansion.  Also, I have a 360 controller plugged into my PC. The game detected the controller and every button prompt are for the controller. I cannot find where to disable this so I was having quite a hard time figuring out the keys.  Many people are questioning why is there a DLC link in the library page but none was found in store. Unfortunately this game does not get the recognition it deserved. The developers really did a great job with the game but the sales did not hit their expection and further funding was pulled off including planned DLCs.  I was really hoping for a sequel of a prequel remake for PC. And this time it should get its well deserved recognition.",
            "review_score": "1"
        },
        {
            "review_text": "I would only recommend playing this game because it is unique. I don't remember playing an FPS like this before. I found the overall game quite boring and this could have been made much better with a much more appealing story and a much longer one. The main story campaign can be completed in under 8 hours maximum. It can get quite repetitive and the look of this game is inconsistent but still very good for it's age. It's worth playing but I doubt I would revisit this. It certainly lacks re playability. Next installment needs some changes.",
            "review_score": "1"
        },
        {
            "review_text": "Nice graphics, tragical storyline and lots of gore.",
            "review_score": "1"
        },
        {
            "review_text": "This game might be underrated imho. 'Tis worth a try.",
            "review_score": "1"
        },
        {
            "review_text": "I did fine the game to be rather short and the story to be well similar to dead space 2 (it really does have a similar plot to dead space 2). Its a spray and pray game and also you have those to snake hydra things. Its fun and makes you feel like a badass but is by no means the best game in the world. If you enjoy games where you run around and murder everyone is the most goriest way possible, then this is the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "  Dude. Demon snakes coming out of your back. Three firearms on you at all times. Modern crime drama.  Grab it on sale, it's not worth the $32 price tag.",
            "review_score": "1"
        },
        {
            "review_text": "Now, if that's a fact, tell me, am I lying? Cause you, you're part eggplant",
            "review_score": "1"
        },
        {
            "review_text": "u ♥♥♥♥♥ kill everything u see but ur girlfriends dead so its kinda gg",
            "review_score": "1"
        },
        {
            "review_text": "Amazing sequel to an amazing game. Definite must play",
            "review_score": "1"
        },
        {
            "review_text": "this is an old but fun and interesting game ! you should try!",
            "review_score": "1"
        },
        {
            "review_text": "- Entire game spent ripping hearts out. - Story ending rips yours out.  Highly recommended for those wishing to weep buckets.",
            "review_score": "1"
        },
        {
            "review_text": "a nice way to take out your anger on others in a slenderman/borderlands kind of way...",
            "review_score": "1"
        },
        {
            "review_text": "This is a heavy tale full of gore and brutality; a trail of blood and people torn to pieces, but also about love.  Resist the darkness corruption and feel the impact of violence as it often conflicts with humor and it's taken as normal.  Main campaign is nice, Vendettas campaign could be better (still a plus), characters and story are interesting.  Overall, a good game!   By the way, have you ever watched that movie 'What Dreams May Come', from 1998? Feels like the game and the movie are related, yet antagonic.  *Put your volume level down if you use headphones: 2K´s intro was a bit too loud when I played it.",
            "review_score": "1"
        },
        {
            "review_text": "Must say that ripping peoples arms off and slicing them in half and sticking tentacles down their throats really triggers my asthma. 10/1 Gr8 gam",
            "review_score": "1"
        },
        {
            "review_text": "YO THIS ♥♥♥♥ WAS TIGHT",
            "review_score": "1"
        },
        {
            "review_text": "This great is game. The compelling is story and very fun game. If choose had to I Darkness II Military Shooters over would pick. Character seem good very weird. I ♥♥♥♥♥♥♥ out spine hilarious very. Game very graphic good. Die have Jenny apear game in again. Get easier into to. Love tentacles Dark scary very cool, brutal. Game have dialogue good very fun.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty amazing game. It may be short by todays standards, but it is very sweet. The story and setting are the stars here, as you can really felt it. In my opinion, its not as good as Darkness 1, but that game is brilliant in my opinion. You don't really need to play Darkness 1 to play Darkness 2 at all, but I highly reccomend it. Multiplayer Co-op was decent, and the challenges were fun too. There is replay value here, and a 'New Game+' for extra stuff. Go get this game now!",
            "review_score": "1"
        },
        {
            "review_text": "Very Dark, lives up to the name...1/10 Perfect-IGN",
            "review_score": "1"
        },
        {
            "review_text": "10/10 - The Darkness II Limited Edition Review  +Awesome graphics / Art Style +Lots of Blood &amp; Gore with epic EXECUTIONS :D +Great dark &amp; gritty atmosphere +Great Gameplay +Best companion after Elizabeth from Bioshock: Infinite - the one and only Darkling :D +Story  + +Great PC Port with everything set on Maximum &amp; 1080p not once i had framedrops or a lag, crash or a bug nothing its truly great PC Port   (Not Important)  -Difficulty names didnt know wkich one is easy - medium or hard - they are named as Thug - Mobster - Hitman &amp; Don ..... when i finished the game i realised that i played on Don which is ♥♥♥♥ing nuts ahahah   But ist still 10/10 game.",
            "review_score": "1"
        },
        {
            "review_text": "The Darkness is one of my favourite comic book series of all time, and I think this game does a really good job of breathing some new life into it, while capturing the crime-filled, bloody action of being Jackie Estacado.",
            "review_score": "1"
        },
        {
            "review_text": "Cool concept, meh execution.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, great atmosphere Get it!",
            "review_score": "1"
        },
        {
            "review_text": "This game really is a special game, and honestly very underrated. The story has you playing as a guy named 'Jackie' who has his entire world ripped out from beneath his feet. So many twists and turns and the way the narrative is told in this game is extremely immersive. You will really begin to sympathize with the main character. On top of the story being one of the best I've played, the actual gameplay itself is something very unique. Just look at some of the gameplay on the steam store. It may look overwhelming but it is actually really easy to use and the skill trees are very varied, enough so that if you enjoyed it enough you could even think about playing it through a second time.",
            "review_score": "1"
        },
        {
            "review_text": "gore, demons, and plot twists. If that doesn't convince you, nothing will.",
            "review_score": "1"
        },
        {
            "review_text": "The Darkness II will NEVER compare to the graces of its predecessor. The music, sounds, engine technology, feedback system and voice acting / cutscenes of the original are simply impossible to reproduce without Starbreeze at the helm.  With this being said, The Darkness II manages to offer above average gameplay with an incredibly unique aesthetic, excellent engine performance, superbly paced single player and cutscenes of its own caliber. Cooperative multiplayer is included as well, though this should be viewed more as an after thought (despite the time spent on fleshing out the 4 characters).  If it's ever $15 or less, get it, enjoy it and look forward to a potential sequel.",
            "review_score": "1"
        },
        {
            "review_text": "Even though I think the amount of hours you can put into this game isn't that much. Maybe 20 hours max if you really got into the shooter. But the best thing about this game is the story.  Honestly I kept playing only for the story, I haven't read the comics or played Darkness I so I had no idea what the concept was about. But this game's story is a very pleasing and interesting experience to have. You get two alternative ending, one makes sense and the other leaves me puzzled. And questions the protagonist's universe, still great story.  Gameplay is good. Story is better.",
            "review_score": "1"
        },
        {
            "review_text": "The Darkness II was one of those games I finished without ever getting up from the PC, literally. First, because its really catching, but second because it's also really short. I easily managed to fit in those 5h playtime between lunch and dinner.  The Darkness II is amazing, and one of the best games I played in a while.  Its not necessary to have played the first part to get the story, but I am going to buy it now. I easily immersed into the story and all the characters are well made and believable. Overall it was well written and it all fitted together. I also love the musik.  Surprisingly the game run perfectly fine without ever lagging on my old Computer. I never found any performance issues and still the graphics are amazing.   This games gets a 9,5/10 rating. The minuses are short campaign, repetitive bossfights and sometimes stupid AI.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game for solo players, received it in a bundle deal and was actually not too bad. haven't played nearly enough to give a proper review    Pros:      good story and acting    Nice combat mechanic    Controller compatible      Cons:    Multiplayer is seriously lacking    A bit Gruesome    Too easy (even on hardest difficulty)   Again i haven't played enough to write a better review, but in the little time i did play i'd recommend this game to anyone who isn't squeamish to gore.",
            "review_score": "1"
        },
        {
            "review_text": "The Darkness 2 is, as the name implies, pretty ♥♥♥♥ing dark.  You play as Jackie Estacado, a mobster whose special skills have allowed him to rise to the very top of the New York underworld. And by 'special skills,' I am of course referring to the ancient demonic entity that lives within his body.  But when a bunch of cultists show up and try to steal the power away from him (because if an ordinary guy can use it to become king of the Mafia, imagine what someone with actual ambition could do with it), Jackie must use his eldritch abilities, and a veritable ♥♥♥♥load of increasingly large guns, to defend himself and prevent the power from falling into the wrong hands.  I'll be honest, I was surprised by how much I liked this game. I picked it up expecting a standard shooter with a vaguely gothic design aesthetic. What I wasn't expecting was a genuinely inventive and unique game with solid gameplay and some smart ideas bubbling under the surface. There are some very creative moments throughout the campaign, first as Jackie explores some strange locations, and then later when the demonic presence starts to drive him insane. The ending also qualifies for the 'Holy ♥♥♥♥ing Christ' award of totally unexpected story turns.  The gameplay is the standard gory shooter, but with the twist of dark and brutal abilities. You have two demonic tentacles which can pick up and throw things independant of your two gun-hands, which led to several situations where I was fighting two battles at once- a mid-range skirmish with a pair of SMGs, and also a long-range stand-off in which I was lobbing sharp objects and spikes at snipers.  You also get health by eating hearts that you tear out of dead bodies, which means the only way to get your way out of a tight spot is to use progressively riskier tactics to kill enemies and regain the upper hand.  Overall, it's a surprisingly enjoyable game with some creative uses of mechanics to craft a campaign that is not only fun to play, but fun as an experience. Final score: 8/10.",
            "review_score": "1"
        },
        {
            "review_text": "Well Where Can I Start With This Epic Game!  Pros: Nice Cartoony Graphics Good Selection Of Guns To Pick Up On Your Jorneys Of Murdering Over 4-7 Hours Gameplay, Not Reptative Co-Op Campaign (Love It)  Cons: Very Tiny Bit Glitchy (Bodies Spazm When Stuck In Walls)",
            "review_score": "1"
        },
        {
            "review_text": "It's a REALLY short game, can be finished in like 6 hours. :(",
            "review_score": "1"
        },
        {
            "review_text": "Lima beans are spies.",
            "review_score": "1"
        },
        {
            "review_text": "Totally worth it. Despite all the violence, there's a deep story.",
            "review_score": "1"
        },
        {
            "review_text": "you're a spooky hentai aminals 16/6",
            "review_score": "1"
        },
        {
            "review_text": "you're a spooky hentai aminals 16/6",
            "review_score": "1"
        },
        {
            "review_text": "8/10 - good game, a bit short but really, really fun  You can tear people apart, slice them in pieces, impale them on metal rods and all sorts of fun executions on top of applying some generous amount of lead in their body. The gameplay revolves around controlling your player's dark powers that will allow you to grab objects or bodies and throw them, with the small (but very annoying) limit that your powers only work in the 'dark'. There's a fair bit of shooting people in the face with your usual FPS weapons, including the pretty neat dual wield of different lightweight guns, meaning you can shoot people with a UMP45 and a M1911 to make sure you empty both your pistol and SMG ammo pools in a jiffy. Also, a british as balls sidekick that is a buttload of fun to hear. You can of course purchase upgrades and new powers, that will increase the power of your bullets, let you see through walls, stun enemies or rip them apart in new and exciting ways. The storyline picks up after the first game (that I never played, thanks console exclusives) and is pretty nice. It begs for a sequel though, that will probably never happen considering it hasn't been announced yet.  On top of that SP mode (and its New Game+ option that allows you to start the game with your upgrades - a great way to make the hardest difficulty mode a little bit less frustrating), there's a coop mode where you assume the role of one of the 4 totally stereotypical, borderline racist characters available in that mode. Each character has a new ability: the chinese dude has a katana, the jew girl has a really neat pistol/shotgun/bringer of death, the black healer guy can throw people in the air and the irish guy can throw an axe on top of reusing one of the SP mode's PC abilities. It's possible to rip and tear with your friends!  Technically, the game looks pretty good but the performance is all over the place. Sometimes the framerate tanked as low as 15 FPS while on some other places of the same level it was above 100 FPS.  Overall, the game is pretty short but nevertheless good.  Did I mention you can destroy people? Like, put one of your demonic arms in their butt and pull their spine out?",
            "review_score": "1"
        },
        {
            "review_text": "Hello darkness, my old friend  I've come to talk with you again  Because a vision softly creeping  Left its seeds while I was sleeping  And the vision that was planted in my brain  Still remains  Within the sound of silence   In restless dreams I walked alone  Narrow streets of cobblestone  'Neath the halo of a street lamp  I turned my collar to the cold and damp  When my eyes were stabbed by the flash of a neon light  That split the night  And touched the sound of silence   And in the naked light I saw  Ten thousand people maybe more  People talking without speaking  People hearing without listening  People writing songs that voices never shared  No one dared  Disturb the sound of silence   'Fools,' said I, 'you do not know  Silence like a cancer grows  Hear my words that I might teach you  Take my arms that I might reach you'  But my words like silent raindrops fell  And echoed in the wells of silence   And the people bowed and prayed  To the neon god they made  And the sign flashed out its warning  In the words that it was forming  And the sign said 'The words of the prophets are written on the subway walls  And tenement halls  And whispered in the sound of silence'",
            "review_score": "1"
        },
        {
            "review_text": "I absolutely loved the first Darkness, developed by Starbreeze. The Darkness 2 absolutely matches the amazingness of the first game. Digital Extremes, I REALLY hope you are the developers behind The Darkness 3 if there ever is one. The Darkness 2 is an absolutely phenomenal game in every way. The only nitpick I have is that its a bit short(I beat it in 6.8 hours), but my god it was so good I don't even care. BUY THIS GAME! 10/10!",
            "review_score": "1"
        },
        {
            "review_text": "amazing,super fun and excellent gameplay with good story.",
            "review_score": "1"
        },
        {
            "review_text": "Great campaing, was alot of fun. 8.5/10 would eat hearts again.",
            "review_score": "1"
        },
        {
            "review_text": " its not hentai dont worry",
            "review_score": "1"
        },
        {
            "review_text": "Terrific graphics with Good storyline, most amazing Comic - to- game adaptation ever",
            "review_score": "1"
        },
        {
            "review_text": "Wow, it's good but I got it off  {LINK REMOVED}  ♥♥♥.com  for under a buck not for thirty!",
            "review_score": "1"
        },
        {
            "review_text": "Who doesnt want to become a ♥♥♥♥ing crazy Op deamon creature and go around killing gangsters and mob wanks alike . Pretty fun game but doesnt really have much re-play ability , so you play it once and have great quality bants . Worth a play at least . easy to run , like you could take a burnt out gt 430 and still run this on high ...♥♥♥♥ this game is easy to run but i digress , fun comabt and pretty decent story but dont play if your either : - christain - a jew - a ♥♥♥♥in loser - or canny take a wee joke ya poosay  so yeah take that in mind before you buy , but I would reccomend this game , and papa bless ya shiters",
            "review_score": "1"
        },
        {
            "review_text": "Criminally underlooked. One of the better shooters to be released in 2011, featuring bombastic gunplay and a great story. Also very short, play it if you want to scratch your backlog. Not much to do with the first game, but it's not necessarily a bad thing.",
            "review_score": "1"
        },
        {
            "review_text": "Criminally underlooked. One of the better shooters to be released in 2011, featuring bombastic gunplay and a great story. Also very short, play it if you want to scratch your backlog. Not much to do with the first game, but it's not necessarily a bad thing.",
            "review_score": "1"
        },
        {
            "review_text": "so far so good...i love it when the Darkness talks :D",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. Worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting storyline, bloody gameplay, but it's waaaay to short (4.5 hours of campaign) and controls are waaaaay ♥♥♥♥ed up. And yet - it's cool",
            "review_score": "1"
        },
        {
            "review_text": "Certainly a good game to be perfecly honest like a 7/10 kinda gets messed up towards the end and if you have not payed attention you will have no idear whats going on  DEFINATELY NOT WORTH £20   i compleleted this is 4.9 hours so take that into account but £3.50 on sale is acceptable",
            "review_score": "1"
        },
        {
            "review_text": "why is not whiteness 2 ? ♥♥♥♥♥ racist game",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games of 2012.  Pros: - Top notch voice acting - Fluent and action packed gameplay with amazing gunplay - Surprisingly very good story - Additional Co-op game mode with it's own story and playable 4 characters - Superb triple A quality soundtracks  Cons: - Too short (5-6 hours) - Repetitive Boss fights - No promised DLC  All in All this is a great game with a lot of replayability , maybe not worth it's $29.99 retail price but sure as hell grab this title on a sale or in a Humble Bundle pack.",
            "review_score": "1"
        },
        {
            "review_text": "This game has a very good story and got me glued to my chair. With bit of gory kills here and there, great comic graphics and also great story...did i mention that yet??? oh yes i have....get this game guys, has a very good single player. As for multiplayer, think you will get mix reviews there as its kind of diffrent than single player, but same principal.. Either way, this is a good buy",
            "review_score": "1"
        },
        {
            "review_text": "This game was great... Mostly. The action-packed and humorous campaign is cut short as you mow down enemies for a few hours, just to find out you're already done with the game. Fairly sub-par gunplay, but The Darkness's arms add a whole lot more flavor and creativity to the mix.   I'd buy it again, but I wouldn't pay more than $10 due to the replayability of the title.",
            "review_score": "1"
        },
        {
            "review_text": "It's fairly short, but a well made very stylized FPS with decent voice acting and interesting story presentation. You use guns and demon arms to kill enemies, earning essence points which can be spent in talent trees to unlock a wider variety of killing methods. There's also a british darkling minion that follows you around, ♥♥♥♥♥♥♥ on corpses, wrapping around people's legs to hinder movement, ripping their throats out, etc.  It is almost an inverted version of Alan Wake with questioned sanity, but this time destroying and avoiding lights instead of fleeing toward them. It also has some similarities with Bulletstorm given the short length, upgrade currency for kills, focus on kill variety and the grab mechanic.  Overall it's a well done crazy diversion for when you want something just a little more than an FPS experience.  If you have an XInput gamepad, you may want to unplug it while playing this or the buttons will always be shown instead of the keys.",
            "review_score": "1"
        },
        {
            "review_text": "Great fps but multi is dead. Probably not worth for full price but definitely worth during a sale",
            "review_score": "1"
        },
        {
            "review_text": "i loved the original on 360 and ps3 so when i heard it was being made by a new company i was worried but this game is actually very well made. worth the price!",
            "review_score": "1"
        },
        {
            "review_text": "Co-Op is sick! single player due to the characters unique darkness powered weapons (Katana, early 1900's style double pistol, a 'Mystic' style Skull on a stick... and a very 'Thors Axe' type of weapon) each character is amusing for the 4 player co-op and some missions are allowed to be played 1 player to try out the characters etc, they all have ups and downs, but The Japanese Wielding the katana is my favorite, the darkness weapons to 'Eat Hearts' and execute rathe the alien type growths out of Jackies Arms in Single Player; which great as well, to me if I had to grade, Single Player would get a solid 85 (the story is VERY good as are the missions, just too short, MIKE PATTON Voices 'DARKNESS') whileCo-Op a solid 88-90; may raise, but many missions are locked until others are completed or SP is fully completed, will update!!",
            "review_score": "1"
        },
        {
            "review_text": "For just a mere 7.49 you too can be bored right now with weak guns and repetitve banter and 'super cool gross' kills. Over and over and over and over and over.",
            "review_score": "1"
        },
        {
            "review_text": "The Darkness 2 is short but otherwise a great game, the story is intresting and the gameplay feels fun but unfourtantly can be glitchty at times pretaining to the darkness' arms.",
            "review_score": "1"
        },
        {
            "review_text": "A fun adventure to experiance when you feel a bit deep in emotions and evil. This game allows you to become a path of destruction as nothing can stop you, nothing but a greater evil wanting to use you for nefarious purposes. They messed your entire life up, how will you take this?",
            "review_score": "1"
        },
        {
            "review_text": "Darkness II is bad ♥♥♥! I never played the first one so I didn't really know what to expect. It's complete evil--torture, mutilation, humiliation, and death. The campaign is depressingly short, even though the action is tight and the story is a complete trip. That's the trend nowadays--charge more...provide less.  The graphics are slightly cartoonish which I'm pretty sure was the effect they were going for since the game is based on a comic book. Voice acting is well done. There is a separate 4-player coop campaign element which is pretty fun, but I haven't fully experienced it yet due to a lack of players. All-in-all it's a pretty amazing game, but the short campaign didn't allow me to unlock all the special abilities in a single play through. Not that I won't enjoy playing it again!",
            "review_score": "1"
        },
        {
            "review_text": "fun shooter, gory as hell. awesome story.",
            "review_score": "1"
        },
        {
            "review_text": "The angst-fueled action junkie's dream game: a first-person shooter where you're one part Scarface and one part Satan. It's goal is to make you feel like an unstoppable train of supernatural violence and it does so with sadistic glee. A mass of vaporous snakes surround the player that hack enemies to pieces, throw objects to crush or impale them, or drag them away to be executed in grisly fashion. Area-of-effects like insect swarms and black holes are showboatingly overpowered in their ability to rend apart large groups of enemies. Even the standard gunplay, which includes dual-wielded weapons, can be assisted by the Darkness in turning your gunshots into wisps of energy to reduce adversaries to soup. The environments have been simplified a great deal from the original and its stereotypical comic book plot and machismo grit are turned up way past eleven. Other action titles have tried to make you feel like a monstrous force of nature, but none of them are nearly as successful as The Darkness.",
            "review_score": "1"
        },
        {
            "review_text": "A more than worthy sequel to the excellent The Darkness. Combat is very much like Bulletstorm, but where the game really excels is in the stellar voice work, the characters and the story. The game is filled with brilliant scenes that will stick with you long after the credits have rolled. The main story is pretty short, at about six hours. HOWEVER, it's six hours of constant brilliance, not a dud moment along the way.   On top of that you've the excellent Vendetta mode, which is designed for co-op but can be played single player, with four new characters, each with their own unique weapons, abilities and talent choices and they even have their own brutal kill animations. I'm a big fan of Shosanna's one. Vendetta mode also fills in parts of the story that weren't fully explained during the main single player, so it's really worth playing.  Basically, buy it. It's totally brilliant.",
            "review_score": "1"
        },
        {
            "review_text": ":)",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games I ever played, play it and you will know why",
            "review_score": "1"
        },
        {
            "review_text": "This game is easy to run and it is so fun! Fromt he skill tree to the gameplay I feel like everything is put together nicely and makes the game really fun.",
            "review_score": "1"
        },
        {
            "review_text": "I just finnished the campaign and i really gotta say im impressed with the story, i did read some treads that it is too short but im glad they did not add additional stuff just to extend the playtime, that would be like adding an hour to a good movie filled with not important thus not that intresting material. It got me facinated all the way trough. the combat system is very well done imo i did not really expect it to work that seamlessly, only issue i did had was the FoV, i dont usually have such a big issue with it, but maybe it is because there are more obstacles close to the players perspective narrowing vision even more like the tentacles and stuff, wich resulted in headaches  I really do hope that the DLCs planned will contain extra content like a additional campaign both singleplayer and multiplayer and not just some skin crap and stuff. Or maybe even an expantion   Would deffinatly recommend this game to anyone who likes single player games",
            "review_score": "1"
        },
        {
            "review_text": "Great awesome game to pick up for a discount. I don't mean that in a bad way, the Darkness 2 is badass, but sadly theres only just about 5 hours of game time the first run thorugh.   I still found it fun to go back an re-do some earlier levels at full power, but overall if you can rent it for the weekend, you got a great deal for a great game.",
            "review_score": "1"
        },
        {
            "review_text": "Not too bad of a game. Needs some downloadable stuff is all.",
            "review_score": "1"
        },
        {
            "review_text": "If you love tearing people limb from limb then get on this ♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "Incredibly great and dark storyline for anyone interested. It's a fun game with lot's of violence and gory action. Relatively short, but definately worth playing.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game to play. The keyboard mechanics aren't great but as good as it gets for a keyboard.  I love the way the story was told and the game develops. Besides that it is a descent shooter with a fun side and a little gore side but overal it has good balanced gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "Ever think: 'My arms are useless, why do I have two of them? If I had two more I would have so much more fun in life'? Well this game is the solution. The Darkness 2 gives you two snake like arms to rip your friends in half and then eat their hearts as they giggle their life away. It doesn't end there though. You also have an arsenal of love firing cannons at your fingertips disguised as guns. They may look, sound, and bleed like they are dead but trust me they are just really happy and you are looking at it from a really negative point of view. I need to get meself a pair of these amazing slythering arms because then I can share the fun with the world. Ever wanted to have everyone love you and give their hearts to you? Now this is your chance. :D  In all seriousness you do kill a lot of people and they usually don't mind when you rip their hearts after because they no longer need them so there is a positive there...",
            "review_score": "1"
        },
        {
            "review_text": "Wow. Where do I begin? I started this game expecting a shoot em up style game, and nothing more. I was so wrong. The story to this game was one of the best I've played through in a looooong time. The attention to detail in the game has not gone unnoticed or unappreciated. All the little animations they threw in everywhere make me warm and fuzzy inside. This has become one of my favorite games. Do get. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Great shooter with an entertaining story. Definitely worth picking up",
            "review_score": "1"
        },
        {
            "review_text": "One of the most amazing games I ever see, the game is amazing and the end is awesome.",
            "review_score": "1"
        },
        {
            "review_text": "Just finished The Darkness II. In a word it was epic and it's completely open to a third game, which makes me quite happy. 4/5 gameplay 5/5 story. I recommend it 100%",
            "review_score": "1"
        },
        {
            "review_text": "The campaign for this game is only 5-7 hours long depending on what difficulty you play on and if you try to collect all the relics. The graphics are great, the characters are well written and voiced, the gunplay and darkness powers are satisfying and go extremely well together. Could not recommend this game enough.",
            "review_score": "1"
        },
        {
            "review_text": "Its brutal and dark.No one say its easy to be badguy.Im suprise how good this game was.Great story and voice acting i love how they try to mess with your mind.Graphically its also good,not the best you can see,but it hold comics atmosphere.Abillities how to kill enemy is impressive and somethimes little bit messy :-) I think this game is little bit underrated. Good FPS 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely amazing game, one of the most brutal games I've played in a long time. I understand that this game is old but I played it on the xbox 360 when it was still fresh and completed it in one day. On the PC I have been experiancing some bugs where it disables me to move but a few seconds of button spamming gets me through it, such as when you play as the darkling and you're in the vents there were edges I couldent walk over and had to try and jump over. overall I'll give it 7/10",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game with solid graphics that give it a good feel and just enough gore to keep the average gamer going for a while. Though the story is a bit short the story line is simply amazing and it is easly one the funnest games i have ever played. This is one of those games that give you the feel of the character it gets you locked in with the story and you just wont want to put it down.",
            "review_score": "1"
        },
        {
            "review_text": "enjoy fps? wanna know what it feels like to have two more limps? wanna know what it feels to be the OP bad guy? then this game is definitly what ur looking for!",
            "review_score": "1"
        },
        {
            "review_text": "A fun sequel with brutal kills and a nice celshaded style.",
            "review_score": "1"
        },
        {
            "review_text": "This game is so good, but the campaign is way to short, only took me 4 hours to beat. So for $40 it's not worth it, so wait until its on sale and you'll probably get a good price.",
            "review_score": "1"
        },
        {
            "review_text": "Not nearly enough gore for me. Still, I recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "awesome game and one hell of a story with some awesome graphics qaulitty like borderlands but better",
            "review_score": "1"
        },
        {
            "review_text": "Graphics: As a huge fan of cel-shaded graphics, amazing. 9/10. The graphics are extremely well done, and perfectly portray the characters and locations in a fashion that is very true to the graphic novel.  Gameplay: 7/10. The shooting mechanics are pretty good, I would call them satisfying, and the darkness powers are fun to use. However, the combat is somewhat repetitive and is in the style of an 'Arcade shooter' which I find to be tacky.  Story: 8/10. Although the story is somewhat cliche in certain ways, it's overall quite interesting and the main character is great. The game is based of a graphic novel of the same name, which I enjoyed, and the game tells the story with just as much narrative artistry.",
            "review_score": "1"
        },
        {
            "review_text": "The darkness II is a direct sequel to the first game, sadly the first game never got released for pc but when you start the game you can get a quick explanation of what happened in the first game in order to catch up a little. The story is about Jacky Stockado a mafia boss who inherited a curse in his lineage called The Darkness, this time around the darkness is taking over jack's mental sanity while at the same time there's a new threat to him and his family. There's not a lot of gun variety but the gameplay is still quite fun, chopping dudes to pieces , impaling them, cutting them in half with a car's door , etc. Totally recommended, ending will desperately leave you wanting for a sequel, sadly we might never get a sequel.",
            "review_score": "1"
        },
        {
            "review_text": "Yes, This game is f*cking amazing!   Pros: DEMON ARMS!!! Fun Duel-Wielding of Hanguns/SMG's Fun to play. Very well written story-line. Not Complicatede Game is mostly slaugetering your enemies. Fun Upgrades.  Cons: Short Campaign. Vendettas are also short. The Ending was OK... Can be a little repetitive for some. Not exactly worth $30 bucks, GET IT WHEN IT'S ON SALE!!!  ",
            "review_score": "1"
        },
        {
            "review_text": "Like the first game, really great story. The art direction in this one was a bit strange to me, but it ends up working well in the end. A third is greatly desired, though, unfortunately it'll probably never come.",
            "review_score": "1"
        },
        {
            "review_text": "Definitely enough difference between this game and most shooters. Play it for the cool story and stylized visuals. The coop is pretty fun too. Worth a look if it's on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Great games, no regret playing dis",
            "review_score": "1"
        },
        {
            "review_text": "This game taught me a lot about something, except the gore things",
            "review_score": "1"
        },
        {
            "review_text": "Nice style fps game. Fun to pick up and play whenever you like.",
            "review_score": "1"
        },
        {
            "review_text": "i3-4150, EVGA 750ti Superclocked ITX system.  Resolution: 1920x1080 Graphics settings: Max/Ultra Average framerate: 60 fps with vsync. Never noticed a single drop.  Input device used for game: Mouse and keyboard - tried my Xbox gamepad as well and it has full support!  *Spoiler alerts*  Let me begin with this: this game is definitely not your average shooter. It will certainly feel like it at first, but be prepared for a game brimming with subtle art and literature references .   The Darkness II plays and feels almost like the controls found in the Bioshock series, but with a neat twist...You can use both demon-tentacle-head melee attacks and dual-wield pistols simultaneously. I honestly haven't had this much fun since classic Shadow Warrior and Rise of the Triad. It has a pretty unique visual style that borders between actual comic book and cel animation. Digital Extreme's in-house Evolution Engine is extremely well optimized and the use of light (and darkness) and shadows are second to none. To be honest, I was not impressed by Jackie Estacado and his entire crime family. I very nearly stopped playing the game. They were all run-of-the-mill and BASIC ♥♥♥♥♥es. Once you discover that this is simply a delusional fantasy of a man at a sanatorium , things begin to become interesting. The attention to detail in this game is another aspect that I enjoyed thoroughly: The radio in the room. The phone conversations people have that give details about the story and make you wonder if you're insane. The really neat Lovecraft short film in the rec room. The paintings. My Ravioli's Too Spicy! (Pay attention to this, it's a hilarious overlap) The Darkness is a metaphor for mental illness and I'm pretty sure that this illness is hereditary as there are references to his father attempting to find a cure for the darkness for himself and his boy. In closing, the transition and overlap between real-life and fantasy is very well implemented, and in my opinion was the most interesting part of the game. The ending was sort of ridiculous, but all of the other positive aspects definitely made up for it.   8.5/10   ",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, quite short but still very enjoyable. Something you can come back to in the future and play again. Hope they do a 3rd one, as this was much better than the first.",
            "review_score": "1"
        },
        {
            "review_text": "Game nearly perfection! 10/10 + Story!! and cut-scenes Delusions mix with reality Funny and psychopatic companion Music!! Climate of vengeance Powers Enviroments, dark-light system Comic-style graphic  - non? mayby too short but it's so intense so u got impresion of x2 time spent on gameplay",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed the story as well as the atmosphere in this game. Many say that you should play this game with a controller but the keyboard/mouse controls are spot on. It really does feel like you're in control of the character. I highly reccomend this game.",
            "review_score": "1"
        },
        {
            "review_text": "Hi, my name is Phil. I was born and raised in Kentucky. When I was 7 years old I walked in on my mom giving a BJ to my best friend's dad, Jim Whit. My mom, Sugar (her actual name), would tell me stories of my mentally challenged father that she accidently got the little hot dog slipped from. One of those many visual stories was when he came home from a gay stripper club that he thought was his new workplace. Don't ask me how he got a job. My mom would never let me into this room upstairs, that whenever I went up to peek under the old worn door I would see these black tight leather clothes. She would bring asian, black, white, and mexican men who had a low self-esteem into the room to 'play' with. Many times have I walked on my mom being ganged banged, taking it from all sides. I could always hear her grunting upstairs and even hear her lodging things in her ♥♥♥♥. Yeah, I know, sick. I ran from my home at the age of 16 years old. I had no money and barely any clothes. At 14 years old, I took a knife and stabbed a man in the spine while he was banging her analy, paralyzing for life. He had it coming. Those no life ♥♥♥♥ faces who banged my mom didn't deserve to live. Any ways I'm 16 years old and I have ran away from home. In the impoverished part of the city was a run down apartment that I lived in till I was 18. After I had left the apartment I moved to the ghetto and joined a gang. I quickly earned 5 tears on the right eye and 1 on the left eye from when Martinez, a very close member, was brutally killed. Now I was actual white trash. Thank you for reading my Darkness II review.",
            "review_score": "1"
        },
        {
            "review_text": "They made a game all about killing enemies with evil powers in violent and spectacular ways, and then wrote a story that supported it. Fast-paced, action-packed, fairly sympathetic characters. It's a bit too short, though.",
            "review_score": "1"
        },
        {
            "review_text": "Just awesome",
            "review_score": "1"
        },
        {
            "review_text": "Damn good. also has 4 player coop, so hit me up when you do get it.",
            "review_score": "1"
        },
        {
            "review_text": "Nice graphic style, fun gameplay, worth a run",
            "review_score": "1"
        },
        {
            "review_text": "Wow sick cool great awesome",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game if you love a fast phased shooter with lots of gore and blood, just a few minor bugs that i wish wasn't in the game.",
            "review_score": "1"
        },
        {
            "review_text": "you get to kill a oh ♥♥♥♥ what more could you want in a game???",
            "review_score": "1"
        },
        {
            "review_text": "The total amount of time it took me to play through the game is as you see. 5 whole hours.  Now normally I would be pretty irritated with a game only having 5 hours worth of gameplay. It's pretty absurd, even for a shooter with some RPG mechanics. However, I purchased this game for 80% off, so it was a steal on my end, and 5 hours for a game that was less than $10 (far less if I recall), isn't really all that bad of a deal.  On to the meat of things.  The game graphics are pretty good, nothing spectacular, but even after 8 years they still had their appeal. The game is extremely graphic for kill moves and blood/gore, so if you're a gorehound you shouldn't be surprised as a basic mechanic in the game is ripping out hearts and eating them.  The big thing for me in this was the gameplay though. It's fast and furious and never lets up. The tentacle controls are fluid as are the handling of the weapons in the game and both are easy to grasp and quick to master. The difficulty of the game isn't broken (which is always a plus) and even when you die you don't have to repeat massive chunks of the game over again (which is also a plus).   Story...well...okay so here's the thing. The story is kinda blah, not bad, just blah. Sure it has its moments, and anytime Jackie gets to sit in the dark smokey room and talk for a bit I'm all ears, but it's still blah, or rather, generic if you will. This game follows the aftermath of the first Darkness, of which I only played through the tutorial. I was sidetracked with other games at the time and just overlooked it, so it never got the playtime it deserved.  The story compared to the comics is pretty spot on. Power wise, probably not so much as the comic version is pretty much godlike, and while in this game you're no push-over, you're not a god either. But hey, that's where the fun comes in. There is enough progression using their power trees to allow you to be awesome with guns, awesome with the Darkness, or handy with both. Of course the game offers you the option to continue playing after the story is over using the 'newgame+' feature which will make you feel like the powerhouse everyone claims you to be should you go back and play this game sometime down the road.  The ending to the story was a bit of a let down, and somewhat silly, and featured some re-skinned models of baddies. But that's pretty much the whole game. No real enemy variety combat wise until you're 70% done with the game, and everything is just a re-skin of the same basic model. It's a shooter, so I don't expect much, but I do expect demons to be a little different from the mobsters in the game and not just a re-skin of the mobster and his gun. Give me some crazy flaming sword guys, or flying tentacle creatures or something!  I only recommend getting this game at it's discounted times, as the full version will leave you with a little bit of a disappointed feeling.",
            "review_score": "1"
        },
        {
            "review_text": "Kinda short but worth every cent, i miss the old games where you needed weeks to complete them but...this is a story based shooter and quite a unique game so no need to make it to long with the risk of it to become boring. First game where you controll 4 hands and the control it's perfect but sometimes instead of hearts i collect weapons by mistake ... The story it's very good as expected from 2kGames.",
            "review_score": "1"
        },
        {
            "review_text": "Fast paced, awesome adventure, and load of fun, The Darkness II turns up the heat compared to the orginal sequel. Awesome voice acting, and crazy ways to kill all over the place...., Only downside is... It's very short, and leaves you wanting more! Come on 2K, fight for a sequel! :D",
            "review_score": "1"
        },
        {
            "review_text": "Just my type of Game, dark and gritty",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic story but pretty short.",
            "review_score": "1"
        },
        {
            "review_text": "a really good game the multiplayer is kinda dead but its a good solid shooter",
            "review_score": "1"
        },
        {
            "review_text": "A very fun game 7/10.",
            "review_score": "1"
        },
        {
            "review_text": "Great action, great shooting, nice graphics. Surprisingly colorful, cool comic style. Interesting story, though some sequences between levels are a tad slow. Collectibles were interesting and the dark essence progression system, while shallow, was still a commendable idea. Short and sweet (not a bad thing). I wasn't as blown away by this game as I was by the first, but still, this game was great, gorgeous, gruesome fun!!! The Darkness 3 please!",
            "review_score": "1"
        },
        {
            "review_text": "It's short, and the controls for PC are a little tricky (can probably be improved using mouse 5 mouse buttons) but it's a hell of a lot of fun. So go play it 'monkey'",
            "review_score": "1"
        },
        {
            "review_text": "Despite it's short length this game packs a lot of fun and feels into a story. I never played The Darkness, but I caught up in the intro. It's a great game nonetheless, but do pick it up on a sale. As it is very short with little replay value.  8/10",
            "review_score": "1"
        },
        {
            "review_text": "The Darkness II is quite the mixed bag. The graphics are nice, like playing a comic book. The combat is also pretty good, getting to use the things on your back to rip stuff to pieces. It has a nice skill tree with lots of options, and there is a new game plus so you can max out that skill tree. On the downside, the enemies are bullet sponges, resulting in lots of cheap deaths. Plus half the time you can't even see where they are shooting you from until there is one right up next to you, and by that time, boom you're dead. It is extremely frustrating, especially since in a game like this the action sequences are only there to move the story along. Or maybe its the other way around. I don't know. I got this on sale for 5 bucks. 30 dollars is way too much to pay for this, as it is overly short. I do believe it helped me to become a better gamer, overcoming its challenges despite the frustration. Have not tried the multiplayer yet. Recommended.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of those series that benefits from playing the sequel first. The character models, voice acting, gunplay and overall control are all greatly improved over the first game to a point of absolute fluidity and brings you into the universe in a much better way. This is a decent re-adaptation of the comics but fans will be unsatisfied by having only one darkling, which is even less than the first game. Plenty of familiar names and faces from the comics.  Anyone not willing to jump to consoles to play the first game wont be missing out on too much, the prologue explains just what you need to know in a straightforward way and the story doesn't rely all too heavily on previous encounters.  This game manages to slip its story on you while you're multilating anything and everything in a way that holds onto you until the end; Whichever ending you get will leave you wanting more. Compared to the first it's much more linear and plays more like an arcade shooter, but the first game's small open world often suffered from terrible pacing because of slow walk speed so the change is welcomed.  All this said against the previous game, but it isn't necessarily bad. It's a somber, noir style compared to the Darkness II's raw, bloody, cel-shaded multitasking gameplay. If you like this and want more the first is a safe buy, but not without its problems. I want part 3.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely amazing game, one of the most brutal games I've played in a long time. I understand that this game is old but I played it on the xbox 360 when it was still fresh and completed it in one day. On the PC I have been experiancing some bugs where it disables me to move but a few seconds of button spamming gets me through it, such as when you play as the darkling and you're in the vents there were edges I couldent walk over and had to try and jump over. overall I'll give it 7/10",
            "review_score": "1"
        },
        {
            "review_text": "A FPS that brings in new elements to spice up the genre in this game, the powers gained from the darkness create fun and intense gameplay which as i said gives a great change to the standard fps. Upgradable powers with a new game+ create at least a second play through just to become a walking tank even if the fun and gruesome gameplay wasn't enough to bring you back. The story along the way was good as well, maybe a little cliché and obvious but still enjoyable. Little things like collecting relics was fun as well, giving bonus to upgrade points as well as giving a humorous and interesting delves into the lore behind the game. Well worth the money and time, highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Really really good, it's a shame it couldn't have been longer. This game has great fighting mechanics, cool looking graphics, and a very intriguing story. It's solid all around.",
            "review_score": "1"
        },
        {
            "review_text": "Nice style fps game. Fun to pick up and play whenever you like.",
            "review_score": "1"
        },
        {
            "review_text": "i love this game 10/10 amazing story and loved the plot twisted but .. if they dont make a darkness 3 ...0/10 &gt;:0 how it ended there MUST be another one",
            "review_score": "1"
        },
        {
            "review_text": "I get to do to people what my ex did to me.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Great game!  Beautiful visuals and gameplay with an interesting plot with amazing relatable characters, that makes you want even more to finish the game. Just one drawback for me, the game is really small you can finish it in about 6 hours.  Truly recommend this game!",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, but has a console/arcade feel to it. Story was good, but kinda short.",
            "review_score": "1"
        },
        {
            "review_text": "I picked up this game for $1 from a humble bundle a while back and only just got around to playing it. The storyline, though phoned-in, was entertaining. The gun and darkeness combat still feels fresh (I played the first one on Xbox 8 years ago). It is a quicker campaign than most single player driven FPS, coming in at 6 hours for me on Hitman (difficulty 3/4). I died an awful lot at times and occasionally I felt cheated. Getting used to the enemies with light was a constant struggle for me.  If you find this on same for $5 or less, I'd say it's worth picking up. I wouldn't go any higher than that though.",
            "review_score": "1"
        },
        {
            "review_text": "This games throwing objects mechanics is ♥♥♥♥ing incredible especially the poles which are so satisfying",
            "review_score": "1"
        },
        {
            "review_text": "I was a die hard The Darkness comic collector and though I stopped collecting all together I never got rid of my comics and when I found out that they had made a The Darkness pc video game I was skeptical as to how good the story, graphics and game play all around would be... WELL WHEN STEAM HAD IT FOR $4.99 at 85% off I jumped.... Really good game for being a few years old and this is the 2nd release, I never played the first one... THE MOVES JACKIE ESTACADO CAN DO WHEN HE SUMMONS THE DARKNESS ARE FROM NORMAL TO UNBELIEVABLE... of course you have to earn points/credits to purchase each attack or special ability add ons to his weapons and health.  All in all I give it an 8.5 rating.... would be great if a big video game company would create a full blown BF4 or CoD versions as far as graphics and smoothness... I LOVE IT...",
            "review_score": "1"
        },
        {
            "review_text": "It's some way better than the first, very nice!",
            "review_score": "1"
        },
        {
            "review_text": "Nice plot, unusual storytelling, cool gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would impale people again.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great if you're just looking to feel like a basass, on top if a great story, you've found the right game. Only problem is the games short lifespan. 7//10",
            "review_score": "1"
        },
        {
            "review_text": "The Darkness II is a rly good game ! nice and fun 7 h of play ! story-7/10. gameplay-7.5/10. the emd of the game was the most fun part of all the game.  if you want to find out why you will need to get in to the end of the game. :D i will not say its worth buying the game for full ptive. but if you can get it for 10 $ or less go for it.",
            "review_score": "1"
        },
        {
            "review_text": "  Sorry if i took a few weeks for a full review, even if it's not a full review yet. The Darkness II is a creative, obviously dark, well-written, gory, fun and fast-paced FPS sequel to the also amazing game, The Darkness. This time around for the PC, though. It is surely, one of the best stories ever seen in a FPS game, and one of the most dark, and gory games that the gaming industry will most likely ever see. While a full review won't be coming out any time soon, i'll give The Darkness II the rating it deserves.  10/10 ~Embrace the Darkness!",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely loved it! Despite the AUS steam overpricing, it's a wonderful single player experience that I have been craving. By the time the game came to a conclusion the story was incredible, the action was fantastic, the variety of guns was just perfect and the skill tree's keep it all the more interesting. Cannot wait to play through it again. The only cons I can think of is the overpricing. It was approximately 10 hours in gameplay length, but It has its incentives to play through again. 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed this game. You should purchase it.",
            "review_score": "1"
        },
        {
            "review_text": "The Darkness II is a surprisingly good story driven FPS with RPG elements. It's one of the few I've completed 4 times in a row, and the only game I've play where I've gotten all of the achievements. The gameplay is very fun and the story is absolutely fantastic. The main campaign is short. It took me a little more than 5 hours to complete, but there is a side campaign and extra missions to complete afterwards. The Darkness tentacles go along well with the guns to create a fast paced game, much like a hack n slash oddly enough. Overall, the Darkness II is a great game, one which I'm glad I spent my money on. I recommend playing the first one, though you DO NOT need to play it in order to enjoy this game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is so good, but the campaign is way to short, only took me 4 hours to beat. So for $40 it's not worth it, so wait until its on sale and you'll probably get a good price.",
            "review_score": "1"
        },
        {
            "review_text": "You can tear out the spine by other people asses, chest, heads and throats. Fun/10",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite FPS. All the elements combine very well. The art style compliments the atmosphere, atmosphere compliments the story, the story compliments the gameplay. Great stuff.",
            "review_score": "1"
        },
        {
            "review_text": "This game is pretty good; I didn't really have high expectations, but after playing a few hours of it, the game got more interesting. The graphics are alright; maybe a little glitchy, but overall I still think it's worth playing.",
            "review_score": "1"
        },
        {
            "review_text": "Its hard to compare its brutality with other games, if you like splatter games and shooters, you will like it. Cell-shading graphics are surprisingly good, you have to get used to controls, the story is ok, gameplay is good, but its short, 5hours are damn short. 6/10",
            "review_score": "1"
        },
        {
            "review_text": "Good story line, repetitive gameplay. It's real fun to play and the powers are cool n all, but I feel in a game like this you be able to become 'all powerful' if you upgrade all of your stats. That being said, I do not feel all powerful. The mechanics are great and I love the way the game conveys the cartoon feel, but the gameplay gets tedious and I rarely want to play more than an hour, two hours tops.",
            "review_score": "1"
        },
        {
            "review_text": "The glorious, glorious blood.... The Darkness 2 is a worthy sequel to the original game, it's story is heart-wrenching (Or eating in your case) as Jackie, now in control of the Italian Mafia goes on a quest to defeat a mysterious man with a limp. If your a horror fan like I am, this game's for you.",
            "review_score": "1"
        },
        {
            "review_text": "Got to ride a ghost train 10/10",
            "review_score": "1"
        },
        {
            "review_text": "it´s a realy good game yes it is short but you will enjoy it wille it lasts.",
            "review_score": "1"
        },
        {
            "review_text": "Top Action Top Grafik TOP TOP TOP",
            "review_score": "1"
        },
        {
            "review_text": "Ever wanted to quad wield but couldn't because you were born limbless or just had two arms? now you can, you also look like a school shooter so thats a plus",
            "review_score": "1"
        },
        {
            "review_text": "Good game, good story, and reminds me of the time when I was refused by the girl.",
            "review_score": "1"
        },
        {
            "review_text": "Solid shooter with tons of gore and ''waahhh Jenny''. NOICE.",
            "review_score": "1"
        },
        {
            "review_text": "Stressed? ♥♥♥♥♥♥ off? This game is perfect to go to if you've had an all-round crap day.",
            "review_score": "1"
        },
        {
            "review_text": "This game was AWESOME. The single player campaign was about 5 hours of non-stop slaughter. The plot was solid. You have a wonderful mix of traditional guns, dual wielding and then 'darkness' powers. There are a variety of gruesome finishing moves, lots of special abilities, and talent trees for you to get even more new ways to kill things. The more creative you are, the more points you get, the more fun you have. It's a lot like Bulletstorm, which if you haven't played, you should. Another great game. After the main campaign there is an entire other bonus campaign that you can do alone or co-op. That, plus the random extra mini missions added another 4 hours of gameplay for me. It also has a new game + mode so that you can keep going and max out all of your talent trees. Awesome game that goes on sale, so keep an eye out!",
            "review_score": "1"
        },
        {
            "review_text": "This quad-wielding business isn't just a marketing catch-phrase. It actually works really, really well. You'll have a ton of fun shooting/impaling/slashing/generally destroying dudes in this.   Beautiful artstyle, interesting story and, of course, Mike Patton (in fact, the voice acting is remarkably good, on the whole).",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game to play. The keyboard mechanics aren't great but as good as it gets for a keyboard.  I love the way the story was told and the game develops. Besides that it is a descent shooter with a fun side and a little gore side but overal it has good balanced gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "Clever aesthetic polishing, incredibly brutal finishings and actions.. If you like the genre of FPSTU (First Person Shooter and Tentacle User) you will find this game unique ;-)",
            "review_score": "1"
        },
        {
            "review_text": "Really enjoyed the gameplay, The story is so sad &amp; tragic, But thats what makes the game so beautiful... (Just buy it and dont make spoil things)",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, but has a console/arcade feel to it. Story was good, but kinda short.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, pulls you into the story completely",
            "review_score": "1"
        },
        {
            "review_text": "I really like this game a lot. From the visual graphic novel style graphics to the gun and tentacle toting game-play to the stereotyped mob characters to the much better than average voice acting this game has provided me with hours of entertainment. The game isn't perfect but it's a hell of a lot of fun. The story is just deep enough to keep you interested, the characters are just deep enough for you to actually like them, the environments are nicely varied but the game play is it's strong point with it's unique 'quad wielding' combat. All in all everything adds up to a game that I will definitely play more than once",
            "review_score": "1"
        },
        {
            "review_text": "Embrace The Darknessssss....",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game, I recommend it.  If I had to post a criticism, I would say I wish the game took a little longer.",
            "review_score": "1"
        },
        {
            "review_text": "This is a pretty good game I would give it an 8/10 the story is pretty good, visually the game is amazing, and its alot of fun. The story line really pulls you in and leaves you with alot of questions. There were a few things that were not so good. In some of the more confined areas of the game I would have to spam space bar the proceed through the level. There's not alot of varitey in the weapons you get and even the darkness powers get a little bland over time. The ending also sorta leaves something more to be desired and without any news of a Darkness 3 game I would say you must be content with that ending. I do belive there is Co-Op campaign which is ok . Over all I would give it a playthrough or two. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "at first i had problems with the graphics but now they're fine ",
            "review_score": "1"
        },
        {
            "review_text": "A fun game with a good story, but way to short! 7/10",
            "review_score": "1"
        },
        {
            "review_text": "Before continuing I want to offer a word of warning: The game is abysmally short. It's so short that one could mistake it for an expansion pack to an existing game.  However, despite that rather huge shortcoming, it is a decent game that offers some interesting gameplay mechanics. The story is not shabby even though it deviates from the comic, but what will bring you back is the power of the Darkness. Although one could classify this game as a shooter it does offfer you the amazing power of the Darkness, which is only available, well, in darkness. This means that while you prowl in the shadows you are going to have some amazing powers. Playing through normal I felt almost like a god, and disposing your enemies with the powers at your fingertips is strangely satisfying.  Ultimately this is a bargain game. Get it cheap and you will not regret it. It will offer 4-5 hours of fun gameplay that might even leave you waiting for a sequel that offers a bit more of what is presented.",
            "review_score": "1"
        },
        {
            "review_text": "I have found a really great amount of replay value in The Darkness II. I enjoy the story so playing the campaign a second time was fun and im actually going through it a third time now just for the heck of it with all talents filled out and stuff.  Besides the campaign theres side missions you can do in Vendetta's or Hit's just to keep playing the game if you like its style and all that. Im not quite sure what the difference is between Vendettas and Hits. lol You can either play them single player or co-op with up to 4 players. Although you can solo play some of the missions i think most of them require at least 2 players not just because the game requires that but because the boss fights get pretty hard.  I love the abilities you get and the many different ways of killing enemies. Its pretty neat stuff. Its just a really fun game.",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun shooter with great anti-hero story. The PC controls are little off, but it does have good control support. The actual graphics have this nice cell-shading and has aged well. The combat with your darkness powers give you a lot of creative play styles, with a fun variety of bad guys and bosses. The story and game doesn't ware itself out either, at about 6 hours long it’s totally worth it.",
            "review_score": "1"
        },
        {
            "review_text": "Good game. Probably worth 15-20 bucks. Really fun but only like 5 hours long. Probably the most violent game I've ever played. Any game that lets you shoot a guy, pick him up with a tentacle, rip his spinal cord out of his ♥♥♥ and then use his pelvis as a projectile to cut another dude in half is okay in my book.",
            "review_score": "1"
        },
        {
            "review_text": "The Darkness 2 is a pretty good sequel to The Darkness. The gameplay is hectic, brutal, and gory. It's emphasis is taken off of using darklings and your tentacle arms to overcome obstacles and dispose of enemies in creative ways, and instead it focuses on simply massacring everything that moves. Unfortunately, it is shorter and more linear than the first, and the story is less appealing to me. The new cell shaded graphics look really good, but they somewhat detract from the realistic, dark atmosphere that made the first game look and feel as great as it did.   The Darkness 2: 8.0 / 10.0",
            "review_score": "1"
        },
        {
            "review_text": "Might be a short game, but it is so well-paced, excellent gameplay, story and all, top-notch FPS 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Nice plot, unusual storytelling, cool gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "This game is like no other FPS I've ever played before! The art style is gory and epic,reminiscent of 2K's Bordelands in lots of different urban and supernatural environments. Both gameplay and cutscene graphics are a pleasure to view! The storyline is captivating from the get-go,best I've seen in a while! Has you questioning your sanity,and which side of the story is real. Weapon and melee combat is spot on and hard hitting,with a variety of different guns,environmental objects to throw and 2 controllable arms at your disposal. Lots of upgrades to help make you more powerful. The only downside is this can be completed in 4-5 hours which is shorter than most games,but quality over quantity right? Worthy of a few playthroughs. This game is hard to explain,It's something that you really have to experience for yourself.",
            "review_score": "1"
        },
        {
            "review_text": "The game is really good. Ultra-violent fps with great gameplay and rpg elements. The story is very interesting and dark but short (about 4-6 hours campaign).  ",
            "review_score": "1"
        },
        {
            "review_text": "different look ,same feeling. If you loved the first Game like i did, this Game is a must buy.. (but don`t buy the German Version)",
            "review_score": "1"
        },
        {
            "review_text": "a beautiful story, a good challenge, and fun gameplay.  Tearing apart bodys and ripping heads off.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "9/10 Play a gangster with tentacles.",
            "review_score": "1"
        },
        {
            "review_text": "It's ok",
            "review_score": "1"
        },
        {
            "review_text": "Very nice game. The campaign is a bit short (8 hours or so), but very good story. completing on hardest difficulty on 1st playthrough is actually very hard (unlike other games). also has new game +.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely fantasstic, the gunplay is fluid, the demon sloth things are something like nothing else, plus it all looks like it came out of an album of The Gorillaz",
            "review_score": "1"
        },
        {
            "review_text": "While I do reccomend this game, It is far from a great game. The story has similar aspects to Alice in wonderland, But is terribly muddled by the combat and its length. If you were to remove combat you would likely have a 40 minute story that could easily be summarized within a paragraph. Beyond the story, The comabt feel like something that was just tossed in, rather than fine tuned to be fun. They had incredibly cool atacks for some things, but otherwise the combat was one note.  If you are in a mood for a Underveleoped Bioshock Infinte gameplay or want a mildly entertaining story, this game is what you are looking for. If it is on sale or if you have nothing else to play it definitely could be worth a purchase, but be prepared to Find it not as good as it could have been.",
            "review_score": "1"
        },
        {
            "review_text": "This should be at the start of any gamers first game list! 20/10 amazingg!",
            "review_score": "1"
        },
        {
            "review_text": "Love the story line I dont buy dlcs but for this i would have sad they cancelled",
            "review_score": "1"
        },
        {
            "review_text": "Very good game, but i felt that it was kinda too short. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Fairly short(only like 7 hours or so) for the story line, but its very enjoyable. If it goes on sale, I would buy it if I were you. Totally fun and a great looking game.",
            "review_score": "1"
        },
        {
            "review_text": "If you want to rip peaple limb from limb then this is your game",
            "review_score": "1"
        },
        {
            "review_text": "Decent shooter, decent writing. Runs pretty well most of the time, but it hits occasional spots that lag badly (like directly outside your office). Also, the characters's proportions are a little off - specifically, the hands.  All in all, worth the time, though.",
            "review_score": "1"
        },
        {
            "review_text": "Bloody brilliant, although I recommend an 360 controller for this one, as the default keyboard layout is a bit of a shambles, whereas the controller layout is immediately wonderful.  It's an FPS, It's satisfyingly violent, it's moderately intelligent, it's got a pretty nice art style and it runs as smooth as butter. Plus there's an entirely separate 4-player coop campaign to plough through too.  And you get to cleave a man in half and then throw his ♥♥♥♥ and legs at his fellow mobsters, knocking them off a scaffold. What's not to like?",
            "review_score": "1"
        },
        {
            "review_text": "Good story and gameplay. It's cathartic hacking enimies apart with your tenticles.",
            "review_score": "1"
        },
        {
            "review_text": "Eating human heart? 10/10",
            "review_score": "1"
        },
        {
            "review_text": "First off, I'd suggest buying this game on sale. It is very short. Too short actually. Paying five dollars is worth it, but at the original prive, no.  This game was a pretty nice time waster for the past few days. Intense, gory, and fun combat made for one hell of a ride. The story had me immersed. The level up system is basic and easy to use. I could go on praising this game. A massive improvment to the first title of the series. To make it even better, you can completely skip the first game and jump into the story without any problems. They even include a recap for the first game.  The faults come into play with graphics, the ending, and some characters. The graphics are a little to cartoony for my taste. I'd much rather see this game be a little more dark and gritty, which would fit the setting. The ending is a massive cliffhanger, one of the worst I've seen in my years of gaming. So unless you start reading the comics, chances are you'll never continue the story. Chances of third title are slim. The characters, minus a few, are all walking stereotypes. Everyone in the Jackie's gang are just cut and paste examples of mafia guys. The tough guy, the silent guy, the old guy, the loyal guy, etc. Kinda gets a little grating after a while. Also the story is really short, my playtime was how long it took me to beat it.   Overall, buy this game. Wait for it to be on sale, but buy it.",
            "review_score": "1"
        },
        {
            "review_text": "A very fun and exciting game that I have enjoyed a lot from playing. Has a good storyline and nice smooth controlls and the blood and gore adds to the fun of this game. I would recomend this game to anyone.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great. Good Storyline, Online Coop is fun, and the gameplay is fantastic. The bad thing is that the story isn't very long. But if you are planning to get this. Wait til its on sale, its definitely not worth $30. I got it on sale for $15 and loved this game",
            "review_score": "1"
        },
        {
            "review_text": "An OK FPS. Some unique tricks and ideas but that will take you this far. Short story / gameplay, not worth more than 5 euros.  Becomes boring after a while, no dramatic difference of using the 'perks / talents' you buy...",
            "review_score": "1"
        },
        {
            "review_text": "I really didn't expect such a good story in a shooter. It's got innovative gameplay and graphics that hold up well considering the age of the game. There are a few minor bugs (getting stuck, blurry vision) that can be fixed by switching VSync on or off (weirdest solution ever but it works). Also the controls take a bit of getting used to, but this shouldn't stop you from playing the game. I got this for less than $3, and recommend this game even at full price",
            "review_score": "1"
        },
        {
            "review_text": "This game is very good. It has a nice pace to it and is just a blast to play. I'm surprised this game kind of flew under the radar.",
            "review_score": "1"
        },
        {
            "review_text": "Very violent and very sweary shoot em/slash em up with great graphics and an interesting story. Short but recommended!",
            "review_score": "1"
        },
        {
            "review_text": "Extraordinary, one of the best FPS i have ever played. Supernatural concept and game mechanics are great success",
            "review_score": "1"
        },
        {
            "review_text": "It's good. Go play it.",
            "review_score": "1"
        },
        {
            "review_text": "The Darkness II, trully is an amazing game. Very fun mechanics, gorgeous graphics, good AI and excellent storyline.  Simply, one of the best shooters I have ever played. The main story falls a little short, but going for the achievements should keep you playing for longer. I recommend playing the first game before playing this because past events are being described and you might not fully understand what's going on. Over all, 10/10. Buy it now. ",
            "review_score": "1"
        },
        {
            "review_text": "Shooter spiced with rpg-elements, a good story and nice design.  Bloody and brutal, tasty!   Only downside  A bit Short and a massive cliffhanger at the end.  Pick it up on sale! Enjoyed it a lot.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good. Good history, good gunplay, good girl, good feels. Jenny a qt3.14",
            "review_score": "1"
        },
        {
            "review_text": "If this game was a potato, it would be a very good potato.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing Game !!! Very DOGE",
            "review_score": "1"
        },
        {
            "review_text": "2 thumbs up",
            "review_score": "1"
        },
        {
            "review_text": "Poor janitor, he deserved a better life  10/10",
            "review_score": "1"
        },
        {
            "review_text": "The Darkness II is not the most intelligent game I have ever come across, but it does manage to nail one thing in particular: fun. It has been a while since I have played a game so visceral and satisfying, but this game does all that and tells an interesting narrative to boot. That is what makes a shooter awesome. 8.4/10.",
            "review_score": "1"
        },
        {
            "review_text": "I loled at the end",
            "review_score": "1"
        },
        {
            "review_text": "Not too bad. Interesting story. I never played the first game.  Only 8 hours of gameplay and I beat it. It felt a bit lacking, like it needed more things to do other than shoot at stuff hehe.",
            "review_score": "1"
        },
        {
            "review_text": "whats there to say this game is a once in a lifetime game that you will ever play no bugs get it just get it , it was without a doubt one of the best games i have ever played",
            "review_score": "1"
        },
        {
            "review_text": "Nice game to play if you have nothing to play. Has a nice Story too, liked it, even without playing The Darkness I. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Great game",
            "review_score": "1"
        },
        {
            "review_text": "Pretty dark but not as dark as Bad Rats: the Rats' Revenge ",
            "review_score": "1"
        },
        {
            "review_text": "Feel like playing a game just shooting everything and killing folks with your dark powers?! Then this is what you want  Graphics are decent gameplay is fun story is standard ~ average line wait for it to go on sale like 75% then get it! You won't regret it! :)",
            "review_score": "1"
        },
        {
            "review_text": "quick action, lots of blood and gore, kick ♥♥♥ story, awesome characters, interesting and createive powers. nice comic book art style (if you like borderlands art style you will lve this.) the controls are easy to get used to and to pick up and play with having to remeber what button does what.  9/10  the only complaint i have is that the game is kinda short so get it when it's in discount",
            "review_score": "1"
        },
        {
            "review_text": "Played trough the singleplayer campaign was a blast! intelligent and sometimes disturbing story with some nice twists.   Perfect game for people who like shooters with a nice Storyline and some different gameplay mechanics. Also simple and awarding skill trees. ",
            "review_score": "1"
        },
        {
            "review_text": "Truly a great masterpiece.One of the best games i have ever played, so many cool characters, one of the best main characters i have seen in gaming history, amazing combat so satisfying every single kill feels powerfull, graphics are pretty good especially for a low budget game, great job digital extremes, you need to play this, cant wait for The Darkness  8.8/10",
            "review_score": "1"
        },
        {
            "review_text": "Here is my review of The Darkness II 1st off it is a amazing game with a strong storyline, even though the whole 'My girlfriend died I am in a bloodlust' is kinda steriotypic, Digital Extremes pulled it off in a sorta action movie storyline. Today's date is 4/9/2015 and the game was released in 2/6/2012. Mabey I am a bit of an old school gamer but games that had care built into the product *cough* *cough* Call of Duty has no care *cough**cough* can make a really great game, granted the story is about 2-3 hours long the exprience feels like days and weeks of work. Buy it no matter if it is on sale or not, for $30 it is worth your money. Hell, I bought the $90 pack for close friends and they all greatly apperciate the game. No matter if you like FPS shooters or not I strongly reccomend the game.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best most confusing campaign games i've ever played. Highly recommend this. No lies. Best game i've ever played. Can't wait for the DarkNess three.",
            "review_score": "1"
        },
        {
            "review_text": "Yes! Bought it on sale, but even without its a great game which offers a linear, but good, gameplay :)",
            "review_score": "1"
        },
        {
            "review_text": "I've been playing this over and over again. I can highly recommend this game to everyone.   I just love it and i'm constantly checking for updates and DLC. I want more!",
            "review_score": "1"
        },
        {
            "review_text": "An exciting game. I totally recommend it to anyone who wants to buy it. I have the Limited Edition and I'm really satisfied of this game.  10/10 ",
            "review_score": "1"
        },
        {
            "review_text": "A fun adventure to experiance when you feel a bit deep in emotions and evil. This game allows you to become a path of destruction as nothing can stop you, nothing but a greater evil wanting to use you for nefarious purposes. They messed your entire life up, how will you take this?",
            "review_score": "1"
        },
        {
            "review_text": "Best game i ever played . good mafia gamee destroyy everythingg and tear them apart !",
            "review_score": "1"
        },
        {
            "review_text": "A surprisingly glorious game, that is all about an evil hack and slash gameplay - I for one really love playing an evil character; in any game actually.  The bi-characters are funny, original and captivating. The story is.. not much to speak of, but it is all that you need. Unfortunately the playtime is only around 4 hours - On the up side though, it doesn't feel unclosed or unfinished; in fact, it's the contrary.  8/10 ",
            "review_score": "1"
        },
        {
            "review_text": "This is one of my favorite games, i have finished her once, and now this is my second time. I have also played the campain with a friend, but it`s too short.   Anyway i would give the game 10/10. Classic and well made. Easy to play.  - I haven`t played the first one yet, but i would try her ... xD someday.",
            "review_score": "1"
        },
        {
            "review_text": "of the best shooters ive ever played it needs a sequel",
            "review_score": "1"
        },
        {
            "review_text": "wont load on windows 10, crashes everytime. Says running even after i force quit. Please fix also cant get refund cuz its over two weeks old",
            "review_score": "1"
        },
        {
            "review_text": "Great Game, too short.  The darkness 2 was overall an excellent and satisfying experience. The game-play is great with a balanced skill system, great AI, and an engaging story. I would definitely recommend it as the game's notable combat mechanics and versatility, fun boss battles, and great characters and story make it a very enjoyable experience from beginning to end. However, the game is still very short and possible to beat in about 4 hours running straight through, and also has a rather frustrating cliffhanger ending. I only encountered about two or three minor bugs and a few camera issues in a small section towards the end throughout my play-through but nothing game breaking or that might deteriorate the experience, the game is very stable overall. The online vendetta mode is also entertaining allowing for 4 player co-op missions with friends, but the highlight of the game is still the campaign mode which you will want to play multiple times in the regular and new game+. Overall I would give The Darkness II a try, if you don't want to pay the full $29.99 for such a short game I recommend waiting for a sale or buying it now during the Halloween sale, you will be glad you did. Also if you are still undecided on whether you would like the game I would suggest playing the free demo since it provides a preview to the game's content.",
            "review_score": "1"
        },
        {
            "review_text": "When like gives you scary monsters coming out of you,you gotta use them to tear all the bad guys in half and eat there hearts ;)",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good game, though the Mac Version is terrible, there are parts in the game where half the environment is pitch black, so I can't see where I'm going. It took me an hour to find the door to a room that with light would only take few seconds to find. Overall though, the game is swell.",
            "review_score": "1"
        },
        {
            "review_text": "In fairness it was dark, but i did expect a little darker so i had to tamper with the brighness settings on my laptop pc mac book elite, after that though, quality was ensured and i was consumed by the darkness, the darkness of my computer screen that is.",
            "review_score": "1"
        },
        {
            "review_text": "I absolutely love this game! So much that I decided to buy it on Steam just so I can replay it again. I really do reccomend this game to people who like a good FPS with a solid story. Even if you've not played the first Darkness this game offers to explain the events for you which gives you an idea of what the darkness is and where Jackie was left at the end of the first game. Now compared to the PS3 version I have to say they could have offered better options for Mouse and keyboard players, instead you're given commands for an Xbox controller which leaves the player guessing which buttons work. I personally use my PS4 controller which is still a bit confusing but at least I'm not taking too long to guess the buttons. Due to this little problem I do recommend playing this game with a controller but if you really want to I'm sure you could work out the mouse and Keyboard controls.",
            "review_score": "1"
        },
        {
            "review_text": "Original and beautiful, great graphics and easy control with the dragons very cruel and lot of weapons to kill with them definitely one of my recommended!  hi this game have 2 ending  10 out of 10 ",
            "review_score": "1"
        },
        {
            "review_text": "wtf in retail shops this costs 2 dollars",
            "review_score": "1"
        },
        {
            "review_text": "Fun and bloody, with a surprisingly good amount of dialogue and story for a game of the sort... not for kids though",
            "review_score": "1"
        },
        {
            "review_text": "Great campaign 8/10 it was just all round good and i couldn't stop playing",
            "review_score": "1"
        },
        {
            "review_text": "This was a good game to spend a few afternoons with. The gunplay was fun and the pacing was great. Loved the story and now I'm interested in getting the Darkness comics for myself. However, the price of such a short game is a little too high. 30 bucks for about 10 hours of gameplay just won't cut it. Buy it on a sale though, and it will be worth your while.",
            "review_score": "1"
        },
        {
            "review_text": "The game pushed me away in my first try. I remember first The Darkness (Xbox 360/ PS3), and how beautiful, dark and tragic the story was, so I endured less than 2 hours. After few years (and another playthrough of 1st part) I decided to give it another chance, with different approach. Beginning was hard to play ('flat' storyline, not difficulty of the game), but then story became more like previous part - beautiful places and surroundings, tragic story, and vulgar Darkling with specific dark sense of humour. If you enjoyed 1st part, you'll like this one! If you don't know first The Darkness, you should fix this mistake! ;)",
            "review_score": "1"
        },
        {
            "review_text": "While not as imaginative and revelatory as the first game, the new combat mechanics and finely tuned gameplay more than make up for it. Quad-wielding, darkling companion, and a great collection of weapons make this the best, most innovative shooter of 2012 to date. You do NOT need to play the first game in order to enjoy this sequel. While you will get a little more from the narrative if you have, all the backstory you need to know is presented for you in the course of the game- and NOT in a boring, info-dump fashion!  DId somebody say 'Upgrade System'? Unlike many, many games today, The Darkness II's 'talent' character growth system stands apart from the pack. Every upgrade you spend 'dark essence' on will feel like a real, noticeable impact on your gameplay. Except for a couple upgrades, these are not simply stat boosts, or 'fiddling with the numbers'. After a full campaign playthrough, I have completed only ~60% of the upgrade trees.  I'm out of space, so if you like shooters, BUY!",
            "review_score": "1"
        },
        {
            "review_text": "Is probably the most violent and sadistic first person shooter in history, that's why I recomend it. (Warning, not for the squeemish)",
            "review_score": "1"
        },
        {
            "review_text": "A little weak on the story but still visually a sight to see. Worth getting on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Good one but get it on descout only. its short",
            "review_score": "1"
        },
        {
            "review_text": "Got it from a Humble Bundle because i wanted another game. Later on i dont remember the game i wanted becasue i played this instead 10/10",
            "review_score": "1"
        },
        {
            "review_text": "The best game",
            "review_score": "1"
        },
        {
            "review_text": "We got a plot jewel right here, deep and dark story yet romantic. The dialogues and narrative are just gorgeous. The first darkness is not on steam but don't worry, there is a fast throwback in the beginning of the campaign. I hope you all enjoy this game as I did",
            "review_score": "1"
        },
        {
            "review_text": "Loved the game hated the ending and by that I mean    (Well maybe kinda not really)  Gameplay 10/10 Brutality 10/10 Cliffhanger 3/10  ",
            "review_score": "1"
        },
        {
            "review_text": "Plot twist ending Tentacle raep 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic story telling and excellent voice acting. I just wish The Darkness 1 was available on steam.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Darkness II does a great job and delivering an emotional character driven story while allowing newcomers to easily get directly into the experience.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best story-driven games out there. However, if you don't care about the story and want a challenging, addictive fps then you won't find that here.",
            "review_score": "1"
        },
        {
            "review_text": "Much yellow very Mac",
            "review_score": "1"
        },
        {
            "review_text": "The story is what sold this game for me. It portrays the grieving of loss and betrayal and you find freinds in placed you would not expect. While the gameplay could be really fun on a high difficulty and brought new things to the table it did get a little repetitive. The game did not overstay its welcome however, it was relatively short. On a low price this game is easily worth it",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game with a gripping story and crazy fun gameplay. I very much recommend it at its current full price of $30 but I would wait for a sale due to its short length and knowing this game has gone on sale for very cheap, multiple times.",
            "review_score": "1"
        },
        {
            "review_text": "JUST WOW 10/10 Awesome story Awesome gameplay This game is ♥♥♥♥ing awesome",
            "review_score": "1"
        },
        {
            "review_text": "You ever have the urge to ♥♥♥♥ ♥♥♥♥ up with tentacles while shooting guns at the same time? Well this game is just the game for you.  Pros Quad wielding Damn good gameplay great graffix m8 Cons Lackluster soundtrack Quad weilding is really tri wielding, that right tentical can't pick ♥♥♥♥ up ♥♥♥♥ing ♥♥♥♥♥♥♥t cliffhanger ending short  While the game is short, there is a second left for dead style campeign that is another 3 hours or so  (I wouldnt know, the designers had the great ide to have a insta kill dealing impossible boss for people who enjoy single player) Suggestions for the next one go to a bioshock style weapon weel to have guns and make them customizable, that would be the ♥♥♥♥ Have cannible corpse or slayer or metallica or some ♥♥♥♥ for the next game, as this is metal AS ♥♥♥♥ and deserves an equally metal soundtrack make the right tentacle useful also make the single player campeign longer, I am not one for padding but 3-4 hours is two short for a campeign, its like sex that lasts for 3 minutes, its good and I will take it, but it would be better if it was longer.",
            "review_score": "1"
        },
        {
            "review_text": "Best game of all time ! You have Absolute Power !",
            "review_score": "1"
        },
        {
            "review_text": "Was expecting a halfway decent game but ended up with something much greater. This game is now in my top ten because it gave me an enjoyable experience without taking itself too seriously.  When it had serious scenes with the intention to make me question what was real in the game, it actually gave me pause. It also had a scene or two which got a chuckle from me, whether intentional or not. The gunplay is good, the powers fun, not too much strategy involved but it worked well for this game. Enjoyable story had me actually sit and beat it in just two sitings. I'd recommend a higher difficulty than easy if you actually want any difficulty but if you just want a story, playing on easy could give a less interrupted experience and that's fine too.  Very bloody and filled with language and if that turns you away then I understand but those who don't mind it will have a great time.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would buy again",
            "review_score": "1"
        },
        {
            "review_text": "Short but sweet. Probably some of the most satisfying shooting I've seen.",
            "review_score": "1"
        },
        {
            "review_text": "the darkness two is a first person shooter  in it you control jackie and jackie his two snakes starped on his back  these snakes have a lot of cool powers. this game is superb  everything is done well in this game,  i enjoyed my time with it and i would recommend it  but there is only one bug i have encountered : when i play as the demon monkey in the vents i get stuck in certain point , but i did find a solution to this, i pressed f12  while walking and that kinda solved the bug .",
            "review_score": "1"
        },
        {
            "review_text": "Darkness II does a great job and delivering an emotional character driven story while allowing newcomers to easily get directly into the experience.",
            "review_score": "1"
        },
        {
            "review_text": "This game should be rated 10/10.  Reasons why:   The story is absolutely beautiful and brilliant,  Gameplay is great,  Graphics are amazing (Minus gore)  Although the story may be a tad bit short, i think they're willing to make up for it with yet another to continue the series,  The game is fun and a great all around game to play. This game has a unique style to it that has never been performed before and i think that it deserves attention for what it is made out to be. &lt;3.",
            "review_score": "1"
        },
        {
            "review_text": "Loved this game, check out my video review:          YouTube™ Video:  The Darkness 2: On AbandonWare&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "There was literally only one problem I had with this game. IT WAS TOO SHORT",
            "review_score": "1"
        },
        {
            "review_text": "This game is nice. its Generally fun to play, FOV being set at 60 by default aside.   and you can't change it  ",
            "review_score": "1"
        },
        {
            "review_text": "This may be more linear than the first game, but the Quad-Wielding is extremely fluent Great FPS 10/10",
            "review_score": "1"
        },
        {
            "review_text": "the comic style graphic is good, the combat is brutal and fun, but the story is a bit short and there is hardly any stealth element. i also think the throwing guns away instead of reloading them' in the original darkness works better with the gun slinging mobster character setting. overall, this is a decent shooting game with a great combat system, the executions were awesome.",
            "review_score": "1"
        },
        {
            "review_text": "There was literally only one problem I had with this game. IT WAS TOO SHORT",
            "review_score": "1"
        },
        {
            "review_text": "I played Darkness 1 all the way through and enjoyed the storyline and the unique twist on the first person shooter. Darkness 2 pickups where the first left off, but the development teams focus did not seem to be on the same story intensive experience.   Only major issue I had with this game is it is really designed for multiplayer. The story can be beaten well under 8 hours.   I will recommend, but with that reservation.",
            "review_score": "1"
        },
        {
            "review_text": "One of a kind. You are the Bringer of Death!",
            "review_score": "1"
        },
        {
            "review_text": "If you're looking for an interesting action horror story with some wicked superpowers and cool levels that establish a chilling atmosphere, this is something you should pick up at the next sale. You do not need to get what happened in the first darkness, as it recaps it for you at the start of a new game.   I should admit that the gunplay and enemies can get a bit stale, but I had no problems staying the course because I was curious to see how it ended. While the enemies stay largely the same, you learn to skin the proverbial cat with a host of superpowers and adequate weapon variety. And for what I paid for it, I wasn't disappointed.",
            "review_score": "1"
        },
        {
            "review_text": " Short Story, Sweet Gameplay",
            "review_score": "1"
        },
        {
            "review_text": "Honestly some of the most fun I've ever had in a video game for quite some time. The visceral arcade-style combat is reminiscent of Shadow Warrior, and the story is no slouch either, with interesting twists and great dialogue that just keeps on giving. Though it's a bit short for to ask 30 bucks for, once it's on sale, this game is an definitely a must-buy for fans of extremely satisfying, character-driven shoot 'em ups.",
            "review_score": "1"
        },
        {
            "review_text": "7 hours for one play through.  You are the leader of something like a mafia family.   You have powers, first you only have daemonic arms which can reach ca. 10 meters or swipe through enemies.  Later you can choose from talent trees different powers like a swarm of insects which distract/stun, killing with the arms for health/ammo/armor and other stuff. You can use these talents even to just make you a better gunman with pistols, sub machine guns or assault rifles.  There is no cover system per se, but you have to use cover or you will die. So before a fight I often check the columns and doors and where the enemies are, so I have a better chance to find cover.  The story is about evil versus evil and whatever you do, you are a container for the evil. I have to say, I liked the story but I did not understand it. In other games it is often the other way.  The game is fast, very fast sometimes, so fast you will die, if you are not able to use all your powers in perfection. That is the reason I can say the checkpoints (there is no save system) are really good. Even in larger fights it is often so that you don't have to repeat the whole fight.  The levels are nice enough that I look at them and like them. I don't remember the music, so either there was none or it was not bad.  The sounds and the voices are good to ok. The voice of the protagonist is the worst one. I just don't like it.  Often I don't start killing when I see enemies but instead hide and listen to them. It is fun when they talk about something.  This is good game. Not one of these 'you must have', but nevertheless a good game.  If you like shooters you might want to try it. It is fun.",
            "review_score": "1"
        },
        {
            "review_text": "This games throwing objects mechanics is ♥♥♥♥ing incredible especially the poles which are so satisfying",
            "review_score": "1"
        },
        {
            "review_text": "10 hentai tentacles out of 10",
            "review_score": "1"
        },
        {
            "review_text": "My wife brought home this groupie ♥♥♥♥ one night She was pretty hot, a sexy, ♥♥♥♥♥♥ sight We wanted a threesome with this stupid ♥♥♥♥ My wife licked my ♥♥♥ while the groupie sucked my front  [Chorus:] “YAY! It's pink!” when she saw my ♥♥♥♥ “YAY! It's pink!” she was used to ♥♥♥♥♥♥♥' ♥♥♥♥♥ “YAY! It's pink!” a stupid little ♥♥♥♥ “YAY! It's pink!” ...and she was born in the ♥♥♥♥ing 90's  A rockstar groupie blowing me in my bed She screamed, “Anal ♥♥♥♥!” so I kicked her in the head When she started to cry I slammed my fist in her ♥♥♥ I was turned on by her tears so I came really fast  [Chorus]  Gave most to my wife then gave the dumb ♥♥♥♥ a taste But she was so annoying so I punched her in face Looking pretty hot covered in with blood and my ♥♥♥ Only 17, and so ♥♥♥♥ing dumb  [Chorus]  The very next day we wanted her gone She thought that we liked her; she was totally wrong Her ♥♥♥♥♥♥ came to get her so she started to pout I yelled “Get your ♥♥♥♥, and get the ♥♥♥♥ OUT!”  [Chorus]   it's gud",
            "review_score": "1"
        },
        {
            "review_text": "The Darkness is a awesome game to play",
            "review_score": "1"
        },
        {
            "review_text": "Length is its only flaw. Great gameplay and best story telling ever, second only to the first in the franchise.",
            "review_score": "1"
        },
        {
            "review_text": "Really cool and different game.  1: The story is pretty cool 2: Once you complete it all, you can still challenge yourself, without deleting all saved data (You can play a harder difficulty with the powers you bought earlier)",
            "review_score": "1"
        },
        {
            "review_text": "for a game thats beaten in 5-6 hours. this is worth it, was so supriced that i would actually say that 5-6 hours of game play is more than enough for the story. got great violence, great graphics, great pace, great plots. was sceptic and at first i didnt like the new look, but after a few mins i love everything about this game.",
            "review_score": "1"
        },
        {
            "review_text": "  one of the best!",
            "review_score": "1"
        },
        {
            "review_text": "Actually an insanely good game and great sequel to the first. If you like very action oriented games this game is amazing for a low price. You get giant demon tentacles that you often rely on more than guns, along with a very nice story and decent visuals, even for right now.",
            "review_score": "1"
        },
        {
            "review_text": "This game is so so so so SO underrated! It has really good first-person shooter macanics and it's awesome how you have this demon inside you and you can pick up enemies and slice them up into little pieces. I also love how you have pick up things and launch them at them. This game is definitely in my top 10 favorite games from the 7th generation!",
            "review_score": "1"
        },
        {
            "review_text": "The start up audio is extremely loud despite any sound settings. The game gave me an annoying blur effect glitch throughout the entire experience which made it much more difficult and unpleasant than it had to be since enemies will use light and flashbangs to put blur effects on your screen already. Expect plenty of blurring in the second half of the game. The kill animations are repetitive which is fine except when some of them take much longer than the others to finish (Anaconda vs Head Whip) and become very annoying. The game also really wanted me to use my controller since it didn't respond too well with mouse and keyboard. I didn't know the Darkness being bad news was referring to the port quality. Ohoho.  Despite all of that, I finished the game. It's extremely gory, has combat I haven't experienced before (big reason I finished), has a short to medium length, and ends on a huge cliffhanger that left me wanting more, but I don't think there will be a third one (sadness).  The combat has you wielding three different guns that you harvest off the dead or find and utilizing the Darkness as you see fit. The general weapon categories are pistols, smgs, rifles, and shotguns. I was a big fan of dual-wielding Desert Eagles. The Darkness on the other hand can pick up and throw various objects and people. You can also grab shields with it, throw your Darkling buddy, perform executions for health, ammo, reduced powers cooldown, summon swarms, enhance your bullets, and much more depending on what you decide to purchase on the four skill trees. You also have your dependable tentacle melee attacks that will slice people in half horizontally and vertically. Making your tentacles, guns, and powers all work together kept me interested in the game along with the revenge style story.  Unfortunately, the game has many problems. My problems weren't restricted to my experience either going off of what I read in the hub and in reviews. That's enough to not recommend this title, although, if you're curious, maybe pick it up on sale or if it ever pops up in a bundle again. From the bang for buck perspective, $30 is a very tall order for this title.",
            "review_score": "-1"
        },
        {
            "review_text": "1. Graphics 2. Story 3. Gameplay  1. The graphics are very average. The graphics are of the same quality as Bioshock 1. Which would not be a problem if it was not 2014.   2. Story is kind of lame for my taste, none of this is believable or makes any sense.  3. Gameplay could have been great, however, the Demon arms do not do as much damage as they should. Also, the cinematic action kills are very lack luster.  ",
            "review_score": "-1"
        },
        {
            "review_text": "This is terrible, The Darkness II plays like it has just been threwn trough the compiler and not even being tested on a single Mac. The game expects a xbox controller and layout (something thats not working on a Mac by default), my PS3 controller of course is not working even though it is supported by default in OSX. The same goes for the Mouse support, here you will need a standart two button mouse with a scroll wheel, playing with a magic mouse is not working because the controls rely on scroll wheel press and roll and left and right mouse buttons being pressed simultaneously. It's not the first time i encounter a game on steam that lacks any real control support for OSX.  Why port it then if you don't give a ♥♥♥♥ about the playability on the system?",
            "review_score": "-1"
        },
        {
            "review_text": "i have thsi grafical issue and its nothing with my computer its with the game or something i wish i could ahve a refund ",
            "review_score": "-1"
        },
        {
            "review_text": "Very bad glitch on mac. Bottom of screen is yellow and you cant see anything.",
            "review_score": "-1"
        },
        {
            "review_text": "The game that has nothing to do with its original, other than key characters and world it's in. The story is bleak and obvious, gunplay is... okayish, but nothing to write home about. The music is dull and just here to fill the void. I can't call it a bad game, but can't say it's good either. The game's strongest point is that's it's tied to The Darkness in its story, not the game itself. Sad, really.   I'm not fan of giving scores to games, but if for the sake of comparison, say, the original The Darkness was solid 10, then this game is closer to 6.",
            "review_score": "-1"
        },
        {
            "review_text": "The characters are really hateable, the story is extremely frustrating to go through, and the gameplay feels like a chore.",
            "review_score": "-1"
        },
        {
            "review_text": "There is a glitch in 4th level when you're in vents that prevents movement forward ( game no crashing just stopped by invisible walls on only path ). Otherwise it would be 'yes'from me.",
            "review_score": "-1"
        },
        {
            "review_text": "Amazing start, but as soon as I start the game play, the game ends and I end up staring at my Windows 10 start up. I cannot start up the game. (I have one of the best laptops at the moment. MSI pe70)",
            "review_score": "-1"
        },
        {
            "review_text": "Extremely contarded story game and port. Regenerating health, 3 gun limit, really long and boring melee takedowns, save the waifu - you've played this game before. fart.",
            "review_score": "-1"
        },
        {
            "review_text": "i Highly unrecomend this game due to its never failing glitching for Macs, such as half the screen disappearing, everthing becoming pixilated, overlapping voice segments, and last but not least, the lovely inability, to not see a damn thing.",
            "review_score": "-1"
        },
        {
            "review_text": "Oh god was this game ♥♥♥♥♥♥ or what. The game when it came out was 60 dollars, I play a total of 4 hours and beat the game, and the bad ending.  The story is about Jackie Estacado, head of a mob family. He is ambushed at the restaurant his mob family owns. This attack caused him to release the Darkness, a thing trapped inside of him, always wanting to get out and it did. The people who attacked him are called the Brotherhood and they want to take the darkness back for Jackie, but the Darkness have something that Jackie wants and loves.....  The graphics are Borderlands styled, its cell-shaded. For being a game release in 2011, it had decent graphics, but graphics aren't everything in this game because most of the time every detail is hidden because of the dark.  The gameplay plays interesting, the darklings on your back, don't like light and when you are in light, you can't regenerate or use your abilities. You have a little sidekick who helps you on the way and is a darkling so no light. The guns in the game are good, there is a variety of guns, pistols, shotguns, SMG's, rifles, about anything really. You can dual wield pistols, and SMG's.  Final verdict, the game is too short, even though the game has a lot of good stuff, its doesn't have much replayability and the story was horrible, and I'm a big fan of story driven games, so I'm going to have to say, don't buy, Humble Bundle (7-12-14 as I'm writing this) is having a bundle where you can get the Darkness 2 for a dollar so go get it and see how bad this game is. 5/10",
            "review_score": "-1"
        },
        {
            "review_text": "Nearly two hours of playing and i get stuck in a ♥♥♥♥♥♥♥ airduct... game play great, fun aswell BUT A ♥♥♥♥ING AIRDUCT.",
            "review_score": "-1"
        },
        {
            "review_text": "UPDATED REVIEW: My biggest problem, is that there is not enough content in the game: the campaign is short, the coop missions are too easy and the coop campaign is too short. So I'd say it doesn't worth the money - if there is a discount maybe (but looking back I definitely wouldn't give more than 5 Euros for it). However, an interesting game, could have been a very good one. The base idea is interesting. Good gamespeed (in the short campaign you won't feel bored), average story, but it has a certain style (which is not for everyone). Maybe I would recommended for those, who like unique shooter games (FPS), and would like to have a really short game. The story: i won't make spoiler, it's not bad (i've seen much worse), but a little simple. The evolution of the skills are well-made, which is absolutely a good point. There are not so many guns, but that's not a problem, because at least, they are really not the same (i mean, there are real differences between two guns, not just the look of them). There are 3 major negatives: 1. Graphic is bad. It is like a cartoon, but i think it wasn't a good choice. 2. Story is very short. I walk through the campaign in 1 day. 3. You are overpowered (mainly because of close combat - if you get close, you won). Even on highest difficulty, there aren't really difficult situations (maybe 1 or 2 during whole campaign). You can easily beat the coop missions alone.  I would say, that it's an average game, good for a weekend, but not for more, so in conclusion I don't recommend it.  If there will be a 3rd part, I would be interested in that, given that they change the graphic, and add much more story.",
            "review_score": "-1"
        },
        {
            "review_text": "I would be playing the ♥♥♥♥ out of this fantastic game if it wasn't broken on Mac. Whoever's half ♥♥♥♥♥ fault this is, rot in hell.",
            "review_score": "-1"
        },
        {
            "review_text": "This game was excellent, but definitely not worth the cost. You can breeze through the entire story within about 4-5 hours, and once that's over - what's the point of playing the other content by repeating the same story you just went through?",
            "review_score": "-1"
        },
        {
            "review_text": "This game is labeled as operable on Mac, but I could not complete the introduction due to graphical errors that cannot be fixed without running Bootcamp or some other form of Windows/Mac process. Needless to say, I recommend Mac users to avoid this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Game is ♥♥♥. Controller doesnt work, and in order to get passed the beginning I need it because hitting spacebar (aka 'a button on the xbox) doesn't execute the 'held' enemy thus not allowing me to progress any further. Will change review if fixed.",
            "review_score": "-1"
        },
        {
            "review_text": "whatever",
            "review_score": "-1"
        },
        {
            "review_text": "Do not buy this game. It seems like a good deal when I bought it on sale for 6 and some change, but once I downloaded it half of the screen is yellow and you can't see what you are doing. DO NOT BUY THIS GAME.",
            "review_score": "-1"
        },
        {
            "review_text": "The best part in this game is that you can skip most of the cinematics and dialogues - game is awful.",
            "review_score": "-1"
        },
        {
            "review_text": "Terrible FPS with bad unresponsive controls and swarms of stupid spongy opponents. Irritating and tedious.",
            "review_score": "-1"
        },
        {
            "review_text": "So boring. Gunplay is passable but at 7 hours the game is 3 too long. Don't bother.",
            "review_score": "-1"
        },
        {
            "review_text": "-A bunch of uneeded gore -You can't unlock all the skills in one playthrough -Short story, beat it in 5 hours. With breaks. -Confusing story line, still makes no sense -Choices that seemed very uneeded -Ending was cheap -No replayability.  Graphics were good, I'll give them that.",
            "review_score": "-1"
        },
        {
            "review_text": "Kill moves become a little too repetitive, storyline not anywhere near as good as the first, here's hoping they ditch the idea of a trilogy. If you have 6 hours to kill and this is the only thing between you and boredom... and you've finished mirrors edge 3 times.. and the walls in your house have all dried.. its plausible that this is worth it during a 75% off sale.  *Spoilers*  If your looking for a game like the first one.. go get a bunch of gangsters to hammer in your head till you forget anything about the first one and replay that because the concept of hell in this game is unimaginative and come across more like 'Dante's cousin Jeff's playground of slate next to the doctors' rather than the war torn never ending torture of 'Dante's Inferno' the first showed us. Emotional connections in the game cease to inpsire and while torture scenes of the first evoke feelings of empathy and terror as you fight your way out, the recent equivalent is a long dialog with a crap single button quicktime event.  In summary, if this was a free DLC to finish off the last part of the first game.. i wouldn't download it because it would have completely ruined the imagination that was poured into the first.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a negative review but don't get me wrong, the game is great. One of my favorites, the big issue i have is that the mac port is really buggy. It stopped me from playing completely. There is a bug with the game where the screen is just yellow and you can barely play or see what is going on. Mac owners buy it at your own risk, if they fixed the bug then you will have a great time playing this wonderful game  ",
            "review_score": "-1"
        },
        {
            "review_text": "Decent game but it glitches up halfway throught he game ruining your game save and making it impossible to continue. google 'open the garage door for the darkling ' and there will be many threads about this glitch. too bad they are too lazy to fix this it has destroyed a decent game. now i need a refund because i dont want to restart all over again. knowing there is a good chance of it happening again.",
            "review_score": "-1"
        },
        {
            "review_text": "I can honestly say i'm very upset. I was excited to finaly be able to play this game on mac, but it turns out that a game breaking glitch makes it imposible to play. If you have a mac, DO NOT buy this game.",
            "review_score": "-1"
        },
        {
            "review_text": "so edgy it hurts but i guess it's funny to watch a bunch of guidos pretend to be in a psych ward",
            "review_score": "-1"
        },
        {
            "review_text": "(Note: I didn't play the first The Darkness game nor do I have experience with The Darkness comic books)  At its best The Darkness II is a very stylish game. The comic book origins of this title really come out in a positive way in that regard. Sadly the gameplay does not live up to the presentation aspect of this title.  At the very best you can call The Darkness II an above average shooter. It does nothing special which might sound weird considering how you basically are a semi-god demon monster with tentacles coming out of you ready to rip enemies and the envinroment alike apart. It's just very basic under the shiny shell. You're not really encouraged to utilize your demonic skills and when you do it just doesn't feel very cool.   Naturally darkness is weak to light which brings us to a very frustrating gameplay mechanic. Remember how everyone loves getting hit by flashbangs in shooters? Me neither. The Darkness II manages to take this to another level. Light makes you incapable of using your demon skills which in practice means whatever plan you had with impaling an enemy with that spear-like object you can forget. The real pain starts when enemies start using light against you. This results in many chaotic moments where you just have no idea where to shoot to regain some level of control over the game. The blinding effect of light is way overdone and will make you feel frustrated. When you being the badass mob leader demon you are have to stop every time coming to a new area to snipe off lightbulbs with your pistol you know something is not done right. To top this off the game has a bug which frequently makes motion blur 'reverse'. What this means is that everytime the motion blur should be off it's on and vice versa. It's not enough to destroy the experience but it's annoying.  The story is The Darkness II's best part. It's not magnificient but it will keep you interested. Characters are solid with a few really standing out. That said I felt very unsatisfied with the ending. As a stand-alone product it doesn't really work.   After about 7 hours of singleplayer campaign you don't have much to do. You can hunt down relics (with some really interesting descriptions as a reward I have to say!) or try a harder difficulty level. The game also features the 'mandatory online element' where four of your friends take on separate missions from main story. With no real story I had absolutely no motivation in trying my hands at those the gameplay being mediocre. If you want a multiplayer co-op shooter I'm sure you can think of better ways of spending your time and money.  After all the complaining you might think I hate the game but this is not the case at all. Beyond the presentation it's just not anything special. Mediocrity is not a crime and I'd say The Darkness is definitely worth it if you can find a great deal. At anywhere close to the full price I wouldn't consider it.",
            "review_score": "-1"
        },
        {
            "review_text": "A good game, but doesn't live up to the first.  One one hand, the game has a good story with a plot leading up to a major event. On the other hand, the ending is crap and almost feels like they cut the ending out for dlc that doesnt exist. And either I'm the master of video games, or this game is FAR shorter and FAR easier than its predecessor. Clocked less than 5 hours on my first playthrough? The original easily took me 10 on the 'same' difficulty setting. Technically, if this was a stand alone game with no history, I'd call it a thrown together waste of money. A crappy length, way too easy. But the fact that I liked the first game mixes things up. They took stuff out, put stuff in, and its really mixed. Technically, the only thing stopping me from being full negative about it is that I loved the first.",
            "review_score": "-1"
        },
        {
            "review_text": "This game was only fun in the beginning. Untill u get op and starts thinking about the game. Spoiler Alert: you're looking for some kind of spirit, that maybe can get away your 'darkness'? Like I've wanted this game a while, but now that I have it, it's not fun.  My rate of the game: 4/10",
            "review_score": "-1"
        },
        {
            "review_text": "Before I start I just want to say that the combat system in this game is quite fun.  Now that I said that let's begin. First off the FOV slider doesn't go high enough for me but I like to play on a FOV of 90 or higher so that is most likely not going to affect you. Secondly the amount of dialogue vs combat feels like 50/50 due to it being quite lengthy and often unskippable when it is not a cutscene. Thirdly one of the mechanics in the game is that bright areas remove your supernatural powers. This would be an interesting mechanic except it makes the game often annoying due to you being in the middle of a firefight and then lose your tentacles so you have to look up and take out the light while being shot. Also there are lights which you can only take out when you follow the wiring to a generator which is annoying as you often have to pass through the light to get to it.  These problems I could handle and are only minor mistkes but it was when I reached the vent crawling part of the game which I stopped. What happened was there was some glitch where you could not fit through unless you jumped at a specific angle. After about five minutes of this I stopped out of frustration.   Of course I advise you to also read other peoples reviews so that you can get a better view of this game to see if it is for you.",
            "review_score": "-1"
        },
        {
            "review_text": "pretty good game but just found out that it's not in my steam account anymore. Why ? Only God knows...",
            "review_score": "-1"
        },
        {
            "review_text": "Literally one of the most overly-done games I've ever played.  Overall just not that fun to play, gore and blood is WAY overdone to the point where it's actually bothering me.",
            "review_score": "-1"
        },
        {
            "review_text": "Literally one of the most overly-done games I've ever played.  Overall just not that fun to play, gore and blood is WAY overdone to the point where it's actually bothering me.",
            "review_score": "-1"
        },
        {
            "review_text": "Its a fun game, but in my opinion there are way too many cutscenes and just parts where only story happens where youll walk around for about 10-15 minutes talking to everyone. It definitely tries to have a nice story but im just not into games that focus more on cutscenes than actual gameplay. The gameplay is very fun but not fun enough for me to offset being annoyed by the cutscenes.",
            "review_score": "-1"
        },
        {
            "review_text": "This game it is not a complete disaster, even though I do not personally recommend it. It's not recommended only if you've played the original The Darkness on console.   In any case: this is what I call a missed opportunity. The Darkness II tries to continue the adventures of the unlucky Jackie Estacado, tormented by the death of his girlfriend Jenny, with The Darkness itself to spice the things up.  As written in the comic books, Jackie is the carrier of an antique evil force that humans passed on from generations to generations constantly fighting its counterpart, the Light. In this chapter we'll se a mysterious cult who is pursuing him to steal his mystical power. Unfortunately, the plot is the weakest part of the experience, and it is a shame, because the gameplay is satisfying. Being the Darkness is a good experience, you can feel like an overpowered creature who can slaughter and kill everything it breathes. Although there are few powers that you can play with, they're fun to use. Also the environment interaction is pretty good, in fact you can take various object with your demonic limb and throw them to your foes with enjoyable and squishy results. The game encourages you to do so in many different ways, as you can earn Dark Essence (XP) to unlock powers and abilities. The gunplay instead, it's sufficient: no recoil, the weapons sound and feel all over the same. The only difference you can tell about them is the fire ratio. It suffers from the modern FPS syndrome: high difficulty = enemies have lots of health points, so going further with the game usually is just trying and failing with a poor challenge. At least there's not regenerating health because you have to eat hearts from dead enemies in order to replenish it. There is also a limited multiplayer coop mode with 4 characters to choose from with different skills and abilities, but it adds nothing to the experience, it's just another excuse to shoot everything. Maybe this mode was built in order to extend the game length, because the singleplayer campaign is very short (about 6 hours).   Do yourself a favor: if you own a PS3 or Xbox360 go and grab a copy of the first game. You won't be disappointed. ",
            "review_score": "-1"
        },
        {
            "review_text": "Another game, another poor PC port. There is a lack of video options not to mention a lack of proper key bindings. You can't have the option to toggle aim down sight which means you're stuck with playing as though you were using a controller. If you really want to play this game, you may as well just get it on a console. I would not recommend forking out $40 for a half-competent PC game. The sensitivity control is also poor.   I should also note that there are places where you need to turn vSync on in order to get past them because of collision issues.",
            "review_score": "-1"
        },
        {
            "review_text": "im running a early 2015 macbook pro and this game is an absolute waste of money. Catastrophic graphic glitches and will not work with a controller. i do not and will not recommend this game.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a very disturbing and foul game. I do not reccomend it. Besides the fifth and cancer of what this game is, the game ending is terrible. The player ends up getting left with an incomplete story and a sad ending.",
            "review_score": "-1"
        },
        {
            "review_text": "this game was actually a disappointment compared to the first one, to be honest it's not worthy of the title The Darkness.",
            "review_score": "-1"
        },
        {
            "review_text": "Wasn't even remotely enjoyable even with friends.",
            "review_score": "-1"
        },
        {
            "review_text": "quit after 5 minutes in ,i can't stand games that tell you what to do and you have to follow their exact instructions otherwise you cannot go forward into the game . kinda like call of duty. ",
            "review_score": "-1"
        },
        {
            "review_text": "This game suckes major ♥♥♥♥.  Worst graphics I've ever seen, ever.   And you're getting guided thru the game by a ♥♥♥♥ing down syndrom.   insta uninstall. ♥♥♥♥ that.",
            "review_score": "-1"
        }
    ]
}