{
    "app_id": 676680,
    "name": "Mircron Wars XR",
    "release_date": "2017-08-04",
    "developer": [
        "Hallid Games"
    ],
    "publisher": [
        "Hallid Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Casual"
    ],
    "achievements": 10,
    "positive_ratings": 4,
    "negative_ratings": 0,
    "price": 2.89,
    "description": "Is an easy to play arcade space shooter, with an endless area to play in and countless Enemies to destroy. There are 18 ships to unlock and play as. Many different enemies to blast away at. Boss ships. HD graphics. Awesome Music. Lots of Weapons to blast away at the enemy ships with.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/676680/header.jpg?t=1513757339",
    "minimum_requirements": "OS: Have not tested on all versions of windows, tho it should run on anything from Vista upwards, but am unsure. Processor: Dual Core Memory: 800 MB RAM Graphics: Doesn't Need Anything Fancy, Should Run On Most Machines As Long As Their Not Over 10 Years Old. DirectX: Version 9.0 Storage: 800 MB available space Sound Card: Any Sound Card or Speakers Additional Notes: As long as your PC isn't old and running an old version of windows, this game should work on most machines, my apologies if I am wrong.",
    "recommended_requirements": "OS: Windows 10, This is the Op system I use to run it and works fine. Processor: Quad Core Memory: 1 GB RAM Graphics: Doesn't Need Anything Fancy, Should Run On Most Machines As Long As Their Not Over 10 Years Old. DirectX: Version 11 Storage: 800 MB available space Sound Card: Any Sound Card or Speakers Additional Notes: As long as your PC isn't old and running an old version of windows, this game should work on most machines, my apologies if I am wrong.",
    "reviews": []
}