{
    "app_id": 6850,
    "name": "Hitman 2: Silent Assassin",
    "release_date": "2007-03-15",
    "developer": [
        "Io-Interactive A/S"
    ],
    "publisher": [
        "Io-Interactive A/S"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 16,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Stealth",
        "Action",
        "Third Person"
    ],
    "achievements": 0,
    "positive_ratings": 1514,
    "negative_ratings": 260,
    "price": 8.29,
    "description": "Enter the realm of a retired assassin, forced back into action by treason. You may be a hired killer but you still have a sense of loyalty and justice. Visit the dark recesses of a world corrupted by crime, greed, degradation and dishonor. And a past that catches up with you.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/6850/header.jpg?t=1548767651",
    "minimum_requirements": "Microsoft Windows 98/ME/XP, Pentium 3 450 MHz or equivalent, 100% DirectX 8.1 compatible video card with at least 16 megabytes of video memory, 128 MB system RAM, 100% DirectX 8.1 compatible sound card, 800 MB uncompressed free hard drive space, 100% Windows 98/ME/XP compatible mouse and keyboard         Recommended: Pentium 3 1GHz equivalent or greater, 256 MB system RAM, 100% DirectX 8.1 compatible 3D Accelerator video card with 32 MB video RAM, 100% DirectX 8.1 compatible EAX Advanced HD Sound Card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Can't beat level one  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Hitman 2 is one of the the best stealth games that has ever released. I'll add that the foliage physics are now absent from this iteration that were previously found in Hitman: Codename 47. I also like how ballistics work in the game, it's unique. The level design, for it's time, is phenomenal. Such is the case with the storyline. It kept me immersed throughout my playthrough. The environments are enormous this time. And they're filled with NPCs, that may be civilians or enemies, so you won't get bored just wandering around.   The animations, however, are a bit clunky. But, again, taking into account its release date, it seems fair. Besides, it's nothing that would keep you from stop playing. I really, really loved sniping in the game. Some may say that the game is 'hard'. But that's just casuals whining how they can't move the mouse properly. The game's difficulty is realistic when played at expert, the AI becomes even more clever. At professional difficulty the game becomes frustratingly hard, you'd have to be a pro to achieve a silent assassin rating in that! I played it on PS2 and i have to say that ''Hitman'' series was my childhood and ''Silent Assassin'' one of the greatest parts .",
            "review_score": "1"
        },
        {
            "review_text": "Jack Thompson's fabled 'murder simulator' given life.",
            "review_score": "1"
        },
        {
            "review_text": "Hitman 2: Silent Assassin is the second game of the Hitman, with a story which is unremarkable, 47 is retired to a sicilian church with his friend, the father Vittorio is kidnapped, to save him, 47 needs to return to assassination business  Positive Things: + It's the longest game in the series with the most varity of the mission location, every location is kinda differently, for example Japan, Afghanistan and Sicily are intense, because the AI is really sensitive, compared to Russia, Malaysia and India which is more relaxing + Nice game engine even if the game is really old, and can even run on a toaster ( very low end computer/laptop ) + Contains the best levels of the series + Old game but still the best + A nice loadout of weapons + The Marauder's map is decent + The game ending is really nice + The Difficulty is hard ( it's a stealth based-game ) so use your brain ;)  Negative Things: - The rating system is horrible - Include some worst levels in the series - Most of the time the only possible disguise is a guard outfit - The prevous game, every target was memorable - The game contains some glitches  Conclusion: this game is very sentimental, this game is very challenging and fun",
            "review_score": "1"
        },
        {
            "review_text": "Ive been a big fan of the Hitman Franchise ever since i got my Laptop, And out of all the the games i have 'Hitman blood money and Absolution' I find Hitman 2 the best one that ive played so far. An interesting Story with Agent 47, Gameplay that lets you go in Guns Blazing or Sneaky Beaky like. Very well done game. Highly Recommend it!",
            "review_score": "1"
        },
        {
            "review_text": "I think it's the hardest Hitman game to beat as Silent Assassin at highest difficulty. Must play for every stealth-action fan.",
            "review_score": "1"
        },
        {
            "review_text": "Well being bald and dangerous never felt so good as in this one. This game is fun. when it comes to graphics it still holds up (according to someone who thinks first MGS looks sexy) but where the game shines is in gameplay, you can go in with guns blazing and enjoy some quality ragdol physics, but to be a true bald killing machine, you need to use your wits, disguises, kill only your target and leave without being noticed (sounds tricky and difficult? Well, it is). And if you just can't be bothered to play game at all. Check out speedruns of this game because they are amazing to watch. I can't recommend this game enough. A more than one way to kill your target, very good story (for hitman game. To catch up, to mass effect is still haves some work to do) and this feeling of being ♥♥♥♥ing genius after getting a silent assassin rating without consulting YouTube.  Bald and proud/10",
            "review_score": "1"
        },
        {
            "review_text": "Finally, I can play as a bald, barcode stamped, suited murderer!      Isn't that what everyone wants to be?   ",
            "review_score": "1"
        },
        {
            "review_text": "This game is such a classic it is still good if you like the stealth type of games and for 1.39 its a steal i recommend anyone looking for a game similar to this is death to spies which is twice as hard as this hitman and challenging.",
            "review_score": "1"
        },
        {
            "review_text": "If you can get past the Annoying as ♥♥♥♥ Ai and the slow sneaking this game actully has some very good missions now i haven't played this that much on steam but i owned it on cd before and played quite a bit there if its on sale i would say get it.",
            "review_score": "1"
        },
        {
            "review_text": "Fun, but one of the must frustrating stealth games I've played. Many other stealth games I've played have had a bit more leeway when it came to making a single mistake. Be warned that if you want a good stealth ranking, you have to go very slowly. Verrrrry slowly.",
            "review_score": "1"
        },
        {
            "review_text": "This use to be my favorite Hitman on PS2. Great missions, plenty of weapons, just the game itself is just.. I don't know how to explain it but the game is amazing.  9/10 - I played this all the time on PS2.",
            "review_score": "1"
        },
        {
            "review_text": "The game pictures make it look crap, but it is a verry good game. just because it is old doesnt mean it is bad, you can, hide bodies, disgues your self, pick up wepons, climb ladders, look through keyholes, and much more. the only downside is you cant hide bodies in a wardrobe, or something, you can only drag them into out of sight places, another downside is the story, kind of bad, but it has 20 something missions, with easy, medium,hard, so it has pleanty to keep you going.",
            "review_score": "1"
        },
        {
            "review_text": "I'm in love with hitman games",
            "review_score": "1"
        },
        {
            "review_text": "Remember, no russian.",
            "review_score": "1"
        },
        {
            "review_text": "This is a very fun game! I remember this game I always used to play it on the ps2 :P I also highly recommend this game wort the money!",
            "review_score": "1"
        },
        {
            "review_text": "its the best games in the world",
            "review_score": "1"
        },
        {
            "review_text": "Win 7x64 Win 8 win 8.1 - unplayable.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best from Hitman, one of the best games",
            "review_score": "1"
        },
        {
            "review_text": "Literally all missions can be completed by mass murder. I wish player was enforced to use stealth approach.",
            "review_score": "1"
        },
        {
            "review_text": "This game still kicks ♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "This is the true Hitman game. While the original Hitman nudged you toward a specific method, Silent Assassin truly leaves multiple methods. The only thing holding you back is your creativity. The guards have also been reworked to be much more realistic and will become extremely suspicious of a barcoded bald man in a ushanka running away from a dead body.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best action games ever.",
            "review_score": "1"
        },
        {
            "review_text": "This game is better than the first one, and starts off where the first one ended too. What is shocking is the game intro before the main menu!  *****SPOILER AHEAD*****   Apparently there is still more of those clones!!!   *****SPOILER SECTION CLOSED*****  10/10. For first person option xD",
            "review_score": "1"
        },
        {
            "review_text": "how does he change clothes so fast i wish i could do that",
            "review_score": "1"
        },
        {
            "review_text": "Sadly, this game just does not work properly for me. I can get it to run, but the controls are quite bad and sometimes just don't respond. On top of that, having multiple monitors gives me problems with this game as well.",
            "review_score": "-1"
        },
        {
            "review_text": "Incredible game. You should pay up to $100 for this game.",
            "review_score": "1"
        },
        {
            "review_text": "Piece of ♥♥♥♥ takes forever to even start up with the stupid starting unskippable logos. cant even load in the background. KILL IT WITH FIRE",
            "review_score": "-1"
        },
        {
            "review_text": "9/15",
            "review_score": "-1"
        },
        {
            "review_text": "Not working on WN 10 ..tried 100 solutions",
            "review_score": "-1"
        },
        {
            "review_text": "What a stupid Ai. This game the bigest ♥♥♥♥ I ever played.",
            "review_score": "-1"
        },
        {
            "review_text": "  omfg this game sucks its like 2 billion years old like who even plays this hey cod is better get cod instead",
            "review_score": "1"
        },
        {
            "review_text": "had this game  liked this game",
            "review_score": "-1"
        },
        {
            "review_text": "Why did the kitchen lady run screaming when I came in dressed like a delivery boy holding a tray full of food?  Zero out of five Lennys ( ) ( ) ( ) ( ) ( )",
            "review_score": "-1"
        },
        {
            "review_text": "One of the greatest stealth games of all time!",
            "review_score": "1"
        },
        {
            "review_text": "A good starting point for the Hitman chronicles. No, its not great. Yes its old, graphics are even older. Third person controls like tank. I could go on with the things wrong with this game. But I won’t. Too many people are critics. Too many of those critics are on Steam. However, it is a memorable game. For its story of a guilt ridden killer trying to find redemption and for its unique and challenging missions. The levels are vast and extremely open ended with more than one way to take out your target. You could play the same mission differently a dozen times. If you’ve played Splinter Cell or Metal Gear Solid or Thief you owe it to yourself to try out Hitman 2: Silent Assassin. No its not as refined or as classy as Blood Money but it is a decent start. For that I’d recommend it. ",
            "review_score": "1"
        },
        {
            "review_text": "You're the only bald guard in the villa yet noone suspects a thing",
            "review_score": "1"
        },
        {
            "review_text": "Must play game :D",
            "review_score": "1"
        },
        {
            "review_text": "Best. Hitman. Ever. will Hitman again!",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Fantastic game.",
            "review_score": "1"
        },
        {
            "review_text": "i cant even beat the first level",
            "review_score": "1"
        },
        {
            "review_text": "great game !",
            "review_score": "1"
        },
        {
            "review_text": "A more polished second game in the Hitman series, quite fun, and seemingly endless playtime. Another recommended game.",
            "review_score": "1"
        },
        {
            "review_text": "I personally loved this game. I previously had played Hitman:Blood Money before this(I believe its the 4th Hitman in the series) and love it just as much even though its older.   It's definately harder (in my opinion) than Hitman:Blood Money, for the fact that you can't hide the bodies in any closets or containers, but i don't neccissarily think that, that is a bad thing, in fact, I think it gives the game a little more of an edge in the aspect of if you want to get a perfect game (Silent Assassin) then you must devise ways in order basically for the body not to be found, or rather not kill anyone.  Fun game :)",
            "review_score": "1"
        },
        {
            "review_text": "This Game is great but lacks some features such as the devs could have made walking a tad bit faster and sneaking much faster too.But thats my only complaint, I love the way how you can choose how to play from being super stealthy to a serial killer. This game is great in my opinion but if you fix the movement to be a tad bit faster I would rate this a ten but it might never get fixed.Right now my rating stays at a 9/10    Pros:  Flexable Gameplay Good way to pass time  Great Challenge Cons: Really Slow walking speed",
            "review_score": "1"
        },
        {
            "review_text": "Basically the Nintendo 64 version of 007, but it's Hitman. Based on which strategy you use there are different options which is cool I guess. Some missions are hard as balls.",
            "review_score": "1"
        },
        {
            "review_text": "Classic.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games ever made. Play it right, and you feel like a sociopath James Bond.",
            "review_score": "1"
        },
        {
            "review_text": "The snow levels in this game suck.",
            "review_score": "1"
        },
        {
            "review_text": "Best in the series. Even more pleased than Blood Money. Very cool OST.",
            "review_score": "1"
        },
        {
            "review_text": "It so frikin good",
            "review_score": "1"
        },
        {
            "review_text": "Hitman 2 is a direct sequal to the original Hitman, after the events of the original game Agent 47 faked his own death and unofficially resigned from the ICA. For some time he has live a reclusive life as a gardener at a church in Sicily, Italy. Agent 47, tried to make amends to what he has done in the past by donating his blood money to the church and seeking guidence and forgiveness from the priest of the church, Father Vittorio. Despite 47's previous occupation of being an assassin, the good priest knows 47 is good at heart and assurs him that there is a place for him in the next life. Life at the church seem all well until a mysterious group of gun men came and abductted Vittorio. Leaving behind a ransom note for 47 to read, he knows the only way to find his friend is with the help of the ICA. Which means he has to reactivate his membership as a hired assassin once more. The ICA agrees to help 47's search for the priest in exchange for him to carry out orders requested by a client. During Agent 47's travels he will eventually learn that the man who abdupted the priest is someone who holds a serious grudge towards him, The sequal is a big improvement over the original game with not just slightly improved graphics but improved controls for movement and weapon firing. In this game the compass is intact to the screen rather than being an item to buy, the sneaking mode is improved, the map labels enemy locations as well as objective marks, and best of all you are finally able to do mid level saves in case you mess up on the mission! This was also the first hitman game to have the progress of collecting weapons out on the field. Which this leads to players being able to obtain newer weapons to use in later levels as well as being able to used these obtained weapons for previously played levels. Overrall, this is one of the best sequals to be superior towards the original and was the game that helped make Hitman a more well received franchise. A must play game for any third person shooter/stealth game fans.",
            "review_score": "1"
        },
        {
            "review_text": "Such a great classic. Some of the most memorable levels in the series are in this one. Music is amazing.",
            "review_score": "1"
        },
        {
            "review_text": "this game is already. a little slow paced though",
            "review_score": "1"
        },
        {
            "review_text": "Agent 47 have return n this perfect continuation.  The game comprises more than 20 missions. Though the settings and the details of each mission are different, most all of them share some basic goals: getting in, eliminating a key target, and getting out. How you meet your objective is up to you, whether by guile and stealth or by brute force, and most missions are cleverly designed to have at least several viable, even intuitive solutions.  One of the big differences between Hitman 2 and its predecessor is that a forceful approach is much more viable in the sequel. At the normal difficulty setting, it's in fact much easier, and much faster, to just blast your way through most missions.  For me perfect return of out bold friend with his so friendly face.",
            "review_score": "1"
        },
        {
            "review_text": "Hitman 2: Silent Assassin has stopped working. Stephen Hawking runs better than this ♥♥♥♥ing game.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "i have played this game so much on PS2 version i totaly recomend this hitman and others games of hitman too totaly worth of you money",
            "review_score": "1"
        },
        {
            "review_text": "This was probably the first hitman game you played. As Codename 47 was not well recieved at the time, and a pc only release. The basic premise is try to infiltrate areas. Track your hit, figure how to take them down while attracting the least amount of attention. Some levels are more open then others. The ones that are have numerous ways to to take out your target.  The graphics are far better then thier console counterparts, and the looks still pleasing for a game from 2002.  The controls are solid and was a real step up from numpad movement on Codename 47  Ochreastal scores are tense, the blending of moods and atmosphere makes every moment feel nerve wracking as you sneak up behind your target with your fiberwire pulled ready to pounce and drag your victim away to take his clothes.  The gameplay here was far more refined and stealth encouraged making every silent assasin rank thrilling to behold as you leave unheard and unseen. This sheer joy is occasionally hampered by Japan and the middle east. These areas are hard and require tight timimg, This again does feed right back into the joy of firguring out what boils down to a multiple choice puzzle.   Changing disquises, posioning drinks, turning off the power, fake a fire, a deadly use of guns. All as satisfying as they sound.  If you love stealth. This is a must have along with all the other titles, (excluding the newest one, and codename 47 as it is not as fleshed out from here on out.)  The only real issuies is jumpy AI that sometimes just goes bananas for no reason or stop their patrols and just stand somewhere you really need to go.  All in all. This was just a blip compared to what would culminate in blood money. A deadly good game.",
            "review_score": "1"
        },
        {
            "review_text": "A classic game with good story and characters!",
            "review_score": "1"
        },
        {
            "review_text": "The enemies in this game are psychic they all know what i look like when one guy notices me in a room with no windows and sound proof walls. I LOVE IT!",
            "review_score": "1"
        },
        {
            "review_text": "Mr. 47 is back (well, it was back some years ago, back in 2002)... with a retired 47 who goes back to his old life because some circumstances at the beginning of the game. Mission mechanics are improved from its predecessor, now you have an assassin rating for each of the missions you complete; as in the previous game you can complete mission in more than 1 way; you choose whether to get start the mission and pop everyone and everything you see (you can shoot rats or pigs too XD) or go for full stealth and achieve the ultimate assassin rating - 'Silent Assassin'.   If you want to make this game really interesting, complete all missions getting the Silent Assassin rating; make the game experience even better, because you have to time your moves, avoid exposure and so much more. I really had a blast beating the game getting this rating.   Graphics are from some while back, but they look better than the first game. The Orchestral music and different music themes through the game add even more to the experience. An oldie but a good one!... I really recommend it...",
            "review_score": "1"
        },
        {
            "review_text": "I gave this game The “Villain Most In Need Of A Hug” Award  Indeed.  In the neck.  With a fiber wire.",
            "review_score": "1"
        },
        {
            "review_text": "If you played this as a kid, get it on steam right now.   You will enjoy it.",
            "review_score": "1"
        }
    ]
}