{
    "app_id": 6860,
    "name": "Hitman: Blood Money",
    "release_date": "2007-03-15",
    "developer": [
        "Io-Interactive A/S"
    ],
    "publisher": [
        "Io-Interactive A/S"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 18,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Stealth",
        "Action",
        "Third Person"
    ],
    "achievements": 0,
    "positive_ratings": 5864,
    "negative_ratings": 391,
    "price": 9.29,
    "description": "Money Talks. Silence Pays. Prepare to Make a Killing. When assassins from Agent 47's contract agency, The ICA, are eliminated in a series of hits, it seems a larger, more powerful agency has entered the fray. Sensing he may be a target, 47 travels to America, and prepares to make a killing.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/6860/header.jpg?t=1548767813",
    "minimum_requirements": "Microsoft Windows® 2000/XP (Windows 95/98/ME/NT Not Supported) Pentium 4 1.5Ghz or Athlon XP Equivalent 512MB RAM 100% DirectX 9.0c compatible video card which supports Hardware TnL and Pixel Shader 2.0 (GeForce FX / Radeon 9500 or higher) 100% DirectX 9.0c Compatible Sound Card 5.0GB free disk space 100% Windows 2000/XP compatible Mouse and Keyboard (Gamepads and controller are not supported)Recommended:  Pentium 4 2.4Ghz or Athlon XP/64-bit equivalent  1024MB RAM ATI X800 series, Nvidia GeForce 6800 series or higher video card 100% DirectX 9.0c Compatible Sound Card, Sound Blaster X-Fi series 5.0GB free disk space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "If you were thinking of getting Absolution get this instead.",
            "review_score": "1"
        },
        {
            "review_text": "You know you've begun to lose it when you start killing innocent people with whatever you can find just to see what the local newspaper nicknames you.",
            "review_score": "1"
        },
        {
            "review_text": "As good as hell. The best Hitman I've played. 10/10  Pros: -Graphics, for 2006 -Enemy AI -Hardcore stealth -Multiple ways of beating the stage, repeatable gaming experience -Weapon customization -Link of events  Cons: -Can't remind even one :)",
            "review_score": "1"
        },
        {
            "review_text": "Booted up Hitman: Blood Money two days ago, after having not played it since 2006 or 2007.  Just beat it today.  Few things I found interesting about it:  - It's a 2006 PC port. You can run it at 4k just by making an ini edit, and it's flawless (doesn't break the UI or anything).  - As far as tech issues go, there was a bit of stuttering I fixed by going into the launcher and enabling both of the SLI settings (even though I'm not on SLI), but after that, game ran like it was made for my system. Then a lot of newer games have all these compatability issues and such until they're patched... were the people who made this game just better at what they did? Or have engines become so massive and unwieldy that it's more likely that things are going to fail than work? Or a combination of both?  - I had no bugs whatsoever.  - It has a first-person and third-person view - I know games did it even sooner, but I still think it's weird how a game from 2006 had this feature, and then it was a 'big deal' when the GTAV re-release introduced a first-person mode.  - obviously the textures and lighting are a bit dated, but the game still looks great. I think it's almost the perfect balance between the awkward 3D years where I couldn't believe any of it was real because it was too ugly, and nowadays where everything that goes for this style is hyper-realistic and immersion breaking because of it. This game is actually better looking to me than a lot of modern games that have that hyper-realistic plastic-surgeon-with-OCD look.  - the music is still phenomenal, of course  - the game doesn't pester you or tell you explicitly how to do everything. There are a lot of hints on the lower difficulties (on the map), but if you want to play it as a proper stealth game, you have to figure out how all the pieces fit together on their own. It has a lot of space. The game is challenging in its own way, but due to the way it's all set up, it's actually relaxing to play. I'm not being yelled at or expected to be somewhere constantly or being given game information nonstop because the people who made it were afraid that if the game stopped talking to the player for 10 seconds I would shut it off and leave. I can just enjoy it without being nagged and feeling rushed along because of the 'look here, do this, look here, shoot this' mentality. It lets you play.  - the worst thing about it is some character model pop-in, like the game runs a lower-poly version of them in the distance and when you get close makes them proper (I don't think I would've noticed this during my PS2 playthrough when it was new, but on PC at high-res and everything cranked it's pretty obvious)  - To boot every level is its own theme. If any copy-paste is going on it's minimal. There's more variety in the levels in a five hour game than I even saw in DOOM. Blood Money is genuinely interesting to play and anyone who hasn't played it yet needs to get it over with and understand why most people rant about most games. Once you have the best of everything, there's just a bunch of s*** you wade through hoping to find another game like Blood Money.  - Probably the best thing about it - it doesn't overstay its welcome. I played it on Expert (hadn't played in a loooong time so why would I Pro?), and beat every level with a Ghost, Professional or Silent Assassin rating, in just over 5 hours. I did remember some of the levels, but for the most part, I was blind here. It's refreshing, because they could've gone longer, they could've recycled assets to stretch it out, but why? Why do games need to last 'forever'?  I did reinstall Absolution out of curiosity. I ran it at max settings except for FXAA (which only blurs the image). Even though the tech Absolution uses is way better, and the textures are obviously much higher res, the game isn't as nice to look at as Blood Money.   Tech isn't everything. But when you don't know how to make a good game (something that I think needs to be a natural talent, like writing a good song or a good script - a few people have it, most people don't), you can at least learn how to push tech. And I think those are the majority of people making games these days, which is why going back to Blood Money is... holy ♥♥♥♥... most games really *are* as bad as I think they are.  But Blood Money is a masterpiece.",
            "review_score": "1"
        },
        {
            "review_text": "Cons: Very minor bugs (Fiber wire victim's body spazzing out, ragdoll bugs etc.)  Pros: Everything else.",
            "review_score": "1"
        },
        {
            "review_text": "This is still the best Hitman game ever. The gameplay mechanics are great, the maps are great, 47 in this game is great. It's a better purchase than the other Hitman games that came after. It serves as a great example of how games, if handled correctly, can be a perfectly legitimate form of art. It's an epic experience from beginning to end, filled with dark humor, lots of action &amp; stealth and most importantly the perfect blend of engrossing story and engaging gameplay. The newspaper at the end of a mission that informs the player how he handled the mission is my favorite small detail.        Main menu &amp; screenshots&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Gave up on being sneaky after the tutorial and played through all the missions with the rating 'Gangster', story didn't seem to make any sense after that.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games in the Hitman saga  If you are into stealth games this is a must have",
            "review_score": "1"
        },
        {
            "review_text": "The best Hitman game. Every level is memorable in some way, the ways to kill your targets can get really creative, lots of ways to go through the game, lots of cool mechanics, and let me just get back to the levels. they're just too good. Every single one. Yes the game has minor bugs, yes it's outdated, but the levels alone are worth picking this game up for.",
            "review_score": "1"
        },
        {
            "review_text": "The definitive game in the Hitman series and a gem of the stealth genre.   +YOU GET TO BE A HITMAN +Intricate stealth mechanics +Unique disguise system with a wide assortment of interesting, practical, and funny outfits +Trademark Hitman dark humor +Lots of freedom in how you conduct missions and assassinate targets +Large, open, sandbox levels to explore with very interactive environments -A bit glitchy, but nothing game breaking  Blood Money is commonly regarded by fans as the pinnacle of the series. Polishing the gameplay set by previous entries, this masterpiece delivers some of the most unique stealth gameplay available. Hitman is the series that pioneered social stealth, the ability to “hide in plain sight”. The disguise system in Blood Money works great and it’s fun to try different disguises to figure out what works best for certain situations. There are so many memorable levels in Blood Money, and I still manage to find new ways to perform assassinations. Levels like A New Life, Curtains Down, and The House of Cards are works of art. In this game, there are many creative ways to dispatch your targets, more so than any other Hitman game. You can rig a piano to fall on someone’s head, you can blow up a photoshoot with some well placed mines while dressed as Santa Claus, you can silently garrote your target while disguised as a birthday clown. Those who played Absolution and are looking for a taste of what the old games were like should look no further than Blood Money. For its current price, this game is a steal. Without a doubt, this is the best stealth game I have ever played.",
            "review_score": "1"
        },
        {
            "review_text": "The Best Hitman Game.  Just wish it had controller support.",
            "review_score": "1"
        },
        {
            "review_text": "Look at the Photograph Mr.Clarence.",
            "review_score": "1"
        },
        {
            "review_text": "this game is fantastic, with these graphics you wouldn't believe it came 10 years ago. The gameplay is a lot better than Absolution, and the level design is superb. If you have a ♥♥♥♥♥♥ laptop that can't run the new hitman game or absolution, it could probably still handle this one, and it's in my opinion, the best hitman game in the series.",
            "review_score": "1"
        },
        {
            "review_text": "This is the best Hitman game of the series.  If you haven't played any Hitman Games before, but want to get the idea and feel of it, with the best gameplay of the series, this is the one to jump on.",
            "review_score": "1"
        },
        {
            "review_text": "one of the only games that can make you feel like a badass by underpowering you  I havent played a ton of this on pc but I have on conole and just recently in the hd collection (no nostalgia boners here), I picked it up likeing absolution and I had no idea how much different this was   hitman bloodmoney is the forth hitman game in the franchise and also one of the strongest with sandbox like levels, hidden in plain sight steath, and very dificult unforgiving gameplay. the story is intresting but dosent keep you in the same areas (lookin at you absolution) so you'll go to places from festivals to small towns all different in tone and design. there's alway's one or more way's to kill an target wether it's poision or a 'gas leak' gone wrong, you might be thinking 'well I cant watch em die if it's an explosion' you can because the game has an extra treat the camera will split into 2 panels you and your target and you see him die. there's also an upgade system that will change your wepons or ecquiptment to be better for the job.  now for the unnecicary pro's and cons  cons -looks dated -♥♥♥♥♥♥ out of box controls  pros  -diverse enviroments -great veriety  -oh boy the crowds  -fair challenge -replayable as ♥♥♥♥ -ok story   overall fantastic  9.5/10  without the memories boner   ",
            "review_score": "1"
        },
        {
            "review_text": "Hitman: Blood Money  I remember playing this game a long time ago and having a blast. Revisting it on Steam was very much worth it.   Positives:  + Agent 47 now has more choices than ever when taking out a target. This game is awesome, and leaps ahead of its predecessors. Each assassination has many, many different ways to be pursued, a lot more than Contracts, Silent Assassin or Codename 47. Feel like staging an accident at an opera? Head backstage and swap the prop gun for a real one, then blow the chandelier foundations up with explosives, so they drop on your 2nd target. How about taking out a target in FBI witness protection? The target is having a birthday party for his child, so you can incapacitate a clown and walk right through the front doors. Then slip into the sauna where a spare FBI suit is and strangle your target to death with fiber wire. This is just the tip of the iceberg. So much variety it's amazing - which also means HUGE replayability.  + Graphics are pretty damn good for 2006, they hold up really well for a decade old game.  + Story is cleverly interwovern between the assassination missions, revealing more of the plot as you progress. I found it to be quite interesting.  + Stealth is superb in this game. You're going to need disguises, be it a waiter, garbage man, chef, policeman or whatever is applicable for your plan. Certain areas are restriced to those with access, so you're going to need the right disguises or move silently to avoid guard patrols. Hiding bodies is crucial to success, and for the first time in the series these can be concealed in freezers boxes or long, wooden crates.   + How professionally you perform your hits impacts on your notoriety and how much money you earn. Cash can be spent on body armour and health upgrades or modifications for weapons like silencers, scopes and sights.   Mixed:  ~ A lot of Hitman: Blood Money's gameplay revolves around understanding guard patrol patterns, timing and then perfect execution (this is of course if you're trying to achieve the perfect assassination). On the higher difficulties like expert, only 3 saves are permitted each mission and it can actually be quite difficult, until you work out the patterns. This is both good and bad. On one hand, there's too much focus on the previously mentioned mechanics which are time consuming. It can take hours to get the hit just right, with minimal civilian and bodyguard casualties. You'll be reloading endlessly, trying new combinations or methods to find what works best. On the other hand, this is part of the reason the game shines - to be the best assassin you have to perform like the best assassin. You need to think ahead and be on top of your game. It's a double-edged sword.   Negatives:  - Controls are a bit awkward, takes time to get used to. Could have been more polished for sure, but it's just a matter of adaptation.    Overall Score: 9/10  Conclusion: Best Hitman game of the series. It has style, great visuals, smart level design and solid storytelling. Don't miss out on this game, it's only a few dollars on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Blood Money is the 4th game in the Hitman franchise - released in 2006, 6 years before the next episode reached completion in development. It took IO Interactive quite a long time to develop the latest episode for the game industry's (probably) most famous assassin. As to what caused this postponement I do not know - perhaps the reception of Blood Money had been negative or somewhat mixed. My feelings about the game are only positive and I salute IO for making such an amazing, stealth-based action-adventure software that offers high replayability due to the various difficulty settings available.  Blood Money gives us a different setting in each mission. Hitman eliminates a gang on a riverboat in Mississippi, approaches a drug lord in Chile, takes down members of a rivaling organisation during a street festival, eliminates a sheikh in a casino in Vegas and more! Every level is very different from its predecessor - it requires different tactics and it is very important to pay attention to your surroundings, i.e. where the enemies are, what their patrolling route is, what disguises you need for them not to be able to recognise you etc. Attention to detail is top notch. The game looks good, runs well and has very decent voice acting. Music was composed by Jesper Kyd who later on presented us with the excellent score of Assassins Creed.  More than one solution exists to solve a mission. The game, therefore, is varied and offers replayability as some solutions require more finesse and while they offer you the easy way out (i.e. no violent encounters) the execution can hold you for hours. In fact, a higher difficulty setting allows you only to save fewer times so you really need to plan every move carefully. Higher difficulty levels yield you with extra money after the mission as the game offers no achievements. More money means better weapons and gadgets at your disposal. But if you prefer the stealth approach you will not purchase new weapons or upgrade your existing ones with the extra sum - you, instead, will use this to bribe key people to decrease your notoriety. Also, when you play the game for the first time, it is advisable to purchase information; information that helps you with the solution in each mission in the form of tips, personal messages.  In Hitman you need to obtain a disguise all the time to get past certain points in the level. While stealth-based games are many I do not recall any of these out there offering this option. In many cases you need to use more than one disguise and just to make the game more challenging you get extra money for reaching the extraction point in your tuxedo, how you originally started your mission. Even the story is interesting and has some surprises - just to mention the name of some locations towards the end of it would be a spoiler so you can find it out for yourselves.  Blood Money is an exceptionally good game. Absolution is the 'next-gen' version of Hitman - but if you don't mind playing a challenging and exciting game that is 6 years old Blood Money is for you. ",
            "review_score": "1"
        },
        {
            "review_text": "Hitman is not a shooter. It's basically a puzzle game, where the puzzle is cracking the playground level you find yourself in--who are all the people in the level, where do they go, where can you take them out unnoticed, what disguises are available, what environmental actions are available, etc. Very very rich and deep, dozens of ways to finish every level. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Truly the model when it comes to assassin stealth games. Hitman Blood Money is a game about finding and eliminating targets in a multitude of scenarios ranging from a party in a vineyard, to suburbia, to a casino, and a mardi-gras street fest. This game is non-linear and each level presents many options for eliminating your target. Do you go quiet and kill your target by switching the prop gun with a real replica? Do you equip your machine gun and go in guns blazing? Do you slit his throat in the dressing room? The level of options for each level make this the best hitman game to date.  Small detractments from this game include some wacky AI choices and some difficult movement elements (going through windows can sometimes be a pain and AI can sometimes spaz out and find you etc.) But don't be discouraged, the positives in this game far outweigh the negatives.   I recently rebought this game on steam because I lost my CD. I'm enjoying this playthrough just like I enjoyed the dozens of hours I experienced through my retail copy.  Take it from a TF2 spy main. This game presents assassination in a creative and entertaining manner that will have you coming back for more and more.",
            "review_score": "1"
        },
        {
            "review_text": "good game lots of fun get it :3",
            "review_score": "1"
        },
        {
            "review_text": "Truly Hitman Blood Money is the best in Hitman series. Absolutely brilliant! I played it several times and each time I enjoyed more! The story is awesome, gameplay is even greater. This game is one the best games ever! I give it 10/10 and I think Hitman Blood money really deserves it.",
            "review_score": "1"
        },
        {
            "review_text": "The  Best  Hitman Ever",
            "review_score": "1"
        },
        {
            "review_text": "Greatest assassination game I have ever played. Agent 47 is a highly trained, professional assassin for hire and this game really displays that nicely. You can customize his primary agency weapons to make them more silent, precise, or damaging. You can knockout bystandards and take their clothes to disguise yourself and get into restricted areas and reach your target. This game allows you to really take any approach that you want to a situation. You can go in a just kill every person in sight and you could go through the whole game like that. However, this game rewards players who take their time and think about their moves to get their target and not be seen. You get a more rewarding experience when you think out your moves and it makes you feel pretty great when you finally take out the target and leave without a soul knowing what has even happened. This is not to say that you can't use guns or be loud. If you want a challenge then get this and become Agent 47.",
            "review_score": "1"
        },
        {
            "review_text": "i plan to play much more of this game but i'm writing this now, i use a pretty useless computer with windows ten, it only crashes when i go into first person and talk to the coat guy in the theatre level and try skipping. I would call this a hardcore stealth game, there is no hiding behind cover, you have to actually plan and be sneaky, disguises actually do what they are meant to. You get access to the areas that the person who wore the disguise would have access too, you can even be disguised as some targets you kill to gain access to other targets. If you have patience and aren't expecting action packed gameplay, then totallly buy this game, but be warned it's entirely possible that it could not work for you. buy it and then refund it if it doesn't work, and just but it on playstation. this is by far my favorite hitman game, some of the mechanics that get you detected both in mission and after mission are missing from the other games, i recomend hitman absolution if you prefer a more smooth game and both easier and harder, it's better for new people but veteran hitman players might find absolution easy, but anyway i rate this 9/10 purely because the animations and voices are really outdated, if you know what to look for in the cutscenes, this game does have a story. i have a challenge for anyone who reads this, play through the whole game on pro without killing anyone except your targets, the tutorial doesn't count.",
            "review_score": "1"
        },
        {
            "review_text": "Best Hitman game in the series! I loved Hitman since the first (still have it on CD).   This is basically a murder simulator. Disguising, hiding bodies, poisoning, stabbing, shooting, exploding, crushing, injecting, bombing, human shielding... it's great.   Multiple ways to complete missions and I've beaten it multiple times just trying to do every map differently. Get it, even if it is outdated! It is the best of the series.",
            "review_score": "1"
        },
        {
            "review_text": "Bald man with barcode breaks free from grocery store shelf and takes revenge on ♥♥♥♥♥♥♥ customers.   142/10",
            "review_score": "1"
        },
        {
            "review_text": "Ignore the play time. I freaking owned this game in every fashion on ps2. The graphics on PC are AMAZING in comparrison, and to this day this remains the only true murder box game. When you've gotten good at this you realize that you are not finding your way to the target; everyone there is stuck with YOU, the predator. Nothing beats the satisfaction of murdering all 114 people dressed as Santa Claus in the party mission. You can feel like the monster in any slasher flick, or the stone cold murderer of any action film. Amazing game with suprising customization for the time.",
            "review_score": "1"
        },
        {
            "review_text": "The Hitman series has always been known for its mix of stealth and action gameplay, and this entry of the series is no different.  The game plot is revealed by a series of interview pieces with a retired police officer, in which he usually tells something about the death of a certain person that most people thought something (a different story to the public) and turns out it was something entirely different involving 47. At first these don't make much sense, but as you play the game, you start to see where the plot is going, there aren't many remarkable points on it with the exception of the ending (which is amazingly delivered), so no spoilers.  The gameplay of this game follows the tradition of the old entries of the series, which is a good thing since it is what makes this series unique: you receive a briefing showing the place, who you have to eliminate, the background story of said person/people, then you choose your starting equipment and you are ready to go. What makes the game unique is that you can play in a stealth approach: observing enemy patrols, finding out how to infiltrate certain places, and planning a way to get close enough to take out your target or even how to take them down from afar.  One of the main features of the game that is still intact is that 47 is still a master of disguises and has the ability to change his clothing in seconds (it may sound a little weird, but it explains how someone can do the stuff he pulls off), which in most cases is the only way to access certain locations in the game. For instance, only workers can enter a part of the opera house that is still being build, I mean, you can enter without disguise, but that will attract attention AND the guards of the place.  An addition made in this game, is that now 47 can move faster while sneaking, in previous games, it was hard and painful to sneak around because it was too slow. He can now throw coins around to lure people to someplace where them and 47 can have a more 'personal conversation' or simply use them to lure guards out of posts and such.  Although it is a stealth game, it is different from what the conventional stealth games are and play. In here, you don't use the darkness to hide, you use the people and your disguises, you can crouch behind something, but don't expect that to go unnoticed: people react to your actions, and someone sees you sneaking around or behind people, they will react properly.  It is weird that people only bother listening to YOUR footsteps. For instance, there's this guard walking with another close to him, he'll do his job normally, then later you take out one of the guards and take his place, the other guard WILL start looking back and perplexed stare at you. These things are a little annoying because it happens only with the player. Since you can't sneak all the time without calling unwanted attention, you have to adapt to survive, and having access to a plethora of ways to approach a place/person is what increases its replay value and makes it unique.  Also a new feature is the introduction of Accidents. 47 can now push people off rails, roofs, etc, or he can just knock them out and THEN throw them off such places. This adds even more different ways to complete the assignments. Since the money you earn is determined by your performance in the missions, things as killing innocent people or be seeing doing something suspect all count towards your final rating. If someone saw you, you CAN kill this people as a way to have no witnesses, but the game will not penalize you if you can make it look like an accident, this is a nice addition.  You can now also customize your weapons, like putting a silencer in your Baller pistols or SMG, or putting a more precise scope at your rifles. Upgrading equipment is also possible now, such as decreasing the time it takes to lockpick a door or increase the distance of where you must be to detonate your remote bombs.  A new possibility now in case things get hairy is the ability to take people as human shields. But besides the obvious purpose it also serves as a way to take someone faster to a certain place. For instance, instead of having to wait till the person is knocked down with the effect of some of your tranquilizer syringes and then drag them somewhere more discreet, you can grab then and 'quickly' get them elsewhere and THEN knock then out without worrying with the possibility of someone seeing you.  In the graphics department, the game handles very well, its attention to detail is remarkable and every place in the game looks convincing, from a suburban house to a rehabilitation clinic or a Mardi Gras parade.  The soundtrack in this game is amazing, it server to set the mood for the missions but also to tell the player of the current situation, if something goes wrong and you're about to get shot by the guards, you'll know before hand because of the song that will start playing. The voice acting is really good, David Bateson delivers a believable cold Agent 47 as always, and Vivienne McKee does a great job bringing the faceless Diana to life in her 'cold but sometimes caring' voice. The NPC's voices sometimes are goofy and funny but noticeable intended as a way to ease the tension in the game.  The big arsenal of weapons, equipments, and disguises give the player a lot of freedom to approach the missions. Being stealthy and infiltrating a place from the back or even the front, or simply go guns blazing, be certain that you can always surprise yourself when things DO work even when you try to be more creative.",
            "review_score": "1"
        },
        {
            "review_text": "Just as good as Silent Assassin and Contracts but with better mechanics and a few really great missions. Also has one of the coolest endings to a game.",
            "review_score": "1"
        },
        {
            "review_text": "Played this game since it came out. 3 Words...Best. Game. Ever. I have played the whole thing on all difficulties so many times I lost the count. All the houres I've spent playing this game, I dont regret any second of it!  This game is about a man called Hitman or Mr. 47 as hes also know as. The missions is about to find the target and kill him as assasin as possible. This is a game like Grand Theft Auto there you can do it however you want. Like, you can choose if you want to kill em as assasin as possbile or if you want to take like a ♥♥♥♥ing Machin Gun and shoot everyone down you can do that...but the game is more fun if you play assasin!  There are alot of eastereggs in this game. Spoiler:    There are one easteregg there you can shoot a hidden coin and it comes out 8 naked gay guys and clapps for you :P     I'll give this game a 10/10  Cause it never gets boring! :)",
            "review_score": "1"
        },
        {
            "review_text": "Better than Hitman 2016",
            "review_score": "1"
        },
        {
            "review_text": "One of the greatest games of all time. Replayablility is almost infinite. I have been playing this for years, first on a non-steam copy, but it's so good I had to get it on here as well. I have STILL been playing it, just to try to get different situations to happen.  BUY THIS AND YOU WILL NEVER GO BORED!            *SPOILER* It's so replayable that I actually don't know if I found all the ways to kill people yet. I only recently found out that during the christmas adult film level, agent47 can shoot out the pool from the ground floor, it's glass. It looks really dumb because they fall super slow, but the first time I found out about this was when I stood in the pool, goofing off, and blew up the pool. I thought I broke the level because we all fell so slow. Nope. It's a feature.  Another example of the endless ways to kill people, in the Vinnie Slugger Sinistra mission, the skylight for the indoor pool can be shot, and when the glass falls, it insta-kills. Seriously, 11/26/2014 I find this and I have been playing this game about a year after it came out. I'm sure there are still more I need to find.",
            "review_score": "1"
        },
        {
            "review_text": "A game that makes you think. Innovation at its finest.",
            "review_score": "1"
        },
        {
            "review_text": "Better than it's sequel. 5/5",
            "review_score": "1"
        },
        {
            "review_text": "Lets see how sneeky you really are. ",
            "review_score": "1"
        },
        {
            "review_text": "Really enjoyed this. Solving the levels can be fairly tricky if you are aiming for a perfect score (ESPECIALLY without a guide), however this is definitely the best Hitman game (That is unless the new Hitman beats it). If you have to get one Hitman game, let it be this one. However you will require patience, creativity, initiative and the ability to learn patterns of NPCs as well as level layouts. You also are not as acrobatic as Sam Fisher, which isn't of course a negative, but it is something you should be aware of. +Tense and exciting stealth action +Fairly long with plenty of replayability +Interesting settings with fairly interesting stories and goals in each other +Excellent graphics for the time, and pretty good graphics for today (If you change the config file to display in 1080p -Not for the impatient",
            "review_score": "1"
        },
        {
            "review_text": "great way to blow off steam. tons of ways to finish levels. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "bald dude that's a real buzzkill at social gatherings.",
            "review_score": "1"
        },
        {
            "review_text": "Hitman Blood Money is my first experience with the franchise and i loved it. I was a little worried that the dated graphics would bother me but it honestly i was having to much fun to even notice that this game came out in 2006. I'd recommend this to anyone as it doesn't take a great computer to run it. The one downside of this game is that it often crashes the only way i got to play the game was by spamming enter at the end of every mission.",
            "review_score": "1"
        },
        {
            "review_text": "This is possibly the best game ever. I always feel like a badass playing it. Buy it!",
            "review_score": "1"
        },
        {
            "review_text": "This game has a lot of replay value.",
            "review_score": "1"
        },
        {
            "review_text": "You literally get to choke the chicken.",
            "review_score": "1"
        },
        {
            "review_text": "This one is my favorite in the series, due to the awesome locations.",
            "review_score": "1"
        },
        {
            "review_text": "Played This On PS2 and still have the copy for ps2, Good Game to mess around",
            "review_score": "1"
        },
        {
            "review_text": "Beatiful game, my favorite in the Hitman series! Bravo!  10/10 IGN 10/10 First Lady's Dog Slaying",
            "review_score": "1"
        },
        {
            "review_text": "This game has a grape atmosphere, large and interactive areas and lots of ways to complete missions.  One of my favourite games ever",
            "review_score": "1"
        },
        {
            "review_text": "It remains the very best one in the series.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely fantastic, the jewel of the amazing series. Get this game NOW. Blast through or silently dispatch, it's amazing.",
            "review_score": "1"
        },
        {
            "review_text": "Personally in my opinion, and many other people, this is the best Hitman game in the series. I played this all the time back on my PS2 and playing this on PC is giving me such a nostalgia trip. You aren't in small, compacted levels like you are in the newer entries. You traverse large, open levels full of secrets to discover, obstacles that block you from getting to your target, and of course, people to kill. If you have wanted to get into the Hitman series, but are confused about where to start, then I highly recommend this. Easily one of the best games that I've ever played",
            "review_score": "1"
        },
        {
            "review_text": "Might be one of the greatest games of all time. I keep coming back to this game every other day.  TL;DR You're given a task, complete it by any means necessary or which you see fit. No guidelines.  You're a hitman. You're given a target. You're given an item to retrieve. Do it by any means nessessary. No rules. No boundries. No guidelines.  Every Level has about 10,002 ways to complete it, ranging from total silence to guns'a'blazing, and everything in bettween. In almost every level, there are 16 different characters that you can disguise as and complete the level with, and you're free to switch bettween them.   The beauty of Hitman is, you can challange yourself. Challange yourself to never change disguises, challange yourself to hide all bodies, challange yourself to kill all civilians. This is basically postal 2 reimagined as a professional.   There are 16 Fully designed levels, which is way more than you get from games such as Battlefield, COD and Modal of Honor.   Only Con is that the leaderboard system is broken, so you can't compare scores worldwide.",
            "review_score": "1"
        },
        {
            "review_text": "One of THE best game in Hitman series. Like all hitman games, this one is all about perfecting your strategy to kill your enemies, while reaching for highest score. If you are a hitman fan or stealth/assassin based games, it will surely please you. Get it, play it...until the next hitman game comes out!",
            "review_score": "1"
        },
        {
            "review_text": "This game has a grape atmosphere, large and interactive areas and lots of ways to complete missions.  One of my favourite games ever",
            "review_score": "1"
        },
        {
            "review_text": "Shooting the crap out of ABSOLUTELY EVERYTHING is the only way to play this game.  Stealth? What's that? All you need to win is bullets. Bullets solve everything.  Storyline? NAW, JUST KILL EVERYONE. Trust me, it's more fun that way.  Buy this if you want to experience one heckuva manly game.",
            "review_score": "1"
        },
        {
            "review_text": "Best Hitman to date  Genuinley cannot say a bad thing about this game, just play it for yourself",
            "review_score": "1"
        },
        {
            "review_text": "Don't let my Steam hours fool you. I played this game on the original Xbox when it first came out, and I've likely logged days or even weeks playing just my favorite levels. Hitman: Blood Money is great fun, even after you've beaten every level. It's one of the most replayable games I've ever played simply because of the amount of ways you can complete your objectives.",
            "review_score": "1"
        },
        {
            "review_text": "A very enjoyable game from the Hitman Series",
            "review_score": "1"
        },
        {
            "review_text": "The best Hitman game.",
            "review_score": "1"
        },
        {
            "review_text": "Arguably the BEST in the Hitman franchise. Quite possibly my favourite in the series.  - Still the only Hitman game that has weapon customisation (WHICH ISN'T A SOUL CRUSHING GRIND TO ACHIEVE. I'M SQUINTING AT YOU, ABSOLUTION.) Check. - Seducing some retired baseball player's drunken wife whilst he's down the hall and face down with a set of hedge trimmers imbedded in his skull. Check. - The murderous Mardi Gras massacre... killing (almost) everyone whilst you're dressed as a bloody chicken. Check. - Running for your life-ending life whilst some nearly naked psycho ♥♥♥♥♥/fallen angel chases you round a fancy party with an endless supply of stilletto knives. Check. - THE SWEET, SWEET, SUCCULENT BRIEFCASE. Check. - The taint moistening final mission known as 'Requiem'. Check. - And on that note, laughing ceaselessly at Sir Stephen Hawking's evil American cousin flying down the stairs like a 1960's Dalek, even though there's a perfectly good ramp next to said stairs. Checkmate.  Only downside, NO CONTROLLER SUPPORT. ;_;  11/10, would always play again.",
            "review_score": "1"
        },
        {
            "review_text": "Fun way to learn how to be a terrorist when you grow up",
            "review_score": "1"
        },
        {
            "review_text": "Although I love Hitman: Absolution, Blood money seems to be a better all-around game for me. The ability to customize your equipment and redo missions in different ways on different difficulties makes this game stand out as something you don't just beat once and put it away. The replay value in this game makes it the best Hitman game in the series. I highly recommend this to anyone who likes the stealth game genre.",
            "review_score": "1"
        },
        {
            "review_text": "Easiest and funniest Hitman game Good stealth elements Decent shooting Well designed maps &amp; interactions",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game, with challenging missions and tons of replayability.",
            "review_score": "1"
        },
        {
            "review_text": "The only hitman game worth playing. They nailed it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is old, but it is so good. Stealth Action. I Dressed up as a clown and machine gunned the poolboy 10/10 would play again.",
            "review_score": "1"
        },
        {
            "review_text": "The best way to remain unseen is to leave no witnesses.",
            "review_score": "1"
        },
        {
            "review_text": "it's better than absolution with the whole 'open world' thingie",
            "review_score": "1"
        },
        {
            "review_text": "A timeless classic. It's so cheap too at this point, so just buy it.",
            "review_score": "1"
        },
        {
            "review_text": "A Great Game And I'm Suprised That Not Many People Know About It. It Came Out First On The PS2 And Was The ♥♥♥♥ Back Then. I Love This Game So Much And It Will Bring Out Your Sneaky And Evil Side. Also It Has Some Funny ♥♥♥ Momment (SPOLIER ALERT- It Has A Momment Where You Can Kill A Guy By Puting Poision On A Par Of Panties And One Of The Guards Sneaks In And Gets A Sniff, Then Its Lights Out For Him XD )",
            "review_score": "1"
        },
        {
            "review_text": "Good game, but there is no Gamepad support, and no third party software is going to save it. The game was ported pretty well on PC, is just that they didn't implemented Gamepad support, and that really baffles me, especially that this game was released in 2006, in that year every damn console to PC port should had Gamepad support but this doesn't. Recommended for Keyboard/Mouse users, not recommended for Gamepad use. I don't even know if I should choose 'Recommended' or 'Not Recommended', But it's a great game, and there are more people with PC's that play on a keyboard, so I reccomend this game.",
            "review_score": "1"
        },
        {
            "review_text": "While Hitman: Blood Money kind of has an odd start (I'm pretty sure the tutorial was more focused on showing you how cool they are for adding new features instead of actually teaching you the features), I think it definitely turns out to be a great game. I wouldn't say the game is very hard, but it does take strong attention-to-detail and overall good observation of people's walking movings and general behaviors to even reach your enemy. I currently haven't played any of the other games except Absolution, so I will just give pros and cons for a new person to the series rather than a Hitman veteran.  Pros:  - Solid execution that makes this game still fun 10 years later without feeling dated. - Great level design which gives you a choice in playstyle; it could be possible to beat one level 20 times, based on what traps, weapons, and disguises you use. - Fun levels which almost make you excited or scared based on your situation; all levels are truly entertaining. - Great introduction of storyline -- The game's story takes place in the present, tells you a little more about the story and Agent 47, and sends you in a non-linear flashback of one of Agent 47's hits. This allows you understand the gameplay and story easily, and learn about Agent 47's life. - Changes future difficulty of levels with Notoriety. Obviously, in real life, if you shot up a drug lord's factory, it would be all over the news, and people would eventually find out an idea of the guy who did it. Because this is in the game, people will eventually figure out who keeps killing these people, so you'll end up being hostile to guards before you even really start the mission. It makes you have to understand how to limit witnesses and having your cover blown. Luckily, you can reset things like this for paying money to fix it, but it's still a pain in the butt and would be easier to just stealth. - On another note, the game encourages you to do things in a somewhat subtle way, unlike the notoriety. If you drop your weapons or leave your suit behind, this can not only change notoriety a bit, but it costs money for the Agency to retrieve it, so you have to pay a fee. On top of this, killing civilians with no witnesses also costs a fee for obvious reasons. - Intelligent AI during missions. So many games I've played where AI ignore key things like blood trails that humans would clearly follow, but Hitman: Blood Money pretty much has it to where AI act as intelligent human beings.  Cons:  - Unfortunately, there are some weak points of the pros I described. A problem in the AI is that they ignore weapons dropped on the floor, this becomes really obvious in the 'Flatline' mission when you place your guns down. - The tutorial is pretty bad. - This being a game from 2006, there are parts that really make this game show its age and feels frustratingly dated, and kills a lot of the immersion. However, these parts I could count on one hand, and are very rare.  Overall, I strongly recommend this game, as I had a lot of fun and really experience something I hadn't felt before. This is a really nice concept and I played it constantly for a while. This is the best Hitman game in the series, and if you're looking for a good stealth game to get immersed into, this is a great game to start with, or even try if you're a stealth expert. No matter your experience with stealth or Hitman, this is a great game to play and you'll definitely have a lot of fun with it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome Learning curve is amazing and story is sweet highly reccomend this game to ALL",
            "review_score": "1"
        },
        {
            "review_text": "If being an assassin is your thing, then this game is right for you.",
            "review_score": "1"
        },
        {
            "review_text": "THE BEST HITMAN GAME EVER!!!",
            "review_score": "1"
        },
        {
            "review_text": "really hard and trial and error but extremly rewarding when finaly able to take out the target without being spotted",
            "review_score": "1"
        },
        {
            "review_text": "Agent 47. Very good start, check. Missions in Europe and USA. Check.  Customizable Silverballer. And Sniper Rifle. And its suit case. Check. Cable wire, poison, explosives. Check. Sedatives for civilians. Limited but check. Saves per mission limited, but not quite an issue.  Omniscient map, highlighting targets and guards. Uhuh check. Not-trigger-happy-unless-they-see-you-with-a-gun guards. Check. Tape dependent cameras. Check. Pervert FBI agent. Check. :)  Good plot. Check. Good music. Can't beat Ave Maria as main theme. Check.  Lacking an achievement for being asked by a policeman if i'm okay, after i got wounded by the target. Lacking an achievement for being described by the press as 'professional with little experience with firearms', after killing a target with ten bullets in the head. But recommending anyway. Check.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely amazing game!!!  I play it almost every day.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, no lag, good-ish graphics, amazing gameplay... the best game in the Hitman Series, by far.",
            "review_score": "1"
        },
        {
            "review_text": "Before there was ever Surgeon Simulator, there was this masterpiece: Waiting Room Simulator. Wait hours and hours for something to happen! But wait there's more: by golly what you wait for just won't happen, expect the unexpected as that AI decides to randomly spot you and ruin your 6 hour wait time! Let the physics hijinks ensue, they're fun for the whole family!",
            "review_score": "1"
        },
        {
            "review_text": "This is the best Hitman game currently for sale. Obviously some of the controls and gameplay mechanics are a little dated, and the graphics are definitely showing their age, but the level design, options for dealing with each mission, and no-BS mission delivery system are all superb.  The levels are huge, freely roamable, and logical. Stealth is rewarded but if you're just trying to finish the game, outright violence works fine, too. As long as you get the job done.  Free of the goofy cartoonish personalities and faux-dramatic emotional story of Absolution, Blood Money's story takes a backseat to the actual mechanics of hunting people down and killing them. How you complete the job is up to you, as it should be. Plan your own route, choose your equipment, observe and recon before taking action.  The downsides: some of the controls take some getting used to, the AI has some unexpected behaviours (which usually result in them shooting you for some infraction you weren't aware carries the death penalty, such as forgetting to wear a costume to the costume party), and, in my opinion, some of the early-game unmodified weapons are just so poor that they are almost unuseable (the sniper rifle before it is upgraded, for example).  Still, if you like games of patience, skill, and outwitting, plus killing people, this is the purest form of Agent 47 currently available.  I am looking forward to Hitman 5 this year, which promises to undo many of the mistakes of Absolution, but I'll believe it when I see it.",
            "review_score": "1"
        },
        {
            "review_text": "Graphics and gameplay are just so enough to play although it was released on 2006. Remarkable!",
            "review_score": "1"
        },
        {
            "review_text": "Gold, best hitman game IMO",
            "review_score": "1"
        },
        {
            "review_text": "Cool game I like this game!!",
            "review_score": "1"
        },
        {
            "review_text": "The best and last good experience i had with the Hitman series.",
            "review_score": "1"
        },
        {
            "review_text": "You kill niccaz wit all sorts of shizzit, you play az a no hair wite nicca, bkut it mite bke witeface cuh",
            "review_score": "1"
        },
        {
            "review_text": "Walked into a mans house, shot his wife with a silenced pistol, poisoned the pool boy, stabbed a grounds keeper, then fiber wired the man. Then I went home and played this. 10/10 would stab grounds keeper again.",
            "review_score": "1"
        },
        {
            "review_text": "FLIPPIN AWSOME 10/10 in my opinion blood money has to be the best hitman from the wide range of levels and heaps of guns the game has so much to offer.",
            "review_score": "1"
        },
        {
            "review_text": "Do it I swear to God I will kill you if you don't.",
            "review_score": "1"
        },
        {
            "review_text": "One of my favourite old school games.It is fun to play when you are bored and is very easy.Love playing missions all over again and love to mess around with this.This game was worth it for the price and is very entertaining to me.My opinion this game is the best Hitman out of all the Hitman sereis.If you love a good and fairly easy game try this.Buy it now its only $8.00 and is very fun.",
            "review_score": "1"
        },
        {
            "review_text": "Better than the disapointing Absolution, and not cut into pieces like the latest 2016 one. Creative kills and non frustrating disguise mechanics make it the highlight of the series. Only a dollar or two on sale, a MUST buy for stealth fans",
            "review_score": "1"
        },
        {
            "review_text": "Absolution is much better, but this game is alright.",
            "review_score": "1"
        },
        {
            "review_text": "9/10, a level with other hitman games, except the new Absolution, which is not that good",
            "review_score": "1"
        },
        {
            "review_text": "Not a huge Hitman game franchise fan but this one is best of them all.",
            "review_score": "1"
        },
        {
            "review_text": "Better than the disapointing Absolution, and not cut into pieces like the latest 2016 one. Creative kills and non frustrating disguise mechanics make it the highlight of the series. Only a dollar or two on sale, a MUST buy for stealth fans",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic Game , 10/10 A must have absolute Classic !!",
            "review_score": "1"
        },
        {
            "review_text": "-Dress up a a clown -Pull out a fully modded rifle -Murder an entire neighborhood - 10/10 best Joker sim in the world",
            "review_score": "1"
        },
        {
            "review_text": "I touched a sexy dog on the backyard and got killed by her FBI friends. 10 molested dogs out of 10.",
            "review_score": "1"
        },
        {
            "review_text": "This game so awesome. The last release before the SquareEnix buyout so it's completely classic playstyle. I own the entire series except for Contracts and this is a must have.",
            "review_score": "1"
        },
        {
            "review_text": "Great plot, fantastic locations, decent missions and your own hideout. True legacy after Contracts.",
            "review_score": "1"
        },
        {
            "review_text": "The best hitman",
            "review_score": "1"
        },
        {
            "review_text": "        YouTube™ Video:  How To Sing Ave Maria In A Tank&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Love the fact that you do not do 3 missions in russia,then 3 missions in middle east,then 3 missions in japan like in first 3 hitman games.Really interesting missions,amazing graphics and some new features in this game make it a must play. Score : 9/10",
            "review_score": "1"
        },
        {
            "review_text": "👌👀👌👀👌👀👌👀👌👀 good ♥♥♥♥ go౦ԁ ♥♥♥♥👌 thats ✔ some good👌👌♥♥♥♥ right👌👌th 👌 ere👌👌👌 right✔there ✔✔if i do ƽaү so my selｆ 💯 i say so 💯 thats what im talking about right there right there (chorus: ʳᶦᵍʰᵗ ᵗʰᵉʳᵉ) mMMMMᎷМ💯 👌👌 👌НO0ОଠＯOOＯOОଠଠOoooᵒᵒᵒᵒᵒᵒᵒᵒᵒ👌 👌👌 👌 💯 👌 👀 👀 👀 👌👌Good ♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "I left my review here this afternoon... I was told it would be held in the steam database... Can I have it please?",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic Game , 10/10 A must have absolute Classic !!",
            "review_score": "1"
        },
        {
            "review_text": "One of the greatest games of all time. Almost flawless in every way. Truly an experience that must be enjoyed before you die.  Personally I recommend that you do not play with the assistance of walkthroughs or play after already spoiling the whole game for yourself (watching it on YouTube).  Fantastic writing, symbolism, and cinematography. Everything makes sense in this game. Simplistic, and yet despite it's simplicity, it touches on deeper, more complex phsychological topics. Fantastic on so many levels.   TL;DR: Best game I've ever played, and it only cost me $2 during the Steam Winter Sale.  11/10.",
            "review_score": "1"
        },
        {
            "review_text": "Played this as a kid (probably shouldn't have considering the sexual themes and violence but ♥♥♥♥ the world) and it still holds up today.   Its one of the best from the PS2/Xbox generation and looks glorious in 1080p maxed out on PC. It looks as good as I remember, even though the PS2 version I'm sure looked worse even though it is one of the best looking PS2 games.  The only issue is it can be a bit easy and sometimes all you need is the right disguise to ace a mission unlike in Silent Assasin which has diffrent mechanics in terms of AI in some ways. Sometimes you can just toss a bomb over a barracade in a crowded bar if you get in the right position and sneak, I did this in the Vegas mission on the 2nd highest difficulty but the highest difficulty this might be impossible to get away with.  Regardless this was the pinnacle of the Hitman series. I havn't played the new 2016 game but it looks like they copied alot of Blood Moneys mechanics and threw away that awful Absolution idea, which is great.  Everything about the setup was perfect, upgrading weapons before it was common place in games, hop in any mission you want as long as you are that far in the game at any difficulty you want on the fly aswell as the missions being relatively short depending on your play style. Free form gameplay where you can either just gun your way through every level or sneak your way through and you get a rating afterwards based on your actions. It was really one of my favorite games from one of the best devs of the era IO interactive was really on their game back then. Shame Freedom Fighters isn't on steam.",
            "review_score": "1"
        },
        {
            "review_text": "The game is awesome. The best hitman version I ever played. My childhood. Definetely recommending it. If your mind is to buy a hitman absolution, the blood money is totally worth it.",
            "review_score": "1"
        },
        {
            "review_text": "FFS!!! why AI stupid......",
            "review_score": "1"
        },
        {
            "review_text": "Might well be the jolliest Hitman game, at least it's the one with the prettiest graphics and the least clunky controls.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games I have ever played!",
            "review_score": "1"
        },
        {
            "review_text": "What makes Blood Money stand out in my opinion is the scenarios seem so much more fun and elabroate. A game that can be gotten cheap and played for hours.",
            "review_score": "1"
        },
        {
            "review_text": "Live out your dreams of being PAID to kill people!",
            "review_score": "1"
        },
        {
            "review_text": "A truely unique experience that can not be recreated. IO Interactive have no clue how they did it. It's one of the epic gaming mysteries. How all the enemies look identical to everyones geography teacher still baffles scientists today.",
            "review_score": "1"
        },
        {
            "review_text": "  i got stuck on the first level  pro tip: zoom in with sniper rifles with X  X",
            "review_score": "1"
        },
        {
            "review_text": "I have 2 hours in this game. These two hours consist of my replaying the first intro level trying to make it work. Everytime I finish the level, I crash and I have to start it all over again. I can only play the first intro level.  I'm using Windows 8.1, and I have searched the internet all around trying to find a solution, but nothing seems to work. This game looks incredible, I'm just so sad that I can't play it. So I suggest you don't buy this game if you don't know if it's going to work or not. It might just become a huge bummer for you.  EDIT: Sorry this above wasn't helpful to everyone, but I would like to state something. Windows 10 just magically fixed the game and now it's running like a charm. Still, wouldn't reccomend buying the game if you're still running Windows 7 or 8, but if you have 10. BUY! This is an amazing game that I have been lucky to play. I have now finished the game ( the time represented is not correct, for soe reason the counter bugged or something so it won't show all of my hours), and I can say, this is one hell of a game!",
            "review_score": "1"
        },
        {
            "review_text": "it's like skyrim with money",
            "review_score": "1"
        },
        {
            "review_text": "Highly Recommended !",
            "review_score": "1"
        },
        {
            "review_text": "Decent game. Its glitched for me so i cannot beat the 2nd level :/ but i enjoyed playing it. Get it its worth it plus it goes on sale a lot.",
            "review_score": "1"
        },
        {
            "review_text": "Its good for an old game with the game mechanics it has and would recommend it to people who like shooters with a tactical feild awant to feel like a badass after taking down the target how ever they please",
            "review_score": "1"
        },
        {
            "review_text": "Murdering people to 'Ave Maria' has never been so sweet. This game totally satisfies my inner psychopath. When I poison some donuts and effectively take over an FBI command post; or bum rush a cop in an empty alleyway with a piece of piano wire just for his uniform; and no one even notices, I have this overwhelming feeling of dread and doom for everyone in the area. Theres a few bugs and glitches, and the AI routes could use a bit more randomness, but the graphics and replayability are pretty damn good. I'd give it an 8.5/10 (Also: gotta take off points for not being able to jump on command (I like games that jump); This game could totally use some 'Manhunt' shadows, that would make this game so epic I think)",
            "review_score": "1"
        },
        {
            "review_text": "The best experience in a game to have come out that year. One of the best of all time.",
            "review_score": "1"
        },
        {
            "review_text": "For fans of Hitman, it's an awesome game. I've played Absolution and I still prefer Blood Money. Yeah, the AI is not always perfect and sometimes the body fall on the floor a bit weird or not as you would expect them...but the missions in Blood Money are so fun to play over and over again. There are so many different ways of completing every single mission in this Hitman game that it is worth the little inconvenience with the AI sometimes.  9/10. Anyone that likes Hitman games or sneaky assassin games.",
            "review_score": "1"
        },
        {
            "review_text": "If you can play like a pro you'll have fun. If you ♥♥♥♥ up on a regular basis then you'll have even more fun. Just don't play any levels with the intention of going in guns blazing because it really is not what the game is about. Hundreds of variations on what you can do to assassinate the targets, usually along the lines of playing dress up and being alone with or setting up traps for the victims.",
            "review_score": "1"
        },
        {
            "review_text": "this game is good for people that like spy or skill games ",
            "review_score": "1"
        },
        {
            "review_text": "Shot a guy in a chair so his body would spaz out and shoot 20 feet in the air.  10/10 would spaz again",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "How to murder people: the game",
            "review_score": "1"
        },
        {
            "review_text": "This game has some awesome level designs, which provide multiple ways to complete your missions and when you successfully complete an assignment you are always left with a sense of grim satisfaction.",
            "review_score": "1"
        },
        {
            "review_text": "A masterpiece of epic proportions.  Be the ultimate assassin.... Its all about the silent kills!!",
            "review_score": "1"
        },
        {
            "review_text": "I. Love. Hitman. Ever since I got my hands on Hitman 2: Silent Assassin I've been a fan of this game. Now IO Interactive and Eidos have seriously improved the series and Blood Money is the best in terms of the many different ways you can complete a mission. It's just pure, raw, stealth. You have DOZENS of ways to kill your targets in inventive or... very blunt ways :P  Visually. It's great. Storyline? It's all in retrospect about what 47 has been up to as some people are looking for him. Jesper Kyd creates another sinister soundtrack that mixes well with the gameplay and all in all, this game. Is. Amazing. The addition of the 'notoriety' system means that if you make too much noise or gain too much attention, people will slowly recognise you in later missions if you don't bribe officials. It's awesome. But if your a 'Silent Assassin', you can save your cash for super upgrades for your already crazy Hitman arsenal :) Buy this game. Hitman Absolutions is next so try this game out now!",
            "review_score": "1"
        },
        {
            "review_text": "GREAT GREAT GREAT!! sixth favourite game of all time. An absolute gem of a game!! Agent 47 is kick ♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "best game so far besides absolution this game is art",
            "review_score": "1"
        },
        {
            "review_text": "the game is fun and the levels are awesome",
            "review_score": "1"
        },
        {
            "review_text": "This game is a masterpeice. The cinematics are beutiful and help further the story in a way that makes it feel like a movie. The stealth mechanics are just about flawless and I absolutley love how every kill can be made an 'accident'. Despite a sharp learning curve it's a great game that is well worth buying.",
            "review_score": "1"
        },
        {
            "review_text": "Why are you reading this review BUY THIS GAME all the cool kids are doing it ♥♥♥♥ absolution",
            "review_score": "1"
        },
        {
            "review_text": "my graphic card cant play hitman absolution",
            "review_score": "1"
        },
        {
            "review_text": "shot gangster in the head and it flew 20 feet 10/10 would shoot gangster in head again",
            "review_score": "1"
        },
        {
            "review_text": "Best Hitman Game Ever.  We don't need any more words.",
            "review_score": "1"
        },
        {
            "review_text": "Hitman: Blood Money is an awesome stealth game, and I had been trying to find a proper stealth game when i picked it up on Xbox 360, when i built my PC it was the first game i bought for it :)   11/10 Too many ways to kill a target",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "Followed a man into the toilet. Proceeded to watch him do his business. Killed him as he saw me in the mirror. Didn't even wash his hands.  11/10 Would be unhygenic again",
            "review_score": "1"
        },
        {
            "review_text": "I have played this game on every console I have owned that has had it on - my PS2, my Xbox 360, and now my computer. I have completed it on every difficult more times than I can count, and spent more hours on this game than any other single game I have ever played. That should really sufficiently convey how much I love this game, so let's break it down. Pros: Replayable - I certainly find it endlessly fun to replay a mission, even if I have got the highest ratings on it. Fun - Whether you play the levels seriously and try and be stealthy, or if you just want to fool around and go crazy, this game will fit either style. Tough - It can be unforgiving, especially on the higher difficulties. Purchasing Upgrades etc. - You can buy upgrades with money you earn on contracts. The better your rating, the more money. Notoriety - The worse you are and more witnesses you have, the higher this factor gets. This makes guards see through disguises and recognise you much more easily. You can pay bribes after missions to reduce this. Humour and secrets - A number of great jokes and hidden bonuses can be found  Cons: Story - A bit disjointed, but not bad overall really. Graphics - Dated but not the worst for its age Physics - Appalling ragdolls and other physics on explosions and fire, even for the time. Doesn't effect real enjoyment, however. Melee Weapons - You cannot take melee weapons with you out of missions - they are not added to your collection, I mean, so they cannot be chosen at the start of a mission either. Annoying bits with compulsory action: A duel, a chase after a big explosion, and a couple of other occassions take something away from the levels with them in if you are looking for a purest experience. AI - At times incredibly stupid and at others far too omniscient, the AI is very odd. When it comes to basic behaviour, moreover, it does not take many playthroughs to memorise a level and all of the NPC's patrols and routes. This can mean replays are just following a procedure you have found successful before.  Overall, however, a solid 9/10 - one of my favourite games, and the best in the franchise - play this and see how far Hitman Absolution fell.",
            "review_score": "1"
        },
        {
            "review_text": "This is what I think all bald people do.",
            "review_score": "1"
        },
        {
            "review_text": "Big, open maps with tons of ways to kill your target. You can go in shooting, or find a way to make it look like an accident. Much better than Absolution, but not easy on new players. It's a trial-and-error game, so if you feel like the game is too hard or isn't explaining anything, there is always intel to buy and you need to mark your surroundings in your brain.",
            "review_score": "1"
        },
        {
            "review_text": "The fun here is killing however you wish. Be silent. Be painfully obvious. Just be creative and have fun with it.",
            "review_score": "1"
        },
        {
            "review_text": "I'm not really good at this kind of game so I find it kinda hard, when you figure out how to do it, is after 30+ fail attempts, i like it.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ this awesome game althought it born in old age but it is awesomeeeeeee:)",
            "review_score": "1"
        },
        {
            "review_text": "Biggest and most complex levels of any hitman game with a good-enough story, interesting missions and while it is a lot more clunky than the new one the gameplay is far superior.",
            "review_score": "1"
        },
        {
            "review_text": "The best of the series.",
            "review_score": "1"
        },
        {
            "review_text": "Never played Hitman before this.  10/10, better than most next gen games.   Would play again.",
            "review_score": "1"
        },
        {
            "review_text": "Its A GREAT Game For People Who Want A Game That You Can Creatively Kill People But At The Same Time, Completely Murder People With Full Tricked Out Weapons.I recommend This Game To People Who Have Played At Least One Of The Hitman Games.",
            "review_score": "1"
        },
        {
            "review_text": "Well it took me about 19 hours to beat on expert first time around. This is truly one of the best single player games I've played.",
            "review_score": "1"
        },
        {
            "review_text": "The best stealth game out there.",
            "review_score": "1"
        },
        {
            "review_text": "The greatest Hitman game ever created, the sheer number of possibilities on how to finish each level and upgrade your equipment is fantastic. Too bad Absolution was a pile of dookie.",
            "review_score": "1"
        },
        {
            "review_text": "This game is really cool, kill your enemies in various of ways, like rigging a barbecue grill with lighter fluid to kill them.",
            "review_score": "1"
        },
        {
            "review_text": "Despite the graphics, one of the better Hitman games, if not, the best Hitman game for gameplay and lolz.",
            "review_score": "1"
        },
        {
            "review_text": "This game is real funny I play it on WIN7 64bit it's completely working",
            "review_score": "1"
        },
        {
            "review_text": "Best Hitman game NA. If you like to knock out security guards by making them sniff little girl's panties, then this is the game for you!",
            "review_score": "1"
        },
        {
            "review_text": "Possibly the best hitman of all hitman games. BUY this Game!! After you play it, go to your local bar and wait for someone to approach you with your first contract. It will happen. They can see it in your eyes that you have played the game and will want you to work for them.",
            "review_score": "1"
        },
        {
            "review_text": "&gt;sneaking through house  &gt;guard see's me  &gt;♥♥♥♥.jpg  &gt;he puts his hand up to his earpeice  &gt;'WHAT DA HELL?'  &gt;guards at HQ hear it  &gt;shitguyscodeblackhesaidwhatthehell  &gt;operation goes to ♥♥♥♥  What the hell?/10",
            "review_score": "1"
        },
        {
            "review_text": "One of the best stealth games out there. Every level have multiple ways of being cleared and they are all very unique and different from one an other.  if you don't like stealth, you can just go guns blazing and most of the time that works too.",
            "review_score": "1"
        },
        {
            "review_text": "This game is pretty fantastic--like most people say it is definitely one of (if not the) best Hitman game to date. I remember back in 2006 when it game out I watched a buddy play through it and finally decided I should give the series a try. This game takes you all over the world and gives you the tools. How you take out your targets is completely up to you. Be a ruthless murderer or move through the levels without leaving a trace. It is a great gaming experience.  Also Absolution isn't as bad as people make it out to be....but this is much better.",
            "review_score": "1"
        },
        {
            "review_text": "this game is forever although Absolution is new installment of this game.",
            "review_score": "1"
        },
        {
            "review_text": "The real Hitman experiance.  Not like absolution or the agent 47 movies.",
            "review_score": "1"
        },
        {
            "review_text": "Either crawl around only use your wire or kill every inbred hillbilly",
            "review_score": "1"
        },
        {
            "review_text": "verry fun game just finished it and i can say it is definetly worth the small price, its verry good for its age also",
            "review_score": "1"
        },
        {
            "review_text": "Very fun and maybe a little too challenging, even on easy. Great game and you can take whatever route you want in a mission. Obviously, there is one that wields the best results but you can really do anyone you wish.",
            "review_score": "1"
        },
        {
            "review_text": "Really great game :D Ithis is better than absolution. But ties with silent assassin! All those negative reviews are jokes lol",
            "review_score": "1"
        },
        {
            "review_text": "One of my favourite games growing up, probably my favourite sealth game. Way better than absolution",
            "review_score": "1"
        },
        {
            "review_text": "It a game of the year on 2006 great grachics on shader 3.0 and it's nc story on 1-4 and i like this game you know it stealth game and if you want to buy it... just buy and play this game it's awesome on 2006 dude and in 2015 it still awesome",
            "review_score": "1"
        },
        {
            "review_text": "You are supposed to kill men, not hit on them. b8/10",
            "review_score": "1"
        },
        {
            "review_text": "Extremely difficult yet rewarding stealth game. Level design encourages different approaches and replayability is through the roof. The best Hitman game yet.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game, especially when considering it is nearly a decade old. I had played the first two games long ago and while I always loved the concept of the hitman series, there always seemed to be flaws in the series. Hitman: Blood Money more than the others I have played seems to come closer to the concept of the perfect assassination puzzle game. This is a true open level concept with a myriad ways to accomplish your end goal, a compelling ranking system which names you according to playing style and rewards your success with a clever pay structure built for replay. Add to this the many easter eggs and special scenes and Hitman: BM is a wonderful experience. There are a few flaws in this gem (saving/loading is lousy and the character models are dated) but the overall experience makes this game well worth a play through. 8/10  Pros: - Open level concept allows for many play-throughs and different play-styles - Level Design is second to none... even the weaker levels are well thought out and fun to play through - Reward/Newsprint system is fantastic motivator - Weapons are diverse and allow for a variety of kills - Puzzles within each level are fun and challenging - In-level jokes and hidden references are abundant - Final level (Requieum) is one of the better endings I've ever played   Cons: - Save/Load system is awful (the developers tried to enhance difficulty by limiting saves but it just doesn't add to the experience) - Controls are wonky and stiff compared to newer games (translates to a steeper learning curve) - Some of the gaurd response zones/pathing is a little too black and white which can, at times, hurt the immersion (i.e. Stand here and you are fine, but two feet to the left will cause a gaurd to shoot you) - Some of the weaker levels are towards the end of the game so there is less of a build-up then would have been preferred - Character models and graphics optimization shows the games age (though not as bad as you would expect)",
            "review_score": "1"
        },
        {
            "review_text": "The definitive hitman game!  If you like to really play as a hitman, who can trail his targets, think of ways to execute them and then strike in so many different ways, this is the game for you. Not a Splinter Cell clone like its successor.  In this game you get a mission briefing, then can decide hat gear you bring and are dropped into your mission. From that point on you are totally free to do as you please. Whether you go guns blazing or try to be unseen is up to you. You stalk your target and strike once you decide to.   This game is a mixture of an fps shooter and an adventure game. In every level there are lots of ways to get to your target, disguise as different people, use different weapons or objects and it is fun to play the same mission again in a different way.   I own this game 3 times now and have finished it a dozen of times. And it still doesn't get old! An absolute recommendation!",
            "review_score": "1"
        },
        {
            "review_text": "You can be a drunk Santa Clause and blow up a hot tub.... Why don't you have this yet?",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games ever made. Sandbox game taken to the level of an artform (for the technology of 2006 anyway). I have this on my laptop at work and i swear i have played a hundred or 2 hours at least offline its so good (i work split shifts). I'm at the point with this game where I'm going to find out how to record myself playing on professional level silent assasain and put it on youtube. Its Brilliant I hope 2015 christmas is a return to form with the new one (absolution=not a hitman game).",
            "review_score": "1"
        },
        {
            "review_text": "Hitman Blood Money... to put it simply, you play as a bald man who goes around murdering people then you cosplay as them. I got this game on sale and i honestly enjoyed it, after beating it i went and got contracts... much trickier... but this is a blood money page.  Imagine Dishonored but in either first or third person and the ability to disguise yourself being your only power. You can either go in guns blazing and get a bad score, or go in stealthfully (Padding the mission times) and get a good score. If you havent played them before, the best score is 'Silent Assassin' kill only your targets, and no bodies found by people during the mission.  All in all... fun game, highly recommended, and who wouldnt want to play as a bald man that murders people for 'fun'?",
            "review_score": "1"
        },
        {
            "review_text": "This is the last true Hitman title. It isn't just good, it is amazing to play. It never gets boring and i would play it ten times more likely than any newer hitman. Buy it, play it, love it!",
            "review_score": "1"
        },
        {
            "review_text": "story is too short but its great.",
            "review_score": "1"
        },
        {
            "review_text": "Still holds up incredibly well in terms of gameplay and atmosphere. The latter especially is worthy of mention.",
            "review_score": "1"
        },
        {
            "review_text": "Best stealth game ever, countless of possibilites",
            "review_score": "1"
        },
        {
            "review_text": "Hitman: Blood Money is possibly the best hitman game I have ever played. The game puts you in the shoes of Agent 47 who works for the agency which handle assassination of targets. There is no particular story to Agent 47 however each target you assassinate has a backstory and a reason as to why Agent 47 should kill them. The best part of this game is the amount of ways the player can approach a mission if the player wants to snipe the target from a balcony they can, choke the target to death with the wire they can or if they choose to walk up to the target with silenced silverballers and shoot the target in the face they can. The second best part is the disguises that allow the player to hide in plain sight however if the player has been seen by a worker who is wearing the exact clothes that match the players disguise the worker will get suspicious. If you like games where you assassinate targets and hide in plain sight get this game especially if its on sale.",
            "review_score": "1"
        },
        {
            "review_text": "The best you can get from the 2000's Hitman series, and even possibly the whole series so far.",
            "review_score": "1"
        },
        {
            "review_text": "A strangly compelling game that you won't be able to stop once you start it. I finished it in 12 hours and as I said, I couldn't stop untill I had finished it. Best ending in video game history!",
            "review_score": "1"
        },
        {
            "review_text": "Accidents, accidents everywhere. Welcome to the world where pushing people is a sport frowned upon by the general public. You play as agent 47, the best of the best when it comes to pushing people down cliffs, into knee-high water or down a manhole. For bonus points kill the clown and go on a murderous rampage with different guns you can costumise yourself before going into any mission. Just remember: real men kill their targets with [redacted].",
            "review_score": "1"
        },
        {
            "review_text": "im a clown",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "Very good game mechanics. Excellent game!",
            "review_score": "1"
        },
        {
            "review_text": "Great stealth game, if you choose to make it one. I didn't, but whatever. Best one in Hitman series.",
            "review_score": "1"
        },
        {
            "review_text": "Still the best of the bunch.  47/10",
            "review_score": "1"
        },
        {
            "review_text": "If you want perfect level-design, THERE! Have Fun! This is one of the grand masterpiece of stealth game. Not perfect by any mean, but with carefully crafted mechanics that let's the player explore and find tones of solutions in every signle mission (except the intro that kinda sucks).",
            "review_score": "1"
        },
        {
            "review_text": "with stacks of cool ways to go about missions, the game offers a bunch of tools and great variety as you go about as a contract killer and ♥♥♥♥. kinda interesting plot, and fun, satisfying ways to complete missions, it's worth a play even though the controls and gameplay are slightly dated, 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Best game in the series so far. Involves throwing coins at guards to distract them or because you missed a cycle and have nothing else to do.     Using explosives for distraction or to only the target without witnesses still is 'Silent' Assassin   ",
            "review_score": "1"
        },
        {
            "review_text": "If you're going to get a Hitman game, this is the one. There is something about being put into an open-world and asked to kill a target any way you want that just brings out the best in a game.... and the worst of you. So many times I found my self killing people in ways serial killers would find disgusting. But it's okay. It's allowed in this wonderful game.",
            "review_score": "1"
        },
        {
            "review_text": "Though I haven't played the earlier entries, this is probably the best assassination sim on the market. Awesome soundtrack, cool story (complete with twist end), slick visuals, and complete freedom to finish the job however you see fit. Big recommendation.",
            "review_score": "1"
        },
        {
            "review_text": "A lot of fun! Really crisp graphics and clever game play. Not much to say really, it's currently on sale dirt cheap and a must have!  Here's footage of me and my mate failing the first level over and over. Enjoy!          YouTube™ Video:  Cheapo Tuesdays - Hitman, Blood Money&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "One of the best examples of a great stealth game.",
            "review_score": "1"
        },
        {
            "review_text": "'No thanks, I just needed something from the jacket' I said, 'I'll pick up the jacket later.' I never went back for the jacket. FML",
            "review_score": "1"
        },
        {
            "review_text": "Best HITMAN game! Better than Absolution :)",
            "review_score": "1"
        },
        {
            "review_text": "Bald men. Running the world.",
            "review_score": "1"
        },
        {
            "review_text": "A very nice stealth game with many different ways to take down your victims. It is fairly cheap and i haven't had a frame rate drop yet while playing. It has a very nice level design and it constantly keeps you on edge, can be a little frustrating at the start but it is absolutley Fantastic!  Scrore: 9/10",
            "review_score": "1"
        },
        {
            "review_text": "one of the best games i have ever played ",
            "review_score": "1"
        },
        {
            "review_text": "This game may be older, but it is considered a cult classic to this day. The Hitman titles before this one are the perfect brew of quirky, challenging stealth and humor. However, this one is regarded as the best in the franchise because it not only had the elements of the first couple games, but implemented a disguise system, upgraded accident system and above all: unleashed the freedom of sandbox gameplay (something the newest title 'Absolution' did not particularily have).   Basic Overview: You are one of the world's best assassins who was created in a laboratory as a killing machine, plain and simple. Your alias: 47. You work for a smoke and mirrors agency under a mysterious woman named 'Diana' who provides you with targets and mission details. The targets are larger than life, often rediculous and have prices on their heads that can set any average joe up for the rest of his days. The cleaner the hit, the more money in it for you. Your shady bosses have some international pull so weapons and certain things can be planted on the job site to make your work easier. Other than that, you do how you see fit. You can go in there gunning if you think you're strong enough to overpower your target's security. If you don't fancy getting shot, you can sneak in wearing a disguise, infiltrate your mark's hideout, then give them the drop when nobody's looking. There's also the option of say, rigging a chandeliear to fall on somebody's noggin slap-stick style or making someone have an 'unfortunate accident' by falling over a railing. The possibilities are endless! However, whatever inconspicous things you do such as leaving evidence, getting seen by witnesses or getting your cover blown can effect how easily you're detected in future missions. You aren't the only one in the Blood Money game either, any job could be a set up! Are you willing to risk the odds for the payout?  Cons: The controls seem rather 'stiff' and not fluid, especially when moving slowly or pivoting on the spot. There are sometimes annoying glitches such as people falling through floors/doors/walls when pushed and alerting your enemies. The AI can be extremely unintelligent and rag-doll glitchy which can bring some comedy into the gameplay, however, they are crack shots and can be extremely unforgiving, especially when glitched within a close proximity to 47s character. This game is sometimes not compatible in default settings with certain hardware/Windows versions and may crash/not run at all, but a simple patch and or resolution change often fixes these issues. Some level design may seem lazy in parts, but it's still nice to explore your whole environment, which is part of the Hitman experience.   Overall: I give this game an 8.5/10 given it is one of the funest games I have ever played and I still play it from time to time. I reccomend this game if you like stealth games, but you want a hint of free rome and added options in there. If you like linear stealth action, I would recommend the next title in the franchise 'Absolution'. The next game, simply called 'Hitman' boasts it will bring the sandbox element back into its gameplay. I think anything like Absolution's systems with Blood Money's freedom it would be a win/win! Fingers crossed!",
            "review_score": "1"
        },
        {
            "review_text": "sometimes this game is realistic sometimes it's not it's mostly not but still good how do you not notice that tattoo",
            "review_score": "1"
        },
        {
            "review_text": "low memory(4GB)(less then HITMAN:absolution(11GB)) good graphics  so....this game is really great!!",
            "review_score": "1"
        },
        {
            "review_text": "Allan please recommend.",
            "review_score": "1"
        },
        {
            "review_text": "It is a HIT. MAN!",
            "review_score": "1"
        },
        {
            "review_text": "Murdering people to 'Ave Maria' has never been so sweet. This game totally satisfies my inner psychopath. When I poison some donuts and effectively take over an FBI command post; or bum rush a cop in an empty alleyway with a piece of piano wire just for his uniform; and no one even notices, I have this overwhelming feeling of dread and doom for everyone in the area. Theres a few bugs and glitches, and the AI routes could use a bit more randomness, but the graphics and replayability are pretty damn good. I'd give it an 8.5/10 (Also: gotta take off points for not being able to jump on command (I like games that jump); This game could totally use some 'Manhunt' shadows, that would make this game so epic I think)",
            "review_score": "1"
        },
        {
            "review_text": "Killin' noobs and rich people in vegas. Yeah",
            "review_score": "1"
        },
        {
            "review_text": "Best Hitman game, because of the freedom and choices you can make. Masterpiece. 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "The graphics may not be the best But its a Great Game. Agent 47™: Ya know what I did in Bloodmoney? : I went behind the Wall in a village with a mansion, assembled the sniper waffle and Quickscoped three Gwards and then Went in the house I pulled out the pistol and killed many people then I removed their clothes and put it on me and then when I was gonna go to the office of my assassinated target I carried fire extuingisher and smazked it in his face lol then I kept running and killed everyone in the party &gt;:) I reccommend it bros Have a nice day :)  ",
            "review_score": "1"
        },
        {
            "review_text": "Really good game, first one I bought. I've always been a fan of the Hitman series, so I thought this game would be great to play. I was right. Though the controls are kind of confusing to understand at first, you can catch along pretty quick. I'd give this a 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "Quality in every way. Run and Gun, Or make it look like an accedent, its your choice!",
            "review_score": "1"
        },
        {
            "review_text": "Great game, highly reccomended if you are into games that encourage stealth, strategy, and well, crap tons of fun.",
            "review_score": "1"
        },
        {
            "review_text": "Silently eliminate world threats, while waring nice suit and thie.  If you play this right, you are the hunter !  Great levels, nice and decent sence of humor !  It is legend in my books so go get it.",
            "review_score": "1"
        },
        {
            "review_text": "awesome game just really hard lol ",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games ever made. Stealth done right.",
            "review_score": "1"
        },
        {
            "review_text": "this game is ♥♥♥♥in pimp as ♥♥♥♥ you just kill stuff",
            "review_score": "1"
        },
        {
            "review_text": "How often do you come home stressed over something that you wish would just go away? Like make a small wish and poof?. Well you're looking in the wrong place. But here's something to make up for that. Why not dress up like Big bird and go on a psycho rampage during Mardi Gras? Pick up a copy of Hitman blood money and watch all that stress and anger melt away, into the form of a fiber wire.   Have fun... (Warning, I and the makers of this game are not responsible for any psycho rampages through real places. If you have those desires you should probably see a doctor ASAP)",
            "review_score": "1"
        },
        {
            "review_text": "Easily in the top two or three best stealth games ever made.You're insane if you haven't played this already, if you hate stealth - you can play it like Rambo, if you hate Rambo, well you can spend 5 hours finding the stealthiest route to success.",
            "review_score": "1"
        },
        {
            "review_text": "It's a great game, just it feels way too clunky and sloppy...but thats probably to make it very difficult and make you think more, which is good to a certain extent.  Best out of the original trilogy though. Must have for any fan of the franchise or stealth lovers alike.",
            "review_score": "1"
        },
        {
            "review_text": "You get to beat a man to death while wearing a gaint bird costume, what more do you want?",
            "review_score": "1"
        },
        {
            "review_text": "Ran into a female bathroom and gained zero notoriety.  Started running while dressed as a member of staff and suddenly everyone is supicious.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "I was extremely surprised by how well this game aged. The textures and cutscenes are now a bit of an eyesore but in terms of gameplay this is phenomenal.",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best in the series. You get bonuses for keeping your suit in each mission, cause those suits are expensive. Also it's important to be well dressed when using a WA2000.",
            "review_score": "1"
        },
        {
            "review_text": "Sandbox Serial Killer Sim....Enough said. Its very fun so long as you can detach your morality (if you have one).",
            "review_score": "1"
        },
        {
            "review_text": "most enjoyable-ish gameplay from the games series,.",
            "review_score": "1"
        },
        {
            "review_text": "Hitman: Blood Money continues the trend set by Silent Assassin by making the game more accessible and less frustrating, while emphasizing cleanliness and stealth on the part of the player. This time around, 47 has some new gear that sticks around mission to mission, such as sedatives and poison that can be used on any food object, but the opportunities to use these new features feel very deliberate and pre-placed. In many ways, this sums up what Blood Money is all about: It's less a matter of coming up with your own, creative way to approach a situation, and more about finding all of the possibilities the developers have hidden away for you. As long as you approach the game like a puzzle - looking for weaknesses in the defenses of a given target - this is more interesting than limiting. The storyline and setting are fairly uninspired, however, especially compared to the previous games, and gives a definite air of 'different writers who didn't get it'. Still, for those looking to enjoy a competent and relatively easy social stealth game with some unique twists and awesome setpieces, this is the way to go.",
            "review_score": "1"
        },
        {
            "review_text": "No matter how future Hitman titles turn out, the series will remain a classic for those who enjoy the taste of stealth and some contract killing. With good music, diverse missions, and an interesting storyline, Blood Money returns Agent 47 to his roots and it is for certain my favorite title in the series thus far.",
            "review_score": "1"
        },
        {
            "review_text": "i dont take bitcoins, petrodollars, blood money, or any other made up currency so STOP CALLING ME!!!",
            "review_score": "1"
        },
        {
            "review_text": "Great game! Lot's of fun! One regret I had playing it is that I spent a lot of time restarting levels trying to get them perfect instead of immersing myself in the story line, but if you pay attention and just play through, and try to be sneaky later, when you have more equipment unlocked, you'll have a lot more fun!",
            "review_score": "1"
        },
        {
            "review_text": "AI is a little trigger-happy but overall a great game.",
            "review_score": "1"
        },
        {
            "review_text": "It is a HIT. MAN!",
            "review_score": "1"
        },
        {
            "review_text": "Now I can finally murder people in an opera house and not get sent to jail for it!",
            "review_score": "1"
        },
        {
            "review_text": "The best Hitman game of the series. The only complaint I have is that there isn't enough missions.  ♥♥♥♥ the CIA.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a murder sandbox. But not the kind of murder that is run n' gun (allthough you can in fact do that), this is a game filled with cold calculated murder that can be acheived numerous ways. Sure you can kill your targets with a small selection of scripted methods, but the true fun comes from experimentation. Wan't to kill a woman by throwing a coin at the skylight? Go ahead, try it. Want to grab an actor from his room, drag him to the catwalk, and throw him onto the stage when he is called? It's a bit sloppy, but try it! Wanna just walk up to a drug lord, shoot him in the head, and run away? You will probobly die but try it! I have never had so much fun going back to old missions in a game and applying self imposed challenges, or just going with with no objective and goofing off. This is the funnest and goofiest hitman game in the series, and for the price, its a steal.",
            "review_score": "1"
        },
        {
            "review_text": "I murdered a criminal on witness protection in front of FBI agents and they did nothing about it.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Better than absolution. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥♥ Cockgoblins are playing this game right now",
            "review_score": "1"
        },
        {
            "review_text": "The game is not showing what be there like the full house?",
            "review_score": "1"
        },
        {
            "review_text": "Great Game",
            "review_score": "1"
        },
        {
            "review_text": "This is my favourite steath game then then splenter cell conviction",
            "review_score": "1"
        },
        {
            "review_text": "The game is not showing what be there like the full house?",
            "review_score": "1"
        },
        {
            "review_text": "I think this game is alot better than absolution theres just so many diffrent changes in absolution that changes the whole game and it just makes me angry",
            "review_score": "1"
        },
        {
            "review_text": "Perhaps the best Hitman game ever. Good graphic and excellent levels, though the AI is a little bit 'stupid'. Nice weapon customization design and notoriety system.",
            "review_score": "1"
        },
        {
            "review_text": "DO NOT BE PUT OFF BY THIS GAME'S DEMO. I hate typing in all capitals, but any potential buyer of this needs to see that. The demo for Hitman Blood Money is utter tripe. I'll admit that, and it put me off too. However, when I finally got around to buying this, and made it through a few missions, it was clear that this game was something special. It's so open and fun - you attempt the missions on your own terms, not forced into approaching them in any way other than your own, unique style. These levels are varied too, with sizes ranging from huge casinos to cosy little suburban neighbourhoods. There are so many novel and interesting ways of completing your objectives that this game has a lot of replay value.  The situations this game creates are always tense, but often hilarious. When I play Hitman, I enter a state of sadistic glee. Absolutely one of my favourite games.  Not many sequels top the original game, but in my opinion, this is the best of the series. If it's on sale, buy it.",
            "review_score": "1"
        },
        {
            "review_text": "The perfect stealth game yet",
            "review_score": "1"
        },
        {
            "review_text": "In my opinion, I would say THIS is the quinsential Hitman experience. I've certainly played it the most out of any Hitman game, its simply that good. Don't let my time played fool you, I easily have 100+ hours out of this game, from trying to get Silent Assassin on missions, to just going full on Rambo.  The levels are all awesome, cannot think of one I don't enjoy. From the drug lords mansion in Brazil, to a Costume party in a giant highrise apartment, a good ol fashioned outdoor wedding in the Bayou, also a mission on a Big Boat on the Mississippi.   The Opera mission is a personal favorite, but my absolute favorite is where you have to kill a guy in Witness Protection at his kids birthday party in the burbs. Amazing.   Not to spoil, but the final mission is in a pretty ♥♥♥♥ing big deal of a place. Play this game, you'll enjoy it, ♥♥♥♥ Absolution it  absolutely  ruined the franchise. The next one is supposed to be more like Blood Money though, so cross your fingers.  Something small too I forgot, but after your mission you get a cool little newspaper article about your deeds. I always enjoy them, nothing like reading about how you shot up 70+ at a wedding, the simple things in life.   Silent Assassin and Contracts are both amazing games as well, but THIS is the most polished and well defined version of Hitman around.",
            "review_score": "1"
        },
        {
            "review_text": "Best Hitman game , My Favorite 10/47 ░░░░░░░░░░░████ ░░░░░░░░░░░█░░█ ░░░░░░░░░░█░░░█ ░░░░░░░░░█░░░░█ ██████▄▄█░░░░░███▄ ▓▓▓▓▓█░░░░░░░░░░░░█ ▓▓▓▓▓█░░░░░░░░░░░░█ ▓▓▓▓▓█░░░ ░░░░░░███ ▓▓▓▓▓█░░░ ░░░░░░░░█ ▓▓▓▓▓█░░ ░░░░░░░░░█ ▓▓▓▓▓█░░░░░░░░░░░█ ▓▓▓▓▓█░░░░░░░░░░█",
            "review_score": "1"
        },
        {
            "review_text": "quite of the goods",
            "review_score": "1"
        },
        {
            "review_text": "A very good Game!!! FIlled with lots of action! Why play it ? Because it's Hitman:Agent 47 !!!",
            "review_score": "1"
        },
        {
            "review_text": "your an ultra-badass bald guy what more could you want, greedy.  47/10",
            "review_score": "1"
        },
        {
            "review_text": "best hitman game",
            "review_score": "1"
        },
        {
            "review_text": "8/10 can massacre an entire parade while wearing a bird outfit",
            "review_score": "1"
        },
        {
            "review_text": "Great Hitman-Game.. much like Silent Assassin with improved Gfx/AI 30-40 hours of FUN ;)  *many different Weapons (from Revolvers to SniperRifles) *killing with any Tool lying around *clever AI  ",
            "review_score": "1"
        },
        {
            "review_text": "This is a game that, if you were around when it came out, you will love for the rest of your life. It's a game that you will revisit so many times and play through the missions so many times, even if you have played them a thousand times.  Hitman Blood Money is a creative triumph. In my opinion, it is the Definitive Hitman Game and sets the standards for all other Hitman games to work on, and improve if possible. It's clean gameplay, interesting story and characters keeps you hooked until the very end...and it's a satisfyingly simple ending too.  I've played through every single Hitman game to date, and you'll forgive me if I have some bias to the franchise, and this game inparticular.   The Game plays like any 2005-6 game, it's got it's buggy sides, it doesnt have the best graphics, but it's a fun, challenging, even for a veteran like myself, and entertaining game.  I give this a 10/10, I hold it close as one of my favorite games of all time.",
            "review_score": "1"
        },
        {
            "review_text": "wheres the controller support?",
            "review_score": "1"
        },
        {
            "review_text": "10/10 game. Would buy again. This game is much better than Absolution. There are no checkpoints, and you are free to roam the level as you please. There are so many different ways to complete each level. Although the control scheme can be quite confusing for those who do not look at the settings. I would recommend you play this game until Hitman 6 comes out. Hitman 6 looks a lot more promising than Absolution did.",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant game, probably my favourite in the series.  Positives: Good level designs, some locations are quite unique and had my wondering how they even thought them up.  Voice acting is fairly decent. The controls are easy to get used to. Retains the feel of Hitman and Hitman 2. Good music design.  Negatives: For some, especially if you played Absolution first, it may be simply unplayable and feel too outdated.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great though kind of hard if you are new to Hitman Games or just haven't played stealth in a while.  I still recommend this game for those stealth and Hitman fans out there.",
            "review_score": "1"
        },
        {
            "review_text": "It's like I'm really a bald man!",
            "review_score": "1"
        },
        {
            "review_text": "the best hitman game by far, the level design is awsome and the opportunities the game gives you to kill different contracts gives a sence of complete freedom.",
            "review_score": "1"
        },
        {
            "review_text": " Best Hitman game yet. ",
            "review_score": "1"
        },
        {
            "review_text": "i killed 2 drug kingpins with a nailgun, crushed another with a chandeleir after his friend was shot with a pistol, broke into a psyciatric evaluation center and poisoned some contraband, dressed as a clown and slaughtered a small neighborhood's worth of civilians with a butcher knife, systematially killed 3 chickens while dressed as one, went to a strip club shot the glass bottom of a jacuzzi and killed a puppy with a sausage, went to a redneck wedding and quietly shot the groom with a shotgun, visited a casino and cosplayed as my target, went to a Supernatrual- inspired.party killed a lady by shoving her into a shark pool, then killed the vice president and murdered everyone at my funeral with a shovel.  47/10   ",
            "review_score": "1"
        },
        {
            "review_text": "This game is a complete classic everybody should smooth frames great for low end pc gamers. Story is shoddy but makes up for I in gameplay. Fun to mess around with . Challenging levels ( on hard difficulty. And many secrets........WELL WHAT ARE YOU WAITING FOR BUT IT",
            "review_score": "1"
        },
        {
            "review_text": "Good old memories :D",
            "review_score": "1"
        },
        {
            "review_text": "Either crawl around only use your wire or kill every inbred hillbilly",
            "review_score": "1"
        },
        {
            "review_text": "My favrote Hitman game. 10/10 Would die 300 times again.",
            "review_score": "1"
        },
        {
            "review_text": "first mission allows you to throw a hooker out of a windows, really no reason not to pick this game up",
            "review_score": "1"
        },
        {
            "review_text": "Still the best hitman in the whole francise.",
            "review_score": "1"
        },
        {
            "review_text": "Unplayable for me. When I got to 'Till death do us part' when shooting someone or when about to finish the level the .exe just stops working and im kicked out of the game, but the game is not bad at all",
            "review_score": "1"
        },
        {
            "review_text": "love the game have not played any other game on steam since i got blood money  pros  *fun replay ability *fun ways to finish levels *hard game (you dont get hard game alot anymore) cons  *sometimes crashes *sometimes confuseing ",
            "review_score": "1"
        },
        {
            "review_text": "Juust beat the game and I now realised why everyone prefers this game over the newest ones.   Also everyone complains about crashes and stuff, but I literally never encountered any glitch or crash my entire play time.",
            "review_score": "1"
        },
        {
            "review_text": "2016 and still the best hitman game with weapon customization",
            "review_score": "1"
        },
        {
            "review_text": "Pretty much just another Assassins Creed 3 rip off",
            "review_score": "1"
        },
        {
            "review_text": "Hitman: Blood Money is a superb game. Sure it may have it's flaws here and there (I will get to those) it is still a game design work of art.   You play as Agent 47, a bald hitman...that's all you really need to know really. Yeah the plot in here is very confusing and I lost track, but what makes this game so uniqe is that it doesn't need a story. Just simply, take out the targets, here is the location, think of a plan. Just the basics.  The gameplay is great. The stealth mechanics are very uniqe and don't play like your regular stealth games. The stealth is more orrientented around the perfect time to take out your targets. And that's what makes Hitman, Hitman.  My biggest issue is the AI, and yeah it's pretty bad. Ok sure, out of the hitman games I played it's the best but honestly that's not really saying much. Distractions for the most part are pretty usless just because of how the AI handles it.  Now for the Pros and Cons: PROS: -Intresting use of stealth mechanics  -Level design is a marvel -Agent 47 is cool -The vareity in the way you take out your targets  CONS: -The AI in genral -The story is pretty simple.  RATING: 9.5/10: This is a really good game, it's worth trying out.",
            "review_score": "1"
        },
        {
            "review_text": "&lt;What's this game?&gt; The genre is third person shooting with emphasis on stealth.  The purpose of a game is undertaking an assassination of a mark from the organization, and you can kill a target by various ways (Such as strangulation, poisoning, shooting to death, pushing over a cliff, making them drown into water and pretending an accidental death .)  The reward which will be paid and be changed with how long the target has been assassinated smartly, and a weapon and equipment can be upgraded by a received reward.A however expensive reward whether you can get, influences stage capture after next time directly because a reward can be used to buy the information concerned with duty (hint) and lower bad reputation from the citizen.   &lt;☆Good point&gt; ○The means to assassinate a mark and the route to assassinating are prepared much, so I felt the height of the degree of freedom. It depends on an idea and various plays can be done independently, so even if it's cleared once, you can play time and time again.  ○It's possible to consider the preparation to execute an assassination carefully. To do in the area where you have many security guards of a mark and citizens who surround it often in an assassination, it's attractive to plan and polish closely.   ○Stages is rich in variety and always exciting.The passenger boat which sails Mississippi and a Chilean wine farm and a name hotel in Las Vegas,there are a lot of volume.This is good.  ○There are much weapon, equipment and gimmick of capturing missions. You can make them customize according to the play style. zoom lens scope and rifle stock are put on the sniper rifle to be able to shoot super-long range. Also slaughter the targets quiet by a piano wire and a poison. By the way, maybe a rank of the assassination judged to assassinate only by a kitchen knife at the time of clearance is passed with 'sushi craftsman'.  &lt;☆Bad point&gt; × The operability is a little unkind. For example, action button is concentrating such as the button which takes the weapon which has closed in the box out and the button which opens a door are same.  ×It's a game 10 years before, so I compare somewhat unfavorably with a graphic as expected.    &lt;Conclusion&gt; I bought for about 9dollar by steam.This game is very fascinating thanks to be height of the degree of freedom which is one of the feature of this game. Observing situation like spying and planning carefully seems to be a real hit man. I recommend the person who takes an interest in a hit man series.Check it out!    &lt;このゲームについて&gt; ジャンルはステルス性重視のサードパーソンシューティング。ゲームの目的は組織から標的の暗殺を請け負い、様々な方法でターゲットを殺害できる（絞殺・毒殺・溺殺・崖から突き落とす・銃殺・事故死を装うなど）。暗殺がどれだけスマートに行われたかによって支払われる報酬が変わり、受け取った報酬で武器や装備をアップグレードできる。また、報酬は任務にかかわる情報（ヒント）を購入したり市民からの悪評度を下げるためにも使えるため、いかに高額な報酬を得られるかが次回以降のステージ攻略へと直接影響する。  ☆良かった点 ・標的を暗殺する手段や暗殺に至るまでのルートが多く用意されていて自由度の高さを感じた。アイディア次第で自主的に遊び方を提供されている作りなので一度クリアしても遊びなおせる。  ・暗殺を遂行するための下調べをじっくり考えることができる。暗殺には大抵標的のガードマンや取り巻く市民が大勢いる地域で行うため、緻密に計画を練ってあれこれ推敲するのが魅力的。  ・ステージがバラエティに富んでいて常に刺激的。チリのワイン農園からミシシッピを航行する客船、ラスベガスの一流ホテルなどボリュームに関してもGood  ・武器と装備、攻略に関わるギミックが多数ある点。自分のプレイスタイルに合わせて銃をカスタマイズさせることが可能であるため、拳銃にサプレッサーをつけてもよし、スナイパーライフルにズームスコープとストックをつけて超長射程射撃へ特化させるもよし、ピアノ線と毒薬で静かにターゲットを屠るもよし。ちなみに包丁だけで暗殺を実行すると、クリア時に判定される暗殺のランクが「寿司職人」と下されるらしい。  ☆悪かった点 ・現状ではスチーム版の本作においては字幕と音声が日本語化できない。（バグやフリーズが多発して正常にプレイすることは不可能とのこと） そのため有志の方が日本語翻訳してくださったブラッドマネーwikiを参照しながらでなければ快適にプレイ出来ないところが不便。もしプレイするならその点は注意しなければいけません  ・操作性が少し不親切。箱の中にしまってある武器を取り出すボタンと扉を開けるボタンが同じであるなど、使うボタンが集中している点  ・１０年前のゲームなのでグラフィックはやはり見劣りする  ＜総評＞ スチームで９００円程で買いました。今作の売りである自由度の高さがあってとても面白いゲームでした。探偵のように周囲を観察して計画をじっくり練る様がさながら本物のヒットマンのようです。ヒットマンシリーズに興味がある方はぜひおすすめします！！",
            "review_score": "1"
        },
        {
            "review_text": "Blood Money is the best Hitman game in the series! Absolutely not Absolution.",
            "review_score": "1"
        },
        {
            "review_text": "Don't waste your time with these reviews just buy and play this game.",
            "review_score": "1"
        },
        {
            "review_text": "Hitman: Blood Money is the best in the series, it's like Contracts but with nicer graphics and better gameplay. 9/10 Great game but doesn't have that many levels which made me sad when i finished it because i wanted more.",
            "review_score": "1"
        },
        {
            "review_text": "this is a very bald man",
            "review_score": "1"
        },
        {
            "review_text": "Get it. It's the best.",
            "review_score": "1"
        },
        {
            "review_text": "This game has aged so freaking well, it still manages to entertain me today.",
            "review_score": "1"
        },
        {
            "review_text": "I absolutely loved this game from the very first time I picked it up, and recently since I started to play it again I've just fallen even more in love with it. Even if the game came out in 2006 it is still absolutely beautiful. It's a fantastic stealth game that I can constantly replay in order to do a different assassination or to just get a faster time. I defintiely recommend that you pick this game up if you haven't already.",
            "review_score": "1"
        },
        {
            "review_text": "Best Game Ever Made Buy It Right Now! Don't buy the stupid new one with the money sucking dlc level crap in Hitman 2016, don't buy hitman absolution it sucks and has horrible stealth but it did have good potential buy this game. The levels are open with many ways to go in you can go for silent assassin or terrorist it is great with weapon customizing and making things look like accidents and generally having fun. The easter eggs I won't spoil but they are amazing and also Presidential assassination level probably the hardest one I had to figure and it was hard in a fun way. So drop what your doing and buy the game NOW!",
            "review_score": "1"
        },
        {
            "review_text": "  It haves nice graficks and nice guns. ",
            "review_score": "1"
        },
        {
            "review_text": "Best of Hitman series.",
            "review_score": "1"
        },
        {
            "review_text": "Played every mission like 100 times, the last of the good original Hitman games.",
            "review_score": "1"
        },
        {
            "review_text": "Best Hitman i have played so far",
            "review_score": "1"
        },
        {
            "review_text": "In my opinion. I think this game the the best game of Hitman series.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty tricky but satisfying as all hell when everything goes smoothly and as planned. 8/10",
            "review_score": "1"
        },
        {
            "review_text": " It's an epic experience from beginning to end, filled with dark humour, lots of action and most importantly the perfect blend of engrossing story and engaging gameplay. Throw in some sumptuous visuals and atmospheric sounds and you've got one of the best games of 2006 so far. ",
            "review_score": "1"
        },
        {
            "review_text": "Very fun sneaker/shooter. Each level is quite unique and has mutiple ways of approach or completion. Similar to the other games in the series, Blood Money lets you take down enemies/targets in several ways -- some quite creative. Patience and timing are key in this game and you are rewarded with a nice clean assassination for having both characteristics. The various weapons are fun to use and the game contains certain environment variables you can use to your advantage. I found myself having fun replaying levels, just to see how perfectly I could pull off the mission objectives. The AI could be slightly better, but knowing how the enemies react lets you judge your approaches without having to second guess.",
            "review_score": "1"
        },
        {
            "review_text": "you can insta drown people  420/10",
            "review_score": "1"
        },
        {
            "review_text": "Best Hitman game in the series! Insanely creative level designs and huge freedom of choice when it comes to deciding how you want to complete the levels. Still holds up strong in 2016!",
            "review_score": "1"
        },
        {
            "review_text": "Play as Mr. Clean's sociopathic twin brother and kill a child molesting theater actor, a rival assassain couple who are literally love birds, a Hugh Hefner wannabe, a gang of drug-dealing rednecks, a hypocritical white supremacist, and many more all while cosplaying as the people you kill.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ this game. I'm playing it for hours but everytime I quit or the game crashes the saves get resetted.",
            "review_score": "-1"
        },
        {
            "review_text": "Issues I Had: -No controller support  These games are arguably better with a controller. You don't get the same type of feedback while using mouse and keyboard. I had to set up Pinnacle to use my controller with this.   -Graphics are bad  Even maxed, the graphics are bad for circa 2006. Agent 47 looks like a fat dwarf, all the enemies in a level look the same (there's no variations). the animals and trees all look like plastic stand ins.   -Stealth is nonexistent  Stealth is completely broken in this game. I frequently had enemies notice me but as soon as I crouched and moved away they gave up. I played on Normal and not any other difficulty so this may be a factor?  -Disguises are overpowered  Disguises will get you anywhere and everywhere. I frequently beat a mission just by running up and shooting the target while disguised.   -Game crashed frequently  Game would crash at random times. Mostly at mission end. I looked up some fixes but most were absurd ('quickly click out of the mission over screen as fast as you can' and 'lol buy a new graphics card')  Things I Enjoyed  -Music  The music in the game is fantastic.  -Cutscenes  They actually look pretty good for being a decade old.",
            "review_score": "-1"
        },
        {
            "review_text": "Unfortunately I have to give this a bad review because the game crashes upon completing the first mission.",
            "review_score": "-1"
        },
        {
            "review_text": "I can see other people liking it, but it's personally not for me. Also, how the hell do I use the fiber wire and syringes?",
            "review_score": "-1"
        },
        {
            "review_text": "Terrible. Has such bad controls I could barely play it and when you die have fun waiting a good 20sec before you can reload your save or restart..",
            "review_score": "-1"
        },
        {
            "review_text": "The game crashes after the first mission. Yay!",
            "review_score": "-1"
        },
        {
            "review_text": "Clunky controls. Bad game. I don't understand why this series gets so much praise. There are better stealth games.",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥♥iest game I have ever played. Do not recommend to anyone with 46 chromosomes. Possibe a monkey his younger jewish brother would play but they are ♥♥♥♥ing ♥♥♥♥♥♥♥. ♥♥♥♥ them. One of them vapes (♥♥♥♥♥♥). But yeah anyways ♥♥♥♥ this game im outtie.",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "I can't play this my time is too valuable.",
            "review_score": "-1"
        },
        {
            "review_text": "Incredibly dated. Not what you (I) remember,",
            "review_score": "-1"
        },
        {
            "review_text": "It would be a great game if it didn't have so many bugs. You loose score to BS more than anything else.",
            "review_score": "-1"
        },
        {
            "review_text": "Sucks. Crashes my computer.",
            "review_score": "-1"
        },
        {
            "review_text": "Not my type of game.",
            "review_score": "-1"
        },
        {
            "review_text": "Very little direction so that when you get lost you stay lost",
            "review_score": "-1"
        }
    ]
}