{
    "app_id": 6880,
    "name": "Just Cause",
    "release_date": "2007-03-15",
    "developer": [
        "Avalanche Studios"
    ],
    "publisher": [
        "Square Enix"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 16,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "Open World",
        "Shooter"
    ],
    "achievements": 0,
    "positive_ratings": 1732,
    "negative_ratings": 846,
    "price": 4.99,
    "description": "Your world...Your rules! In Just Cause, you are a Latin field operative and specialist in regime change backed by top secret US government agency who will overthrow the corrupt government of San Esperito.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/6880/header.jpg?t=1555609904",
    "minimum_requirements": "Microsoft Windows® 2000/XP. (Windows® 95/98/ME/NT not supported) Pentium IV 1.4GHz (or AMD AthlonXP 1700+ processor or higher). 256MB System Memory. 3D Hardware Accelerator Card Required - 100% DirectX® 9.0c compatible with 128 MB and Shader model 2.0. (GF FX 5700   or ATI 9500)  100% DirectX® 9.0c compatible 16-bit sound card and latest drivers 4.0GB of uncompressed free disk space (plus 600MB for Windows® 2000/XP swap file) 100% Windows® 2000/XP compatible mouse, keyboard and latest drivers.Recommended:  Pentium® IV 2.8GHz with Dual Core Technology (or Athlon 64 series). 512MB System Memory. 3D Hardware Accelerator Card Required - 100% DirectX® 9.0c compatible with 256 MB and Shader model 2.0. All nVidia® GeForce™ 7 series or higher. Sound Blaster® X-Fi series or higher.Optimal:  Pentium® D Processor with Dual Core Technology (or Athlon 64 X2 series). 1GB System Memory. All nVidia® GeForce™ 7800 series or higher. Sound Blaster® X-Fi series or higher.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "It's a fairly decent open world game, but it has quite a bit of frustrating and unforgiving parts, especially near the end. Well at least it controls better and wasn't-as-frustrating as Grand Theft Auto: San Andreas on the PC.  I'd say ignore this and go for Just Cause 2 instead (Windows ♥♥♥♥♥ta or higher required for DX 10)",
            "review_score": "1"
        },
        {
            "review_text": "Get Just Cause 2 instead. It's basically the same game, except actually finished. This one only has inklings of ideas which were never developed, and simply has no polish whatsoever. For example, take the settlement takeover missions, which are a cool idea and which you'll probably be doing a lot. 'Missions' might be too generous. There's basically only one (shoot enemies, destroy roadblock #1, shoot enemies, destroy roadblock #2, shoot enemies, destroy roadblock #3, rush to flag / kill a specific enemy - the only difference you can spot between them is that when taking over cities you don't have to destroy roablocks), which you will be doing over and over and over and over again. Do you at least get something cool for your troubles? Nope, just a new save point and a color of some pixels flipping on the map. Or take the combat, which you'll be doing a lot of. The game has only two levels of enemy threat. 'Light drizzle' if they are using bullets, 'instagib' if they're using explosives. For your own part, you'll have tiny, hard to see crosshairs (if you play at any real resolution)... or extremely intrusive autoaim which kicks in while you're manning vehicle weapons (which are another cool idea on their own) and which will actually very often prevent you from shooting what you want to shoot (say, the barricade rather than all the random soldiers all over the place). Or take the grappling hook, which is an amazingly fun tool in JC2, and which is an unreliable and unwieldy piece of crap in this game. The whole thing is just extremely rushed and upolished.  Again, just get JC2 instead. I can assure you, you will not miss out on anything by skipping JC1.",
            "review_score": "-1"
        },
        {
            "review_text": "I can safely give this game the 'Meh' Seal of Semi-Approval. -- Just Cause is a series about blowing s$#@ up and having fun, and it all started right with this unpolished world of cross-gen mediocrity. Yet, everything wrong with this game somehow works in its favor. It's fairly easy to get lost in the world and start collecting things only to be interrupted by military forces, in which the surprisingly excellent gunplay grants you access to their car and a massive chase sequence that usually involves hilariously bad AI, being absolutely swarmed by enemy vehicles, and lots of stunt jumping. The missions are solid, the voice acting is cringeworthy, and overall the game is somewhat enjoyable as a budget title.  The biggest flaw, however, is its lack of polish and special mechanics. My problem with this game is that I can't help but compare it to its legendary successor, Just Cause 2. I know the hardware was limited and they really did make the most of Xbox/PS2 hardware, but it doesn't change the fact that after so many hours of JC2, the upgrades from game to sequel definitely hurt in trying to go back.  If you have a crappy computer, want some time to kill, or just want to see where this series began, there's a fair chance you might get your moneys' worth here. On any half-decent computer, however, I'd recommend skipping straight to its sequel. JC2 is a damn near perfect game, and there's a reason it outshines its predecessor.",
            "review_score": "1"
        },
        {
            "review_text": "The game was ambitious for its time but it has too many problems and most of it has to do with gameplay. It tries to have Rico Rodrguiz topple a dictator by unleashing chaos, but it plays too much like a generic open world title of its era.Unlike its sucessors, this game dons't function right while its too clutered in the mechanics for the player to actually function. The parachute and grappling hook combo are not that polished.   Also if you played Just Cause 2, then playing this would be a step back in terms of quality. If you havn't played Just Cuae 2, it fixes all the problems this game had.   Overall this would be a big pass. If your curious, still don't bother as it will make you wonder how was this even a game.",
            "review_score": "-1"
        },
        {
            "review_text": "This is THE Just Cause Game and I've played Just Cause since the beginning. This game brings me back memories when I used to play this all the time on my PS2. Good times. But yes, if you guys want to know the beginning (or should I say the dawn of Just Cause), start with this. I believe, in some ways, Just Cause 1 is way better than Just Cause 2 AND 3. But then again, it is my opinion, but yes. Start off with Just Cause 1, because I guarantee you that this game will not disappoint you, fellow gamers. Do not be turned off because of the graphics, give the government a Just Cause....",
            "review_score": "1"
        },
        {
            "review_text": "This is Such a Fun Game to just explore arround in. The Beauty of the open world is awesome! I love all the work that was put into this game. I would say the only problem that I have with the game is that the Cut sceens and the audio are not synced at all! It is so bad at times, it is like watching a delayed bad 1980's Chineese martial arts movie that is poorly englished dubbed. But even those old movies were done better than the audio and cut sceens in this game. lol But once it is back to game play... It is Awesome Single Player Sandbox FUN!",
            "review_score": "1"
        },
        {
            "review_text": "Fun as hell",
            "review_score": "1"
        },
        {
            "review_text": "People say it's bad, but it's truly alright. It's basically a prototype of Just Cause 2. Get it on sale. Not a bad game.",
            "review_score": "1"
        },
        {
            "review_text": "more people should play the first game in the series  especially when steam sells it for 19p",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun game, but gets repetitive. 8/10 infinite side missions...lots of side missions all over the map..like wtf...",
            "review_score": "1"
        },
        {
            "review_text": "Just Cause is a great concept. The map is also huge and there is plenty of places to explore. However, there are many flaws with this game. Now, before people write comments saying 'Hes comparing it to Just Cause 2' I have not finished Just Cause 2. I am explicitly putting myself back in 2006. This game was not half bad. But lets really look at the game. The storyline of this game is very generic and honestly uninteresting. The gameplay is really not good, I did not enjoy driving in this game at all and the grappling gun you get eventually is cool but very difficult to control. Lets be honest here, Oblivion came out the same year this did. This game was not the top game of the year. I do enjoy the game and its gameplay but after 4 hours I got so fatigued that I gave up quite honestly. The gameplay didn't want me to keep playing and the story was not interesting enough to drag me in. Because of this generally mediocre first game, I am going to not recommend this game purely because I feel that it does have good to it but the bad outways the good. A modern gamer could not go and play this and enjoy it. Honestly a fan of Just Cause as a series probably will not enjoy this. But if you watch gameplay and find it interesting, please get it, however this game did not do it for me.",
            "review_score": "-1"
        },
        {
            "review_text": "Great sandbox freeroam game. Do missions or just have fun on the islands ;) Just Cause 2 is better but this shouldnt be left behind. I wish there where achivements to hunt as there is so much fun stuff to be hand in this game. Collecting cards wouldnt be bad either as the developer really have talented artists ;)",
            "review_score": "1"
        },
        {
            "review_text": "i was never amused by the graphics so i never downloaded it. but, i started playing yesterday. i was so freaking stunned. big open spaces, and i love the frefalls! it's so awesome. 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "Its a good and fun game, Recommended for all of my friends",
            "review_score": "1"
        },
        {
            "review_text": "Very standard open world game. I'd say it's worth skipping in favour of its sequel.",
            "review_score": "-1"
        },
        {
            "review_text": "The start of one of the most iconic franchises in the gaming world. Just Cause is a great introduction to Rico Rodriguez and the series in general.",
            "review_score": "1"
        },
        {
            "review_text": "I bought this Just Cause it was on sale for $0.27",
            "review_score": "1"
        },
        {
            "review_text": "Just cause. Well, let's begin. It's classic shooter from 1-st person. Our guy is freaking Rambo and he must perform a missions and he must destroy bad guys. What can I say, This is Хорошо! :)  beaver/dam",
            "review_score": "1"
        },
        {
            "review_text": "This is game is AWESOMEE I LIKE THISS :)))",
            "review_score": "1"
        },
        {
            "review_text": "I went the whole game and I enjoyed. We have a task to defeat General Mendoza, who exercises dictatorial governments, but before we get to the last mission we have to do a number of other missions.  Additionally we can help the rebels and capture cities and military bases to get additional reputation points. Thanks to the reputation we have access to new hideouts, weapons, and vehicles. In the game, we have access to many land-based vehicles, aircraft and boats for example heavy armed helicopter. Also about the diversity of weapons there is nothing to complain. Ranging from pistols to rocket launchers. Map is really huge, varied and makes an impression.  I recommend.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of those games where you can't stop, but then you do and you do for like 5 months.",
            "review_score": "1"
        },
        {
            "review_text": "WHY CAN YOU GRAPPLE ON TO AIRPLANES AND HIJACK THEM? JUST 'CAUSE.",
            "review_score": "1"
        },
        {
            "review_text": "Repetitive and rather buggy, the first installment in the Just Cause series includes a forgettable story, tedious missions and just feels downright lacking. It had good graphics when it came out in '06 but I wouldn't recommend this to anybody not looking to waste their time. Play the sequels instead.",
            "review_score": "-1"
        },
        {
            "review_text": "why not",
            "review_score": "1"
        },
        {
            "review_text": "Great game,old but gold.",
            "review_score": "1"
        },
        {
            "review_text": "Ok, if you played this game back on PS2 you should know that this game is really fun, now it became better! most thing are re-textured, and even if you have a basic PC you can run this game.",
            "review_score": "1"
        },
        {
            "review_text": "You should get this game, Why? Just Cause.",
            "review_score": "1"
        },
        {
            "review_text": "I can't play it on fullscreen without black bars",
            "review_score": "-1"
        },
        {
            "review_text": "flawed, but its sequal was stupidly good so i would reccomend it just to see where just cause 2 originated from",
            "review_score": "1"
        },
        {
            "review_text": "Plenty of fun with vehicles that explode and your stunts",
            "review_score": "1"
        },
        {
            "review_text": "For an oldie, Its a AWESOMEY! (I can make up words if i wanna) Its a very cool game, it has bugs but all around i really enjoy it.",
            "review_score": "1"
        },
        {
            "review_text": "this game is amazing",
            "review_score": "1"
        },
        {
            "review_text": "if you dont have just cause, then buy just cause, play just cause, and like just cause. wanna know why? JUST CAUSE! ",
            "review_score": "1"
        },
        {
            "review_text": "This is in my top 3 best games of all times! and play alot of games! Im used to playing cnsole games aswell as pc, no matter what other reviews tell you, this game is an outstanding peice of ork by avalanche and is compleatly finished. The game does only have 21 main missions, however it does contain alot of other content e.g. side missions and team plays to take over importiant parts of the in game world. The game has had extream graphical improovments since 2006 to keep up with pc requirements, the audio has also been updated! No matter what you have heard or seen you are not a gamer untill you have played just cause, those who have not played this are missing out!!!!",
            "review_score": "1"
        },
        {
            "review_text": "a awsome open world game ( based on my own experience and engoyment - thumbs up or stfo :p lol ) !!!!!",
            "review_score": "1"
        },
        {
            "review_text": "It has that nice PS1/PS2 feel 8/10? The story is pretty generic, end-of.",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game on sale /after/ having played through the sequel (one of my favorite sand box games, btw). I played a bit of it, out of curiosity. It's not a terrible game, but it's not a good game either. The latin style to the game (found EVERYWHERE in the game) is a nice change of pace from the GTA and GTA clones, but not enough to compensate for flat gameplay and dumb-as-they-come AI. I don't think I would have liked this game at release - in fact the only reason I'm being 'as kind' about the game is because of how much I enjoyed the sequel.",
            "review_score": "-1"
        },
        {
            "review_text": "I was at least 5 years too late on this one - pales in comparison to Just Cause 2 and with its dated graphics, I could not become invested in the world especially when it was so much better in JC2 (and possibly JC3). Game did nothing wrong, there are just so many better choices for your gaming time.",
            "review_score": "-1"
        },
        {
            "review_text": "Just Cause.  This game is good, but not memorable. It's an old game, and unfortunately it really shows it. Vehicle driving is far from fun, and while it *might* be better, with it a controller, good luck with that because there's no controller support.  The game also feels rather unbalanced, with the majority of missions being completable with just the primary handguns, due to the fact they have infinite ammo and basically shoot as fast as you can click.  The police are also a huge nusiance, they seem to be nearly aimbot accurate, and pursue you with a fierce passion and seem virtually unescapable, combine that with the unsuable vehicles and police chases are far from fun.  Unless you wanted to experience the first game like me, or are going to get the game as part of a bundle, I'm just not sure I can recommend this game, with the exception of if it goes on sale (which it thankfully does).",
            "review_score": "-1"
        },
        {
            "review_text": "Did not age very well... You shouldn't play this if you enjoyed it when it was released centuries ago...",
            "review_score": "-1"
        },
        {
            "review_text": "Very intuitive, but not very good. It starts out as a nice game with a grand opening, but shows it's age very quickly. It has janky mechanics and controls and motion blur makes it impossible to see. I see it as a tech demo for Just Cause 2.",
            "review_score": "-1"
        },
        {
            "review_text": "Back in the day, when I first had this game, it was a really fun and open-world adventure. Now, it just annoys me, and I don't like very much about it. There's too much confusion playing it.",
            "review_score": "-1"
        },
        {
            "review_text": "Showing its age now. Stick to the sequel, basically the same game with better physics, graphics multiplayer, controller support and much more polished.",
            "review_score": "-1"
        },
        {
            "review_text": "Hope you like PS2 games that look like PS1 games with no physics because that's what you'll get if you purchase this game. No controller or widescreen resolution support either.",
            "review_score": "-1"
        },
        {
            "review_text": "Firstly, for it's time this was an ambitious project and would have been impressive. That asside I am reviewing it as it is now, for sale here on Steam.  You play a preset character but there is hardly any example where you exhibit any personality at all so picking a character would hardly effect your experiece.  You start immediately, thrown into the action, which is awkward. You'll find instantly that you have very limited options when disposing of your enemies which is a shame because it has the endlessly funny old ragdoll physics similar to Spiderman 2 and Mercenaries: Playground of Destruction. You need more tools and things to play with for combat, or murder, to be of any interest.  If you're like me you'll do some research on the story as you play as putting things into context is important but the story is not likely to immerse you or entertain you.  With this in mind you will be given a large map to basically capture by yourself. You will have followers that come and go... mostly go as you they try to protect your grenades from loud noises.  There is no real reason to capture the map, it's just pointless busy work - you gain access to better weapons and vehicles but personally it didn't change much for me. You don't have to capture everything, however, you can follow the story (which does have you completing side quests) and you'll get through them without much trouble.  If you must know, should you play Just Cause 2 without playing this you will not miss out. Read up on the game on Google if you wish.  Overall I cannot recommend this game based on what I have played - note that dated graphics/physics don't bother me so long as the mechanics are fun.   Just Cause 1: 3/10 - Ambitious, sometimes fun yet asks too much with far too little.  Recommended alternatives:  Mercenaries: Playground of Destrution - 8/10 Just Cause 2 - 7/10",
            "review_score": "-1"
        },
        {
            "review_text": "This game is fun and can be addictive, but things like the crap auto aim that cant be turned off, the so called 'grapple' that just seems like a rope that shoots from a gun (and can only attach to vehicles that are moving), and the fact that you cant save when you want... they have to give you the option to do so. So if you liberate something and then on your way to another place to liberaate that, and then you die on the way there, you have to start from before you liberated the first place (from the last save). I want to love this game, i really really do, but the cons outweigh the pros soo much, the best part i can find about this game is the parachute and even thats a little iffy for me, i cant wait for my pc parts to come in so i can play just cause 2 its gunna be so much better than this.",
            "review_score": "-1"
        },
        {
            "review_text": "Considering how cheaply you can buy other FPS games, I really don't see a reason why JC would be a choice. Sure, if you wanted to fill out the JC collection, etc. But as far as gameplay and story line go, there were much better games that came out in '06 and since. If you liked JC2, this isn't really a 'how it began', as I found the gameplay of JC2 to be far better (yes, more modern) but even games like HL2 (released two years prior) had better graphics and storytelling. Gotta say Metacritic was more favorable than I am.",
            "review_score": "-1"
        },
        {
            "review_text": "Get JC2 Instead of this.",
            "review_score": "1"
        },
        {
            "review_text": "My opinions pretty much fall in line with most others in this case. Just Cause 2 is a much better game and has far fewer issues than this one.  It is a horrible port. No controller support and no mouse use in menus which is hella dumb. Broken controlls and bad design.  The second one is amazing. Go get that one.",
            "review_score": "-1"
        },
        {
            "review_text": "Just Cause is best game :D",
            "review_score": "1"
        },
        {
            "review_text": "It's hard as hell to play with only a keyboard. They need to fix it so you can use a controller it would be so much better.",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "Very bad, controls are awful, you can tell this is a sloppy port from console.  Luckily Just Cause 2 is amazing and a huge improvement.",
            "review_score": "-1"
        },
        {
            "review_text": "Very bad, controls are awful, you can tell this is a sloppy port from console.  Luckily Just Cause 2 is amazing and a huge improvement.",
            "review_score": "-1"
        },
        {
            "review_text": "This was truly a game that got better with the sequels. Though I am happy that Eidos went through with the subsequent sequels, it's safe to say that this game is only worth it for the terrible plot, voice acting, and trying to master the art of getting into flying vehicles with the grappling hook. Aside from that, the side quests are tedious and not worth doing, the travel time from key mission to key mission is mind numbing, and the countless glitches. I'm currently stuck on the second to last level of the game because it's missing key cutscenes. As for other bugs, certain cars with turrets will glitch by rotating uncontrollably and messing with the turning mechanics of the car. I would switch to the rocket mode of the tank, and it hurled me into the sea with its violent rotations - like a ♥♥♥♥♥♥ nonsensical helicopter. Also, sometimes when you try to steal someone elses car, the door comes flying off.   The resolution is a minor gripe, but the game is still beautiful for the time that it was in.   Just Cause this game will be cheap as hell, doesn't mean you should buy it. Really - skip this one. You'll save yourself hours of frustration over a plot you don't care about.",
            "review_score": "-1"
        },
        {
            "review_text": "Just gatta say even with my time played this game is Mercenaries google it. It was better in every way this game is like a GTA only while driving you have the option to 'Stunt' at any given time the game expects you to utilize this Lame 'Stunt' option to get around the game at 4x speeds and to enter certain camps it really makes the game look and feel unprofessional and linear AF Mercenaries is the EXACT same game but more love was put into making it Destructable buildings Decent Story NO 'Stunt' option just barel roll out of a flaming vihicle the reason Im writing a review for Mercenaries on this games page is because this game was stolen and they did a terrible job.",
            "review_score": "-1"
        },
        {
            "review_text": "There's quite a bit wrong with this game. Everything from cars that skid around as if they were driving on ice, keep in mid this game takes place on a tropical island, to bullets completly going through enemies. I've also never seen such bad driving skills by the NPC's before in a game. 30 Minutes in and I already have witnessed 5 motor accidents. Also, character models are rendered badly and out of proportion. Voice acting is pretty bad too.",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥♥♥ graphic,didnt play over 2 hrs.Should be a classic,but not for me.",
            "review_score": "-1"
        },
        {
            "review_text": "is s.h.i.t.",
            "review_score": "-1"
        },
        {
            "review_text": "i came from Just Cause 2 and by god is it good. a great buy. then we have Just Cause. A game with good concepts, and still moderatly good. it has its moment once or twice but i always find myself lost with the impossible mini-map, and also being stuck in water and swimming for 10 hours without a boat just to get to shore. however, it is fun when you've learned the rules. a great game, but i think you should buy Just Cause 2 instead. still give Just Cause a go, you may just like it, despite the thumbs down ive given it. Give it a try!",
            "review_score": "-1"
        },
        {
            "review_text": "it is a bad graphics game",
            "review_score": "-1"
        },
        {
            "review_text": "This is a fun and addicting game even with the low graphics.",
            "review_score": "1"
        },
        {
            "review_text": "If you've ever wondered what a game version of the webcomic 'Manly Guys Doing Manly Things' would look like, here's a latino take on it. Drive cars, base jump, grapple onto vehicles and steal them. As ridiculous as it may feel while doing it and however cheezy the backstory may feel, I couldn't help but find myself smiling while playing and trying all kinds of vehicles. Just Cause really *is* over the top machismo that just can't be taken seriously, but it's makes for a few hours of fun nonetheless.",
            "review_score": "1"
        },
        {
            "review_text": "The game if fun for a while but then it gets hard. Eventually it gets to where you die and it respawns you next to three active enemy choppers(Exadgeration)and you die at that one part because its a bad checkpoint. Then you'll get used to it. Then, at the last level, as far as i know, there are no checkpoints. You'll find it so hard to beat the game. I recommend that you play until you hate a level( If your almost done with that level, then beat it)and then play free-roam or the side missions. I do recommend this game but its not fun towards the end. Its fun but im not sure its worth full value.",
            "review_score": "1"
        },
        {
            "review_text": "Just Cause 2 Has A Multiplayer",
            "review_score": "1"
        },
        {
            "review_text": "Unfortunately, this is a fun game, but a horrible port. There is no sensitivity slider, Which means I have to move my mouse 6 inches every time I want to target something. The cars all have horrible handling, When you tap d or a the car does a doughnut. Worst of all the voice acting is just as bad as the second game. If you are looking for open world mayhem, go with Just Cause 2.",
            "review_score": "-1"
        },
        {
            "review_text": "uhhhh, where do I start? Well, I'll start with the fact that this game made me laugh till I cried. The plot is just exceptionally ridiculous, even adjusting for the fact that it's an action game trying to emulate GTA in many ways. The gameplay is just horendous, awful, hideous; but to be fair, this is probably due to the fact that it's not a great port. It could be interesting on console, but this game simply does not age well at all. I gave it a chance, but it's not worth my time. 2/10 (JUST CAUSE it made me laugh until I quite nearly pooped my pants.... now if that's your thing, buy it now (don't buy it now!!! under any circumstances!!!)",
            "review_score": "-1"
        },
        {
            "review_text": "Short Review: The game is dated and its age clearly shows. When I first got the game, the user reviews were mostly positive. Now it's mixed, so you can probably tell from that too.   Full Review: - Gameplay &amp; Graphics While the scenes in the video look nice, playing it in 2014 with a 1680 x 1050 resolution and later in 2015 with a 1920 x 1080 resolution makes me feel like crying. If you force the game to full screen, it's pixelated, else it's small. I could adjust my default screen resolution to suit the game, but this simply reinforces that the game is outdated. It may be good in 2006, but certainly not now. The controls are your typical WASD and mouse interaction, while for the gameplay itself, I did not fully explore the game so I cannot offer a full storyline review. However, from my early stages in the game, it takes way too long to travel from one point to another with little to offer. While Far Cry also requires you to walk a long distance, at least you get to hunt some game. Not in Just Cause 1. It's just holding W and hoping someday, you get there.  - Audio The music and sound effects are pretty average in my opinion. I'm not a fan of it, but taste is subjective.  - Verdict Don't buy it, even it's for a really cheap 90% discount. Unless you're using an older and smaller computer, you've played it before and you want to play it again. In that case, follow your desire.",
            "review_score": "-1"
        },
        {
            "review_text": "10 out of 10 game. Lots of explosions. Some fun antics include: flying a gunship to the strip club in a volcano and gunning down a naked fat man, causing 9/11 with the Alexandre jumbo jet, blowing up cocaine, killing someone with a shipment crate, fisticuffing fishermen, and swimming on land with super fast rocket launching hover boats.",
            "review_score": "1"
        },
        {
            "review_text": "As a lot of people have mentioned, nowhere near as good as the second game, but in a sale its a great game. its fun and passes time and has the brilliant Just Cause 2 feel to it.",
            "review_score": "1"
        },
        {
            "review_text": "Just Cause.   But really ..... just cause. and also its a pretty awesome game just because.",
            "review_score": "1"
        },
        {
            "review_text": "Ok The First Time I Play 'This Is A VERY OLD GAME' Then I Play For A Bit  'Ok Ok I See How To Play' Then 'THIS GAME IS AWESOME'  10/10 Would Play Again",
            "review_score": "1"
        },
        {
            "review_text": "I give this a Yee/10",
            "review_score": "1"
        },
        {
            "review_text": "It might have been okay for it's time...but it's nowhere near the GTA series...even of the time. I found myself disinterested in the world and the game is too 'random'. AKA if you look away from a car on the road and turn your back again the car will be gone or replaced. This applies to vehicles that are being driven on the road too. The game play is pretty repetitive as well but fortunately you dont have to do the repetitive missions to progress the story (unlike in Just Cause 2). So you can beat it and get it over with reaaaaally fast.",
            "review_score": "-1"
        },
        {
            "review_text": "The game has super cartoonish graphics and gameplay for 2006 game. The menus is not intuitive at all. ♥♥♥♥ game. Nuff said.",
            "review_score": "-1"
        },
        {
            "review_text": "A must-be-played classic",
            "review_score": "1"
        },
        {
            "review_text": "pretty good game you should try it",
            "review_score": "1"
        },
        {
            "review_text": "Awsome game and you dont need a powerfull pc to play this game at max settings.I would give it a 8.5/10 awesome game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is about ♥♥♥♥ing everything up. You're driving down the road, bump into a gang members car, then ♥♥♥♥ hits the fan. You then shoot everything and it explodes. This game doesn't have much of a plot but it's like GTA with a different setting. Less hookers and more trees.  8/10. Could use more but it's still fairly badass!",
            "review_score": "1"
        },
        {
            "review_text": "GRAPPLING HOOK ALL THE CARS. BLOW UP ALL THE BARRICADES. WTF IS A STORY LETS DO SIDE MISSIONS!   20/0",
            "review_score": "1"
        },
        {
            "review_text": "As far as sandbox games go i think it's actually better then the gta games at the time (except san andreas). huge map, you can take over settlements and get new bases, parachute, use grappling hook to fly with cars while parachuteing, lots of vehicles and guns, and the missions are good and not too repeatitve. reccomend to any fan of 3rd person games or sandbox games ",
            "review_score": "1"
        },
        {
            "review_text": "Really under rated how fun it is. If you play this first before Just Cause 2 you'll get to know the back story",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game worth the $0.27 I spent. I would buy just cause 2 if this game would load it's own save files. I mean it's fun but i can't sit down and play through the entire game at once, and it crashes when it tries to load the save files. I would not spend any more than the $0.27 cents",
            "review_score": "1"
        },
        {
            "review_text": "In the standard tradition of Steam Summer Sales reinvigorating Bargain Bin Breakdowns I bring you, Just Cause. I picked up the first two in the series, and their included DLC content for an amount low enough not care what the games were. Having been part of a franchise that I recognized I knew they couldn’t be total crap, right?  Purchased and installed they sat there, icons on the desktop, being ignored while double clicks would happen elsewhere. Two icons over LEGO Worlds gets a double click, on the other side of the screen Quake 4 is the proud recipient of a click followed by and press of ‘Enter’ on the keyboard. Team Fortress 2, Fallout 3, Resident Evil 4, Race to the White House, Minecraft, Chips Challenge, even the Recycling Bin were all getting more click-action. Until I finally decided to hover the cursor atop its icon and give it the grace of the double-click. Why, after all this time did I finally take this step? Just cause.  As of writing I’ve logged five hours playing Just Cause and while that’s not enough time to provide a fair and honest review, I’m gonna do one anyway. Just cause.  Things start off with a free fall from the back of a plane where I need to meet up with a contact on a beach. The first time I did this I opened my parachute earlier than I meant to, then closed it and reopened it again, and again and again, and again. I guess Rico(the main character) has a hundred reserve chutes or maybe he can fold them up and repack them quickly? After a while I just decided to belly flop into the ocean, die, and start this crazy mess over. Only I didn’t die. Falling from really high up, gaining speed by holding my body tight and pointing down and I just splash like it was a five foot high dive.  I stared at the screen for a moment or two, awe struck, slightly annoyed. Seconds went by and I noticed the lack of a breathing reminder. So I waited, and waited, and waited some more. Never did I see anything informing me of a need to exit the water to breath nor did I suffer to the fate of suffocation. I’m going to hope the developers went with this route because of some aspect of the game I haven’t experienced yet, and not just cause.  Once I restarted and made it to the beach proper I helped my contact guy fight off some other people and then we left in his truck. During the truck ride I got to see the auto-aiming performed by the mounted gun in the back of the truck. I’m starting to notice a trend of ‘easy mode’, is this because I’m playing on an easy difficulty? Maybe, I don’t know, but I’m not complaining about it. I’ve reached the point where I’d rather have a enjoyable casual gaming experience than getting worked up because its too much of a challenge.  We make it to the base or hideout, or whatever it is, where I get a cut scene leading me into the first real mission. What that actually is I haven’t a clue since I’m focused on how this guy talking to me is completely trying to be Sam Axe from Burn Notice. But whatever, lets get this pony show on the road. I leave that place check around my surrounding and find a motorcycle, so I hop on and start driving towards the point marked on my map, just cause.  At some point I passed a police car and they yelled “Stop!” and hit the lights/sirens combo. I thought ‘Wow, that’s awesome it detected me speeding, this is going to a fun challenge to play!‘ So I stopped, and the police car pulled up and they got out. I got off my motorcycle, not knowing what to expect, then they shot me. I guess I should have expected this. Although I don’t know what it was that triggered them to attack me, but the police yelling at you constantly is an annoying part of the game, just cause.  I think it was somewhere around here that I realized I was playing a mob-less tropical-island-based Grand Theft Auto. Don’t immediately take that as a bad thing, the GTA franchise is one of the best ones out there. And sure, there are other games out there that put you in an open world like that, Mafia is another that comes to mind. But I mark GTA with that distinction since it was at least the first one I played.  The main story didn’t grab me as I had hoped, I went and broke some guy out of prison and instead of him wondering why I would do that having never met me, he had me join him. Which was good, since the reason why I was to break him out was so I trick him into letting me join his group. I feel like the leader of a rebel group would question the guy he’s never met before that breaks him out of prison. I guess he decided to just cause.  I did a couple main story line missions before I discovered the side missions. Missions where you help liberate small villages from different armies or something. Those were fun, repetitive, but fun. You would basically work your way up a road taking out roadblocks along the way until you reached either a flag that needed capturing or a leader that needed killing. I would fly my helicopter to a mission marked on the map, liberate the town, and then steal the helicopter parked on the roof of the building. Then fly off to the next one. I did this for a couple hours, and I had more fun than I had playing the main storyline. I’m not trashing the story or anything, it just didn’t grab me like liberation missions did.  From what I’ve seen Just Cause is the child of Far Cry and Grand Theft Auto’s wild night in Vegas. They’ve taken pieces from both and created this whole new thing. Its not terrible, its not amazing, it just is, just cause.",
            "review_score": "1"
        },
        {
            "review_text": "It might have been okay for it's time...but it's nowhere near the GTA series...even of the time. I found myself disinterested in the world and the game is too 'random'. AKA if you look away from a car on the road and turn your back again the car will be gone or replaced. This applies to vehicles that are being driven on the road too. The game play is pretty repetitive as well but fortunately you dont have to do the repetitive missions to progress the story (unlike in Just Cause 2). So you can beat it and get it over with reaaaaally fast.",
            "review_score": "-1"
        },
        {
            "review_text": "This is the second game in a row I have failed to finish. This game started off very well, it has a bright colourful cartoony style and nice music. There's a huge environment to explore with loads of side missions. It has some zany grappling gun mechanics where you can leap between vehicles. So where do the problems lie? Firstly the side missions seem rather repetitive and the rewards aren't that appealing. Certain weapons look very similar making finding good guns difficult. Getting around can be annoying, roads are few and far between with massive cliffs and dense woodlands covering most the islands. They have included airlifts and vehicle drops but these take an annoyingly long time. The vehicles' handling is very light at speed to make getting anywhere even more frustrating. The main reason I never finished this game is the last missions are just really hard with swarms of constantly spawning bad guys and after failing repeatedly I thought I have better things to do with my time.",
            "review_score": "-1"
        },
        {
            "review_text": "Played on Xbox and while decent for it's time, it does look very dated. Decent open-world but seems lifeless. Just Cause 2 is the better game to go straight into.",
            "review_score": "1"
        },
        {
            "review_text": "This game is as if the creators of alien colonial marines joined together with 3 year olds to make a game. Oh boy, such grateness. One of the ♥♥♥♥♥iest games I've ever played, if you are looking to kill your self with somthing similar to terminal cancer, this game is for you! Enjoy and RIP",
            "review_score": "-1"
        },
        {
            "review_text": "Antonio Banderas blows up the countryside with his amazing parachutes, grappling hooks, guns, and good looks.",
            "review_score": "1"
        },
        {
            "review_text": "(Walking through forest alone) 'STOEP CITI-ZAN!' Chuck Norris approved",
            "review_score": "1"
        },
        {
            "review_text": "awesome i got it for $1.74... awesome worth $10 awesome for like 2006",
            "review_score": "1"
        },
        {
            "review_text": "Antonio Banderas in a Michael Bay movie. That's all I have to say.",
            "review_score": "1"
        },
        {
            "review_text": "I don't understand why this game has mixed reviews. It runs great, has smooth graphics and plays well. You might have to read the guide about changing your resolution because it's stuck on 800x600. I got it to go 1920x1080 for me though.    It's fun.  7/10",
            "review_score": "1"
        },
        {
            "review_text": "nice game in 2006, lot of fun..but...err...I have to say, NO for this  game..why??  just try this game and you know why..LoL",
            "review_score": "-1"
        },
        {
            "review_text": "The game has an impressive number of side missions and other things to do, for an old sandbox game its actually pretty great.  However the main story missions are few, the chaacters are all... unlikeable and seem to think of itself as a 'B' movie but ends up being 'D-'.  There is lots of vehicles, guns and exploration, so it makes up for the main story. I would recommend it if you like exploring in the game more than the story itself.",
            "review_score": "1"
        },
        {
            "review_text": "Fk yeah! Just Cause! Get it! Awesomesauce!",
            "review_score": "1"
        },
        {
            "review_text": "Still one of my favourite games after all these years. Plenty of fun to be had with this one!  It is unfortunate that (for me at least) there is no controller support and the lack of a wide screen option is a little annoying. But otherwise this is still a fantastic game!",
            "review_score": "1"
        },
        {
            "review_text": "Fk yeah! Just Cause! Get it! Awesomesauce!",
            "review_score": "1"
        },
        {
            "review_text": "It really is a great game!!!",
            "review_score": "1"
        },
        {
            "review_text": "Great game, it is fun to play. Not as many bugs in the PC version as there is in the X-Box 360 version.",
            "review_score": "1"
        }
    ]
}