{
    "app_id": 6980,
    "name": "Thief: Deadly Shadows",
    "release_date": "2007-03-29",
    "developer": [
        "Ion Storm"
    ],
    "publisher": [
        "Square Enix"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Stealth",
        "Atmospheric",
        "Action"
    ],
    "achievements": 0,
    "positive_ratings": 1135,
    "negative_ratings": 210,
    "price": 6.99,
    "description": "You are Garrett, the master thief. Rarely seen and never caught, Garrett is the best that ever was. Able to sneak past any guard, pick any lock, and break into the most ingeniously secured residences. Garrett steals from the wealthy and gives to himself, making his living in the dark and foreboding City.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/6980/header.jpg?t=1447350999",
    "minimum_requirements": "IBM PC or 100% compatible, Windows 2000 or Windows XP, Intel Pentium IV 1.5 GHz (or AMD Athlon XP equivalent), 256 MB system memory, 64 MB video memory, Direct3D 9.0, and Pixel Shader 1.1, 100% DirectSound 9 compatible sound card, 3,000 MB free hard disk space, Keyboard and mouse Recommended: Intel Pentium IV 2.0 GHz (or AMD Athlon XP equivalent), 512 MB system memory, 128 MB video memory, Direct3D 9.0, and Pixel Shader 1.1 Thief: Deadly Shadows does not support play on laptop computers.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I had gotten this game when it came out in 2004 when i was a kid. And i got the other Thief games like 1 and 2 years earlier. Me and my sis played it everyday no joke. Everyday. She beat it at least 25 times litterally. It was the scariest game i had ever played and still is. I bought it on steam just to play it again and relive my childhood! One of my most favorite games ever!",
            "review_score": "1"
        },
        {
            "review_text": "This is a quality 2004 stealth game. You are Garrett and you have to find out what the Prophecies of the Keepers are. Because you are a Master Thief, the keepers use your abilities to steal certain items which involves the prophecy.  The game is a first/third person stealth game where you can roam around the city. Steal from houses, pickpocket random people on the street and do whatever you can to get money, between missions. It all feels quite alive in all the small areas of the city and it's always fun to find new routes or hiding places from the guards as you bag all them precious stuff. The people talk to each other, saying Good evening or bugger off as they walk by. Making it feel like a should be. Missions are done in special areas where you can't get in when you are just roaming though.  However, I said hiding. Though in this game you can hide from a guard who spotted you in a shadow that is about 1 meter away. The AI isn't the smartest around. Once a guard killed a, what I think was a bandit, and when he walked passed it 15 seconds later, he wondered how there could be a corpse on the ground and directly want to scan the place for enemies.  Which in most cases, is the player because well...nothing is as suspiscious as wearing a black hood. But even in missions, I once had an AI regularly walking and suddenly fall to her death, alerting everyone in the area.  I think that has to be the worst and maybe the only real problem of this game as the other thing that springs into my mind, is how awfully bad the physics system is. Bad but a good kind of bad. Everytime you will be amazed at how bodies go there way in this game.  But other than that, this game is a wonderful game. The story is interesting, the difficulty gradually gets higher as the game goes and the level design is just wonderful. Especially props to 1 certain level which could've been a stand alone horror game. *Shivers*  All in all, I recommend this game for it's story, gameplay and level design. The game looks a little old and it's best to download a FOVPatch from the internet, but the value of this game is certainly worth it.",
            "review_score": "1"
        },
        {
            "review_text": "Killed someone by dropping a basket on their head. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "You are Garrett, you are a thief. You steal for a living. This incredible skill you have, will make your life quite complicated. This is the third game in the series.  First off. Don't let the hours I spent on this game fool you. I have played this game so many times, countless of hours. I just have not owned it on steam until recently. I bought it again, because I think it is that great. Let's see when I have more time to return to it..... Just to make it clear, I am a great fan of thief. I have played all the games, and countless of fan-made missions. I am eagerly awaiting the new game (even though I am also a little bit worried about it). I have also played the entire dishonored game plus all DLCs, which I consider to be the best spiritual successor of the thief games up to date. I love stealth games, and I consider Deus Ex (and mark of the ninja) to be great titles as well, which I have all completed.  So, the game: There was one thing that this game did really well: atmosphere. I love the other thief games, but I think this game was outstanding in this area, and in a way, that is what thief is all about. At the beginning, this game was not too well recieved. I think that is because of two things: It was made with a console in mind, and it was compared to one of the greatest PC games of all time: thief 2. Trying to be as good as that game, is no easy task. But it actually think it did rather well in my mind. (Also, it was made by an entirely different game studio because 'looking glass' went bust...)  The other problem was that consoles in those days had quite limited resources, so areas could not be very large, making the game feel small with many loading screens. Now the PC did not have that problem, but the game was designed for the console, so....  But there the problems end in my mind. Because the rest of the game is really very good. And if this title would not be compared to its predecessors, I think everbody would agree it is a great game in its on right. There where some changes, but I think the essential 'thief' was still in this game, and it was well made.  Graphically, it was quite a thing when it came out. It was one of the first games to use dynamic shadows, and it required quite a PC to run well. Today that won't be a problem, but the game still looks and feels great, because the atmoshpere and design is that good. It serves the purpose very well even though you don't have the most amazing latest graphics. For example, Deus ex (invisible war) was made with the same engine, and that game has not aged well. I think it is because the art and the vision was so much better in thief than deus ex, so you forgive the graphics in thief - they are not in your way as much. But in deus ex the graphics turn you off a bit. A great examples that it is not always about the technical stuff, but how that media is used, and in thief it is used well.  It used to be a problem to run on modern PCs, but I find that this steam version works well, and there is also a lot of patches and support from the community that makes this games run better. There is an update that makes the game look better for example.  But what the game did even better was sound. You had to listen. Where are the enemies? Do I sound too much myself?  The music is sparse but just perfect. The sounds from the environment creates a great atmosphere. And sometimes the void of sounds was creppy too. Also the chattering that the NPS are making are fun to listen too. The original thief perhaps was better in this sense, but this game still kept some of that humor very well.  The story and levels in this game is also very good. And long, really long. You won't complete this game quickly. The game is also one of the most scary games I have ever played. Not because of the monsters, or cheap scares, but because the atmosphere is that good, and because of the 'uknown'. Thers is one level in this game I think should go to history as the most atmospheric level ever in a game. If you have played this game I think you know what I am talking about. The first time I played that level... I have never enjoyed and suffered so much at the same time, playing any game - I wanted to go on, and quit at the same time...  You can play this game in third person if you like, but that is just wrong. This game should be played in first person, or it is just broken and less immersive. This is a game where you need patience, perception and wits. Feeling vulnerable is half the charm of the game, waiting in a shadowed corner hoping the 'whatever' won't discover you. (this game was also new in a way that the NPCs could carry light sources, lighting up areas that previously were dark, making the games more interesting)  This is not a fighting game, you are a thief hiding in the shadows, where you are quite powerful. I miss games like these. Let's hope the new thief game is ok. But the 3 thief games that exist are still alive and worth it, with tons of modding and fan-made missions. And there is also dihonored of course...  This is one of those games you should complete if you considerd yourself a PC-gamer.",
            "review_score": "1"
        },
        {
            "review_text": "Ahh, this game. It's a great stealth game. One of the best, really. Its got stellar stealth effects. Light, sound, it all has an effect. Its fun using your wide array of items to either kill or knock out an enemy, or sneak by unseen. The bow is paricularly lovely in this game. The water arrows you use to put out torches are particularly unique. The city is pretty nice, even though it's small, it still manages to feel alive somehow. The areas are fun, filled with different paths you can take to complete your objectives. Which path will you take through the shadows? You choose. And its really fun sneaking around in the shadows. To me personally, this is one of the few stealth games where it isn't like ' I'm right in front of your face and you still don't see me, you stupid gaurd ? ' And while THAT much is great, there IS a reason for it. Because if you run this on windows 10 the game is so effing dark that you probably see as much as the gaurds you sneak past can. On windows 10 the brightness toggle doesnt work. And it starts off very dark. And there isn't a thing you can do about it. It's very frustrating. But as far as I know this problem is only on windows 10. Aside from this glitch, the game falls flat in a few areas. Even though this is a stealth game, the combat should be noted. It's awful. If you get caught and are engaged in combat, you might as well just retry from check point. I doubt this will matter to most people, but it still needs to be noted. Aside from that, they don't tell you how valuable resources are. They give you something likw 20 arrows, and you have to save them and not use them in the first mission, as if you spend all the money you make from the supposedly ' rare ' object you steal in the first two missions gets you enough money for around 17 arows. Yeah. Anyways, this is still a really good game, and an amazing stealth game. Windows 10 version: 6/10, Every other version: 8.5/10.",
            "review_score": "1"
        },
        {
            "review_text": "I looked down and saw my entire body  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Even after 12 years, this game still rocks",
            "review_score": "1"
        },
        {
            "review_text": "This game is one of the better stealth games I have played in a long time and i enjoyed playing it. The variety of gadgets is great and the story was pretty good in my opinion. This game also holds one of the scariest missions i have played ever.",
            "review_score": "1"
        },
        {
            "review_text": "Finally a Thief game that actually works! Very few times did I scream with anger at the computer because something broke, or my character got stuck in something illogical or anything that got me pretty ♥♥♥♥ing mad at the first two games. However, this one does seem to have lesser variety in scenery. The cradle level was specially fun :) The hub system gets a bit annoying with all the respawning guards and having to knock them out every single time, but it can be dealt with, and if you're tired of sneaking past them you can easily outrun them if you know where you're going. The map is INCREDIBLY annoying , it does not show where you are, and this becomes a major bother when you save somewhere in a level and get back to it some other day. This game is strange in that Garett sometimes moves like he has net lag, it feels like he stops a bit or gets thrown back a bit sometimes, like he is suffering from rubberbanding, somewhat strange. The wall climbing feature could be improved a bit, sometimes it does not work properly, but you can finish the game properly.",
            "review_score": "1"
        },
        {
            "review_text": "love this game played it obsessively for years on the original xbox even more since getting it on the pc with hd resolution and texture mods best stealth game i ever played withe the exception of the splinter cell trilogy",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite games of all time. The environment it creates is second to none and I still can't find another game like it even to this day. New games do not surpass it. Just play it.",
            "review_score": "1"
        },
        {
            "review_text": "Really Awesome Game! Deckard cain wouldve played this!!",
            "review_score": "1"
        },
        {
            "review_text": "I'm only a few hours/missions in but I am truly loving this game. I guess it caught some flak in the reviews but I'm not sure why as it holds pretty true to the originals with some beefed up ai and mechanics. If you've finished the Dark Project and The Metal Age and are wondering what's next I would give this a go as so far it's holding up nicely for me. Thumbs up Thief fans!",
            "review_score": "1"
        },
        {
            "review_text": "This is one of my child hood classic's when I was 7, the stealth and fun gameplay is sure is amazing to today, the other 2 old thief games are great as well so I really recommend buying the thief collection :)",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, great gameplay, this is an awesome stealth game! only 9 bucks! I would buy it if I were you...",
            "review_score": "1"
        },
        {
            "review_text": "Another stealth series I would highly recomend! Actually, I think the Thief series was the birth of the 'True Stealh FPS/RPG' Don't quote me on that, because I can't be sure, but I believe it is one of the first. And, it is almost purely stealth bassed! This is not a game for those that like to run through shooting up everything in sight. In order to progress through this game, you HAVE to sneak around!  There are two other games that preceded this one, both well worth playing and both are available on Steam. I had them running on older machines, but wanted them on this one. Fortunately, Steam made them available, capable of running on my Win 7 machine.  I'm still waiting for Thief 4 to come out. Eidos had said they were going to produce it back when they started Deus Ex: Human Revalution, but I haven't heard anything new sense then.  Anyway, try this, if you like it you might even like the older ones inspite of the older graphics.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun stealth game, but instead of hideing behind stuff, (which you can do) it's more about hiding in shadows.",
            "review_score": "1"
        },
        {
            "review_text": "Plsyed the original and played all the way through again, so clever for its time and still great fun.",
            "review_score": "1"
        },
        {
            "review_text": "awesome game, but its nothing campared to the first-two games.  if there is something like floating or crashing... you have the 'bad' hardware for this game.   happy taffing",
            "review_score": "1"
        },
        {
            "review_text": "Sneaking, FPS game. In this game, you go dark to dark without exposing yourself, with 3D realistic sound effect. so it's important to hold the structure, to do quickly. And the graphic description is good too, it feels scary sometimes.",
            "review_score": "1"
        },
        {
            "review_text": "At first the game was boring, then it was epic XD I love it!",
            "review_score": "1"
        },
        {
            "review_text": "Why arnt you playing this? 11/10",
            "review_score": "1"
        },
        {
            "review_text": "───────────────────████ ───────────────────█████ ───────────────────██████ ───────────────────███████ ──────────────────████████ ──────────────────████████ ─────────────────█████████ ────────────────█████████ ───────────────█████████ ──────────────█████████ ──────────────██████████████████ ────────────█████████████████████ ───────────███████████████████████ ████████─██████████████████████████ ████████─███████████████████████████ ████████─████████████████████████████ ████████─████████████████████████████ ████████─████████████████████████████ ████████─████████████████████████████ ████████─███████████████████████████ ████████─██████████████████████████ ████████─█████████████████████████ ████████─████████████████████████ ████████─███████████████████████",
            "review_score": "1"
        },
        {
            "review_text": "In Thief you play as a ♥♥♥♥ Ass Theif and cut off people's ♥♥♥♥♥ and steal some cool stuff. You are also the xXdArkLOrDXx, master of shadows and can hide in plain sight as long as it is dark, like my soul. Cool game get to be sneaky but you suck ♥♥♥♥ at fighting like holy ♥♥♥♥ ♥♥♥♥♥ u got ♥♥♥♥♥ ♥♥♥ arms. eat some protein",
            "review_score": "1"
        },
        {
            "review_text": "Shalebridge. Frickin'. Cradle. The first two were better, but I've nothing bad to say about this one.",
            "review_score": "1"
        },
        {
            "review_text": "This is the sh*t!",
            "review_score": "1"
        },
        {
            "review_text": "great fun, if you like a game with more tactical options than 'kill everything that moves but the hostages'.",
            "review_score": "1"
        },
        {
            "review_text": "What your's is mine.",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "I can't pass the tutorial level but HEY GOOD GAME EH",
            "review_score": "1"
        },
        {
            "review_text": "this is just so fun :D",
            "review_score": "1"
        },
        {
            "review_text": "BUYER BEWARE: Lockpicking simply doesn't work for me, I've tried all the in-game graphics settings and the recommended settings for my graphics driver with no love. Apparently the only way this game MIGHT work on my system is by using a fan-made patch, which I'm not keen on doing.  Damn you, Eidos - Square/Enix, companies shouldn't continue to sell old games when they don't even support them on current systems. At the very least pay the guy(s) who fixed it and make it an official patch.",
            "review_score": "-1"
        },
        {
            "review_text": "Probably the worst of the series. - Lets throw away the interesting universe for a dull medieval setting. - Take away the sword and complex combat in favor of mashing mouse 1 and praying you land more hits. - Change the guards from a diverse cast to all of them being 'drunk/idiot/both.' - Turn the game into an open-world grindfest that becomes impossibly easy within 2 hours without even trying to grind. - Add goofy minigames to various aspects of the game that get old during the tutorials for them. - There's a plot? It makes zero sense? Wow!   But uhhhh it has da best grafix!! Hahaha!",
            "review_score": "-1"
        },
        {
            "review_text": "A clumsy game. Movement physics akin to wading through mud, a recurrent jumping bug and obnoxious level transitions destroy any momentum this game could have had. Ion Storm couldn't get right something that Looking Glass Studios mastered four years before them. Curiously, after the technical disaster of Deus Ex: Invisible War, Ion Storm did not think not to use the same engine, warts and all, for Thief: Deadly Shadows.     There is a third person mode and a first person mode. In an attempt to create two cameras, neither is particularly well implemented. The first person camera is tied to Garrett's model, and his animations are awkward and twitchy, which could easily induce motion sickness in some players.    You will return to the City hub repeatedly after each mission. Each time, you will have to sneak through the same areas, around the same City Watch guards, patrolling the same paths. Ion Storm somehow did not realize this would instantly become incredibly tedious.    Movement while crouching is absurdly slow, meaning to get around you will want to stand up and run. I cannot express in words how unbelievably braindead this idea is. Furthermore, it is now impossible to keep pace with a guard while crouching, so in order to pick his pocket you will need to stand up and run.    Blackjacking is strangely convoluted: when you are behind someone, standing, the guard isn't searching, Garrett is raising his hand and the blue moon aligns, you might trigger a scripted knockout sequence. Otherwise you'll just have given the guard a friendly tap over the head that alerted him to your presence.    Guards will notice when you put out lights, discouraging you from ever using water arrows.    Garrett makes no sound at all when creeping or crouched, so there is almost never any reason to use moss arrows.    As a result of this, you will most likely never spend any of the gold you can now accumulate over the course of the game. I finished the game with some 25,000 unspent gold and a full inventory of items I never used. At least in Thief 1 and Thief 2 I would spend all my gold on items I wouldn't use since there were no item caps and gold did not carry over between levels.    A braindead lockpicking minigame that you will repeat over and over and over again. It locks you in place, so you cannot quickly check your surroundings without awkwardly fumbling out of the lockpicking minigame.    Loot now sparkles, so you do not have to look around to find it.    The climbing gloves are a poor man's substitute to rope arrows. Often you will try to climb a stone surface only to find that it is blocked off by an overhang, if you can even climb the surface at all—it seems as though the rules for which surfaces you can climb are not very consistent.    Garrett has apparently forgotten how to swim, and simply drowns  instantly  upon making contact with water.    Why in the ever living  ♥♥♥♥  would the loading zones prompt you whether you want to move to the next area with a yes/no choice? I moved into the loading zone, I obviously want to load the next area. Do not ask me twice, you are not a Windows GUI.   Expect problems even with the Sneaky Upgrade, as the Thief: Deadly Shadows engine is poorly optimized. I cannot in good faith recommend this game to anyone.",
            "review_score": "-1"
        },
        {
            "review_text": "It's rather boring...  Perhaps it's just something about how I'm constantly fighting with the controls or something, but I can't be bothered to finish it anymore. It's just too boring for some reason...",
            "review_score": "-1"
        },
        {
            "review_text": "I found it to be pretty dull. The inability to run and the general slugishness of the movement made interacting the maps dificult. It sounds like all of the guards are being played by Gilbert Gottfried or Wallace Shawn, with dialog written for a childrens cartoon, which kept me from ever feeling any real tension or even caution. The fighting mechanics were all but nonexistant, the plot seemed terribly dull, the enviroment was dull, the music was dull, and the lock mini-games were pointless; lockpicking didn't provide any risk or challenge - as in the Elder Scrolls, for example - but rather it was just moving the mouse around and drifting half asleep.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is hilariously bad. Like, it's the video game equivalent of The Room or Uwe Boll's House of the Dead. It has so many of the classic stealth game tropes, where guards will find a dead body, become alarmed for 3 seconds, before returning to patrol and idly whistling. You will watch guards swing swords nowhere near your body but you will take damage anyway. You will watch pedestrians accidentally path into each other and struggle for minutes as they attempt to bypass each other, occasionally triggering generic bystandard talk as they walk in place, face to face with each other.",
            "review_score": "-1"
        },
        {
            "review_text": "Perhaps those that play this game remember it La Vie En Rose. For the layman, that means that this game is not that good. It's mechanics are broken (blackjack works 1/4 the time, freezes while trying to jump on a box in front of him like a moron, turning corners while crouched was stilted), light sources go through walls, badly programmed (choose between bloom and AA? uh, ok) and it really is boring. You can literally stand right in front of someone and they wont see you till you are behind them and swinging a club at their head, then they take the club like a champ and go into alert mode. However, they dont inform anyone else of their findings. I stole a mission item and the guy who owned it said 'someone stole it' and promptly went back to walking in circles. He was ♥♥♥♥♥♥ that some guy would take it and then it is stolen and he goes '♥♥♥♥ it, I havent walked around this hallway enough times, I'll get to that later'. I shot a chick in the face with an arrow. She ran away. Tried to jump through a window and the guy acts like I'm telling him to fly. Jump? Out this window? How about I just leap in place and alert everyone around me intsead? Great. ANY other game with stealth elements made in the same era is better. I was legitimately sad to not to like this as every reviewer in gaming history thought this game was the pinnacle of stealth gameplay. Yah, if you dont play any other games. Perhaps compared to what came out AT THE TIME but that would be a stretch because i could probably find a dozen games i would rather play than this.  Purchase at your own risk. ",
            "review_score": "-1"
        },
        {
            "review_text": "  Having previously played the Thief game; this game was a plain letdown.. The controls were far from intuitive, the graphics were harry-potter-style low and generally I just expected a whole lot more from this game. Perhaps I should have looked into it better, but I simply cannot recommend this.",
            "review_score": "-1"
        },
        {
            "review_text": "Definitely a great game if you like to be sneaky and play a level how you want to play it. Removes the really bad 'line-of-sight' detection and works with it in a more realistic way. Awesome game.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best stealth games I've ever played and continuously proves this by adding new gameplay elements of stealth throughout the progression of its story.  Pro's + Lengthy and suspensful storyline with a perfect ending.   (Perfect in the sense that I don't need to see a sequal with the same protagonist). + Memorable moments (The orphanage/insane asylum nearly made me ♥♥♥♥ myself). + Memorable characters and how they talk...  Pagans: 'Where bes that woodsy little beastie?' Stone creatures: 'Find and catch And Crush AND KILL AND CRUSH AND KILL!'  Con's - The climbing boots/gloves.  What started out as a good idea and served its use in a select fiew parts of the game it overall seems to have been forgotten or abandoned by the dev's. When navigating the town going form mission to mission, I thought this item would open up new paths for exploration or give more shortcuts to save time traveling but it is largely ignored.  There's one mission where you go break into a mansion on an island an one of those paths you can use is climbing the front building's wall and entering through the balcony via use of climbing gear. That is the only use I have seen for this expensive item (Oh yeah, you have to buy this nonsense).   I was luck enough to play this before Thief 2. A lot of people see this sequal as a bad game and/or comlain that you no longer have a sword to defend yourself and are given a pissy butter-knife. That is kind of a moot complaint, a theif should be light on their feet. They don't need extra weight holding them back.    The game's over-world/HUB town was interesting in an era were game environments were becomming more 'open-world' or 'sandbox' but now as I look back, I would have prevered to just jump into the next level like in the previous games.   Conclusion: I recommend this game for was it is, a solid experience.  Note: I don't know if Thief 3's multi-core processor crash has been patched. If not, hit Ctrl+Shift+Esc to bring up Task Manager, and under process right-click the game's executable and set affinity to 1 or 0 (making the game run on only one processor).",
            "review_score": "1"
        },
        {
            "review_text": "While starting to show its age this game is well worth a visit if you haven't played it yet and a revisist if you have. Stealthy gameplay and unique mechanics that were ahead of their time and still feel fresh and enjoyable. Listening to witty conversations as you sneak through the shadows is always a treat. Don't miss out on a playthrough before the new Thief comes in 2014.",
            "review_score": "1"
        },
        {
            "review_text": "I should say: WOW!!! to this game, the graphics in these are sooooo perfect ( compared to COD 1, 2, and 3) i think this game blows many people's mind because........ look at this G*Ddamn crazy graphics!! so awesome! the gameplay is very fun and sneaky, the story contains a lot of secrets and dark parts, i think for you guys that want to play the new thief should play this one first! and in this price! this game is totaly worth it! i bow down to eidos for making this game.  best graphics game of 2004 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Utterly graceless and deceptively satisfying.",
            "review_score": "1"
        },
        {
            "review_text": "This was one of my favorite games for the orginal xbox. ignore the hours here on steam, I'll be honest I haven't played it that much on my computer, but I beat it repeatedly on the orginal xbox. stealth, kncking out or killing enemies or guards. lot's of fun, I recommend it much! at some points it is linear, and other points it is almost open world, with few loading screens, in comparison to other games of that era. a great game, in a great series",
            "review_score": "1"
        },
        {
            "review_text": "As far as I'm concerned, Deadly Shadows is to the Thief series what Invisible War is to Deus Ex, and I don't mean that in a bad way, because I enjoyed both. I mean this in terms of, it's using the same engine with similar system requirements, and suffers from similar problems.  Let's start with what was added. The visuals are great, and even if they lack color, the pristine detail of nearly every model makes it look a generation ahead of its time. A lockpicking mechanic introduces gameplay more complex than 'hold F to unlock'. The city now serves as a hub, allowing the player to sell loot and buy equipment, and explore for extra challenges in an open-world environment. Even backtracking doesn't seem very tedious, due to the presence of hostile who roam the streets. A faction system allows the player to make friends or enemies with the Hammerites and Pagans, who in turn can provide backup in combat and freedom to explore their respective domains.  However, a few things were removed. Rope and vine arrows are gone, replaced with gloves that allow Garrett to climb some walls. Also not present is the ability to swim. While Deus Ex: Invisible War dealt with this by simply removing water, Deadly Shadows has the player die in it, which just makes it seem like a tease. Moving the equipment purchases to shops means that, to restock, a player can no longer buy just before a mission. It goes hand-in-hand with the depth of city exploration, sure, but it makes a significant chunk of gameplay time just restocking. On a side note, the prices of these goods is far lower than that of the previous titles, so I don't find myself running into the same problem I had with Thief 2 (running out of useful items) as often here.  The biggest problem with the game, though, is the inefficient and somewhat clunky (modified) Unreal Engine 2, which, as I stated earlier, was also used in Invisible War. The small areas are handled considerably better here than they are in IW. Enemy patrols and depth of level design are well done, but the level transitions between these smaller levels is a sword that cuts both ways. On one hand, it provides a quick, if unfair escape from pursuit. On the other hand, enemies are left in the exact same spot and alert level when doing so, and going back to the area will lead to a pummelling. Handling also feels a little awkward. The hit detection isn't all that great, and I frequently found myself falling from places against my will because the ledge detection is so awful. My most common problem was with the jumping glitch, where Garrett will appear to be floating just above the ground, with no ability to jump or crouch.  Overall, it's a good Thief game, a good stealth game, and a good game in general. Apart from the occasional crash and the removal of some perfectly functional mechanics from the previous games, this one successfully experiments and improves on a few of the other gameplay aspects.",
            "review_score": "1"
        },
        {
            "review_text": "A great game from a wonderful series. I like having a stealth game that isn't just based on crazy missions for governments or assasinations. This game is a mixture of profit and an overall storyline. Garret is a marvelous character and you can do so much with him. It has btr graphics and btr world then the other 2 games but on the other hand it lacks some of the amazing qualities of hte first 2 like rope arrows, swimming, and litterally nothing to buy with money. Still this is a wonderful game and I reccomend playing the thief games in order.",
            "review_score": "1"
        },
        {
            "review_text": "Thief: Deadly Shadows is sort of the black sheep of the Thief franchise.  Bare in mind that this game was barely finished, and the fact that it was even completed in this state is fascinating. Not to mention that this game made numerous improvements with it's aesthetic design and lighting mechanics, finally ridding the series of a static shadow system.   So, in other words, it's good. Really good. Any stealth fan would love it.",
            "review_score": "1"
        },
        {
            "review_text": "I grew up to love stealth in gaming, and it all had to do with the summer nights me and my brother spent on this game",
            "review_score": "1"
        },
        {
            "review_text": "Old and ♥♥♥♥♥♥, but it was epic in it's day.",
            "review_score": "1"
        },
        {
            "review_text": "Thief: Deadly Shadows is one of the few true stealth games. At one time it probably set the benchmark for stealth games. It still holds up well in some eyes. Thief may not be my kind of game and honestly i didn't like it. However, for the stealthy gamer i feel this game deserves to be recommended. So even though its not for everyone Thief: Deadly Shadows is a decent game.",
            "review_score": "1"
        },
        {
            "review_text": "One - you're earning me a ticket.  Two - Thi4f is coming soon! Don't be left wondering who Garrett is and get this game. It's not the best of the series, but that doesn't mean it's not excellent, especially if you like hiding in shadows and blackjacking people like you do in real life to get the womens. You need help, dude.",
            "review_score": "1"
        },
        {
            "review_text": "Thief, many things i like about this yet the series it brings the best stealth mechanics , enviroment , ♥♥♥♥♥♥♥♥ npc's , pretty mutch everything you would need for a stealth game , the series is one of my all time favruite series. if you would like to play the thief games i would recommend backtracking to the first game the graphics may not be as good as the newer games but it brings good content and i do not think you will be dissapointed playing this series",
            "review_score": "1"
        },
        {
            "review_text": "Has super major probs running on a modern computer. Dont bother unles su are into problem solving and ♥♥♥♥ (i dont mean in game either)",
            "review_score": "1"
        },
        {
            "review_text": "A great stealth game, almost as good as Splinter Cell, grab it!",
            "review_score": "1"
        },
        {
            "review_text": "An amazing title you should not pass up. Very atmospheric. Quite lengthy, too. Lots of fun things to do.   In-between missions (After the tutorial level and the mission after that.) you can explore parts of the city and complete side-quests and find secrets, and just screw around, all with amazing atmosphere.  What I did was I gave myself a ton of money with Cheat Engine so I could screw around with the game's wide array of items.   One of my favorite things to do is to use Oil flasks to watch people slip in a slap-stick Home Alone movie manner. Good fun.  I also like the implimentation of the wall-hug.  Only thing missing is Rope Arrows, the climbing gloves are pretty awesome though.  Spidermaaaan spidermaaaan got his powers stolen by garrett's haaaand.  They're also kinda glitchy.  Yeah this game has some strange bugs and glitches. On rare occasions in certain areas, when climbing onto a ledge you could fall through the world.  Occasionally, Garrett levitates due to a glitchy jumping system which is easily fixed by equipting the bow and arrow (any kind of arrow), clicking left mouse to hold the arrow, and then cancelling the shot with the space bar. You could also tap the mouse button to quickly do this.  Oh and Garrett can't swim anymore. Not that there's much water in the game anyway...  I really like how the skybox has these cartoonish silhouette buildings with yellow boxes representing lit windows. Very well done. Really amazing atmosphere.   That reminds me, the lighting engine kicks ♥♥♥. Shadow volumes for the win. They don't have the blurry pixelation issue that more modern games have when it comes to lighting... New games have shadow resolutions... and they can be highly intensive... They also seem to have striping issues. Some people who play skyrim have striping issues with the shadows in that game. Shadow Volumes need to be brought back into gaming. They could be used to create a sun ray effect, aswell. (Because shadow volumes is basically a method of extruding some polygons and anything within the bounds has their illumination set to a low amount to create a shadow, why not use those extra polygons instead of using them merely to emulate shadows? Emulating Shadows AND volumetric lighting would be killing two birds with one stone.  I thoroughly enjoyed this game, and I hope you will too. If only it wasn't planned for a multi-platform release... Imagine what the game could have been. There were some amazing parts in the game like the Thieves highway in Old Quarter. Imagine a massive city with a thieves highway creating a shortcut. The vision feels so ahead of time in my opinion. I could just imagine what the game would have been like if it didn't have to develop around the Classic Xbox's limitations. I mean some of the Xbox version's missions had to be shrinked...",
            "review_score": "1"
        },
        {
            "review_text": "Very good but also very complicated",
            "review_score": "1"
        },
        {
            "review_text": "The pace of the game is slow, the animation definately dated, and the voices are...repetitive (to be kind). That being said, if you have a few hours to kill and a will to find every nook and cranny, thief satisfies. Skulking through dismal levels, waiting for minutes while the guard goes to sleep, navigating the world without a goal indicator, and then triumphantly completing a level without being seen, or fighting anyone! There, gentlemen, is a true sense of accomplishment.",
            "review_score": "1"
        },
        {
            "review_text": "Thief 2",
            "review_score": "1"
        },
        {
            "review_text": "Warren Spector's swan song.",
            "review_score": "1"
        },
        {
            "review_text": "An awesome stealth game, just go buy it",
            "review_score": "1"
        },
        {
            "review_text": "You can easily find a few weak points in the third part of great franchise, but it's still be most immersive, scary (!) and well-written stealth-action created so far.",
            "review_score": "1"
        },
        {
            "review_text": "Best stealth-game ever.",
            "review_score": "1"
        },
        {
            "review_text": "It's a pretty fun stealth-based adventure game. The voice acting sounds really silly, and their dialogue isn't great, but it can be entertaining if you don't expect it to be completely serious. Only real problem for me is a bug that makes it crash constantly =/",
            "review_score": "1"
        },
        {
            "review_text": "While not in the same league as Thief 1 or 2 it still manages to bring new stuff to the table while keeping the old. The music is still composed by Eric Brosius, so the atmosphere is still very ominous and dark. The added free roaming of the city is a welcome addition in my opinion as it allows the player to take in the sights and relax from the tense missions.  Still better than the reboot!  10/10  Dat Shalebridge Cradle mission.",
            "review_score": "1"
        },
        {
            "review_text": "This gem is very very fun. It was built for systems running mid-high range GPU's back in 2004-2005. As a result, you can really crank it up today and see it in all it's glory. This game was optimized for Windows XP, so it takes some work to get it running smoothly on Windows Vista/7, etc. But, with the fanmade patches and the right tweaks...it's a blast and still one of the best, fantasy FPS type games out. The game deals with Garret, a great thief and our hero (Anti-Hero if you prefer). The story is solid, and the stealth action pure adrenaline. The gear Garret uses, from water arrows to put out torches to Distraction arrows that explode and draw enemies to the place of shooting the arrow to the blackjack for knocking people sensless to...you get the idea. This game is made by 'Eidos' interactive so it reminds one of a pumped-up Hitman game meets Lara Croft in a fantasy setting. Get it and try it. It's dirt cheap on STEAM and Steam is selling all Thief titles from the 1st one to this.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun stealth game.",
            "review_score": "1"
        },
        {
            "review_text": "Was rather suprised it came out in 2004. Aged very well in 2014. Addictive. Advise you Taffers to get the Thief Collection with Gold &amp; The Metal Age for only $19.00 Best deal Steam has or probably ever will have.",
            "review_score": "1"
        },
        {
            "review_text": "Heyyo, This older but solid Thief game is a very fun game indeed. With High Definition texture mods and widescreen mods it makes it even more fun. Highly recommend this for stealth game fans.",
            "review_score": "1"
        },
        {
            "review_text": "A good stealth game for the Shady croud. But lt's the last one in the series so make sure to pick up the other two thief games ahead of time.",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome. It is full of lots of juicy sneaking about and knocking people out from behind. The maps and the city between missions are full of opportunities for exploration - lots of alternate routes and hiding spots to explore, and ways to use the environment to your advantage. It's also full of different items to use, particularly an assortment of specialty arrows. For instance, one kind of arrow makes a bunch of noise where it lands to draw guards away.  One of the last couple of levels remains near or at the top of my list of most spine-tinglingly creepy moments in video games ever, and that's speaking as someone who didn't bat an eyelid at Amnesia: The Dark Descent.  The plot is also reasonably interesting, though I expect it helps if you've played the first two already. It finds ways to involve you in a pretty good variety of different situations. The levels themselves have plenty of interesting twists and turns, and are very well-designed.  ",
            "review_score": "1"
        },
        {
            "review_text": "A wonderful stealth game with an unpredictable and exciting plot. A great villain, plenty creepy and just oozing with atmosphere. Some of the levels have loading screens between areas, which weren't present in the first two games, but still there are plenty of super fun levels. The much stronger story and characters make this game the best out of the trilogy for me.",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed this game. It's a tad clunky, not as polished as it could have been, but a ton of fun. The story is amazingly interesting. The unique setting is enjoyably more realist than past entries in the series, it has a touch of steampunk and a touch of fantasy but neither is overpowering. The game takes place in one big city, which is littered with lore, loot, sidequests, and main missions. Exploring the city, instead of simply being transported from mission to mission (as in previous thief games), makes the experience feel more cohesive. Furthermore, this extension of the atmosphere conveys the place of the hammers, the keepers, and the pagans more clearly. Sadly, some of the items (like the rope arrow, invisibility potion, speed and slowfall potions) from the previous games did not make an appearance. The maps are a bit cumbersome to use because your current position is never indicated, forcing you to navigate by compass; luckily levels are, generally, simply laid out...but still assuredly interesting. Great atmospheric music! The mission 'Robbing the Cradle' is spookier than most horror games and the highlight of this game IMO. Unfortunately melee combat is a bit of a joke, and load times are a bit long. Despite this game's few unpolished aspects, I think its overall game design is fantastic and its gameplay undeniably fun. It's mysterious, suspensful, and satisfying. Good game, great Thief... highly recommended for stealth fans!",
            "review_score": "1"
        },
        {
            "review_text": "gaym of the year 200- whenever xdxdxdxdxdxdxdxdxd",
            "review_score": "1"
        },
        {
            "review_text": "One stunning game that is a true classic.",
            "review_score": "1"
        },
        {
            "review_text": "7/10",
            "review_score": "1"
        },
        {
            "review_text": "Just Magnificent!  This game has so many hidden secrets and paths, which makes it even more fun.  PS: The Laptop uncompatibility should be taken out as it's false nowadays, there is not a single laptop that can't run this game.",
            "review_score": "1"
        },
        {
            "review_text": "It is quite refreshing to have a game that doesn't focus on combat and instead looks to the shadows for stealth and secrecy. While not much like the previous two games, Thief: Deadly Shadows is an enjoyable trip to Garrett's ever-changing worls, where nature and metal and magic work against or with one another to make thievery more difficult for our hero. The controls are not quite spot on, yet the atmosphere, characters, and plot all work well to create a situation that players will enjoy. The graphics are not the best, yet they add another level of depth to the game which allow for a more realistic crime-causing experience. It iss a relatively long game that changes the way Garrett and the player must work o survive in an ever-changing world of Thief.",
            "review_score": "1"
        },
        {
            "review_text": "Requires a bit of planning and patience, but is well worth picking up.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game and worthy purchase ",
            "review_score": "1"
        }
    ]
}