{
    "app_id": 70000,
    "name": "Dino D-Day",
    "release_date": "2011-04-08",
    "developer": [
        "800 North and Digital Ranch"
    ],
    "publisher": [
        "800 North and Digital Ranch"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Multi-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud",
        "Valve Anti-Cheat enabled",
        "Stats"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Dinosaurs",
        "Action",
        "Multiplayer"
    ],
    "achievements": 77,
    "positive_ratings": 12222,
    "negative_ratings": 2367,
    "price": 6.99,
    "description": "Frantic, multiplayer action involving Nazis and dinosaurs! What are you waiting for? This is World War II as it should have been!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/70000/header.jpg?t=1478380788",
    "minimum_requirements": "OS: Windows XP/Vista/7 Processor: 3.0 GHz P4, Dual Core 2.0 (or higher) or AMD64X2 (or higher)  Memory: 2 GB RAM  Hard Disk Space: 5 GB of free space Video Card: Video card must be 128 MB or more and with support for Pixel Shader 2.0b (ATI Radeon X800 or higher / NVIDIA GeForce 7600 or higher / Intel HD Graphics 2000 or higher). Sound: Direct X 9.0c compatible sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Nazi Dinosaurs with Cannons and Machine Guns on their backs. What more do I have to say?    Dino D-Day is a humorous WWII Multiplayer FPS about what would happen if not only did Adolf Hitler's science teams brought the dinosaurs back to life, but also gave them nerve controlled weapons, the intellegence to comprehend language, ideology, nationality, and not eat their masters? You get this silly game where Dinosaurs have cannons, machineguns, their own claws and abilities, and even suicide bombing mini dinos; I'm not kidding. The game got it's start as a single player mod for Half Life 2, but it was scrapped apparantly and it's assets turned towards a multiplayer game.   There are two teams, The Allies, and the Axis. With some memebers of either having special abilities to use.  The Allies are John Hardgrave (The Leader), who uses either the M1 Garand or the M1 Carbine. His ability is when he gets three kills, he can go into a Patriotic beserk spree! Punching facists with his super fists high into the air!   Then there's Joe Spencer, he uses either a Tommy Gun or a Grease Gun, his specialty is calling in artillary strikes onto a part of the map, which is useful for either clearing a certain chokepoint of enemies, or dealing damage to critical targets.   Up next is Nigel Blythe, English Gentleman with a Shotgun, and his choice of either a rocket launcher or a flame thrower to light those jerries up!   Supporting from the rear is Ilona Vike, cute as a button but sharp as a razorblade. This Soviet Rose is the sniper of the team and utilizes her rifle, her revolver for back up, and a dead rabbit to distract certain dinos into losing control and eating, leaving them vulnerable to either Ilona herself, or her comrades.   Supporting at the front is also Camille Brun the medic, she heals nearby teammates with her special or can chuck heal oozing medpacks for teammates to gather around.   Finally, there's Trigger, the wonder dino! Liberated from the Nazi Army, Trigger is the only Dino the allies have, and he's as deadly as he is cute, getting revenge on the long long hunt from carnivores millenia ago, Trigger uses his nerve controlled, swivel mounted 30. Browning Machine Gun on Facists, wether beast or man.   The Axis forces only have three humans, being mostly comprised of Facist dinosaurs!    Kurt Streicher is a simple soldier with no abilities to speak of, Armed with his rifle, his MP40, and some grenades, he does good on the front on his own.  Karl Hissman is the more interesting German, being a falconer, he's trained explosive, suicide Pterosaurs to fall onto where ever he points at, killing anyone nearby (Did I mention you can, if lucky, lock the Pterosaur onto an enemy?). Aside from that, he serves as the team's sniper against Ilona.  The final Human is Don Graff, the Medic and Vetrinarian for the Axis war machine. be wary that even though he is a simple medic, he is armed with an STG44.  The Facist Dinos include the classic Velociraptor, who can use his speed to surprise and overwhelm enemies, and even pounce onto them to rip their throats out.  The Dilophosaurus can pick up one of the many goats (did I mention there's goats in this game?) and lunge them at enemies for damage and laughs, as well as the ability to knock down enemies, pick them up, and toss them for a double kill!  The Desmatosuchus is a walking tank, armed with a medium but still powerful tank turrent, he can supress enemies and kill with splash damage. Be mindful that he and his spikes are big, so it's not easy to get through certain doorways.  The Stygimoloch is the Desmatosuchus, but more mobile, agile, less bulkly, and has a MG34 Machine gun instead of a cannon. He is the German Trigger.  The Microraptor can do it all! He can fly, claw people to death when they don't know it, and blind people with a deadly acid spit, while clawing them to death!  The Compsognathus, or Compy for short, is a suicide bomber dino, though small and his bomb is just a stick grenade, he is still fanatical, and with three kills from his claws, turns his grenade from a weak firecracker, to a powerful bomb that can kill many, and set others aflame!   Finally the grand daddy of them all, only avaliable on certain maps, The Tyrannosaurus Rex! You can't spawn as him, rather there's a 'waiting list' on the Axis team where a random player gets selected to become the Rex until either the end of the round, or death where upon another player is randomly chosen. He is nasty, Armed with two MG42s on the sides of his head, able to pick up and toss airplane bombs, he also uses his might roar to knock down enemies and if they're unlucky enough, The T-Rex can pick them up and eat them for health! His only problem is his pure size and slowness, making him a target for everyone.    The game comprises of three modes. Team Deathmatch (First team to 50 kills wins), King of the Hill (The side that controls the hill point for 3 minutes wins.), Control Points (First team to capture all points wins.), and Objective mode. Otherwise the game is your typical FPS combat, with the Allies being more for group tactics and shooting, while the Axis Dinos are more arena shooter.  Overall this is a fun cheap game, I got this for $1.99 when it was on sale the other day, and it's worth the money if you can find a crowded server. The game is active with a couple of players, so no worries about finding a big game. I would indeed reccomend this game.  Pros:  -Fun Gameplay -Gunplay is good -Dinoplay is amazing -Cheap  Cons:  -Weird Control choices (Holding the aim button while in toggle mode won't let you fire your gun, this can be switched to hold down though.)",
            "review_score": "1"
        },
        {
            "review_text": " Novel in concept, somewhat generic in practice // Recommended for fans of Team Fortress 2 who want to shake it up a bit*",
            "review_score": "1"
        },
        {
            "review_text": "Dino D-Day is an alternate universe shooter where the Nazi's have Dinosaurs. Dino D-Day is a multiplayer game where you can either fight against the overwhelming power of the Nazi army aided by Dinosaurs, or fight on behalf of the allied nations. You can play as human or dino in this interesting shooter. Visually its not a AAA Title, but it is still fun to play.",
            "review_score": "1"
        },
        {
            "review_text": "Easy choice for the 'Best Use of A Farm Animal' award 2016.",
            "review_score": "1"
        },
        {
            "review_text": "Best idea for a game ever.  If you dont like it you are wrong.",
            "review_score": "1"
        },
        {
            "review_text": "hitler invents dinosaurs and you have to invent a huge meteor in response",
            "review_score": "1"
        },
        {
            "review_text": "I Alt-F4’d when Tyrannosaur ran towards me.",
            "review_score": "1"
        },
        {
            "review_text": "Didn't do a lot of research when buying this game; it had positive reviews and was on-sale. I was initially disappointed in the lack of a campaihn mode, but it became apparent how silly that would be once I logged onto a server and started mauling goats as a velociraptor in WW2 Germany.   If you have a hole in your gaming life that can only be filled with dinosaurs and World War 2 action, this game will fill it nicely.   Also, I shot a goat in the head 12 times; it didn't die until I shot it in the stomach.   8/10 playability; 1/10 realistic goat-murder mechanics",
            "review_score": "1"
        },
        {
            "review_text": "This is a pretty great FPS. There isn't much reason to not like it unless you don't like the FPS genre.  Pros: -All the weapons and classes are unlocked at the start (No in-game currency unlock ♥♥♥♥♥♥♥t) -Classes seem balanced -Interesting classes (melee dinosaurs, dinosaurs with MG's) -Low price on sale (Only 99 cents and it goes on sale a lot) -Community is better compared to others -Doesn't take a lot to run the game -Entertaining -A couple of great jokes -Trading cards for those who want that stuff -T-Rex on some maps -You're able to change controls relatively easily  Cons: -Small playerbase (You'll usually see one or two servers active) -One or two maps where players are able to get to certain rooftops where they shouldn't be -There is one map where sometimes the capture won't work and it's just endless killing -Rare bug where you aren't able to switch weapons in the classes screen  Neutral: -First thing you want to do is turn off voice chat if you don't want a headache -It's an indie game -You'll see a couple of the same players around a lot -The Axis have more of a dinosaur selection while the Allies only have one -Yes, you can play as a human too  Do your friends a favor and get the 4-pack.",
            "review_score": "1"
        },
        {
            "review_text": "Hitler resurrects dinosaurs  Good theme, ok gameplay.  Get this if you want a game to play for short whiles at a time. Good to play with friends.",
            "review_score": "1"
        },
        {
            "review_text": "An underrated, hidden little gem that focuses its gameplay on skill, rather than many other pay-to-win PvP games. There may not be a large player base, but its regular players are loyal, and servers are always available.   10/10 Always a joy to play",
            "review_score": "1"
        },
        {
            "review_text": "Dinosaurs and nazis. What could go wrong?",
            "review_score": "1"
        },
        {
            "review_text": "This game is so unrealistic. Women were not enrolled in the military as combat personnel during WW2",
            "review_score": "1"
        },
        {
            "review_text": "The game is simple but fun and quite entertaining, dinos are really fun classes. The problem is that it's dead and it's been dead quite a long time, nearly a year ago I only could find 3 servers with less than 10 people in total. We're talking about a multiplayer only game so this is fatal.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is well worth your time, and if you buy it during a sale you'll be giddy with excitement for the amount of fun you can have for such a price. There's a group of people who meet frequently on Skype that I am a part of which wouldn't exist without this great game.  There aren't any things to unlock other than achievements, so a new player is on equal footing with veterans; only the skill that comes with experience separates them.  Seriously though, screw those jackrabbits.  Twelve microraptors out of five Mosin-Nagants.",
            "review_score": "1"
        },
        {
            "review_text": "  This game..............THIS GAME  PROS:  Dinosaurs Guns Nazis Snipers CSGO and TF2 Aspects Smoothness  Cons:  Tank needs nurf More Spray Flying is annoying   Review:  I enjoy playing this game with friends, I played for an hour straight before it lost the 'touch', i feel like the devs should add more aspects and touches to the game to make it better! This game is highly recommended to play with friends and use teamwork. Sniping is really balanced and fun and so are most classes. Graphics are really good and i can run 60 FPS with my decent setup. If you run 20-30 fps on CSGO youll for sure get 50 frames on this game!   Suggestions:  Skins More 'human' classes Custom classes More weapons  RATE - 7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Beat a goat down with my fists. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "The fact that you're probably reading this and trying to decide wether or not you want to buy a game with Nazi Dinosaurs made on the source engine says a lot about how much you're overthinking this purchase.  Like a wise man once said: 'You're still here? It's over, go home!' Of course he forgot: 'Go home and burn Nazi Dinosaurs!'",
            "review_score": "1"
        },
        {
            "review_text": "This game is so awesome !   Good points : - Dinosaurs !! - a lot of balanced classes - good maps - good musics - so many different gameplays - YOU CAN THROW GOATS ! - Originality : 100% - Perfect HitBox  Bad points : - T-rex has so tiny arms :c - Sometimes my windows cursor is visible on my screen  This game is only 10€, you must get it now ! Grade : 7,5/10",
            "review_score": "1"
        },
        {
            "review_text": "nazis, dinosaurs, and dinosaur nazis. not much you could ask for in a game. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "The people who play the Nazis (the ones with dinosaurs) and yet pick the human characters are the kind of people who would go to Jurrasic Park and look at the security guards.   You know it's true.",
            "review_score": "1"
        },
        {
            "review_text": "this game is so so so so fun plays a little bit like battlefield 1943 (xbox360/ps3) in that there are classes with set weapons and its ww2 but thats where the similarities end gameplay is fast and hectic, dinosaurs are great to play as andd against allies get one dino with a 30cal mg, and maybe 5/6 humans axis get about 6 dinos and 3 humans classes are well balanced, each fits a role, voiceover is funny and delightfully cheesy you can punch velociraptors in the face",
            "review_score": "1"
        },
        {
            "review_text": "So good i need to give it away",
            "review_score": "1"
        },
        {
            "review_text": "You like killing/being dinos? BUY IT NOW BEFORE THE SALE GOES OFF! (the only thing that is a bit off is the lag on the servers right now)",
            "review_score": "1"
        },
        {
            "review_text": "Very very fun and addicting. Some of the dinos are very useful against your enemies, and all of the different maps and game styles make it so you don't honestly get too bored.",
            "review_score": "1"
        },
        {
            "review_text": "All of this for £8? It's a steal! GET IT NOW!",
            "review_score": "1"
        },
        {
            "review_text": "Intense, action packed gameplay. Not for the light of heart.",
            "review_score": "1"
        },
        {
            "review_text": "Would you like to try crystal meth? Best to play with your friends. The game is HIGHLY enjoyable! Best to have a goof troupe that consists of tu amigos to fully maximize da fun. The game is cool, calm and collect. It goes on sale quite often and when it does you should pick it up.",
            "review_score": "1"
        },
        {
            "review_text": "Don't pay attention to the Metacritic score, pay attention to the Steam Community Reviews instead, every word those reviews say are true.",
            "review_score": "1"
        },
        {
            "review_text": "A game of truly rough n' tumble skirmishes set in the second world war. Nazis alone don't make for an edgy enough plot anymore, and zombies are a garish pink vibrating strap-on of an angle that's been utterly exhausted. Despite this, it still remains on the throne, an idea selling like hot cakes much like that decayed ol' king from warhammer 40K. So, What's next on the list? Dinosaurs? Sure, why not.   My first impressions are that the game plays rather nicely. Controlling dinosaurs and humans alike feels fairly fluid, though the 'runts' and humans are fixed in first person while the bigger dinosaurs take third. It would be nice to have the choice if there's variation to begin with. So You've got a mix of human and late cretatious characters to play as, and each team has a fairly unique roster to offer. Unfortunately, it's the Axis that are milking this historical re-jigging for it's worth, as they have around six or seven full dino variants to pick from. Allies only have the one, and the rest of your team is comprised of pink-♥♥♥♥♥ honkeys. This alone can sap the joy out of playing as an American, bar the fact the world hates you, but I wouldn't say it presents a significant disadvantage. I suppose there's just no satisfaction in beating on a dinosaur as a dinosaur, but rather playing Godzilla and crushing the fleeing people on a whim. This is presumably why teams are reversed each round.   My main gripe with this game as it stands are the maps. They seem lackluster in design and rather sparse. Vantage points are obvious and don't really appear to be very thought out, and you can't even sling a few shells through glass windows. Overall, the game seems a tad shallow and lacking potential for interesting, engaging tactics. It's a pretty standard formula (often likened to Team Fortress 2) with nothing terribly new to offer. Nevertheless, I can't say it isn't satisfying to flatten a few yanks using a goat flung from your gargantuan jaws, or with another yank that you'd previously managed to keel over. There's fun to be had in this game for sure, but it's a quick, silly fix of entertainment and not one of any real lasting value. Would I recommend the game? Sure, for a happy drunken hootenanny or something. It's worth a chuckle or two at the least.",
            "review_score": "1"
        },
        {
            "review_text": "the best dinosaurs game i ever played, this game is so much fun and posibbly worth to try it out i extremly suggested to u guys u wont be regret    10/10",
            "review_score": "1"
        },
        {
            "review_text": "I don't own this game. I do recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "This is the greatest game of all time. I can not tell you how much fun I had. I made a private game with me and 9 other bots. I turned out to be like 6 vs 4, and I was on the 6 team. I went with Nazi's, just because, and then picked sniper. As I sniped two people, I started to realize something.  I had noticed a ♥♥♥♥ing god damn dino with a heavy machine gun strapped to his back, mowing me and my teammates down.  I have never been so happy in my life.",
            "review_score": "1"
        },
        {
            "review_text": "There is something about this game that brings out the little 10 year old in me... yet, at the same time, that 10 year old self merges with my 20+ year old self. Dinos plus shooters...? Sign me up!  Very fun game that you'll play with your friends a lot. In regards to that, however, you are unable to create a server without port forwarding, etc. If only there was an option to create a server without all the hassle...",
            "review_score": "1"
        },
        {
            "review_text": "-capture both points -huge ♥♥♥ dino with gun comes -shakes ground when walks -cant find it -look every where -still no find -finaly find -kills me   10/10 would find it again",
            "review_score": "1"
        },
        {
            "review_text": "It's like chess",
            "review_score": "1"
        },
        {
            "review_text": "This game is good. It is a game different classes with semi open world. It is a game where Americans and Germans are fighting with dinosaurs against each other for this game. I like the choice of characters.But sometimes are FPS drop on this game. :D",
            "review_score": "1"
        },
        {
            "review_text": "This game is an absolute blast to play. Nothing is OP, totally reccomend it! :)",
            "review_score": "1"
        },
        {
            "review_text": "The game dino d day changed my life as a whole this might just be the greatest game ever made",
            "review_score": "1"
        },
        {
            "review_text": "Dino D-Day has three Ds in its title because it is a 3d game and all 3 of the Ds refer to common themes and motifs found in the game you will find dinosaurs and Ds and days I give it five out of five its a masterpiece I mean come on dinosaurs are great",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game, but obviously has some downsides which are just part of the game. It's hard to hit the tiny dinosaurs, but this is offset by the flamethrower. It is still possible to kill with the Garand or automatic weapons if you aim properly. Tiny dinos aren't that good anyway. I find it odd that there is no kick to guns if you aim down the sights, but this is offset by how much it obscures the screen.  Most other negative reviews for this game are just rabbling about the hitboxes and how the game works. Axis and allies aren't actually unbalanced, and teams are auto-balanced so there is an equal amount of players on each time. Usually, the game is unbalanced in that good players really stick out.  This game is more-or-less Day of Defeat Source but with Dinosaurs. Try the game, it's good. Definitely worth money.",
            "review_score": "1"
        },
        {
            "review_text": "One simple reason to get this game........   THERE ARE FREAKING NAZI DINOSAURS IN IT!!!  ",
            "review_score": "1"
        },
        {
            "review_text": "Hours of fun and utterly odd excitement with friends!",
            "review_score": "1"
        },
        {
            "review_text": "Extremely accurate depiction of World War II. I've never seen anything more historically correct than this very game. 10/10 would play again -IGN",
            "review_score": "1"
        },
        {
            "review_text": "I've spent 16 hours playing this, fisting dinosaurs.",
            "review_score": "1"
        },
        {
            "review_text": "Like tf2...but with dinosaurs!",
            "review_score": "1"
        },
        {
            "review_text": "I comepletly Flipping love this game reason !.great graphics 2 you can climb on walls 3 you can fly and tear other players heads off.anyone hoos listening to this review and doesnt have the game BUY IT AND ENJOY",
            "review_score": "1"
        },
        {
            "review_text": "Best game ever. I love this game and would recommend it to everyone 10+",
            "review_score": "1"
        },
        {
            "review_text": "It has nazi dinosaurs. Nazi dinosaurs with guns. Nazi dinosaurs with guns that can pee on enemy corpses. The ♥♥♥♥ more do you want.",
            "review_score": "1"
        },
        {
            "review_text": "What's better than nazi's and dinos? Nothing.  10/10 this is what was missing out of WWII",
            "review_score": "1"
        },
        {
            "review_text": "In certain maps you can be a Tyrannosaurus Rex with twin MG42s 'nuff said",
            "review_score": "1"
        },
        {
            "review_text": "It may be outdated. Sure. It may not look like a now-a-days-game. But you know what? It's still fun. That's all. Just fun. It can be highly addictive and is so weird and yet so enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "Dinosaurs and Nazis, is there a better game?",
            "review_score": "1"
        },
        {
            "review_text": "Dino D-Day is a multiplayer team-based first-person action video game developed by 800 North and Digital Ranch and published by Valve Corporation. It was released as a digital download, via Steam, on April 8th 2011. The game is developed as a total conversion modification on the Valve Corporation's Source engine.  The premise of the game is that during World War II, Adolf Hitler found a way to resurrect dinosaurs for use in the war effort. Players can battle online choosing to serve either the Allied nations or the Nazis.The game has been described as a new twist on 'the overdone World War II FPS ... that has become a running joke in the industry and gaming press'.   Upon the game's initial release, both the Allies and the Axis had six different classes of soldier. The Allied classes range from assault troops, medics and heavy support. However, the Axis have three human and three dinosaur classes. The human classes comprise assault troops, snipers and medics; while the dinosaurs comprise an attack Velociraptor, Dilophosaurus, and a Desmatosuchus with a cannon mounted on its back. Additional classes were added to both teams at later dates bringing the total to seven classes for the Allies and nine for the Axis. The Allies gained a dinosaur class of their own, a Protoceratops with a mounted machine gun. The Axis gained a Stygimoloch with a mounted gun, a Compsognathus that acts as a kamikaze bomber with a grenade and a flying Microraptor. In certain maps, an Axis player can also be chosen at random to play as a Tyrannosaurus with a jaw-mounted machine gun. While powerful, the class counts as three kills in a team death match.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic idea and ok execution!",
            "review_score": "1"
        },
        {
            "review_text": "This game is merely excellent. I would give this a 10/10!",
            "review_score": "1"
        },
        {
            "review_text": "yo, this game is baller as ♥♥♥♥ doe",
            "review_score": "1"
        },
        {
            "review_text": "KIlling nazi dinosaurs with fist - IGN       11/11",
            "review_score": "1"
        },
        {
            "review_text": "Honestly all I wanted was a game where I could play as Dinosaur and maul folks and this game is perfect.",
            "review_score": "1"
        },
        {
            "review_text": "this game feels like team fortress 2 and half life mixed, with a different charicters and smaller maps. you can play as human classes(heavy, support, medic, etc) or a dino which uses a heavy machine gun (primary) or a whack with your head(melee, secondary). over all i really enjoy this game.",
            "review_score": "1"
        },
        {
            "review_text": "World War 2 become more fantastic with Nazi's Dinosaur armies,but no more unique than Dilophosaurus with their word 'Sieg mit Ziegen!'.What you waiting for? Let's join on World War 2 and Sieg mit Ziegen!!!",
            "review_score": "1"
        },
        {
            "review_text": "It's like Skyrim with dinosaurs",
            "review_score": "1"
        },
        {
            "review_text": "This game absolutely exceeded my expectations. Everything is highly thought-out (right down to the class backstories and propaganda posters) and the classes are very balanced. If you like the Source engine, WWII shooters, and dinosaurs, you are kidding yourself if you do not get this game.",
            "review_score": "1"
        },
        {
            "review_text": "Very weird, but equally funny, a good time killer. The 360 Controller mapping could use some work, though. c:",
            "review_score": "1"
        },
        {
            "review_text": "You get to play as a mini Jihad Dinosaur. I give it 9/11 -Osama Bin Laden",
            "review_score": "1"
        },
        {
            "review_text": "plays like classic shooters such as day of defeat and counter strike but with dino's. a very fun game where i find what class's make up the teams change how the game is played.",
            "review_score": "1"
        },
        {
            "review_text": "Guns+Nazis+Dinos=Good times",
            "review_score": "1"
        },
        {
            "review_text": "a fun FPS sure it has some balanceing problems but its just fun to play i cant think of any games that have nazis and Dinos and the devs update this is from time to time some times they put in new maps or new modes or even new classes so i would recommend this if its on sale just in case you dont like it cause this game isnt for everyone and be carefull the community isnt very big for this game on average theres only like 2 severs up that have a good amount of people playing in it",
            "review_score": "1"
        },
        {
            "review_text": "Haha, reallly awesome game :) the bad thing is that, i don't have any friends playing it D: But u can please urself during the gameplay online in this game, really creative!",
            "review_score": "1"
        },
        {
            "review_text": "DInos with guns...Much fun!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Really good. I sold my evil daimyo and ultraviolet skin to buy it. It was on sale 90% off (0,99€). I reccomend it I wish more players play it",
            "review_score": "1"
        },
        {
            "review_text": "OK, this game is like Evolve with dinosaurs and Nazi's.  It's totally worth it. :P",
            "review_score": "1"
        },
        {
            "review_text": "Nazi and Dinosaurs. It's ok 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Nothing more glorious than being a suicidal raptor with a grenade taped to its back.   Allahu/Akbar",
            "review_score": "1"
        },
        {
            "review_text": "Nazis and Dinosaurs. Shut up and buy it.",
            "review_score": "1"
        },
        {
            "review_text": "Good game after all, wasn't too hyped about it but after i played it DINASOURS OMFG DINASOURS 10/10",
            "review_score": "1"
        },
        {
            "review_text": "So i got this game on sale, £0.34, now who would turn down an offer like that. The moment i loaded the game i wasn't really expecting much, oh how i was in for a treat. I got into a game and i chose a Compy as my first character. As soon as i spawned i screamed like a fangirl, it was amazing. I spent the first hour screaming over the characters you can spawn as and the abilities they have. It seems to be themed around WWI/WWII but with a twist of the opposing teams to have dinos as their allies.I totally recommend this game to everyone, you can even kill defensless goats and pretend your doing a satanic ritual, i mean you can throw them. Heh heh. PLUS, its only £0.34, What a bargin xD. £0.34, thats all im saying, £0.34.",
            "review_score": "1"
        },
        {
            "review_text": "Playing as an exploding kamikaze dinosaur has never been so fun.",
            "review_score": "1"
        },
        {
            "review_text": "Dinosaur Nazis? Doesn't get better then that.",
            "review_score": "1"
        },
        {
            "review_text": "Day 1  -Join a game -Get killed by a dino with a grenade on its back -Respawn -Get killed by a kamikaze dino -Respawn -A flying turkey spits in my face and then pisses on me -Repawn with a flamethrower -Torch everything that moves  13/10 torch flying turkeys everyday (for the right price)",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun but yet rediculous but i like playing as a dinosuar",
            "review_score": "1"
        },
        {
            "review_text": "  Seriously? Get this game! It's literally Nazi Dinosaurs in WWII!",
            "review_score": "1"
        },
        {
            "review_text": "It's nazi dinosaurs with guns against humans (and some dinosaurs) with guns, it's everything my day to day life is not.   If this game were a lasagne it would be the kind of lasagne that you wouldn't share with friends because ♥♥♥♥ them you're a nazi dinosaur!  10/10 lasagne pasta sheets",
            "review_score": "1"
        },
        {
            "review_text": "World War 2 But With Dinos",
            "review_score": "1"
        },
        {
            "review_text": "it was scary cuz dinosaurs at first but when you finnaly stop ♥♥♥♥♥♥♥♥ yourself its a great game",
            "review_score": "1"
        },
        {
            "review_text": "Not exactly a ground breaking game, but its still fun to play with friends in between long rounds of other games.",
            "review_score": "1"
        },
        {
            "review_text": "Its A fun game with many glitches, I still like it.",
            "review_score": "1"
        },
        {
            "review_text": "This is the best shooter game I've played, very fun. It got the Team Fortress 2 to it. And it got dinosaurs, what else do you want this game for. Buy it!",
            "review_score": "1"
        },
        {
            "review_text": "this is a pretty good game and i would rate it 3.5 out of 5",
            "review_score": "1"
        },
        {
            "review_text": "fun game to play wiht friends",
            "review_score": "1"
        },
        {
            "review_text": "Nazi Dinosaurs and exploding goats with your fists, the only reasons you need to buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "Dinosaurs and Nazis who would have thought it was such a potent combination!",
            "review_score": "1"
        },
        {
            "review_text": "Very fun to playing alone for practice &amp; with friend in weekend, aslo is free right now :D",
            "review_score": "1"
        },
        {
            "review_text": "Honestly? You're looking for a reason to buy this? You can ram the crud out of guys as a Stygimoloch! Guns? Really? I'M A T-REX WITH TWIN MOUNTED HEAVY MACHINE GUNS. Now I'm a fast Protoceratops, all up in Hitler's FACE. Now I'm a Raptor, moving faster than TF2's Scout. Oh, also, the acheevs are the best named ever. Seriously, you can pick up goats and throw them at dudes.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game !! wanna kill raptor with M1 grand ? only in Dino D-day (y)",
            "review_score": "1"
        },
        {
            "review_text": "Borin playing on servers. Fun to play with friends",
            "review_score": "1"
        },
        {
            "review_text": "simple cs 1.6 like game",
            "review_score": "1"
        },
        {
            "review_text": "I bought it on a sale and couldn't have spended my money better. This game is pure awesomeness.",
            "review_score": "1"
        },
        {
            "review_text": "I got destroyed by dinosaurs with guns. Also, I can kill goats.  10/10 would play again",
            "review_score": "1"
        },
        {
            "review_text": "Dino D Day ... is okay ... it's funnish but its not tremendous.  Pros - * Kind of fun. Definitely unusual. * They just gave away a million copies on PCGamer, so its no longer dead. * It's sense of humour is great.  Cons - * Parts of the interface look like they are ripped straight from TF2 * [Scratch that, found a setting in graphics. By default it has a 'film grain' setting turned on, it makes a mess of graphics and I recommend getting rid of it.] Graphics don't look anything as good as in the promo-pics on the steam page.  * T-Rex aren't actually truly playable. There is just a rare random chance on some servers (not sure which) that someone may be picked to be one. * Pricey for what it is.  Conclusion? Get it extremely cheap or don't bother.",
            "review_score": "1"
        },
        {
            "review_text": "'The only thing better than killin' a nazi, is killin' a nazi dinosaur.'",
            "review_score": "1"
        },
        {
            "review_text": "Awsome game. You could be a T rex and play as dinos.",
            "review_score": "1"
        },
        {
            "review_text": "WW2 + Dinosaurs = Dino D-Day  Fun to play if you're into this kind of stuff. Not bad, you can play it without getting too bored and it's pretty entertaining.",
            "review_score": "1"
        },
        {
            "review_text": "Great mod",
            "review_score": "1"
        },
        {
            "review_text": "The game is completly silly and the controls could be better, but if you're looking for a fun game with senseless killing and if you like dinosaurs then Dino D-day is for you. It wont be winning any prizes any time soon but if you are looking for a fun break from Tf2 or CS:GO Then give this game a chance.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, but I wished more people played it.",
            "review_score": "1"
        },
        {
            "review_text": "Ark: Survival evolved and Day of Defeat source had a baby. Weird premise, but gameplay is phenomenal.",
            "review_score": "1"
        },
        {
            "review_text": "hands down, one of the best dinosaur games I ever played.",
            "review_score": "1"
        },
        {
            "review_text": "I think this game needs to step it up to the next level and be remade as a newer and better version. Similar to Killing Floor 2 and Payday 2 but not as bad as Payday 2 has.",
            "review_score": "1"
        },
        {
            "review_text": "If u like ww2,if you love looking for fun,just buy it.",
            "review_score": "1"
        },
        {
            "review_text": "0.7 hrs FTW Well...if you have ever wondered how the best and most WTF game looks like....I herby present you one of the most absurd FPS shooter on the steam market.  + 5 meters tall t-rex with miniguns; + variety of soldiers/dinos to play; + addictive (unless you turn it off); + how even I have it in my steam library.....; + skillful I guess; + rather easy to begin playing ( casual-not at all-shooter); + II World War or sth. like that;  - awful graphics (I know it was released some time ago but it hurts- but do not worry, I was more absorbed shooting down t-rex than counting visable pixels so it's just fine); - balanced as League of Legends.... (no one is laughing? damn....); - it's way too easy to snowball as dino;  All in all, this is a great game- 7/10 if you get it for free or with some bundle. Imagine what Nazi could had done with armed dinos....maybe nowadays we would be living under Germans supermacy KAPPA  . ... ... ... ... ... ... ... ... ,,-~~”'¯¯¯¯¯¯”'~~-,,  ... ... ... ... ... ...,,-~”¯::::::::::::::::::::::::::::::::::¯”'~,,  ... ... ... ... ..,,”::::::::::::::::::::::::::::::::::::::::::::::::::::”,,  ... ... ... ..,,-“:::::::::::::::/::::::/::::::::::::::::\\::::::::::::\\:::::::::\\  ... ... ...,“:::::,“:::/:::::/::::::/:|::::::::::::::::\\::::::::::::\\:::::::::\\  ... ... .,-“:::::::/:::::|:::::|:::::::|:|:::::::|:::::::\\\\:::::::::::|:|:::::\\::\\  ... ... /::::::/:::|::::::|:::::|::|::::\\:\\:::::/\\::::/:::||:::::::::|:/::::::|:::|  ... .../::::::|:::::\\::::::\\::::\\::\\::::/\\:\\,::/::\\::/::::|:|:::::::/\\/::::::/::::|  ... ../::::::/::::::'\\::::::\\,:::\\/\\::/: :\\,”/ : :\\/:\\:::/: |:::::/::/::::::|::::/  ... ./::::::|:::::::::\\::::::\\|::/: \\/: : : \\/: : : : : \\,/: \\/::_/\\//:\\:::::/:::/  ... /::::::/::/:::::::|::/,__/:/: :__/ . .: : : : : : :\\__. \\/: \\:::::/::/:::/  ... |:::|::::::::::::/::/::::/;/ ;/ ,. .,\\: : : : : : : / ,._., \\ /::::::|::/:|  ...|:::/:::/::;;;::::::/::/|:::|.\\: |.|||; : : : : : : : :|.|.||;|::|:::\\/:/:|:/  ...|::|:::|::::::::/:::\\|:::'\\,|: \\.''' /: : : : : : : :'\\.' ''/ : \\: |:::|::\\  ...|::|:::|:::::::/:::::|::::|/: : “¯': : : : : : : : : :'¯'' : : : :/::::'\\  ...|::|:::|::::::/:::::/:::::'\\: : : : : : : : : : : : : : :': : : : :| :/::::::|  ... \\:|:::|:::::|::::::|::::::|,: : : : : : :~,___,~: : : : : :,-“:::::::|::|  ... .'\\|::|:::::|::::::||::::::\\'~,: : : : : : '~--~': : : : ,,~”\\:::::::::|:/  ... ...'\\:|:::::|::::::/.|::::::|: : “~,: : : : : : : : ,,-~,”::::::'\\::::::::/  ... ... .\\\\:::::|”~,/,|:::::::|: : : : ¯”~,,,,~”:::,,'\\::::::::\\-,,_::|/  ... ... ..',\\,::|~--'-~\\:::::::|: : : : : : |::|,,-~”¯..__\\::::::::\\... .'|  ... ..,~”': : \\|: : : : : \\::::::|: : : : : : |¯”'~~”~,”,: : \\:::::::|.. /  ..,“: : : : : :|: : : : : :\\::::::|: : : : : : \\: : : : : : “~',:\\::::::|\\,  ..|: : : : : : : |: : : : : : |::::|,\\,: : : : : : : : : : : : : :”,\\::::|: \\  ..| : : : : : : : : : : : : : |::::|:'-,\\: : : : : : : : : : : : : : :”-'\\,|: :|  ...\\ : : : : : : : : : :'\\: : :\\:::|: : '\\'\\: : : : :~,,: : : : : : : : : “~-',_  ... \\: : : : : : : : : : :\\: /:|:/: : : :',',_,: : : “,: : : : : : : : :,/”',  ... .\\: : : : : : : : : : :\\|: |/: : : ,“....”,:\\: : : : '\\: : : : : : :,/.......”-,  ... ...\\: : : : : : : : : : \\: |: : ...........\\*/ : : : :|: : : : : :,-“..............'|  ... ... .\\ : : : : : : : : : '\\': : /..............\\/ : : : : /: : : : : :,-“............./  ... ... ...\\ : : : : : : : : : '\\:/.................\\: : :,/: : : : : /................./  ... ... .....\\ : : : : : : : : : \\........................\\:,-“: : : : :,/............/  ... ... ... ...\\ : : : : : : : : : \\,..............,”======',_..........,-“\\  ... ... ... ... \\,: : : : : : : : : \\: ¯”'~---~”¯: : : : : : : : : :¯”~~,': |: \\  ... ... ... ... ..'\\,: : : : : : : : : \\: : : : : : : : : : : : : : : : : : : '|: : : : |  ... ... ... ... ... .\\, : : : : : : : : '\\: : : : : : : : : : : : : : : : : : :|: : '/: |  ... ... ... ... ... ...\\,: : : : : : : : : : : : : : : : : : : : : : : : : |: : : : : :|  ... ... ... ... ... ... ..\\ : : : : : : : : \\: : : : : : : : : : : : : : : : :|: : : :\\|  ... ... ... ... ... ... ...\\\\,: : : : : : : , : : : : : : : : : : : : : : :/: : : : :\\: |  ... ... ... ... ... ... ... .\\\\ : : : : : : : :'\\ : : : : : : : : : : : : : :|: : : : : |  ... ... ... ... ... ... ... ./:\\: : : : : : : : :'\\, : :;: : : : : :;: : : :|: : : : : :|  ... ... ... ... ... ... ... /: : \\: : : : : : : : : '\\,:;: : : : : :;: : : :|: : : : : :|  ... ... ... ... ... ... .../: : : '\\: : : : : : : : : :'\\,: : : : : :; : : : :|: : : : : |  ... ... ... ... ... ... ../: : : : :\\: : : : : : : : : : , : : : ;: : : : : : | : : : : /:\\  ... ... ... ... ... ... ,/: : : : : : :\\: : : : : : : : : : '\\,:.. :: : : : : : |: : : :;::|  ... ... ... ... ... ..,“: : : : : : : :“,: : : : : : : : : : \\*, : : : : : :| : : : :\\:|  ... ... ... ... ... ,/ : : : : : : : : : :”-, : : : : : : : : : :\\: : : : : /: : : : : : /  ... ... ... ... ..,/ : : : : : : : : : : : : :”-, : : : : : : : : :'\\: : : :| : : : : : ,/  ... ... ... ... ,/ : : : : : : : : : : : : : : : ;-,: : : : : : : : :'\\: : |: : : : : : /  ... ... ... .../: : : : : : : : : : : : : : : : :;: “-,: : : : : : : : '\\: |: : : : : /  ... ... ... ../: : : : : : : : : : : : : : : : : : : : :“-,: : : : : : : \\,|: : : : /  ... ... ... ,/: : : : : : : : : : : : : : : : : : : : : : :“-,: : : : : : :\\: : : : /  ... ... .../,,”,,,~,,_: : : : : : : : : : : : : : : : : “-,: : : : : :'\\: : :'|  ... ... ...|',/,/:||:\\,\\: : : “'~,,~~---,,,_: : : : : : : : '\\: : : : : ,: :|  ... ... ..|: :”: ||: :”: : : : : : :”-,........ ¯¯”''~~~-~.|\\: : : : : : \\:|  ... ... ..|: : : ||: : : : : : : : : : :”-,.......................|: : : : : : : \\|  ... ... ..| : : : : : : : : : : : : : : : :”-,.....................\\: : : : : : : ,\\  ... ... ..| : : : : : : : : : : : : : : : :”-,\\....................“\\: : : : : : : : '\\  ... ... ..| : : : : : : : : : : : : : : : : : :”-\\...............,/: : :\\: : : : : : : |  ... ... ..| : : : : : : : : : : : : : : : : : : : \\,...........,/: : : : '\\: : : : : : ||  ... ... ..| : : : : : : : : : : : : : : : : : : : : \\.......,/: : : : ,-~/: : ,: |: /:|  ... ... ..'|: : : : : : : : : : : : : : : : : : : : : \\~”¯: : : : : :|: ::|: :/::/:,/  ... ... ...|: : : : : : : : : : : : : : : : : : : : : |: : : : : : : :”-,,/,/-~”:|  ... ... ...|: : : : : : : : : : : : : : : : : : : : : |: : : : : : : : : : : : : : : :|  ... ... ... |: : : : : : : : : : : : : : : : : : : : : |: : : : : : : : : : : : : : : |  ... ... ... | : : : : : : : : : : : : : : : : : : : : :|: : : : : : : : : : : : : : : |  HAVE A GOOD DAY",
            "review_score": "1"
        },
        {
            "review_text": "very good game :) just click ADD TO CART and feel the dino",
            "review_score": "1"
        },
        {
            "review_text": "T-REX with machine guns and bombs, suicide bomber dinosaurs...enough said...",
            "review_score": "1"
        },
        {
            "review_text": "Best game of all time. This game combines the two best things in the world, gritty WWII first person shooters, and dinosaurs.",
            "review_score": "1"
        },
        {
            "review_text": "Rip peoples neck apart. Downside Servers and Pyros bro",
            "review_score": "1"
        },
        {
            "review_text": "I have not had this much fun in a VERY long time. It's not imbalanced as some of the reviews say, more experienced people simply want to play as Axis dinosaurs rather than Allies It runs smoothly, the bots are intelligent and (usually) behave as a person would. I would gladly pay a higher fee for this game than I did. Graphics-7 Sound-6 Multiplayer-7 Controls-5 Balancing-8  Overall, ~7/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is stupid and weird at the same time.",
            "review_score": "1"
        },
        {
            "review_text": "The game.. about war world II",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, really small community, and this is 2015, alt+tabbing freezes the game? Geez.",
            "review_score": "1"
        },
        {
            "review_text": "It's like WWII with dinosaurs and your sworn duty as an American soldier is to protect the innocent goats from the Nazi dino menace.",
            "review_score": "1"
        },
        {
            "review_text": "Cheap and really fun! The tank dinosaur is a beast",
            "review_score": "1"
        },
        {
            "review_text": "WW2, Dinosaurs, Source 2 engine. While at a glance the game may seem like something lame, it's crazy fun.",
            "review_score": "1"
        },
        {
            "review_text": "I played this game for one hundred minutes and I still am confused about what happened. I didn't even know which side I was on but that didn't matter, when the calls of the creatures of years passed rolled over hills I started firing and prayed for deliverance. This game truly captures the desperation and horror of war in a stark and terrifying way. I found myself weeping after nearly every battle. I can no longer play this triumph of art because it gave me Post Tramatic Stress Disorder and left me in a catatonic state for three weeks. If you have the money and the heart, purchase.",
            "review_score": "1"
        },
        {
            "review_text": "Addictive. It was hard to pull myself away. Humans are well balanced and each dinosaur has its own style of play. Flying around as a little guy spitting acid, or stomping as a heavy with a big gun on his back. Its all good fun",
            "review_score": "1"
        },
        {
            "review_text": "Dinosaurs with guns? How is this not fun?",
            "review_score": "1"
        },
        {
            "review_text": "It's hitler raising dinosaurs to fight in an FPS. Do you need more information? Buy this.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a game where you can fight as a human against dinosaurs or with dinosaurs. It's really great. However it has some bugs. One of these bugs (atleast it happens to me). The round crashes at the end of an offline game.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best fps's I've ever played. I mean whats better than ruling the world with a dinosaur army?",
            "review_score": "1"
        },
        {
            "review_text": "its a game 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I like this dis game ",
            "review_score": "1"
        },
        {
            "review_text": "It has Nazi dinosaurs! Take that overused nazi zombies! Buy it!",
            "review_score": "1"
        },
        {
            "review_text": "I came for the Dinosaurs. I stayed for the newspaper clippings and flyers between matches.",
            "review_score": "1"
        },
        {
            "review_text": "this game is awesome, its a game that is different to all the other FPS games out there",
            "review_score": "1"
        },
        {
            "review_text": "WWII with dinosaurs? Yes please.",
            "review_score": "1"
        },
        {
            "review_text": "What are the two awesome things in the history? World War 2 and dinosaurus.Then but that ♥♥♥♥ together and you have this.",
            "review_score": "1"
        },
        {
            "review_text": "I have over 600 games in my Steam account, and the vast majority of them are still unplayed. So now I'm dedicating an hour to each of these games and writing a series of One Hour Reviews. An hour isn't very long to judge a game on, so think of this as more of a first impression, and take this review in the spirit in which it's given. Be sure to read other reviews from players who have spent more time in the game.   One Hour Reviews #47 - Dino D-Day  This is such a strange concept. I can't even imagine where the developers came up with this idea of mixing Axis vs. Allies with dinosaurs. What's even more strange is that this fusion somehow works.  Playing the humans is much like you'd expect from a class based shooter, which choices like playing a medic, a sniper, or an assault type class. The dinosaurs change things up by replacing weapons (for the most part, a few dinos still have mounted guns) with abilities like melee attacks or spitting poison.  One thing I noticed though the distribution isn't exactly even. The story (such as it is) has the Axis team responsible for bringing back the dinosaurs, so that side has virtually all of the dinos to choose from, while the Allies have only one dino (liberated from the other side).  The game offers a variety of game types, which I noticed would change based on the map I selected. The game comes with a decent number of maps to start with, and I also saw an option for loading custom maps. Every map seemed to have the option for deathmatch, and capture the flag was another common option. Deathmatch plays just like I expect it would. Capture the flag looked pretty simplistic, there were only 3 flags to capture on the level I played. I saw where a few maps had an objective based game type, but I didn't have time to check this out in my first hour of play. Same goes for a deathmatch variant with T-Rexes.  This is definitely one of those games that is really hard to evaluate on just an hour of play, but I had a lot of fun trying out everything.  It is possible to play singleplayer with bots if thats your thing. The bots have a difficulty level that you can select. But obviously the real intent of this game is to play multiplayer. There isn't any real matchmaking going on here, you just have a basic server select, and from there you can pick a side. There didn't seem to be a huge number of people playing, but I also had no trouble finding an active server to hop into.  Presentation wise the graphics are fine, but you aren't going to be blown away by anything. It does have the typical options you'd expect like changing resolution, playing in a window (bordered or borderless) or fullscreen, and various other options as well.  I can't give this game anywhere near a complete review with only an hour in, but I had a lot of fun in my first hour. And for only $9.99, it looks like a good value for the variety of maps and game types you get. I don't know that this would be a game to keep my attention for a long time, but it definitely makes for a nice alternative to the AAA shooters that are out there.",
            "review_score": "1"
        },
        {
            "review_text": "  The only flaw is the lack of players (always a couple servers full though).  BUY it, PLAY it!  Good Goyim",
            "review_score": "1"
        },
        {
            "review_text": "Quite an underated game. I think most first person shooter fans would love the variety of play styles and roles. I've had a lot of fun with it, and obviously the developers are still actively updating their product, also a big plus with me.",
            "review_score": "1"
        },
        {
            "review_text": "Dino D-Day is a Fun FPS Game thats only $10.00! Dino D-Day has a Absurd Premise that makes it Great to Play! With Cool Characters, Weapons, DINOSAURS, and More!  Best Features: Dinosaurs Good Mechanics Fun Gamemodes Cool Characters Great Graphics Servers/Multiplayer  Bad Features: Unbalanced Sides Mostly Dinosaurs on the Axis Side Loading Time (Good or Bad)  Overall Thinking: 8/10 B+",
            "review_score": "1"
        },
        {
            "review_text": "Killed a dev in my first multiplayer match. Didn't realize it till a day later. 10/10 not a bad game.",
            "review_score": "1"
        },
        {
            "review_text": "While quite a lot of fun indeed, Dino D-Day suffers from quite a few flaws, in my opinion.   While the class based system is quite fun to use, a lot of the characters are just... too hyperspecialised. The medic can barely defend herself, the rocket user needs to be bang on target otherwise he's dead, and the dinosaurs feel hard to use under lag.   The multiplayer scene is quite dead as well. I only found a few servers online, and even then, they were all North American servers, so I was unable to play without severe lag, which impacted upon my fun.",
            "review_score": "-1"
        },
        {
            "review_text": "I Hit A Goat and Got Blown Up By A Nazi Dinosaur 10/10 I Would hit that goat again P.S i think ISIS Hates This Game",
            "review_score": "1"
        },
        {
            "review_text": "Dino D Day is a fantastic and honestly underrated game. The game started out as a Source mod that eventually got to star in its own show! The game is in an alternate universe where the Third Reich somehow brought back dinosaurs through science! The game pits German soldiers and dinosaurs vs allied soldiers and a single dinosaur.   The gameplay is smooth, which is from what you would expect from a source engine game. It's easy to learn, somewhat easy to master, and an absolute blast to play.   The game has a few hundred people playing it, so finding a populated server isn't difficult to find. It's only a pity that more people don't play it. When it goes on sale, do you and your friends a favor and buy like 10 copies at 99 cents a piece. The game is silly, fun and the playerbase is friendly!",
            "review_score": "1"
        },
        {
            "review_text": "This game is so good i want to play Dino D Day all the time but i just can't wait for the BIG UPDATE WITH ALOT OF NEW DINOSAURS!",
            "review_score": "1"
        },
        {
            "review_text": "for a free game,this is cool..!",
            "review_score": "1"
        },
        {
            "review_text": "CooL",
            "review_score": "1"
        },
        {
            "review_text": "I only bought this game so I could go on a goat killing spree. Totally worth it. Go and buy it right now.",
            "review_score": "1"
        },
        {
            "review_text": "S H I T",
            "review_score": "1"
        },
        {
            "review_text": "Very fun WWll shooter. There aren't many good WWll games out there anymore. But if you count this as a WWll game, I would say this is great. Hands down, one of my favourites. GET IT",
            "review_score": "1"
        },
        {
            "review_text": "Dinosaurs with guns. 10/10.... just kidding. apart from its humorous core idea the game is a total failure..... but still: Dinsaurs.... with ♥♥♥♥ing guns.",
            "review_score": "1"
        },
        {
            "review_text": "This game may sound campy, weird or just plain odd but in all honesty it is a ton of fun. It is fairly well balanced and who does not want to play as dinosaurs in a team deathmatch game? If you get a chance to play this do so.",
            "review_score": "1"
        },
        {
            "review_text": "I can run with a dino weights tons and no one hears me - for the danger, i have a gun on my back 9/10 :D!",
            "review_score": "1"
        },
        {
            "review_text": "The Best Dinosaur Game I've Played Until Today",
            "review_score": "1"
        },
        {
            "review_text": "At that time is to buy +1, after all, in other places gave the. Play some games, really fun, very happy FPS, in addition to other pictures are great. Union soldiers, the German staff are very powerful, (yes, I use the soldiers used to allied = =) Fewer people online, but bot is also very interesting, although the BOT God go sniper gun have to spit... The overall feel is really offbeat FPS very good, not only is the +1 game so simple But as the game player in Chinese, really very tired to play under high latency...   So",
            "review_score": "1"
        },
        {
            "review_text": "Honestly, for 99 cents I can't complain. If you want to get this, get it on sale. It's rather a tool to vent all my pent up rage from playing CSGO or something else, but I had some good laughs- and hope to have more. The Sharknado of Video games. The Nazis have dinosaurs, but the allies can still win. Why? Because America, hell yeah! From this game came one of my favorite gaming moments- punching a T-Rex to death.  All in all enjoyable for 99 cents.",
            "review_score": "1"
        },
        {
            "review_text": "  best pvp game in the world",
            "review_score": "1"
        },
        {
            "review_text": "GREAT GAME!!!!!! 9.8/10",
            "review_score": "1"
        },
        {
            "review_text": "This game has improved a LOT. When I first played it was filled with hackers, unbalanced, just absolutely horrible and not fun, I couldn't play it for more than 10min. Now i've decided to buy it and I've played for HOURS. And every minute of it has been a blast. Humans and dinosaurs are equally as fun to play if you're thinking it's gonna be boring if you don't play a dino. This game has come a long way. It's definitely got some great devs. Oh and btw, the devs themselves even play every now and then! 9/10 well worth it EPSECIALLY if it's on sale. If it's on sale don't hesitate to buy this game and try it out!",
            "review_score": "1"
        },
        {
            "review_text": "Pretty funny and good game. Damn those Nazi Dinosaurs with Miniguns on their back. I R8 8/8, Cause its gr8, m8 :hardgrave:",
            "review_score": "1"
        },
        {
            "review_text": "its a fery funn game not to much to talk about :P",
            "review_score": "1"
        },
        {
            "review_text": "really good game   who knew that war and dinos would go great together war+dinos=fun and it is only 1 dollar if on sale",
            "review_score": "1"
        },
        {
            "review_text": "Fun PVP Action",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "+rep joke -&gt; An old man walks into a bar and orders a beer. The bartender notices the guy's head is the size of a cue ball.  'I got to ask, sir,' says the bartender. 'What happened?'  The old guy sighs and tells him, 'My ship was torpedoed by the Germans in WWII. A mermaid rescued me and promised to grant me three wishes. For my first wish, I asked to return to the States. My second wish was to have all the money I would ever need. Finally, my third wish was to have sex with the mermaid.'  'That doesn't sound too bad,' says the bartender. 'Then what happened?'  'Well,' sighs the man, 'mermaids can't have sex, so I asked her if I could just have a little head... .'",
            "review_score": "1"
        },
        {
            "review_text": "is a ww2 game with dinosaurs 10/10",
            "review_score": "1"
        },
        {
            "review_text": "the greatest dinosaur simulator on the market",
            "review_score": "1"
        },
        {
            "review_text": "Me: FPS games are boring *finds Dino D-Day* Me: WW2. Nazi. Dinosaurs. All right.",
            "review_score": "1"
        },
        {
            "review_text": "mhm. nice variety of different classes, and dinosaurs",
            "review_score": "1"
        },
        {
            "review_text": "Probably the stupidest game ever but damn if it isn't fun",
            "review_score": "1"
        },
        {
            "review_text": "how nazi simulator 2016 :D (this is an accriate ww2 game dont question it.)",
            "review_score": "1"
        },
        {
            "review_text": "It's pretty much like fistful of frags with classes and dinos",
            "review_score": "1"
        },
        {
            "review_text": "Maybe one of the better FPS I've played in a while and wow. I've played enough of them",
            "review_score": "1"
        },
        {
            "review_text": "I think it should of added some more dinosaours on allies but all in all game out that way the trex is great i have not been styraco but the gun and its body gets stuck in some places but most of all you need lots of exprinece but the raptor is the best for me because it pounces and one thing is    PLAY AND DONT PLAY IT BOTH WAYS WIN!!!!!!!!!!!!!!!!!!!!!!!!!who wants a muffin while we wait :D",
            "review_score": "1"
        },
        {
            "review_text": "This one time, I was washing my clothes at a dry cleaner's, and when i opend the washing machine, and some of my clothes were gone, and i accused the lady next to me, and she was hispanic, and i think i'm racist.   Oh and this games pretty cool. Its not a shining image of perfection, but its entertaining. Oh, and also it's like a pay to play TF2. Like the 'old days'.",
            "review_score": "1"
        },
        {
            "review_text": "Yes, extremely historically accurate",
            "review_score": "1"
        },
        {
            "review_text": "Threw a goat through 2 people! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "It's.......,  Why WTF.",
            "review_score": "1"
        },
        {
            "review_text": "this game is a epic dino shooter games if you like dino this is for you",
            "review_score": "1"
        },
        {
            "review_text": "A great mixture of nazis and dinosaurs. This action packed shooter is great fun although lacking in numbers of players. Worth buying if on sale.  ",
            "review_score": "1"
        },
        {
            "review_text": "Unfortunately there is not many people playing this title and here's a possible reason why. I bought this some time ago but hadn't tried it so I attempted to give it a try a few days ago and on spawning in the only server map with more than a couple of players on each side I found myself floating in mid air unable to do anything other than spin around, I restarted the game several times trying to get to play but each time I ended up in the same predicament. Unsure what to do I asked the other players what to do via the ingame text system and the only responses I got varied from f-ing noob to names Steam will simply blank out if written. Personally I don't care one iota if someone wants to cuss me in the heat of battle but when a new player is greeted by this are you surprised the game ends up with only a server or two being used properly.   06/06/2015 My advice is do not waste your money on a title that's going nowhere.  The vast majority of servers are empty and that's no surprise.",
            "review_score": "-1"
        },
        {
            "review_text": "Day of the Defeat with DINOSAURS!!! OH MY GOD IT'S A MATCH MADE IN HEAVEN!",
            "review_score": "1"
        },
        {
            "review_text": "trex kicks ♥♥♥ and is OP",
            "review_score": "1"
        },
        {
            "review_text": "Fun, strange concept, but fun. When the game is free everything is good.",
            "review_score": "1"
        },
        {
            "review_text": "I wanted to be a dinosaur. I wanted to shoot dinosaurs. This game offers both of those things.",
            "review_score": "1"
        },
        {
            "review_text": "Its ok I guess",
            "review_score": "1"
        },
        {
            "review_text": "This game is great. Like TF2 but with Dinosaurs! This is an awesome game and I didn't run into any cheaters.",
            "review_score": "1"
        },
        {
            "review_text": "My new favorite game",
            "review_score": "1"
        },
        {
            "review_text": "My new favorite game",
            "review_score": "1"
        },
        {
            "review_text": "It's veeery chaotic but OK",
            "review_score": "1"
        },
        {
            "review_text": "Who da ♥♥♥♥ thought of this ♥♥♥♥ and said 'lets make this a game' AND MENT IT!",
            "review_score": "-1"
        },
        {
            "review_text": "Its Nazis and dinosaurs. Who doesn't like both of those things. Putting them together in one game, brilliant idea. Classes are well balanced and gameplay is smooth. 10/10 would get eaten by Nazi Raptor again",
            "review_score": "1"
        },
        {
            "review_text": "Deatschland is way better then the allies in real life and in this game :D  DEATSCHLAND!!!!",
            "review_score": "1"
        },
        {
            "review_text": "The only thing better than killing a nazi, is killing a nazi dinosaur.",
            "review_score": "1"
        },
        {
            "review_text": "Play in the WW2:Awesome  Play with Dinosaurs:Incredible  Combine Dinosaurs with the WW2:A great game  I reccomend it",
            "review_score": "1"
        },
        {
            "review_text": "it's like skyrim with guns... with dinosaurs.",
            "review_score": "1"
        },
        {
            "review_text": "This game! This ♥♥♥♥ing game I bought for 0.99€ is the best piece of ♥♥♥♥ I've ever ♥♥♥♥ing played! Sadly there are like 30 players playing but it's ♥♥♥♥ing perfect. I think I owe the developers the remaining 9€ so I bought few copies for my friends ( from the same sale though) and now, after finally playing it, wrote this review. Absolutely beautiful!",
            "review_score": "1"
        },
        {
            "review_text": "Boring af after about 3 hours. Kind of lame, and nothing more than a gimmick really. This is rather disappointing, because the game looks fun, but I think there's some sort of explanation for it, and it really comes down to this game just being boring after the gimmick and having no real purpose for playing. While CS:GO has competitive gameplay and getting better, and TF2 has trading and getting wealthy, this game just has nothing to make up for the average gameplay, and has nothing memorable about the experience. It's hard to play all at once, and it being a decently made source game it feels to clunky to be liked for its gamplat.  Don't get this game, it has nothing interesting beyond a couple hours of gameplay and very quickly becomes a chore to play.",
            "review_score": "-1"
        },
        {
            "review_text": "The shooting feels janky as hell. As one friend put it, it feels like playing Goldeneye N64 versus Oddjob. Only with dinosaurs, which I guess saves it from being a total loss.  The objective based modes are uninspired at best, and baffling at worst.  If this were a free mod like back in the old days, I'd heartily recommend it. As it stands, it is just kind of poop. Humerous poop. Like the stuff you get at Spencer's gifts, only slightly more expensive.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game",
            "review_score": "1"
        },
        {
            "review_text": "I could say without a doubt, that even though this game has not really been a favourite among gamers (considering the many negative reviews I've read on it), I found it to be rather fun.... For a short while. Dead servers, not much replayability, and clunky controls (Only with the dinosaurs, in my case). Out of the few many created with the Source engine, this could probably be the worst. And yet, I will say this. It's fun, and worth coming back to. Let's hope they give us another one!",
            "review_score": "1"
        },
        {
            "review_text": "This game.... It's just a TF2 clone with different maps and characters but I'll give it a novelty recomendation",
            "review_score": "1"
        },
        {
            "review_text": "the way WW2 should have been..... good for a chuckle and a pretty decent shooter as well",
            "review_score": "1"
        },
        {
            "review_text": "this game is great !! ",
            "review_score": "1"
        },
        {
            "review_text": "I love World War II, im a real histroy buff and when i found this game i couldint stop playing it.It does not also follow amazing historical charaters from French Resistance fighters to American gunners! But there is even more brought in this game when Nazi Germany has a new super weapon..Dinosaurs! This game is action packed and you will love it from the start, learn each class and fight to victory! This is not just another game where people join a map and fight with guns,in Dino D-Day you can be the dinosaurs! I know amazing! Each Dinosaur has its own special ability that you will fall in love with, for instant the Raptor or T-Rex! I must say i love the guns in this game almost as much as i love the beasts, there is unique WW2 guns that have there own strengh/weekness. The only thing that the game is lacking is that some of ther Dinosaurs are abit to OP (good for German Team) not for the American team tho,over all this is still a amazing action shooter game! 9/10",
            "review_score": "1"
        },
        {
            "review_text": "pretty sick",
            "review_score": "1"
        },
        {
            "review_text": "This game sucks",
            "review_score": "-1"
        },
        {
            "review_text": "Classes seem unbalanced,not many were playing when I ran game. maybe I will try later and adjust my review accordingly.",
            "review_score": "-1"
        },
        {
            "review_text": "best game in the galxy",
            "review_score": "1"
        },
        {
            "review_text": "It's is a very good game because Dinosaurs, Guns, Explosions. nuff said  10/10 No German Goat Milk ;-;  (btw you should buy it)  ",
            "review_score": "1"
        },
        {
            "review_text": "NOT RECOMMEND CAUSE OF TOMANY KIDS SCREAMING but the rest YES RECOMMENDED",
            "review_score": "1"
        },
        {
            "review_text": "The most realistic shooter you will ever play, it taught me the horrors of WWII.",
            "review_score": "1"
        },
        {
            "review_text": "had a lot of fun playing this game didn't take it as a serious fps game but man is it fun",
            "review_score": "1"
        },
        {
            "review_text": "FANTASTIC game. SO much fun. Much more than games like day of defeat. Interesting gameplay, a large variety of attacks, and if you are lucky, you get to be a giant t-rex and slaughter everyone in your path. As for playing as the humans, they have decent guns, and aren't overwhelmed by the dinosaurs. Great game to get, at a good price.",
            "review_score": "1"
        },
        {
            "review_text": "Im pretty sure ill give this a 9/10 well im new to the game so i think it will be a 10/10 when i stop playing it Really fun game Addicting to",
            "review_score": "1"
        },
        {
            "review_text": "Im not joking, I'd rather play Day of Defeat which is also ♥♥♥♥ing terrible.",
            "review_score": "1"
        },
        {
            "review_text": "Play as Nazi-Raptors 10/10 would heil",
            "review_score": "1"
        },
        {
            "review_text": "Do you like logic? None in this game Do you like Dinosaurs? Not when there's a T-Rex with Machine guns on it's mouth running after you. Do you like not knowing what you're doing or how to do it? Perfect game for you.  I love this game, I just wish it had a 'These Controls Do This For This Character' button thing.  10/10 IGN (I Guess Network)",
            "review_score": "1"
        },
        {
            "review_text": "11/10 got to be a stegosaurus with two brownings on!",
            "review_score": "1"
        },
        {
            "review_text": "Goat killing, dino ♥♥♥♥♥♥♥, british voice acting fun.",
            "review_score": "1"
        },
        {
            "review_text": "There Truely Is no Words To Express This Game, This Game is what Would happen if TF2 had a Dinosaur update. It's Balanced, Fun, and it never truely Gets Old.",
            "review_score": "1"
        },
        {
            "review_text": "  it fun thanks muffin",
            "review_score": "1"
        },
        {
            "review_text": "Gun handling is rubbish, most of the time the bullets don't go where you aim. You just spray and hope that the other guy is lagging.",
            "review_score": "-1"
        },
        {
            "review_text": "i still cant write this cuz i dont have 10 hours",
            "review_score": "1"
        },
        {
            "review_text": "This game is really fun, and sadly, it\\'s cool games like these that don\\'t get enough popularity, if you\\'re reading this review, WHEN THE GAME GOES ON SALE, BUY IT. IT IS SO MUCH FUN, GET YOUR FRIENDS, MAKE THEM BUY IT.  DO IT.  BUY THE GAME.  YOU MUST.  But seriously, this game should be super popular, and it isn\\'t. SPREAD THE WORD OF DINO D-DAY!",
            "review_score": "1"
        },
        {
            "review_text": "This game completes my life :D",
            "review_score": "1"
        },
        {
            "review_text": "best game 2013 cannt stp plai  dino d day cnt evn bst grphyks wow dino out of 10 ",
            "review_score": "1"
        },
        {
            "review_text": "It's awesome, nuff said!",
            "review_score": "1"
        },
        {
            "review_text": "I LOVE THIS GAME",
            "review_score": "1"
        },
        {
            "review_text": "Shoot her aight",
            "review_score": "1"
        },
        {
            "review_text": "I can't stop laughing playing this",
            "review_score": "1"
        },
        {
            "review_text": "should be free then would get lots of rep  ",
            "review_score": "1"
        },
        {
            "review_text": "This game although somewhat humours is a terrible multiplayer only shooter, it's like CS but with the terrorists and dinosaurs. That's all there really is to say, it's nothing special ignoring the 'dinos', but when you include the 'dinos' it adds humour and but makes it a bad game.  5/15 - 'CS with dinos' ",
            "review_score": "-1"
        },
        {
            "review_text": "Sometimes I wake up in the middle of the night and go 'Man, how awesome would it be to play as a dinosaur in an awfully designed game in which I fight against the military?'. Don't you? If you have previously had this realisation you should definitely pick this game up because it's just SO good. I assure you it's worth the buy of a very very very very very very very very (totally not overpriced) £7. If you're feeling steep you can just buy it when it's on sale which is pretty much 100% of the time for uhh.. what are they reducing it by now? 99%? Ok so you can buy it for about 1 penny. I would definitely decide to pick this up as it is a must buy and your entire family can enjoy it. Now I no longer have these dreams and I'm the living the life. The dinosaur life. The D-Day life. My life. As a dinosaur. Getthisgame. srsly.",
            "review_score": "1"
        },
        {
            "review_text": "WW2 with dinosaurs, self explanatory 8/10",
            "review_score": "1"
        },
        {
            "review_text": "BUG WHER EI CANT CHAGNE MY CONTROLS PLZ FIX OTHERTHAJTHAT GOOD GAME ",
            "review_score": "1"
        },
        {
            "review_text": "......................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................============================================================= 1+10 !!!!!!!!!!!!!!!!!!!!!!!!!!! ,/.,,.,/,/,dkddddd Dino D-Day 1+1 1111111111111111111111111111111111111111111111111111111 X 11111112313123233333333333333333 ?",
            "review_score": "1"
        },
        {
            "review_text": "Like TF2 but with Dinosaurs and Hitler. 10/10 would holocaust again",
            "review_score": "1"
        },
        {
            "review_text": "Its basicaly Day of defeat: source but with Nazi dinosaurs. Why wouldnt you want to buy this?!",
            "review_score": "1"
        },
        {
            "review_text": "It's an amazing game, fun to play.                       But sometimes                         you rage                   and break                   everything",
            "review_score": "1"
        },
        {
            "review_text": "awesome game one i dont like is....   WHERE IS THE T REX IT SAYS ON UPDATE THERES T REX BUT WHEN I GO PLAY IT ITS NOT THERE WTF   ",
            "review_score": "1"
        },
        {
            "review_text": "Beaver the Isle has add Spinosaurus and it had he Jurassic Park /// Slin﻿",
            "review_score": "-1"
        },
        {
            "review_text": "Awesome, but but i would wait for a sale, unless you have money to burn",
            "review_score": "1"
        },
        {
            "review_text": "Played tennis using goats. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "ITS AWESOME its confuseing at first but awesome ",
            "review_score": "1"
        },
        {
            "review_text": "Snipin's a good job, mate. (Domination sounds in the backround)  Jokes aside, this is a very great game. Can run at medium-high settings with almost no lag at all for me, and that's saying alot because my computer is a toaster.",
            "review_score": "1"
        },
        {
            "review_text": "hit a sheep with a dinosaur    10/10 would buy dinosaur simulator again",
            "review_score": "1"
        },
        {
            "review_text": "You can eat goats and pee.    What else do you want you prick?  ",
            "review_score": "1"
        },
        {
            "review_text": "*dinosaurs *peeing all over your enemies *killing the crap out of goats *a giant t-rex  WHAT THE HELL ARE YOU WAITING FOR?!",
            "review_score": "1"
        },
        {
            "review_text": "Yes, in every way possible. Id fight a nazi dino any day of the week.   10/10",
            "review_score": "1"
        },
        {
            "review_text": "DO YOU LIKE TO REK ♥♥♥♥? WELL GUESS WHAT YOU CAN IN THIS GAME! YOU CAN HAVE THE STRENGTH OF SHREK OR THE SPEED OF SANic OR USE WEAPONS THAT DO THE THINGS I I PREVIOUSLY DID NOT DESCRIBE  420/2spooky4me",
            "review_score": "1"
        },
        {
            "review_text": "This game is good :)",
            "review_score": "1"
        },
        {
            "review_text": "need more update.",
            "review_score": "-1"
        },
        {
            "review_text": "Dinosaurs, guns.. Yeah. Cool stuff.",
            "review_score": "1"
        },
        {
            "review_text": "I bought the DLC but I still cant choose the T-Rex! Please help I want to be a T-Rex!!!",
            "review_score": "-1"
        },
        {
            "review_text": "One of the worst shooters I've ever played. The player is given very little feedback when he gets shot at or when he hits other players. When he dies he gets no replay to help him figure out how he was killed to be able to improve his play. Players die exceedingly fast from every weapon. On top of this there is a special weapon that I cant even figure out how to fire even after reading the control key settings page and there appears to be no tutorial to teach you how to operate it or teach you how to play the game. The enemies are too small compared to conventional shooters so this makes it even more of a pain to shoot them and the lighting makes it difficult to even spot enemies. I got it for free so I guess I can't complain too much, but I'd never pay for this.",
            "review_score": "-1"
        },
        {
            "review_text": "It's terrible.",
            "review_score": "-1"
        },
        {
            "review_text": "Virus Scanner quarantined the exe file as a Trojan.   Recovered it anyway.   10/10 would allow to infect my computer again",
            "review_score": "1"
        },
        {
            "review_text": "It's good for about 4ish hours of play, but then it gets kinda old. Although if you're usually into FPS multiplayer-only modes, it's an amusingly unique take. Otherwise, can't really recommend it.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is horrible. It has a terrible lag. It is unbalenced. Lasty, the fact that they tried to have dinosaurs and humans on the same teams can be confusing and mess up players.",
            "review_score": "-1"
        },
        {
            "review_text": "Absolute rip-off. Got bored instantly. Totally unrealisic with the physics, for example : it takes like 999999999 shots to just injure a dinasour in this game. No point in getting this. If you want to play a game with guns and dinosaurs then go check out Jurassic park : the game.",
            "review_score": "-1"
        },
        {
            "review_text": "On a scale of 1 to even, I literally can't.",
            "review_score": "-1"
        },
        {
            "review_text": "how do you make a game about dinosaurs not fun",
            "review_score": "-1"
        },
        {
            "review_text": "I LOVE the concept; when I heard of it before release I was hyped! This sounds hilarious and amazing!  However, after launch pretty much NOBODY is ever on the servers. I've never had to chance to actually play a match since it's online-only. It's such a shame...",
            "review_score": "-1"
        },
        {
            "review_text": "This is a decent shooter game with dino classes in it.  But there is nobody to play against in the multiplayer mode,... So you can only play versus bots &gt;_&lt;.",
            "review_score": "-1"
        },
        {
            "review_text": "Save your money for something better than this boring game. Check Team Fortress 2 for example. It's also free and funnier.",
            "review_score": "-1"
        },
        {
            "review_text": "Kinda lame. Not nearly as fun as it should be. You have fun for a couple hours, but then the novelty of killing Nazi dinosaurs wears off and you realize this is a damn ♥♥♥♥♥♥ game. Definitely not worth $10, but maybe worth it if you get it on sale. Like 90% off.",
            "review_score": "-1"
        },
        {
            "review_text": "Buggy as hell. Devs won´t help. Could not even launch the game.",
            "review_score": "-1"
        },
        {
            "review_text": "An entertaining classic! Must buy!",
            "review_score": "1"
        },
        {
            "review_text": "I will not eat. I will not sleep. I will not uninstall this game till i get my ♥♥♥♥♥♥♥ card drops.",
            "review_score": "1"
        },
        {
            "review_text": "why the **** is the sound so loud.... u shoot and if you got a heatset u will die a horrible death! ^^ anyway the game is good",
            "review_score": "1"
        },
        {
            "review_text": "looks bad. plays bad. im not even trying to be mean.just dont exspect a hidden gem here. 5/5 stars for an awesomely funny concept.and greatful for the free weekend the game offered, just not interested.",
            "review_score": "-1"
        },
        {
            "review_text": "It has Dinosaurs in it",
            "review_score": "1"
        },
        {
            "review_text": "It's good...yeah sure, only for the trading cards! :D",
            "review_score": "-1"
        },
        {
            "review_text": "Focking Tosh -__- Only janky Multiplayer game that looks like quake 2 took a ♥♥♥♥ on it.",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "i really do not like this game there is so much unbalanced things players will be raptors and (how i like to call them) chickens that are hard to hit and in one TDM game they kept respawning a T-rex out of nowhere i had more fun in the computer even tho it has bad A.I. sometimes and there are a ton of 1 hit kill things in this game that a starter like me will hate and will delete this game after 5 matches i really hate this game i gave it a try but i really hate it",
            "review_score": "-1"
        },
        {
            "review_text": "You won't get many hours out of it just look at other reviews. More of a joke than anything, though better than cod.  Still good enough if you can pick it up for a dollar to play with some friends for a couple hours.",
            "review_score": "-1"
        },
        {
            "review_text": "I was able to get the game for free and I still feel ripped off.  I knew the game had a brutal Metacritic score but I thought, you know, Nazi dinosaurs -- how can the game be that awful? I started it up and saw it was multiplayer only and I realized I was in for a bad time. I tried to start a game, but the menus are only partially navigable with a controller, which sucks in Big Picture mode. I joined a game and chose a Nazi velociraptor. The game started and, to balance the teams, it made me some Allied woman with a clunky sniper rifle. I wasn't pleased, but I moved around the dimly lit Italian piazza level with the sniper, unable to shoot most anything but acquainting myself with the controls all the same. I accomplished nothing by the time my team lost, but I was ready for my first full game.  The next game booted up in the same poorly lit level, and I saw my velociraptor's claws before me. Three seconds later, the game informed me I had been sent to the Allies to play as the sniper again. Comfortable with the controls, I mostly impotently shot into the inky blackness. I got at least one kill but I don't know when that happened. All I really remember was getting obliterated by the gun-equipped T-Rex and getting killed every time I stepped out of the Allies' hole. I manned the turret, but either there was no action in front of me, or I was instantly picked off by a sniper. The Allies lost again.  The third game started and this time, by some miracle, I was allowed to be the velociraptor. A newly assigned teammate announced to the world how excited he was to play as the T-Rex. I prowled around the same pitch-black level, killing goats and searching aimlessly for battle. The velociraptor moved quickly and the melee attack felt fun to use. This brief stretch was by far the most fun I had with Dino D-Day. When I finally found the Allies' area, I was shot at from afar or occasionally an enemy would be shooting off a flamethrower while spinning in a circle. Twice I was able to engage such a player in close contact. One time I swear I slashed at him three times. THREE TIMES. His health was nearly gone, but his flamethrower did me in. That was the closest I came to actual, palpable combat. Most of the time I simply saw no one, and would run in a pack with other Axis dinosaurs or soldiers, or occasionally run around with the T-Rex -- not so much for protection, but simply to try to be in the right place at the right time to engage the enemy. I found the Allied base and saw all entry points with a big red-circle-with-a-slash sign in front of the doorway. I was unable to enter. The Allies could spend all day in there firing at the dinosaurs, and that's what they did.  My team lost for the third time. I turned the game off and uninstalled it. Do not buy this game. Do not play this game. War truly is hell, even with dinosaurs.",
            "review_score": "-1"
        },
        {
            "review_text": "Really good.",
            "review_score": "1"
        },
        {
            "review_text": "Bought this as a goof. It is beyond bad but in a sort of funny way.",
            "review_score": "-1"
        },
        {
            "review_text": "I had played the game for four days. AND IT WAS AWSOME. Reasones: throwing goats at people, going APE S*** ON PEOPLE (that is a featur in the game), blowing the enemies face off with a shotgun, burning them, and throughing up on people. :3 best game ever. 10/10 poasted in 2015",
            "review_score": "1"
        },
        {
            "review_text": "Atrocious.  I liked the idea of nazi dinosaurs, but this is seriously ♥♥♥♥.  If you like quick deaths, long respawns, poor graphics and uninspired maps, well then, this is the game for you.  Got it in Steam sale, and was still robbed.  Delete!!",
            "review_score": "-1"
        },
        {
            "review_text": "This game is awesome. It is like TF2, but with dinosaurs. It's a good time waster!",
            "review_score": "1"
        },
        {
            "review_text": "tryhard neckbeards in game cosplaying as captains and minions while pretending that the game actually means something  would buy again 10/10",
            "review_score": "-1"
        },
        {
            "review_text": "This game makes me tickle myself, then DJ tunnle snake forces me to put on my ( ͡° ͜ʖ ͡°) on for to long. Then I listen to carrie underwoods song 'bad gurl' and makes me tell my self, is she a bad gurl?",
            "review_score": "1"
        },
        {
            "review_text": "what is this game even trying to do",
            "review_score": "-1"
        },
        {
            "review_text": "Why did I buy this..?",
            "review_score": "-1"
        },
        {
            "review_text": "Overall, this game is a messy execution of a cool concept. Fighting in a alternate version of WWII with dinosaurs was really fun, especially with the gigantic t-rex the nazis have, for about 10 minutes. After that, you start to see the major flaws of the game. The classes are very unbalanced, lack of modes, the maps are okay at best, lack of polish, and the controls are bad. If you want to buy it for its premise and style alone you can, but if your trying to find a good shooter, you won't find it here.",
            "review_score": "-1"
        },
        {
            "review_text": "They should made Hitlasaurs, if they do so, ill give 7/10 to this game .",
            "review_score": "1"
        },
        {
            "review_text": "like cod with dinosaurs",
            "review_score": "1"
        },
        {
            "review_text": "sucks crap and is stupid",
            "review_score": "-1"
        },
        {
            "review_text": "its cool but eh dinoes are overpowered most the t-rex ",
            "review_score": "1"
        },
        {
            "review_text": "Shoot dinos Shoot goats Shoot nazis / allies  Pros: Fun Steam cards Cheap (Under $1 on sale on in bundle) Multiplayer OK controls  Cons: 7 people in the world left playing this game Game actually sucks - I mean REALLY SUCKS.  Overview: It's under $1 with steam cards. Yes it sucks, but you should be able to get at least $1 worth of fun out of it. ",
            "review_score": "1"
        },
        {
            "review_text": "TL;DR  If I had payed more than $5, this review would be negative.  Get it when it's on sale for less than $5.   Same-old, same-old repetitive FPS + dinosaurs.      What can I say, lol.  Such a fresh take on FPS I simply had to try it.   I would have never payed the full asking price ($10), that is simply rediculous for a game like this. I got it on-sale for the price of a crappy phone app ($1) and I was well pleased with my investment. I'd reccomend you wait for it to go on sale, or you will be harshly dissapointed. It has no campaign, no unique game modes, and it has basic graphics and effects.     That being said, online connectivity is better and faster than AAA titles like CoD and BF. I've yet to experience ANY connection related LAG. The classes are well balanced*, and each class actually heavily affects playstyle required to succeed. I also have not encountered any hackers yet, so I'm guessing i'm either just lucky or the anti-cheat actually works. The rag-doll physics have been exagerated, it's a nice touch for the theme and creates some funny moments.  I don't think my $1 could have provided me with any better, aside from helping a starving child in Africa or something.   (*= execpt for the hardgrave class. Hardgrave is the only class with a 'kill streak ability'. After you get 3 consecutive kills as hardgrave, you can press E to active glowing fists that can one hit almost all enemies. Either the hardgrave ability needs to be removed, or kill streak abilities need to be added to all classes.)",
            "review_score": "1"
        },
        {
            "review_text": "Somewhat outdated. Very useful for GMod and other SDK Sources.   Also Dinosaurs that ♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "Bad game it's one of the worst games I've played    1/10",
            "review_score": "-1"
        },
        {
            "review_text": "Worst game I have ever played. And I played '♥♥♥♥ Stimulator Simulator'. Which spells out '♥♥♥'.",
            "review_score": "-1"
        },
        {
            "review_text": "Worst game I have ever played. And I played '♥♥♥♥ Stimulator Simulator'. Which spells out '♥♥♥'.",
            "review_score": "-1"
        },
        {
            "review_text": "Steam reviews are not to be trusted. (except mine of course)  I got this game on the sale for $0.50 after looking at the 'Very positive' reviews it got....  What a boring and generic fps. No story mode, no tutorial (not that you would really need one), 3 game modes, and a handful of maps. The gunplay feels like Medal of Honor Allied Assault from 2002, with about the same graphics. While I loved MoH back then and played the hell out of it, I never thought of playing the same thing except slightly less polished with less maps and game modes, and add dinos.  Im not loosing any sleep over the 50 cents I paid for the game but I would have liked dino combat to be more fun ya know?",
            "review_score": "-1"
        },
        {
            "review_text": "What a disgusting game, the controls are horrible and everything feels incredibly stiff and unpolished. The game has some depth to it in terms of classes, but other than that the game gives you no instructions and you're left to try and figure everything out yourself, don't be surprise if you just instantly die for no reason. Only play this if you're curious to find out how bad it is for yourself. Though, I like the idea, the execution should have been way, way better.",
            "review_score": "-1"
        },
        {
            "review_text": "sorry but i can't write a serious review about this game. this has to be the most hilarious game i've played in a while. if you like TF2 it's for you. if not... well it's just TF2",
            "review_score": "-1"
        },
        {
            "review_text": "Would be a good game if the guns actually worked and if it was balanced a bit. 3/10 Fun for about an hour",
            "review_score": "-1"
        },
        {
            "review_text": "THIS GAME BLOWS... YOU GET TO WATCH OTHER PEOPLE PLAY BUT YOU CANT.",
            "review_score": "-1"
        },
        {
            "review_text": "Gave it a try during a free weekend, I feel like I missed the point, everything was pretty common and I logged out pretty fast.",
            "review_score": "-1"
        },
        {
            "review_text": "If hitler had dinosaurs this is what would happen bad graphics basically tf2 fun for pretty much everything ",
            "review_score": "-1"
        },
        {
            "review_text": "I dont reccomend this too me it has no potential what so ever and every 2 seconds I get shot in the head also the t-rex oooh the t-rex he spaws in on the nazi team every round it makes me sick how I spent 10 dollars on this game and the game itself is very laggy too me no optimization updates either",
            "review_score": "-1"
        },
        {
            "review_text": "I paid a dollar. Great concept. Needs a single player mode.  I honestly don't under stand how people can enjoy online games. Its just an incomprehensible cluster of nothing.  Yes, i will admit that I am terrible at online games (I'd use a stronger word, but i don't think I'm allowed to), but the longest i stayed alive was 1min 27 sec. On I've averge each life would last me 46 seconds. Then death. Then reloading. Then another 46 seconds. Then death. ON and on. I killed one person. IN total.  I would consider playing it further to get better, but honestly, I don't want to in it preasent state. The controls just feel off. The map feel to cluttered and claustophobic, maybe the other maps are different, I wouldn't know. The combat just didn't gell.   I might give it another go in the future, when they had time to upgrade it further, but apparently as it is is pretty upgraded, so I'm not holding my breath...",
            "review_score": "-1"
        },
        {
            "review_text": "Hilariously bad. Maybe try it so you have something to chuckle about later.",
            "review_score": "-1"
        },
        {
            "review_text": "Umm what were you really expecting from something called Dino D-Day?     TF2 is free and much better",
            "review_score": "-1"
        },
        {
            "review_text": "No one to play with. Joined a random server and ran around looking for dinosaurs. Finally found one after 10 minutes that was stuck behind a gate and I couldn't kill it so I took my frustration out on an innocent goat then rage quit. Good thing I got this free, now I can just Afk for cards and profit.",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ this game",
            "review_score": "-1"
        },
        {
            "review_text": "Sorry, I can`t play this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Multiplayer only game and there is no players only max 9 people you find if you get lucky and only 6 maps and dm as only game mode!  save your money for something else..  ps. the game is pretty good but what do you wanna do alone on a dm map ???",
            "review_score": "-1"
        },
        {
            "review_text": "basically TF2 but with dinosaurs. not worth $10",
            "review_score": "-1"
        },
        {
            "review_text": "I dont even own this game but yet steam let me review it? Here goes.   14/88 ur mother o btw this game sucks balls. Day of Defeat rip off. 100% same but this time you have gay dinosaurs having anal sex with you.    once again white bread forever!",
            "review_score": "-1"
        },
        {
            "review_text": "this game is unrealistic. dinosaurs have been extinct for a very long time now.",
            "review_score": "-1"
        },
        {
            "review_text": "Can't see why this game is getting so much hate. It's balanced, it's fun, it reminds me just a bit of Battlefront, and most importantly: you get to shoot fascist dinosaurs.  What's not to love here? It's not at a huge pricetag or anything, go for it! The horde mode DLC's fun, too.",
            "review_score": "1"
        },
        {
            "review_text": "this game gave me cancer",
            "review_score": "-1"
        },
        {
            "review_text": "shithouse",
            "review_score": "-1"
        },
        {
            "review_text": "Texas Winning digits but never chambers the soul of creativity or passionate shooters! Hottest things of health basis!Innfared Saunas that never matches!  A muscular cardiovascular effort but never works out real well! The benefit are lagging,and the online play is hard-milling sensational hot pods of plenishing support!  the excercise juices of worthlessness! The fuel of naked lame styled game that couldve done better in gluteus maximus love the burrito master  NOT RECOMMENDED",
            "review_score": "-1"
        },
        {
            "review_text": "Boring",
            "review_score": "-1"
        },
        {
            "review_text": "Seems like not many people play this. Logged in right now and there was only one full server.",
            "review_score": "-1"
        },
        {
            "review_text": "Promised a Dino ♥♥♥♥ Day but there was no ♥♥♥♥♥. 0/10",
            "review_score": "-1"
        },
        {
            "review_text": "This Game Sucks",
            "review_score": "-1"
        },
        {
            "review_text": "Unacceptable. Right click - Spam all the way, killing is easy, humans always wins, is unbalanced, is ugly, and is a bad copy of Day of Defeat, with ♥♥♥♥♥♥ addons. Not recommended at all. Even if it's free. Now my library has one more ♥♥♥♥♥♥ game.",
            "review_score": "-1"
        },
        {
            "review_text": "Dino D-Day is a game that I recommend because: - have an acceptable price - is a method to banish boredom - is a multiplayer game - have trading cards  Enjoy!",
            "review_score": "1"
        },
        {
            "review_text": "but ♥♥♥♥, it was 99 cents",
            "review_score": "-1"
        },
        {
            "review_text": "dude wtf i bought this game a few weeks ago i bought the 4 pack and now it sais i dont have it!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "Piece of ♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "Nazi's, dinosaurs... what do you want more. This is simpely the best game know to mankind! When you play this game it is like if you were accually in there. The graphics are the best, the gameplay is great, the concept is hilarious. I would say...  1/10 would not play.",
            "review_score": "-1"
        },
        {
            "review_text": "This game has not a single redeeming feature. It takes up a whole 2.5GB, ♥♥♥♥ knows where that goes to, because the textures, sound files and overall video quality is blindingly ♥♥♥♥♥. It's like the disabled love-child of Day of Defeat and team fortress 2. Even despite paying only £2 to get 4 copies of this for me and my friends, I feel robbed. My friends would no doubt rather receive a pile of ♥♥♥♥♥ via digital download than this utter disgrace of a game. TWO WHOLE POUNDS, the developers do not deserve a penny of this. That should all go to a fund for victims who have had to play this 'game'. I cannot warn you enough about not playing this game. It is not worth playing even for comedy value, the gameplay is banal and shoddily put together. This is worse than 'Litil Divil' and 'Muffin Knight' put together. Do not buy it, do not even illegaly download it.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is friggin awesome",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. Thou need more fans.",
            "review_score": "1"
        },
        {
            "review_text": "this game is awsome i cant stop playing this game thats how fun it is you better get this game now because in the pass you will be like now its so much money get it now its only 9.99 buy it or you will die xD",
            "review_score": "1"
        },
        {
            "review_text": "This is the first dota-like mmo",
            "review_score": "1"
        },
        {
            "review_text": "I spent an entire game punching sheep to death  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Got it for free. Has cards. Has dinosaurs. Has goats. 12/9",
            "review_score": "1"
        },
        {
            "review_text": "well iiboought men of war assault squad 2 before on sale then saw this because i had $1.04 left and this was $0.99 %90 off so i bought it and its amazing for the price i got it for go get it quick",
            "review_score": "1"
        },
        {
            "review_text": "this game is so much fun and a great history lesson!",
            "review_score": "1"
        },
        {
            "review_text": "What the fuack is this shhit?",
            "review_score": "-1"
        },
        {
            "review_text": "I really enjoy this game- which supprised me. It is fast paced multiplayer action with so many different variables that I have not got bored in the slightest. The dinosaurs are acutally fun to play- not as cheasy as you might expet. I would write a better review but I am going to go play so give it a shot! Its a blast!",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would dino again",
            "review_score": "1"
        },
        {
            "review_text": "go french lady drop medkit press e punch dinosaurs forever",
            "review_score": "1"
        },
        {
            "review_text": "Nazi Dinosaurs with guns strapped onto them... Why   wouldn't   you buy this game?",
            "review_score": "1"
        },
        {
            "review_text": "I LOVE THE POOP OUT OF THIS GAME!",
            "review_score": "1"
        },
        {
            "review_text": "This game is purely amazing. Complete your life and buy it now 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "If you Like Killing / Play as a Nazi and the Dinosaurs ... BUY IT!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "You can be a cute, tiny dinosaur that blows people up..  GAME OF THE CENTURY! ",
            "review_score": "1"
        },
        {
            "review_text": "Best WW2 FPS Shooter out ther! 101/100 VEry original.  In all seriousness though. This game looks stupid, yes, but it. is. awesome.  Buy it. Buy it now",
            "review_score": "1"
        },
        {
            "review_text": "Well, it's a source game so we all know it's good.  Pros:  Fun gameplay  Team based which is always fun  DINOSAURS!  Cons: Red team has most of the Dinosaurs.  Blue team has one Dinosaur and a bunch of humans.  Just a Dinosaur version of TF2.   Do I recommend this game? Yes. If you like Source FPS games you will like this game. A rather hidden gem that you should give a try.",
            "review_score": "1"
        },
        {
            "review_text": "Dino D-Day is amazing! I love throwwing goats :)",
            "review_score": "1"
        },
        {
            "review_text": "Its alot of fun, with or without friends. Its a great game, if your looking for something play when your board. It's really just a game to play for ♥♥♥♥♥ and giggles. I recomend to give it a try if you have time on your hands.  My favorite thing to do is to throw goats at other players. XD",
            "review_score": "1"
        },
        {
            "review_text": "This game is one that really went out and tried somthing new! it accually worked very well! this game is for you if you love shoting nazi dinos in the face!!",
            "review_score": "1"
        },
        {
            "review_text": "It does not matter if the gameplay is unblananced.   The voice acting is superb. The world is wonderful and humurous.   I am very happy with my purchase of this game. I would urge you to try this game out if you:  Like Team Fortress 2, asymetrical multiplayer, leaping onto people as a small dinosaur and killing them, shooting rockets at tiny dinosaurs, suicide bombing as a tiny dinosaur, lighting dinosaurs on fire, playing as a T-Rex for a minute, punching a T-rex to death in the most american display of pugilism you'll ever see.  This game is one of a kind.  -8/10",
            "review_score": "1"
        },
        {
            "review_text": "A fun game,but the gameplay gets old after time.Needs more content, guns,characters,dinosaurs, etc.",
            "review_score": "1"
        },
        {
            "review_text": "how to bite an enemies with the small and fast dinosaur? ",
            "review_score": "1"
        },
        {
            "review_text": "you want this game then you go get it 5CEHM-0GK9H-JBFX8",
            "review_score": "1"
        },
        {
            "review_text": "Pretty dang fun, I had a chance to punch a T-Rex to death. It's a lot better than I expected, and is a pretty solid fuel-creation simulator. There's quite a few dinos on each side, and You can kill other players with a goat as one of them.   All in all, it seems like they've fixed the bugs people mentioned, the shooting feels standard, though punding around as some thing I have a hard time pronouncing with a turret on Your back is definitely satisfying. There's some bird thing I haven't tried...there's a raptor that's a bit hard to aim, but certainly do-able, the levels are pretty good, though one of them with the T-rex felt bizarre in it's blocked-off passageways, both teams just camped each other out for the most part. Still, though, punched a T-Rex, I cannot stress that enough.  9/10, good stuff.",
            "review_score": "1"
        },
        {
            "review_text": "You can ♥♥♥♥ on a guy after you kill him with your dino claws 10/10...... best game ever.",
            "review_score": "1"
        },
        {
            "review_text": "You don't know what the heck you do when you start the game and its hard to learn how to play.When your get the hang of it, you are killing 5 people in 1 life. ps. GOAAAAAAAAAATTTTTTTTTTTSSSSSSSSSSSSSSS!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Its like TF2 but WW2 and you can kill dinosaurs.",
            "review_score": "1"
        },
        {
            "review_text": "It's a good game but everytime i try to log on to it every a small server like 1 or 2 people i get a black screen and the boom boom boom boom sound repeating.i can play the Verdun Game just fine and it has beter graphics.. if anyone cna help me message me.",
            "review_score": "1"
        },
        {
            "review_text": "So many hilarious ways to go about objectives as both humans and dinosaurs...",
            "review_score": "1"
        },
        {
            "review_text": "a really awesome, underrated game with nazi dinosaurs. still a work in progress but definitely worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "GET IT!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "kill the american good guys as a flying archeopterx ... so conterversial , so much fun This is what happens when u let Hitler watch jurrasic park and let him design a game the next day!",
            "review_score": "1"
        },
        {
            "review_text": "most accurate representation of WW2 i've ever seen",
            "review_score": "1"
        },
        {
            "review_text": "I got this game for free on the PCGamer-BundleStars givaway a while back, and ultimately, the game ended up sitting in my library without much use so far. The elevator pitch for Dino D-Day would go somewhere along the lines of 'It's a third person shooter set in world war II, but with a twist: You can play as a T-Rex with a machine gun'.  The idea sounds fun, original and interesting, but the gameplay is flat and generic, without any noticeable difference between the classes, and the visual style grey and unappealing, which manages to lay waste to an ultimately interesting arena-style level design.  When I got the main idea of the game, I wanted to like it, I really did. But the game is ultimately unappealing both visually and gameplay-wise, and I cannot recommend anyone spending their money on it.",
            "review_score": "-1"
        },
        {
            "review_text": "One thing that is better than killing a nazi is killing a nazi dinosaur. Well said.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game people judge the game like its sooo bad....but most havent even played it soo i say play the game judge it later jackasses.",
            "review_score": "1"
        },
        {
            "review_text": "IT IS ABSOLUTLY AWESOME TOTALLY GET IT",
            "review_score": "1"
        },
        {
            "review_text": "Like Team Fortress 2 with Nazis and Dinosaurs 11/10",
            "review_score": "1"
        },
        {
            "review_text": "Best game ever. This game really catches my attention, which even AAA titles like COD or Borderlands 2 cannot do. Best fun in a while. Don't trust the mediocre metacritic reviews. They are false. Most fun I've ever had in a while. Buy it! I recommend!",
            "review_score": "1"
        },
        {
            "review_text": "OMG ! Real Dinosaurs lel xD ! Great Game.Great Mechanics and Graphics.Great Achievements.AND CARD DROPS.I do recommend this game :D  69/420 ~ Like Skyrim with Guns and Dinosaurs",
            "review_score": "1"
        },
        {
            "review_text": "its not woth anything over a coupple cents",
            "review_score": "1"
        },
        {
            "review_text": "So its three am right, and im just browsing around steam, this game appear, holy balls nazi dinosaurs, this is the Lord's work, i had to get it, rekt a lot of scrubs as that anklylasaurus looking mofo, favorite movies are inglorious basterds and jurassic park, this game is a haphazard mixture of the two, almost came playing this game, i will lose this damm virginity playing this game, hopefully, love this game moar than my momma, three thumbs up, one thumb being my male anatomy, if i had to choose between the best cocaine and this game, definitely the game, then id kill the guy and take his damm cocaine, this is beside the point, play the game, spend all your parents money, all the thumbs up as high as me right noaw, peace",
            "review_score": "1"
        },
        {
            "review_text": "Just can't find out how to play it well TT",
            "review_score": "-1"
        },
        {
            "review_text": "Maybe I just don't get how this game has such great reviews. The game seems to play poorly to me, and is filled with obnoxious players. Maybe I just hit the motherload on annoying people, but it seemed like a bunch of 12 year olds trying to compete in Master Annoyance awards.  Still, it has good graphics and Nazis and Dinosaurs! If it wasn't for the kids, I might actually enjoy it.",
            "review_score": "-1"
        },
        {
            "review_text": "Played for 10 minutes, got stuck in a wall then mauled to death by a little raptor baby  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Its alot of fun to play like team fortress 2. Its easy to get kills and the dinosaurs give a fresh game chemistry. Being a T-Rex is prett f*n awesome.",
            "review_score": "1"
        },
        {
            "review_text": "  Video review can be found here:     Dino D-Day - Q-Review    ~~~~~~~~~~~~~~~~~~~~    WW2 Shooter with Dino Twist!",
            "review_score": "1"
        },
        {
            "review_text": "Fast-paced action and tongue-in-cheeck humor blend in a very additive team shooter. And dinosaurs!",
            "review_score": "1"
        },
        {
            "review_text": "Thanks PCGamer Magazine.  You got me the best dinosaur game for free. Which gives me goats for Garry's Mod.  XD",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this game. Why? The graphics are great! its kinda like day of deafet but with dinos, thats kinda all.... BUY THIS GAME!!! ",
            "review_score": "1"
        },
        {
            "review_text": "Possibly one of the dankest games I have ever played",
            "review_score": "1"
        },
        {
            "review_text": "A good alternative for fans of Team Fortress 2.  I almost gave this a thumbs down though because the devs pussied-out and did NOT use the swatiska for the Nazis.",
            "review_score": "1"
        },
        {
            "review_text": "For some reason this game disappeared out of my library a long time ago when my brother bought a 4 pack",
            "review_score": "-1"
        },
        {
            "review_text": "  Best FPS of the year!",
            "review_score": "1"
        },
        {
            "review_text": "The most story driven game I HAVE EVER played.",
            "review_score": "1"
        },
        {
            "review_text": "this is my time in Dino D-Day:  -searchers game servers -finally finds one with a decent amount of people -launches in and goes strait to allied side (because 'MERICA!) -spawns in and searches the map for enemy players -finds a goat and immediatley shots it, then t-bags it -finally finds a enemy player -starts shotting at his back -enemy does a 180 degress turn towards me -instanly dies -spawns back in and runs towards the burnt down church  -runs into middle of church -screen starts shacking and large foot sounds are heard -turns around and sees BIG ♥♥♥♥ING MASSIVE BARNY THE DINOSAUR (jokes) -runs away but gets gunned down with machine gun fire  -repeats this 20 times -starts to smash head on keyboard -quits  11/10- would t-bag goat again",
            "review_score": "1"
        },
        {
            "review_text": "Just a dino killing people in world war, thats just the craziest thing I've ever played. If you love dinos and hate natzis this game is for you.",
            "review_score": "1"
        },
        {
            "review_text": "Professionals vs Amateurs. I am an amateur = meat for professionals = frustrating game = not recommended for casual players. Therefore the game has so few players, but the official servers are still alive = who is interested can play at any time. Good game, only player needs skiiiiills.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good game,the nazi dinos idea is kind of stupid,but the characters,the teams,are really cool for me,i get the game for free,but if you have 10 dollars in your steam wallet,buy this games,it´s a entire game for a ridiculous war about man vs nazi dinosaurs",
            "review_score": "1"
        },
        {
            "review_text": "Lesson learned: Dinosaurs make wars last longer",
            "review_score": "1"
        },
        {
            "review_text": "Really easy to get good at but still fun",
            "review_score": "1"
        },
        {
            "review_text": "today i stuffed a giant rat up my boosum.",
            "review_score": "1"
        },
        {
            "review_text": "I had never even heard of this until I stumbled upon it in the Steam store, picked it up on a sale. Neat idea, never really thought about Nazi dinosaurs before. A lot of fun even playing against bots, as I don't play multiplayer a lot anymore. Graphics are decent, not state of the art, but very serviceable. Runs very well on my older system, no glitches or crashes as yet. A lot of light entertainment for $1.09 CDN. I would probably wait for a sale, but even full price would be ok, especially if you had a group of friends interested in it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is the original plot of Jurassic Park .",
            "review_score": "1"
        },
        {
            "review_text": "123",
            "review_score": "1"
        },
        {
            "review_text": "When I play this game I think I'm on LSD, but then I realize I don't do LSD 10/10 would bring back the dinosaurs",
            "review_score": "1"
        },
        {
            "review_text": "Everyone needs to own this game, especially right now since it's 99 cents.",
            "review_score": "1"
        },
        {
            "review_text": "it is awsome",
            "review_score": "1"
        },
        {
            "review_text": "Amazing Idea for a Game!! Very fun and can play for hours on end!!! and you can be a T.Rex what else do you want of of a game!!!",
            "review_score": "1"
        },
        {
            "review_text": "Freaking amazing. Who doesn't want to play a game with Nazis and dinosaurs with guns?",
            "review_score": "1"
        },
        {
            "review_text": "It's Nazi Dinosaurs. I'll leave it at that.",
            "review_score": "1"
        },
        {
            "review_text": "THE GAME IS GOOD BUT IT WILL BE HARD. But still good.",
            "review_score": "1"
        },
        {
            "review_text": "Its like TF2 but DINOSAURS!",
            "review_score": "1"
        },
        {
            "review_text": "I can pee on dead people 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I got bored of this game so quickly...",
            "review_score": "-1"
        },
        {
            "review_text": "I played as a tiny Dinosaur with a bomb strapped to my back and shouted Allah as I exploded in a group of Ally soldiers.  10/10 would play again.",
            "review_score": "1"
        },
        {
            "review_text": "By comparison, this makes ORION: Prelude seem not only plausible, but somber.   To balance Allied artillary strikes, Axis has kamakazi pterodactyls.   11/10  ",
            "review_score": "1"
        },
        {
            "review_text": "Tf2 + dinosaurs = this game. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "My Dino D-Day experience: 1. Launch game, screen freaks out and resolution takes like 2 mins to fix itself. 2. Join sever filled with angry Germans and hackers. 3. Walk out of spawn. 4. Die. 5. Game crashes from hackers spawning 20 T-Rexs. 6. Rinse and repeat.  '11/10 ''- IGN",
            "review_score": "1"
        },
        {
            "review_text": "it is Beautiful game and funny",
            "review_score": "1"
        },
        {
            "review_text": "i have not played this game long but i can already tell you it was the best 50 cents i have ever spend in my life. i have to get back to being a nazi dinosaur now, AUF WIEDERSEHEN",
            "review_score": "1"
        },
        {
            "review_text": "It's like TF2 But with dinosaurs 10/10",
            "review_score": "1"
        },
        {
            "review_text": "If you are the type of player who doesn't care if your team wins or loses this is a fun game of eating Alies and blowing up dinosaurs.",
            "review_score": "1"
        },
        {
            "review_text": "I love it! It's really fun and I like the war based theme!",
            "review_score": "1"
        },
        {
            "review_text": "If you aren;t sure if you should buy this game, buy it. For the love of Dino-God, BUY IT!",
            "review_score": "1"
        },
        {
            "review_text": "It has its moments dont normally like doing multiplayers but hey this one is amazing.",
            "review_score": "1"
        },
        {
            "review_text": "The kar98 is in this game, why would you not want to buy it?",
            "review_score": "1"
        },
        {
            "review_text": "LITERALLY THE (2ND) BEST FPS I HAVE EVER PLAYED",
            "review_score": "1"
        },
        {
            "review_text": "Fisting T-Rex 10/10 ign",
            "review_score": "1"
        },
        {
            "review_text": "I played as a little raptor-lookin' guy with a grenade strapped on my back. I killed a guy, then suicide bombed two other guys, becoming a a Jihadist Dinosaur. Scoring three kills, then going on Red-White-and-Blue punching spree while nearly invulnerable and dominating the entire enemy team in what I call 'Americazerking'. Sniping enemy players, and calling in Kamikaze Pteradactyls to explode and kill my enemies (whilst leaving a gory pink mist). Charging an enemy human, knocking them prone, then picking them up in your jaws and THROWING THEM INTO THEIR ALLY, GETTING A FRICKIN' DOUBLE KILL BADAAAAAAASSSSSS!  So, yeah, I'd recommend this one especially when it's on sale (which is often).",
            "review_score": "1"
        },
        {
            "review_text": "CoD 2 with dinos. Hard to beat",
            "review_score": "1"
        },
        {
            "review_text": "Sorry to say it but this game is just not worth getting you die to fast and it is not very enjoyable.   EDIT: Now that some kinks have been worked out the game is a blast to play. With or without friends to do it with.",
            "review_score": "1"
        },
        {
            "review_text": "Worth the two quarters i found on the parking lot last night. (steam sale ftw)  Seriously, this game is pretty awesome, the so bad its good kinda thing. Counter-strike + TF2 + Dinosaurs + generic WWII game, kinda mish-moshed together.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games ever made. The only thing that can make it better is if it had Workshop. MAKE IT HAPPEN!",
            "review_score": "1"
        },
        {
            "review_text": "This piece of crap wont even spawn me on multiplayer servers.",
            "review_score": "-1"
        },
        {
            "review_text": "Nazi TF2 with dionsaurs.",
            "review_score": "1"
        },
        {
            "review_text": "Long ago...In WaW II ,there was a man searching for help.He was alone.His team died in a mission. Day later he got into a bunker,but he wasn't the only one in there.And Then Dinosaurs *rawr* quickscoped him with their massive Machineguns Like Wtf who made this game 10/10 Would watch dino's killing eachother",
            "review_score": "1"
        },
        {
            "review_text": "Solid multiplayer fun with friends. Everyone should own this game. There's no better choice for someone looking for an affordable multiplayer. Grab a 4 pack and hand them out.. you'll get your moneys worth!",
            "review_score": "1"
        },
        {
            "review_text": "For $0.49 I can fulfill my dream of being a screaming, sprinting jihadi lizard.",
            "review_score": "1"
        },
        {
            "review_text": "This game is ww2 but dinos",
            "review_score": "1"
        },
        {
            "review_text": "it's a very fun game, looks a bit ugly like heroes &amp; generals but is soo adictive :) +++",
            "review_score": "1"
        },
        {
            "review_text": "This is the best $.99 I've ever spent in my life.",
            "review_score": "1"
        },
        {
            "review_text": "Nazis and Dinossaurs in the same game makes for a surprisingly good combo !",
            "review_score": "1"
        },
        {
            "review_text": "I liked Dino D-Day. Give me dinosaurs and multiplayer and I'm easily pleased. Even on single player, it's pretty fun. However, the maps do get a bit repetitive after a while and some bits are choppy, but I digress. I'lll be playing this one with my friends for a while.",
            "review_score": "1"
        },
        {
            "review_text": "The game's an unbalanced peice of ♥♥♥♥, but hey if you got some friends and the game is cheap you could join a game and make fun of it all together and feel like you got something out of it.",
            "review_score": "-1"
        },
        {
            "review_text": "6/10, strange game, but if you love dinos i think this game will be funny for you.",
            "review_score": "1"
        },
        {
            "review_text": "best simulator of world war 2  10/10  ",
            "review_score": "1"
        },
        {
            "review_text": "I tyrannosaurus rekt a T-Rex and got shot by dinosaurs with guns.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "It don't even take 5 minutes to kill a T-rex while it TAKES ONE ROUND JUST TO HIT THAT DAMN LITTLE FLYING RAPTOR. 10/10   ps. Flamethrower for ez mode",
            "review_score": "1"
        },
        {
            "review_text": "Stumbled onto this game by accident. It's your normal shooter except DINOSAURS!!! Sounds silly but playing as a dino with a machine on it's back works well.",
            "review_score": "1"
        },
        {
            "review_text": "It is very fun and passes the time",
            "review_score": "1"
        },
        {
            "review_text": "Well its d day but with dinos",
            "review_score": "1"
        },
        {
            "review_text": "Get ready to lose... a whole damn lot.",
            "review_score": "1"
        },
        {
            "review_text": "Dino D-day &gt; Day of Defeat Source  Reason: Dinosaurs.  Nuff said.",
            "review_score": "1"
        },
        {
            "review_text": "Cool game",
            "review_score": "1"
        },
        {
            "review_text": "I am impressed by this game. I thought this was a Primal Carnage ripoff, but this game runs slightly better and is just as fun!I'm pretty sure this came first anyway.",
            "review_score": "1"
        },
        {
            "review_text": "SPENT A COUPLE OF DOLLARS. AND YES! IT IS WOTH IT! RATHER THAN SHOOTING NAZIS. TRY SHOOTING THOSE DAMN DINOSAOURS!",
            "review_score": "1"
        },
        {
            "review_text": "most realistic shooter ive ever played",
            "review_score": "1"
        },
        {
            "review_text": "This, is how all of our wars should have been",
            "review_score": "1"
        },
        {
            "review_text": "Its reallly good.the gameplay is great plus origanal.",
            "review_score": "1"
        },
        {
            "review_text": "best game ever 10/10 need to have ..........PLS GIFT :(",
            "review_score": "1"
        },
        {
            "review_text": "Very fun in a stupid kind of way.Honestly though, what do you expect? It's a game with Nazis and Dinosaurs working together with machine guns on T-Rexes! If you like Dinosaurs or World War 2 games and can leave reality for a bit for some dumb fun, then this game is for you!   Also, it is very well built and solid, I have encoutered very few glitches.",
            "review_score": "1"
        },
        {
            "review_text": "if you love WWII and DINOS this is your game ^^",
            "review_score": "1"
        },
        {
            "review_text": "ONE OF THE BEST GAMES I PLAYED IN MY LIFE",
            "review_score": "1"
        },
        {
            "review_text": "1 of the best dinosaur vs human game ever!it include's world war 2 but its when nazis at the time got dinosaurs to fight for them cool multiplayer me and my siblings played hours and i mean HOURS of play time really enjoyed ceap up the good work:3",
            "review_score": "1"
        },
        {
            "review_text": "It's like day of defeats but with dinosaurs",
            "review_score": "1"
        },
        {
            "review_text": "Super game.Buy now",
            "review_score": "1"
        },
        {
            "review_text": "Its about dinosaurs...every game about dinosaurs is awesome",
            "review_score": "1"
        },
        {
            "review_text": "Its day of defeat and jurassic park put together all you have to do is imagine those things combine",
            "review_score": "1"
        },
        {
            "review_text": "you can be a dino that commits jihad",
            "review_score": "1"
        },
        {
            "review_text": "Who can't like a game with dinosaurs and guns..",
            "review_score": "1"
        },
        {
            "review_text": "I like the FPS aspect, but what I love more is the abilty to play as Nazi dinosaurs. One of our bretheren defected to the Americans, but we settle all disputes on the battlefield.  Its a fun game that my friend and I have enjoyed playing for many hours.",
            "review_score": "1"
        },
        {
            "review_text": "Have a game call dino d day A shooting game.i can tell you what game is it Left 4 Dinousour(L4D) Flapping with dinousour game  Lauch it quickly It is different Funny shooting game  Easy to play it  3 team u can use",
            "review_score": "1"
        },
        {
            "review_text": "Always play as the Nazis   trust me  Nazis win in this game every time",
            "review_score": "1"
        },
        {
            "review_text": "It's a great game, brought hours of fun, too bad the devs abandoned it and the community consists of like 1/16 of the positive reviews.",
            "review_score": "1"
        },
        {
            "review_text": "i can throw goats 10/11",
            "review_score": "1"
        },
        {
            "review_text": "honestly the game is what it is, what you see is what you get. not the greatest game i have ever played, but man is it far from the worst! i have had so much fun playing this so far, i just hope the community grows a bit forrealzies. beyond that it functions a bit like DoD....with dino's of course. i got this on sale for a buck, and now thati have playd it, i would have happily payed full price for this indie gem. kutos to the Dev's (and i got an achievement for killing one of you guys too which is cool :) ). i'm having a blast 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "I hate my life ",
            "review_score": "1"
        },
        {
            "review_text": "Really good game, played a long time ago in free weekend, wish I got more time with it",
            "review_score": "1"
        },
        {
            "review_text": "I've seen gameplay and it looks fun. But when I start it up the audio of a radio station plays, but only a black screen. When I move my mouse up and down, it just makes these clicking noises over somenthings I guess? Can anyone help me?",
            "review_score": "1"
        },
        {
            "review_text": "There is no Asia server that have player ",
            "review_score": "1"
        },
        {
            "review_text": "Honselty I played it when it was free and it was so fun i just got a four pack and dont know how to send it lol.",
            "review_score": "1"
        },
        {
            "review_text": "Game crashes/stutters as soon as you're playing for a couple minutes I tried a lot and looked at other people's posts about this crashing and freezing issue much worse than lag, the game becomes unplayable and you have to use task manager to just close it. if you guys are expecting a lot other than being able to look down the sight of your gun like another World at War clone. if you think that sounds worth it go ahead also note that i got this game when it was on sale xD that's saying somthing... the game has problems all of my other games work fine so very suprising to type about...",
            "review_score": "-1"
        },
        {
            "review_text": "This is a really funny and awsome game to play only problems is that the dinosaurs are a bit glichy in buildings and the dlc is hard to play without friends but other than that it awsome",
            "review_score": "1"
        },
        {
            "review_text": "It's ok. The idea is great though.",
            "review_score": "1"
        },
        {
            "review_text": "Way better than any COD",
            "review_score": "1"
        },
        {
            "review_text": "Honestly, this game isn't that bad. I assumed it was going to suck, but I was pleasantly surprised.   Pros: Good Gameplay, Different Class System, Cheap, Goofy in an Endearing Way, Trading Cards and Steam Achievements, Active Developers, Dinosaurs and Nazis  Cons: Relatively Low Player Base, Minor Lag Issues. ",
            "review_score": "1"
        },
        {
            "review_text": "Must Play Game 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Get to toss a goat. Get to eat people. Get to gun down dinosaurs.  ...Did I mention you can toss a goat?",
            "review_score": "1"
        },
        {
            "review_text": "Best WWII similator!",
            "review_score": "1"
        },
        {
            "review_text": "The game is ok, kept me entertained for a little while.",
            "review_score": "1"
        },
        {
            "review_text": "  If Hitler was alive, he`d tell you to get your ♥♥♥ on this game, and kick some capitalist butt!",
            "review_score": "1"
        },
        {
            "review_text": "Punching dinosaurs since 1939.",
            "review_score": "1"
        },
        {
            "review_text": "I remember this one dream I had when I had to kill a T-Rex. I ended up being brutally eaten and digested.  Exact your revenge on the reptillian ♥♥♥♥s in this game set in World War II Germany. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Its fun to bite peoples heads off. 7/10",
            "review_score": "1"
        },
        {
            "review_text": "Very fun, cheap game. Like TF2, but with DINOSAWRS!!!!11!!  Buy it now on sale for $5!",
            "review_score": "1"
        },
        {
            "review_text": "it cool",
            "review_score": "1"
        },
        {
            "review_text": "The nazi propoganda spouted over the intercom during multiplayer levels is priceless. 'Americanos! It has been brought to our attention that you believe we have dinosaurs in our ranks! This is crazy!' It's a shame a little more work didn't go into this came because it's actually pretty fun. Sadly, I can't get anyone to buy it to play with me...haha",
            "review_score": "1"
        },
        {
            "review_text": "Overall my daughter and I gave this a 6!   It's a fun little shooter and a staple game for both of us when we have down time. I love nothing more than watching her unleash terror on bots with her T-Rex.  This would be a 7 but upon seeing a swastika in the real world my daughter immediately screamed 'Dinosaurs!' I'm looking forward to her WWII history test results in the future!  *Kids Warning* Although the game itself is not very gorey, it is a shooter so parents discretion adviced.  Parents be careful on joining live servers as several people will openly voice or type adult content. I would recommend letting your child play againts bots by creating your own server.    ",
            "review_score": "1"
        },
        {
            "review_text": "ya its a grrrrrrrrrrrrreat game well ♥♥♥♥ it play",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game with great humor.",
            "review_score": "1"
        },
        {
            "review_text": "Yea its alright",
            "review_score": "1"
        },
        {
            "review_text": "THE BEST GSME EVEAR",
            "review_score": "1"
        },
        {
            "review_text": "Well Hello there Pilgrim,  Looking for adventure? Exploration of a foreign land? Have a hatred for all things scaly? Yearn to serve your country?  Than the Allied Forces have a job for you!  Boy, have the Nazi's done it this time, thought they were bad before? Well the Scary Schnitzel lovin Monsters out did themselves. They've brought back Scary Man Eating Dinosaurs! Long dead creatures with an insatiable blood lust and hatred of Freedom and Liberty only Hitler himselve could muster.  Don't you fret! We haven't lost this fight just yet!  Recruitment for the Extinctioneers is in high swing! Looking to knock some Nazi Dinosaurs right in the gullet? Well Capt. Jack Hardgrave has all the experience in large lizard beating action you'll need to learn from!  Don't let Ol' Hitler beat Uncle Sam! Join now! ````````````````````````````````````````````````````````````````````````````````````````````````````````````````````````````````````````````````````````````````````````````````````````````` I'm not joking when I say this game is JUST LIKE THAT.  Team vs Team, Nazis vs Allies, Man vs Beast.  This game has everything you're looking for in a game, especially if you're looking for a game worth playing! Addictive multiplayer fun, with nothing but non-stop Nazi Dinosaur beating goodness. Want to be the dinosaur? Well guess what bub, this game switches teams every round. Think Freedom is for the goody goodies? That's fine, cause the dinosaurs are pretty much elite killing machines bent on total world domination.  Not only are there team v team maps, but specialty maps where Ol' Hitler unleashes one of his T-Rex's on the poor Allies!  What more could you want in a game?",
            "review_score": "1"
        },
        {
            "review_text": "Don't get this game. The fun only lasts like five minutes. It is too slow, nobody plays it, it's only online, and the level design is poor.",
            "review_score": "-1"
        },
        {
            "review_text": "Nazi Dinosaurs..what else do I have to say?",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing. Dinosaurs. Nazis. Guns, Peeing on corpses. Everyone in the world should own this game, I'm not even kidding.",
            "review_score": "1"
        },
        {
            "review_text": "Dinosaurs and Nazis. What more can I say.",
            "review_score": "1"
        },
        {
            "review_text": "If this game goes on sale, BUY IT.",
            "review_score": "1"
        },
        {
            "review_text": "Great game.  Even if there is a huge difference between the gameplay between playable characters the game is still balanced providing enough gameplay hours because every character is playable so you're not stuck with three guys because you don't want to get mauled.  ",
            "review_score": "1"
        },
        {
            "review_text": "this is the best first person shooter ive ever played ",
            "review_score": "1"
        },
        {
            "review_text": "You see. I've been going through a rough time recently. I recently broke up. And i've been feeling lonely inside. This game made me feel happy and contempt. Something about the badassery of dinosaurs with machineguns completes my life. And you kill hopless goats!! (take that goat sim!) In all seriousness though. This will fill a void in your heart, and you will come to realize that void was where there were dinosaurs missing.",
            "review_score": "1"
        },
        {
            "review_text": "Cool game!! Wish there were more dino's to play.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun to derp around with friends!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Just an all around fun shooter.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ing Nazi Dinosaurs VS. America.   ♥♥♥♥ing game of the year. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Looks fun, and is, actually... for about 10 minutes. After that it seems to get really boring, really fast. I should never have bought this pitiful game, even for 2.50 on sale... should've just used my money on tf2 items or something",
            "review_score": "-1"
        },
        {
            "review_text": "Great game, especially with all the new updates it got for new classes and balancing issues. It needs more players though.",
            "review_score": "1"
        },
        {
            "review_text": "Creatures from Ancient Days Walk the Earth Once More... What Will YOU do about it? ",
            "review_score": "1"
        },
        {
            "review_text": "Incredibly fun FPS arena game. The dino's bring in 3rd person and melee action, which I absolutely adore!",
            "review_score": "1"
        },
        {
            "review_text": "This game is tons of fun, anyone who is tired of serious shooters needs to play this game, its something different from most first person shooters on the market. Good luck finding servers though, the last couple of months I seen a huge drop of people playing this game.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ing awesome you can play as dinosuars and ♥♥♥♥. and the best part is your nazi dinos which is way cool.",
            "review_score": "1"
        },
        {
            "review_text": "Fun, and funny. Kill all the goats! I reccomend this if you want a laugh. Get it while it's on sale!",
            "review_score": "1"
        },
        {
            "review_text": "Oh sweet ♥♥♥♥ing jesus, this game is so ♥♥♥♥ing amazing.",
            "review_score": "1"
        },
        {
            "review_text": "ITS THE BEST GAME EVER!!! GET IT GET IT GET IT!!! ITS INSANE!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Its a little bit confusing and not very userfriendly, but still manages to be a hillarious game to play with friends while talking via skype :)  P.S. ACTUALLY, THE VERY SINGLE REASON I LIKE THIS GAME IS THE ABILLITY TO KILL GOATS &gt;:)",
            "review_score": "1"
        },
        {
            "review_text": "This is a very useful tool to unleash your inner dinosaur. You can run around as a dinosaur and eat goats and spit them at female military personnel to remind them that they belong in the kitchen, or play as a jihad-hungry muslim compsognathus and explode right under your enemies' balls and make them question 'Oh God why me'. Some seriously nostalgic and therapeutic stuff I must say. Pretty much like Assassin's Creed except you play the lives of your ancestors from way way back, and, there's no Kristen Bell, which is why I'm going to sarcastically recommend this game to everyone. This is easily the most emotionally-complicated game in history, cause hey how would you feel if a dinosaur spits goats at you. All games need Kristen Bell.",
            "review_score": "1"
        },
        {
            "review_text": "There are dinosaurs and Nazis. I don't know what more you could want in a game, especially for the price.",
            "review_score": "1"
        },
        {
            "review_text": "This game is really cool as they add more dinosaurs. Special abbilities and other crazy things!",
            "review_score": "1"
        },
        {
            "review_text": "really good game really fun i reccomend u get it ",
            "review_score": "1"
        },
        {
            "review_text": "this game is so much fun, and beware the velociraptor for he fiests on necks",
            "review_score": "1"
        },
        {
            "review_text": "Ir is very good and doesnt have hard controls but if you dont have a mouse it is challenging to play with the full amount of fun. So, as long as you have a mouse, Enjoy!",
            "review_score": "1"
        },
        {
            "review_text": "Wow that was great game play i would play it if its free to play. i would play constantly everyday so. graphics are awsome its great.   just make it free to play and you will gain player base :D  Great game",
            "review_score": "1"
        },
        {
            "review_text": "Dude, this game is fun, best 2 bucks I spend.",
            "review_score": "1"
        },
        {
            "review_text": "Such dino Very action Much fun",
            "review_score": "1"
        },
        {
            "review_text": "its really good game",
            "review_score": "1"
        },
        {
            "review_text": "its a good game graphics arent geat really hard bit boring",
            "review_score": "1"
        },
        {
            "review_text": "i have this game on my dads pc,and it is so cool!",
            "review_score": "1"
        },
        {
            "review_text": "IF U LIKE COUNTER STRIKE SOURCE OR TF2, U SHOULD GET THIS GAME!! NOW!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Very good game, my favourite class was the little compy, zipping around the map, slashing everyone, and goats, and then finally.... BOOM!",
            "review_score": "1"
        },
        {
            "review_text": "this game is ♥♥♥♥ing AWESOME! I hate FPS but this was the best 2 bucks I ever spent!",
            "review_score": "1"
        },
        {
            "review_text": "yup it's a pretty entertaining game for friends on a weekend. would suggest having more dinos if possible, especially for allies.",
            "review_score": "1"
        },
        {
            "review_text": "Om nom nom, I want your throats!",
            "review_score": "1"
        },
        {
            "review_text": "multiplayer is probably dead  nobody plays as the allies because the nazis have cooler dinosaurs",
            "review_score": "-1"
        },
        {
            "review_text": "Play as humans or dinosaurs in this Axis vs Allies FPS. Mostly just play as dinosaurs, though.",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome i reccomend you get it theres a variety of dinosaurs and stuff its very fun and Its just a great game.",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game when It was on sale and let me tell you that I found that it is well worth the purchase even at full price, great game, tons of fun AND THERE'S DINOSAURS!!! ",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game Being a dinosaur its just really cool and great This has to be a GOOD GAME Because it is.",
            "review_score": "1"
        },
        {
            "review_text": "best ♥♥♥♥ ever bro try it now but its free now but its not now or ever so f off! ",
            "review_score": "1"
        },
        {
            "review_text": "This game is cool and all, but NO ONE PLAYS IT!",
            "review_score": "1"
        },
        {
            "review_text": "After Update #959 GAME IS EPIC",
            "review_score": "1"
        },
        {
            "review_text": "If you can pick it up for under $5 it's some pretty mindless fun.",
            "review_score": "1"
        },
        {
            "review_text": "I don't know why people are saying that there are a lack of players? I bought this game about 3 days ago and everytime I've been on it, there's been loads of people playing it. This game is great fun and very entertaining, I find it's better to be on the Allies team than the Nazis' team or some reason though. Well worth the price tag! 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Ruined my social life. 10 out of 10",
            "review_score": "1"
        },
        {
            "review_text": "This game is hilariously odd!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome idea for a game  it is great fun, good gameplay and it looks good too  i'm not a person for giving reviews but its just awesome",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun",
            "review_score": "1"
        },
        {
            "review_text": "this game is great fun, i like to maps but i'd like more choices in class.",
            "review_score": "1"
        },
        {
            "review_text": "Basically Team Fortress 2 with Nazi's and Dinosaurs set during WWII. Makes no sense, but who cares, it's stupid fun and is keeping me laughing as I play a little dino with a bomb strapped to my back XD",
            "review_score": "1"
        },
        {
            "review_text": "Dinosaurs and WWII, what more could you want?  Okay, in all seriousness, there are a few flaws. The Axis side is slightly overpowered and the Allies have only one dinosaur to play as. But a lot of content has been added since it's initial release; namely the controllable T-Rex. I'm sure a lot more content will be added in the future if fans continue to support this great title.",
            "review_score": "1"
        },
        {
            "review_text": "This game... No, this masterpiece... This ♥♥♥♥ing masterpiece is a masterpiece of this age, but at first glance it might look like some ♥♥♥♥♥♥♥♥ game created by geniuses, but that's what it is not. THIS ♥♥♥♥ING MASTERPIECE HAS EXCELLENT STORY TELLING ELEMENTS AND SUPERB GAMEPLAY. THE MULTIPLAYER IS JUST A BONUS. YOU EVER DREAM OF BEING A DINOSAUR FIGHTING FOR HITLER'S REGIME? WELL NOW YOU CAN ♥♥♥♥ING DO SO AS A USELESS DINOSAUR THAT BLOWS UP AND GOES TO VALHALLA AFTERWARDS. YOU EVER WANT TO BE A RUSSIAN SNIPER LADY WHO THROWS RABBITS FIGHTING FOR THE ALLY NATIONS? WELL NOW YOU ♥♥♥♥ING CAN! GO ♥♥♥♥ING BUY THIS GAME YOU GOD DAMN PLEB AND PLAY IT TO THE MAX OR ELSE YOU'LL BE ♥♥♥♥ING TREATED AS A JEW AND NOT AN HONORARY ARYAN ♥♥♥♥ing 10/10",
            "review_score": "1"
        },
        {
            "review_text": "this game is the best!",
            "review_score": "1"
        },
        {
            "review_text": "This game is eerily similar to TF2... so much so that I barely notice that I'm not playing my favorite scout or sniper. The only things I know are different between the two are the character skins, dinosaur classes, weapon models, and the fact that this game isn't nearly as fun. For $9.99 ($2.49 if you get it on sale, or free if you get it from the million key distribution currently going on like I did) I cannot recommend this game. What I do recommend is that you forget about this game and go download TF2 for free if you haven't done so already.",
            "review_score": "-1"
        },
        {
            "review_text": "The best game on steam, 2014.",
            "review_score": "1"
        },
        {
            "review_text": "There was always a weakness of men for dinosaurs. Enormous lizard-like animals, capable of running, flying, poisoning and ramming are somewhat a monument of dynamics, speed and aweness. This game makes no other assumption, only the one that human kind has always made: dinosaurs are the all time all glory best",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would play again, this game is just what you've been looking for! You want a competative shooter with lots of guns? this game's got it! Want a shooter with awesome sound effects? You found it! Want a game with a large fanbase? You found it! Buy it and play it and be happy you bought the best game on the marketplace.",
            "review_score": "1"
        },
        {
            "review_text": "This is the B-movie of games. You laugh at the premise and settle in for a couple minutes of stupid fun, and then at some point you find that you're genuinely enjoying it. It's simple and it's not going to win any innovation awards, but the community seems nice and still active and, what the hell, you can play as a machine-gun wielding triceratops.",
            "review_score": "1"
        },
        {
            "review_text": "Pick it up while it's cheap!!",
            "review_score": "1"
        },
        {
            "review_text": "Man this game is one of the best games i played for a while! i am looking forward making a review and gameplay at my channel on youtube!",
            "review_score": "1"
        },
        {
            "review_text": "it like tf2 but with dino in it and without the hats",
            "review_score": "1"
        },
        {
            "review_text": "ITS LIKE TF2 WITH DINOS BUY THIS",
            "review_score": "1"
        },
        {
            "review_text": "Dinosaurs with machine guns! Enough said!",
            "review_score": "1"
        },
        {
            "review_text": "If you dont play this I dont know what your doing with your life",
            "review_score": "1"
        },
        {
            "review_text": "Wouldn't hurt to try this game especially when it's on sale.",
            "review_score": "1"
        },
        {
            "review_text": "You can a Nazi Tyrannosaurus Rex with machine guns straped to my mouth in this game. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "In first match i got ♥♥♥♥ed up by a freaking big dinosaur or dinosour.",
            "review_score": "1"
        },
        {
            "review_text": "It's a really fun game to play with your friends",
            "review_score": "1"
        },
        {
            "review_text": "not recommend it for I do not like, has bad FPS history is meaningless, and especially that stupid music? you could say, has a bug, that you shoot your same equipment you eliminated from a shot  no lo recomiendo para mi no me gusta, tiene malos FPS la historia no tiene sentido, y sobre todo esa música tan estúpida? se podría decir, tiene un bug, que se te disparan de tu mismo equipo te eliminan de un disparo",
            "review_score": "-1"
        },
        {
            "review_text": "Hilarious! Batshit crazy shooter for the fun in between.",
            "review_score": "1"
        },
        {
            "review_text": "In case the T-Rex wasnt OP enough they put guns on it.",
            "review_score": "1"
        },
        {
            "review_text": "It was free so I played it for the cards. Its a fun premise but pretty poorly executed imo. I wouldn't pay for it but if you can grab it free give it a whirl, it killed some time at least.",
            "review_score": "-1"
        },
        {
            "review_text": "Steam says I need to do this for a badge. So I'll just leave it at nazis+dinosaurs=win.",
            "review_score": "1"
        },
        {
            "review_text": "its awesome and peppim doesnt have it 8-3",
            "review_score": "1"
        },
        {
            "review_text": "i bought it for the gmod assets, only to find out there was none #9/11wascool",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games i ever played.",
            "review_score": "1"
        },
        {
            "review_text": "I really wanted to like this but it ended up being just plain aweful. So dissappointing.",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty bad remake of TF2.",
            "review_score": "-1"
        },
        {
            "review_text": "The concept (&amp; title) of this game immediately suggests that it will probably be 'fun but naff'.   Unfortunately, it's just naff.   A truly mediocre shooter that will leave you feeling like you've been over-charged no matter how little you pay for it.",
            "review_score": "-1"
        },
        {
            "review_text": "Would claw goat again   GameinFAPer- (11 of 10)",
            "review_score": "1"
        },
        {
            "review_text": "very fun shooter game. there's something about killing nazi dinosaurs that no other game can touch",
            "review_score": "1"
        },
        {
            "review_text": "I punched a T-rex to death. This game is amazing.",
            "review_score": "1"
        },
        {
            "review_text": "+ Playable on a 1.6ghz Acer Revo R70 + Garth Marenghi quote on the loading screen. - Servers were also empty the last few times I looked. - Lag ninjas playing micro raptors.",
            "review_score": "1"
        },
        {
            "review_text": "This game is so inaccurate: everybody knows that the Americans resurrected the dinosaurs before the Nazi did!",
            "review_score": "1"
        },
        {
            "review_text": "It's just a paid clone of Team Fortress 2 with Nazi Soldiers and Dinosaurs. Even though I got a free key of this from PCGamer and Bundle Stars I can't believe you need to pay 10 euros (or 9,99) for a copy of a free-to-play title! Some sounds are the same, some classes are the same, the leaderboards when you press tab are the simillar, just dirtier. I liked it for the first minutes , but when I found too many simillarities with TF2 I just deleted the game. One more thing, there's no tutorial and so it isn't very beginner friendly. As you can see I'm not aprooving this game, even if it's fun it's, just like I said, a paid plane ol' clone of TF2. I'm sure some of you will dissagree but it doesn't matter.",
            "review_score": "-1"
        },
        {
            "review_text": "You can punch a T-Rex until it finally gives up on life, or you can get annihilated by a Dilophosaurus throwing a goat at your face.  10/10  Would join the Nazi Dinosaur Regime.",
            "review_score": "1"
        },
        {
            "review_text": "There needs to be an update that makes the smallest dino be able to get a criticle kill by biting the balls of an enemy via sneak attack.",
            "review_score": "1"
        },
        {
            "review_text": "This game is awsome i love to play it its veary good graphics and nice action",
            "review_score": "1"
        },
        {
            "review_text": "the t-rex has miniguns 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I KNOW this game hasn't fared well with a lot of people, but IMO this game is fun, campy and action packed and that's really all have to say.",
            "review_score": "1"
        },
        {
            "review_text": "This is literally one of the greatest games I've ever played. Never a dull moment, the community is funny and there are NAZI DINOSAURS. (Plus a new overhaul update is coming!)",
            "review_score": "1"
        },
        {
            "review_text": "This game i highly recomend for people who have a love for first person shooters and dinos from what i have played each dino has a uniqe power of there own my favorite is the small bird raptor (forgot what its name was) it can hook to the roofs and walls spite a blinding poision and claw you to pieces, the t rex and the triseratops are the biggest and most Op dinos in game but have a very small chance of you randomly spawning in as one the gun men are power full if there in the right place",
            "review_score": "1"
        },
        {
            "review_text": "Weird, histerical, good. The game is really fun, but the competitive side is still very questionable. But you can't argue with using a T-Rex with machine guns on it's mouth and have fun killing all sorts of both human and dinosaur characters. Still, don't consider it decent at retail price, might wanna wait until sale.",
            "review_score": "1"
        },
        {
            "review_text": "Nazi-Dinosaurs. Nuff' said. Peeing on the enemy/10",
            "review_score": "1"
        },
        {
            "review_text": "JUST YES BUT WITH FRIENDS JUST BUY THE FOUR PACK!",
            "review_score": "1"
        },
        {
            "review_text": "Can somone explain to me why I should waste my time on a boring shooter ? Nothing was pulling me to stay and play in that game .... Run as dinosaur also ....  so I deleted ASAP  If somone like shooting for no reason, no story , and not getting bored fast probably can enjoy this game for me it's not   Gameplay 1/10",
            "review_score": "-1"
        },
        {
            "review_text": "shooting some mans but mans are nazi dinosaurs   p fun",
            "review_score": "1"
        },
        {
            "review_text": "i just need a steam card then i can get dis game...but when it was free it was EPIC 10/10 stars",
            "review_score": "1"
        },
        {
            "review_text": "Everything i ever wanted in a video game.",
            "review_score": "1"
        },
        {
            "review_text": "60/100",
            "review_score": "1"
        },
        {
            "review_text": "I walk out into the open with my rocket launcher in hand while looking for enemy dinos. when suddenly i hear a high pitch sream and turn to see a goat being flung into my face. I fell over and witnessed myself get picked up and thrown at a team mate and he died and everything went black. GG",
            "review_score": "1"
        },
        {
            "review_text": "Was worth the Dollar I paid for it. Haven't had the crashes everyone keeps talking about. Online playerbase is terrible. Singleplayer is pretty fun. Murdered hundreds of innocent goats. 6/10.",
            "review_score": "1"
        },
        {
            "review_text": "Broken beyond belief, but kinda fun because of that.",
            "review_score": "1"
        },
        {
            "review_text": "It's like WW2, right? But with dinosaurs. I like dinosaurs. I also like WW2 games. So, do I like the game.  To sum it all up, this game is like AIDS, but with more WW2, and more dinosaurs.  I like the dinosaur that flies, cause he shoots green ♥♥♥ at people that insta-kill scratches them  Oh, and you can launch goats at people  11/10 would throw goats again.",
            "review_score": "1"
        },
        {
            "review_text": "IGN 10/10 so funny many commited people to the game so its not hard to find a sever with many people ",
            "review_score": "1"
        },
        {
            "review_text": "Its actually a really cool Half-Life mod!",
            "review_score": "1"
        },
        {
            "review_text": "Like TF2 with dinosaurs",
            "review_score": "1"
        },
        {
            "review_text": "More unbalanced than someone with broken legs!",
            "review_score": "-1"
        },
        {
            "review_text": "WHY IS THIS NOT MORE POPULER???? you can use goats as projectiles this is awsome",
            "review_score": "1"
        },
        {
            "review_text": "its a fun action packed wwII dinosaur fps game and i deffinenetlly rocommend you to buy the game",
            "review_score": "1"
        },
        {
            "review_text": "best game ever, i allways pick the little dinosaur and camp on the walls :D",
            "review_score": "1"
        },
        {
            "review_text": "This is dumb i got it for free and now i have to pay",
            "review_score": "-1"
        },
        {
            "review_text": "What can I say: this was one of the best uses of $1 that I have come across on here. This is definately a game that is perfect for unwinding with after a busy day.",
            "review_score": "1"
        },
        {
            "review_text": "99 jews in a gas chamber 99 jews flip the switch then a huge godamn t-rex eats them.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun game.But if the delevopers could add more dinosaurs, characters and maps,it would be better.Graphics should also improve a bit.",
            "review_score": "1"
        },
        {
            "review_text": "Gameplay is pretty much just shooting Nazi dinosaurs.  10/10 would do again.",
            "review_score": "1"
        },
        {
            "review_text": "Dino D-Day is game based on WW II but whit added dinos. There are two sides, Germany and US. Both has dinos.  Pros: - Games is funny, especially whit friends. - Many different classes both sides have- - Low requirements to run this game  Cons: - Some people have problems launching game. - sometimes bugged - crashes.  conslusion: This game is Fun whit friends especially. If you have the money i highly advise to buy it.",
            "review_score": "1"
        },
        {
            "review_text": "It's like TF2 with dinos, What the hell could go wrong.",
            "review_score": "1"
        },
        {
            "review_text": "its good :P",
            "review_score": "1"
        },
        {
            "review_text": "great game but it is not worth 10 dollers so get it on a sail but it is and amazing game that you should try  ",
            "review_score": "1"
        },
        {
            "review_text": "very nice game love it",
            "review_score": "1"
        },
        {
            "review_text": "Nazi Dinosaur suicide bombers  Game of the Year 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Its mind blowing video game, when human and dinosaurs can be together as a team :D",
            "review_score": "1"
        },
        {
            "review_text": "Not bad aiming a bit weird but other than that its fun.",
            "review_score": "1"
        },
        {
            "review_text": "Meh, it was ok for 30 minutes. If you like FPS than good for you. I'm going back to playing Tropico 4.",
            "review_score": "1"
        },
        {
            "review_text": "This game is so much fun, got this game when it was 90% off it was a steal and i had to buy it. After the free demo i would have no problem paying 10$ for this game. Ill enjoy many more countless hours killing dinos...and NAZIS!",
            "review_score": "1"
        },
        {
            "review_text": "Very interesting games!!",
            "review_score": "1"
        },
        {
            "review_text": "Nice game having fun killin dinos!",
            "review_score": "1"
        },
        {
            "review_text": "...",
            "review_score": "1"
        },
        {
            "review_text": "I Realy like this game i buy it for 0.99$",
            "review_score": "1"
        },
        {
            "review_text": "Pretty Good game for 69p 10/5 would recomend it",
            "review_score": "1"
        },
        {
            "review_text": "While it's less than $5 i will recommend it. It's fun and has an interesting theme with lots of potential, looks good. Still needs a fair bit of refinement and tweekage - the controls don't quite feel right nor does damage dealt by different guns/diosours . A bit dry - not immersive and only good for short plays (I tried a number of modes/maps), it's missing something. Also the T-Rex is like a sitting duck - it's so easy to hide and out manuver it with infantry, it's useless.  I will keep and eye on this game though .",
            "review_score": "1"
        },
        {
            "review_text": "great fun. very few bugs but the nazis are a bit overpowered.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game, just gets bad reviews, and am sorry to say that this game doesn't get the justice that it deserves. Hers the layout, you are in WWII scenario with all the good stuff that comes along with that. Variety of classes that are available to you for the choosing. The variety give the death match gameplay (sort of like Team Fortress 2) can give you a rush everytime you play it. 8/10 for a review. Have a good day!!!! :D",
            "review_score": "1"
        },
        {
            "review_text": "My only reaction to this: nazi dinosaurs.   nazi dinosaurs.   the valve community is skyrocketing in there amazing ideas.",
            "review_score": "1"
        },
        {
            "review_text": "BEST IDEA OF A GAME EVER!!  Reasons you would like this game: -Suicideing dinosaur that is really annoying or easy to play BUT can easily be killed with flamethrower -Dinosaurs -Pretty balanced to me -many other reasons xD",
            "review_score": "1"
        },
        {
            "review_text": "It's good",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoy this game,from what I know there aren't many other WW2 games with dinosaurs where you can pounce the ♥♥♥♥ out of your enemy. You can even puke on them, fly around, and ♥♥♥♥♥ slap them. Would recommend 1337/420/69/10 -IGN",
            "review_score": "1"
        },
        {
            "review_text": "= =",
            "review_score": "-1"
        },
        {
            "review_text": "Most realistic game ever! 10/10 -IGN",
            "review_score": "1"
        },
        {
            "review_text": "Funny FPS! Allies's ladies are HOT! Dinosaurs are fun to play! Sniper one shot not have kill! ....BTW The ladies are HOT!(Espeially Camile!) .... lol",
            "review_score": "1"
        },
        {
            "review_text": "Funny game, good variant, if you searching game for loosing time.",
            "review_score": "1"
        },
        {
            "review_text": "not that bad for a $5 game",
            "review_score": "1"
        },
        {
            "review_text": "You can be a t-rex, need i say more?",
            "review_score": "1"
        },
        {
            "review_text": "Dinosaurs and Nazis. End of Discussion.",
            "review_score": "1"
        },
        {
            "review_text": "It's TF2 but with dinosaurs and nazis",
            "review_score": "1"
        },
        {
            "review_text": "Its not fun",
            "review_score": "-1"
        },
        {
            "review_text": "like to be dinos like to be americans like to be germans well then this is for you",
            "review_score": "1"
        },
        {
            "review_text": "Jurassic park meets WW2. What's not to love?",
            "review_score": "1"
        },
        {
            "review_text": "If you like laughing hilariously or playing a game that is not serious what-so-ever or both at the same time, then Dino D-Day is your choice.  Two teams are thrown at eachother (one Allies the other Axis, obviously) in your normal FPS PVP gamemodes. However, there is a small twist. There's mother♥♥♥♥ing DINOS running around. Allies have access to only one dino and 6 human classes while the Axis have access to three human classes and four or five dinos. Other than that, it's fairly simple gameplay. Snipers snipe, medics heal, riflemen shoot things, demo blows ♥♥♥♥ up, and dinos eat people! However it gets dull. Fast. The game itself is more or less something that I personally would boot up for a few laughs with friends, or would play for an hour and then go do something else.  There is a co-op survival mode, although it just has you running around the map doing various objectives for money that can get you new weapons and tools. In my less than extraordinary or professional opinion, I give it two stars.   Okay eating people is hilarious, 4.5 stars out of five.",
            "review_score": "1"
        },
        {
            "review_text": "I was a tiny dinosaur and i called a fully grown man becaus ei alluah akbar'd him with a grenade strapped to my back...  10/10- I.G.N  Would be a nazi suicide dinousaur again",
            "review_score": "1"
        },
        {
            "review_text": "Did you ever think that world war II would be better with dinosaurs? wel it's friggin' hilarious and in this game!",
            "review_score": "1"
        },
        {
            "review_text": "open the door get on the floor everybofy get eaten by a dinosaur",
            "review_score": "1"
        },
        {
            "review_text": "Me and a mate tried this game in a free weekend and have been waiting for it to go on offer for ages and bought it good gasme",
            "review_score": "1"
        },
        {
            "review_text": "Ok, but feels empty without many weapons at all",
            "review_score": "1"
        },
        {
            "review_text": "Dinosaurs, guns, kamikaze dinosaurs, dinosaurs with guns, dinosaurs with flamethrowers. Whats not to like? ",
            "review_score": "1"
        },
        {
            "review_text": "Better than Call of Duty. It has Dinosaurs.",
            "review_score": "1"
        },
        {
            "review_text": "Loved this game,though it needs a few 'changes' I got annoyed when i got killed by a microraptor with spit once, then slashing me when i can't even see it, Microraptor is like, the one with the large punch. Really good though, 10/10, recommended buying.",
            "review_score": "1"
        },
        {
            "review_text": "Nice game + DINOSAURS",
            "review_score": "1"
        },
        {
            "review_text": "i played this when it was free it was great ",
            "review_score": "1"
        },
        {
            "review_text": "is fun",
            "review_score": "1"
        },
        {
            "review_text": "Have you ever wanted to punch a Tyrannosaurus Rex to death? Get Dino D-Day! You've never wanted to punch a Tyrannosaurus Rex to death?  Try something new today!",
            "review_score": "1"
        },
        {
            "review_text": "CSGO with dinosaurs, very funny  play with sniper and hide as camper, won every match xD",
            "review_score": "1"
        },
        {
            "review_text": "If you like Dinosaurs (And lets face it you should :P) this game is amazing you can play as a stealthy compy that sneacks up on people get 3 kills and KABOOM BABY! Play as a Dilophosaurus that picks up goats and throws ehm at people! Play as a TANK! (Not in a tank AS a tank) AND SO MUCH MORE! Worth every penny!",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this game",
            "review_score": "1"
        },
        {
            "review_text": "WWII, as it 'should' have been.",
            "review_score": "1"
        },
        {
            "review_text": "really good if you don't know what to play.I love and adore this game.",
            "review_score": "1"
        },
        {
            "review_text": "Addictive. Fun. Defenseless Goat. Raaawr.  These words describe the game , i enjoy playing it and I think is probably one of the best 5 dino games on the market right now.",
            "review_score": "1"
        },
        {
            "review_text": "This is a Great game about WW2 but the way is shouldve been, my only complants are the lack of guns (i wanna play as a allied soldier that carries more than 2 guns in their primary slot!) and last stand isnt free but its always fun. finaly for complains is more maps where people can play as a T-rex the only reason i say this is because mose maps for the T-rex are empty or is pretty much a T-rex vs 1 soldier and a trigger. The guns that are in the game are AWSOME and the shotgun ohhh the shutgon so good with a flame thrower. So its a great game. by the way you missed to press buy Dino D day up there ^.",
            "review_score": "1"
        },
        {
            "review_text": "Suicide bombing compy too good",
            "review_score": "1"
        },
        {
            "review_text": "I sniped a dino in the tail, and killed it.",
            "review_score": "1"
        },
        {
            "review_text": "NAZI DINOSAURS. HEINHEIL!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!1 Oh and fun gameplay and gunplay. Fun to play as the dinosaurs so play it if you cry evry tiem.",
            "review_score": "1"
        },
        {
            "review_text": "Dino D-Day is Not all good because it dosen't have a lot of what gamers like but it was fun to play at the time but But the game is not all that bad ether. 4/5 Dinosaurs have a big impact on people because of jurassic park. So I realy hope you will like this as much as i do but i hope you will like this more than i did. go have some fun for me alright?",
            "review_score": "1"
        },
        {
            "review_text": "Good for a short laugh or two...or three...dammit it's dinosaurs with guns, what do you expect?",
            "review_score": "1"
        },
        {
            "review_text": "You get to shoot dinosaurs with a garand. Your argument is invalid.",
            "review_score": "1"
        },
        {
            "review_text": "Sort of good for a laugh, hit boxes are so innacurate its not funny though. Waste of time really.",
            "review_score": "-1"
        },
        {
            "review_text": "  A terrible game for a technical standpoint but goes carry a 'So bad it's good' vibe with it. Can be enjoyable for a bit espically if just ♥♥♥♥ing around with friends. SO yeah . Take from that what you will.",
            "review_score": "1"
        },
        {
            "review_text": "Great for 0,99€",
            "review_score": "1"
        },
        {
            "review_text": "I don't understand a thing.Why can you pee in this game?",
            "review_score": "1"
        },
        {
            "review_text": "Very Fun and Cheap for 'Lan Partys' or just playing with your class mates during class ;-) wtich is basicly a lanparty too xD",
            "review_score": "1"
        },
        {
            "review_text": "love this game it. really like how you eventually recognise some other players and you have rivals among the player base. But i got a new computer and now i try to play this game and it just says preparing to launch but then it just closes and doesnt open up.",
            "review_score": "1"
        },
        {
            "review_text": "At least it got Cards",
            "review_score": "1"
        },
        {
            "review_text": "Fun, addictive. New dinos make it even more fun.",
            "review_score": "1"
        },
        {
            "review_text": "Pointed my Thompson to a goat, T-Rex came, ate the goat and left. Best Game ever 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "Two words, NAZI DINOSAURS!",
            "review_score": "1"
        },
        {
            "review_text": "Just missing Nazi zomby dinosaurs, and its pertfect",
            "review_score": "1"
        },
        {
            "review_text": "So stupidly entertaining",
            "review_score": "1"
        },
        {
            "review_text": "Played this game to take my mind off a toothache. Actually worked.   10/10",
            "review_score": "1"
        },
        {
            "review_text": "Don't get this game, there are better ones out there that are the same, that are more polished and have better controls and stuff to do.",
            "review_score": "-1"
        },
        {
            "review_text": "Team Counter of Defeat Fortress with Dinosaurs :)",
            "review_score": "1"
        },
        {
            "review_text": "Best game I have ever bought, this is beyond what next gen can ever bring us.",
            "review_score": "1"
        },
        {
            "review_text": "idk, got bored quickly, but still pretty funny and cheap game",
            "review_score": "1"
        },
        {
            "review_text": "Very funny game!  i rate it 6.9/10",
            "review_score": "1"
        },
        {
            "review_text": "The most historically accurate representation of World War 2 you'll find anywhere",
            "review_score": "1"
        },
        {
            "review_text": "Great if you feel like being a massive dinosaur that litteraly obliterates everything let's hope it gets the fame it deserves some day....",
            "review_score": "1"
        },
        {
            "review_text": "This game is a underrated fun and silly game. You are not buying a masterpiece but you are buying a game to just fool around with friends for an hour. This game is something you will buy as a joke but really like the gameplay. I think the WW2 and dinosaur genre fit really well. If you are thinking about buying it you should.",
            "review_score": "1"
        },
        {
            "review_text": "such game much dinosaur",
            "review_score": "1"
        },
        {
            "review_text": "This is how the war was meant to be remembered.",
            "review_score": "1"
        },
        {
            "review_text": "Well ... is a 1$ game ... so is fun for 1$",
            "review_score": "1"
        },
        {
            "review_text": "If you want to play a game with friends but aren't good with port-forwarding dont waste your $1 on this game. INPROVE YOUR MULTIPLAYER SYSTEM!!",
            "review_score": "-1"
        },
        {
            "review_text": "Any game one can enjoy with ones friends is an awesome game. Adding Dinosaurs to that just makes it even better.",
            "review_score": "1"
        },
        {
            "review_text": "The game is very much like day of defeat, but with a change to class on the axis team.",
            "review_score": "1"
        },
        {
            "review_text": "Nazi-dinosaurs, I don't know how much pot they smoked to come up with this concept but it's awesome and you should never need anything else.",
            "review_score": "1"
        },
        {
            "review_text": "Dinosaurs, Nazis, Guns... What more can you ask for?",
            "review_score": "1"
        },
        {
            "review_text": "just dont buy it m8 ITS NOT WORTH ı bought on the sale i still refunded it",
            "review_score": "-1"
        },
        {
            "review_text": "Ok, at the time that im writing this ive only played 16 minutes and I LOVE THIS GAME! I am realy into history during the WWII era and i thought this game looked fun I DEFINTLY RECOMEND THIS GAME! Update: In my first game I had aready played with a devoloper! I think that shows devolopers care about the game.",
            "review_score": "1"
        },
        {
            "review_text": "Incredibly fun! It has a great mix of Dinosaurs and Humans. Who you choose depends on the map, as some characters are better on some maps than others.",
            "review_score": "1"
        },
        {
            "review_text": "Really involving. It was the most playable game in shooter categorie. I liked it even more than CS XDD  All these dinos showed me another perspective of shooting",
            "review_score": "1"
        },
        {
            "review_text": "I only wish more people played this online...",
            "review_score": "1"
        },
        {
            "review_text": "Goats goata love them XD",
            "review_score": "1"
        },
        {
            "review_text": "Taught me that we made the dinosaurs go extinct.",
            "review_score": "1"
        },
        {
            "review_text": "This game is dope, it runs smooth on older computers and i can see myself still playing it when i upgrade.",
            "review_score": "1"
        },
        {
            "review_text": "Really nice 1$ game the multiplayer is pretty fun with friends.",
            "review_score": "1"
        },
        {
            "review_text": "This game is addicting. Absolutely addicting. They keep the dinosaurs super cool and accurate, and the quality of this game is quite high. I love it so much.",
            "review_score": "1"
        },
        {
            "review_text": "you can eat nazis and use their bodies as bowling balls",
            "review_score": "1"
        },
        {
            "review_text": "Dino's + Nazi's, What could go wrong?",
            "review_score": "1"
        },
        {
            "review_text": "This game is unbalance, has bad balancing on teams, and has small playerbase. But it's still a ♥♥♥♥ ton of fun to play with friends cuz it's just a continues ♥♥♥♥ show.",
            "review_score": "1"
        },
        {
            "review_text": "Ok, at the time that im writing this ive only played 16 minutes and I LOVE THIS GAME! I am realy into history during the WWII era and i thought this game looked fun I DEFINTLY RECOMEND THIS GAME! Update: In my first game I had aready played with a devoloper! I think that shows devolopers care about the game.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, plan to get a lot more hours into it.",
            "review_score": "1"
        },
        {
            "review_text": "Historically accurate, helped me with my History Test! Haven't seen my grade yet, but i'm sure it's good with this historically accurate game!",
            "review_score": "1"
        },
        {
            "review_text": "Extremely inaccurate depictions of all dinosaurs. Clearly Nazi propaganda",
            "review_score": "-1"
        }
    ]
}