{
    "app_id": 7000,
    "name": "Tomb Raider: Legend",
    "release_date": "2007-03-29",
    "developer": [
        "Crystal Dynamics"
    ],
    "publisher": [
        "Square Enix"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 16,
    "categories": [
        "Single-player",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "Action",
        "Female Protagonist"
    ],
    "achievements": 0,
    "positive_ratings": 1656,
    "negative_ratings": 243,
    "price": 4.99,
    "description": "Follow Lara Croft down a path of discovery as she travels the globe to remote, exotic locales in search of one of history's greatest artifacts, that unleashes unwelcome figures from Lara's mysterious past.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/7000/header.jpg?t=1556061799",
    "minimum_requirements": "Microsoft Windows 2000, XP, Pentium 3 1.0Ghz or Athlon XP Equivalent, 256MB RAM, 100% DirectX 9.0c -compatible 64 MB 3D Accelerated Card with TnL (GeForce 3Ti / Radeon 9 series), Microsoft Windows 2000/XP compatible sound card (100% DirectX 9.0c -compatible), 9.9GB free disk space, 100% Windows 2000/XP compatible mouse and keyboard Recommended: Pentium 4 2.0Ghz or Athlon XP Equivalent, 512MB RAM, 100% DirectX 9.0c -compatible 256MB 3D Accelerated Card (Nvidia GeForce 5900 / Ati 9800XT), Microsoft Windows 2000/XP compatible sound card (100% DirectX 9.0c -compatible), 9.9GB free disk space Optimal: Pentium 4 3.0Ghz or Athlon XP/64bit Equivalent, 1GB RAM, 100% DirectX 9.0c -compatible 512 MB 3D Accelerated Card (Nvidia GeForce 7800 / Ati X-1800)",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Probably the most loved of all Tomb Raider games. Her popularity declined after Tomb Raider: The Angel of Darkness, but Legend for sure brang her back to the top.   With 5 million copies within the first year, this is one of the best Tomb Raider games, revolutionary and a great come back for the iconic Lara Croft.",
            "review_score": "1"
        },
        {
            "review_text": "very awesome adventurous game! highly recommended , the storyline continues perfectly in the franchise. no dissapoint here. amazing girl , amazing graphics , amazing atmosphere , amazing killing boys and hideous creatous. takes alot of strategy and is so worth it! :)",
            "review_score": "1"
        },
        {
            "review_text": "Tomb Raider Legend- Its a beautiful game with a really immersive story and dialogues. Most of the things about it are great, the tombs,puzzles,world interaction but the combat system is awful. There is a small number of animal enemies and the shooting process feels like a task. The weapons are dull and usual and the human enemies have a terrible AI.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "Such a great game. This migh not be as great as it is for the old Tomb Raider players, because this game was the first version made by Crystal Dynamic with major of changes in the Tomb Raider game. However, in Tomb Raider: Legend you will be able to see more moves of lara, more weapons and also an awesome grafic of the natur. And the soundtrack is still amazing just like the old Tomb Raider game's sountracks. I would strongly recommend you all to buy and try it. You will need to use your brain well to finish this game. But don't worry. It's not all about maze. You will see more action and bike riding too.",
            "review_score": "1"
        },
        {
            "review_text": "Guilty pleashure, but still a pleashure.",
            "review_score": "1"
        },
        {
            "review_text": "The game is a lot of fun with some more or less tricky riddles to solve, although the quick time events are a bit too easy. Tomb Raider legends has a really good and moving story about Lara Croft, her parents and some friends of the past.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty much one of my favorite Tomb Raider games. Have if for both console and pc . It was sort of a fun and 'lighter' part of the series. Puzzle solving is the best part of the game in my honest opinion. Combat is a lot shaky but nothing too overbearing. All in all good game and a good price for a classic. Hope for a HD version.. maybe... cross fingers.",
            "review_score": "1"
        },
        {
            "review_text": "One of my first real games I used to play on the good old PlayStation 2. The annoying thing about the Steam PC version is that the controls are severely wonky.",
            "review_score": "1"
        },
        {
            "review_text": "Love the TR series!",
            "review_score": "1"
        },
        {
            "review_text": "i have always loved this game. It's easy to play, the rewards are ... rewarding. The unlockables are exciting.",
            "review_score": "1"
        },
        {
            "review_text": "Tomb Raider: Legend has the sole honour of being a game that I've bought three times now, on three different platforms, and 100%'d three different times. I've yet to regret it.  Legend remains largely unchanged from it's original incarnation on the sixth generation, a fact which contributes to just what a fantastically optimized port it is. Honestly, stunning. 1 Ghz compatible? Other developers could take notes. Ran suberbly on my 1.8 Ghz toaster of a laptop, though for obvious reason it did mean having to forgo the visual changes added as the game was ported to seventh generation consoles - which range from relatively minor lighting adjustment to complete foliage overhauls. It's menu-toggled.  There were more than a few glitches - ranging from moderately amusing (floating rocks in Nepal) to moderately annoying (Lara refusing to grab ropes, plummeting to her death as she phases through them), and the game isn't lying when it says Partial Controller Support, but on the whole the experience was seamless.  Tomb Raider has you control Lara Croft in her quest for some contrived MacGuffin, spurred on by some event in the past and important because they say so, damn it. It's not the most compelling plot, and lacks the spectacle or involvement you'd get from an Indiana Jones or Librarian film.  That the antagonists; Rutland, Amanda, and Takamoto, are barely given any screentime to banter with Lara before being unceremoniously killed off doesn't help. Of more note are the support characters, Alistair and Zip, and Lara herself, all of whom give wonderfully entertaining performances. In one case their brilliant spurious dialogue alone manages to elevate an otherwise okay level to one of the best in the game.  Variety-wise, the levels are all incredibly distinct from one another, while the enemies are unfortunately not as much. The platforming mechanics are serviceable, and for the most part responsive, but incredibly underused; the best platforming level remains Croft Manor, a completely optional area. Likewise, the combat mechanics with the various kicks, bullet-time triggers, and grapples are all well and good, but almost completely unused in combat. It's a sad waste of potential.  Of note are the bosses, that take advantage of the mechanics to some degree instead of pretending that the game is something it's not. They're not particularly memorable, but none are less than on par.  It's a short game, incredibly short - if you haven't got a head for puzzles expect a good 7 hours, otherwise expect something closer to 5. Perhaps preferable to overstaying its welcome, but completely understaying it isn't fantastic either. The one billion unlockables they've managed to fit into the game help to counteract that - from concept art to outfits (hearkens to a day when they weren't just DLC, ey?) to model viewers and cheat codes, there's plenty there to play with.  Best puzzles are all saved for completely optional content - that is, grabbing the gold tokens. These legitimately involving puzzles (unless it's Nepal in which case it's hidden under some unremarkable ledge. Gorramn Nepal), which often require breaking previous puzzles, are all infinitely gratifying, and would be more so if the game didn't expect you to have a near-psychic amount of knowledge as to where they are before you even begin messing around to get to them.  Seriously, don't be ashamed to look up a hintbook or something to get even a vague idea of where they are. It's ridiculous.   With all this fairly good, there's some inexcusable bad. The QTEs are bad. The 'developer hints'; the frustratingly slow camera cuts to completely obvious platforming sections in completely linear levels that every sixth generation platformer had, are bad. The physics puzzles that expect you ignore how physics work - in one case assuming that a 90 pound girl like Lara can send deliriously heavy metal cubes rocketing into the sky with the help of a medieval see-saw - are bad.  But overall, Legend's saving grace is that it's extremely easy to play.   Everything from the writing, to the combat to the puzzles is designed solely for you to enjoy it and have fun. If you're up for a completely undemanding fun ride, to be completed with rocketing ease and satisfaction, then Tomb Raider: Legend is a game to look into.",
            "review_score": "1"
        },
        {
            "review_text": "This is a Brillient game :D ",
            "review_score": "1"
        },
        {
            "review_text": "Tomb Raider: Legend is the second of two games I bought last year in order to play through this seminal franchise of 90's era gaming before the 2013 'reboot' came along and destroyed the franchise forever. The first game - TR: Anniversary - was quite fun and enjoyable. TR:L however, was one of those experiences where I was fighting to stick around long enough to finish the game.  What TR:L does right is capture the essence of Lara Croft as a character and the platforming Tomb Raider does best. Lara in this game is perfectly portrayed as the confident and over-sexed adventurer we all know her as. Additionally, by this game's 2006 release, they had expanded the game locales from the eponymous tombs to skyscapers and military bases, to name two. Inserting Lara into these locales worked well, without too much juxtaposition of having an archaeologist run around modern sites.  The gameplay - particularly the platforming - is spot-on. It's a simple yet effective set of moves for Lara, you rarely feel that the controls are at fault when things turn to tears. This game is the classic example of sticking with what works, even in the face of more complex and more advanced modern gameplay. You grab stuff, you swing from things, and you jump around. Simple. It works.  But the problems with this game lie deep. Principally, I began to speculate as I got further into this game that it was developed independently by two different development teams: a platforming team and a combat team. The so-called platforming team did this game justice, as previously mentioned. This combat team however, is where things fall apart. Combat in Tomb Raider has never been my favorite thing. I still think that a pure platforming and environmental puzzle version of Tomb Raider would be the best game in the franchise. The combat really shows its inadequacies in the boss encounters. Just like in Anniversary, they are disjointed from the rest of the game. You will spend lots of time alone navigating a puzzle or whatever at your own pace, then all of a sudden a boss appears and the game throws arbitrary time constraints at you and asks the player to control Lara in ways that are not at all consistent or even to be used again within the rest of the game. In fact, the last boss was so infuriating I didn't even bother to try to beat it again after I was thoroughly trounced by it. By that point after almost 2 full games of this I had had enough. This disjointed back and forth between platforming and combat is in my opinion what makes these Tomb Raider games only good games and not great.  Secondly, the in-game radio between Lara and her intel people got completely out of hand. Lara would get frequent mission updates and story narrative from this two-way radio communication. I get that using that game mechanic is a great way produce a narrative in the game without having it be forced in through cut-scenes or whatever. Some games have even mastered it, think Cortana in Halo: Combat Evolved. But here in TR:L it was just too much, too frequently and in my opinion not all that important to the story. That sense of isolation in these expansive tombs is what was sorely missing in this title. Being able to solve a puzzle at your own pace with only your thoughts to guide you is the essence of good single-player puzzle platforming in my opinion.   So my two game Tomb Raider project ends here. TR:L wasn't horrible, but I would've been mad as hell if I paid fifty bucks for it on release in 2006. If you put a gun to my head and said I could only ever play one of these two titles - Anniversary or Legend - I would immediately say Anniversary is the way to go. Legend just has too many flaws to make the run through it worthwhile.",
            "review_score": "1"
        },
        {
            "review_text": "If you are new to tomb raider series or want to play this series for the first time just play this one forget the rest. The only true tomb raider is this one which is truely a legend. why? Because it is not affected by COD system ( no health pack + health regen ) and also it has boss fight at the end of each level which makes it more like metal gear solid games. Full of thinking and brain challenge and puzzles, the story is awesome however it continues in Anniversary and ends in underworld but if you want my advise do NOT ever touch those because they are worthless. the only and only Tomb raider which worths playing is Legend which is truely a LEGEND! what i love the most about this game is the sound tracks",
            "review_score": "1"
        },
        {
            "review_text": "Yes, this game is good, but (don't tell anyone) I really bought this because of Lara Croft. Being a straight high school student, I can't help but find her very attractive. And yes feminists, her independence and strength makes her even more attractive.",
            "review_score": "1"
        },
        {
            "review_text": "Just like all the Tomb Raider games (Except for the new ones) it's PERFECT.  It has simple graphics,so anyone could really run this,and it has alot of epic cutscenes and quick time events. It's also one of them PS2 classics,which is another reason why you should buy this amazing game.  I give it a 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "Oldie, but goodie. It has PS2 graphics, but you can add some 'next gen' filters and the game looks like the remaster version for the PS3. Gameplay is great, classic Tomb Raider but with good controls. And btw, despite the demo being unplayable with a pad, the full version works great with a 360 controller.",
            "review_score": "1"
        },
        {
            "review_text": "I had fun playing the game even doh it's older. But it doesn't have allot of gametime and the real saving I downvoted it, is the saving. What's the point of saving a game if it doesn't save, once again the Save Bug. I do recommend buying it onsale.",
            "review_score": "-1"
        },
        {
            "review_text": "F is for friends who do stuff together U is for you and me N is for anywhere and anytime at all down here in the deep blue sea",
            "review_score": "1"
        },
        {
            "review_text": "There's tombs.",
            "review_score": "1"
        },
        {
            "review_text": "i never played this game",
            "review_score": "1"
        },
        {
            "review_text": "I am not recommending purely to be the devil's advocate. The graphics are still OK by 2015 standards and gameplay is fine and consistent with the newer Tomb Raider titles. My first gripe, as with many people are the awful controls that let you down often. Especially the final battle it is so hard getting Lara to do anything. Another gripe is the nature of some of the puzzles. A good puzzle is where you know what needs to be achieved and need to go about finding a way to get there. Some of the puzzles in Legend are not really puzzles in this way. You sometimes have no idea what you are trying to achieve and only have a few interactable elements to play with. You basically just work things together until something happens. On saying this, this game is certainly worth a few bucks and provides several hours of fun.",
            "review_score": "-1"
        },
        {
            "review_text": "The game would be good, but the PC port is full of glitches, bugs and crashes. The controls are terrible.",
            "review_score": "-1"
        },
        {
            "review_text": "OH. MY. LANTA. WORST MOTOCROSS GAME I EVER PLAYED, WHERE IS THE TOMB RAIDER?",
            "review_score": "-1"
        },
        {
            "review_text": "Best tomb raider because you try to get THE EXCALIBUR! i mean you even get to kill your friend from your childhood at the end oh yeah and spoiler",
            "review_score": "1"
        },
        {
            "review_text": "As far as adventure games go, it's average. The dated graphics make it really hard to take seriously.",
            "review_score": "-1"
        },
        {
            "review_text": "While not quite as good as Anniversary (more linear, with less interesting puzzles), I'd be lying if I said that Legend isn't a ton of fun. It's also the first game in the franchise that finally got rid of the tank controls, and pretty much instantly perfected Lara's movements.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good.",
            "review_score": "1"
        },
        {
            "review_text": "Upon finishing TR anniversary for the second time around, I decided to finally play Legend. Turns out that Legend, Anniversary and Underworld form something of a trilogy or at least Legend and Underworld form a story and Anniversary gives a little more background story.   As for Legend, I enjoyed it more than Anniversary. There is more of a focus on action and 'doing stuff' rather than collecting ammo and finding secrets. The story is where it's at though, that's also a main focus in this game.   Graphically, for a game that's nearly 10 years old, it's nothing to write home about, 10 years ago though, it would have been pretty nice looking. They've enhanced it for PC, turn on the 'next gen' features and the game looks pretty ok, with some nice lighting, water and shadow effects, makes the game almost pretty decent to look at. There are the occasional annoying graphical glitches.   Sound, guns pack a punch, voice work isn't tacky but it can be pretty grating some times. The one liners from the cast are lame....sometimes you think to yourself ' I KNEW they were going to say that' .   Gameplay, puzzles are almost too easy, so easy you don't think of the most obvious solution because you're expecting something a bit harder from the TR series. The gunplay can be quite fun if you mix it up with more than just shooting stuff. Oh also, you don't have much of a choice in weapons.   One thing that carries over to Anniversary also is the annoying 'trajectory' jumping issue. You THINK you are lined up properly for a jump, there's no way you could possibly miss the target or jumping from one ledge to another, make the jump and fall to your death. Then once you attempt the same jump, all of the sudden it works. It's frustrating and annoying thinking to yourself ' BUT I JUST JUMPED DIRECTLY TOWARDS THE FREAKING LEDGE!!! ' Dark souls eat your heart out. Using either a keyboard and mouse or controller won't make a difference either.   You can bust through this in only 10-12 hours if you're only doing the story and not the rewards. All in all, it's a good addition to the series and I'd personally recommend playing this alongside Anniversary and Underworld seeing as the stories are related.",
            "review_score": "1"
        },
        {
            "review_text": "so addictive, only snnoying thing was the boss battles omg",
            "review_score": "1"
        },
        {
            "review_text": "If you like your Tomb Raider, old school, with lots of falling to your death and shooting exotic wildlife in the face, this is for you. It's a bit short but it's not expensive. Plays nice with an Xbox360 controller. I recommend turing off the 'Next Gen' features. If you look in the discussion threads, you can find a patch but even then, it's too glitchy.  Brace yourself for inconsistent collisions. You can shoot through some fences, but not other, identical fences. The shooting was never Tomb Raider's strong point but for a 2006 game, it feels a little like a Dreamcast game like Dynamite Cop. That's not necessarity a bad thing.  The story is pretty lousy. I kind of zoned out, to be honest. There are some quicktime action sequences which are rather pointless. There are serious bugs all over the place so you may have to refer to a walkthrough here and there.  But even with all it's flaws, if feel just a little bit like Tomb Raider 2 and that's enough for me to recommend it.  ",
            "review_score": "1"
        },
        {
            "review_text": "Although it has some awesome locations,great,not overcomplicated puzzles and it's graphics really put on an astonishing atmosphere feeling,I cannot recommend this game for random players.It's camera (which causes 80% of deaths),tedious combat encounters and random crashes make it a quite mediocre game.However,if you enjoyed previous TR games like the sixth or fifth ones then pick it up.",
            "review_score": "-1"
        },
        {
            "review_text": "Beautiful reboot. Beat this on Xbox and 360. Bought it again for old times.",
            "review_score": "1"
        },
        {
            "review_text": "Review by xTzharkz [Eric].  Tomb Raider: Legend. I loved it! After playing Tomb Raider IV this felt like heaven. Smooth gameplay nice voice acting, great story. Great game!  Okay lets go more into details now.  The story was built up nicely. Kept me intrested + the ending, made me want to know what next game is going to offer, if it is going to contiue the story. But I don't want to spoil anything so I leave it like that.   Gameplay was smooth, it did have few glitches but other movement worked great. I do not recommend to play on Hardest difficulty tho - which I did. In my head the harder the difficulty is the more fun I will have - due to challenges, but I ended up getting stuck, cuz I was not able to kill the enemies - little health packs - getting lot of damage. It was not that I was bad it but it was built up really poorly. Luckily after 2 hours of trying I manage to do it. So yeah better play either on easy or normal. It won't make the game any better when playing on hard. Trust me.  The puzzles in this game were not that hard. But I think the challenges this game offers pretty much fills the cap. What I mean are time trials, secrects. Also you can run around in house and look for secrets. How cool is that!?  Graphics were perfect! They had improved ones as well in the settings but I think the original ones were better. Lara Croft looked beautiful, sounded great and had awesome moves. Later on can change also outfits that will get unlocked by finishing the collections and trials. Biker outift... So sexy.  Anyway. I recommend the game! Go try it out. I think it was worth it.   xTzharkz [Eric]",
            "review_score": "1"
        },
        {
            "review_text": "Note: I've actually played for couple of hours, they don't show there because I had to add the game as an external game to have Steam overlay and controller working in-game.  Compared to the rest of the series it's all run and gun with practically endless arsenal supply, most of the secrets are a joke and the game is totally linear. There is little sense of exploration. The motorcycle driving part(s) (I don't know if there are more than one, 1 was enough for me) are completely pointless as you can hardly call holding the shoot button gameplay.   I consider myself a TR fan and I really wanted to play this for the plot but it's just too much of a different game compared to Anniversary or the original series. At least I'm saving this one for the last.",
            "review_score": "-1"
        },
        {
            "review_text": "It is a really fun game but it can be a little bit glichy",
            "review_score": "1"
        },
        {
            "review_text": "One of the best Tomb Raider games. Lots of action and fun, also a very good pc port from earlier consoles.",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite TR games. I really enjoyed the gameplay, levels, little puzzles and it's a hell of a lot more graphically pleasing than the classics. Loved it!",
            "review_score": "1"
        },
        {
            "review_text": "This is the quintessential Tomb Raider game, in my opinion. Indiana Jones meets James Bond; a note-perfect mixture of exploration and action.  The voice acting is solid, and the soundtrack is a cut above. The visual design remains inventive and impressive, even as the graphics themselves age incrementally in the years since 2006.   Recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Legendary game...",
            "review_score": "1"
        },
        {
            "review_text": "Has to be close to the best graphics 2006 can offer. I like the fluid play, and controls that I wasn't really expecting from an older TR game. Check my opening vid on it, and give me likes :-) :csgogun:",
            "review_score": "1"
        },
        {
            "review_text": "A very good fun playable Tomb Raider game.",
            "review_score": "1"
        },
        {
            "review_text": "Upon finishing TR anniversary for the second time around, I decided to finally play Legend. Turns out that Legend, Anniversary and Underworld form something of a trilogy or at least Legend and Underworld form a story and Anniversary gives a little more background story.   As for Legend, I enjoyed it more than Anniversary. There is more of a focus on action and 'doing stuff' rather than collecting ammo and finding secrets. The story is where it's at though, that's also a main focus in this game.   Graphically, for a game that's nearly 10 years old, it's nothing to write home about, 10 years ago though, it would have been pretty nice looking. They've enhanced it for PC, turn on the 'next gen' features and the game looks pretty ok, with some nice lighting, water and shadow effects, makes the game almost pretty decent to look at. There are the occasional annoying graphical glitches.   Sound, guns pack a punch, voice work isn't tacky but it can be pretty grating some times. The one liners from the cast are lame....sometimes you think to yourself ' I KNEW they were going to say that' .   Gameplay, puzzles are almost too easy, so easy you don't think of the most obvious solution because you're expecting something a bit harder from the TR series. The gunplay can be quite fun if you mix it up with more than just shooting stuff. Oh also, you don't have much of a choice in weapons.   One thing that carries over to Anniversary also is the annoying 'trajectory' jumping issue. You THINK you are lined up properly for a jump, there's no way you could possibly miss the target or jumping from one ledge to another, make the jump and fall to your death. Then once you attempt the same jump, all of the sudden it works. It's frustrating and annoying thinking to yourself ' BUT I JUST JUMPED DIRECTLY TOWARDS THE FREAKING LEDGE!!! ' Dark souls eat your heart out. Using either a keyboard and mouse or controller won't make a difference either.   You can bust through this in only 10-12 hours if you're only doing the story and not the rewards. All in all, it's a good addition to the series and I'd personally recommend playing this alongside Anniversary and Underworld seeing as the stories are related.",
            "review_score": "1"
        },
        {
            "review_text": "Great title. It ia a nice and relaxing game with fantastic music. Good banter among the characters too. I have played this game on three seperate occasions over 8 years so that says something about how special this game is. Harks back to a simpler time in games where there were no apy walls nd game were not trying to be 'arty' or 'edgy' but just fun",
            "review_score": "1"
        },
        {
            "review_text": "Like Tomb Raider: Anniversary this is one is kinda hard to recommend but I'm only doing so because I found enough enjoyment and challenge out of the game to do so.  Controls are FAR better than the old school Tomb Raider games and movement feels much quicker. The core game play is largely still the same however - risky platforming, a few puzzles, and the dual pistols. Combat was fairly worse in my opinion however and for a tomb raider game there is A LOT of it.   The core issues with the combat comes from a few factors:  (1) Only one extra weapon to use than pistols, which you pick up from humans. Just use assault rifle ALL THE TIME. SMG isn't as strong or accurate and the shotguns range is pathetically short its useless in most situations. (2) 95% or so of the enemies are generic humans with guns. Running out of ammo for your secondary weapon is very uncommon and their AI is essentially to stand in one spot and shoot. (3) Uninspired boss fights. They are mostly shoot and dodge until a brief window opens up to use some gimmick such as a turret, shooting a platform, or swinging a grappling hook at a clearly pointed out object. Most of them are not hard at all and were not that fun.  Graphically it isn't anything spectacular but for its age it's fairly solid. There are FAR less bugs than Anniversary but there is one pain in the butt bug you will run into a couple of times that is more or less guaranteed to happen and it will crash your game. Just a heads up to get around this: reload the game, go to settings, turn off the next gen graphics option, play past the part that crashes, then re-enable the setting.  So between the crash bug and the often repetitive combat why do I recommend it? Because I still found it interesting enough for a play through. HOWEVER one caveat to that - I generally enjoy tomb raider games. Always did growing up and for the most part still do. If you're not a tomb raider fan and you are not planning on playing the sequel to this (Tomb Raider: Underworld), chances are you won't want to get this unless its on sale for cheap.",
            "review_score": "1"
        },
        {
            "review_text": "This is much more linear than the old TR games but it I found the story and gameplay enjoyable despite that. +The levels are varied, the puzzles make sense and Lara controls fluidly. You can also set the difficulty to easy if you don't like fighting enemies and want focus on the puzzle and story aspect. +There is a checkpoint system so you don't have to worry about saving a lot. -There are motorcycle sections that are cringe-worthy but only two of them so it doesn't kill the whole experience.  Fun game overall. Would recommend to anyone interested in the series or the basic premise.",
            "review_score": "1"
        },
        {
            "review_text": "My favourite Tomb Raider game. Simply fantastic.",
            "review_score": "1"
        },
        {
            "review_text": "Tomb Raider: Legend blows the 2013 reboot out of the water. It has actual puzzles, challenging platforming (in comparison), treasure-hunting which requires you to think, combat that's both somewhat fun and rare enough that it doesn't become a bore, and above all it stars the actual Lara Croft rather than some angst-filled crybaby. I had vague memories of playing TR: Legend at a friend's house as a child and liking it, but upon rediscovery it surpassed all my expectations. This is a good damn game.  The game does somewhat suffer from a pair of tedious vehicle sections and I found that some three or four areas were so bug-ridden as to be nearly unplayable. There's also apparently this bug that gives you a Fatal Error while starting the Kazakhstan chapter unless you turn off a bunch of stuff in the graphics menu. That I'm willing to overlook such normally unacceptable flaws only speaks to how much fun I had with this game. At the point of this writing, the game is only 2 eurodollars in the Steam Store for a solid 8-14 hours of fun. Go on goyim, buy buy!",
            "review_score": "1"
        },
        {
            "review_text": "Tomb Raider: Legend blows the 2013 reboot out of the water. It has actual puzzles, challenging platforming (in comparison), treasure-hunting which requires you to think, combat that's both somewhat fun and rare enough that it doesn't become a bore, and above all it stars the actual Lara Croft rather than some angst-filled crybaby. I had vague memories of playing TR: Legend at a friend's house as a child and liking it, but upon rediscovery it surpassed all my expectations. This is a good damn game.  The game does somewhat suffer from a pair of tedious vehicle sections and I found that some three or four areas were so bug-ridden as to be nearly unplayable. There's also apparently this bug that gives you a Fatal Error while starting the Kazakhstan chapter unless you turn off a bunch of stuff in the graphics menu. That I'm willing to overlook such normally unacceptable flaws only speaks to how much fun I had with this game. At the point of this writing, the game is only 2 eurodollars in the Steam Store for a solid 8-14 hours of fun. Go on goyim, buy buy!",
            "review_score": "1"
        },
        {
            "review_text": "Remember playing this back when it came out with my Dad and brother. We went through it together and I'm happy to be playing it again after all these years.",
            "review_score": "1"
        },
        {
            "review_text": "Besides the game somewhat crashing every now and then, the game offers some pretty cool cliche shoot em up action .",
            "review_score": "1"
        },
        {
            "review_text": "Even more action than in Anniversary, wasn't received too well by fans, but still a great game.",
            "review_score": "1"
        },
        {
            "review_text": "Great game! A bit short, but I almost enjoyed every second of it. Sometimes the camera angles are a bit annoying, but the environments look very pretty (like Nepal and Bolivia) and the story is also easy to follow in my opinion.",
            "review_score": "1"
        },
        {
            "review_text": "still holds up today as a great action adventure. 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Amazing! One of my favourite games of all time!",
            "review_score": "1"
        },
        {
            "review_text": "Battle Tigers! Battle Panthers! Battle... Walls! This game is good. It has the original Tomb Raider Style, yet doesn't get too [TombRaider2013-ish] with it's gameplay. My Rating: 7/10",
            "review_score": "1"
        }
    ]
}