{
    "app_id": 7010,
    "name": "Project: Snowblind",
    "release_date": "2007-03-29",
    "developer": [
        "Crystal Dynamics"
    ],
    "publisher": [
        "Square Enix"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "FPS",
        "Cyberpunk"
    ],
    "achievements": 0,
    "positive_ratings": 175,
    "negative_ratings": 61,
    "price": 3.99,
    "description": "Experience the dramatic intensity of the frontlines of a war through the eyes of the first of a new breed of super soldiers in this gritty and epic first-person action game. An augmented super-soldier must stop a renegade regime from eradicating the civilized world. Hong Kong, 2065. 2nd Lt.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/7010/header.jpg?t=1447351002",
    "minimum_requirements": "IBM PC or 100% compatible, Microsoft Windows 2000/XP, Pentium IV, 1.5 GHz (Or AMD Athlon XP equivalent) processor, 100% DirectX 64 MB 3D Accelerated video card with Pixel Shader v1.1 Capability, 256 MB System RAM, 100% DirectX 9 Compatible Sound Card, 3GB free uncompressed hard drive space (additional space may be necessary for saved games), 100% Windows 2000/XP compatible Mouse and Keyboard As stated on the Project: Snowblind box, laptops and integrated video chips may work with Project: Snowblind, but are not supported. Should you incur problems while running the game on an integrated video chip, Eidos Tech Support will not be able to help you. Recommended: Pentium IV, 2.4 Ghz (or AMD Athlon XPequivalent) or greater processor, 512 MB System RAM, 100% DirectX 9 128MB 3D Graphics Card with Pixel Shader 2.0 support, 3GB of Hard Drive Space Supported Video Chipsets: nVidia GeForce 3Ti/4Ti/FX/6000 series - Note: GeForce MX series is NOT SUPPORTED. ATI Radeon 8500/9xxx or higher.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Project: Snowblind was initially a Deus Ex game, before later being turned into a new IP after the poor performance of Invisible War, and it doesn't do a very good job of hiding the fact. You play as a soldier who was forced to become nano-augmented after suffering heavy trauma in a battle, and fight for a peace-keeping group called UNAT- no, wait, I mean the 'Liberty Coalition'. There's a character who acts as your commander who is mechanically augmented, and frequently laments that he's become outdated. The items all look like they were taken straight from Deus Ex, like the energy cells and health kits, and you fight a lot of familiar enemies like bipedal mechs and mechanical spiders. Even the hacking tool is named after the ICEbreaker hacking interface from Deus Ex.  However, it's probably for the best that it never ended up being released as a Deus Ex game. In many ways, this game is sort of like the Bioshock Infinite of Deus Ex, right down to replacing the actual hacking of the real games with a gun that you shoot at panels to instantly hack them. Rather than being an RPG with shooter elements, Project Snowblind is a full FPS. There are no wide open maps or choices to make, just enemies to shoot and objectives to move towards. The game does a loose job of allowing both shooting and stealth playthroughs, but the stealth half is pretty horribly done and not all that viable. The radio contact in the game is also somewhat schizophrenic about this; in one particular mission where you have to get up a few levels of a parking garage, he initially contacts you to tell you that it might be a good idea to sneak through it due to high guard activity, then almost immediately tells you that you might be able to cause some real chaos with one of the vehicles in the next room, only to go back to telling you that stealth might allow you to listen in on guards' conversations on the next floor. You get a handful of augmentations throughout the game, but instead of being able to choose which ones you get or being able to upgrade them, the game just hands them out as you progress, using the same story justification as the reason they later used in Human Revolution. The game doesn't feature very many characters, and while the few it does feature aren't bad, they're barely used, and after you first meet them they tend to disappear until they're needed for a dramatic moment. The story in general is pretty poorly paced, and you fight the final boss of the game about 3/4 into the game. The game is also pretty short, only lasting around 6 hours. The game also has a tendency to crash, particularly when you minimize it, which is a problem since due to being a console game, you can only save in designated save rooms rather than having a quicksave or even checkpoint system.  On the other hand, as long as you can see it as its own game instead of a Deus Ex main game, it's a pretty fun shooter. It's interesting to see it as a spinoff where you play as just a semi-regular member of not-UNATCO instead of 'that guy who single-handedly unravels an Illuminati conspiracy', and while the stealth is generally awful, the shooting is done pretty well, and the weapons and their secondary functions are all pretty fun to use. While it does have a lot of faults if you compare it to Deus Ex itself, as a standalone game it's pretty fun, and it's only $6 at its base price and presumably much less on sale. It's interesting to try out, if only to see the lost Deus Ex game that almost existed. If you do decide to buy it, be sure to check out the widescreen patch on pcgamingwiki if you have a widescreen monitor.",
            "review_score": "1"
        },
        {
            "review_text": "This is an incredibly fun single player FPS experience that combines powerful guns with unique secondary fire options and augmentations that remind me a lot of Deus Ex. It's not a terribly long game, but the journey to the end is fun and each new gun and power up makes you feel more like the powerful superweapon you are. The pistol's secondary fire is mini rockets. If that doesn't make you want to get this game I don't know what will.",
            "review_score": "1"
        },
        {
            "review_text": "I first played this game during the golden age of the Xbox. Lots of fun guns, gadgets and powers help you crush the dissident forces of General Badguy and help save Neo Hong Kong. The game runs well on my system (Win10) without any compatability modes or SysAdmin settings. Just don't alt-tab out of it, otherwise you'll get to crashing. If the game fails to load because it 'can't find steam' just copypasta the steam.dll from your Steam root directory directly into this game's folder. There is also a widescreen patch that you can get, just Google that for 16:9 goodness. The graphics can look a little muddy with higher resolutions, but your Nvidia/Radeon control panel can help alleviate that. I grabbed it for super cheap during Summer Sale 2016, but the game is well worth full price. If I were to compare this to a newer game, it would best be compared to Singularity... a cool gimmick, fun gameplay, and definately underrated. Final score: 9/10 JC Dentons.",
            "review_score": "1"
        },
        {
            "review_text": "The main character is not blind, and there is no snow in the game.",
            "review_score": "1"
        },
        {
            "review_text": "Although quite cheap and mildly entertaining, the game suffers from three major flaws:  * It's dated. * It's not THAT entertaining or challenging. * It' s horribly unstable, randomly crashing to desktop for no reason.",
            "review_score": "-1"
        },
        {
            "review_text": "Great fps game from the days of ps2 and gamecube. 7/10",
            "review_score": "1"
        },
        {
            "review_text": "Played this through to the end I actually own two copies (one retail) thx to a steam sale. It's worth playing and a lot better then it lets on. I had fun.",
            "review_score": "1"
        },
        {
            "review_text": "does multplayer still work for this game or no?",
            "review_score": "1"
        },
        {
            "review_text": "Well made, glitchy on newer computers. Can't get the sound to work for some reason.",
            "review_score": "1"
        }
    ]
}