{
    "app_id": 70120,
    "name": "Hacker Evolution Duality",
    "release_date": "2011-08-15",
    "developer": [
        "exosyphen studios"
    ],
    "publisher": [
        "exosyphen studios"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Indie"
    ],
    "tags": [
        "Indie",
        "Hacking",
        "Simulation"
    ],
    "achievements": 9,
    "positive_ratings": 176,
    "negative_ratings": 298,
    "price": 0.79,
    "description": "Hacker Evolution Duality is the hacking simulation game, developed by exosyphen studios. Based on the successful Hacker Evolution game series, it has been completely redesigned to offer an impressive and new gaming experience.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/70120/header.jpg?t=1447354299",
    "minimum_requirements": "OS: Windows XP/Vista/7  Processor: 1Ghz CPU  Memory: 1Gb RAM Hard Disk Space: 100 Mb  Video Card: OpenGL compliant video card  DirectX®: 8.0  Sound: DirectX compliant sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I bought this game really cheap, but free is the only fair price for it. It is really bad.  First of all it starts on my second display which is my TV, took a while to realize it.  Second, there is a bug where you can't read messages (gives some file not found error), apparently the dev knows about this since Jan or Feb or something and it still isn't fixed. There's a dude that posted some workaround with converting mp3 files to ogg and changing some text files around to make it work, this way you can actually read mission objectives.  The game it is kind of crap, it is not very intuitive what you need to do, in fact in the tutorial the AI hacked me down to 0 firewall and 0 integrity and I had no idea what would I need to do to counter it. Don't be mistaken by the name the game has nothing to do with actual hacking or IT skills, it's just a theme, so it's not about me not knowing what a computer is (I do, working since 15 years in IT).  I know now it's a rather old game and it's not a big financial loss to try it, but if I knew what I know now I wouldn't have paid even 1 euro for it. Angry birds is more fun and an actual game that works compared to this (I don't play angry birds, never undestood the fascination, it's a really stupid game).",
            "review_score": "-1"
        },
        {
            "review_text": "Marketing: THIS IS UPLINK BUT MORE FLESHED OUT  Actual game: THIS IS UPLINK BUT FRUSTRATING AND POORLY EXECUTED",
            "review_score": "-1"
        },
        {
            "review_text": "I've bought this game years ago driven by curiosity, to find out what it takes to be one of the most hated kind of people in the virtual world. Well, i've gained zero knowledge thanks to the gods, and uselessness of this product. To explain myself politely, this is not a game, but a mental warfare without the cold trace of fun. The music itself doesn't match with my style, some electronic stuff, tastes are so different between peoples, so i can't rate it but acceptable enough. The game itself lacks of game elements, we have 7 'maps' total, (which are nothing more but a desktop-like picture with a few dots named as servers) there are some crazy time limited memory games and thats all. You have to count down numbers in a box from 63 to 0 while enemy servers attacking you (rofl), and there is another component of the game which is totally the same... I was in hope for a patch which adds some more features/maps or something to the game, but no, everything remained the same. Even the Vsync bug, which makes the HUD buttons disappear after each match, because the game have no graphics options and you have to mess with your own video card to play the game. There are random crashes and i've also lost my profile with my savegames and achievement progresses because for some reason, no idea how. And what is the most surprising, perhaps the price, you still have to pay 20€ for this headache after years! If i truly regret wasting money on a product, well this is it. The honest price shall be around 0,5€, so try to find something else about this genre, go away and don't look back, avoid to get robbed. I don't like to downvote games, because it is basically a waste of time, but this must be serve as warning to all, to forget this game. Like what i try to do.",
            "review_score": "-1"
        },
        {
            "review_text": "  This game is a mess.",
            "review_score": "-1"
        },
        {
            "review_text": "Hacker Evolution Duality is a real-time strategy game where you use your movie-style hacking skills to steal money and complete objectives, complete with fake hacking graphics and sound.  I tried very hard to like this game. It's a slow-paced strategy, which I tend to like, but this game does everything wrong. I completed the tutorial level with no issues, then I found the second level impossible to beat, even on Easy. The tutorial is barely there, and help system points you to the non-existant game manual. The AI killed me several times, and when I tried to avoid invoking their wrath, one of the objective servers disappeared from the map in what I can only assume is a game-breaking bug. Of the two hours I played, almost all of that time was spent waiting for cooldown timers to reset. This game makes you wait a very long time for everything.  Avoid this game. Only the most hardcore of strategy enthusiasts will find anything of value here.",
            "review_score": "-1"
        },
        {
            "review_text": "Having played Uplink: Hacker Elite, I had high expectations. Didn't play this much though, as it seemed ♥♥♥♥♥♥. :(",
            "review_score": "-1"
        },
        {
            "review_text": "Web Browser game",
            "review_score": "-1"
        },
        {
            "review_text": "This is literally a point-and-click game. Nothing intricate. Just a series of clicks and you're done. That is, if you even understand what is going on, since the game gives very little instruction as to what on earth is even happening. Trash game.",
            "review_score": "-1"
        },
        {
            "review_text": "Awful game, very unrealistic and boring.",
            "review_score": "-1"
        },
        {
            "review_text": "I loved the first two Hacker Evolution games, but didn't enjoy this one very much. I found it far too difficult, and I couldn't really figure out what I was supposed to do. And it wasn't fun enough to make up for that, so I can't recommend this game to anyone who likes to play games that are, you know, fun.",
            "review_score": "-1"
        },
        {
            "review_text": "The other reviews sum things up very accurately, poor game with very little depth. Lots of clicking and frustration.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't be tricked, if you have played the old versions, this is seemingly nothing like it, too much going on in too many places, I loved these when I was a kid, A KID! Now as an adult.... I cannot enjoy it.... they changed it way too much. Not worth the nine minutes I've played so far, and definitely not worth $2.49!   They should give you the achievements for just buying it.... but they didnt cause they know themselves that you dont deserve them because you in fact paid money for this, and now deserve to rot in jail with everyone else who bought this. IF YOU PLAY THIS ENJOY HELL!",
            "review_score": "-1"
        },
        {
            "review_text": "Yeah, complete garbage. Not even mentioning, that you can 'die' in the game or how to prevent it is ♥♥♥♥♥♥♥t, plus this has NOTHING to do with hacking like irl...",
            "review_score": "-1"
        },
        {
            "review_text": "Played this game and got VAC Banned from everything, even eating. GG 10/10 - IGN",
            "review_score": "1"
        },
        {
            "review_text": "such a lovely game",
            "review_score": "1"
        },
        {
            "review_text": "Interesting game, but...it's only that. I played only 30 min. and i started to yawning. Too much repeating :(",
            "review_score": "-1"
        },
        {
            "review_text": "Why did I buy this?...",
            "review_score": "-1"
        },
        {
            "review_text": "Hack Hack Hack.... You have a world map... You can hack in many countries... Try to avoid to be spotted.... Be HACKER!!",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good idea for RTS game, but on the short side. It seems like there's a lot more they could have done to add replay value without too much effort.",
            "review_score": "1"
        },
        {
            "review_text": "it is a brilliant game but it dpesnt seem to fit my screen too well. i wish there was adjustable screen res options... help!",
            "review_score": "1"
        },
        {
            "review_text": "'Best jay's booter/loic simulator ever made' - Ominicient , hackforums owner  'yey i can deedaws woo' - Skid , hackforums user",
            "review_score": "1"
        },
        {
            "review_text": "Unplayable on Linux.  - Crashes on the end of level. Impossible to proceed  - Messages disappear after few seconds (reports missing file)  - Same problem affects sound    Devs released fix for Win version on Dec 8th, but nothing for other OSs. Not worth the price, actually waste of money.",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty fun cant even beat the first level tough, got a 3 pack and a dlc for like $1.40 so im happy",
            "review_score": "1"
        },
        {
            "review_text": "This game was very interesting by the loks of it but after the tutorial i noticed a few flaws in the game like the action bar where the firewall and hacker buttons are just dissapear. i believe this game coujld be great if it had a touchup and a good lookover at the game",
            "review_score": "-1"
        },
        {
            "review_text": "bad game click and click and click.",
            "review_score": "-1"
        },
        {
            "review_text": "Dull and monotonous puzzle. Not more than",
            "review_score": "-1"
        }
    ]
}