{
    "app_id": 70210,
    "name": "Governor of Poker 2 - Premium Edition",
    "release_date": "2010-10-11",
    "developer": [
        "I Sioux Game Productions B.V."
    ],
    "publisher": [
        "Youdagames"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Casual",
        "Simulation",
        "Adventure"
    ],
    "achievements": 0,
    "positive_ratings": 147,
    "negative_ratings": 29,
    "price": 14.99,
    "description": "Show them all, the Governor is not to be trifled with! Where have you been all those years? Lots of things have changed. Cities have grown, new people arrived... It’s all good, but some things cannot be accepted just like that! Howdy! Finally it’s there, Governor of Poker 2!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/70210/header.jpg?t=1447353592",
    "minimum_requirements": "OS: Windows 98SE, 2000, ME, XP, Vista Processor: Pentium III, 1200 MHz Memory: 512 MB RAM Graphics: 16 Mb  video card DirectX®: 8 or later Hard Drive: 90 MB Sound: onboard soundcard or soundblaster",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Lets get this straight. I don't play poker or any other games similar to that in real life nor did i ever like the idea of playing. But:  +This game is awesome! Firstly i got it on sale for 5euro (Premium Edition). +Easy to learn even for noobs like me. (Has a full tutorial about poker) +Its not JUST poker..its poker with Storyline! +Combines the storyline and buying stuff(hats for your character,houses for rent) with the thrill of playing a card game. +Has achievements which even for me are fun! +Time passes nicely   -No multiplayer :(",
            "review_score": "1"
        },
        {
            "review_text": "I LOVE THIS GAME!!! BEST POKER GAME EVER!",
            "review_score": "1"
        },
        {
            "review_text": "Looking at my time played you would guess this is an awesome game. It really could be, but the poker engine is so flawed at it's core that I find myself playing terrible poker to compete with terrible AI. So much so that my RL game suffered.  It's extremely addicting though, right up to the point where you just can't play it anymore without screaming in frustration. Good thing I got it on sale, as I'd be REALLY annoyed had I dropped 20 bucks on it.",
            "review_score": "-1"
        },
        {
            "review_text": "all the towns are pink now :D 10/10  EDIT : NO ACHIVIMENTS OR CARDS ? 0/10",
            "review_score": "1"
        },
        {
            "review_text": "A truly funny casual game. Learn how to play poker and beat them all.  Its quite addicted with nice enviroment. Sometimes bad card or playing may make you explode.",
            "review_score": "1"
        },
        {
            "review_text": "I need more chips.",
            "review_score": "1"
        },
        {
            "review_text": "Very good for all Poker Players. You can really feel Texas and play original Texas Holdem Poker :)",
            "review_score": "1"
        },
        {
            "review_text": "Playing cards with friends is convivial. Gambling with meaningful stakes is tense and (to some) exhilirating. Playing cards against a machine for imaginary money is neither. To make up for that deficiency, a computer poker game needs to add a lot of bells and whistles. Governor of Poker 2 tried to do that with an investment mechanic and hats to unlock and a few other extra features. For me, it still wasn't quite enough to counterbalance the tedium of slowly playing cards against a collection of uninteresting opponents represented primarily by oversized hats.",
            "review_score": "-1"
        },
        {
            "review_text": "Favorite Poker game of all-time! I love everything about this game and I will never stop playing it. Played it when it appeared on a game website I used to play on and had to buy it. You should try this game out!",
            "review_score": "1"
        }
    ]
}