{
    "app_id": 7110,
    "name": "Jade Empire™: Special Edition",
    "release_date": "2007-02-27",
    "developer": [
        "BioWare Corporation"
    ],
    "publisher": [
        "BioWare Corporation",
        "Electronic Arts"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Partial Controller Support"
    ],
    "genres": [
        "RPG"
    ],
    "tags": [
        "RPG",
        "Fantasy",
        "Story Rich"
    ],
    "achievements": 0,
    "positive_ratings": 809,
    "negative_ratings": 279,
    "price": 8.99,
    "description": "Step into the role of an aspiring martial-arts master and follow the path of the open palm or the closed fist. In this multi-award-winning action-RPG, your choices and actions will determine the fate of the entire Jade Empire. Will you prevent the destruction of this beautiful land, or will you crush it beneath your heel?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/7110/header.jpg?t=1447350976",
    "minimum_requirements": "Windows XP, Pentium 4 1.8 GHz or AMD Athlon 1800XP, 512MB RAM, 8 GB Free HD Space, DirectX 9.0, NVIDIA GeForce 6200 or ATI 9500 or better (Shader Model 2.0 required), 100% DirectX 9.0 compatible sound card and drivers. Recommended: 3 GHz Intel Pentium 4 or equivalent processor, 1GB RAM, DirectX 9.0 February 2006, ATI X600 series, NVIDIA GeForce 6800 series, or higher recommended.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This game right here is the #1 game that I believe deserves a sequel. There's so much content to this game. It still holds up well even about a decade later. If you like story rich games, memorable characters, martial arts, Asian mythology/fantasy, or culture, I highly recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "A link between Knights of the Old Republic and Mass Effect. A rather simple and quick ARPG, Jade Emprie satisfies mainly on its story and setting. The fighting system is very run-of-the-mill button mashing, and the skill system is not very interesting. However, for fans of BioWare and RPGs, there is enough here to satisfy.",
            "review_score": "1"
        },
        {
            "review_text": "Why bother selling a game that doesn't launch from Steam? Also I refuse to hack this to get it to work, should run on a modern computer in Windows 10 or don't f..king sell it.",
            "review_score": "-1"
        },
        {
            "review_text": "Jade Empire is without a doubt a very good game. It stands, however, very firmly, as a mid-point between Bioware's other landmark titles: Knights of the Old Republic and Mass Effect. It is very recognisable as a spiritual successor to the gameplay style of Knights of the Old Republic. On the other hand, you can see much that would go into Mass Effect being developed in Jade Empire. It says more than anything about Jade Empire that I could not write a paragraph in review without mentioning Bioware's other two excellent titles.  The characters and their development, the storyline, and quite frankly the world developed around them, simply doesn't live up to the heights generated by the other series mentioned herein. It perhaps helps with immersion that I was a Star Wars fan prior to playing Knights of the Old Republic; but Mass Effect's dramatic introduction of an entirely new universe was simply amazing and Jade Empire achieves nothing of the sort. It is a nice world, more densely populated than Knights of the Old Republic which makes it feel more immersive. But unfortunately it just does not stand out. It is not particularly memorable, and there is virtually no reason at all for the game to be open-world (when it does open up). If you are thorough, there is literally no reason to return to places you have visited in the past in Jade Empire, and that is rather unfortunate.   It is an aging game, so the graphics look a little dated at this point but you can still see that for their time they were quite pretty and it does not in any way impact the enjoyability of this title. The gameplay is also quite interesting, very fast-paced and there are a really wonderful array of fighting-styles that your character can learn. Slightly unfortunate, however, is the loss of the ability to play as other characters at will, which was a welcome feature included in Knights of the Old Republic.   All in all, this game is definitely worth looking into, especially for fans of Bioware's other excellent RPG titles. I have been rather critical in this review but it is only because Bioware has soared so much higher in other outings and with so much potential it is rather unfortunate that Jade Empire failed to achieve these expectations. Nonetheless, I still consider it one of the better RPG games I have played and would recommend giving it a shot. 8/10.",
            "review_score": "1"
        },
        {
            "review_text": "I bought Jade Empire when I found it in a bin for exactly 2 euros. Years later I bought it again on steam for another 2 euros. All I can say is: money well spent.   A lot of people will tell you that Jade Empire is Bioware's weakest game. When you measure any rpg up to Knights of the Old Republic or the original Mass Effect, chances are your perspective is going to be a bit disadvantageous for Jade Empire. This isn't star wars, and this certainly isn't mass effect, but it is a unique game that has all the makings of greatness.  I was bummed out in Knights of the Old Republic when I learned that the combat would be dictated by a D&amp;D dice roll system. This is the kind of uncertainty I hate, the kind of unrefined gameplay that has absolutely no excuse to exist in the modern world. Jade Empire does away with that and gives you live action, direct, fist to face combat. It has aged like a biscuit though. It is tough, rigid, and unrefined by todays standards, but a step up from the roulette style gameplay from Knights. Combat is fun for while, but you'll quickly find yourself looking for ways to dispatch your foes as fast as possible. The game offers various options. Martial Arts allow you to attack your enemies with your bare knuckles and are generally effective against all enemies. Elemental Styles allow you to throw fire or ice (bending if you will) at the cost of chi. Various weapons are very effective against humans, but useless against spirits. Support styles allow you to set up your enemies for a finishing blow. And at a hefty chi price there are the transformation styles that allow your to morph into a being of pure awesome to obliterate your foe. There is plenty of choice for you to customise your style, and the game gives you a fine world to flaunt your skills.  Jade Empire is set in an oriental world. Full of references to Chinese, Japanese, Indian and Bhuddist mythology. If you have ever watched Avatar: the Last Airbender then you should get the idea. There aren't many games out there like this and Bioware has done a great job at crafting a world that looks the part. This is the nice thing about Jade Empire. You'll want to walk around and talk to people, help them (or ruin them, you know the drill). In the end though you'll still be after the same thing thing: Saving your master. You play a martial arts student, whose life is uprooted when a secret orderer invades your hometown and kidnaps your master. Que the hero music and get to it.   It is a shame Jade Empire has ages so poorly. The controls are fluent as a beached whale, and the character models are not always as polished as they could be. Still, its universe and setting are unique and if you like a decent RPG of westen make then do not hesitate to get this.",
            "review_score": "1"
        },
        {
            "review_text": " Short version: 76%",
            "review_score": "1"
        },
        {
            "review_text": "A fun game that could've been so much more in my opinion Pros +Fun Combat Styles (Thousand Fists, Toad Demon) +Plenty of choices +Fun parallel between Open Palm and Close Fist(not just evil vs good) +Nice Chinese Atmosphere +Diverse Areas Cons -Overlly Linear(In my Op) -Combat system can be too easy (Jade Golem Op) -Endings Lack Meaningful Diversity -Too few areas (Around 10 Zones) -Too Short in general (Prob one of the if not the shortest Bioware game out there) 6.5/10 If only this game would get enough attention for a sequel",
            "review_score": "1"
        },
        {
            "review_text": "This is by far one of my favourite games, up there with Orcarina of Time and Halo: Combat Evolved. Armed with a fantastic storyline that keeps you hooked till the end and awesome gameplay, this is a must have for RPG lovers.   HOWEVER  This game is way too broken on steam. So much so that even if you can make it work, there are multiple points in the game that break and render it unplayable. Unless you can fix it yourself, buy it on console instead.",
            "review_score": "-1"
        },
        {
            "review_text": "If you like Dragon Age and Mass Effect then this game is something for you.  Made by BioWare, this game somewhat goes under the radar and is probably just as underrated. It offers a boat load of different companions which are charming and quite hilarious. I'd recommend normal diffculty since the hardest available might cause quite a bit of frustration, I had to find that out myself.  In the end you will have been on one hell of an adventure.",
            "review_score": "1"
        },
        {
            "review_text": "'Failed to find Steam.' I've read a thousand ways to fix it, but I'm not really computed savvy enough to do it. Waste of money.",
            "review_score": "-1"
        },
        {
            "review_text": "I loved this game when I played it on the original Xbox. Now I can't imagine why. It has possibly the worst combat and camera controls of any game I've ever played.   During combat, some button presses are often delayed by a few seconds. If you begin a combo and then try to dodge, it will complete the combo before dodging. Often so much time has passed between when you press the dodge button and when you actually dodge that you may no longer want to dodge. But you will. Oh yes, you will. The same goes for if any enemy is hitting you. You will wait for the enemy to finish THEIR combo before you dodge/attack. Basically, the combat is very stilted and unresponsive.   The camera is perhaps even worse. It's understandable given the age of the game and the hardware it was developed on that the camera would be somewhat limited. You can only tilt the camera up, not down, and the camera movement is very imprecise. That's all forgiveable. What is not forgiveable is how the camera behaves in combat. If you are fighting near a wall the camera will tilt at odd angles preventing you from seeing what is going on. This becomes especially annoying when you are fighting in a small room. You may be fighting blind 75% of the time.  There are other issues with the game, as well, such as the invisible barriers that surround you during battles, the stilted dialogue, the overly simplistic RPG elements (there are only three attributes), and the fuzzy cutscenes.  I just can't recommend this game, which is a pity. I really did love it on Xbox. Kind of makes me question the judgment of past me.",
            "review_score": "-1"
        },
        {
            "review_text": "I've played through this game about 3 or 4 times and I say get it and play it if you haven't and you like Bioware or RPGs in general. This is a fantastic game to start out with if you're new to Bioware. It's a new world with a great combat system. Fantastic story and AMAZING combat system. Unfortunately the combat system is very easily breakable (I won't say how) with the ability to stun lock whole groups of enemies (and even the final boss) and just get a load of free hits. You will NOT take damage after a certain point if you get the 'right' skills.  Yeah this review is short because all I can say is get it, the game is great but the combat is a bit exploitable. Buy the game, go exploit it and have fun your first time thru feeling like a kung fu god! Then man up and try it for real tee hee",
            "review_score": "1"
        },
        {
            "review_text": "Good story (little short) Rare setting Its a ealy action-rpg from bioware, consider a proto-mass effect",
            "review_score": "1"
        },
        {
            "review_text": "I am so glad this game came out on steam! I have been a fan of bioware games since KotoR. I bought this on x-box when it first came out and every now and then I break out my old xbox to play. Now I won't have to do that and to be honest my old xbox is running on it's last leg.   I haven't played much of the game since getting it on steam but it is pretty much the same. The special edition does offer at lease one new character if my memory is right because I don't remember monk zeng from the original. The graphics seem to have gotten a bit of an upgrade too. When it first came out I have no idea if it was on pc or not but the graphics are 100x better than what they were on xbox.   Noww all that said I do have to say I do agree with other reviews that the game is technically 'broken' and should be fixed if steam is going to continue to sell it. But the broken feature is really easy to fix. I ran into two problems when trying to play. First the game kept telling me it couldn't find steam. This was an easy fix by copying the steam.dll file in the steam folder and pasting a copy in the Jade Empire folder. After that the game still crashed on start up. So I had to rename the launcher as JadeEmpire_BACKUP and rename another .exe file as JadeEmpireLauncher. It wasn't hard at all and the istructions I found online were much more helpful than this review. While it was a minor inconvenience it isn't enough to stop anyone from getting this game. Totally worth it to play one of the best games bioware has put out!",
            "review_score": "1"
        },
        {
            "review_text": "Definitely one of the best RPG games I've played in a while.",
            "review_score": "1"
        },
        {
            "review_text": "A good old classic worth getting.",
            "review_score": "1"
        },
        {
            "review_text": "Back in the day, while I knew about KOTOR, I didn't know about this game until a friend told me about it. Once it became available on Steam, I bought the game, and I didn't regret the purchase.  It is not every day that you run across a western RPG that feels like an old school Kung Fu epic. The setting gets a lot right to have you feel comfortable in the world. The game gives you a decent variety of protagonists and being a Bioware game, romance options. Combat is solid, and I'd say works better than KOTOR. I'd even say that the graphics hold up well given the age of the game.  I think anyone who is a fan of Bioware's RPGs should give this game a chance.",
            "review_score": "1"
        },
        {
            "review_text": "The fact that you have to move files around to get this to run, then run a config program, and then the game doesn't even run well makes me really regret not reading the reviews before I bought this. On the original Xbox this game was amazing, if you're looking for that great game look somewhere else other than steam.",
            "review_score": "-1"
        },
        {
            "review_text": "I will start with finally got this to open with a couple simple changes on Windows 7 pc, several sources had partially correct info. I am posting the details on what worked for my win7 prem 64 bit pc. ONE: Open notepad with 'run as administrator' save blank doc in your Drive Dir: SteamLibrary&gt;SteamApps&gt;common&gt;Jade Empire&gt;data ... as the name SystemInformation.xml change to 'all files' instead of text. 'S' &amp; 'I' must be capital. Run steam app as administrator as well. Boom game runs, no crashing.",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed the setting and atmosphere of Jade Empire; the game takes place in a fantasy land based on the Orient. The characters are fairly engaging and there's some good development there, with some nice branching the player can choose. Not quite as deep as Mass Effect, but good nonetheless. Voice acting was well-done and the story itself proved satsifying.  However, the graphics are a bit dated and the combat itself a tad underwhelming. Fighting was too easy and once you grasp the fairly basic system there's really no way you should ever die even though I played the game with a controller (configuring the controls were a bit of a minor inconvenience in the beginning)  Overall a good game, 8/10, and certainly deserves a sequel. I definitely recommend buying the game if it's on sale, 15$ is asking a little too much given the age of the game.",
            "review_score": "1"
        },
        {
            "review_text": "Jade Empire is one the best games on the original Xbox. Unfortunately, the PC port is terrible.  The user interface is low-resolution and looks absolutely horrendous, the controls are poorly translated for the mouse &amp; keyboard but even if you attach a gamepad it doesn't work as it did on the original Xbox. Instead they have modified the control scheme to be more like a first-person shooter despite the fact that you never need to aim in this game.  If you're in it for the story, the game is a fantastic journey. That said, be prepared for terrible controls and technical issues across the board. This is a terrible port of an excellent game.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game, the 'gamebreaking' bug is easily fixed by downloading a file and putting it in your jade empire folder.",
            "review_score": "1"
        },
        {
            "review_text": "If you like Knights of the Old Republic, get this!",
            "review_score": "1"
        },
        {
            "review_text": "This is a borderline positive recommendation, for a number of reasons.  The story as a whole is good, but dissapointing. It is a very predictable story. You are a student to a great, but unknown master with a dark past that wants to keep you safe until the hand of destiny itself sets you on a path to restore balance in the empire. There is a twist that feels telegraphed and a bit of mystery surrounding one of the characters that gives itself away before you're even two hourse in, if you're paying attention. It is short, but in this case it's a good thing, as the story is so generic it would feel like wading through a pool of undried cement. At just about 25 hours, give or take, it paces itself rather well and is coherent, but for a game with conversation options, it's extremely linear, especially once you enter the fortress. The biggest let down is the conversations. Each conversation you are given a number of lines you can choose which amount to nothing unless it's an obvious good vs. evil type of choice. Each character you speak to reacts almost the same way and says the same things regardless of your answer, with some exceptions with the three romance options (two per gender). Also, every important character that you encounter more often than once will repeat themselves almost endlessly. In one conversation I had with the Water Dragon, she told me the same thing no less than seven times, to the detriment of my already dying brain.  The combat is, well, annoying. On one hand it's dynamic, keeping you involved in every fight, which is a good thing. On the other hand it's repetitive and even outright annoying. Your attacks have this bothersome ability of knocking back the enemy you are attacking just out of reach of your next attack, unless you pin them to the edge of the fight zone. Fast styles are almost hands down superior to any slower style because each attack interrupts your enemy (unless they are a massive enemy like the toad or elephant demons or the jade golems). The mechanics of each enemy, while interesting at first become a nuisance the further you go into the story, especially ghosts. There is one mini game (thankfully) in the game, but I won't go into it as you can effectively skip all of it unless you want to finish a character's quest line. The other ones are useless, or next to. The redeeming quality is the game's companion characters. For a short game they are rather one dimensional but interesting enough to last you the first half of the game after which you won't get anything more than remarks out of them, with the exception of your romance option. They will comment as you adventure and then when you all group up again will act like they were just then hearing about what was happening for the first time. However, they are colorful and fit very well within their one dimension, fleshing it out very well.   I understand that the review seems rather negative, but I rather enjoyed the game, with some glaring exceptions. Jade Empire is akin to that somewhat annoying dinner guest, who is pleasant enough company but you can't quite wait for them to leave, as much as you might wish to feel otherwise.  Overall this is a game that, in my opinion, desperately needs a sequel to redeem itself. I recommend it, but only barely. If you are looking to play an action game with a modicum of morality and interaction, this would fit quite well, but if you are looking for an actual rpg, this would not fit that bill",
            "review_score": "1"
        },
        {
            "review_text": "Interesting game, but full of bugs. Won't recommend.",
            "review_score": "-1"
        },
        {
            "review_text": "Cannot find steam error. It won't even launch! I want my lunch money back!",
            "review_score": "-1"
        },
        {
            "review_text": "If you like RPGs and you like Bioware this is the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "The Steam version is broken. If you somehow manage to fix all the numerous problems with the game to even get it running, you can't fix the missing mouse cursor which makes the game immensely frustrating and ultimately unplayable. If you already bought it, you should seek refund immediately.",
            "review_score": "-1"
        },
        {
            "review_text": "How do i even review this steaming pile of poop? Not only did i have to jump through hoops just to play it, it was laggy the controls were unbearable and about 10 minutes into it crashed and it won't reopen. DONT BUY THIS!!!",
            "review_score": "-1"
        },
        {
            "review_text": "do not buy will not work",
            "review_score": "-1"
        },
        {
            "review_text": "Too dated to be worth your time, unless you have a lot of patience, of course.",
            "review_score": "1"
        },
        {
            "review_text": "I had to mod the game files just to get it to launch. After that pain the framerate was so poor combat was almost imposible. Not to metion it crashed a few times before Icould getout of the tutorial. Unless you are really deicated to playing jade impire, ( its a great game if you can astualy play it) I would give this a pass. Its not worth $15, unless its ever on sale for less then $10 avoid this game, there are far beter indi games for $15.",
            "review_score": "-1"
        },
        {
            "review_text": "Does not run on windows 8 without going through a tedious amount of fixes.",
            "review_score": "-1"
        },
        {
            "review_text": "Mixing the excellent combat systems and story telling Bioware is famous for, Jade Empire tells an astounding story in this grand epic of mysticism, plot twists and morality all based in feudal china. A high recommendation from me.",
            "review_score": "1"
        },
        {
            "review_text": "Still a great game though a bit buggy on steam. After installing on windows 7 it requires you to create a xml file, the game won't start otherwise. When this is done you can enjoy a great game, visually a bit dated but story-wise strong",
            "review_score": "1"
        },
        {
            "review_text": "'Unable to find Steam' solution : Steam.exe HAS to be ran in Admin mode - If experiencing further problems, I've also set all of the executable files for the game itself to 'Windows XP SP3' Compatibility. You may still require further setup if running 64-bit or have installed Steam outside of its default path - Adding the correct path to your Steam folder in Environment Variables under Control Panel should fix this problem.",
            "review_score": "1"
        },
        {
            "review_text": "for all these people claming the game is broken there is a simple fix that i will post in this comment because i got the cant find steam problem and when i did this it worked just fine and it saves u all are welcome in the future:)     If the config tool fails to launch with a 'Can't find Steam' error message, simply restarting Steam should fix that. If the issue persists or the config tool freezes at one point while gathering system information on your first launch, try the following; Locate the JadeEmpireConfig file in the game's Steam folder (usually found at C:\\Program Files (x86)\\Steam\\steamapps\\common\\Jade Empire) Right click, select properties, select compatibility and set it to compatibility mode for Windows Vista SP2. If this fails to fix the freeze, you must do the following; Using notepad, create a blank text file. Name it SystemInformation.xml and save it in the data folder inside the Jade Empire folder (usually found at C:\\Program Files (x86)\\Steam\\steamapps\\common\\Jade Empire\\data). Copy the Steam.dll file from the base Steam folder (C:\\Program Files (x86)\\Steam) and paste it into the Jade Empire folder (C:\\Program Files (x86)\\Steam\\steamapps\\common\\Jade Empire - NOT the data folder). Information This will effectively bypass the config tool which should allow you to launch the game.",
            "review_score": "1"
        },
        {
            "review_text": "I very mediocre game. There are no interesting mechanics and a so-so story. If you want a so-so version of Knights of the old republic set in feudal China, then this game may be for you. You could do worse for $5 on a Steam sale.",
            "review_score": "1"
        },
        {
            "review_text": "Great!",
            "review_score": "1"
        },
        {
            "review_text": "  It's the only Bioware game I've ever been able to enjoy, because something about it is just different and refreshing right down to the settings, story,and characters. I loved it when it first came out and I still love it now.",
            "review_score": "1"
        },
        {
            "review_text": "game ending glitch",
            "review_score": "-1"
        },
        {
            "review_text": "Jade Empire is a bioware RPG from their pre-EA glory days. It has the light/dark side morality and similar dialogue systems to KotOR, but thats where the similarities end. Its a solid game with more of an action based combat system. The setting is a mythical china, heavy on gods, spirits and martial arts.  A warning though, it can take some tweaking to get it to run in windows Vista, 7 or 8",
            "review_score": "1"
        },
        {
            "review_text": "Bioware does oriental rpg better than oriental chaps.  ♥♥♥♥♥torm ensues. Weaboys cry and rage.  Who cares.",
            "review_score": "1"
        },
        {
            "review_text": "Hell yes I reccomend this, it's the KOTOR no one knew about.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game, I just don't love what I have to do to get it to run. Bioware has allowed this game to be released on Steam without insuring there is no issues with it running on Windows 7 and 8.",
            "review_score": "1"
        },
        {
            "review_text": "This game was when Bioware use to be in its prime It has kung fu, it has choices, it had a great story. and More kung fu. If you haven't played this play it NAO you will not regret the untold hours of adventures. A true classic. Sure the graphics is outdated, but that doesn't beat a great game with a great story. Lots of oriental themes here.",
            "review_score": "1"
        },
        {
            "review_text": "This game wonderful example of Bioware's talents before they united with EA and an awesome game if you can get it running. I have played this on the original Xbox and I did have a copy on PC before it was stolen. Thankfully a friend got me this awesome game for Christmas but unfortunately it refuses to work on Windows 8.1 without a LOT of messing around.   I am going to have to give it a thumbs down simply for the fact that I had to fiddle with it for ages to even get it working. I know it was cheap in the Steam sale but that is no excuse for this not running on today's hard and software. It should not be up for sale if it can't work on current PCs. I doubt there are any plans for them to update this game to stop the problems.",
            "review_score": "-1"
        },
        {
            "review_text": "If you are a big fan of games that do not work on modern pc units and love the idea of being unable to find any official way to play this game on your pc then this game is for you. Bioware really ♥♥♥♥ the bed on this port and it should be criminal that Steam can sell a game that does not work on most pcs without significant file delving. Complete ripoff. Don't bother. The game itself on the other hand is great I just hope the team responsible for this port were fired from the company. Bioware and Steam both should be ashamed of themselves for this blatant ripoff.",
            "review_score": "-1"
        },
        {
            "review_text": "aaah, Jade Empire. I had fond memories of this game, because a friend had it on his Xbox(the original). Back then I loved the game, but I never finished it, so when this game was on sale, I bought it immediately. Is it really as good as I remembered?  short answer, yes.",
            "review_score": "1"
        },
        {
            "review_text": "Wanted to play this way back in the day but never had an original xbox, was as sick as i thought it would be kung fu kotor the best kotor",
            "review_score": "1"
        },
        {
            "review_text": "I've owned this game on Steam for a long time. In fact, next to Rag Doll Kung Fu, it may have been one of my earliest steam purchases.  I still find myself going back and playing through the game--the combat interface is easy and intuitive, and the storyline is extremely engaging. The graphics are naturally a bit dated by today's standards, but they aren't so bad that they detract from the gameplay.  One word of warning: The game was written in 2005, and won't work properly under modern OS's. I had to go through a lot of hoops to get the game up and running on my Windows 7 box. It was worth it to me, but it may not be worth the trouble for someone who doesn't already love the game. ",
            "review_score": "1"
        },
        {
            "review_text": "This could had been a masterpiece, But sadly, it isnt. It gots its moments,aided by a nice soundtrack, some clever writing, and some strong companions, but is pestered by oversimplistic systems, and lack of ambition in geral. I had a good time nonetheless.",
            "review_score": "1"
        },
        {
            "review_text": "honestly, I kind of wish they expanded on this. it's that good of a story. if I remember right, this came around sometime shortly before KOTOR-2 came out (and we all know how 'that' turned out...) but even still with that coming around, this game still got attention. it's in-depth story &amp; progressional expositions &amp; transitions, it's (at the time) dynamic graphics. it's got some limits on it's action &amp; play-through variety, but you have to understand that this game is dated, around the time some while after KOTOR-1 came around, this type of game was new and experimental. and this game shows sign of that stage. but even despite that, it still stands out. even the endigs were perfect for the story. it was pretty strong on it's own rights, I really wish they expanded on this project &amp; came out with another game, either a sequel or a stand-alone. If you like RPG stories with a good depth &amp; development, with decent visuals &amp; intricated styles (even in vintage degree like in this case) this game you will be interested in. but if you're not willing to grasp the concept of all pointed out in this review, and rather go for a more action-packed &amp; up-to-date RPG, this msy not be a game for you, I would suggest to go for something like the latest FABLE, or Elder Scrolls. now there is a small complication that seems to be the case for many people who want to download this game, and it won't start up after you get it going. believe me, I have had the same problem. check the forums for this game. there, you'll find out how to make the game work. (it's worth it, this game is good)",
            "review_score": "1"
        },
        {
            "review_text": "you won't find a better rpg-with-consquences-martial-arts-fighting extravaganza on the pc. because there literally isn't another one. i loved this.",
            "review_score": "1"
        },
        {
            "review_text": "the fact that i cant even log on is a massive let down would really like a solution without having to go on to a dodgy website to download the other content   keeps saying cant find steam ..... so annoying",
            "review_score": "-1"
        },
        {
            "review_text": "Another amazing BIoware game. A lot like KOTOR gameplay wise. Pretty simple plot with no really super surprising plot twists but still very enganging.",
            "review_score": "1"
        },
        {
            "review_text": "Jade Empire is one of those must play games. This game is as good today as it was when it first came out. I will always come back and play this game every couple years, much like I do with KOTOR and KOTOR 2. The story is magnificent, the fighting mechanics are tight, and the characters are very interesting.  I highly recommend this game for anyone who's into Bioware RPGs.",
            "review_score": "1"
        },
        {
            "review_text": "While the luanching process of the game is annoying and buggy, once you get it going you will find this game to be one of the better written bioware  RPGs, I played it as a child, came back to it, and it's still just as rewarding as when I first picke dit up",
            "review_score": "1"
        },
        {
            "review_text": "I recently bought this during a steam sale, and I'm glad I did. even though the game is older, I really liked the story, the setting and the chracters. I always thought that bioware was really good at making compaion chracters and this is another title that shows that very well.",
            "review_score": "1"
        },
        {
            "review_text": "it is a really fun game. i recommend playing it with a controller.",
            "review_score": "1"
        },
        {
            "review_text": "Monks with supernatural powers, plus a great story that'll surprise you during the game. I highly reccomend this game to anyone who enjoys a good story in a game",
            "review_score": "1"
        },
        {
            "review_text": "Underrated and a ton of fun. A unique IP. I hope a sequel comes out. 8/10.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best early Bioware games. It's reminescent of Knights of the Old Republic, plays in a similar fashion, but the combat is much more engaging and action oriented. Plenty of styles to choose from, fitting almost any play style. Like hard hitting bruisers? Go White Demon. Like Fast, jackie chan style fighting? Go Leaping Tiger. Like speedy Bruce Lee? Go Ten Thousand Fists. Support, magical, weapon, martial and transformation styles all feel unique and work well, and there are plenty and plenty to choose from. Upgrade them to become more awesome, and use your spirit amulet to enhance your core stats. Followers help by either fighting along side you, or offering support. The only real downside is once you beat the game and learn the styles, it's a breeze and a half, but there's four difficulty settings, so even the most veteren player can have a challenege. If you like old Bioware style games, kung-fu action, a good story, moral choices and all around baddass awesomeness, this game is definitely worth getting.",
            "review_score": "1"
        },
        {
            "review_text": "Must play at least for Drunken Master style. :)",
            "review_score": "1"
        },
        {
            "review_text": "Interesting story and uniqe gameplay",
            "review_score": "1"
        },
        {
            "review_text": "Probably one of the most beautiful and deepest Bioware's rpgs ever made. Jade Empire is quite unique among PC rpg-s: It allows you to travel to a fantasy conceived ancient China and engage in a thrilling-deepest story with multiple choices, gorgeous scenery, absorbing figures of local mythology (spirits, demons, dragons etc), emotionally soothing specific music...ans great steampunk settings. To have the opportunity to change sword and bow (although some weapons can still be used), for the equally efficient asian bare handed combat style of choice is the dream of many players, fun, fast and challenging combat if you play it on grand master difficulty  ",
            "review_score": "1"
        },
        {
            "review_text": "Bioware really aced this one, in my opinion it was much better than Dragon Age 1 and 2, the fighting mechanics were very fluid and was far more than the hack and slash that DA is, each fight had merit and each strike you took against an enemy affected the enemy, I really wish they'd go back to doing this.",
            "review_score": "1"
        },
        {
            "review_text": "DO NOT BUY GAME WILL FAIL TO FIND STEAM UNLESS YOU REWRITE THE FILE PATHING AND EVEN THEN THE GAME CRASHES AFTER RUNNING A CONFIGURATION SETUP AT THE START OF THE PROGRAM ITS A WAST OF MONEY AND WILL MOST LIKEY NEVER BE FIXED BECAUSE ITS AN ELDER GAME AND THE NEW IP HOLDERS WILL NOT BOTHER TO UPDATE IT.",
            "review_score": "-1"
        },
        {
            "review_text": "If you want more Bioware in your gaming life, pick this guy up. I didn't like it as much as KoTOR, but it's still a lot of fun.",
            "review_score": "1"
        },
        {
            "review_text": "Fix your ♥♥♥♥ing game!!!",
            "review_score": "1"
        },
        {
            "review_text": "this a great u should play it",
            "review_score": "1"
        },
        {
            "review_text": "Highly recommend this game. Alot of people say there are issues but I have none. The story is great, the fighting was ahead of its time and the world is amazing.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, the nostalgia was strong with this one. Couldn't get it to launch at first, but a quick google told me how to get around this. Problem solved.",
            "review_score": "1"
        },
        {
            "review_text": "I wasn't very happy with the pc port but after a little bit of tweaking it's still the jade empire i know and love. The most underated game bioware has ever put out and home to one of the best video game villans and home to the amazing black whirlwind",
            "review_score": "1"
        },
        {
            "review_text": "older game, but great story that envelopes you and the fighting is fun and engaging",
            "review_score": "1"
        },
        {
            "review_text": "Knights of the Old Republic, but more asian.",
            "review_score": "1"
        },
        {
            "review_text": "Old School Bioware RPG. It has a moral choice system that actually somewhat works well with the setting and style. The story is fantasticly well done with just the right amount of cheesiness. The occasional Galaga style mini games break the pace just enough to enhance the rest of the gameplay. The game itself plays very much like KOTR in a very good way. Though of course, that's just my opinion.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Classic. Controls took a sec to figure out but very solid.",
            "review_score": "1"
        },
        {
            "review_text": "It hasn't aged as well as other games (it's very apparent that it was from the PS2 era), but it's still fun. If it's &lt;= $5, I think it's worth it. Not a very long game, so don't expect an epic.",
            "review_score": "1"
        },
        {
            "review_text": "This game is from Bioware's glory days. I can honestly say if you like Star Wars: Knights of the Old Republic then you will love this game. Good story, plot and kung fu action. What more could you want.",
            "review_score": "1"
        },
        {
            "review_text": "This isn't a bad game. I didn't really know that it was met with luke-warm feelings by gamers far and wide. I watched someone play it initially, and I thought it was pretty cool. It ran pretty badly on my computer, but the glitches aren't game breaking; mostly just a minor irritation as you would have to reload to get the game to work again. However, the storyline isn't uninteresting. The graphics aren't entirely bad. It was fun and I played it through pretty quickly - and the themes of the story are pretty neat (the ghosts being restless, the water dragon's powers, etc.). However, you don't get to know your team very well and the fact that only one of them can follow you around is a little bit of a bummer. You can't really customize your character at all and it felt kind of 'meh' to me, too. Still, worth playing if you can get it on sale and you can get it to work.",
            "review_score": "1"
        },
        {
            "review_text": "Considering the time and nature of the game, I would recommend in every aspect.. Except customizability of character, but with this said, most of it compensates for that in many ways. A jewel of it's time and a sad left-over project with no sequels.",
            "review_score": "1"
        },
        {
            "review_text": "I don't even care this was my ♥♥♥♥ on the original xbox and it's still amazing to this day.     ",
            "review_score": "1"
        },
        {
            "review_text": "So I know I do not have a whole lot of game time logged but I played this game a lot on Xbox and the PC port is great. I love this game. The story is outstanding and the game play is enjoyable. I am sure this game will not disappointed you",
            "review_score": "1"
        }
    ]
}