{
    "app_id": 71260,
    "name": "Space Channel 5: Part 2",
    "release_date": "2011-03-04",
    "developer": [
        "SEGA"
    ],
    "publisher": [
        "SEGA"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Partial Controller Support"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Rhythm",
        "Action",
        "Female Protagonist"
    ],
    "achievements": 12,
    "positive_ratings": 687,
    "negative_ratings": 89,
    "price": 5.59,
    "description": "Hey there, SpaceCats – meet Ulala, the grooviest reporter in the galaxy! She’s got attitude, and she’s got moves. Help her get the scoop on an unidentified Dance Troupe that has captured thousands of people and is forcing them to dance!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/71260/header.jpg?t=1522077186",
    "minimum_requirements": "OS: Windows® XP Processor: 3.0 GHz Intel Pentium 4 Memory: 2GB RAM Graphics: DirectX 9.0c compatible, NVIDIA GeForce 7300 series, ATI Radeon™ X1600 Video Card with 256MB RAM DirectX®: DirectX 9.0c Hard Drive: 1.8GB Hard Drive space Sound: DirectX 9.0c compatible Sound Card",
    "recommended_requirements": "OS: Windows® 7 Processor: 2.0 GHz Intel Core 2 Duo Memory: 2GB RAM or more Graphics: DirectX 9.0c/Shader3.0 compatible, NVIDIA GeForce 8800 series or higher, ATI Radeon™ X1900 Video Card with 512MB RAM DirectX®: DirectX 9.0c Hard Drive: 4GB Hard Drive space Sound: DirectX 9.0c compatible Sound Card",
    "reviews": [
        {
            "review_text": "michael jackson is in space  you get to dance with him  that's pretty much all the game is about as far as i'm concerned  also the music is really really good",
            "review_score": "1"
        },
        {
            "review_text": "CHU CHU HEY CHU  12/10   better than I remember, wish part 1 was available though. If you like a silly but challenging game this is for you.",
            "review_score": "1"
        },
        {
            "review_text": "Hot damn, it's West Side Story but in the far future and as Japanese as possible. In this utopian future, police and news reporters have fused into one mighty being like in Judge Dredd but instead of shootin people you dance.   It plays like Rhythm Heaven so you'd better have good timing and an ear for rhythm or the game will kick your ♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "I'm a musician, I have a very strong sense of rhythm (I'm mostly a drummer), and I find Space Channel 5 to be one of the most satisfying rhythmic experience. I don't know why, but replicating a beat I just heard has always been very appealing to me, and this is what this game is all about, whereas most rhythm games are about following some kind of score (like in Guitar Hero) or playing some weird minigames with arbitrary rules (like in Rhythm Heaven).   The game gives the player very little feedback on their inputs, so it can be hard for beginners, but once you master it, it's a real treat.",
            "review_score": "1"
        },
        {
            "review_text": "This game is so GOOD! As a fan of rhythm games, I really felt the difficulty was spot on. In the later game, I did sometimes just flat out pause the game just so I could scream 'WTF HOW DOES IT EXPECT ME TO DO THIS?!?!?!' but that's partially why I enjoy it.  The animations and the music are absolutely fabulous too. Also I give +100,000,000pts for Michael Jackson being in this game.",
            "review_score": "1"
        },
        {
            "review_text": "Simon says on crack. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Up down up down chu chu chu has a reflex response now. i scream.",
            "review_score": "1"
        },
        {
            "review_text": "Parappa the Rapper only better...",
            "review_score": "1"
        },
        {
            "review_text": "While at its core, Space Channel 5 is 'Simon Says, but done with rhythm', that hardly does justice to the massive amount of love of this unique Dreamcast title. Super stylish, full of personality, and all over the top - and yet also crafted very lovingly; the soundtrack is amazing, and becomes even more amazing when you realise the level to which the game subtly reacts to your play, adjusting its difficulty and music in response to your play. Easy enough to pick up, reasonably challenging to perfect, Space Channel 5 Part 2 is legitimately one of my all time favourite games.",
            "review_score": "1"
        },
        {
            "review_text": "Up chu, right chu. Down, hey hey! Love it!!! &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "You save the galaxy with your funky moves. Still not convinced? Two words: Waltz Battle. If you like rhythm games, you'll like this. If you don't like this, you're not a person. If you're not a person, I apologize for my rudeness and beg you to spare me when the Uprising begins.",
            "review_score": "1"
        },
        {
            "review_text": "Always been a favorite rhythm game of mine, ever since I was little! The music is super funky and the characters are interesting and fun.",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "great fun but hard to play with a keyboard because when you have you press things in quick sucession it seems to just not obey much better with a controller works perferctly infact. if you have no rythym this is not the game for you. my main problem is that sometimes the things you have to follow are so slowly put together that it is extremely hard to keep in tune the second boss is the main offender. but still great rythym game and great game in general 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Addicting music rythm game with Space Michael in it!",
            "review_score": "1"
        },
        {
            "review_text": "A weird colorful quirky cheesy rhythm/memory game. It's amazingly cheesy and weird, but in a good way. The gameplay is simple to get the hang of, but can be frustrating sometimes. It's short, but short and sweet. Overall, delightfully cheesy and bizarre and goofy and wonderfully weird. Well worth the price.",
            "review_score": "1"
        },
        {
            "review_text": "After 20 minutes of this I had the biggest grin on my face...I still cant stop giggling. Help.  chu/10 would recommend.",
            "review_score": "1"
        },
        {
            "review_text": "I am literally never not obsessed with this game.",
            "review_score": "1"
        },
        {
            "review_text": "Can't stop chuing and heying. Ulala is the Queen of rhythm... and upskirts.",
            "review_score": "1"
        },
        {
            "review_text": "&gt; people get abducted by weird japanese robots who for some reason love dancing &gt; have to dance in order to set them free &gt; don't know the controls &gt; fail horribly &gt; main character gets depressed &gt; got a fat white man and a black guy with an afro on my team &gt; have to dance even more &gt; 3 giant ♥♥♥♥ing robots appear out of no where who love to sing &gt; controls dont work &gt; ??? &gt; have to start all over again  best dancing sim ever created.",
            "review_score": "1"
        },
        {
            "review_text": "An incredibley fun rhythm game. While the game may seem very basic at first, the gameplay is just so satisfying thanks to the incredible soundtrack and just the fact that every level is so much fun and over the top. Even though the game at its core is simple, it never gets stale since it keeps throwing new and interesting situations at you. Sometimes I wish the game had more checkpoints though, since if you fail you may have to redo a large portion of the stage. It's not really that big of a problem though, and I really recommend this to anyone who likes rhythm games.",
            "review_score": "1"
        },
        {
            "review_text": "So I played this game and stuff, don't really know what happened but it was fun I guess. Also there were lasers.",
            "review_score": "1"
        },
        {
            "review_text": "The game works for me now. It comes in English and Japanese. Really good port. Works just fine. Really sorry, sega. Hope you become undead soon.",
            "review_score": "1"
        },
        {
            "review_text": "Like space with dancing!",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. And you will too.",
            "review_score": "1"
        },
        {
            "review_text": "fun, good soundtrack, good choreography, cool characters, if you like rhythm games, this one is timeless!",
            "review_score": "1"
        },
        {
            "review_text": "If You think that You're good at music games, buy this one, You'll change You're mind.",
            "review_score": "1"
        },
        {
            "review_text": "Ulala, I don't know what to say about Space Channel 5, except I love chu :3. It's gives off a Austin Powers movie vibe when everyone is line dancing, and it's crazy and fun.",
            "review_score": "1"
        },
        {
            "review_text": "The timing of the shots has nothing to do with the rhythm of the songs, vsync or not, 60 Hz or not. Play this on a console. I have it on Dreamcast, XBox 360 and PC, and the PC version is literally unplayable.",
            "review_score": "-1"
        },
        {
            "review_text": "Honestly I hate writing reviews like this, especially one like this, where I am talking about a rhythm game that I deem unplayable. I know, someone is already going to say I suck and if I suck I shouldn't review the game. But I honestly don't think I do. I try to do the rhythms like in the game, UP UP UP, then I do that and it doesn't work, like it's not in sync.   I tried with the keyboard and controller and both work pitfully. I have no idea what I am doing wrong?? Until I figure out why I can't even do the first segment without failing, I have no choice but to not recommend, for fear of it just being a bad PC port as people on 360 who have this seem to be able to play it fine.   The other games however in the Dreamcast Collection I have had 0 problems with. I would recommend them all except this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Input lag so awful, the game fails to respond to your button presses more often than not.   Apparently some machines don't have this issue, but they belong to big gay babies.",
            "review_score": "-1"
        },
        {
            "review_text": "I don't know how this game has got a Very Positive score on the page, because this is a terrible port. While it's really charming, and the music is just a joy to my ears, the controls are terrible, I keep failing the rythem for no reason what so ever, it feels completly luck based if I can actually perform the action on screen, XB1 controller, XBOX 360, and keyboard controls, nothing works out. If someone who has had this problem and has fixed it could help me, I'd be more then willing to re-do this review. Currently I give this game a Sonic Boom out of 10, oh yea I went there.",
            "review_score": "-1"
        },
        {
            "review_text": "Bad port. To play this game properly, you must follow the wise words of our friend Seaman.  'Be original and buy another Dreamcast... You never know when you might need another one.'",
            "review_score": "-1"
        }
    ]
}