{
    "app_id": 7210,
    "name": "Runaway, A Road Adventure",
    "release_date": "2007-03-14",
    "developer": [
        "Pendulo Studios"
    ],
    "publisher": [
        "Focus Home Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "Point & Click",
        "Mystery"
    ],
    "achievements": 0,
    "positive_ratings": 236,
    "negative_ratings": 90,
    "price": 6.99,
    "description": "New York, 2000......Without knowing how or why, Brian, a student on the verge of graduating from college, is attacked by Mafia gangsters. During his desperate getaway, in the company of a mysterious striptease dancer, he ends up meeting a wide range of unusual characters.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/7210/header.jpg?t=1447350992",
    "minimum_requirements": "Windows 95/98/ME/2000/XP, Pentium™ 200 MMX, 64 MB RAM, 630 MB hard disk drive, Monitor and graphics card (DirectX™ compatible) with support for 1024x768 and 16-bit color, DirectX™ compatible sound card, Mouse and keyboard",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I recommend this game only because of its awesome animation. It's a pure pleasure to watch these drawings, but it would be better off if this was a 2h movie rather than 8h game. The plot is ok, it also has a little twist, characters are simple and stereotypical, jokes are not funny. Music does not stand out. The worst part of the game are the puzzles. I've played dozens of point&amp;click adventures and never have I seen such absurd tasks. The only way to cope with some of them is to do a mix o pixel hunt and trail&amp;error (click everything on everything). All of these must be repeated many times as some objects appear only after the plot moves forward. The same applies to some action. It is not rare that to combine 3 pieces you need to do 1+2, and then +3. You cannot do 1+3 or 2+3 first. Also a few very irritating puzzles which involve pointless change of locations making you click all through the locations for 5-6 times or the most absurd - bank safe puzzle. In the puzzle you turn safe's wheel until you hear a click, than change the direction. However, you do not have to listen to the click (the character will tell you when it's done). All you have to do is click your mouse for over 150 times to change the digits one by one. If alt+tabbing to the walkthrough does not scare you and you are a fan of classic point&amp;click adventures, this may be still worth looking.",
            "review_score": "1"
        },
        {
            "review_text": "It's a really good game with a good story, funny characters and a surprising ending. Graphics, animations and musics are great too. And about Gina... Let's just say she IS Sexy...",
            "review_score": "1"
        },
        {
            "review_text": "Great game imo. +Nice story full of mystery, fun and sudden changes. +Nice vocals and graphics BUT  -a bit hard to finish! keep that in mind :)  Overall a great adventure game.",
            "review_score": "1"
        },
        {
            "review_text": "I thoroughly enjoyed this game. It's a classic point and click adventure. If you enjoyed them back in the day then this will remind you why. Maybe a bit short by modern game standards but well worth the £2.59 I paid in a sale.",
            "review_score": "1"
        },
        {
            "review_text": "A really crap game as point &amp; click game but with a good history that worth like a good thing. Good graphics, fun and with good characthers. You'll have a lot of problems solving or trying to click the right spot to progress after solving... really really annoying. Count to 10, try again and again and again.",
            "review_score": "1"
        },
        {
            "review_text": "What a weird title. Why is the main character so serious? I have only played this entry so far and I have to say, the game has some amazing moments. You know what it reminds me of though? Those old 90s educational games with a adult theme. You know, like Disney's Animated Storybook series or Math Blaster? Yeah, those...",
            "review_score": "1"
        },
        {
            "review_text": "Runaway is a decent point and click adventure, I like the story, though it sometimes is sort of cheesy and the last part is kind of a major let-down. But up to that point it is a very enjoyable, with most riddles being quite logical (   Apart from a few, for example, the developers somehow think that hot knives cut better than cold ones and you are supposed to figure that out..)   One of the major issues I have (apart from the story in the last segment) is that, as in many old adventures, there is a rather big amount of pixel hunting. In most cases where I got stuck, it was because I couldn't find an item that was hidden somewhere in plain sight. Then often the protagonist only picks up certain items after being triggered by some event, which leads you to have to often revisit locations, search places several times, etc.   The graphics are very nice, and because the game has a comic look, it aged very well. The voice acting is soso, but definitely okay and not annoying. For the price, I would definitely recommend it; it is no Monkey Island, but certainly ranks amongst the better point and click adventures.  ",
            "review_score": "1"
        },
        {
            "review_text": "Runaway is a decent point and click adventure, I like the story, though it sometimes is sort of cheesy and the last part is kind of a major let-down. But up to that point it is a very enjoyable, with most riddles being quite logical (   Apart from a few, for example, the developers somehow think that hot knives cut better than cold ones and you are supposed to figure that out..)   One of the major issues I have (apart from the story in the last segment) is that, as in many old adventures, there is a rather big amount of pixel hunting. In most cases where I got stuck, it was because I couldn't find an item that was hidden somewhere in plain sight. Then often the protagonist only picks up certain items after being triggered by some event, which leads you to have to often revisit locations, search places several times, etc.   The graphics are very nice, and because the game has a comic look, it aged very well. The voice acting is soso, but definitely okay and not annoying. For the price, I would definitely recommend it; it is no Monkey Island, but certainly ranks amongst the better point and click adventures.  ",
            "review_score": "1"
        },
        {
            "review_text": "If you like point and click adventures with a beautiful (and strange) art style, and a decent story but some 'wtf' puzzle solutions,this is for you.I had a lot of fun. A few times the puzzle solutions were bizarre but still I liked it alot.",
            "review_score": "1"
        },
        {
            "review_text": "As a veteran of point-and-click games I eventually had to pick this one up (part of an heavily discounted Pendulo Adventure Pack). I have played plenty of games from the genre and they all come with their flaws and thankfully have their respective merits. Long story short - I had yet to play an adventure game I didnt enjoy. Had...  Honestly, I could never really get into this game. From the first room I ran into trouble progressing. It is no news that some adevnture games contain illogical or infuriating puzzles, but usually you get the hang of it by carefully reading the dialogue and/or exploring. I had to heavily use a guide, when I usually refuse to use guides at all, as they destroy the purpose of those games but in the end I prefer it over examinating every pixel in every room every time you progress a little bit. When you can only progress by trial and error, fun gets work and finishing this one was alot of work.",
            "review_score": "-1"
        },
        {
            "review_text": "The opening cutscene is so long and you can't skip it... I'm bored already. Is it a video game OR just a poorly animated short film?",
            "review_score": "-1"
        },
        {
            "review_text": "Its a bit of a mixed bag, the art style and voices are largely good. The story isn't bad but its pretty predicabile, with a couple of stand out moments. Some cut scenes go on way too long, like the beginning of Chapter 4 (I think) which just seems to go on and on without you being to able to interact at all.  Overall I'd give it a 2.5/5. There are better adventure games out there. (I would note a few of the photos for the game on the store page aren't actually in the game)",
            "review_score": "-1"
        },
        {
            "review_text": "Dropped the game at chapter 3 out of 6, it just didn't give me enough positive experiences to balance out the downsides.  + Nice art style for its age + Intuitive UI + Some fun item descriptions and narration   + A surprisingly non-transphobic depiction of the drag queens. Though it still reduces them to one-note sexist stereotypes just as every other character is depicted in the game.    ~ Cheesy and silly plot, with dissonant moments of cold-blooded murder ~ Puzzles of varying quality, often it's difficult to figure out what the developers want the player to do, and several tasks require pixel-hunting  - Very one-dimensional and stereotypical characters, 3 chapters in none of them are likeable   (eg. the protagonist guy is sexist, his love interest is emotionally manipulative)   - Irritating and over-acted voice acting - Blooody long cutscenes - The facial and walking animations look quite weird   Verdict:",
            "review_score": "-1"
        },
        {
            "review_text": "It's not a game, it's a chore. Really bad puzzle design.",
            "review_score": "-1"
        }
    ]
}