{
    "app_id": 72850,
    "name": "The Elder Scrolls V: Skyrim",
    "release_date": "2011-11-10",
    "developer": [
        "Bethesda Game Studios"
    ],
    "publisher": [
        "Bethesda Softworks"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 16,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Workshop",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "RPG"
    ],
    "tags": [
        "Open World",
        "RPG",
        "Fantasy"
    ],
    "achievements": 75,
    "positive_ratings": 237303,
    "negative_ratings": 14951,
    "price": 9.99,
    "description": "EPIC FANTASY REBORN The next chapter in the highly anticipated Elder Scrolls saga arrives from the makers of the 2006 and 2008 Games of the Year, Bethesda Game Studios. Skyrim reimagines and revolutionizes the open-world fantasy epic, bringing to life a complete virtual world open for you to explore any way you choose.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/72850/header.jpg?t=1493767797",
    "minimum_requirements": "OS: Windows 7/Vista/XP PC (32 or 64 bit) Processor: Dual Core 2.0GHz or equivalent processor Memory: 2GB System RAM Hard Disk Space: 6GB free HDD Space Video Card: Direct X 9.0c compliant video card with 512 MB of RAM Sound: DirectX compatible sound card",
    "recommended_requirements": "Processor: Quad-core Intel or AMD CPU Memory: 4GB System RAM Video Card: DirectX 9.0c compatible NVIDIA or AMD ATI video card with 1GB of RAM (Nvidia GeForce GTX 260 or higher; ATI Radeon 4890 or higher)",
    "reviews": [
        {
            "review_text": "A guy in Solitude told me  'You should see me when you get bored stranger'.   after 450++ hours in,    Still haven't seen him.  ",
            "review_score": "1"
        },
        {
            "review_text": "If I could, I would take this game out, buy it dinner, have sex with it and call it the next day.   Then we would start going out regularly, we would fall in love eventually. We would become the couple that has their own inside jokes and are always teasing each other and everyone else would be jealous of us. We would get married and have a child (Fallout New Vegas, the second best game ever). We would grow old together, on my death bed as I lie there about to draw my last breath, TES: Skyrim looks at me with tears in it's eyes 'Thank you for everything, you were always so good to me' and I would take TES: Skyrim’s hand, look it in the eye and say 'No, thank YOU' then pass away.",
            "review_score": "1"
        },
        {
            "review_text": "I played this game 3 times.   1st play through:  Picks Nord. Escape Helgen. Talks to NPC. Guided to Whiterun. On the way; Fight bandits. Fight wolves. Help kill giant. Arrived at Whiterun; Kill chicken. Fight guards. Dies. Leave game.  2nd play through: Picks Wood Elf. Sneaks. Sneak. Sneak. Level up. Backstabs OP. Plays in the shadow. Joins murder guild. Joins money guild. F*ck werewolf guild. Do main quest; Fight dragons. Dies. Lowers difficulty; Novice. Kill dragons. Kill more dragons. Joins Dragon Slayer guild. Fight dragon Hitler. Fight dragon Hitler again in Heaven. Saved the world.  3rd play through:  Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. DLCs. Mods. Mods. Mods. Mods. Mods. Mods. Mods. DLCs. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. DLCs. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods. Mods.  I rate 3/3",
            "review_score": "1"
        },
        {
            "review_text": " THE ELDER SCROLLS V: SKYRIM    Minor Spoilers   Sit through a cutscene! Get bored! Pick your race! Pick your face! Pick your nose! Be a lizard! Lizards are cool! Almost get executed! Be scared of a dragon! Get some armor! Get some weapons! Run in circles! Climb a mountain! Learn how to yell at people from some old dudes! Yell at things! Do a bunch of quests! Gather more quests you'll never do! Accidentally become leader of a guild of thieves! Go to college! Inherit the college! Get some spells! Do magic! Run out of magic juice! Run around some more! Run out of stamina! Fight dragons! Take their souls! Use the souls to get more ways to yell at people! Level up! Improve your skills! Get a companion! Watch 'em die because of your lackluster protection! Make some cool armor! Make some cool weapons! Enchant that cool armor and weapons! Run out of enchanting juice! Yell at stuff some more! Steal a plate! Run from the law! Steal a horse! Fail to protect that horse! Go on foot because your horse is dead! Get caught! Run out of health! Die! Respawn where you were twenty minutes ago because you forgot to save! Rage quit! Come back! Decide to actually do the main quest line! Consume copious amounts of food mid-battle! Climb a mountain by yelling at clouds like the old dudes taught you to! Meet a good dragon! Learn how to yell at things from him! Go through a bunch of stuff to get a scroll! Read that scroll! Go back in time! Learn to yell at things from people in the past! Fight a bad dragon! Realize it isn't the final boss and that you didn't kill him! Stop doing quests! Buy a house! Buy stuff for your house! Run around avoiding the main quest line! Gather boatloads of gold! Not use any of it! Mod the game to oblivion! Realize that you've somehow already sank 50+ hours into it! Realize you're addicted! Keep playing anyway!  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Who needs Grand Theft Auto when you can steal a horse.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "I was stacking books on a shelf in my house in Whiterun, one of Skyrim's major cities, when I noticed a weapon rack right beside it. I set a sacrificial dagger in one slot, an Orcish mace in the other. They were on display for nobody but me and my computer-controlled housecarl, Lydia, who sat at a table patiently waiting for me to ask her to go questing. The chest upstairs was reserved for excess weapons and armor, the bedside table for smithing ingots and ores, the one next to the Alchemy table for ingredients. I'd meticulously organized my owned virtual property not because I had to, but because tending to the minutia of domestic life is a comforting break from dealing with screaming frost trolls, dragons, a civil war, and job assignments that never seem to go as planned. It's even a sensible thing to do; a seemingly natural component of every day existence in Skyrim, one of the most fully-realized, easily enjoyable, and utterly engrossing role-playing games ever made.   Part of what makes it so enjoyable has to do with how legacy Elder Scrolls clutter has been condensed and in some cases eliminated. In Skyrim, there's no more moon-hopping between hilltops with a maxed out Acrobatics skill. That's gone, so is Athletics. The Elder Scrolls V pares down the amount of skills and cuts out attributes like Endurance and Intelligence altogether. There's no time wasted on the character creation screen agonizing over which skills to assign as major. You don't assign major and minor skills at all, but instead pick one of ten races, each with a specific bonus. High Elves can once a day regenerate magicka quickly, Orcs can enter a berserk rage for more effective close-range combat. These abilities are best paired with certain character builds – the High Elf regeneration is useful for a magic user – but don't represent a rigid class choice. Major decisions don't need to be made until you're already out in the world and can try out magic, sneaking and weapon combat, emphasizing first-hand experience over instruction manual study, letting you specialize only when you're ready.    It contributes to the thrilling sense of freedom associated with life in Skyrim. Do a quest, kill a dragon, snatch torchbugs from the air, munch on butterfly wings or simply wander while listening to one of the best game soundtracks in recent memory. Despite the enormity of the world and the colossal amount of content contained within, little feels random and useless. Even chewing on a butterfly wing has purpose, as it reveals one of several alchemical parameters later useful in potion making at an alchemy table. Mined ore and scraps of metal from Dwemer ruins can be smelted into ingots and fashioned into armor sets, pelts lifted from slain wildlife can be turned into leather armor sets, and random books plucked from ancient ruins can trigger hidden quest lines that lead to valuable rewards. Skyrim's land mass is absolutely stuffed with content and curiosities, making every step you take, even if it's through what seems like total wilderness, an exciting one, as something unexpected often lies just over the next ridge.   Many times the unexpected takes the form of a dragon. Sometimes they're purposefully placed to guard relics, sometimes they swoop over cities and attack at seemingly random times. In the middle of a fight against a camp of bandits a dragon might strike, screaming through the sky and searing foe and friendly alike with frost or flame. Momentarily all on the battlefield unite, directing arrows and magic blasts upward to knock down the creature, creating impromptu moments of camaraderie -- a surprising change from what may have been yet another by-the-numbers bandit camp sweep. Dragons show up often, their presence announced by an ominous flap of broad wings or an otherworldly scream from high above. The scale and startling detail built into each creature's appearance and animations as it circles, stops to attack, circles again and slams to the ground makes encounters thrilling, though their predictable attack patterns lessen the excitement after a few battles. In the long run they're far less irritating than the Oblivion gate equivalent from The Elder Scrolls IV, can be completed in a few minutes, and always offer a useful reward.    Killing a dragon yields a soul, which powers Skyrim's new Shout system. These are magical abilities any character can use, you don't have to specialize in spell casting to slow time, throw your voice, change the weather, call in allies, blast out ice and fire, or knock back enemies with a rolling wave of pure force. Even if you favor sword, shield and heavy armor and ignore magic entirely, you'll still be able to take full advantage of these abilities provided you find the proper words – each Shout has three – hidden on Skyrim's high snowy peaks and in the depths of forgotten dungeons, serving as another reason to continue exploring long after you've exhausted the main quest story, joined with the Thieves Guild, fought alongside the Dark Brotherhood, or thrown your support behind one of the factions vying for control of Skyrim.   Not only is this land under assault by dragons, long thought to be dead, it's also ripped in two by civil war. You can choose one side or the other, but so much of the allure of Skyrim is how, even outside of the confines of quest lines, the embattled state of the world is evident, and steeped in a rich fictional legacy. Lord of the Rings this is not, but with the release of every Elder Scrolls game, the fiction becomes denser, and the cross-referencing for long-time fans all the more rewarding.   Skyrim's residents are all aware of current events. They'll comment on the civil war, some sympathizing with the rebels, others thinking the establishment sold its soul. The peasants complain about the Jarls who control each settlement, the Jarls complain about the rebels or foreign policy, the overprotective College librarian complains when I drop dragon scales all over his floor; many characters feel like whole, distinct personalities instead of vacuous nothings that hand out quests like a downtown greeter hands out flyers for discount jeans. Characters stereotype based on race, they double-cross at even the slightest hint it might be profitable, and they react to your evolving stature within the world. It makes a ridiculous realm, filled with computer-controlled cat people and humanoid reptiles, demon gods and dragons, feel authentic, like a world that existed long before you showed up and will continue to exist long after you leave.",
            "review_score": "1"
        },
        {
            "review_text": "Ever wanted to live in a world where you can be a magician, thief, and/or warrior? THEN GET THIS GAME Ever wanted to kill a dragon? THEN GET THIS GAME Ever wanted to talk to a dog? THEN GET THIS GAME Ever wanted to get married to a video game character? THEN GET THIS GAME Ever wanted to have a tail? THEN GET THIS GAME Ever wanted to be a race/religion/gender that you currently are not? THEN GET THIS GAME Ever wanted to kick some ♥♥♥? THEN GET THIS GAME Ever wanted to be an assassin? THEN GET THIS GAME Ever wanted to adventure through nature whilst riding a horse that defies the laws of physics? THEN GET THIS GAME Ever wanted to DIE? THEN GET THIS GAME Ever wanted the power of telekinesis? THEN GET THIS GAME Ever wanted to mod the crap out of a game? THEN GET THIS GAME Ever wanted to get so drunk that you wake up in a trashed temple on the other side of the region? THEN GET THIS GAME Ever wanted to be invisible? THEN GET THIS GAME Ever wanted to successfully evade guards by being invisible? THIS IS NOT THE GAME FOR YOU Ever wanted to murder a princess then just pay a 1000 gold fee for your bail, then steal back everything they took from you? THEN GET THIS GAME Ever wanted to pull back a bow string while crouching and yell 'PEW PEW' while wreaking havoc on people's lives? THEN GET THIS GAME Ever wanted to be thrown into the air by a giant so high that you can see the entire world, but then die? THEN GET THIS GAME AND APPROACH SOME GIANTS, M8 Ever wanted to read a book? I GUESS YOU COULD GET THIS GAME, BUT YOU COULD ALSO GO TO THE LIBRARY Ever wanted to decorate a house? THAT'S NOT REALLY THE POINT OF THE GAME But my house is pretty rockin'. TRU. DEF A BACHELOR PAD. Not since I got married. ALSO TRU. WHICH IF U R INTERESTED IN THEN GET THIS GAME Ever wanted to turn a terrible monster into a chicken? THEN GET THIS GAME Ever wanted to shoot a goat? THEN GET THIS GAME Ever wanted to eat a Homecooked Meal? THEN GET THIS GAME Ever wanted to turn into a werewolf? THEN GET THIS GAME; IT'S MORE ACCURATE THAN TWILIGHT, I SWEAR Ever wanted to turn into a vampire? YOU'RE GONNA WANNA GET THE DLC TOO, M8 Dang. DANG It's pretty good, I guess. TRUE, TRUE Ever wanted to have a life? WHATEVER YOU DO, DO NOT PURCHASE THIS GAME",
            "review_score": "1"
        },
        {
            "review_text": "Writing a review about Skyrim.. now... there really are more useful things to do nowadays, as there are few opinions about this game, which haven´t been already written... in various ways. But as i´ve got the request from a friend, i will give you my impressions nonetheless - So, please excuse me in advance ;)  Anyways, what´s so great about Bethesdas latest part of the Elder Scrolls saga (i´m ignoring the Online part willfully here)? Is it the great story and rpg aspects? Uhm... i would guess not, as the story is there and it´s enough to give the open world some background plot, which you can follow or ignore. Regarding the rpg.. one has to say as hardcore roleplayer Skyrim was kind of a letdown from it´s predecessors (especially from Morrowind) with it´s double hand action and the great 'streamlining' of skills and attributes. Naturally that helped though to attract a wider audience for this game, which further helped it to shine where it has it´s strengths.  But where are they now really? Surely Skyrim fully opened the Open World Hype, which was copied in various ways, for example some good (Witcher 3), some not so good (Dragon Age:I). Nowadays though it has lost it´s unique place in that regard.  So what makes Skyrim still one of the most played games on the Steam statistics? Naturally it is the modability, which i think is still unmatched by any other game in this genre and which let´s me even today wonder about the many screenshots players post of it, where you wouldnt even guess the base game anymore.  Mods, created by one of the most impressive and innovative modding communities out there. This should also never be forgotten, nor from the mod users as well especially from Bethedesa etc. when thinking about wanting to milk money from that source.  Conclusio: Skyrim deserves it´s places in the alltime games rankings, ignoring all the shortcomings it may have, it offers an unbelieable variety of possibilities to use and play in.  Point Scale: 9/10",
            "review_score": "1"
        },
        {
            "review_text": "It's like Skyrim without guns.",
            "review_score": "1"
        },
        {
            "review_text": "I used to have friends, then I bought skyrim.",
            "review_score": "1"
        },
        {
            "review_text": "Can play as cat people - 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Stole a plate and became the #1 most wanted man in the world. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I have no time to write a review! I'm too busy playing this game!",
            "review_score": "1"
        },
        {
            "review_text": "I used to have a normal life like you then i launched skyrim with mods...",
            "review_score": "1"
        },
        {
            "review_text": "It's ♥♥♥♥ing Skyrim, it's huge and the amount of mods there are, you'll put so many hours into it!  So why are you reading reviews?! You know this is good. GO PLAY IT!",
            "review_score": "1"
        },
        {
            "review_text": "I was mixed up in some Stormcloak buisness and was due for Sovngarde. However from the skies of Nirn came a dragon. It was black as night and its eyes demonic. It caused a comotion that spared me from the blade that was a few seconds from banishing me to Sovngarde. After i escaped i was told to go to Riverwood and ask for help. I was scared and ran in compltly opposite direction. Before i knew it i was in a city called Markarth. And yet again i found myself wound up in a bunch of criminals called Forsworn. After making ends meet between Markarth and the Forsworn. I had the courage to and strength to go to Riverwood and complete my quest. As i went on i met many Warriors and Mages that i helped and in return they helped me. I found myself to be Dovahkiin. Dragonborn. A legendary hero whos destiny is to defeat Alduin with his own weapon. The Thu'um. The Voice. I then realised. That the dragon that saved me. Was Alduin. On that day he had already lost. And so i went on. I tried to find some old man in the ratways in Riften but i ended up becoming master of the thieves guild, a deadly assasin, a werewolf, tamer of dragons themselves and i even became Archmage. And finally i became the hero that the scrolls had told of. BUt my journey wasn't over. The dragon menace was dealt with but one more menace remained. I took off to a castle near Riften and was told to look at a cave. This cave could lead to the victory over the new menace. After activating a blood seal. A coffin rose from it. And out came a woman. Her face was pale like the moon and her eyes where like fire. My eyes widened as i realised. This was a vampire. My sworn enemy and on her back. I almost lost my breathe. She had an Elder Scroll...",
            "review_score": "1"
        },
        {
            "review_text": "This is a game.",
            "review_score": "1"
        },
        {
            "review_text": "I have 48h in the first week and I basically havent started the story yet... help  +Highly addictive -Highly addictive",
            "review_score": "1"
        },
        {
            "review_text": "This game made me forget to masturbate!   10/10 would play again!",
            "review_score": "1"
        },
        {
            "review_text": "Very good game, I love RPGs but this one sticks out, with mods there is no end, this game has to be on the top of games.  I really like the balance of the game, and everything is just great.  The level system is very balanced to with 280 perks (vanilla) and you can spend hours creating your own character. If you play alot without mods, you will probably complete the whole game with 1 character in like 350 hours (that is the quests) and the level is infinite so...., and with story mods, it can take forever.  If I forgot to mention, there is a Creation Kit in the 'tools' bar were you can create and edit your own mods, Nexus Mod Manager is a program that I strongly suggest.  It's a very good infinite game and an allround awesome game, like all Bethesda games.",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "Killed a guard. Guards didn't care. Killed a chicken. Man with the highest bounty  10/10 Would kill again",
            "review_score": "1"
        },
        {
            "review_text": "Ruined my life  10/10",
            "review_score": "1"
        },
        {
            "review_text": "(This review is a 'companion' piece to   Ksempac's review.  I suggest you read his first.)  Counterpoint The Elder Scrolls V: Skyrim  With about 300 hours invested in the game, yet only 23 (of 75) achievements under my belt, I think it's pretty obvious just how irrelevant Skyrim's social and civil problems were to my happiness there. In fact, most of the quests that I actually did complete, were done so, coincidentally. Honestly, it didn't take long for me to realize there were little, or no, rules, in Skyrim, and after 2 or 3 hours I had my own thing going on. I had a nice, cozy house, several loyal  companions  [i.imgur.com] , and I made a comfortable living by treasure hunting, and burgling. I seldom took on odd jobs, and stopped, altogether, doing other people's dirty work. When the war finally broke out, I joined both factions, received various missions and supplies, then, promptly marched off to spend the next 160+ hours just vagabonding. Through gold leafed woods, over frigid white mountain tops (often in my skivvies) I wandered through the wonder, of Skyrim, doing pretty much whatever I pleased.  I invented my own challenges and achievements... I ran into a Stormcloak encampment, stripped off my uniform, and shouted '♥♥♥♥ the army!' while mounting the captain's steed. They totally killed me the first 2 tries, but I did get away with it, on the third. Imaginary Achievement Unlocked: Section 8 (Perform and survive 3 consecutive insane actions against the military.) Yes!  I wanted to find ways to see beyond Skyrim's  physical beauty  [i.imgur.com] , and explore all her other aesthetic qualities, like art, music, literature, and such. For instance, Skyrim is littered with books and letters, and so, it made sense that we form a Traveling Book Club. During our journeys, if a book caught our eye, we'd stick it in our inventory. Then, after our evening meal, one of us would read their  choice  [i.imgur.com] , aloud. Aranea was partial to books on history, Erandur indulged his voyeurism with journals and diaries, and Lydia.. well, Lydia always chose cook books. Though she took no real interest in the art of cooking, there was something about recipes that she considered profound, and she would read them as if she were reciting a beautiful poem.  And so, we traipsed through Skyrim. Minutes to hours, hours to days, days to...   Then, one evening, somewhere around hour 290, I looked at my map and realized that I had been everywhere, and had seen, pretty much, everything. I had promised my allegiance to many, but had given it to none. I had looted the dead, and robbed the living. I had read every  damn book  [i.imgur.com]  ever printed. I had done Skyrim to death. The war was still raging, the  dragons  [i.imgur.com]  still owned the skies, nothing much had changed in that respect. But, that was mainly because the people of Skyrim had been just standing around, waiting for me to make it all better. Instead, I had decided to teach them a valuable lesson about depending, too much, upon others.  As Erandur might've said. 'Mara helps those who help themselves.' To which, I would've added. 'Hey, I never asked to be Dragonborn.'  I filled my companions inventories with jewels, food, and clothes, then sent them on their separate ways. Then, I walked to the nearest, highest, snow peaked mountain, and shouted. 'Game over!'  It was an alternative ending.  That was months ago, and looking back, now, I'd still say I had a good, long life, in Skyrim. I may not have much to show for it, stat wise, but a 900+ screenshot legacy, is nothing to sneeze at, either. And, yes, it's true that Skyrim is no better off, now, for my having lived there.  But then, after all is said and done, I kinda doubt that the real world will be either. Such is the life of an underachiever.   Footnote: I actually went back into Skyrim, while I was writing this review. Partially for some reference info, but mostly, just to sneak a visit to my old Whiterun homestead. I guess, it's supposed to be a comfort knowing that  life goes on  [i.imgur.com] , without us?",
            "review_score": "1"
        },
        {
            "review_text": "With great graphics, Great gameplay, and a captivating sandbox-like atmosphere, this game is a must-have for your library! Load it with mods, and you have unlimited entertainment.  123593245904356/10",
            "review_score": "1"
        },
        {
            "review_text": "Epic game , every one knows this you would have to live on Mars not to know this . But like many other reviews on steam the company practice is also a part of the game experiance. And people are quite happy to down vote games because of there buisness practice and this is no different .  Bethesda and Valve made a shameless attempt to make a cash grab on mods . They failed only because people stood up to them other wise we would be paying for mods now in most games. What makes it worse is both companys own a large part of there rise and success down to free mods.  Suggesting a donation box for the actual developers of the mods who put time into making it and not a requirement to get the mod just a donation option  People telling me to change the review are the same people who where trying to tell us all why paid mods is a good thing.  White Knights of Valve and Skyrim please insert your tears and buthurt in the comments section below i only charge $1 per comment",
            "review_score": "-1"
        },
        {
            "review_text": "My personal favorite game of all time, pls buy if you havnt already :)",
            "review_score": "1"
        },
        {
            "review_text": "Great game. I've been playing it for more than two years and I have enjoyed every minute.",
            "review_score": "1"
        },
        {
            "review_text": "ESV: Skyrim is the latest in the Elder Scrolls franchise. It is the culmination of open world RPGs and introduces a massive open world for players to explore. The quests and character progression are intuitive and easy to use. The expansions provided many hours of enhanced character development and story line. All in all this is by far my favorite of the ES series and I would recommend it to anyone that enjoys fantasy RPGs and open world exploration.",
            "review_score": "1"
        },
        {
            "review_text": "Greatest game I've ever played! Skyrim changed my perspective on gaming as a whole, it's a work of art! From the second you create your character, you won't ever be bored again while playing. There's always something to do in Skyrim, always new quests, new locations, or dragons to slay, and the graphics are amazing!   Everything is great, and even though I feel that the NPC's could've been programmed a little bit better, it's nothing that doesn't make the game experience amazing. Best 60$ i've ever spent, and I would gladly have paid more. Buy it! :3",
            "review_score": "1"
        },
        {
            "review_text": "Longest single player game I've done my entire life- the hours just keep on rollin'. Recommend modding after vanilla =3",
            "review_score": "1"
        },
        {
            "review_text": "Over 1100 hours played, in two years of owning this game, and I believe I have barely scratched the surface of this game. I have discovered many locations, have achieved high levels of gameplay (albeit a lot of that with installed mods), but I truly believe that a person could grow old playing this game, and not 'complete' it, as such. I am not very good at this review-writing, but the company behind the name, Bethesda, truly made a work of art here, and I do hope so much that, going forward, they can continue to update and otherwise add to this game, and not let it simply die out. With that being said, they are about to release Skyrim Remastered, or whatever the 'official' working title is, and I am chomping at the bit in anticipation of the release date, which I believe is the 28th of this month (October).  You go, Bethesda! Don't the haters stop you from continuing to provide quality entertainment.",
            "review_score": "1"
        },
        {
            "review_text": "Greatest RPG since Morrowind!!!",
            "review_score": "1"
        },
        {
            "review_text": "The Elder Scrolls V: Skyrim is built solely on the idea of discovery. In the very beginning you have no idea who you are, where you are, or why you’re aboard a carriage filled with condemned prisoners. All you know is you’re an outsider, and once you’ve reached your destination, your execution awaits.  The caravan arrives in the small forted village of Helgan, where you’re pulled from the carriage. Your captors fail to recognize you; they’re just as puzzled by your appearance as anyone else. Are you a man or woman, an Argonian or Breton? This is your first opportunity to ask yourself who you are and who you want to be in Skyrim; it won’t be the last time you ask yourself this.  Lucky for you, the execution fails, granting you an opportunity to escape Helgan. This is where Skyrim commences and where your story within Bethesda’s world begins. You’ve been told to visit a town not far north of your escape, but nothing other than the word of your new friend is there to compel you to visit it. The entire province is at your fingertips.  Skyrim is structured in a loose manner, allowing the player to discover its world and various narrative strands at the pace that they desire. Characters will tell you where you should go, but there is never any real urgency to do any of it. The world is cluttered with distractions and what makes this experience unique is the distractions form the very heart of Skyrim. The core narrative, as it is, is a mean to an end, an excuse to pilot you from one corner of the world to the other. It’s hard to imagine anyone following a single narrative strand when it’s impossible to travel from one quest point to the next without stumbling upon some sort of ruin, cave, encampment or fort. The narrative has its high points, but it’s always made secondary by the next undiscovered location on your compass; and that’s because Bethesda wants you to pave your own story.  Undiscovered locations dot the entire province of Skyrim, leaving the map a venerable piece of swiss cheese after a few dozen hours. Discoveries are the actual loot and tracking every single one of them down is the addiction that thrusts players headfirst into Bethesda’s fiction. Every location, small or large, is populated with its own personal story, which makes every journey feel special and rewarding. There’s an understanding that this world, this place, existed before you fell upon it; there’s also an unshakable feeling that it’s all been staged for you.  Skyrim would have you believe it’s a dynamic world that’s constantly in flux, when in reality it’s more like a car stuck in neutral, waiting to be put into gear. Characters go about their daily routines but they merely exist to bestow quests or impart dense records of lore; no-one is truly alive when you’re not engaged with them. One of the principal quest lines revolves around the Imperials and the Stormcloaks, two factions waging a purportedly bloody, savage civil war that has split the region in two. In each and every town across the land nearly every single person is happy to share an opinion on the war, telling you how dire the situation has become. But there is no war, no conflict, not unless you decide to take part in it yourself; you may see hundreds of random encounters in this Nordic land, but you’ll never see the ‘War for Skyrim’ unfolding.  Fiction aside, Skyrim is a vast, majestic world to discover. Bethesda is unparalleled when it comes to world building and when you’re wading through brooks, scaling mountains or eviscerating another cave full of bandits it’s an absolute joy. It’s a remarkable, liberating feeling that this province was crafted specifically for you; a huge playground with apparently no rules or boundaries. That isn’t the case. Skyrim has its rules; they’re specific and they have a nasty way of reminding you this fiction was written in binary.  Every city subscribes to a simple bounty system: commit a crime and you’ll be struck down, pay a fine, or spend the night in jail. There is a clear consequence to crime, but it’s merely an illusion. On my first evening in the town of Morthal I snuck into the Jarl’s house and then into the private quarters of her daughter, where I then attempted to pickpocket the young sleeping woman. Without the deftest of hands, the girl arose, alerting the guards of my treachery. Not wanting a fight or untimely death, I submitted, volunteering to pay my bounty and spend the evening locked up. The following morning, strolling from my cell, I bumped into the sleeping girl once more: she asked me to deliver a letter of utmost importance for her; she trusted me.  The bounty system is a dirty way to gloss over any real consequence for your actions. There is no gray area; everyone is either a friend or foe. When an enemy is nearly defeated they may beg for mercy, pleading with you to spare them. You can sheath your weapon but they will never flee, every single one will get up and rush you. Once, a villager followed me into a vampire’s hideout, hoping to avenge the death of his wife. Madness erupted and amid the scuffle I inadvertently grazed him with a fire spell, turning him immediately against me (note: the vampires who killed his wife were still very much alive). Afterward, instead of arriving to a town full of indebted villagers, I returned to an armed welcome and an outstanding bounty. There was no way to explain how the town learned of my accidental deed and no way to silence the vengeful widower – I tried killing him several times.  Once you’ve found the parameters that Skyrim works with, it’s not difficult to play by its rules, and even enjoy it. There is a huge, jaw dropping world to discover at whatever pace you desire. Along the way you’re free to author your own story, defining your unique character and experience through whatever style of play you prefer. When you’re lost in its rich landscape and enthralled within its fiction, Skyrim thrives, and is truly unparalleled; it’s when you take a closer look, you can’t help but discover the seams holding this tapestry together.    A Must Play ",
            "review_score": "1"
        },
        {
            "review_text": "say good bye to friends and family if you buy this game. honestly, even with its bugs, it is the best game I ever played.!",
            "review_score": "1"
        },
        {
            "review_text": "This game has it all. Once you start you'll never leave the land of Skyrim.",
            "review_score": "1"
        },
        {
            "review_text": "This game is 10/10, because if giant troll bash you into right spot of your body, you can actually rocket yourself into space. No other words needed.",
            "review_score": "1"
        },
        {
            "review_text": "One of the greatest games to ever be made to date, still compared to the newest game of the year, Witcher 3 with lots more replayability, thanks to mods, great dlc and a community that is still very active, Made by bethesda one of the best gaming companies to date.  If you want to get into the rpg genre this is a great start, a good price for a beautiful game with countless mod support, would recommend to all &lt;3  ",
            "review_score": "1"
        },
        {
            "review_text": "Skyrim. The seemingly all-time-classic of western RPGs. The game nails its atmosphere with a stellar ambiental soundtrack. The world map is absolutely stunning and there is descent variety in dungeon tilesets as well. It is impressive how you can find a new quest around every corner.  The core gameplay loop of traversing the overworld broken up by basic dungeon crawling feels good and works well enough.  But the game really lacks variation. Each and every quest, while trying to come up with varied stories, can be broken down to 'go there, enter dungeon, kill dudes, come back'. This causes most of the experience to blend together and lack any really impactful moments.  While the environment feels carefully handcrafted, the quests come off as cookie cutter and simplistic. The wooden animations of the NPCs - even during the main quest, don't help. There certainly is fun to be had, but what's on offer here is quantity, not quality.",
            "review_score": "1"
        },
        {
            "review_text": "(This review is a very long one. It actually is kind of an article between, a gameplay review, a 'role-playing' guide, a mods compilation, and story of a character. If you are not intrested, I suggest you to pass it right away.)  (Content is written all by me. Please do not distribute without permission.)  The Elder Scrolls V: Skyrim, is undoubtedly one of the greatest PC games ever made, personally the single best RPG and open-world game I've seen. It is an unlimited digital source of pleasure for a lifetime FRP lover like myself. There really aren't many words to describe such perfection.  First of all, best thing about Skyrim is the fact that, things you can do is literally endless. Content is literally endless. I am at around +2.000 hours of Skyrim gameplay (Also played it a lot before my Steam copy.), and everyday, I still keep discovering some totally new things. Vanillia game with DLC's, has at least over 2.000-2.500 hours of gameplay (Around 1.500 hours without any DLC's, maybe?), if you do nothing but quests. Endless number of mods you can apply, will make gameplay way, way longer. And again, this is only possible if you do nothing but quests; no sightseeing, fast traveling all the way, skipping lore, and forgetting about the identity of your character. Still, it's your choice to play Skyrim in the way you want.  I have 3 characters, and I'll talk about one of them, whom I mainly play. (Vanillia content is more than enough to play 3 unique paths (except main storyline) for 3 seperate characters. You also can alter main storyline to a degree.). But first, I'd like to talk about mods which I actively use in all my characters (Plus, there are some particular ones for each character.)(No visual mods included.)  - First of all, most indispensable mod for me, is probably the 'Disable Fast Travel'. I think that fast traveling absolutely ruins the game. I never fast traveled before (Neither in Skyrim, nor Oblivion. Morrowind didn't had it anyways. Damn, I love Morrowind.), never will, and I hate people who fast travels. Fast travel system is necessary as a result of overall demand to Skyrim, but when it's being used, that's half of the games beauty gone. Some people play it just for the other half anyways.  - I very much like the 'iNeed' mod, which adds a streamlined approach to needs. You need to eat, drink, and sleep once in a while, for full effectiveness of your character. It has some nice details, like for example, you can carry a flask, drink your water from it when you are thirsty, and fill it from any water source when depleted (Even from rain!).  - Static Mesh Improvement, an amazing mod which replaces some plain textures with idea of adding a feel of third dimension, with actual 3D meshes. It adds a whole new level to details all around Tamriel.  - SkyUI, a must-have interface overhaul - Cloaks of Skyrim - SkyrimSpeeds, speed adjustments - Improved Dragon Shouts - Command Dragon, for manual control - Alternative Crafting System, helps role-playing without abandoning your gear potential - ImmersiveFP, for first-person dragon &amp; horse riding - A quality world map with all roads - Touring Carriages - FNIS, custom animations engine  - And, Falskaar! It's an amazing mod, which adds a new quest line, a huge new map, and a very solid lore. Very professionally done, almost like an official DLC.  The character I want to talk about, is my female dragonborn assassin, last member of the Dark Brotherhood, and guildmaster of Thieves Guild. She's the character that I played the most, although she's not the character I first created, or beat the main storyline. I beat the main storyline with my mage for the first time, and I wanted continue as an assassin, created her. After completing the Unbound quest (Which is the very first quest.), I literally quit the main storyline, and completed The Dark Brotherhood and Thieves Guild storylines (Yea, you can do that. You literally can complete almost every side quest in Tamriel without touching the main story.). By the time I return to the main storyline, I already was a master assassin, (Skyrim has an NPC progress system; it doesn't let you level up more than usual before story, and one-shot every NPC. You'll still have an adventage tho.), so I progressed through it at ease (Except the dragon parts, where I needed to go head-on.), and I completed it, as she completed her personality. She's not a type of assassin without honour, she's not like killing random people just for money/fun, or she's not using her dragonborn powers for personal gain (Spidey-philosophy), instead, she actually delivers justice, and avenges the downtrodden. She's more like Batman, The Dark Knight, except the killing part. And all that Thieves Guild, 'stealing' part, is also like the phiolosophy of Robin Hood, or at least the Cat Woman. In the end, she's a very righteous character, in her own way.  I completed a billion small quests, and some big ones like Civil War and The Companions storyline (Actually, all the big ones as far as I know.), and married with Aela (Yep, Aela is a female. Yep, I'm a female. Yep.) before heading to Dawnguard DLC. I've completed Dawnguard as a vampire. I got cured afterwards, but I'm still not sure about being a vampire, since it actually fits the concept of her being a master assassin hiding in shadows, but there are too many downsides; I won't ever be using the Vampire Lord form, since it's totally irellevant with my character, and I don't like its benefits/aesthetics anyways. After that, Dragonborn came out, and I also finished it, which actually fits perfectly to her personality, since the purpose is (kind of) assassinating a corrupt leader as the only assassin (because of being a dragonborn) who can do it, and became a complete Dragonborn. Since then, I'm traveling short distances with Shadowmere, and long distances on a dragon (Not dragon fast-travelling, I'm navigating manually.).  I do some unusual things in my spare time in Skyrim, which many can find weird, but I enjoy a lot. For example, I have some favorite places (Which I won't be sharing. Be assured, finding your own places would be much more satisfying.), I sometimes toggle off the running mode, and randomly walk at these places again and again, for hours, never getting bored. I also find books in Skyrim very exciting (There are countless in-game books which you can read. Each one of them are written exclusively, with its unique content.), I have a great intrest in collecting and reading them, and I actually find some of them way more intriguing than many 'popular' real books. Some of which I can recommend: Rising Threat (4 volumes), The Wolf Queen (8 volumes), Kolb and the Dragon (That's probably my favorite book in the game. Not in terms of its story, but it is actually a 'choose-your-own-adventure' type of book.), The Black Arrow (2 volumes), A Dance in Fire (7 volumes). As a side note, in my honest opinion, books in Oblivion were better...  Before finishing, here are some mods that I use especially for my assassin:  - The Dance of Death, a kill-move mod - Higher Jump - Martial Arts - Realistic Crime Radius - Throwing Weapons Redux - Faction Crossbows - Stealth Immersion  And, I suppose, that's all.  In terms of characters, as you can see, making a character totally unique is pretty simple, it's just a matter of will. Skyrim, or any game for that matter, can only provide you the visualization and tools of role-playing; you have to use your imagination for an advanced FRP experience. And in terms of gaming perspective, you now should have an idea about how I feel about Skyrim, and you probably figured out how different you can approach to the game.  In the end, conclusion is actually pretty short, and simple: Skyrim is a must, must, must, MUST have game, and a masterpiece to experience, just like a Mozart concerto, a Shakespeare play, or a trip to one of 7 Great Wonders of the World.",
            "review_score": "1"
        },
        {
            "review_text": "Always fun, the ever growing community additions insure that this game will remain popular and engaging for years to come, just don't shoot yourself in the knee.",
            "review_score": "1"
        },
        {
            "review_text": "DO NOT KILL CHICKENS!!",
            "review_score": "1"
        },
        {
            "review_text": "what can i say? i love this game!  you can do whatever you want, i think the elder scrolls series is one of the only RPGs that is truly open world. don't want to do the main quest? go ahead and wander the big and well crafted world. feel like you need some directions to start your new adventure? do one of the many side quests. you can make your own armours, potions and weapons, though they removed the ability to make your own spells.  now the big question: is it better then morrowind/oblivion? my answer is no, although skyrim is amazing it does not have the same fantasy feeling i got while playin morrowind or oblivion.   8/10 a must own for pc gamers",
            "review_score": "1"
        },
        {
            "review_text": "For 3 years and still, can make you play for hours.",
            "review_score": "1"
        },
        {
            "review_text": "The best game I ever played in my life, perfect atmosphere, perfect combat, history more than perfect, amazing characters.   If on sale buy it. If it isn't on sale buy it.  u'll never get tired of playing this amazing game.",
            "review_score": "1"
        },
        {
            "review_text": "Conclusion on why this game is worth buying:  1. Delicious sweetrolls. 2. Space program with the giants. 3. CABBAGES. 4. Hide and seek with the dead. 5. Chicken. 6. Physics-defying horses. 7. Have I mentioned cabbages? 8. Fresh products in ancient caves/dungeons. 9. Totally-not-annoying immortal children. 10. Mmmm skooma mmmmm 11. FUS RO DAH!!",
            "review_score": "1"
        },
        {
            "review_text": "Best mod simulator on the market.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Would Mod again  One of the best experiences I have had during my many gaming experiences, ♥♥♥♥ the game was so amazing on console I was forced to buy it again on pc, and thats saying somthing due to the fact that half the fun in this game is to see how much you can mod the ♥♥♥♥ out of it until it crashes your poor little pc. Do yourself a favor if you have not tried this game out go an buy it and hopefully have as much fun with it as I have.",
            "review_score": "1"
        },
        {
            "review_text": "Game of the Year. Every series.",
            "review_score": "1"
        },
        {
            "review_text": "What is the music of life? Silence, my brother   10/10 ",
            "review_score": "1"
        },
        {
            "review_text": "Gorgeous! Wonderful! Just perfect!! Definitely the game for the year 2011 and one the best games i've ever played. Bunch of complex missions, infinite sub missions, a huge and marvellous map to explore, awesome fights, great weapons to upgrade and so on...You must play this game!!",
            "review_score": "1"
        },
        {
            "review_text": "The whole idea of selling mods in a game is.... beyond exorbitant. Especially a single player game like Skyrim. Valve, you crossed the line. Here are some clearly addressed counterarguments for 'why Valve should relinquish this pay-for-your-mods system'  If a user creates a mod, they should make it not for the money, but for the whole gaming community and/or for experience. If money is the issue for the modder, then let's face it: they shouldn't be modding just for the sake of acquiring money. However, compensation for work shouldn't be disregarded: a donation system should be set up for the modders.  A paid mod (like dlc) already establishes a new ground between players who can purchase the mod and players who can't. In game type (MMORPGs) this would be admissible, or (insert any multiplayer game within the given parameter). The mods would travel through some kind of quality control and then valve would sell it. However... Skyrim isn't even an MMORGP. It's a singleplayer game. For gods sake, you can't even play this game with other people, and a vast quantity of mods (in the payment section of the workshop) show that there really isn't a quality control.   So far the aftermath of the implementation of this new system has caused modders in nexus to either:  1) take down their work on nexus and sell it here  2) take it down for the sake of preventing people from stealing it.   Shall I go onto nexus (or some other modding website), and sell it here as my own? Maybe use someone else's mod as a base for mine and sell it?   This system really makes it easy to steal other people's work, re-brand it and sell it here for a profit. To steal a mod is very disrespectful to the original author(s) of the mod. This prevents new content from great modders being produced and released in fear of it being stolen. Also, Anyone who takes part of purchasing misappropriated mods will encourage and be apart of this larceny.   Oh, what am I saying? Valve and Bethesda are going to take a 75% cut anyways.  If you don't think this is a big deal, then think about this: In the near future, this whole system could spread to other games, not just Skyrim.",
            "review_score": "-1"
        },
        {
            "review_text": "Wait, who are the greybeards again and when was i supposed to go meet them?",
            "review_score": "1"
        },
        {
            "review_text": "We have 2016 and this game from 2011 is still the best game on the market.  If you don't own it yet. Buy it before TES VI will come out in 2020. ",
            "review_score": "1"
        },
        {
            "review_text": "Great game, ruined by pushing a terrible business model.   1/10.",
            "review_score": "-1"
        },
        {
            "review_text": "Skyrim is amazing, defiantly recommend for medieval lovers. Here is a poem I wrote about Skyrim!  Skyrim   the sky was blue, it was true snowy mountains, huge lands   the one who seeks adventure didn't know what he had inside what he could do, with the power  could he fly, could he reach the sky no, but he was the dragonborn the one and only  who could defeat the ancient ones the ones who could fly, glide and attack track their foes, eat their toes the dragonborn can intake their soul he can kill any sort of troll  sword slashing, kicking and bashing loot the things you have killed sell the items, receive money and then buy a bunny  burn a chicken, raid a house be stealthy like a tiny mouse get married or become a wizard like Harry Potter level up by doing quests to become the best  but now you're crying because the villager was lying then you come back into reality and realise it`s only a game!  ",
            "review_score": "1"
        },
        {
            "review_text": "The game is awesome! The paywall isn't. &gt;.&lt;",
            "review_score": "-1"
        },
        {
            "review_text": "Without mods this game has some serious issues. Trying to charge for mods, especially without quality gurantees or fair compensation for authors, is unacceptable and frankly really gross. I fear for what you're going to do with FO4 and TES6 ;(",
            "review_score": "-1"
        },
        {
            "review_text": "Like most Bethesda games, Skyrim is only mediocre when played without mods. With mods, the games cool factor rises a million times over. Mods let you change almost every element of the game, adding immeasurable fun, and replay value. With that said, this is going to be a negative review because Bethesda, and Valve, have enabled a system where modders can now sell their mods on Steam.   This act has already led to some modders pulling their mods from free sites like Nexus. Why is it a bad thing for modders to be paid for their work? Because that's not what modding is all about. I also mod, but I would never charge someone for something that is essentially done for fun, and with the notion of sharing with others. Modding has always been something done by the fans of a game, for other fans of the game.   For companies like Steam, and Bethesda, to try to monetize that, is nothing more than greed. And get this, the modders only recieve 25% of what they charge for their mods. Guess who gets the other 75%. This move sets a really bad precedent for things to come. You may not play Skyrim, but what if Valve started doing this to all their games? Modders for all games could potentially start charging people, and then the whole modding community would just turn into a huge market that nets big money for greedy corporations.   So, though I had fun with it in the past, I do not recommend Skyrim to anyone. It's your call to get it, but when the only thing that makes the game any good, is about to become paid DLC, that's when the game turns foul in my mind.",
            "review_score": "-1"
        },
        {
            "review_text": "If I were to write a full review of this game, it would be nearly novel length. I would discuss all of the faults and failings of Skyrim, of how Bethesda took the generic route for more profit while selling out essentially everything that made Elder Scrolls worth playing, all while butchering the lore to cover their changes.  Classes, a starting birth sign, the total nerf of all things magic, things like hand to hand being rolled into perks, the removal of stats, a whole class of armor being removed, reduction of armor pieces, the lies about spears, the broken marriage system, the dull civil war, the normalizing, and thus dulling effect on battling dragons, lore and plot hiccups and so much more could be covered.  But instead, I can summarize it all with one message; I only bought this game because it could be modded. Really, the only reason why I even have well over 1000 hours in Skyrim is because of mods. On its own, even without ripping into every flaw, mistake, horrible design choice, the mountain of bugs and the aging engine that they still haven't bothered to work out flaws like the stuttering, Skyrim is not worth playing for more than a few hours. It holds no merit on its own, other than being open to modding.  People can disagree, of course. There are a lot of people who still play it to this day on consoles, without the ability to mod. To them, I do not ask why, because it would solve nothing. I would still disagree with them. To me, this game is a flawed mockery of Elder Scrolls and the only thing that saved it is the modding community.  I hold no hope for the future of Elder Scrolls, not after this game, and not after the way Bethesda so causally almost destroyed the community with their greed.",
            "review_score": "-1"
        },
        {
            "review_text": "Well, everyone else is making these ♥♥♥♥ing negative reviews about the paid mods, so here is mine.......this is ♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "The perfect game to make an epic journey. Will suit many playstyles and player preferences, and most likely even excel it in the process. Of course I recommend it, it's obviously one of the best RPGs ever out there!  P.S.: ...Just installed it again and played for like 4 hours without a break. Damn it, it's so immersive!",
            "review_score": "1"
        },
        {
            "review_text": "the male nudity mod has inspired me to put more ♥♥♥♥♥ in my next book  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Was great with mods, now Bethseda has robbed us all of everything we once held dear... Bethseda can keep their future games and modders can keep their content. I have a real life and I'll just keep living it instead of buying future products. Go find your fun with a different game. Bethseda doesn't deserve your money!",
            "review_score": "-1"
        },
        {
            "review_text": "Paid ModS? lol - ♥♥♥♥ that. Going to delete avery geme from them that is on my likt  ",
            "review_score": "-1"
        },
        {
            "review_text": "Well done Bethsoft + Valve. YOU ♥♥♥♥ED IT UP!",
            "review_score": "-1"
        },
        {
            "review_text": "vanilla game was ok, maybe a 7/10  mods made it great and a truly legendary game 10/10...  BUT...  now some mod creators are taking down their free 'for the community and love of the game' mods and putting them behind a pay wall, pure greed. if the mods were worth paying for then people would have donated if you let them.  even worse is some mod creators are taking down their mods elsewhere because they don't want them to be stolen and sold on steam...  this game needs 100's of mods to be added to it and maybe 100's more hours in trial and error testing of mod compatibility with other mods to make it worthy of the 90%+ rating it has and that could end up costing you £100's in mod microtransactions now if the creators sell out.  and a lot of mods need other mods and software to work such as skse and enb etc, so there's going to be people wrongly profiting from other peoples work, if you support that then buy this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Pay for mods.  Valve has betrayed us.",
            "review_score": "-1"
        },
        {
            "review_text": "I can't recommend any Bethesda games if they are going to destroy the best (even arguably the only) thing about them.",
            "review_score": "-1"
        },
        {
            "review_text": "Get rid of charging for mods.",
            "review_score": "-1"
        },
        {
            "review_text": "In what universe did 25% to the creator seem like a good idea; donations went 100% to them. Bad reviews for bad business practices, not to mention it was an inferior product compared to Oblivion and Morrowind. Damn shame.",
            "review_score": "-1"
        },
        {
            "review_text": "mods=money=bad",
            "review_score": "-1"
        },
        {
            "review_text": "I feel bad putting a not recommended for such a good game, but this paid modding can't go any further, and someone needs to get the message.",
            "review_score": "-1"
        },
        {
            "review_text": "The biggest DLC scam on Steam now. Don't buy this crap.",
            "review_score": "-1"
        },
        {
            "review_text": "I can only recommend this game heavily modded, and even then barely. Vanilla, this game an insult to Bethesda and the Elder Scrolls franchise. Grossly oversimplified trash, much like Fallout 3 when compared to it's far superior predecessors.",
            "review_score": "-1"
        },
        {
            "review_text": "Like practically all Bethesda games, The Elder Scrolls V: Skyrim usually is a rather bland experience unless you pack a plethora of mods onto it that fix potentially gamebreaking bugs, add new mechanics or bring back those whom Bethesda couldn't be arsed to continue, import custom art assets, sounds, music, or create entirely new experiences with new quests or sometimes even entire continents.  It is no secret that the fantastic success of TES games from Morrowind onward came and comes from its vibrant modding community. For almost ten years by now, modders have transformed their enthusiasm for TES games into (usually) well-crafted mods that greatly enhanced the experience of the base game. And these mods were free - they were a community thing, something which people produced because they liked the game but thought they could make it just a tad better by adding this or tweaking that. And again, they usually were right with that.  Then some particularly bright heads over at Valve and Zenimax added the option to demand a price for fan mods. Even if you overlook the fact that the modder only gets 25% of the revenue his or her mods generate, this change will mean that many mods will no longer be created because the modder liked the game, but because s/he is in for a quick buck. What does that mean?  1. Essential tech mods that are required to run other (free) mods may go commercial. SkyUI, an interface mod many free mods rely on has already removed its own free version, breaking hundreds of other mods. 2. The same holds true for bugfix mods. Want to play the game without bugs? Better pay twice, once for the game itself, and once to get it to run without problems. 3. Art assets from free mods -WILL- be stolen and used in commercial mods, most likely without the consent of the original author. Valve can not possible hope to effectively regulate this, and even the original creators can not sift through dozens of different mods to see whether they are using assets created by them. 4. Developers may start to intentionally leave interesting mechanics out of the game, knowng the modding community will add them sooner or later - and that they can use this to cash in on the players twice.  And that's just some of the problems paid mods will bring about. As far as Valve or Zenimax do not remove the option to create paid mods for this game, I can not and will not recommend buying it. TES Games rise and fall with the modding community, and the powers are trying to cash in on it.",
            "review_score": "-1"
        },
        {
            "review_text": "Love the game more then I can explain.   Paying for mods? Nope",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ paid mods. To very negative we go",
            "review_score": "-1"
        },
        {
            "review_text": "Skyrim is nothing compared to Oblivion or Morrowind.",
            "review_score": "-1"
        },
        {
            "review_text": "0/10: The origin of paid mods.  The game that destroyed PC gaming's best feature. (FREEDOM.)  It literally destroys what modding is. (raw and free creation, within the hobby)  Now it's a PRODUCT, bound to business rules and ratings. It's like console DLC, but off-brand.  ....................../´¯/) ....................,/¯../ .................../..../................ ............./´¯/'...'/´¯¯`·¸............ ........../'/.../..../......./¨¯\\........ ........('(...´...´.... ¯~/'...')........ .........\\.................'...../.......... ..........''...\\.......... _.·.......... ............\\..............( ..............\\.............",
            "review_score": "-1"
        },
        {
            "review_text": "This is about as good as it gets as far as RPG's go...  For a complete and not full of ctd's experience get all Unoffical patches from Skyrim  Nexus.com  and the Skyrim script extender together should solve most or all of your problems.  9/10 for the endless bugs.",
            "review_score": "1"
        },
        {
            "review_text": "I cannot in good faith tell you to buy this game, not with the new introduction of paid workshop/mod content. This is the most ridiculous thing I have ever seen. People will say 'well just dont buy it' and i say to them F*ck you this shoudlnt have even been an idea EVER. This type of mindset will only bring about more nonsensical ways to get into your pocket. We as gamer's need to stop this and stop it now.  Edit: On April 27 2015, Valve finally surrendered thus ending the war. I leave the original review here for historical reference.",
            "review_score": "-1"
        },
        {
            "review_text": "Workshop is full of cheap looking mods done in 3 minutes and priced 2 times more expensive than the whole game. No reason at all to buy this game.",
            "review_score": "-1"
        },
        {
            "review_text": "You know I used to like this game. I used to have a postive review on this game and was planning to get back into this game. But Bethesda and Valve decided to do something that not even EA would do and that is force paying for user created Mods. Yes I understand that no work should be done for free and yes I do agree hat modders should get rewarded for their work and dedication. BUT i don't agree that I should be forced to pay for Mods, that is why donations exist.   Since the dawn of PC gaming Mods has always been free and this should never change. The reason Mods exist is because gamers want to show their passion for a game they love and extend the life of the game and share their dedication to other people. As a result people would donate to show their appreciation to the modders dedication. But now that time is gone apparently because now apparently people are as greedy as ever.   What happens to the people like myself who already donated money to modders but now have this pay wall to force pay a particular mod? This is shady business practice and if this doesn't change soon then pirating will become a bigger issue and everyone will lose. Till then I don't recomend the steam version and the pirated version seems the better choice to show that this new business practice is huge mistake.",
            "review_score": "-1"
        },
        {
            "review_text": "It was fun but paying for mods just ruined the whole game.",
            "review_score": "-1"
        },
        {
            "review_text": "Free mods is what made this game great. The vanilla game is bland. Can no longer recommend this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Until Steam changes this mod policy I'm going to have to give Skyrim a negative review.",
            "review_score": "-1"
        },
        {
            "review_text": "yeah lock all your mods behind a paywall its not like it's gonna cripple your game",
            "review_score": "-1"
        },
        {
            "review_text": "Pay for mods is something that EA would come up with, just pure evil. Greed is a terrible thing for the consumer.",
            "review_score": "-1"
        },
        {
            "review_text": "Supports paid mods",
            "review_score": "-1"
        },
        {
            "review_text": "Paid mods = boycott on future games",
            "review_score": "-1"
        },
        {
            "review_text": "Paid Mods take an otherwise great game and turn it into something I don't want to support anymore. Based on that alone I can no longer recommend this game. This is damaging to the PC gaming and modding community.",
            "review_score": "-1"
        },
        {
            "review_text": "EDIT: Valve has removed the paid mods feature due to the backlash, thankfully. I'm still keeping this up because I remain VERY skeptical of them, their 'announcement' felt as if they'd be willing to try paid mods again on a game without an already established gaming community. Considering their very terrible customer support and cashgrab 'innovations' I don't think they deserve to have the consequences of this final straw undone until they improve. Let this be a reminder of the pinnacle of corporate greed.  -  Hop off the greed wagon, Valve. Way to destroy the gaming industry as we know it with your ♥♥♥♥, paid mods was the final straw. You've officially become worse than EA with your horrible, greed-driven decisions. And I suppose TESO didn't quite give you the bucks you liked so you decided to cash off your own modding community, Bethesda? Good job.  Nexus Master Race.",
            "review_score": "-1"
        },
        {
            "review_text": "Pros:  Vibrant modding community (before a few days ago)  Cons:  Base game is terrible Have to pay for mods",
            "review_score": "-1"
        },
        {
            "review_text": "The game is a bit flawed, but mods fix that Too bad the mod community has been torn apart by greed. Get ready to pay extra to fix the game you paid for",
            "review_score": "-1"
        },
        {
            "review_text": "I loved this game. But I can't stomach paid mods. Donate button yes. Paywall no.",
            "review_score": "-1"
        },
        {
            "review_text": "Paying for mods? Hell no.",
            "review_score": "-1"
        },
        {
            "review_text": "This game was great before paid mods. Now I wish I never bought it!",
            "review_score": "-1"
        },
        {
            "review_text": "Paid mods are my limit. I will not accept this.  Modding is about the passion of the hobby, it is NOT a business venture.",
            "review_score": "-1"
        },
        {
            "review_text": "Paid mods have had a negative impact on my skyrim experience.",
            "review_score": "-1"
        },
        {
            "review_text": "Paid community workshop addons isn't the way to go. Why the ♥♥♥♥ do we have to monetize everything.",
            "review_score": "-1"
        },
        {
            "review_text": "Paid workshop for mods, nuff said. Piece of shoite",
            "review_score": "-1"
        },
        {
            "review_text": "Bethesda and Valve are trying to charge players for mods, so I am changing my review.",
            "review_score": "-1"
        },
        {
            "review_text": "Paid for mods, I would skip unless you enjoy DLC simulator 2015.",
            "review_score": "-1"
        },
        {
            "review_text": "This was a fantastic game mostly for the strength of its modding community, Bethesdas bugs where patched, content enriched and interfaces improved. Mods kept the game relevant years after its release, Bethesda and Valve chose to thank the modding community for there work by splitting us in the interest of promoting their own micro transaction fueled cash cow.",
            "review_score": "-1"
        },
        {
            "review_text": "If I wanted to get ♥♥♥♥ed by Gaben I would have brought lube :^)",
            "review_score": "-1"
        },
        {
            "review_text": "While skyrim is a fantastic game, I can no longer recommend it due to the paid-mod debacle.",
            "review_score": "-1"
        },
        {
            "review_text": "Keep your paid mods.",
            "review_score": "-1"
        },
        {
            "review_text": "The Fall of Skyrim.",
            "review_score": "-1"
        },
        {
            "review_text": "Wanted to start playing it but now i wont, because i do not want to pay for mods, because the money from purchases is mostly going to valve and bethesda game studios instead of to mod developer. Not fair.",
            "review_score": "-1"
        },
        {
            "review_text": "Birth of dlc 2.0. Originally bought the game for free modding.",
            "review_score": "-1"
        },
        {
            "review_text": "This game and community was amazing until this paying for mods fiasco started. I do not recommend this game until steam's pay for mods workshop ends.",
            "review_score": "-1"
        },
        {
            "review_text": "Valve and Bethesda joined hands to venture to the dark side, I do not support. Rise to fight for free mods!",
            "review_score": "-1"
        },
        {
            "review_text": "dont pay for mods people. are you actually insane, valve?",
            "review_score": "-1"
        },
        {
            "review_text": "Way to go valve.",
            "review_score": "-1"
        },
        {
            "review_text": "Payed Mods ..... NOPE!!!",
            "review_score": "-1"
        },
        {
            "review_text": "pay money for mods...  0/10 IGN",
            "review_score": "-1"
        },
        {
            "review_text": "This negative review is prompted by Valve's new practice of selling mods and passing it off as a courtesy to the mod creators, all the while taking the lion's share of the profits.  Want to really support mod creators? Remove this atrocity of a paywall and add way of donating to the authors directly.  Use NEXUS for mods.",
            "review_score": "-1"
        },
        {
            "review_text": "Thank you Valve for removing Paid-mods!!  Skyrim is an Awesome Game, but at the end the Mods make it the game it actually is :D",
            "review_score": "1"
        },
        {
            "review_text": "Who's rapping? Dovahkiin Dragons? I'm not over keen I'll dice them like a knife Slicing right through an aubergine. My dragon shout flow Is sweeter than a SodaStream You won't belive your eyes I'm like an overload of dopamine A broadsword in one hand,and a magic spell in the other. I'm the last of the Dragonborn There's no other,my brother so run for cover. If you've got scales,then I'm on your tail,and I will not fail. Like a free-roaming sandbox game. I'm off the rails,I'll walk the trail,through awful gales,and storms of hail. 'Til all the nails Are knocked into your coffin,I'm not stopping. 'Til you're impaled,and I've prevailed. In the name of the Nords,I pray to the lords. You all get a taste of the blade of my sword. I'm taking on hordes of enemies,I face them with hoards of weaponry. They're draining my force,so chemistry comes into play with retorts and recipes. Alchemixing like a DJ,Restoration,restore my energy. My legacy,odyssey,elegy,prophecy's,written in heavenly bodies,and buried with every body that ever did bother to mess with me deading them terribly,horribly,I'm a celebrity,honestly,you're a wannabe,I'm a prodigy. The suggestion you're better than me at being a warrior? Ha! comedy. It's a gift to me,I don't just spit flames lyrically,but literally,and the Elder Scrolls are scripts,in witch I've written your obituary. I am the Dragonborn,wearing a hat with badass horns. I'm Dovahkiin,known globally,You're nobody at all. =) BY DAN BULL )",
            "review_score": "1"
        },
        {
            "review_text": "A great game, but the mod community got backstabbed by a greedy Bethesda and Valve looking for more money out of nothing. Play it while the mod community is still alive.",
            "review_score": "-1"
        },
        {
            "review_text": "I would've recommended this game in the past, solely because it can be fun when modded heavily. However, with paywalls leading to a schism in the community, I can no longer recommend this game for purchase.",
            "review_score": "-1"
        },
        {
            "review_text": "Monetizing mods will put the overjustification effect in full swing.",
            "review_score": "-1"
        },
        {
            "review_text": "The game was fantastic with mods. Unfortunately, Valve and Bethesda decided that you should now pay for the things that fix the game. Bethesda, you released a broken-♥♥♥ terribly consolized game and you're now expecting people to pay for the mods that fix it?  And not only that, but the creators- you know, the ones that're actually doing the work- only see 25% of the profit while Valve and Bethesda split the other 75%. So not only are you screwing the consumer, you're also screwing the modding backbone. Bethesda and Valve have singlehandedly destroyed the potential lifespan of this game, and I absolutely recommend that you DO NOT BUY THIS.",
            "review_score": "-1"
        },
        {
            "review_text": "So it seems that valve and bethesda have gotten rid of the paid mods. Good. But, there is still the fact that they did this to us in the first place. They should have at least asked us first, and most of us would have said the obvious choice: a Donate button. It would have been smarter all together. Its so sad as well, since the damage has been done. Some mod makers will never come back for being bashed like they did. Also the fact that half the mods charged 99$ just for making lydia 2% stronger was stupid as well. Hopefully, this is where this 'paid mods' crap ends for these games...Although, I only think this is just the beginning.I hope valve/bethesda got what they wanted.",
            "review_score": "-1"
        },
        {
            "review_text": "Paid mods..,. well i guess you can't spell Steam without EA.  Instead of paid mods allow for donations. Allow modders to setup crowdfunding campaigns for the mods they are making.  I will not pay for mods and just pirate them.",
            "review_score": "-1"
        },
        {
            "review_text": "Thanks Valve, for ♥♥♥♥♥♥♥♥ on the work of modders and the experience of gamers. This game was one of the best of all time, Bethesda, but your new greedy model has turned this game into a dark blob in the history of PC gaming. ♥♥♥♥ off.",
            "review_score": "-1"
        },
        {
            "review_text": "Just despicable, loved the skins on CS:Go but mods on Skyrim are different",
            "review_score": "-1"
        },
        {
            "review_text": "This negative review is prompted by Valve's new practice of selling mods and passing it off as a courtesy to the mod creators, all the while taking the lion's share of the profits.",
            "review_score": "-1"
        },
        {
            "review_text": "Play with 200 mods? Pay 1000€ extra!",
            "review_score": "-1"
        },
        {
            "review_text": "    PAID MODS MAY COST MORE THAN ADVERTISED  ",
            "review_score": "-1"
        },
        {
            "review_text": "    PAID MODS MAY COST MORE THAN ADVERTISED  ",
            "review_score": "-1"
        },
        {
            "review_text": "bethesda's greed simulator, all the cash from games sales and dlc sales is not enough now they want more cash from the sale of mods",
            "review_score": "-1"
        },
        {
            "review_text": "This negative review is prompted by Valve's new practice of selling mods and passing it off as a courtesy to the mod creators, all the while taking the lion's share of the profits.  Want to really support mod creators? Remove this atrocity of a paywall and add way of donating to the authors directly",
            "review_score": "-1"
        },
        {
            "review_text": "charging money for mods is greedy and disgusting, especially when you only give those creators 25% of the cut, oy vey gabe you running out of shekels or something",
            "review_score": "-1"
        },
        {
            "review_text": "in response to adding pay for mods copied from reddit user /u/Martel732   It is changing a system that has been working fine. Modders aren't an oppressed class working without benefit. Modders choose to work on mods for many reasons: fun, practice, boredom, the joy of creating something. And gamers appreciate their contributions. While, some gamers may feel entitled most understand that if a modder is unable to continue the mod may be abandoned. Donations may or may not help but they are an option. This system has for years made PC gaming what it is. Modding in my opinion is the primary benefit of PC gaming over console. Changing a functional system is dangerous and could have unintended consequences. Now that people are paying for mods they will feel entitled for these mods to continue working. If a free mod breaks and isn't supported that is fine because there is no obligation for it to continue working. If someone pays though they will expect the mod to be updated and continue working as the base game is updated. Furthermore, abandoned but popular mods are often revived by other people; if these mods are paid then the original creator may not want people to profit off of updated versions of their mod. Related to the above paid mods may reduce cooperative modding. Many mods will borrow elements from other mods; usually with permission. Having paid mods will complicate things. Someone who makes a paid mod will be unlikely to share his/her work with others. What if someone freely share's his/her mod and someone incorporates it into a paid mod? Does the first mod's owner deserve compensation, does the second modder deserve the full revenue. This makes modding more politically complicated and may reduce cooperation. This may reduce mods based off of copyrighted works. There is a very good chance that any paid mod based off of a copyrighted work will be shutdown. Modders could still release free mods of this nature but it complicates the issue. Many mods based on copyrighted materials borrow (usually with permission) from other mods to add improvements. If these other mods are paid then the original creators likely won't let them use it. Additional many modders may now ignore copyrighted mods in order to make mods that they may profit on. Steam/the developer are taking an unfairly large portion of the profit. Steam and the Developers are offering nothing new to the situation. Steam is already hosting the mods and the developer already made the game. They now wish to take 75% of all profit from the mod. If the market gets flooded by low-quality paid mods, the modders will likely make very little and the quality of the game will not be increased. However, Steam and the Developers will make money off of no work on there part.",
            "review_score": "-1"
        },
        {
            "review_text": "I can no longer reccomend this game now that you can pay for mods.",
            "review_score": "-1"
        },
        {
            "review_text": "I don't reccommend this to anybody until paid mods are removed.",
            "review_score": "-1"
        },
        {
            "review_text": "Paid mods. brillian idea /s",
            "review_score": "-1"
        },
        {
            "review_text": "A game that used to be an amazing sandbox constantly kept fresh and interesting thanks to the incredible work of the modding scene has now been transformed into a disgusting cashcow and moneygrabber by Bethesda and Steam.  Thank to them, we now have skin packs that cost more than the game itself and are of a much lower value and quality than dozen others free mods. What will happen when some of those expensive mods conflict between each others, or are not supported anymore (if they ever were) by their creators?   Keep in mind also that the whole argument of 'supporting modders' is completely fallacious, considering that they only receive a small minority of the profits made from those mods, the lion's share going, without a surprise, to Bethesda and Steam.  We criticized heavily Bethesda for the horse armour in Oblivion, but this change goes beyond any of the worse nightmare we could have had.",
            "review_score": "-1"
        },
        {
            "review_text": "I very rarely review games. Most people can say what I want to say, but better. However... It breaks my heart to give such a wonderful game a negative review, I have loved every hour in-game, but as soon as users started improving an already great game, I felt I had found a game to stick with for years, and I always enjoyed checking the latest MOD offerings since the game first came out... Now I shall be uninstalling (even with all the actual DLCs I payed for) as a simple, insignificant gesture to Steam. You have enough money Gabe, why destroy the undeniably great Steam community for a few more $$$s. Please, have a heart, and keep PC gaming king :)))  -(edit 28/04/2015, 00:10)- Thank you Steam for at least admiting this idea of yours still needs work. I fully and totally agree MOD creators should recieve compensation for their incredible efforts, however, the starting prices were, well, unreal... and if you are doing it for the MODDERS, think about what cut they get for all their work. Multi-national companies are getting 10-15% charge to have their games hosted on Steam, why so high for the individual creators?...  Great idea in theory. please work on the details some (a lot) more, so more people make more awesome MODs, and all get fairly compensated after all is said and done.",
            "review_score": "-1"
        },
        {
            "review_text": "Valve's new paid 'mods' is yet another excuse for more money. For those who didnt know, valve gets 75% of the profits from each 'mod' purchase. I say 'mods' because its more like paid DLC now. Just go to  nexusmods.com ",
            "review_score": "-1"
        },
        {
            "review_text": "I No longer reccomend this game to someone who wants a prolonged expirence, Valve Has issued an 'Order 86' and monopolized pc gaming and now charging for mods? No DO NOT buy this game OR buy mods, you are just fueling the fire for the money grubbers. Boycot. Boycot. Boycot. why would you put over 100 dollars into a game that came out so long ago? Is Common sense, think with your wallet.",
            "review_score": "-1"
        },
        {
            "review_text": "I did not play this game much due to modding  I did do a lot of modding  Skyrim is mod, Skyrim is life. Gaben is love, Gaben is life  Now: Zenimax are greedy, Bethesda are ♥♥♥♥♥♥♥s. Gaben is 'MOD', Gaben controls!  Why you take duh modding from me?",
            "review_score": "-1"
        },
        {
            "review_text": "This game is cool. I beat a lot of the core game. I was getting back into it and was about to start downloading mods - then I find out I have to pay for them.   Stop this bull ♥♥♥♥. I paid for the game. Give me mods for free you ♥♥♥♥ing ♥♥♥ holes.",
            "review_score": "-1"
        },
        {
            "review_text": "The game itself is fine, but Paid mods are a major setback, prohbitively so for all but those with the unfortunate combination of no sense and infinte wealth. Mods were something the COMMUNITY shared with eachother, now everyone is just a shill for their new, super-special DLC.  Hopefully modders will recognize the community aspect of their modding is important, and will continue to offer mods for free.",
            "review_score": "-1"
        },
        {
            "review_text": "I am now blessed with buying an 'extra apple' mod for multiple times more money than a real apple. Gotta get dem dollarydoos.",
            "review_score": "-1"
        },
        {
            "review_text": "This negative review is prompted by Valve's new practice of selling mods and passing it off as a courtesy to the mod creators, all the while taking the lion's share of the profits.  Want to really support mod creators? Remove this atrocity of a paywall and add way of donating to the authors directly.  -not my words, but I stand by them.",
            "review_score": "-1"
        },
        {
            "review_text": "Paying for mods is not okay. Free mods are why games like this are so popular.",
            "review_score": "-1"
        },
        {
            "review_text": "Valve and Bethesda has killed this game and made it even more un ♥♥♥♥ing likable than the base game was. Congrats.",
            "review_score": "-1"
        },
        {
            "review_text": "Gotta pay for mods so I do not recommend it",
            "review_score": "-1"
        },
        {
            "review_text": "The game is great. The paid mod situation is not.",
            "review_score": "-1"
        },
        {
            "review_text": "Good job on completely destroying the mod community",
            "review_score": "-1"
        },
        {
            "review_text": "Now that you have to pay for the mods, why bother....  I'm gonna get a store copy and downloads some mods elsewhere.",
            "review_score": "-1"
        },
        {
            "review_text": "Paid Mods. this should be enough information. Pirate the game and get the mods from nexus or other people who are hording them on disks",
            "review_score": "-1"
        },
        {
            "review_text": "Having played 90+ hours of Skyrim this past week, I figured that I should write a review on it.   First of all, I had to said this is an amazing SandBox+ RPG experience. I am someone who enjoyed doing side quests as well as misc quests as a mean to earn more money. I got to say that till now I had not finish the story as there are so much more to do. I was pleasantly surprised initially when I see people with over 2000~4000+ hours of gameplay time. All I can say is Skyrim had just that much content especially if you include all the DLCS.  I mean just building a single house took me more than 2 hours, not to mention the fact that I had to design and decorate my own house. It pretty much a chore that feel great after you are done with it. I am also barely done exploring Skyrim after 90 hours in, the combat are extremely fluid and animated especially when you do a sneak attack.  There are many other great elements in Skyrim such as pick-locking which can be extremely frustrating but fun to play around with. I had never been this impressed with a RPG before and I definitely think Skyrim is by far the best I had played so far for this price.   The story itself is alright and the gameplay can get boring after some time. Thankfully, we had workshops and mod to further enhance the gameplay. Skyrim as a standolane is great but mods and workshops bring it to a different level.",
            "review_score": "1"
        },
        {
            "review_text": "With modifications to it, the Skyrim experience was an amazing one. It was a world with depth, magic, and mystery around every corner. Unfortuantely, the recent changes to mods have burned what was a great experience to the ground. It can't ever be what it used to be again.   Vanilla Skyrim: 6/10",
            "review_score": "-1"
        },
        {
            "review_text": "Thank you for fracturing the modding community. I hope losing all of the trust you built up was worth it.",
            "review_score": "-1"
        },
        {
            "review_text": "Paid. Mods.",
            "review_score": "-1"
        },
        {
            "review_text": ".",
            "review_score": "-1"
        },
        {
            "review_text": "Paid mods. Get your ♥♥♥♥ together valve and add a donation optional button like the Nexus.",
            "review_score": "-1"
        },
        {
            "review_text": "Solid game, but with the addition of paid mods? I cannot safely say the game will have a positive impact on the community for much longer.  If said paid mods were a new location or expansive questline? It'd be worth it.   But instead we have clipping armor and lore unfriendly swords that you can download elsewhere.",
            "review_score": "-1"
        },
        {
            "review_text": "PAID MODS!!.... which one of you corrupt ♥♥♥♥♥♥ thought of this idea? isn't your wallet getting fat enough from all those dlc's you bring out?",
            "review_score": "-1"
        },
        {
            "review_text": "Bethesda Says:  'Modding has been important to all our games for such a long time. We try to create worlds that come alive and you can make your own, but it’s in modding where it truly does.'  And they are absolutely correct.   They follow with:  'Thanks again for all your incredible support over the years. We hope steps like this breathe new life into Skyrim for everyone. '  And with ther latest move with the help of Valve, they've assured the opposite.",
            "review_score": "-1"
        },
        {
            "review_text": "This is the death of the small mod, well done to those involved. Anyone posting counter reviews have no foresight",
            "review_score": "-1"
        },
        {
            "review_text": "The entire point of getting this game on PC is modding to make it better. Valve ruined it with making mods paid. Don't support them.",
            "review_score": "-1"
        },
        {
            "review_text": "My Thoughts About This Game:  This Game Is Just Glorious Upon My Nipples!! :D It Makes My Nipples Burn With Joy, It Gives Me Happiness And Excitement!! I Freaking Love This Game, I've Played Over 500 Hours On It!! ;D This Game Is Just The Flawless Victory Trust Me, Buy It!! :D The Bugs Are Basicly The Only Bad Thing, But They Get Patched Over Time!! :D There Are Mods To This Game Also, They Are The Best Of Almost Everything. :D The Dawnguard DLC Is Just a Glorious DLC. I Love It!! :D The HearthFire DLC Is Good For The Family Man, The One And Only. The DragonBorn DLC Seems Pretty Impressive And Awesome For That Matter.  My Grade: 9/10. Basically, I capitalised every letters to show how awesome it is. :)  // Jimi.",
            "review_score": "1"
        },
        {
            "review_text": "Paying for Mods is a slippery slope that will eventually destroy what makes PC gaming so great. I refuse to support this level of greed.",
            "review_score": "-1"
        },
        {
            "review_text": "Paid mods now",
            "review_score": "-1"
        },
        {
            "review_text": "Someone at ValvE thought putting things that have been free for a decade behind a paywall was a good idea. SPOILER ALERT: It wasn't.",
            "review_score": "-1"
        },
        {
            "review_text": "If you're skilled enough, and not a pansy, you can beat a dragon to death with your bare fists.  If that didn't convince you, go back to CoD.",
            "review_score": "1"
        },
        {
            "review_text": "Steam AND Bethesda have let us down, after all these years of supporting PC gaming they have finally let slip the intentions they most likely always had.  The guys up top never cared about us, they only cared about our wallets and it's only that they have only been extremely good at hiding it why we have followed them for such a long time.  ♥♥♥♥ you Valve.",
            "review_score": "-1"
        },
        {
            "review_text": "Not worth it.",
            "review_score": "-1"
        },
        {
            "review_text": "This review is positive for only $9.95  You get the point ಠ_ಠ",
            "review_score": "-1"
        },
        {
            "review_text": "Maximum Jewery detected, authorizing full shutdown of community support.  Won't be giving my shekels to someone who MAKES me pay for a mod.   'Pay what you want' is more tolerable, but still unneeded.  Coming from an 11 year Steam user, this makes me sick... like cancer ridden sick.",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ paid mods and this game",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this game but now I can't afford to mod all the bugs :(",
            "review_score": "-1"
        },
        {
            "review_text": "Need to pay modders (75% to Bethesda) to fix stuff Bethesda should've fixed on release.",
            "review_score": "-1"
        },
        {
            "review_text": "This game and this company was my favorite franchise in this entire gaming world. The feel of the game and fun was boundless, however now they have become scum. Bethesda you disappoint me so much, They are now charging for paid mods and i highly recommend you do not buy this game, i do not plan on buying future games from this company and from steam altogether. This is the biggest backstab in the back in the history of gaming, Valve/Bethesda is taking 75% of the profit from MODDERS work and only giving them 25%. That is them literally taking 3/4ths of the money for doing NOTHING. That isnt the reason though, they just ruined the modding/skyrim community aswell with this and they are trying to ignore it and force this on us. They won't be giving us support when our paid mods conflict with each other or break either, overall this company and bethesda have become scum.",
            "review_score": "-1"
        },
        {
            "review_text": "Valve cashing in on user content? Hell no.",
            "review_score": "-1"
        },
        {
            "review_text": "Mods are required to enjoy the game. You need to be a mod professor to get it to work without crashing if you want to install anything more advanced than additional hats.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't let paid mods ruin this masterpiece of a game.",
            "review_score": "-1"
        },
        {
            "review_text": "After the paywall to mods i could not recommend this game to anyone. I have a played over 450 hours and still not beat the game. That is how much I love this game. Thank Valve for f*cking it up for everyone!   *I have donated planty to modders. All you need is a donate button.",
            "review_score": "-1"
        },
        {
            "review_text": "I love this game. I love it more then the fallout series. I played fallout 4 for 20 minutes and it just didn't grab me like the Elder Scrolls V Skyrim, even after a few years after it's release, I still play this game, and I'm really passionate about modding the game. I think the Elder Scrolls Series is the best game on the planet. It gives gamers options, the story is funny, interesting and keeps the player on the edge. I love the fact that Bethesda gives us the tools to create mods for the game. I'm currently building the Forbidden Island a large new tropical world space, and I feel like there is no end to this game. My favorite types of games are open ended, and my all time favorite game so far is Skyrim. I can't wait for the next installment. Bethesda can surely create epic games. I love the introduction as well, it's very immersive and it automatically captured my attention. I do miss some elements from Oblivion, but Skyrim is still an overall better game. I expected more from the main story though and I felt it ended with the player wanting more, I guess that's where the mods kick in. The guilds we're also fun to play through, and the voice acting was solid. Overall I guess this game is a 10 out of 10.",
            "review_score": "1"
        },
        {
            "review_text": "No to paid mods. Remember this game was near perfect with 'FREE' mods, not 'PAID'.",
            "review_score": "-1"
        },
        {
            "review_text": "Thanks to Steams introduction of paid mods, the mod community is now threatened due to this new outbreak. Now its not wrong for modders to be compensated for their mods. Then what is the problem of having to pay for mod? Well many mods are being taken from the nexus mod manager and being uploaded by someone else. Efficetively stealing their hard work.",
            "review_score": "-1"
        },
        {
            "review_text": "The game was alright, not as good as Oblivion but not a bad game overall. I give it a Thumbs Down for two reasons: (The first reason has been mostly resolved with the DLC 'bundle' which I'm not sure if it is always available or only during sales.)  1. Those of us that pre-ordered the game STILL have no cheap option to buy all DLC included in the 'Legendary' edition. I paid $60 for the base game with no DLC and 'Legendary' edition is only $40 I think with no option to upgrade from base. Even during a weekend deal on Skyrim the 'Legendary' edition is only $14 while the DLC is $17!? How is the DLC more expensive than the base game + DLC!? Why do they hate their pre-order fans so much and only give good deals to new people?  2. Paid mods. This is not an effort to support modders and give an option for people to make money doing what they love. From what I've read modders only get a 25% cut, that means Valve is taking in 75% FREE MONEY for work they didn't do. Providing a platform for sale does not entitle you to 75% of the profit made on said platform.  tl;dr - If you never played the game, pick up the Legendary edition, it's a fun game ruined by both Bethesda's and Valve's greedy marketing schemes.",
            "review_score": "-1"
        },
        {
            "review_text": "Mod making for any game, was never meant to pay your bills, it was never meant to be an income. No one forces you to make them! You have no right to charge, but people can donate, what's wrong with that setup?. Why not make Bethesda create a better game! Instead of using ♥♥♥♥♥♥♥♥♥♥s to extend its game play! They've been making millions off of you idiots and now they wanna make millions more, you just don't get it, your being used!   ",
            "review_score": "-1"
        },
        {
            "review_text": "DLC is bad. DLC where the developer is unaffiliated with the publisher and only recieves 25% of the proceedings is worse. DLC where the developer is unaffiliated with the publisher and only recieves 25% of the proceedings and has zero quality or compatibility control is horrendous. GabeN is a false prophet, who seeks to lead the PC gaming flock astray. Do not buy. Vote with your wallets, people.",
            "review_score": "-1"
        },
        {
            "review_text": "Paying for mods FUN!",
            "review_score": "-1"
        },
        {
            "review_text": "I spent so many years playing this game - Steam wasn't even logging hours when I first started Skyrim. I love the storylines, the expansions, the user mods, everything.    This was probably the most fun I have had in a modern game, and I recommend it to any adventurer like me.",
            "review_score": "1"
        },
        {
            "review_text": "11/10 will pay for mods to support Beth/Valve and their peasants paid modders Paid mods FTW! I eagerly awaits this model to be adopted across all workshop games!  Well done Valve  ",
            "review_score": "-1"
        },
        {
            "review_text": "Valve turning into EA, bunch of greedy mofos...  Go suck on Gaben's fat chode more, Bethesda.",
            "review_score": "-1"
        },
        {
            "review_text": "Paying for mods that you recieve 75% of the profits from a game that is almost 4 years old? No thanks. A link to the authors paypal page would be apprciated though. They deserve the money. Not you.",
            "review_score": "-1"
        },
        {
            "review_text": "10/10 would replace my life for this game again   -more expencive update-  10/10 would replace my life for this game again",
            "review_score": "1"
        },
        {
            "review_text": "Only reason this game survived as long as it did was the vibrant modding community. Of course Bethesda and Valve thought to themselves, 'If only we could rake in money from this, beyond the money we've made on the fact that this game still sells at 30 bucks.'  Paid mods ♥♥♥♥ed the community. We can only hope this practise is not replicated.",
            "review_score": "-1"
        },
        {
            "review_text": "Greatest game i ever played , had all the features i wanted in a game , seems like it was made for me , huge map , many caves/castles need to be explored , many people need to be saved , homes to be stolen ... , horses to buy , houses to purchase and upgrade , women to marry , weapons to buy/sell/upgrade , skills to be earned , sweet rolls to be eaten , and knees to get shot , 3 simple words , get-the-game.",
            "review_score": "1"
        },
        {
            "review_text": "Let's be honest, vanilla Skyrim is a 7/10 game. Good but, forgettable. Mods is what really made Skyrim shine as a 10/10 game. Mods can significantly change the gameplay of a playthrough for the better. With the possibility that mods turning into the new payable DLC is going to change the gaming industry for the worst. Bethesda introduced DLC in Oblivion with horse armor and that gained momentum for better or worse. Now I take a stand and don't want Bethesda to introduce P2P mods as the new norm for the gaming industry. What'll be next? Having to pay irl money for each quest or each new piece of armor in the next Elder Scroll game? In the next Fallout Game? In any new game post 2015?",
            "review_score": "-1"
        },
        {
            "review_text": "extremely deep game with an amazing modding community, only draw backs are a simplistic leveling system and a combat system that could use a good amount of tweaking.",
            "review_score": "1"
        },
        {
            "review_text": "Nickel and diming take away from an otherwise enjoyable experience. I will be a bit more wary with this developer going forward, since they do not seem to have their customer's long-term interest in mind.",
            "review_score": "-1"
        },
        {
            "review_text": "After steam took the market of mods and now im forced to pay for fixes or ways to improve this game, no i wouldn't recommend this, pirate it with all the DLC and then download some free mods on the Nexus so you can hide the horrendous job Bethesda did with this game compared to Oblivion, you are going to notice that every dungeon is just a cave filled with Draugrs or Spider, only with a Dragon Priest at the end and nothing more.",
            "review_score": "-1"
        },
        {
            "review_text": "Mods are what make Bethesda games worth playing considering they can't be bothered to do the work themselves. With the advent of paid mods, there's no way Skyrim is worth it. Do yourself a favor and pound a nail through your foot. It's more fun than what Valve and Bethesda did to modding.  EDIT: I'm not taking down this review now that the paid mod store has been removed. I want Bethesda to remember this incident when their next game comes along so they don't forget what happened.",
            "review_score": "-1"
        },
        {
            "review_text": "Paid mods will ruin this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Bethesda and Valve are putting mods behind a paywall which require no quality control or assurance of support following upcoming patches. Mods are responsible for many bugfixes and provide life to an otherwise bland, and generic game both visually and gameplay-wise. I would not have purchased this game if I had known this would become an issue in the future.",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this game so I could install mods and play around with it (I already had it for Xbox). Now Valve and Bethesda want me to pay for the game a third time to do what I was told I'd be able to do just by purchasing it the second time. Until they remove paid mods or change they system so that valve and bethesda get no cut of the profits, do not buy this game.",
            "review_score": "-1"
        },
        {
            "review_text": "A bland, boring, souless game that's only great fetaure was an immense modding community that is now divided and partly behind a paywall",
            "review_score": "-1"
        },
        {
            "review_text": "The vanilla Skyrim is average at best and has only a fraction of the magic and imagination of Morrowind.   Mods for this game are the only thing that save it from mediocrity and now Valve have had a brain f*rt and starting putting mods behind a paywall.  The nail in the coffin is that Valve has the gaul to take 75% of the sale before the modder who has done all the work recieves a single penny.  Absolutley criminal.  Do not buy and in doing so support these outragous practices.",
            "review_score": "-1"
        },
        {
            "review_text": "Skyrim with all the DLCs is what I would call my 'warm safe place'.  I won't forget almost sh*ting my pants when I saw first dragon. Thousands of hours later I hunt them like rabbits. ;)  I must admit I've enjoyed Black Hand storyline the most, amazing.   I guess you have to be of certain age to appreciate this kind of effort...  ...still waiting for another chapter for single players.",
            "review_score": "1"
        },
        {
            "review_text": "Because Bethesda try to destroy the free mod community! :(",
            "review_score": "-1"
        },
        {
            "review_text": "paid mods will kill this game",
            "review_score": "-1"
        },
        {
            "review_text": "you can steal a bee 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Mods are now paid DLC. Don't support this ♥♥♥♥♥♥♥t.",
            "review_score": "-1"
        },
        {
            "review_text": "money",
            "review_score": "-1"
        },
        {
            "review_text": "VALVE WHY WOULD YOU EVER DO PAID MODS 0/10- IGN GABEN I DONT WANNA TALK TO YOU ANYMORE YOU PROBABLY GOT TOUCHED IN INAPROPRIATE PLACES AS A KID GO KILL YOURSELF BY PEEING TOO MUCH THAT ALL THE WATER COMES OUT OF UR BODY AND YOU SHRIVEL UP AND DIE AND A LLAMA COME SUP ABD EATS UR BODY THAN IT POOPS U OUT AND LICKS THE POOP AND THROWS IT OFF A CLIFF BUT THE POOP GROWS WINGS AND FLIES AWAY AND EATS ITSELF THEN BILL COSBY COMES IN AND HE'S LIKE JELLO PUDDING AND STUFF BUT THERES NO PRETZELS SO THE POTATO BLOWS UP AND ALL THE CENTEPEDES WEAR CROWNS BUT ONKY ON TUESDAYS BECAUSE THE BLUE FLAMINGOES DIE THE PINK ONES ACTUALLY DONT DIE THEY DISAPEAR INTO ANOTHER DIMENTION WHERE HIPPOES RULE THE WORLD AND THE OFFICIAL CURRENCY IS POOP. IN SHORT I DONT THINK MCDONALDS FOOD TASTES VERY GOOD",
            "review_score": "-1"
        },
        {
            "review_text": "I once had a life, now I have skyrim.",
            "review_score": "1"
        },
        {
            "review_text": "Mods are the reason I purchased this game years after the fact. Paid mods is an outrage. I've donated money to several mod developers in the past to help support their particular vision. ♥♥♥♥ Valve!",
            "review_score": "-1"
        },
        {
            "review_text": "The only game where you have to pay for patches. Stay away.",
            "review_score": "-1"
        },
        {
            "review_text": "If this game was a potato, it would be a good potato",
            "review_score": "1"
        },
        {
            "review_text": "This game stayed on top for so long only because mods were available for FREE. Now that Valve made people pay for the mods this game became useless. Now you can go buy a console and play it there. Thanks Valve for ruining PC gaming with 1 update.",
            "review_score": "-1"
        },
        {
            "review_text": "Oh boy! Don't you just love the smell of paywalls in the morning?",
            "review_score": "-1"
        },
        {
            "review_text": "Was a decent game, the ending was underwhelming, but there WERE lots of mods to play with and lots of ways to try new things. Now you have to pay a couple bucks to find out a mod isn't compatible with this other mod you paid a couple bucks for. I'm all for donations, some modders do amazing work, but a majority of mods are mediocre at best and have a tendency to conflict with other mods. Now modders are taking things off Nexus so they can try to make money for Valve, this has ruined my drive to go back and play Skyrim again.",
            "review_score": "-1"
        },
        {
            "review_text": "Worth it",
            "review_score": "1"
        },
        {
            "review_text": "Valve introduced paid workshop mods for Skyrim, as a result changing my review to negative. You don't get to charge people for mods and try to sell them as dlc, Valve.  People can and should support mod creators via donations, and a 'Buy me a coffee!' button on the workshop page would be good, but putting them behind a pay wall is god damn atrocious.  Hoping Valve and other responsible parties for this new practice will turn around.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a game that, vanilla, I would give 7. Mods make it a 10. Paid mods... ugh.",
            "review_score": "-1"
        },
        {
            "review_text": "Do not buy this game. Valve has destroyed the community and shown many Skirim modders to be talentless, plagaristic hacks.",
            "review_score": "-1"
        },
        {
            "review_text": "8/10 game, 0/10 mod policy. Why not have a 'Tip jar' for modders? A optional donation that encourages people to put out quality mods, not just spam the workshop with $.99 junk.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is just AWESOME! Open world, Lot of story main and background, big skill tree, very goog mechanics If you like Fantasy like LOTR or GOT you will like it... Also you can mod it so it is even better. Sometimes some bugs happen but you can fix it (console commands,workshop or nature way) After all that this is one of the best games ever made :)",
            "review_score": "1"
        },
        {
            "review_text": "Paid mods ? No",
            "review_score": "-1"
        },
        {
            "review_text": "This game has a lot of depth, immersion and the world feels so huge with a endless variety of quests, crafting or just exploring, though you'll likely end up wandering off from where you originally were headed, having become obsessed with picking every flower and plant in sight.  The story is interesting and manages to draw you in, the lore is very deep and well written and the biggest draw card is dragons, who doesn't find dragons fascinating? If you love reading books, there are plenty that are very interesting and you can get totally absorbed in reading all the books you come across. Some are just fun stories like the Lusty Argonian Maid others are more deeper having insight into lore, history, daedric princes, gods, wildlife, monsters, plants and others can get you a skill point for skills.  It's a game where you can create any type of character you can imagine, whether you choose to be more evil whether it be outright insane and murder in full view or be more sneaky and be a skillful assassin and sneakily kill NPC's. You can kill and murder most NPC's if you feel like it, though you'll have to deal with the guards always being hostile if they catch you unless you pay in gold or go to jail. Be a master criminal thief, sneak and break into houses, steal and pickpocket. Or be pure and good or somewhere in between.  You can be whoever you want, eg. a master of every guild or walk on the darkside and seek out the daedric princes which results in some of the most entertaining quests and outcomes and you can keep powerful daedric artifacts if you choose and you can even be a werewolf or vampire which has benefits and drawbacks. That is just a small example of what you can expect.  You aren't confined to set classes or abilities and skills, you can be a spellcaster that sneaks around pickpocketing and use any weapon and armour you like.  You can also take a break from adventuring, build a house, find someone to marry and adopt a couple of kids. Great for those who like to roleplay.  The game while mostly good does have quite a few bugs. The crime system is rather flawed I stole something and my only witness was a chicken and I got in trouble as the chicken somehow reported the crime.  The game also suffers from NPC's disappearing and not able to complete certain quests, so it's important to have multiple saves.  Despite the bugs this game is almost perfect in what I want from a game, it's the kind of game that is hard to stop playing, where you'll say to yourself I'll just see what's over here and then go sleep in 20mins only to find yourself still playing 2 hours later.  I'd class this as one of the best open world fantasy RPG's of all time. A game I can still keep playing hundreds of hours later. If you can't stand something there is likely to be a mod that helps improve or change what you don't like.  This is a must play game. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Hi everyone, this is my new mod! I call it, 'negative review'. It helps lower the rating of this game. This mod is available for free, but if you want the new, always updated version (called 'positive review') then it's just one easy payment of $49.99!  Yes, Bethesda. That means you.",
            "review_score": "-1"
        },
        {
            "review_text": "that game can be descripted in 10 words.  █▀▀ㅤ █ ㅤ █ㅤ █ㅤ █ㅤ▀▀█▀▀ㅤㅤ█ㅤ █ㅤ █▀▀▄ 　  ▀▀█ㅤ█▀▀█ㅤ █ㅤ █ㅤ ㅤ █ㅤㅤㅤ █ ㅤ █ㅤ █ ㅤ █ 　  ▀▀▀ㅤ▀ ㅤ▀ㅤ ▀▀▀▀ㅤㅤ ▀ㅤㅤ ㅤ ▀▀▀▀ㅤ █▀▀ 　  ㅤㅤㅤㅤㅤㅤ▄▀▀▄ㅤ█▀▀▄ㅤ █▀▀▄  ㅤㅤㅤㅤㅤㅤ█▄▄█ㅤ█ ㅤ █ㅤ█ ㅤ █  ㅤㅤㅤㅤㅤㅤ█ㅤ █ㅤ█ ㅤ █ㅤ█▄▄▀  ─────███────██ ──────████───███ ────────████──███ ─────────████─█████ ████████──█████████ ████████████████████ ████████████████████ █████████████████████ █████████████████████ █████████████████████ ██─────██████████████ ███────────█████████ █──█───────────████ █──────────────██ ██──────────────█────────▄███████▄ ██───███▄▄──▄▄███──────▄██$█████$██▄ ██──█▀───▀███────█───▄██$█████████$██▄ ██──█───█──██───█─█──█$█████████████$█ ██──█──────██─────█──█████████████████ ██──██────██▀█───█─────██████████████ ─█───██████──▀████───────███████████ ──────────────────█───────█████████ ─────────────▀▀████──────███████████ ────────────────█▀──────██───████▀─▀█ ────────────────▀█──────█─────▀█▀───█ ──▄▄▄▄▄▄▄────────██────█───████▀───██ ─█████████████────▀█──█───███▀──▄▄██ ─█▀██▀██▀████▀█████▀──█───██████▀─▀█ ─█────────█▄─────────██───████▀───██ ─██▄████▄──██────────██───██──▄▄▄██ ──██▄▄▄▄▄██▀─────────██──█████▀───█ ─────────███────────███████▄────███ ────────███████─────█████████████ ───────▄██████████████████████ ████████─██████████████████ ─────────██████████████ ────────███████████ ───────█████ ──────████ ─────████  ㅤ ㅤ ㅤ ㅤ ㅤ ▀▀█▀▀ㅤ█▀▀█ㅤ█ㅤ▄█ㅤ█▀▀  ㅤㅤ ㅤㅤ ㅤ ㅤㅤ█ ㅤㅤ█▄▄█ㅤ█▀▀▄ ㅤ█▀▀  ㅤ ㅤ ㅤ ㅤ ㅤ ㅤ ▀ㅤ ㅤ▀ㅤ ▀ㅤ▀ㅤㅤ▀ㅤ▀▀▀   █▀▄▀█ㅤ█ ㅤ █ㅤ ㅤ█▀▄▀█ ▄▀▀▄ █▀▀▄ █▀▀ █ ㅤ █ㅤ█  █─▀─█ㅤ█▄▄█ㅤㅤ █─▀─█ █ ㅤ █ █ ㅤ █ █▀▀ █▄▄█ㅤ█ █ㅤㅤ █ㅤ▄▄▄█ㅤ ㅤ█ㅤㅤ█ ─▀▀ ─ ▀ ㅤ ▀ ▀▀▀ ▄▄▄█ㅤ▄   and FUS RO DAH! 11/10 ~ Godly.",
            "review_score": "1"
        },
        {
            "review_text": "If you like open world games you're going to love it. Hours and hours of gameplay and it's even moddable to make the game endless amounts of fun  Update: However, I recommend to buy the new version (Skyrim: Special Edition) it has better performance and slightly better graphics etc.",
            "review_score": "1"
        },
        {
            "review_text": "Best game ever played",
            "review_score": "1"
        },
        {
            "review_text": "I modded this game so heavily that it is now basically pornography featuring Thomas the Tank Engine: destroyer of worlds.  13/10 I regret nothing.",
            "review_score": "1"
        },
        {
            "review_text": "İ played this game for 4 years , it is an amazing game that i ever play With a beautiful Graphics best open world big map and lots of missions quests warewolf missions and also ALL DLC s are good like dragon born heartfire and High texture DLC every computers can easly run this amazing big game STORY LİNE İS UNBELİEVABLE %9999999 MUST PLAY , i recommend tihs game to every one this is a legend game no words to say enjoy !",
            "review_score": "1"
        },
        {
            "review_text": "A really good game. But the fact that they now want to squeeze every last penny from my wallet through a pay wall of pay to play mods is just disgusting, i wouldn't mind if they added a 'donate to the modder' button but the simple fact is the modder has been screwed over as have we all been.",
            "review_score": "-1"
        },
        {
            "review_text": "Can't wait for the next title release... Let's just hope it isn't the same exact thing. While this game has it's endless playability... It needs new mechanics, new visuals, weapons, characters... It needs a lot, and it's why the Modding community for this game in particular went so far.",
            "review_score": "1"
        },
        {
            "review_text": "Payed mods.",
            "review_score": "-1"
        },
        {
            "review_text": "Paid Mods?  Yeah...noooo....thanks..",
            "review_score": "-1"
        },
        {
            "review_text": "I do not recomend this game at all! It crashes when i try to start it and the instructions on the Bethesda website are useless! Im giving this review until someone helps me with this issue. Please message me if you have a solution.",
            "review_score": "-1"
        },
        {
            "review_text": "Taking people's mods, selling them with no quality control and taking 75% of the profit does not a good review make.",
            "review_score": "-1"
        },
        {
            "review_text": "While Skyrim is an excellent game despite any flaws or miss-steps, the recent introduction of pay for mods has lowered the value of the PC version immensely and is a scary concept for future games.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game, sad that Valve has dropped this low. G&amp;G here I come!",
            "review_score": "-1"
        },
        {
            "review_text": "You can use the Slow Time shout as someone is about to sit down, and then move their chair before they sit.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "You have to pay for mods nuff said",
            "review_score": "-1"
        },
        {
            "review_text": "Skyrim was one of the most-anticipated games of 2011, and you can see an amazing amount of polish and detail from Bethesda in some of the changes they'd made to the engine since previous Elder Scrolls games. No 'make your own class', character progression is even more free-flowing this time around. Skills rank up and become more effective as they're utilized, with a bonus based on how well-rested your character is and which mystical standing stone you've most recently attuned to. This allows a character to jump back and forth between more-efficiently raising 'mage-style' skills, 'warrior', and 'thief' abilities. Character level increments as enough ranks are gained in these skills.    Enemies level with the character, but are 'locked' at the level they were when you first entered that area. Cave of necromancers just too hard for you? Leave, come back in five levels. It means that fresh encounters will always be challenging, but rarely overwhelming.   The combat/interaction mechanics are updated so that there's a right-hand/left-hand, left-click/right-click mechanic. This allows the player to wield a spell, weapon, or shield in one hand and something complementary in the other. Two versions of the same spell can eventually be 'dual-cast' to improve effects, and this mechanic also puts a new spin on the two-handed, sword-and-board, and dual-wielding melee combat.   Skyrim is a very open, living realm with lots to do; so much, in fact, that it may be a tad overwhelming. Everyone wants something from the Dragonborn. There's discrete quest chains for the main storyline (Save the world from a world-eating, immortal Dragon who goes about resurrecting his dead dragonbros), the Mage's college (where a character who barely knows how to use magic can rise to the very top, not that many will notice), the Fighter's Guild (by any other name) that introduces some helpful companions and a new way of becoming something that goes bump in the night, the Assassin's Guild (with tales of love, madness, betrayal, and sticking pointy things into others), and a far-reaching, long-spanning saga for the humble Thieve's Guild of Riften that'll send you all across the continent as the stakes get higher and higher. Honestly, the last two seem to dwarf the 'real' plotline, but your mileage may differ.   Aside from (and included in) those, you have any number of random minor fetch, kill, and other classic quest-types, some of which use the new semi-random-generation 'radiant' quest system. They'll never run out, and rarely repeat, but generally are just there so that you know you can always do quests; they're rarely worth it.   So, whether you want to play a stealth-based archaelogist trying to snatch precious Nord treasures from the powerful undead Draugr guarding them, a shield-bashing, axe-swinging juggernaut with shouts powered by the stolen souls of freshly re-killed dragons, or a crafty mage with a penchant for bringing in Daedra friends to do her bidding, Skyrim's got options for you. There's rough spots, there's high points, but it's a great example of a proficient studio kicking out a AAA flagship title.   As for DLCs, I'll likely review those on their own.",
            "review_score": "1"
        },
        {
            "review_text": "The availability of mods is responsible for about 90% of my time played. I will never pay for a single one.",
            "review_score": "-1"
        },
        {
            "review_text": "The paid mod wall behind this game will kill the modding scene as a whole. Especially since the base game is just walking from A to B and killing bandits and draugrs along the way, only to get a quest to walk to C and kill more bandits and draugrs.",
            "review_score": "-1"
        },
        {
            "review_text": "You should be ashamed of yourselves.... Paid mods...",
            "review_score": "-1"
        },
        {
            "review_text": "This game is by far my most played game in my library. It is a very fun game that has a great workshop community. Very much worth the time.",
            "review_score": "1"
        },
        {
            "review_text": "I waited what seemed like forever for this to go on sale. Yes it was worth the wait. And yes I should have just ponyed up sooner. Completely worth the asking price. Awsome game.",
            "review_score": "1"
        },
        {
            "review_text": "Great game Great Consept Great Lore  Everything a Woodby Lore seeker could ever Dream about, That whid reason  Tho Will Likely Murder any Low-Rank Computer it ever whud lay its Sharb nice claws on",
            "review_score": "1"
        },
        {
            "review_text": "never needed to write a review for this game....the game spoke for itself. Honestly, this is probably the best game ever made with probably the best modding community in any game....ever. Now you change it so these mods are no longer free? nope im done. i will probably never buy another bethesda product again and its lucky that Valve doesnt make games or i wouldnt buy it. yeah i may only be hurting myself but if everyone feels this way and acts this way it will put an end to this ♥♥♥♥♥♥♥t.",
            "review_score": "-1"
        },
        {
            "review_text": "Bought this game for $11 two days ago. Now its $5.49. Why you do this to me steam &gt;:(",
            "review_score": "1"
        },
        {
            "review_text": "At the time of this review, I had clocked over 1900 hours of gameplay in Skyrim. I've been all over the province; explored the nine holds, delved into dungeons, battled dragons, amassed riches and wealth the likes of which no mortal has ever seen, built a house with my own two hands, got married, adopted kids... and in all this time I've come to think of Skyrim as a second home. It’s a fantastic game, and with mods can be a source of never ending entertainment. The world is immersive, the quests are fun, the sight seeing incredible, and the cheese... to die for.",
            "review_score": "1"
        },
        {
            "review_text": "Paid mods. Bethesda - one of the first developers starting to kill modding. Scumbags.  Otherwise a decent-ish game I guess.  EDIT: Greedy corporate suits were caught in the act their pants down and now mods are free again. It's most likely these suits are clueless as they brought us Horse Armor DLC.",
            "review_score": "-1"
        },
        {
            "review_text": "The customer made p[aid DLC is rubbish, has no guarantee of being updated, and are often incompatible. If I am expected to pay for a mod, then it is DLC and should be subjected to the same quality controls. $2 fishing minigame, wow, Bethesda have finally released Horse Armour II: Skyrim",
            "review_score": "-1"
        },
        {
            "review_text": "Skyrim is Skyrim. No words needed. It's famous, it's loved, it's amazing.  P.S. The only thing I always hated about it is the Character customization. Thanks god for Nexus and its awesome mods.  9 arrows in the knee of 10.",
            "review_score": "1"
        },
        {
            "review_text": "dont buy, paid mods. Didnt know that you could make money off of another persons game and code. Thought that stuff was copyrighted.",
            "review_score": "-1"
        },
        {
            "review_text": "I paid full price for this game in 2011 with the expectation of modding it fully. I did, with the help of an abundant and free modding community. Now, several of the mods which I used on a regular basis are on a charge-to-update status. I literally cannot beleive this, and will not support Valve or Bethesda's decision to monetize what was originally a free market.   ",
            "review_score": "-1"
        },
        {
            "review_text": "Corporate greediness has led us to this stinky situation. Mods that once used to be free and available to the community were turned into a money machine so someone can fill their greedy pockets. People do not deserve to be treated like this and therefore do not support this and do not buy the game until it blows over.",
            "review_score": "-1"
        },
        {
            "review_text": "game was only good thanks to mods now mods cost money nothing better then paying money to spend hours working through script errors and incompatibilities",
            "review_score": "-1"
        },
        {
            "review_text": "only buy it if you ♥♥♥♥ing love really old style  0h ♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "The beginning of the end. I'm done buying Bethesda games.",
            "review_score": "-1"
        },
        {
            "review_text": "This Game Is Awesome Even If It Has More Than 5 Years It Still Look Awesome This Game will Never Die And We are All Waiting For The Elder Scrools : Skyrim VI ^^",
            "review_score": "1"
        },
        {
            "review_text": "Pay to mod",
            "review_score": "-1"
        },
        {
            "review_text": "Keeping my review negative because Valve's only regret was that they started with Skyrim",
            "review_score": "-1"
        },
        {
            "review_text": "The game's alright, first ES game I've played actually.  The payed mods aren't. Thanks but no thanks.",
            "review_score": "-1"
        },
        {
            "review_text": "No one likes your pay-mods.",
            "review_score": "-1"
        },
        {
            "review_text": "Paid mods with censored criticism, no quality standards, copied assets, and only 1/4 of the money goes towards the creator. Don't support this disaster.",
            "review_score": "-1"
        },
        {
            "review_text": "The game is very enjoyable but it has its problems.   The enviroments and the feeling of the world is amazing. This is the strongest part of the game. The rest is sadly very mediocre. The combat is simple and spammy and lacks any serious depth considering it's a rpg. Exploring the world is cool and all but many of the places you'll find are generic tombs that all look the same. The quests are a gamble, some of the questlines are great but some, not so much. The problem is that alot of the quests are mmo like 'gather x amount of these items' quests. These kind of quests I feel do not belong in a singleplayer rpg like this. The game also artificially extends the game by having randomly generated repetetive misc - quests. At this point the game got really dull and I stopped playing when there was basiclly only these quests left.  Besides all of it's faults though, it is a game worth playing and many do not seem to notice these things since skyrim brought in alot of people who usually do not play rpgs and has not gathered any pre - expectations. The game is overall a pretty dumbed down version from the previous entries in the series which makes me enjoy the game alot less. It is a very easy game and is designed for a more casual crowd then morrowind, oblivion or even the earlier ones.   But as I said it is still a fair amount of fun and with an insane amount of mods, you could play this for a long time. I'd like to say though that for all people who love skyrim, you should atleast give TES IV : Oblivion for I feel that some would enjoy that games more deep systems and harder difficulty.   Thanks for reading my rather lengthy review, I hope it helped you in your decision for buying the game.",
            "review_score": "1"
        },
        {
            "review_text": "Paid mods, get out of here you greedy tools.",
            "review_score": "-1"
        },
        {
            "review_text": "OUT WITH THE PAID MODS",
            "review_score": "-1"
        },
        {
            "review_text": "I love this game, but Paid-mods is a off puting idea as it is and Valve's implementation is just horrific.",
            "review_score": "-1"
        },
        {
            "review_text": "Paid mods are going to ruin this brilliant game and many others like it. Im making a statement and will not purchase another product from Valve, or any other company that joined this ridiculous opressive program.",
            "review_score": "-1"
        },
        {
            "review_text": "[10/10]  Even PC version didn't dissapointed me. + possibility of mods available on PC :3 As RPG this belong to best ones of breed and only few titles can compete with TES:V. Bethesda made good step forward with new combat mechanics and game mechanics themselves.   this is..... masterpiece. Game of the Decade.",
            "review_score": "1"
        },
        {
            "review_text": "you know, this game was a waste of money, it was mediocre in almost every way, so utterly forgettable, i didnt think it was worthly of even the time taken to write a review  but hey, that changed today because the game now offers... paid mods, freakin' pay for what has been a free and major aspect of PC gaming since forever, screw this game, screw game companies in general, nowadays you pay 60 dollars for a game and you are not guaranteed a FULL GAME, you are not guaranteed A WORKING GAME at launch, and at every turn game companies will try their hardest to squeeze the last cent out of you with DLC, day one DLC, pre-order bonuses, microtransactions and now this, paying for freaking mods  you might be thinking now 'but Nuclear Kangaroo, you are not entitled to the modder's work' its true, but then, how come Valve and bethesda are? the modder only gets a 25% cut out of every sale, the rest goes to valve/bethesda, if the total profit of the modder does not exceed 100$ the modder gets NOTHING, the modders can use the work of other free mods for their PAID MODS, without the knowledge or the consent of the modders they steal the work from, the modder can have their paid mods bundled in any sort of DLC made by the publisher, which then can decide to not give a cent to ANY modder involved  not to mention that by placing the incentive this already fragments the modding community, placing a paywall between the people who play mods and those who create it  this wont lead to better mods that everyone can enjoy, the only mods that MIGHT get better are the PAID ones   this move does not benefit the customer, it barely benefits the modder, it only benefits valve and the publishers, screw this game and any future game that does this  also like i said the game is pretty mediocre  EDIT: paid mods were removed but the game is still mediocre so i still dont recommend it",
            "review_score": "-1"
        }
    ]
}