{
    "app_id": 73060,
    "name": "Defenders of Ardania",
    "release_date": "2012-03-14",
    "developer": [
        "Most Wanted Entertainment"
    ],
    "publisher": [
        "Paradox Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Tower Defense",
        "Strategy",
        "Fantasy"
    ],
    "achievements": 12,
    "positive_ratings": 32,
    "negative_ratings": 68,
    "price": 8.99,
    "description": "A next-generation tower defense game set in the rich fantasy world of Majesty, but with a twist.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/73060/header.jpg?t=1447355125",
    "minimum_requirements": "Minimum                OS: Windows速 XP / Vista / Windows速 7                Processor: Intel Pentium 4 3.2 GHZ, AMD Athlon 3500+                Memory:1 GB (Windows速 XP), 1,5 GB (Windows速 Vista)                Hard Disk Space:  1 GB                               Video Card: 1GB, ATI HD3870, Shader Model, 512 MB (does not support integrated graphics card)                DirectX&reg;: 9.0c                Sound:DirectX9 compatible                Additional: Internet or LAN for multiplayer",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Defenders of Ardania is Paradox's new take on the Tower Defense genre. Although set in the same universe as the majesty games you probably won't notice as the majority of the lore, units and locations is of much the same generic fantasy staple as 99% of the rest out there.  Defenders of Ardania takes on the genre in a way we mostly see from PvP focused Tower Defense games by letting you not only manage the defense of your own keep through Tower placement and ability use but instead of making victory based on the simple passage of time you have to send units yourself towards the enemy keep and past his towers to secure victory. This a great mechanic for multi-player but unfortunately it hamstrings the AI in the single-player campaign quite badly as it simply does not build fast enough or responds fast enough making most of the maps a breeze to win by simply rushing fast units with little concern for your own defenses.  A rather weird income system that never lets you run out of money for more than a few seconds at a time and hard limits on both towers and units only compounds this problem, making the first 5 minutes of any map the only minutes that really matter and any game that progresses beyond that because a rather dull slugfest where you sit around with an impenetrable defense, spamming the same units over and over waiting for their experience to go up enough so that you can unlock a more powerful hero version.  Defenders of Ardania is not a very inspired game, the gameplay mechanics do not lend themselves to single-player very well and although some entertainment can be found in the game's multi-player component the lack of anyone actually playing it online means this is only viable if you do it with friends. There are many better Tower Defense games out there, Sol Survivor even has a multi-player mode with pretty much the same mechanics as this, only not quite as broken.",
            "review_score": "-1"
        },
        {
            "review_text": "Garbage. Not thought provoking, the dialogue is childish, the devs didn't even bother to have support for my native screen resolution nor even a windowed mode. I could forgive all of the above if the gameplay weren't stale.",
            "review_score": "-1"
        },
        {
            "review_text": "Not a bad game, All and all the creativity and simalarity to the old maul games in WC3 makes this game worth it.",
            "review_score": "1"
        },
        {
            "review_text": "Slow and boring Tower Defence.  2 / 10.",
            "review_score": "-1"
        },
        {
            "review_text": " The SH*TTIEST Age of Empires RIP OFF EVER!!!  0/10",
            "review_score": "-1"
        },
        {
            "review_text": "Could be better but the story is still very funny :D If you want a cheap gaem, you can play for 4 hours its good!",
            "review_score": "1"
        }
    ]
}