{
    "app_id": 7830,
    "name": "Men of War™",
    "release_date": "2009-05-06",
    "developer": [
        "Best Way"
    ],
    "publisher": [
        "1C Entertainment",
        "1C-SoftClub"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Cloud",
        "Includes level editor"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "World War II",
        "RTS"
    ],
    "achievements": 0,
    "positive_ratings": 1664,
    "negative_ratings": 257,
    "price": 3.99,
    "description": "Men of War is a stunning Real-Time Strategy game that takes place during the height of World War II. Intense battles span Europe and North Africa as gamers play as Soviet, Allied or German forces across 19 massive single-player missions.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/7830/header.jpg?t=1552406356",
    "minimum_requirements": "Minimum                     Operating System: Microsoft® Windows® XP SP3 / Windows Vista SP1 — This product does not support Windows 95/98/ME/2000/NT or XP x64/Vista x64!                     Processor: Intel® Pentium 4 3.0 GHz or AMD™ Athlon™ 64 3000+                     Memory: XP – 1 GB RAM / Vista – 2 GB RAM                     Hard Disk Space: 6.5 GB + 1 GB Swap File                     Video Card: 3D Hardware Accelerator Card Required – 100% DirectX 9.0c compatible 128 MB Video Memory.  ATI® Radeon® 9600 or Nvidia® GeForce® 5900                     Sound Card: DirectX® 9.0c compatible sound card                     DirectX® Version: DirectX® 9.0c                     Network:                       Internet(TCP/IP) or LAN play supported                      Internet play requires broadband connection and latest drivers                      LAN play requires network interface card with latest drivers",
    "recommended_requirements": "Recommended                     Operating System: Microsoft® Windows® XP SP3 / Windows Vista SP1 — This product does not support Windows 95/98/ME/2000/NT or XP x64/Vista x64!                     Processor: Intel® Core 2 Duo 2.33 GHz or AMD® Athlon® 4400+                     Memory: 2 GB RAM                     Hard Disk Space: 5.5 GB + 1 GB Swap File                     Video Card: 256 MB 3D Hardware Accelerator Card with Shader 3.0 support ** - ATI® Radeon® 2600 or Nvidia® GeForce® 8600                     Sound Card: DirectX® 9.0c compatible sound card                     DirectX® Version: DirectX® 9.0c                     Network:                       Internet(TCP/IP) or LAN play supported                      Internet play requires broadband connection and latest drivers                      LAN play requires network interface card with latest drivers                                          ** NOTICE: Some 3D accelerator cards with the chipset listed here may not be compatible with the 3D acceleration features utilized by Men of War. Please refer to your hardware manufacturer for 100% DirectX compatibility.                                          Supported Chipsets: ATI Radeon 9600                     , ATI Radeon 9700                     , ATI Radeon X300                     , ATI Radeon X600                     , ATI Radeon X700                     , ATI Radeon X800                     , ATI Radeon X850                     , ATI Radeon X1050                     , ATI Radeon X1300                     , ATI Radeon X1600                     , ATI Radeon X1900                     , ATI RADEON HD 2400                     , ATI RADEON HD 2600                     , ATI RADEON HD 2900                     , ATI RADEON HD 3450                     , ATI RADEON HD 3850                     , ATI RADEON HD 3870                     , ATI RADEON HD 4850                     , NVIDIA GEFORCE 5900                     , NVIDIA GEFORCE 6600                     , NVIDIA GEFORCE 6800                     , NVIDIA GEFORCE 7300                     , NVIDIA GEFORCE 7600                     , NVIDIA GEFORCE 7800                     , NVIDIA GEFORCE 8400                     , NVIDIA GEFORCE 8500                     , NVIDIA GEFORCE 8600                     , NVIDIA GEFORCE 8800                     , NVIDIA GEFORCE 9600                     , NVIDIA GEFORCE 260                     , MOBILE CHIPSETS:                                          Supported Mobile Chipsets: NVIDIA GEFORCE GO 7900                     , NVIDIA GEFORCE GO 7950                     and NVIDIA GEFORCE GO 8400",
    "reviews": [
        {
            "review_text": "Hmm... how should I put this? Imagine Arma, okay? Imagine all of the realism, immersion, tension that has Arma featured. Now, since Arma set in modern world, how about change them into WW2. Nice, isn't it? Alright, now change the FPS camera into isometric top down that can zoom in into your unit's scale.  Now you get Men of War. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This is just the best strategy game I have ever played, maybe even the best game i have ever played.  For those of you who dont know men of war is a real time strategy game where you can take direct controll over one of your units and play as him (works like a twin stick shooter). The whole series is just genious it has fun missions epic battles and even a little element of story. The missions are like a pazzle and you are basicly free to do the mission how ever you like for exemple: if you need to infiltrate a base you could try tom look for a hole on the fance,you could make a hole yourslef using an AT grenade,you could wait for enemy patrol try to steal theyr tank, you could try to snipe everyone in the base from far away or just try to just walk in from the main door.  this review applies not only on the original men of war but on all the series.  if you havent played it yet u should, no u MUST try it!",
            "review_score": "1"
        },
        {
            "review_text": "If u like RTS games this game is for you, it does not mess around, You have to be tactical and it has its own Unique play style,The difficulty is pretty badass nothing too easy like Company of Heros.",
            "review_score": "1"
        },
        {
            "review_text": "If you played this Men Of war, then you should buy every Men of War  9.9/10 No game is perfect",
            "review_score": "1"
        },
        {
            "review_text": "German soldier destroying Sherman screaming 'FOR UNCLE SAM'   Best voice acting 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Excellent WWII simulator, with unparalled strategic combat. You can command a single soldier, and loot the battlefield, or platoons and parade them into the storm. Create the ultimate defenses by creating walls of sandbags and camoflauging artillery along roads. If you enjoy historic, strategy, WWII or just destroying your friends in game, then pick up a copy of this game, I got it on sale, but it's indefinately worth 10.00$. Because servers are down, directly connecting to friends is the only way to play multiplayer, but even if your friends don't own a copy I'm always up to play. Come; fight with or against me.",
            "review_score": "1"
        },
        {
            "review_text": "A hardcore game which dosn't hold the players hands, it tells you how to play and then throws you out in the jungle with a happy face, I love this game. Good editor and amazing gameplay. 9,5/10",
            "review_score": "1"
        },
        {
            "review_text": "This is still the best Men of War game made. The graphics may not be the best, and the voice acting is ♥♥♥♥ (hilariously), but this still trumps the other games by far. The only other game that is comparable is Faces of War, which was the game that came before MoW. MoW: Red Tide at least tried to stay close to it's roots, but suffered massively from the huge difficulty spike (compared to the original MoW) and the lack of any sort of Multiplayer (I mainly play single player games, but MoW was my exception). MoW: AS and MoW: AS2 completely changed the way the games were played previously. Changing it to more of a 'capture the flag' type game mode. Gone were the interesting characters, story, and missions. Instead you just get to play a bunch of scenario type maps that continually open up as you capture more 'flags'. That is not the MoW I enjoyed. Lastly, 1C decided to milk the series with a bunch of terrible spin-offs that I hope no one ever has to experience. The two most prominent ones being MoW: Vietnam (♥♥♥♥ing terrible game), and MoW: Condemned Heroes (which I never played, but have seen playthroughs of...it is terrible as well). They have also started to use the engine to allow a bunch of indie/small developers to make some MoW-lite games based in other periods (such as WW1, Civil War, and Modern times). None of these, however, have been able to stack up to the original Men of War. I don't understand why 1C decided to waste the success of Men of War on all these stupid spin-offs. They could have made a Men of War 2, just using the Modern engine, and with the same kind of experience MoW 1 had. But no, they'll just keep wasting the potential that Men of War had on these stupid games that are completely different from what Men of War originally was.  Overall, I'd give this game a solid 8.5/10. It isn't perfect, and has many issues, but it is still the best game that the 'series' has come up with. It's just a shame that this will never see a proper sequel that will live up to it's name-sake.",
            "review_score": "1"
        },
        {
            "review_text": "hard as ♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "i realy loved the game 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Men of War is one of the gaming industry's biggest accomplishments, settling once of for all the debate of whether games can be considered to be art. Men of War is one of gaming's first autobiographical games which follows the heavy metal band Manowar from their inception during the 1980s. The game has a beautiful opening scene wherein the player controls bassist Joey DeMaio while he snorts the biggest line of cocaine in his life while backstage at a Black Sabbath concert, and neglects to fulfill his duties as a sober fireworks manager. In this sequence the player must complete a series of quick-time-events in order to guide a stumbling Demaio into correctly setting off the fireworks in order to not burn the stage down. During this sequence the quick-time-events get harder to the point where the player cannot complete them, which reveals that Ross the Boss is right beside you and like a true bro, covers over for DeMaio and succeeds in not causing the death of Ronnie James Dio. DeMaio and Ross the Boss become best bros at that moment and start legendary metal band Manowar.  The rest of the game is a re-tooled version of Activision's Guitar Hero, but all of the songs are from Manowar.",
            "review_score": "1"
        },
        {
            "review_text": "The most detailed and most tactical RTS game I ever played. Forget Company of Heroes. This is much better!",
            "review_score": "1"
        },
        {
            "review_text": "This is one of if not the best RTS games out there. I definitely recommend it to anyone looking for a bit of a challenge.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, very realistic and exciting.",
            "review_score": "1"
        },
        {
            "review_text": "Game crashed on startup and cannot be fixed. 11/10",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant game, an RTS with real character and depth.  The first allied mission is ♥♥♥♥ though",
            "review_score": "1"
        },
        {
            "review_text": "This game has an awesome game engine with great graphics. I do recommend getting it, but players tend to feel how hard and challenging levels can actually be. The multiplayer server shut down, but there are ways around that...",
            "review_score": "1"
        },
        {
            "review_text": "Like Skyrim with tanks. 10/11",
            "review_score": "1"
        },
        {
            "review_text": "Ever just thought some ♥♥♥♥♥ was too micromanaging? Ever never had to think for yourself because a Soviet General told you specifically to pick up an MP40 and some medkits? WEll ♥♥♥♥, maybe you should play one of those guys, BECAUSE APPARENTLY NO ♥♥♥♥ING PERSON HAS THE COMMON SENSE TO GET INTO COVER WHEN THEY'RE FUC&lt;IING SHOT AT AND NEED SOME ♥♥♥♥ING ORDER FROM SOME FAT ♥♥♥ GENERAL LIKE ME TO GET HIM THERE.  There's such thing ♥♥♥ too much realism, but never too much artillery.  Seriously just max out arties on people, watch them rage, I did. Hehehehe. Casual prats. Don't they know 80% of deaths in ww2 were caused by artie? It's realism after all. GET REAL  99reals out of 12390 or somethin  PS I guess it's fun, not full price fun though",
            "review_score": "1"
        },
        {
            "review_text": "Men of War is the almost-classic installment in the Men of War series, Faces of War being the second and Soldiers: Heroes of World War 2 being the first. This is the first title with 'Men of War'. It has more modern graphics than its predecessors and has quite the long amount of missions. It also has bonus missions.  Pros: - Realistic warfare simulator. Strategy matters and every little detail counts.  - Has a long campaign with bonus missions.  - Has nice graphics for its time.  - Only game that has this level of creativity, detail, difficulty, realism and fun in a RTS.  - Has an editor so you can make your own battles and mess around.  - Lists of other cool things!  Cons: - The micromanagement can get a little annoying.  - The HUD is a mess.  - Small AI bugs or random things(which are usually funny).  - Well... thats about it.  I have to recommend this game. If you have the money, consider the other story titles(Condemned Heroes, Red Tide, Vietnam) or the multiplayer based with SP skirmish missions titles Assualt Squad and Assualt Squad 2. That said, its worth trying out the earlier titles. There is mods that bring the Faces of War campaign and the Red Tide campaign to MOW AS2.",
            "review_score": "1"
        },
        {
            "review_text": "Do you like company of heroes, but feel like there is something missing, some actual depth or real strategy on the gameplay? Are you tired of seeing HP bars on tanks, making the game feel more like street fighter rather than a WW2 strategy game? Are you ready to take your micro skills to exhaustion while the game forces you to micro every single soldier to their tiny little inventory while controlling a massive platoon?  No? Well I don't give a damn anyway.",
            "review_score": "1"
        },
        {
            "review_text": "i cant play online it says: online services are not availible. (cd:263) ",
            "review_score": "-1"
        },
        {
            "review_text": "played the game for 1 day and next day tried to open it didnt work it just was a screen then said error is not something and i couldnt play it is worth the money you pay for.",
            "review_score": "-1"
        },
        {
            "review_text": "Dont use steam overlay unless you want your game to crash becuase im a very busy person on steam so when ever i get a message and go to reply to it i cant exit out of steam overlay. And this is a very fun game but steam overlay just ruins it when you cant exit out of it.",
            "review_score": "1"
        },
        {
            "review_text": "-Starts playing the German Campaign -So many Paratroopers are dropping by!! -Decides to shoot the British in their head -Stationary things are REKTING MY MEN AIDHWADS -Wins the game -Rage quits on the last German Campaign 10/10 would ♥♥♥ British forces and quit the last campaign again",
            "review_score": "1"
        },
        {
            "review_text": "It's okay, but clunky. For fans of WWII RTS.",
            "review_score": "1"
        },
        {
            "review_text": "Hilarious voice acting but deep gameplay and loads of stuff to shoot once you master the controls. You can take control of a single unit and move and shoot like a third person shooter.",
            "review_score": "1"
        },
        {
            "review_text": "Being the first RTS I have played of this style, it does alot of things right. Voice acting, is not one of those things. The game gives you a set amount of units and expects you to fulfill each mission with those units. This often puts you in very tight positions that feel incredibly satsifying to get out of. Micromanagement and taking direct control of a unit are your strongest weapons in this game.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game",
            "review_score": "1"
        },
        {
            "review_text": "Not sure why this game has so many positive reviews, the AI is so bad you have to take manual control of every unit you have (especially tanks).  You basically lead a batallion of special ed students",
            "review_score": "-1"
        },
        {
            "review_text": "Plays Men of War with friend Plays as Germany and makes defences Fills the trenches with machine guns, artillery and S.S Troops My friend sends a scout force composed of 2 squads of infantry and 10 tanks, my defences kill them like it was nothing....I've held my position for 50 mins, just 10 more mins until the match was over....since I was winning and there was 10 mins remaining...I got cocky...I've stopped caring about reinforcments so my units were in short of ammunition. Next thing I know he bombards me with 10 rocket artillery....then sends in 10 IS-3's (Most OP Tank in the game) and distracts my tanks...then sends in 600 infantry men and took over my defences in under 5 mins... 10/10 would be rekt again and smash my keyboard in half. But overall this game is one of the best games I have had ever played.",
            "review_score": "1"
        },
        {
            "review_text": "While most of the 'good games' come from big fancy American, Canadian and British companies, Games that come from places like Russia, Poland and Ukraine are generally looked down upon. Men of War is one of those games from Eastern Europe. And like Stalker and Metro 2033, this game is surprisingly good for being developed by a small Ukrainian based company.   This is a really strange RTS/RPGS/FPS Hybrid. It's mainly a stragety game but it involves RPG elements like inventory management and such, theres also some features in there to take control of individual untis like an action game.  The editor is fairly easy to use and the battles are extremley realistic, but fun at the same time. If you can get used to the controls and how everything works, I highly reccommend tihs game to pretty much anyone who enjoys any kind of combat game.",
            "review_score": "1"
        },
        {
            "review_text": "I picked this up expecting something like World in Conflict or Company of Heroes. Instead, I found a game that required so much micro management that just getting a group of men to walk across a field required at least three button commands and constant attention.   On some level, I can appreciate the attempt to model some of the complexity of real war - tanks have individual sections that can be damaged for different effects, all units have limited ammo for you to keep track of, enemies have angles of vision that you can exploit for flanking attacks, etc. But the control interface and the AI of your units is so poor that constant micromanagement is necessary to keep your troops from getting slaughtered.   The tank you get command of in the very first mission is a terribly powerful weapon, but mine got destroyed over and over because it wouldn't turn to attack targets I commanded it to hit. Pray tell, why do I need to individually command the vehicle to turn around, find an angle of fire, and shoot when other strategy games let you do all of that with one button press?",
            "review_score": "-1"
        },
        {
            "review_text": "It says multiplayer? LIES multiplayer died a long time ago for this game and still it says its multiplayer? multiplayer my ♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "i was gonna play muiltplayer when it said so i did BUT it didnt let me sighn in with my password i made and i didnt have a gamerspyid WTF PEOPLE this has gotta be the woest Sh%t ive wasted money for and the map editor is hard as crap. WORST GAME EVER",
            "review_score": "-1"
        },
        {
            "review_text": "The game itself is AMAZING. Well until today. My entire game stopped working and it won't load when I try to enter the editor or the actual game itself. So I guess it was fun while it lasted, but I can't get it to work. So I'd say it's not worth the $5 .",
            "review_score": "-1"
        },
        {
            "review_text": "Great realistic game.  *Edit: Useless now that gamespy shut down its servers so you can't play in multiplayer.  You may get it for the campaign or the editor but it's not as fun as the multiplayer gameplay.",
            "review_score": "-1"
        },
        {
            "review_text": "This game should call stealth of war or defense of war ! the campaign it is all about inflirtrating other enemy base or defend ur place that enemy have 100 tanks and many infantry and give u some troop and weak AT gun ! AND most important thing is u can't play online multiplayer. I not playing this crap anymore. (the comment above is just my personal though if u think that interesting and challenging I don have anything to say anything) SORRY for my bad english or have spelling mistake",
            "review_score": "-1"
        },
        {
            "review_text": "i cant even play this game steam gave me a bad cd key yes it lock good",
            "review_score": "-1"
        },
        {
            "review_text": "This is absolutely abysmal. No one has any reason to purchase this monstrosity. You can't move, shoot, or do anything. You have absolutely no control over anyone or anything. Just sit and watch all your helpless 'soldiers' run around and die with awful voice acting and unforgiving camera movement and angles. Just save your money and use it for something that at least has some effort put into it.",
            "review_score": "-1"
        },
        {
            "review_text": "Controls felt very clumsy. Soldiers would often stand perfectly still while enemy soldiers wiped them out. If this didn't come in a bundle, i would be mad i wasted my money on it.",
            "review_score": "-1"
        },
        {
            "review_text": "The game was fun for the first level, after that its difficulty went mad high and you couldnt train any units, I expected the game to start with a base and where you could train units give them guns and such like that, no you have 3 campaigns and a few bonus missions, there wasnt a skirmish mode or anything like that, I expected the controls to be easy to understand, I was god awefully wrong, double shift double num 0 what... no just do all the normal keys not all this double press crap. Since there are only 3 campaigns, I dont think it will be that long of a game, nor will it be an everlasting fun game. It was made in 2009 and it does have good aspects and good gameplay, but the game shouldnt be any where near 15 dollars since its that old and has very poor voice acting, it was literally hilarious I was laughing out loud because of how bad the voice acting was. So, to wrap this up, if you like Age of Empires or any other stradegy game on the planet, do not buy this game, you will be madly dissapointed. A waste just like War Z was.",
            "review_score": "-1"
        },
        {
            "review_text": "pice of ♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "Compared to other RTS games, Men of War is one of the most realistic games out there. I myself am a fan of realism and I especially like what the devs were trying to achieve. I find the game to be rather tedious though and the campaign I find to be frustratingly difficult, maybe I just suck? I dunno, maybe this game isn't for me. This is a very good game though and anyone who wants to try a similuation like game instead of an arcade style game then good ahead and get this game.  Cheers ",
            "review_score": "1"
        },
        {
            "review_text": "Same team who brought you Faces of War and I think also Soldiers: Heroes of WWII. Fantastic game but more focus on larger units of troops (so micromanagement is more difficult) than Soldiers but an excellent game once you get the grasp of it.  Would recommend to play this game on MP with mates on COOP or adversial. Excellent bit of fun.",
            "review_score": "1"
        },
        {
            "review_text": "AMASING GAME EXEPT FOR Ai u hav to babysit everything ",
            "review_score": "1"
        },
        {
            "review_text": "One of the best RTS games for windows Vista + I was looking to replace the older XP games that have too many quirks to enjoy on the newer versions of Windows. This one does the job.",
            "review_score": "1"
        },
        {
            "review_text": "Very good game, once you get over the learning curve near the start. (slightly difficult, as there is no tutorial) But as soon as you get the hang of it, it can be very addictive, very realistic, and most importantly; very fun.  If you're looking for a comparison, think Company of Heroes crossed with World in Conflict, with a little bit of Ghost Recon thrown in. They certainly pulled it off well! (Although, sadly the voice acting isn't on par with most of today's games, but that's hardly game-breaking by any standards)",
            "review_score": "1"
        },
        {
            "review_text": "It is soo real, it's just scary. Well, you can point a lot of approximations (unified bullets, tank repair on-the-fly), but it is solely for good gameplay. And the spirit is here. It is just as i imagined by tales of grandfather, and lots of soviet-time WW II books. Oh, mind you, it isnot easy!",
            "review_score": "1"
        },
        {
            "review_text": "This game is dope, but sadly no multiplayer so you're stuck with singleplayer. It's not that singleplayer is bad, but multiplayer is loads more fun. Don't buy if you plan on playing a lot of multiplayer. ",
            "review_score": "1"
        },
        {
            "review_text": "OMG this is one of the best games I have EVER played! For god's sake if you like RTS then THIS IS FOR YOU.",
            "review_score": "1"
        },
        {
            "review_text": "I am a feminist and your patriarchial attitudes are ♥♥♥♥♥♥ me, jk im not a femiist im a terrorist allahu akbar ",
            "review_score": "1"
        },
        {
            "review_text": "Great game. (Wish it had a city battle though)",
            "review_score": "1"
        },
        {
            "review_text": "Amazing yet hilariously bad at times.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game I just got it even though the talking audio is bad it has a great story and great missions love it they need to make more dlc for this",
            "review_score": "1"
        },
        {
            "review_text": "I love this game,  ONE OF THE BEST RTS AND RTT's I HAVE EVER PLAYED! IF you haven't played this yet, you are missing out..what are you waiting for?",
            "review_score": "1"
        },
        {
            "review_text": "This game is a successor to Soldiers: HOWW2 and Faces of War, some brilliant games that rewarded detailed planning, fast reflexes and initiative. They were not made for casuals. And this is why casuals hated them. Too buggy, too hard, uncomprehensible etc etc. Do not hear their whinning if you do not like to just faceroll a stupid AI, but instead you prefer having a challenge. I remember loading same spot like 20 times trying different things so the AI does not steam roll me. Having 3-5 soldiers and having to clear whole bases, kill/capture/disable tanks, escape etc is not something offered by many games.   This is continued in Men Of War. From 2nd mission and on, you will have to face MANY enemies more than you. I checked the end game stats and saw that I was facing like 1000 enemies in defensive missions...and you have like 50 at most. Not to mention the tanks. AI has some nice ability to kill your tanks easier that you can kill its. Yeah this can be frustrating. So, just be more careful. And save often.   Even if you are a veteran of S:HOWW2, some missions can be tough. Although there is no tactics mode like in Faces of War, you can still die easily by some direct shots. I cannot say much about...replayability. Playing 1 mission for 4h +, makes you feel relieved when you finish it. One thing that I disagree with is that you cannot do as much as you could do in S: HOWW2 when in pause. Having to command MANY squads, resupply their ammo while the AI launches attack after attack is sometimes very demanding. When you have 3-5 soldiers it is easy...no time pressure etc. But the game and its objectives are still viable, and I have screens where I lost like 10 soldiers/0 tanks in defenses. On normal. So, if you plan carefully, think, reload and try different ways to win, you will make it.   Again...it is not for casuals. If you are one, you will cry. If you like tough challenges, then you will love this difficult ♥♥♥♥♥. Graphics are nice. Enough to make take screens of the environment. Voiceovers and sound I do not care. I am muting all games so I can listen to music. Storyline. Again, I do not care much. I just like killing stuff. From what I saw it was there just to exist. Who really cares...  Physics and realism. The stuff I like: explosions, bodies launch at every direction, bullets fear the brave, they disperse, and they change direction when they hit hard surfaces. Cannon shells...2 types: explosive, armor penetrating. Self explanatory. Now the spotting dot shows you the area of dispersion, the possibility to penetrate and ofc the distance. All this changes according to angle, vehicle armor, its speed, your speed, and other factors. It is the detail that makes the difference, and in this factor the game is a diamond.  8.8/10 just because I wanted better pause tool, voiceovers and storyline that are there just to exist and sometimes AI kills your tanks too easily to make it even competitive.",
            "review_score": "1"
        },
        {
            "review_text": "Men of War is one of the grandest games I ever played. The story is the best that comes with the game and its multiplayer is quite good.",
            "review_score": "1"
        },
        {
            "review_text": "definitely!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Not really much of an improvement on the old 'Soldiers: Heroes of WWII' graphically, game play wise or story wise. Dodgy voice acting too.",
            "review_score": "1"
        },
        {
            "review_text": "a great game, well detailed and magnificent performance. however i would not suggest anyone new to this sort of game mode to try this game out as it is very complicated and you must think ahead and stay alert on the battlefield.",
            "review_score": "1"
        },
        {
            "review_text": "It's adequate",
            "review_score": "1"
        },
        {
            "review_text": "Probably one of the hardest games I've played, very challanging and I love it.",
            "review_score": "1"
        },
        {
            "review_text": "Best game series ever. See a building? Blow it up with a well placed artillery/tank shell. No? How about ramming your ♥♥♥♥ing tank into it, taking it down with any other person inside? What about shrapnels? Do you like shrapnels? I ♥♥♥♥ing love shrapnels. All explosions are not based on the laughable spherical 'blast radiuses' but on flying razors that can cut your men 7 ways to sunday. If one of your unlucky ♥♥♥♥♥♥♥s happens to be having his head over the trench when an artillery shell hits his position or a grenade hits the top side, you better ♥♥♥♥ing hope he's wearing a helmet and ducking or else you're going to have to scoop that ♥♥♥♥ for a brain of his off the ground. Disabled an enemy tank? Oh my, well did you know that you can open its inventory, take out that machine gun and ammo, then blast the ♥♥♥♥ out of the enemy? What about the fact that you can repair it on the field and use it as your own? What about the fact that EACH tank and vehicle has REALISTIC armor, sloping armor (that actually worK), and vital spots (ammo storage, fuel storage, etc.)? You can blow off their ♥♥♥♥ing tracks, turrets, and barrels for crying out loud!   The vehicles do not operate on the basis of the Company of Heroes 'health bars' but on the basis of reality. Soldiers do no damage with their rifles. Tanks get damaged based on where they hit with parts breaking down, hulls being pierced, and hulls being blown to bits.  The game puts Company of Heroes to utter devastating shame. Get it.   I prefer the older ones (Men of War, Men of War: Red Tide, etc.) as ammo and infantry are scarce, you are forced to scavenge, repair, and loot dead bodies for cartridges, tank shells, fuel, and so on. Good micromanagement.",
            "review_score": "1"
        },
        {
            "review_text": "I don't usually play strategy games, but when I do.... I prefer MoW.",
            "review_score": "1"
        },
        {
            "review_text": "GET THIS GAME GENTLEMEN it puts the amazing in RTS.",
            "review_score": "1"
        },
        {
            "review_text": "If u like ww2 stratages play men of war the best of all ww2 games  ",
            "review_score": "1"
        },
        {
            "review_text": "Great RTS. Seriously, this game will make you ♥♥♥♥ Zhukov, it's so micro-intensive. Games like Company of Heroes, Starcraft 2, RUSE or Command &amp; Conquer are all babby mode compared to this thing.  The game is actually an RTT (Real Time Tactics) at heart and completely removes the base-building component you'd find in a lot of contemporary strategy games.   This leaves you to completely focus on per unit resource management, like equipping each individual soldier with a gun (or even multiple guns), ammo, helmets, grenades, special equipment, and sometimes armour.   There's also a whole host of World War 2 vehicles that include: light vehicles, tanks, self-propelled guns, and weapon emplacements.   Be warned! Cinematic voice-acting is horrendous while unit voice-acting is pretty good.  Also. Coop. The coop is awesome.",
            "review_score": "1"
        },
        {
            "review_text": "games hard but fun no more online just download gameranger for that",
            "review_score": "1"
        },
        {
            "review_text": "I've played this for more than 500 hours. I enjoy it a lot as you get a lot of controll and realism packed in decent graphics and historical weapons and units. buy buy buy XD",
            "review_score": "1"
        },
        {
            "review_text": "Nazi threw a AT grenade at my jeep. It blew my jeep up and my driver went up into the air. He went about a mile up or so.  20/10  Jeep Space Program",
            "review_score": "1"
        },
        {
            "review_text": "the voice acting in this game gave me a new type of autism",
            "review_score": "1"
        },
        {
            "review_text": "Hey i was wondering if I can JUST skimirsh against a bot instead of going thru campaign? ",
            "review_score": "1"
        },
        {
            "review_text": "Got it as a gift and it's pretty awesome. All tactical and RTS'y",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. Its one of the best ww2 RTS game i've ever played. In this you command squads rather than whole Armys. Its got three campaigns for the Soviet Union, the German Army, and the United States witch are in my mind are pretty well done. The gameplay is really fun to, You will sneak past enemy patrols, defend Moscow, charge enemy trenchs, and attack all kinds of things. In the end i'll give it a 4/5, sometimes it gets boring fighting waves of enemys. But still its a must buy for $4.99 so BUY IT NOW",
            "review_score": "1"
        },
        {
            "review_text": "HELLO SO MEN OF WAR IS GRATE !!! the game is very hard grafichs are good for the time it came out gameplay is briliant sounds is good voice accting is bad over all very good game i give it a 8/10 PS i hade a grafivh bug i fixt it in game opshions",
            "review_score": "1"
        },
        {
            "review_text": "Very nice game overall but the voice acting is just....ehhw This game will make you buy all the mow series.",
            "review_score": "1"
        },
        {
            "review_text": "Love it !",
            "review_score": "1"
        }
    ]
}