{
    "app_id": 80,
    "name": "Counter-Strike: Condition Zero",
    "release_date": "2004-03-01",
    "developer": [
        "Valve"
    ],
    "publisher": [
        "Valve"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Valve Anti-Cheat enabled"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "FPS",
        "Multiplayer"
    ],
    "achievements": 0,
    "positive_ratings": 12120,
    "negative_ratings": 1439,
    "price": 7.19,
    "description": "With its extensive Tour of Duty campaign, a near-limitless number of skirmish modes, updates and new content for Counter-Strike's award-winning multiplayer game play, plus over 12 bonus single player missions, Counter-Strike: Condition Zero is a tremendous offering of single and multiplayer content.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/80/header.jpg?t=1512411962",
    "minimum_requirements": "500 mhz processor, 96mb ram, 16mb video card, Windows XP, Mouse, Keyboard, Internet Connection Recommended: 800 mhz processor, 128mb ram, 32mb+ video card, Windows XP, Mouse, Keyboard, Internet Connection",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Still better than CoD : Ghosts.",
            "review_score": "1"
        },
        {
            "review_text": "Condition Zero Deleted Scenes is basically Counter Strike 1.6 with missions. Do you want more from a simple shooter game ?",
            "review_score": "1"
        },
        {
            "review_text": "Been playing CS:CZ for 10 years. Really awesome game, even with an old engine.",
            "review_score": "1"
        },
        {
            "review_text": "How do i play Counter-Strike: Condition Zero 1.open console type in bind k bot_kill 2.everytime i die press k 3.feel like a god 10\\10",
            "review_score": "1"
        },
        {
            "review_text": "It's 1.6 with better graphics, more maps, and a mildly entertaining singleplayer mode.",
            "review_score": "1"
        },
        {
            "review_text": "Condition Zero is basically Counter-Strike 1.6 with minor improvements to the graphics I guess.   Gameplay remains the same. Much of the official and even community-created maps from 1.6 are available here as well. There are a good amount of servers up, though this is the least played CS. Deathrun, Gun game, Surf and more custom mods can still be played.  The Multiplayer version comes with Tour of Duty. These are small missions in which you assign yourself a team of bots and play rounds against other bots as a Counter-Terrorist until you complete them. As you progress, you will gain points to spend on better bots and have an easier time.  Buying Condition Zero also grants you Deleted Scenes. This is where Valve tried to make a single-player version of Counter-Strike. In this campaign, you once again take the role of a Counter-Terrorist, but this time, you are basically solo, ♥♥♥♥ing up Terrorists like Rambo. Your higher-ups pretty much chill outside while you are doing the dirty work. In Deleted Scenes, there are some new items introduced, such as radio-controlled bombs, cameras and blowtorches. You have to rely on your aim to complete the game, though medkits and ammo packs are not scarce and you will rarely run out of health or ammo.  It is bundled with 1.6, so the price is pretty good for 2 great games and I recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Synopsis:   With its extensive Tour of Duty campaign, a near-limitless number of skirmish modes, updates and new content for Counter-Strike's award-winning multiplayer game play, plus over 12 bonus single player missions, Counter-Strike: Condition Zero is a tremendous offering of single and multiplayer content.",
            "review_score": "1"
        },
        {
            "review_text": "Legend indeed... :) because of that game I use nowadays steam . +",
            "review_score": "1"
        },
        {
            "review_text": "The follow up from the original Counter-Strike game, this was for me one of the first games that I really started to have fun, there are endless things to do, play a couple missions, join servers with weird mods, the old known predator mod in which you get hunted down by a predator and you'll have to kill it in the dark with a group of random people. From surfing to bhopping, playing paintbal, you name it and CS:CZ has it.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game CSCZ :D",
            "review_score": "1"
        },
        {
            "review_text": "Cory in the House is a television show, which aired on the Disney Channel from January 12, 2007 to September 12, 2008 and was a spin-off from the Disney show That's So Raven. The show focuses on Cory Baxter, who moves from San Francisco, California to Washington, D.C. with his father, after Victor Baxter gets a new job in the White House as the official head chef. The series marks a Disney Channel first, as it is the channel's first spin-off. This is also the only Disney Channel spin-off series to be broadcast in standard definition for the entire length of the show. Reruns of the series have not been produced on Disney Channel, or on Disney XD; however they continue to air on the Family channel in Canada. Raven-Symoné guest-starred, reprising her role as Raven Baxter in one episode. In 2014 Disney Channel started airing a weekly block called Disney Replay on Wednesdays nights, during which episodes of Cory in the House air alongside That's So Raven and Kim Possible, among others.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Citizen Kane of gaming, flawless, best game Valve has ever been involved with, perfect. Just kidding, it's pretty awful. At least Valve was nice enough to show this disaster to the public. It's good for some laughs, at how awful the game is.  (This was written about the deleted scenes portion of the game)",
            "review_score": "1"
        },
        {
            "review_text": "I don't know why Condition Zero gets so much ♥♥♥♥ from people. Go buy it for the singleplayer, it's pretty good.",
            "review_score": "1"
        },
        {
            "review_text": "it's like CS with guns",
            "review_score": "1"
        },
        {
            "review_text": "It's exactly as I imagined, singleplayer CS. If you dont have any interwebs and have it in your library you can play CS with bots but the change is that bots aren't mentally challenged anymore. Instead you can see their stats meaning you can make a totally  stacked  balanced team! Fun if you have no internet and want to play some CS.",
            "review_score": "1"
        },
        {
            "review_text": "The first of CS series I've ever played..  I don't need to describe how wonderful it is.  Just play it ;)",
            "review_score": "1"
        },
        {
            "review_text": "I shot the american flag and exploded into a million pieces.",
            "review_score": "1"
        },
        {
            "review_text": "Imagine a counter-strike game but wıth a STORY MODE!!! SOOOOO COOOL!",
            "review_score": "1"
        },
        {
            "review_text": "The deleted scenes felt like more of a well made half life 1 mod. (I've played plenty of those on the WON version) Although the singleplayer falls a bit short it still feels like the CS we all love :D",
            "review_score": "1"
        },
        {
            "review_text": "Amazing classic, with a campaign on deleted scenes, and also an amazing mode kind of like Rainbow Six. Its a great game!",
            "review_score": "1"
        },
        {
            "review_text": "A really good Counter-Strike game WITH bots, unlike 1.6.",
            "review_score": "1"
        },
        {
            "review_text": "  Awesome game with old school graphics ..",
            "review_score": "1"
        },
        {
            "review_text": "BEST COUNTERSTRIKE EVER MADE BEST COUNTERSTRIKE EVER MADE BEST COUNTERSTRIKE EVER MADE BEST COUNTERSTRIKE EVER MADE BEST COUNTERSTRIKE EVER MADE BEST COUNTERSTRIKE EVER MADE BEST COUNTERSTRIKE EVER MADE BEST COUNTERSTRIKE EVER MADE BEST COUNTERSTRIKE EVER MADE  BEST COUNTERSTRIKE EVER MADE BEST COUNTERSTRIKE EVER MADE BEST COUNTERSTRIKE EVER MADE",
            "review_score": "1"
        },
        {
            "review_text": "Didn't even know this existed",
            "review_score": "1"
        },
        {
            "review_text": "The shooter school.",
            "review_score": "1"
        },
        {
            "review_text": "I only got it for the   missions   Awesome gameplay!",
            "review_score": "1"
        },
        {
            "review_text": "A lot of fun....what more can i say?",
            "review_score": "1"
        },
        {
            "review_text": "I played only an hour, but within that time, no one said '♥♥♥♥ ♥♥♥♥♥' OR 'IDINAUHT' to me.  Probably the best Counter Strike.",
            "review_score": "1"
        },
        {
            "review_text": ":+ ",
            "review_score": "1"
        },
        {
            "review_text": "--------Awe-s-ome n Addictive Game----------------------------------------------------------------------------------",
            "review_score": "1"
        },
        {
            "review_text": "Amazing fun. I'd rate this game at a 4.5/5 stars.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game !",
            "review_score": "1"
        },
        {
            "review_text": "Counter-Strike: Condition Zero",
            "review_score": "1"
        },
        {
            "review_text": "Nice but not like 1....",
            "review_score": "1"
        },
        {
            "review_text": "It is great game and the community is still there and it is not near as toxic as CSGO.",
            "review_score": "1"
        },
        {
            "review_text": "Counter Strike: Condition Zero: I like the missions in this game, like the missions where you just play regular CS, but I dont see why others dont? Still great game though.  Deleted Scenes: Im not that much for it but its still a decent experience.",
            "review_score": "1"
        },
        {
            "review_text": "its a good game",
            "review_score": "1"
        },
        {
            "review_text": "Counter Strike: Condition Zero seems good at first. A single player Counter Strike experience? A campaign for one of the most played games ever? BOTS? Sign me up, right? Well, it would have been absoultely good if it was made by one company and published by Valve. You see, it was going to be made by one company, but for some reason that I don't know, they gave it to another company. Than ANOTHER company. It just finally ended up at whoever made it today.  The game itself is NOT bad. It's actually fun. I quite enjoyed playing the campaign, even though I had no idea what was going on. The only thing that lacked was the 'tour of duty' thing where you play with bots. It was really short and I beat it in, what, 2 hours?  I don't know why people always diss this game. I liked this game.  Overall, this game gets a 89/100 for me.",
            "review_score": "1"
        },
        {
            "review_text": "how to fix bullet lagg ",
            "review_score": "1"
        },
        {
            "review_text": "n1 game gramphics",
            "review_score": "1"
        },
        {
            "review_text": "CS 1.6 with HD graphics and an offline mode. Comes with 1.6 too. BUY IT.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. Adds to the fantastic gameplay of the original with bots and single-player. The AI of the bots is a bit clunky now and then but it positively contributes significantly to the game. The Tour of Duty missions are just matches with bots with extra challenges. Adds to extra replayability.  8/10 - Pretty Damn Good.",
            "review_score": "1"
        },
        {
            "review_text": "Almost as good as Nexon: Zombies....almost :D",
            "review_score": "1"
        },
        {
            "review_text": "pec of shet pls volvo refund me monie",
            "review_score": "1"
        },
        {
            "review_text": "I remember that I used to play this game a lot years back. Aah...that nostalgic feeing! Valve should make more mission based games like this in CS franchise.......atleast I hope they will :)",
            "review_score": "1"
        },
        {
            "review_text": "It's a nice a game when your internet isn't working.",
            "review_score": "1"
        },
        {
            "review_text": "Nice addition to CS 1.6, good game, Had great time playing this game !",
            "review_score": "1"
        },
        {
            "review_text": "Best online multiplayer game. :D",
            "review_score": "1"
        },
        {
            "review_text": "back to 90",
            "review_score": "1"
        },
        {
            "review_text": "Great game, old school yet exciting",
            "review_score": "1"
        },
        {
            "review_text": "You need to have used this product for at least 5 minutes before posting a review for it (0 minutes on record).",
            "review_score": "1"
        },
        {
            "review_text": "sure nothing new when compared to 1.6 but i still recommend it. offline mode added and 'tutorial' challenge mode with bots. don't listen to all the people that have ran this game down for almost 10 years. they're just butthurt.",
            "review_score": "1"
        },
        {
            "review_text": "Old School And A Fun Game",
            "review_score": "1"
        },
        {
            "review_text": "It's like counter strike 1.6 but with better graphics and a nice storyline! I like it :D would play more when i have time :P But still it's a nice game, well made but still it's a failure to me because the game was released when CSS got released :P But in a other words the game is pretty fun ^^  7.4/10  ",
            "review_score": "1"
        },
        {
            "review_text": "Game is not bad, actually in some situations is better then Counter Strike 1.6, but again, there are no players... I think, the maker of game must share some keys..",
            "review_score": "1"
        },
        {
            "review_text": "Its a good game i love this its a top game in the steam ",
            "review_score": "1"
        },
        {
            "review_text": "THE COUNTER-STRIKE THAT NOBODY CARES ABOUT",
            "review_score": "1"
        },
        {
            "review_text": "It may be old, but it sure is still as fun as I remember it when I was younger. Its like Half-Life, but not as good. But still really fun. It comes with 2 games: Counter Strike: Condition Zero and Counter Strike: Condition Zero Deleted Scenes. Deleted scenes has npcs and storyline, the main game... Is basically Counter-Strike with bots and challenges. If it weren't for Deleted Scenes, it would be pretty bad. I give this the stamp of approval, as well as a 7 out of 10!",
            "review_score": "1"
        },
        {
            "review_text": "Love the hit boxes..",
            "review_score": "1"
        },
        {
            "review_text": "nice fps game",
            "review_score": "1"
        },
        {
            "review_text": "Praise My Young Games",
            "review_score": "1"
        },
        {
            "review_text": "  Best cs ever!",
            "review_score": "1"
        },
        {
            "review_text": "By far the best Counter-Strike game out there.",
            "review_score": "1"
        },
        {
            "review_text": "Guns pew pew ",
            "review_score": "1"
        },
        {
            "review_text": "  A lots Lots LOTS better than this ♥♥♥♥ing cs:go  no moneys spend no skins no this ♥♥♥♥ing graffiti good teamplay | good sound | better grafics and muxh ---",
            "review_score": "1"
        },
        {
            "review_text": "My First And Favourite Game :P",
            "review_score": "1"
        },
        {
            "review_text": "Nice counter strike",
            "review_score": "1"
        },
        {
            "review_text": "why do I have so many hours played on this game?",
            "review_score": "1"
        },
        {
            "review_text": "+1",
            "review_score": "1"
        },
        {
            "review_text": "Only for poor russians. So basically all russians",
            "review_score": "1"
        },
        {
            "review_text": "It's like 1.6      But slightly worse        Edit: Don't get me wrong, it's a good game non-theless, 1.6 is just better &lt;3   ",
            "review_score": "1"
        },
        {
            "review_text": "I guess you could say i like this game..... Alot........ Get it...... Now. 1000000/10",
            "review_score": "1"
        },
        {
            "review_text": "Very nice job after the cs1.6 some better graphismes but still not good enough for the current games that were going out at the time.  It's sad that the gameplay was inferior to the cs1.6 this is one of the reasons cs1.6 stood at 1st palce and that's probably why we couldn't go to eSport with that one.  Anyway I still recomend this game at 90% of cs players, for the fun and old memories !",
            "review_score": "1"
        },
        {
            "review_text": "&gt; Playing game.  &gt; Map is cobblestone on expert &gt; Alex is last person on my team &gt; 5 on enemy team &gt; I think GG &gt; Alex thinks other wise &gt; Goes to long A, T-side, dropped bomb &gt; 1 guy, kills him with AWP &gt; Flick-shot 2 more &gt; Pistol whip 1 other &gt; Dodge AWP shot and flick HS the last guy &gt; Says 'Do NOT mess with me.' Best AWPer NA/EU, KennyS and Skadoodle have no way of beating him. 10/10 second best FPS ever, only to Deleted Scenes.",
            "review_score": "1"
        },
        {
            "review_text": "Great &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "This is a GREAT fun multiplayer game, but you need time to figure the map and the guns and the load outs ...  I will have a little rant though, about a VIP player called 'Peabody' ... this guy BANNED me for THREE days on the UGC server for having a little sing for no more than 10-15 seconds ... he didnt warn me ... he didnt say stop it .... ok on his defense it was britney spears BUT common MAN dont JUST ban people ... anyway when I went back on five days later I saw him and I called him out saying WHY did you ban me? you could have told me to shut up or MUTED me for an hour or BANNED me for 30 minutes ... I would have gotten the message i'm not a newby (well a little lol) i have been playing in this server for over 500hours .... anyway WITHOUT A NOTICE HE PERMANANTLY BANNED ME!! ... ok i did call him a D**K BUT he deserved it for what he did previously without a warning. Anyway its over now and I can spend the time not enjoying this server and friends I play with on there including Alfantander, Retro, pointless, rocked, x.e.y.w.a.n.i. (yeah its spelt like that) and loads ot other guys i cannot remember their names on the server but all cool guys ... ANYWAY ...  WATCH OUT for PEABODY!! and its in the UGC server de-dust2 .... apart from HIM! the game and ppl are cool.",
            "review_score": "1"
        },
        {
            "review_text": "Fun Game, not much different from any other Counter-Strike. It is probaly my least favorite one.",
            "review_score": "1"
        },
        {
            "review_text": "I had alot of fun with this game !",
            "review_score": "1"
        },
        {
            "review_text": "The Evolution basic Game of the whole World - Must have played - A perfect game for practicing his/her aim  - After playing this game , you have  enough skills for other shooter games.   - In this game you can show other people how really good you are in video games  ",
            "review_score": "1"
        },
        {
            "review_text": "Definetely should be there in your libraries.This game is a living legend. Improved graphics,sounds and maps are excellent.Also easy to find friendly people in online servers.It's pretty enjoying. Btw there is no need to praise the offline missions' gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, would play and would recommend 4/5",
            "review_score": "1"
        },
        {
            "review_text": "This is my favourite Counter-Strike game, i love the classics, this game grabs CS 1.6 and makes the already awesome game even better with more detailed textures, remade maps and bots.  An absolute masterpiece and a must get for any shooter lovers. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "What could I possibly say about this game. It's too fantastic for our world. Condition Zero? More like Condition My Hero because this game is possibly the best game ever made.",
            "review_score": "1"
        },
        {
            "review_text": "  nothing has change bec. it's still the best FPS of all time i love it very much",
            "review_score": "1"
        },
        {
            "review_text": "i just want the level 1 badge thing :D",
            "review_score": "1"
        },
        {
            "review_text": "Evan thought the first counter strike good gun graphics and fun",
            "review_score": "1"
        },
        {
            "review_text": "Nice gaMe Its MY Favourite &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Nice gaMe Its MY Favourite &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "I cant englsiaijh whatsis gamevideo ruisisain?",
            "review_score": "1"
        },
        {
            "review_text": "Basically, it's Counter-Strike 1.6, which is already a plus to me. Though, it has a single player mode, somekind of campaign, in which not only you ahve to win rounds but complete objectives, a rather good way to train your skills.  The models for the guns though, they are different, obviously, some sound different, a bit.  It features new levels to the 1.6 counterpart, but it might not have some from 1.6. I don't know.  It's underrated mostly because well, nobody cared about it. And if you had Counter-Strike Anthology, you'd get Condition Zero: Deleted Scenes, some kind of HL1 game but with CS stuff. It's okay.  I'll rate this 7, if you enjoy Counter-Strike, pick this one up, Though CS:S, CS 1.6 and GO, will be much better choices over it.",
            "review_score": "1"
        },
        {
            "review_text": "You have been kicked and banned permanently by the server op. Kicked and banned ",
            "review_score": "1"
        },
        {
            "review_text": "kenny is good at squating.",
            "review_score": "1"
        },
        {
            "review_text": "i like this one better than CSGO its actually free and fun",
            "review_score": "1"
        },
        {
            "review_text": "I cannot say too much in this review because I have not played very much of it, but I will admit that I really think it is cool how there is a single player game mode in this game.",
            "review_score": "1"
        },
        {
            "review_text": "This is an educational game for the entire family.",
            "review_score": "1"
        },
        {
            "review_text": "The online is pretty barren at this point. The servers that are up are mostly outside the US or running mods that probably suck.   But there are some reasons this maybe the last real 'Counter Strike' game as the later ones went to Source and the problems relative to that. Aswell as far reaching but in reality small changes made in CSGO and CSS that really make it very very diffrent than the older games when in play.  Graphically CS and CS:CZ are pleasant looking, simplistic, whats good for a competative shooter game. Its easy to see enemies. Models look pleasant, and its still has some really great 3D sound effects.  Suffice to say if this game had slightly better controls, matchmacking or was updated to have these features it would probably be alot more lively than it is today. Or even add those features for standard CS. I would rebuy or pay extra for that.  CS:CZ and CS come together if you buy them and they would make a terrific LAN game.  If you want something to play single player all you will get from here is Bot Matches (Bots are really good for a multiplayer game in CZ and better than CSGO bots). CZ Deleted scenes is included but this is basically an unfinished old game thats just not good at all but really had some capability to be pretty good but unfortunately they didn't further its development so its crap.  If you want a multiplayer game for online play with random people around the globe, CS or CSGO would be a better choice since both of those seperately have way more players than this game.  ",
            "review_score": "1"
        },
        {
            "review_text": ":)))",
            "review_score": "1"
        },
        {
            "review_text": "Still better then CS:GO",
            "review_score": "1"
        },
        {
            "review_text": "So, I got this along with buying counter strike. When I started it up, right away the screen was off, so I tried to change it, and it crashed the game.(This is on an Alienware Area 51 r2 desktop btw). So, I had to play it while it was windowed. When I started an offline game with bots, there was major lag issues. (Yet again, on an alienware area 51 r2 desktop). And whenever I tried to disconnect the server, the game would crash, resulting in me having to either restarting steam or my computer. So, I dont know if it either was a virus, or the game is just too old to be played. This wouldn't have been a negative comment if it weren't for that...",
            "review_score": "-1"
        },
        {
            "review_text": "..",
            "review_score": "1"
        },
        {
            "review_text": "the best counter strike game there is! better than counter strike:GO. all those people who say it's too old are blaspheming!",
            "review_score": "1"
        },
        {
            "review_text": "  ♥♥♥♥ THIS GAME!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "Condition Zero comes with 2 modules:  1. Condition Zero (CZ)  - Provides a slightly different MP experience to that of CS1.6, mostly graphical changes with a few gameplay changes. Also has a player vs. bots singleplayer mode, which is essentially just multiplayer with bots instead of humans, but with added objectives to make it a bit more difficult.  2. Deleted Scenes  - A scripted single player campaign similar to something you'd see in Quake or Unreal Tournament.  For simplicity's sake I'll go over the changes CZ introduces, just keep in mind this isn't something I've thoroughly researched or anything of the sort, just what I know from playing multiple versions of CS for around a decade now. If you don't know the core gameplay of Counter Strike to understand these changes... well then go buy 1.6 and then consider picking up CZ.    Changes     Lighting - Lighting is updated to be more smooth and natural, shadows and darkness is generally not as harsh and saturation looks much more natural, in my opinion this is a good change both aesthetically and gameplay wise, excluding the saturation change. I would prefer deeper saturation to make things easier to see and more colorful. You can somewhat counteract this by using a setting called digital vibrance in the NVidia control panel. If you have an AMD card they have a similar setting, though I do not know what it is called.   Gun Models - Gun models are updated to look more realistic and metallic, most have changed color palettes or just added color in general and a select few have new animation, mostly just moving parts, for instance the bolt on the FAMAS/Clarion now moves when firing. Also the knife has a new animation which I think looks awful. Overall this is a positive change though.   Character Models - Character models are completely changed. They are higher resolution but in my opinion the new models look lame in comparison to the 1.6 models.   Textures - Pretty much every texture on the maps have been changed and made higher resolution. For the most part the changes are welcome to me, though they do effect the visual feel of the maps a little. I think I'd consider this a positive change.   Outside of the additions I mentioned at the beginning of the review, that's really the extent of the changes. Mostly all visual changes.  So the question is... do these changes warrant a purchase? Not in the slightest. For various reasons, if you're buying this for multiplayer, you're better off just playing 1.6.  In my eyes, the only reason to pick up CZ is for the Deleted Scenes. However I don't believe Deleted Scenes is actually worth the $10 CZ goes for.  Basically the campaign is a collection of missions with no overarching story or really anything of interest in the way of plot. They are all linear. They take place in different locales around the world. They are all played on the CT side, although the factions will differ. They offer a very small amount of puzzle solving. They have boss fights. They have forced stealth sections.  Here is what I dislike about Deleted Scenes:   Linear as hell, wouldn't be a problem if it didn't give you the illusion of choice with multiple hallways and doors just leading to dead ends, often without an item reward.   Secrets are hidden pretty lazily and without thought, even when you go out of your way to look for them you probably won't find a majority of them, and when you do find them, they are mostly useless.   Enemy placement has very little thought, often times they are placed in dark corners or closed doors. If they are placed somewhere that requires a scripted animation, they are completely invincible until the animation plays out.   Boss battles are awful, all of them but the final 2 bosses are insanely easy. The 2nd to last boss is just a bullet sponge that can take literally several AK clips to the head and numerous grenades before he dies, but he can kill you just as quick as any other enemy, not to mention he's surrounded by 2 shot kill snipers AND you are on a timelimit to kill him. Just awful. The last boss is actually pretty good and a satisfying finale, but he also has 2 bullet sponge troops that will kick your ♥♥♥ if you don't cheese them somehow.   The game is incredibly easy, even on hard. The only time I was challenged was the aforementioned bosses and when I had to escort the ♥♥♥♥♥♥♥♥ AI.   Escorting AI is just plain awful.   The most fun guns run out of ammo quickly.   You can get trapped by AI very easily.   Some puzzles are very difficult not because they require you to use your brain but rather because they require you to go around knifing random things (MULTIPLE TIMES) until something breaks, and it's rarely obvious what you should be attacking.   Allied AI is useless   Enemy AI is braindead. Most of the time they just stand in one spot and shoot at you, never trying to get to a better position.   The forced stealth is AWFUL. It's dreadfully boring and boils down to crouching behind a box, waiting for enemy to turn back, moving to next box, waiting for enemy to turn back, rinse, repeat, rinse, repeat, over and over again and it always left me wanting to just quit playing it was so boring and uninspired. More guns, less sneaking. PLEASE.   With that said, I think Deleted Scenes is a fairly average FPS when it's at it's best. When at it's worst it is just plain bad. Unless you're a die hard CS fan that wants to experience it, there are so many other games to spend your time and money on.  Oh and I didn't even mention the fact that this came out in 2004. Half Life 2 came out 7 months after this. Take a second to think about that.",
            "review_score": "-1"
        },
        {
            "review_text": "Worst Counter Strike out there.",
            "review_score": "-1"
        },
        {
            "review_text": "the ai is terrible! it's like csgo bot mode, but 10X worse",
            "review_score": "-1"
        },
        {
            "review_text": "Horrible game. The teammate ai is the worst thing I've seen, they will litteratly stand in front of their enemy, while the enemy ai has perfect aim, they will instantly headshot you if you don't duck, most important the teammate ai wont defuse the bomb while your alive, so if your far away from the planted bomb, you lost. Don't play this game, I only got this because I bought the CS bunldle.",
            "review_score": "-1"
        },
        {
            "review_text": "sorry but not good",
            "review_score": "-1"
        },
        {
            "review_text": "Not too big of a difference from 1.6, but nevertheless, it's a nice game. It's pretty popular in France, and there is a lot of French players on it. But the game is dying, therefore, I recommend that you go with CS 1.6 instead of this.",
            "review_score": "-1"
        },
        {
            "review_text": "This Game is a piece of ♥♥♥♥ing ♥♥♥♥!",
            "review_score": "-1"
        },
        {
            "review_text": "One of the buggiest games I've ever played. It seems a joke. These are the reasons to not buy this game ever:  1. Very repetitive 2. Non sense puzzles to solve to make the game last longer: Stupid like a switch does not work until you kill an enemy that is hidden somewhere. 3. Everything is scripted: Sometimes there is friendly fire and sometimes not, some enemies can be killed with barrels some not, enemies will teleport infront of you. 4. Very poorly scripted: NPC can block your pass to finish a mission so you have to load a previous save to finish a mission. NPC are ridicously exposed so they can be killed and missin fails. 5. Very buggy: Sometimes you cant climb a ladder or sometimes you have to load a previous save because something that was supossed to happen didn't happened. 6. No realism at all: Things like killing bosses with 5 headshots with an sniper rifle, enemies shooting behind bushes where you cannot see through, enemies shooting you in darkness, etc. 7. Really poor difficulty level: I played in hard mode. The first missions were just fine in difficultie but for some reason, the more I played, the more overclocked the enemies are: yes, overclocked. Enemies will run faster, shoot faster and need 3 headshots to be killed. The last mission I played (in japan) was so ridiculous that enemies could kill you in 1ms after you cross a wall, or walk 30 meters in 1 second, just like the first half life ninjas but with bigger guns. 8. The saves are broken: I've never seen this in my life. The save files have two major bugs. The first one is that each time you load a save file, your weapon starts firing until you switch weapon. This makes you loose a lot of ammo. The second bug is that when you load a file, you dont appear exactly were you should be and you dont have the same ammo and health. Actually I got stuck in a situation where I was appearing in front an enemy who killed me in 1 millisecond after loading.",
            "review_score": "-1"
        },
        {
            "review_text": "I had a different idea about this game.. somehow once i tried but i felt this game wasnt meant to be single player. If you like single player's game this one is for you.",
            "review_score": "-1"
        },
        {
            "review_text": "boring",
            "review_score": "-1"
        },
        {
            "review_text": "why AK-47 its soo EASYY and zombie server its SOO LAAGG i hate dis game dis game is fulll retard no skill better CSS AND CS GO dat was good game",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ing HORRIBLE god awful just objectively BAD comes free with cs 1.6 or whatever but rather shoot self than withstand this OMG",
            "review_score": "-1"
        },
        {
            "review_text": "░░░░░░░░░░░█▀▀░░█░░░░░░ ░░░░░░▄▀▀▀▀░░░░░█▄▄░░░░ ░░░░░░█░█░░░░░░░░░░▐░░░  ░░░░░░▐▐░░░░░░░░░▄░▐░░░ ░░░░░░█░░░░░░░░▄▀▀░▐░░░  ░░░░▄▀░░░░░░░░▐░▄▄▀░░░░  ░░▄▀░░░▐░░░░░█▄▀░▐░░░░░  ░░█░░░▐░░░░░░░░▄░█░░░░░  ░░░█▄░░▀▄░░░░▄▀▐░█░░░░░  ░░░█▐▀▀▀░▀▀▀▀░░▐░█░░░░░  ░░▐█▐▄░░▀░░░░░░▐░█▄▄░░░  ░░░▀▀░▄ CS ▄░░░▐▄▄▄▀░░░ ░░░░░░░░░░░░░░░░░░░░░░░ ",
            "review_score": "-1"
        },
        {
            "review_text": "How do I own this ♥♥♥♥? ♥♥♥♥.  Don't buy this, I'd give you mine if I could.",
            "review_score": "-1"
        },
        {
            "review_text": "best gam ever much btter then cod an batelfield and gta i onli 12 butt i can recomend tis gam OMGOMGOM i so &lt;3 it !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "itz has given me my best buddyies in life",
            "review_score": "1"
        },
        {
            "review_text": "awesome one of cs series",
            "review_score": "1"
        },
        {
            "review_text": "ripoff of call of medal of halo:global fortress",
            "review_score": "1"
        },
        {
            "review_text": "Its great! The missions are all really fun! A little awkward if your used to the new counter strike games though.",
            "review_score": "1"
        },
        {
            "review_text": "I am impressed! CS:CZ Deleted scenes is waaaaay better than basic CS:CZ.",
            "review_score": "1"
        },
        {
            "review_text": "Good game most of the fun was playing on servers. I also need to host or make a jailbreak server. If you could help me that whould be great",
            "review_score": "1"
        },
        {
            "review_text": "awsome game",
            "review_score": "1"
        },
        {
            "review_text": "old school and still fun to play with.",
            "review_score": "1"
        },
        {
            "review_text": "Condition Zero: Pretty tough, but very, very good. Classic CS action, classic CS balance, but with moar bots. They tend to get hung up on stairs and such, but it's pretty fun. Oh yeah, and it does multiplayer, so enjoy hiding behind a bulletproof shield.  Condition Zero Deleted Scenes: A horribly racist, barely-Counter-Strike-related semi-linear FPS that feels like a bad Half-Life mod. Play the training mission and leave every other level alone, it's just that bad (ESPECIALLY in the first mission).",
            "review_score": "1"
        },
        {
            "review_text": "Fairly decent multiplayer game but it still doesn't beat CS 1.6 at all. Few servers and players left playing the game from what I've seen. I didn't quite like the graphics to it though it looked very weird like the gun models and such. If you were to choose from getting this or CS 1.6, get CS 1.6 without a doubt!   Also. THE FREAKING NADES IN THIS GAME KILLS YOU IN ONE HIT I HATE IT!! They need to fix that.",
            "review_score": "1"
        },
        {
            "review_text": "one of the best games ive played but its out of date but for an old machine its great",
            "review_score": "1"
        },
        {
            "review_text": "not bad fun game with the many mods",
            "review_score": "1"
        },
        {
            "review_text": "Good Game I Dont Own It Just Shared This Game With My Friends Profile .  Would Like If Some1 Gifts Me :/",
            "review_score": "1"
        },
        {
            "review_text": "Brings my old time back :3",
            "review_score": "1"
        },
        {
            "review_text": "THe Graphics are bit too colorful unlike in CS 1.6.... but less lagg and smoother game play...",
            "review_score": "1"
        },
        {
            "review_text": "Counter-Strike: Condition Zero, it is literally impossible to be a PC gamer and not know what this game is. They're all great. Go play them.",
            "review_score": "1"
        },
        {
            "review_text": "It's just a Counter-Strike with set rules and a few minor graphical tweaks. It's fun because it's Counter-Strike, but to be honest, it's just a lazy title.",
            "review_score": "-1"
        },
        {
            "review_text": "I recommend this game due to it's old fashonied ways and more. As it is an very old game, it will probably work on any PC because it's graphics aren't the most amazing to lag your computer to death! Suprisingly people still play this game today and I very do recommend it. I also could say that this version having bots makes it easier then having to play with other people all the time. I believe this golden game deserves a medal! Seriously though, buy it.",
            "review_score": "1"
        },
        {
            "review_text": "I was banned for no reason from Smokinguns Hideout for almost 5 days now.",
            "review_score": "1"
        },
        {
            "review_text": "I was stuck at Mission 4 - Building Recon.... at a supid ladder. I could not go on... maybe it was a bug or I don't know how to press button.",
            "review_score": "1"
        },
        {
            "review_text": "it is fun and enjoyable to pay with friends and people online",
            "review_score": "1"
        },
        {
            "review_text": "great game",
            "review_score": "1"
        },
        {
            "review_text": "Essentially this is Counter-Strike 1.6 with a few modifications. There are bots, a riot shield, and slightly better graphics.  Overall, this game is allright for the price on a sale. If you own GO, dont buy this for the gameplay unless if you want to see what the originals were like.  I personally mainly use this for playing CS with friends who don't own it over LAN, because you only need one person who owns it to play this one. Just sign into your account on offline mode on their computer, and then they can boot the game and using the classic server finder connect via LAN.  Other then that I never play this. Ever. Long story short, if you want a older feeling game with fun in store, get this. If you want legitimate online gameplay, a huge community, and good graphics, CSGO is a steal for only 5 more.",
            "review_score": "1"
        },
        {
            "review_text": "This is still the best CS ever made ! been playing this pro for years !",
            "review_score": "1"
        },
        {
            "review_text": "For some reason I really really like the campaign of Condition Zero: Deleted Scenes. I think it's because every mission takes place in a new environment with different people and everytime the plot seems to include a ton of action-movie tropes. The multiplayer is dead and the singleplayer for the regular game sucks, but I'd still get this game if only for the deleted scenes.",
            "review_score": "1"
        },
        {
            "review_text": "cool. Same as the first one but the maps and weapons are updated didn't finnish the play counter strike condition zero campain is it? :D",
            "review_score": "1"
        },
        {
            "review_text": "The unwanted, unadored and underappreciated installment of the Counter-Strike franchise. The two single player modes are horrible. If you want a single player FPS game there are hundreds if not thousands of better titles to choose from. The game lacks the purity of 1.6, the innovation of Source and the great facility of Global Offensive's competitive matchmaking and yet there is still a lot to be said for Condition Zero. It is, at its core, Counter-Strike after all. The game is still trundling along in 2015 thanks to some dedicated, and often small, communities. You will also find a great number of maps which are unique to this version of Counter-Strike.",
            "review_score": "1"
        },
        {
            "review_text": "Very good game , but css and go 100% better",
            "review_score": "1"
        },
        {
            "review_text": "After countless minutes playing this game. I would say Recommend!       10/0.01 Would review again",
            "review_score": "1"
        },
        {
            "review_text": "A really ♥♥♥♥♥♥ FPS made merely bad by Counter-Strike's great gun handling. Multiplayer is mostly dead, too. Don't bother.",
            "review_score": "-1"
        },
        {
            "review_text": "The bot's are awesome love this way more than 1.6 thanks to the bots!",
            "review_score": "1"
        },
        {
            "review_text": "10/10. It's like Half-Life but in Counter-Strike.",
            "review_score": "1"
        },
        {
            "review_text": "So I tryed loading the game and it shows like a 1 in by 1 in square and thats all i can see from the game. So if anyone can help me then that would be greatful.",
            "review_score": "-1"
        },
        {
            "review_text": "Would fire in the hole and throw icicles at intruders again  10/10",
            "review_score": "1"
        },
        {
            "review_text": "this very cool",
            "review_score": "1"
        },
        {
            "review_text": "Same opinion now that i've bought them all again. Counter Strike is legendary.",
            "review_score": "1"
        },
        {
            "review_text": "Classic, though I'd reconmend one of its newer conterparts at this point in time.",
            "review_score": "1"
        },
        {
            "review_text": "I see why CS:CZ was free with 1.6 The Deleted Scenes is just awful, hands down. After being made the same year as Half-Life 2, one of the best single-player games out there was just a huge disaster CS:CZ is basically just a slightly better graphics game but its not even worth it. Basically CS:CZ Deleted Scenes is like a Call Of Duty Campaign but not even worth it.    I even repeated worth it.",
            "review_score": "-1"
        },
        {
            "review_text": "When cs was in it's darkest hour, either way- it was BOOOORRRIIIIINNNG",
            "review_score": "-1"
        },
        {
            "review_text": "Nice game",
            "review_score": "1"
        },
        {
            "review_text": "Great single player and multilayer, a must have game for fans of the counter strike series",
            "review_score": "1"
        },
        {
            "review_text": "...",
            "review_score": "1"
        },
        {
            "review_text": "Playing CS GO theme in background while playing to feel good,  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Best multiplayer game :D",
            "review_score": "1"
        },
        {
            "review_text": "Ah  Ever Green FPS   Even after Soo many years it's multiplayer is still alive  can't say much about community though   Nice Game u can't compare it with todays soo called CRYTEK games in terms of Graphics but The game wont dissapoint You   FIRE IN THE HOLE !!!!!!   ",
            "review_score": "1"
        },
        {
            "review_text": "played one game of this steaming heap of ♥♥♥♥ before uninstalling it. no wonder nobody remembers this CLASSIC...  rather remember to let the cat out and get back alley crack alley jumped by lexington steele  (you know where that's going)",
            "review_score": "-1"
        },
        {
            "review_text": "&lt;3 The SinglePlayer Mode ",
            "review_score": "1"
        },
        {
            "review_text": "‌",
            "review_score": "1"
        },
        {
            "review_text": "Good Game righ guys",
            "review_score": "1"
        },
        {
            "review_text": "Counter-Strike: Condition Zero is the largely forgotten version counter-strike that has an incredibly welcoming and strong community that doesn't judge you based on every move you make.",
            "review_score": "1"
        },
        {
            "review_text": "  Nice game, gg.",
            "review_score": "1"
        },
        {
            "review_text": "This time its more that a game with just guns. If a game is made by the source engine OFCOURSE ITS A GOOD GAME JUST BUY IT! ",
            "review_score": "1"
        },
        {
            "review_text": "GREAT GAME EVEN IF IT IS OLD NOW",
            "review_score": "1"
        },
        {
            "review_text": "Yet another amazing counter strike game. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Replace condition with zero and zero with ten.  0/10",
            "review_score": "-1"
        },
        {
            "review_text": "Awesome Game. This game made me a gamer .",
            "review_score": "1"
        },
        {
            "review_text": "This game was orginaly supposed to be a little remake of cs 1.6 to make it better. In my opinion its not great but its not terribad.  7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "good if u want a campaign for Counter strike.",
            "review_score": "1"
        },
        {
            "review_text": "all the players skin appear same and not differt in multiplayer mode? please help!!",
            "review_score": "1"
        },
        {
            "review_text": "amazing game. so fun. classic. buy it.",
            "review_score": "1"
        },
        {
            "review_text": "Totally Old School Classic Game that will never be boring and keep me and my friends awake throughout the night!!",
            "review_score": "1"
        },
        {
            "review_text": "Love this game forever!",
            "review_score": "1"
        },
        {
            "review_text": "love playing this games keeps me going for hours",
            "review_score": "1"
        },
        {
            "review_text": "Its pretty fun",
            "review_score": "1"
        },
        {
            "review_text": "its Fun To Play The Missions Thay Sould add that to CS:GO",
            "review_score": "1"
        },
        {
            "review_text": "its a nice game",
            "review_score": "1"
        },
        {
            "review_text": "Great game, fantastic gameplay. It is 2014 and I still enjoy playing it. The online game is not dead and there are great players too. I love it.",
            "review_score": "1"
        },
        {
            "review_text": "Toaster Strudel is a toaster pastry brand which was originally notable for being stored frozen, due to innovations in 1980's food manufacturing processes. The pastries are convenience food, prepared simply and quickly by heating them in a toaster and then spreading the included icing packet on top of the pastry.  ",
            "review_score": "1"
        },
        {
            "review_text": "mission awsome",
            "review_score": "1"
        },
        {
            "review_text": "Got the game when it came out at 2004 and it great!",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. I play Counter Strike since its first version of the game and I can tell, it's the far most fun game i've ever played. Worth every penny.",
            "review_score": "1"
        },
        {
            "review_text": "Sweaty as Sweat",
            "review_score": "1"
        },
        {
            "review_text": "it looks like the source engine not goldsrc source when this came out it step to what we have now i really think people should buy it",
            "review_score": "1"
        },
        {
            "review_text": "Made by Turtle Rock Studios, Counter-Strike: Condition Zero feels more like an expansion pack off Counter-Strike 1.6 The hitboxes, graphics, and guns are upgraded. I can tell a significance difference between the mechanics of both. Grenade throwing is different, shooting does not feel 'heavy or flimsy'-- it feels sharper. The community and servers of CS:CZ is not as active as it used to be (Used to be a cs_assault junkie). I'm not sure what happened, maybe they moved onto Counter-Strike: Source. If the community was still heavy I would give this a 4/5    3/5 as of now.",
            "review_score": "1"
        },
        {
            "review_text": "...",
            "review_score": "1"
        },
        {
            "review_text": "HELL OF A CONDITION YOU GOT THERE!",
            "review_score": "1"
        },
        {
            "review_text": "...",
            "review_score": "1"
        },
        {
            "review_text": "This game is very good and pretty bad ♥♥♥ when playing with friends. lots of different mods",
            "review_score": "1"
        },
        {
            "review_text": "not as good as 1.6",
            "review_score": "1"
        },
        {
            "review_text": "...",
            "review_score": "1"
        },
        {
            "review_text": "The most under-rated Counter-strike game,its the best counter-stike game with gameplay from counter-strike 1.6 and improved graphics, I don't know why people hate this game,atleast this game is better the Counter-Strike Source",
            "review_score": "1"
        },
        {
            "review_text": "A classic. Has the single player experience that isnt in GO.",
            "review_score": "1"
        },
        {
            "review_text": "Kinda reminds me of Call of Duty ... only complaint is that is about the graphics - the effects are mediocre ( I understand it's made on a '98 engine but it needed some tweaks) , the animations are simple and physics are screwed up ..  Despite that , it's a nice game",
            "review_score": "1"
        },
        {
            "review_text": "An odd guilty pleasure of mine. Somehow it's haggered engine, the counterstrike guns, and it's desperate attempts at being a 'modern' fpser from the mid 00s all comes together in this sort of charming way,",
            "review_score": "1"
        },
        {
            "review_text": "i Recommend u to buy this game and play it !!",
            "review_score": "1"
        },
        {
            "review_text": "Counter-Strike: Condition Zero is a FPS that i spended hours on i boughted all the CS Games back in Christmas 2012 and This is a must have you don't need to play on multiplayer to have fun",
            "review_score": "1"
        },
        {
            "review_text": "This is a unique twist on the Counter-Strike formula. Instead of focusing on multiplayer, this game is based on single player gameplay. You must fight in multiple locations, hire other Counter Terrorists with reputation, and complete missions in the middle of the game. Think of operation missions in Counter-Strike Global Offensive, but ones that can be completed in one match. I for one enjoy this different style of gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "one of oldest best game (y) which people still play like crazy :3",
            "review_score": "1"
        },
        {
            "review_text": "nice game relative good graphics",
            "review_score": "1"
        },
        {
            "review_text": "Even if you are a huge counter strike fan I do not reccommend it. It would have been good if it were to relise back in 2000, But not half life good just graphically and phyisicaly it would be like a next gen preview. However, It did not. everything is soo scripted cod feels like an openworld compared to this. Menu's are bugged and/or bad designed, I have around 6 hours on this and I still don't know how to unlock new missions. Not that I wanna play more but hoping they are better. If you are in for the single player, don't buy it. Buy CSS or CS 1.6 or CSGO instead.",
            "review_score": "-1"
        },
        {
            "review_text": "it's alright.",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "this is hack xD",
            "review_score": "-1"
        },
        {
            "review_text": "this game is awesome....but the left hand problem have make it really disappoint....but i still have fun ....pls fix the left hand problem.....thumbs up for you guys",
            "review_score": "1"
        },
        {
            "review_text": "I got this with the valve complete pack.Thought it was kinda cool but got bored after a few hours.Then i was like'Hey,why dont i see what the deleted scenes are like,and what i got i did not expect,i was expecting condition zero with more maps and like a few 'experimental weapons'.What i got was a counter strike with a campaighn.It felt weird playing as it was counter strike but it 'wasnt counterstrike 'if you know what i mean.The deleted scenes are awesome absolutely love them.Definently recomend.",
            "review_score": "1"
        },
        {
            "review_text": "Great community for a small game.",
            "review_score": "1"
        },
        {
            "review_text": "this is 1.6 improved. Great game. :3",
            "review_score": "1"
        },
        {
            "review_text": "Recommending Counter-Strike: Condition Zero",
            "review_score": "1"
        },
        {
            "review_text": "A pretty well balanced and easy game to play. Lots of servers to choose from even after all these years.",
            "review_score": "1"
        },
        {
            "review_text": "Nice to play when you are offline",
            "review_score": "1"
        },
        {
            "review_text": "beat it.",
            "review_score": "1"
        },
        {
            "review_text": "Hey I am loving to be CS gamer since from 2004.........",
            "review_score": "1"
        },
        {
            "review_text": "nostalgic thats it",
            "review_score": "1"
        },
        {
            "review_text": "when i got this game for 10.00 dollars i thought it would be good. But nope, when i run it all it does is go to a black screen and plays crappy music. I don not reccomend this game ",
            "review_score": "-1"
        },
        {
            "review_text": "nice singleplayer",
            "review_score": "1"
        },
        {
            "review_text": "this game is great",
            "review_score": "1"
        },
        {
            "review_text": "It's actually pretty fun.",
            "review_score": "1"
        },
        {
            "review_text": "The hitboxes suck and the gameplay swallows. Somehow it's addicting as f***, though.",
            "review_score": "-1"
        },
        {
            "review_text": "Bought the game on sale and replayed all the missions to relieve the nostalgia I had when I was young &lt;3  10/10 worth it",
            "review_score": "1"
        },
        {
            "review_text": "I didn't play the main game, but rather the deleted scenes.. and they seem sooooo long. Pretty fun actually. Famas is a joke though. 'Burst fire' basicly uses 3 bullets up but shoots one special magnum round rather than burst.",
            "review_score": "1"
        },
        {
            "review_text": "The furien mod is kickass",
            "review_score": "1"
        },
        {
            "review_text": "++",
            "review_score": "1"
        },
        {
            "review_text": "This game is better than cs 1.6 , same graphic but 'nice in shadows.",
            "review_score": "1"
        },
        {
            "review_text": "I'd highly recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "The singleplayer campaign makes me feel more like The Punisher or Terminator than anything else. It's good fun, but it doesn't make sense that you're sent in alone against armies of well equipped terrorists.",
            "review_score": "1"
        },
        {
            "review_text": "Classic multiplayer, gone singleplayer.",
            "review_score": "1"
        },
        {
            "review_text": "Not only is it a classic, but the gameplay is great. For this and 1.6 for 10 bucks is a great deal, I thoroughly enjoyed playing this especially offline",
            "review_score": "1"
        },
        {
            "review_text": "pretty fun. i mean it's the same thing but with less players.",
            "review_score": "1"
        },
        {
            "review_text": "Best Of The Best (Y)",
            "review_score": "1"
        },
        {
            "review_text": "This is the best FPS out there anyone can have.",
            "review_score": "1"
        },
        {
            "review_text": "A Classic. Great fun.",
            "review_score": "1"
        },
        {
            "review_text": "The only thing that hurt this game is it felt more like 1.7 than an actual new game.",
            "review_score": "1"
        },
        {
            "review_text": "best single player counter strike game love it",
            "review_score": "1"
        },
        {
            "review_text": "Read game, I really like the graphics, it-self better then 1.6, if the game would he more popular in the multi-player version it would be awesome.",
            "review_score": "1"
        },
        {
            "review_text": "IT IS OK GAME",
            "review_score": "1"
        },
        {
            "review_text": "MY childhood, wish they have a new condition zero coming out so I could throw my money in",
            "review_score": "1"
        },
        {
            "review_text": "  Play in expert mode..  It's no jokes lol..",
            "review_score": "1"
        },
        {
            "review_text": "old but the best!!",
            "review_score": "1"
        },
        {
            "review_text": "Really Nice game. I rate it 10/10. :)",
            "review_score": "1"
        },
        {
            "review_text": "I really like it",
            "review_score": "1"
        },
        {
            "review_text": "It's good.",
            "review_score": "1"
        },
        {
            "review_text": "its a good game :) u should try it",
            "review_score": "1"
        },
        {
            "review_text": "The main issue people found with Condition Zero was that it looked a lot like 1.6; although that claim is true this having mild graphical enhancements and plenty of bug fixes, it's still a great game. The multiplayer is like 1.6 but the true fun is to be had in deleted scenes - which if you don't know is essentially a counter strike 1.6 campaign mode and although not revolutinary now-a-days it's still a whole lot of fun. If you push aside the graphics there is a lot of fun to be had on this game and for all the hate it got it's still good old counter strike. So if you have some time spare or your getting sick of Global Offensive give this a try ( I recommend going on hard mode for the most enjoyment).  TL;DR This is an underated gem - completely worth your time.",
            "review_score": "1"
        },
        {
            "review_text": "when i was a kid, i played pirated version of this game, and play in internet cafe with my friends, and now that i bought this game, i felt so much nostalgia, simply this nostalgic feeling make me bought this game",
            "review_score": "1"
        },
        {
            "review_text": "Is this a campaign mode for counter strike? yeah i think campaigns are like a prequel to the multiplayer i like campaigns so buy IT IS worth it.",
            "review_score": "1"
        },
        {
            "review_text": "O shiiiit  I used to play this game when I was 12 XDD",
            "review_score": "1"
        },
        {
            "review_text": "O shiiiit  I used to play this game when I was 12 XDD",
            "review_score": "1"
        },
        {
            "review_text": "Haven't touched multiplayer yet, but singleplayer has been pretty fun. It's basically bot matches where you assemble a team of bots with various skills. Using radio commands, you rally your team and complete objectives which include typical defuse situations or hostage situations.  It's fun to kick back and play some singleplayer CS, but it is a bit clunky due to it coming out before CS:S.  If you have only played CS:GO or CSS the mechanics might be a little weird to get used to, but if you've played the first Half Life game or the original Counter-Strike you'll feel right at home.  Not necessarily worth a standalone purchase due to it being $10 when not on sale, but it is fun to check out if you get it in the Counter-Strike bundle or the Valve Complete Pack.  CS: Condition Zero Deleted Scenes is a campaign storyline that plays like a tradional campaign rather than regular bot matches. It is definitely worth a playthrough as well if you like the idea of Counter-Strike mechancis in a singleplayer game.",
            "review_score": "1"
        },
        {
            "review_text": "Still great game! even it's old game from 2000 to 2016!",
            "review_score": "1"
        },
        {
            "review_text": "Really fun game, time passes like nothing :)) Pros to the developers for making a really good AI and somewhat good teammates",
            "review_score": "1"
        },
        {
            "review_text": "nice videogame (only doing this ♥♥♥♥ for the bagdage :p)",
            "review_score": "1"
        },
        {
            "review_text": "Old but good :D",
            "review_score": "1"
        },
        {
            "review_text": "I don't know I never played this game but I guess it's a nice game",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game for shooter game lovers... u wll surely get addicted.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good game but...... Very hard to get kills unless you play gun game or something like that but love the game i recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good game but...... Very hard to get kills unless you play gun game or something like that but love the game i recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "THATS MY GAME :)",
            "review_score": "1"
        }
    ]
}