{
    "app_id": 80000,
    "name": "APOX",
    "release_date": "2011-01-20",
    "developer": [
        "BlueGiant Interactive"
    ],
    "publisher": [
        "BlueGiant Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Steam Achievements",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Action",
        "Indie"
    ],
    "achievements": 47,
    "positive_ratings": 46,
    "negative_ratings": 113,
    "price": 11.99,
    "description": "A Real-Time Strategy game with First-Person Shooter tactics.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/80000/header.jpg?t=1447353810",
    "minimum_requirements": "OS: Windows XP/Vista/7 Processor: 2GHz Processor or higher Memory: 1GB or more Graphics: DX9c compatible GPU, Pixel Shader 2.0 or higher DirectX®: DX9c Hard Drive: 2GB",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Absolute crap, you have to buy the damned campaign, the graphics suck, tutorial is vague and unhelpful and part of the campaign you have to buy, controls are clunky, do not buy.",
            "review_score": "-1"
        },
        {
            "review_text": "Uhm.... It seems like it might have potential, but you have to connect to a server to play single-player. Heck, you have to connect to a server to even play the tutorial. And the devs don't seem to understand why this makes people upset. - Edit - they've updated this, so you no longer need to be online. But it's still not living up to it's potential.",
            "review_score": "-1"
        },
        {
            "review_text": "It's gross, stay away.",
            "review_score": "-1"
        },
        {
            "review_text": "APOX isn't given as much credit as it ought to have. Despite its somewhat dated graphics, it's quite a fun RTS with several unique components. Games are quick and usually full of action. I'm not an RTS kind of guy, and I'm typically really bad at them, but this was one I could get into for a little while.",
            "review_score": "1"
        },
        {
            "review_text": "Very plain, not fun.",
            "review_score": "-1"
        },
        {
            "review_text": "A great and interesting concept utterly wasted by its poor execution. This could have been so good. Too bad it isn't,",
            "review_score": "-1"
        },
        {
            "review_text": "it os a fallout / stalker civilztion game",
            "review_score": "1"
        },
        {
            "review_text": "worst RTS ive ever played by far.... dont waste a cent on this game....",
            "review_score": "-1"
        },
        {
            "review_text": "THEY GAVE ME THIS GAME FOR FREE AFTER TRYING IT IN BETA. WHY.",
            "review_score": "-1"
        },
        {
            "review_text": "DON'T BUY THIS GAME. The consept is awesome but the coding is terrible. Memory leaks, doesn't work with steam, the list goes on. This game is NOT worth your money",
            "review_score": "-1"
        }
    ]
}