{
    "app_id": 80200,
    "name": "Fate of the World",
    "release_date": "2011-02-28",
    "developer": [
        "Red Redemption"
    ],
    "publisher": [
        "Red Redemption"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Cloud"
    ],
    "genres": [
        "Casual",
        "Indie",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Simulation",
        "Turn-Based"
    ],
    "achievements": 32,
    "positive_ratings": 267,
    "negative_ratings": 80,
    "price": 6.99,
    "description": "Fate of the World is a dramatic global strategy game that puts all our futures in your hands. The game features a dramatic set of scenarios based on the latest science covering the next two centuries. You must manage a balancing act of protecting the Earth’s resources and climate versus the needs of an ever-growing world population, who...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/80200/header.jpg?t=1447353692",
    "minimum_requirements": "OS: Windows XP, Vista, 7 Processor: 2.33Ghz processor supporting SSE2 (Pentium 4 and Athlon 64) or better Memory: 2GB Hard Disk Space: 1GB Video Card: 512MB graphics card Sound: Integrated sound Direct®: 9",
    "recommended_requirements": "OS: Windows Vista, 7 Processor: 2.33Ghz processor supporting SSE2 (Pentium 4 and Athlon 64) or better Memory:3GB Hard Disk Space: 1GB Video Card: 512MB graphics card Sound: Integrated sound Direct®: 9",
    "reviews": [
        {
            "review_text": "Fate of the World is an interesting simulation of how to deal with global warming, to say the least.   You are given the role as an underfunded leader of a global organisation set up to handle climate change and global warming. To do so, you are given a whole lot of options and a large chain of potential tasks you can tell your lackeys to do.  The first problem then is obvious, you have no idea what these tasks(Displayed as cards) do until you try them, and often only a vague idea of how they'll effect the various things they're supposed to effect. This will be frustrating, and may lead to you just restarting several times just to see what your policies are actually doing, and what they're effecting. Trial and error gameplay will be the first thing you notice, but that is only after you have spend a turn building offices all over, which you need before you can even see what policies and programs you can enact. There is no real tech tree equivalent you can find that shows you what exactly you can do after building one of such offices, or what leads to what other things. A real shame is that the game is excellent at hiding your options from you, and that it also hides the data behind a small tab in the top right. You can see practically everything you need to know about an area, but how your politices will effect it, or how these things interact with eachother is left completely behind the scenes. Only a few things you can do actually tell you the full extend of what they're going to be doing with the limited money you're spending on them.  In short, frustration. However, once you get over that and learn roughly what policies go where, you will find the game opens up to you, and lets you actually play it. And it is a much bigger game than it seems to be at first. Sure, it deals with global warming, and your goal is technically to stop it, but to focus purely on that is not going to help you. It's your end goal, while your organisation does not only have the authority, but also the responsibility to prevent wars, establish healthcare and education systems, manage economic growth, and fund technology. And all of these things are not told to you, and neither is it explained to you how to do them, you have essentially become the New World Order and everyone more experienced than you has died or quit. Indeed, one can ask what actual governments do in this game, and I so far haven't seen them bother with anything yet.  When they said it was all up to you to stop climate change, they meant EVERYTHING. Make the middle east a stable place, prevent the global economy from crashing, fund space missions, create anti-flooding and drought systems, establish healthcare all over the globe, stop deforestation, ease the use of fossile fuel, and many, many more things. And to do this, you get barely a cent. And even if you do know what you're doing, even a little, you will have trouble. There is very little margin for error, as a few mistakes will send Africa into a continent-wide civil war(As opposed to how it is right now with only parts of it being at war all the time), and you might start nuclear conflicts in Latin America if you don't personally check up on them every turn to make sure they aren't getting ready to use your nuclear power plants for weaponry. Fate of the World is difficult in part because there are a lot of factors involved, and you are told about none of them until ♥♥♥♥ has already hit the fan.  Make no mistake, it is a difficult game, but it is a great simulator. It simulates production of fossil fuels, transport, energy generation, industry, agriculture, economy, disasters and so much more. But it just doesn't tell you about any of this. Aside from that, the moral lessons it tries to teach are questionable at best. As the only way so far that I have found to get close to succeeding every time I try is to start a genocide program targetting China, India, the Middle East, and if they keep complaining South Asia too.  Fate of the World teaches you(Or at least, me) that the only way foreward is to kill the asians(Except Japan), and to wipe the Middle East from the map. Africa is to be policed at all times and forcibly kept poor(but educating them) until technology exists to create emissions free power and industry for them. The Americas and Europe are to be converted to renewable power, with media campaigns focussing on distracting them from the rest of the world. Japan and Oceania are pretty much empty as far as global population is concerned, so just give them a few defences against floods and occasionally some other protection if they need it.(To switch over ALL of Oceania's transports to electric instead of oil based costs the same as all of Europe or North America's for some reason)  Fate of the World is an interesting game that I would recommend for people who enjoy detailed simulators, and don't mind having to figure out everything themselves. But I would certainly not give it to kids. Worth 10 bucks? I'd say so, if you are one of those people into simulators, or if you've seen someone play it and think you can do better",
            "review_score": "1"
        },
        {
            "review_text": "If you draw a line between Democracy and Civilization, Fate of the World stand inbetween, in the fringe of serious gaming.  The game has been funded by humanitarian organisations and created with the help of universities. The result is a robust and deep political / social / economic / scientific / environmental underlying engine. And here is the true quality of this game : the engine is accessible, but most of the time hidden.  As a player, you receive updates of the actual situation in multiple regions of the world in shape of news or governemental reports. From that point you can hire agents and select several missions displayed as cards (nice design idea) for a time set between 5 years and permanent.  The game is not easy, the task at hand is hard. Improving the life and well-being of populations won't prevent insurrections or shield you from climate change - at least in the early years.  The interesting benefit of Fate of the World is to give you perspective on critical issues, and experience the tough job of trying to be a fireman in several places at the same time.",
            "review_score": "1"
        },
        {
            "review_text": "I thought this game would be educational, but all I've 'learned' is that nuclear power doesn't work and India is a hellhole.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most eye oppening experinces I have ever had with a game. This is something everyone should play.",
            "review_score": "1"
        },
        {
            "review_text": "Very Challenging. Very Interesting. Good replayability. A little dated...Easy to hack but exposes limits of simulation. Would love to see new version for android and ios. If you enjoy meta-strategy games like Democracy, Geo-Political Simulator, or Europa Universalis, then you'll enjoy this game.",
            "review_score": "1"
        },
        {
            "review_text": "Fate of the world is a unique card game. There aren’t many games where you can pacify the masses with vapid pop princesses while you prepare a plague to kill them off (for the environment, of course).   At first glance you could dismiss Fate of the World as tree hugger propaganda, but this game is probably too cynical for people who think they can make the world a better place. For example, species go extinct all the time, Africa needs to be pacified by armed might before you can think about saving Rhinos, and nations will expel your global environmentalist super organization if your goals don’t mesh with their national interests.  Personally, I like it. If you are a budding Machiavellian looking for a challenge then consider picking it whenever it’s on sale for $5.  ",
            "review_score": "1"
        },
        {
            "review_text": "Fate of the World is an educational strategy game that places you in charge of many global policies to try to save the world from ecologocial disaster. It's pretty fun to play, and certainly far better than you'd expect from edu-tainment. You basically have to balance the political, economical, and social problems of individual nations with the fight against long-term solutions to global climate change.  This game is hard. Very hard. The first mission's no problem, but I'm still trying to figure out the second one after three failures. The main problem is that you aren't given enough information to tell what affects what, or how you're supposed to react to certain problems. One false move in 2030 will leave India devastated in 2070, and you don't know what it was most of the time.  It's worth giving this game a try if you can pick it up cheap. It's fun to play around with and see what you can do, but don't expect to finish this one without a lot of out-of-game research.",
            "review_score": "1"
        },
        {
            "review_text": "Have you ever thought you could solve the climate change issue? You may want to give this game a try.",
            "review_score": "1"
        },
        {
            "review_text": "BUY THIS GAME. It's complex as hell, but there's nothing else like it.",
            "review_score": "1"
        },
        {
            "review_text": "If you like a challenge, this is one. If this is accurate, we're all doomed. I am completely convinced this game is practically impossilbe to win. No stategy I've attempted has made the slightest bit of difference in the outcome of the game. Easy mode is just as hard as normal so don't bother with it.",
            "review_score": "1"
        },
        {
            "review_text": "It's like a hippie version of Civ and that's not a bad thing. It's actually TONS of fun. Sometimes you'll just give up on a region for bieng such a jerk. Kinda scary when you think about these being actual political and world events that real people have to deal with on a regular basis and dealing with them in a computer game is both fun, challenging and eye opening. Also, unlike Civ, games don't take two-three days. More like two-three hours.",
            "review_score": "1"
        },
        {
            "review_text": "It's like a hippie version of Civ and that's not a bad thing. It's actually TONS of fun. Sometimes you'll just give up on a region for bieng such a jerk. Kinda scary when you think about these being actual political and world events that real people have to deal with on a regular basis and dealing with them in a computer game is both fun, challenging and eye opening. Also, unlike Civ, games don't take two-three days. More like two-three hours.",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant concept and an amazing viewpoint. Play as the New World Order for the next 200 years, saving or destroying the planet.",
            "review_score": "1"
        },
        {
            "review_text": "Both frustrating and frightening in it's realistic portrayal of global politics and climate change. In a good way.",
            "review_score": "1"
        },
        {
            "review_text": "Can't stop",
            "review_score": "1"
        },
        {
            "review_text": "A fun strategy game with a lot of depth, although it can be hard at times to figure out what you need to do.",
            "review_score": "1"
        },
        {
            "review_text": "I hate this game... I love this game... I think I have a problem...       Please help me...",
            "review_score": "1"
        },
        {
            "review_text": "What more can you ask from a sim game than the ability to wipe out every rare species of animal in the world while destroying the environment and turning the planet into a lifeless husk?  Of course the point of the game is to not do that but lets be honest about which is the more fun and amusing way to play it.",
            "review_score": "1"
        },
        {
            "review_text": "Seemingly simple, yet amazingly deep, extremely hard, and most of all totally depressing. Will you let those 40 million people die of famine just so you can buid those ecological solar power plants? Will you convert the world to sustainable lifestyle, losing all your money, support, and chances to win in the process? Make the good, intelligent, fair choice, and get assassinated as a reward. This game is all about these choices, a lose-lose situation where you try and save the earth by choosing which part of it to forsake. If you don't care about action, this slow, methodical, stat-based strategy game is guaranteed to give you a challenge, some headaches, and most of all some realistic and chilling political thoughts.",
            "review_score": "1"
        },
        {
            "review_text": "Very well thought game, in which you decide the fate of human kind. Also a great educational tool in the campaign against global warming! :)  Highly recommended!",
            "review_score": "1"
        },
        {
            "review_text": "This game keeps pulling me back again and again. I have played it for a fair while, and I am still figuring it all out.",
            "review_score": "1"
        },
        {
            "review_text": "If you are trying to make the world a better place and want to get into changing the world for the better, than this is the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "I forgot this game existed..... And now i remember how hard it is, someone shoot me.",
            "review_score": "1"
        },
        {
            "review_text": "So in this game you try to save the world from Climate Change via a variety of methods with questionable effectiveness. To be honest, this game is rather difficult and not easy to pick up because alot of the terminology and proposed schemes for fixing Climate Change will likely be unknown to alot of people. There is some in-game information, but that still won't prevent this game from often being frustrating. Also it has bugs, with some of the achievements simply being broken with almost no chance of them ever being fixed since the devs for this game are long gone.  It's an informative little game that is often frustrating due to its difficulty and lack of adequate information. Another case where a simple 'yes' or 'no' just is not enough to describe my overall views on this game. Ultimately... I'm going to have to say no. It's interesting and a rare game dealing with real-world issues, but it's problems are just too annoying for me to recommend. :(",
            "review_score": "-1"
        },
        {
            "review_text": "This game assumes you have a degree in economics and doesn't explain how to play it very well. Messages like 'oh no, your inaction caused a global financial collapse' don't really help to hint what was being done wrong, but the hundreds of charts available that I have no idea how to interpret sure make me feel dumb!",
            "review_score": "-1"
        },
        {
            "review_text": "Was hoping for something more than a glorified trading card game. Disappointment ensued. Although the concept was interesting for a small amount of time.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is horrible. Please, don't waste your money.",
            "review_score": "-1"
        },
        {
            "review_text": "Wow...This game. Pure propaganda. Only reason I have it is because it came with the Indie Royale pack, which included some other very good games. Do not buy on its own merit.",
            "review_score": "-1"
        },
        {
            "review_text": "Boring. Couldn't get into this at all. Pass.",
            "review_score": "-1"
        }
    ]
}