{
    "app_id": 80350,
    "name": "Blackwell Convergence",
    "release_date": "2012-01-13",
    "developer": [
        "Wadjet Eye Games"
    ],
    "publisher": [
        "Wadjet Eye Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Point & Click",
        "Adventure",
        "Indie"
    ],
    "achievements": 12,
    "positive_ratings": 298,
    "negative_ratings": 14,
    "price": 3.99,
    "description": "The third game in the Blackwell series",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/80350/header.jpg?t=1483440497",
    "minimum_requirements": "OS:Windows ME or higher Processor:Pentium or higher Memory:64 MB RAM Graphics:640x400, 32-bit colour: 700 Mhz system minimum DirectX®:5.0 Hard Drive:64 MB HD space Sound:All DirectX-compatible sound cards",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Wow. This series just keeps getting better. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Rosangela Blackwell is a struggling author living in New York, and a medium. Enter Joey Mallone, a ghost and spirit guide tied to the female members of the Blackwell family. When Rosa's aunt, Lauren Blackwell, passes after being in a coma for decades, Joey is 'released' from Lauren and enters Rosa's life. Details are revealed throughout the five installments of the Blackwell series regarding the female members of the Blackwell family, how Joey came to be, what happened to Aunt Lauren to trap her in a comatose state, etc. Together, Rosa and Joey seek out and help tormented ghosts trapped in the physical world cross over to 'the other side' throughout the series.   In BLACKWELL CONVERGENCE, this installment takes place about six months after the events in Legacy. Rosa's neighbor, Nishanthi Sharma, convinces Rosa to visit an art gallery viewing. There, Rosa and Joey meet a film company director who later reveals that an actor in a recent film died. Murdered is a more accurate statement, they come to find. While working on the mystery, they stumble upon an old murder case whereby the victim's research work was stolen to benefit a rival company. Finally, on the art gallery's opening night, a familiar 'person' makes an appearance and murders the artist. In all three cases, Rosa and Joey learn that the same venture capitalist foundation funded the three separate companies. Rosa and Joey have their work cut out for them to solve the mysteries, help set the tormented ghosts free, and live to tell about it ... well, Rosa, anyway. Note: CONVERGENCE features two real people included in the cast of characters: writer Joseph Mitchell returns, as well as New York eccentric Joe Gould.   To enjoy the story at it's best, the games should be played in order of creation. 1st 'LEGACY' -- 2nd 'UNBOUND' which explores the events and time that Lauren Blackwell and Joey were working together in the 1970s (while Unbound turned out, unintentionally, to be a prequel to Legacy, it should be played after Legacy to not only help enlighten the player as to what happened in the first installment, but also gives the player clues as to what is coming in future installments) -- 3rd 'CONVERGENCE' which takes place about six months after the events in Legacy -- 4th 'DECEPTION' which takes place some time after Convergence -- and 5th 'EPIPHANY', which is the final installment in the Blackwell game series.",
            "review_score": "1"
        },
        {
            "review_text": "I enjoy this game almost as much as I enjoyed 'The Blackwell Legacy' aka the first game. The story was good as usual, but the option of not moving so much around was kinda boring, and not be able to visit the dog, as we cound in the first game.   I liked that you could go on the computer and brows, and use the telephone, but the hints from the company people were kinda hard to understand. Some other things was also a little bit hard to understand, and sometimes it was idiotic much back and forwards between people. I know you are playing a 'detective', and you need to ask much around, but sometimes its kinda stupid (at least in this game).   Otherwise, i liked it! :)",
            "review_score": "1"
        },
        {
            "review_text": "Blackwell Convergence is the third instalment in the Blackwell series. Also this is the first title where you may feel that it had an actual budget, though the improvements are seen mainly in the quality of the background graphics. Following the footsteps of Unbound, but yet again with the first game’s protagonist, we partake in yet another set of ghost stories where the goal is to learn the spirits’ woes and how to convince them to find peace with their deaths and move on to the afterlife. Gameplay-wise Convergence is starting to veer back to the classic adventure genre, losing the clue-based puzzles and using item interaction instead. I have to admit, in my opinion it hurts the game’s atmosphere and story, even though the creator was getting better and better in writing character stories for the ghost. This part was always the biggest selling point of the Blackwell series – the ghost and the life stories behind them, which were always more complex than anyone would think from a short indie game – and thankfully the game does not disappoint in this regard. Also by this time the overall plot of the series is really starting to take form, which is really nice to make you feel you are playing a multi-part epic, but sadly hurts the individual cases somewhat as they all need to be tied into something instead of being completely separate from each other. Overall the game wasn’t as a big step up from the previous title as Unbound, but it is still exciting enough to keep people interested in Blackwell.",
            "review_score": "1"
        },
        {
            "review_text": "Yet another stellar episode in the Blackwell series. Every bit as good as the others. You'll want to play Legacy and Unbound first, FYI.",
            "review_score": "1"
        },
        {
            "review_text": "Nice Story. Rather easy to solve.  C64 graphics....",
            "review_score": "1"
        },
        {
            "review_text": "If you're up to point &amp; click games, it's good to start with the blackwell series. good game!",
            "review_score": "1"
        },
        {
            "review_text": "Loved the first, loved the second, loved the third.",
            "review_score": "1"
        },
        {
            "review_text": "The third blackwell game by Wadjet eye games, and so far my favourite. In my opinion this one is easy the best written, most interesting and best looking game of the Blackwell Series to date (With Epiphany jsut being announced) More then ever you jsut feel the love of Dave Gilbert for his Home-Town of new york.  You really should play Convergience and Unbound together though, I would reccomend starting with cnvergience and Saving at a point where Joey seems to remember a certain thing from the past and then play unbound, before finishing convergience.  This is due to the fact that unbound is based of Cut Flashbacks from thsi game, that were developed into a Standalone game.",
            "review_score": "1"
        },
        {
            "review_text": "For round three in the Blackwell series, The Blackwell Convergence jumps back to present-day (or close enough) and the first game's heroine, Rosangela Blackwell. Over the course of the game, she encounters several of the spirits her Aunt Lauren dealt with before getting out of the medium game, as well as some other issues haunting her family's past.  As with the first two games, The Blackwell Convergence shifts a bit in art style. However, this remains just as satisfying visually as the prior two iterations; Wadjet Eye really knows how to pick 'em. As a midpoint for the Blackwell games, most of the plot feels like tying up loose ends more than casting out or dealing with many new ones, though there are a few new ghosts and their stories to be told.  Also in line with the prior Blackwell games, Convergence is a solid experience through and through. The puzzles are stimulating, with only a couple that might throw you for a bit, and in most cases those get hung up on order of operations. Other than that, not much to say that I haven't been saying since the first one, except keep playing 'til you're done them all.",
            "review_score": "1"
        },
        {
            "review_text": "The third installment of the Blackwell series and better than ever!  The length of this game is a bit longer than Unbound, so there's more content to enjoy without being overwhelmed.  I really enjoy Rosa's character development; she's come out of her shell some and she's bolder, braver and sassier. And I still enjoy her exchanges with Joey; I can tell they've grown closer since he's now comfortable with taking more personal jabs at Rosa. Even better, the ability to control Joey carries over into this episode.  And, thankfully, this episode allows you to make more than just one save file and you can overwrite them! It's nice to be able to replay the game over and over and still have the one file that holds the unlocked bonus features.  I do have a couple of complaints but they're rather minor...  For one thing, this is the third episode of the series and not very much has been revealed about Joey. I don't know how he died, why he became a spirit guide or if he's even related to the Blackwells. So, I hope something in the fourth (or upcoming fifth) entry will reveal something about his past.  I feel that a couple of deaths in this episode are left unresolved but it doesn't ruin the story or the experience.  Once again, the bonus gallery can only be accessed once you've beaten the game and are given the code to unlock it. Only this time, you will have to start a new game and go through the prologue portion before you can get home to enter the code on Rosa's computer - and then save your game if you want infinite access to it. So, this function isn't any better than the last two games.  Overall, I really enjoyed this episode and I'm just about to start playing the fourth!  Also, I hope that in the future there will be a special bundle that will include the series' soundtracks; it's great music and I would like the option of downloading the files and moving them onto my mp3. Maybe one day...",
            "review_score": "1"
        },
        {
            "review_text": "THis is #3 in the series, its a little bit longer that the first two, not by much. The story is progressing nicely, I reccomend playing the first two before trying this one. Its a great game aside from the length issue. If these were 6 hour games they could easily sell all 4 for 49.99 in a bundle like the sam and max series. right now they are at 19.99 for all 4. If #4 ends up the same 2-3 hour length thats 10-12 hours of fun for 19.99 could be worth it if you really like P&amp;C adventure games but id wait for a sale or bundle.",
            "review_score": "1"
        },
        {
            "review_text": "Buy it if you like   POINT AND CLICK ADVENTURES   and*:  - an interesting story - 8-bit adventure games - mostly casual puzzles - spiritualistic themes - likeable characters that you can follow in a series of games  *recommended to answer YES to at least three of the above",
            "review_score": "1"
        },
        {
            "review_text": "This is the last game in the series I've bought (so far), and while I know there are two more after, Blackwell Convergence is the best entry! It puts the previous ones to shame in many aspects, including music, storyline and art -- especially the art. It's so lovely and expressive! The music is great and definitely affects the mood of the scenes. Heck, I spooked myself accidentally when one piece started playing.  Even the puzzles/cases are more interesting, with every character playing some important part however tiny it is. (Everyone remember the first minor character in Blackwell Legacy and his not relevant part?) Granted, some of the solutions are harder to find within this point and click game. At least, for me they were. I had to look up a walkthrough for one, because it was hard to figure out what next step to take. This might deter certain people if they can't solve it in a fairly rapid manner, but I promise you, you'll be satisfied once you solve the puzzles/cases. I know I did, and that increased my enjoyment of this game.   The mechanics have also improved, and the animation as well. It's all very fluid. Kudos to the creators for being able to dish out a bit more money for the sake of the game, because it helped. A LOT! The voice-acting's improved too -- in the first game (and possibly the second one), you could literally hear mics crashing against the actors' breath or against something else. Here, there are no audio mistakes. It all sounds professionally done.  I'd recommend to anyone interested in this series to just start with this game...BUT that's a bad move, because unfortunately this game also depends on many plot points that have been brought up in the previous two games. (Also easter eggs will feel juicier when you find them!) Part of the joy in this game is seeing all previously established details come to fruition in Blackwell Convergence. The story (if you care about this more) depends on having played the first two games, in my opinion. It makes it a stronger, and more fun, game to play.  If you just want to have fun and possibly seek out the first two after, then play this first. But it's much more satisfying to play them all in order. THAT's the best suggestion I can give you.",
            "review_score": "1"
        },
        {
            "review_text": "The series gets better as it goes on. There's not too much to say about it that is different from my previous reviews of the games of the series. Either in this or the following game you finally get reasonable audio controls (its been a few months since I played). If you're already invested in the series then by all means pick it up, it certainly doesn't get worse!  There is one moment where I did get fairly horribly stuck with no idea how to proceed and no easy way to brute force, because of a required text input. I can understand that the view of the designed and that of the player are different merely because of their roles and thus what may be obvious or intuitive to one may not be to the other, but it can still be frustrating when it occurs.",
            "review_score": "1"
        },
        {
            "review_text": "I liked it. Light on gameplay compared to a lot of the adventure genre, but the writing is solid, the setting and atmosphere are great, and the soundtrack is beautiful.   Love this series.",
            "review_score": "1"
        },
        {
            "review_text": "Blackwell Convergence!  The third in the blackwell series and like the past 2 games it seems to be exactly the same in terms of: &gt;Voice acting, &gt;Gameplay &gt;8 bit graphics &gt;Interesting story Which to be fair are all decent.  The duration of this game also appears to be longer than the previous 2.  Overall its a basic point and click game nothing really special, i think they should just add all the games in the series into a bundle.  5/10",
            "review_score": "1"
        },
        {
            "review_text": "The third - middle - entry in the series is probably the weakest, because it doesn't advance the gameplay in meaningful ways. That said, the story itself is quite interesting, since it ties in with real-life New York history and its legendary citizens. The art style feels a bit drab, and the new mechanics almost feel like a step-down from the previous entries in the series, so overall this feels like the low point in the series, but only by a small margin. Nonetheless, it is well worth playing.  Rating: 7/10",
            "review_score": "1"
        }
    ]
}