{
    "app_id": 80360,
    "name": "Blackwell Deception",
    "release_date": "2012-01-13",
    "developer": [
        "Wadjet Eye Games"
    ],
    "publisher": [
        "Wadjet Eye Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Point & Click",
        "Adventure",
        "Indie"
    ],
    "achievements": 18,
    "positive_ratings": 312,
    "negative_ratings": 11,
    "price": 6.99,
    "description": "Street psychics. Their blinking neon signs are everywhere, promising love and wealth and happiness. They make a fortune preying on the gullible and milking them dry. So when these victims begin dying and leaving confused spirits behind, it can only take a genuine psychic (and her wayward spirit guide) to clean up the mess.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/80360/header.jpg?t=1471190469",
    "minimum_requirements": "OS:Windows ME or higher Processor:Pentium or higher Memory:64 MB RAM Graphics:640x400, 32-bit colour: 700 Mhz system minimum DirectX®:5.0 Hard Drive:350 MB HD space Sound:All DirectX-compatible sound cards",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Excellent. I liked Unbound and Convergence more, but this one is still very well written. Can't wait for Epiphany!",
            "review_score": "1"
        },
        {
            "review_text": "All the Blackwell games are great, and this is probably the best one",
            "review_score": "1"
        },
        {
            "review_text": "Blackwell Deception is the 4th game in the Blackwell series and is the longest game out of the series due to the solid and well formed storyline. The graphics have all been updated and improved since the last game, and still the sound and music are top notch as ever. The game does a very good job putting together all the pieces of the story to create a very engaging, emotional and exciting game. I think this game may be the best one out of the whole series so far. Also, thank the heavens that Rosa now has a cell phone with her that she can check e-mails, collect notes and search the internet from any location - instead of the past games where you always had to return home to your desktop computer to do these functions. I suppose it adds a layer of realism as time progresses from when the first games were made till now, and we did not have the luxury of having access to everything at the palm of our hands.",
            "review_score": "1"
        },
        {
            "review_text": "Alot of ghost kissing and fighting.",
            "review_score": "1"
        },
        {
            "review_text": "The fourth and penultimate Blackwell game oozes confidence. The decent voice acting and improved graphics power a compelling story which again reveals some backstory. Each game in the series has provided an intuitive leap in terms of storytelling and puzzles, cleverly layering the characters so that you really feel you know them. As well as a solid story in its own right, this game sets up the fifth and final Blackwell episode (sad, but it's better to wrap up a strong series than give us diminishing returns). Ah, I'm gonna miss these games. Don't forget to check out WadjetEye Games' website.",
            "review_score": "1"
        },
        {
            "review_text": "Fourth in the amazing Blackwell series. If you like Adventure games, you have to play this series. Do yourself a favor and buy them all.",
            "review_score": "1"
        },
        {
            "review_text": "Fourth entry in the series and I still love. Can't think of many AAA series that can say the same. The lenght makes the series ideal for binge-playing.",
            "review_score": "1"
        },
        {
            "review_text": "WadjetEye's finest work yet. Compelling story, intriguing characters and polished gameplay make for the best entry to the Blackwell series. Even though it's the latest entry in the series, it's a great place to start.",
            "review_score": "1"
        },
        {
            "review_text": "I love the Blackwell series. Each story is fairly short so I found it best to play them back to back.",
            "review_score": "1"
        },
        {
            "review_text": "+ game is fun and exciting + voice actor is really great + you can use google in game + you can talk to dead people - puzzles and mistery in this game are easy too be solved - only 4 hours to beat this game entirely with all achievement",
            "review_score": "1"
        },
        {
            "review_text": "Deep and compelling, interesting and challenging, With a retro asthetic, classic SVGA graphics, and a deep love for the whole genre. Shades of mokey island, Grim Fandango, and lighthearted adventure combined with a truely mature story that provides a deep inspection of fate, destiny, death, legacy, and chronic stress fatuge.   if you've EVERY enjoyed an adventure game for the story, then you should play the whole series, without reservation.",
            "review_score": "1"
        },
        {
            "review_text": "Got it during the Christmas giveaway, fired it up yesterday and just finished it. Wow! It is really great. Writing is great, locations are atmpospheric, puzzles are, for the most part, very good and decently diverse, the game mechanics of P&amp;C are tweaked in interesting ways. Even voice-acting is largely good, which I really didn't expect from such a small team.  I am very impressed and will be certainly picking up the rest of the series. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Not a bad game, but not great either. Absolutely not worth 10 dollars. If achievement hunting, prepare for a borefest with the Commentary achievement. You're forced to listen to the voice actors and creators laugh and joke with each other. It's like being stuck in an awkward, boring conversation with no escape, bc you have to hit a button every few minutes to start the next blurb.",
            "review_score": "1"
        },
        {
            "review_text": "Obligatory header to the review: I focus on four primary areas whenever I review a game: gameplay, story, graphics, and sound/audio/general things that go into your earholes. Gameplay and Story get a rating scale from 1 to 10, and the AV stuff gets a rating from 1 to 5. My philosophy on this is that there are some instances in which a game may not necessarily have that much in the way of gameplay (take Amnesia for example), but the story/atmosphere/whatever it may be is reason enough to pick it up. Also, take the cumulative score with a grain of salt; it's just a numerical feeling about the game as a whole. That's part of why I do these subscores. Also, keep in mind that I'm not going off of school grade based rankings. A 5/10 denotes what I feel to be an average game. Likewise, 7/10 is a game that I think is pretty cool, and something that gets a 2/10 is near-abomination level. Pinning scores to an even further obfuscated rating scale is kinda senseless, but for the sake of my backloggery, I'll repeat again that 1.0-2.7 is a one-star game, 3.0-4.7 is a two-star game, 5.0-6.7, 7.0-8.7, and 9.0-10 are three, four, and five stars, respectively.  Additional note: This review will be shorter and will be written in respect to the first and second in the series (Blackwell Legacy and Blackwell Unbound), since this is an episodic sort of series.  Gameplay: This game kinda reverts to the puzzle design that I'm not so much a fan of that I've talked about in past reviews. That's not to say that they didn't make sense, but I do question the viability of some of them (for example, the key puzzle; I'd have a bit of a hard time believing that a key can fit so easily under the door). This time around, there's dialogue puzzles; a puzzle variety I'm not so much a fan of as oftentimes it comes down to running the same conversation loop over and over until you get the right answer. I didn't really feel accomplished/clever after figuring out the puzzles; I just felt like I would be done rubbing items together for a little bit. That may just be me, but I still stand by what I say in that puzzles just aren't fun in point-and-click adventure games. 6/10.  Story: A bit of a disappointment coming from Convergence. I dunno; this story didn't have the same spark of intrigue that Convergence did. The first half of the game is same old, same old, but the second half does manage to catch a few embers. These few embers aren't enough to create a fire, though. 7/10.  Graphics: Yup, another art style change. As I said in the Convergence review, the same artist worked on Deception and Epiphany, so once I get around to that game, I finally won't be able to talk about that aspect. They've gone for a more realistic style this time, which honestly works best for the game in my opinion. Convergence's comic style was nice and all, but a realistic style does seem like it works better. 4/5.  Sound: There weren't really any standout tracks in this one. The soundtrack is still quite good, but it's more of a uniform good. More emphasis was put on ambient sounds this time around. Again, the VAs have good recordings and again they did a good job with it. Even if I did want to punch a few characters in the throat because of their voices and the way they talked. But hey, if they're making me have any emotion, that's a job well done. 4/5.  Overall scores are: 6/7/4/4; cumulative score of 7.0/10. If it weren't for the second half, I'd say that you don't need to play this game at all. However, the ending to the game is a not so subtle lead-in to what's probably gonna go down in the finale. I said in the last review that I probably wouldn't be able to wait the week on average I give myself between these games, but I think I will be able to do that between this and Epiphany.",
            "review_score": "1"
        },
        {
            "review_text": "A strong installment in the series. But what the hell is wrong with those spoilery as ♥♥♥♥ pictures on this site?",
            "review_score": "1"
        },
        {
            "review_text": "Epic game with a wonderful story",
            "review_score": "1"
        },
        {
            "review_text": "Blackwell Deception is the Blackwell series game number four, still being a point-n-click adventure of modern approach. It finally figured best approach to all puzzle mechanics in Blackwell series and the plot started to get onto next, bigger level.  This time around engine supports widescreen, with art being designed around it. It still will freak out when you press Shift+Tab, but pressing Tab key always fixes it anyway.  While having nice pixel-art, it's still a modern take on adventure game, which means no deaths or dead ends. Inventory isn't as heavily used. The puzzles mostly make sense, no complete nonsence that old games are loved for, I guess. So, as said, this part finally figured out how to implent all gameplay features of Blackwell for the best. You got notebook and smart phone. Once again, after taking it out in Converenge, you can use notebook to combine clues, which is mostly used so you could do a better search in Internet on your Smartphone. Yes, unlike Converenge, you don't have to come to same place, that is Rose's home, to search. Yes, you can search and type things there too. Great ideas. Makes it feel more like investigation.  Once again the style of pixel-art changed. This time it feels a little not as good as in Converenge, artist was learning. A bit of comic and realistical styles were mixed, title screen being most noticeable. They say that at first release it had character icons done in complete non-pixelish comic, until it was made pixel-artish again in later update. Anyway, character face icons aren't animated anymore. Still show varied expressions. Characters sprites and movement for some reason make me think of older stuff, like gameboy, especially main hero's walking animation, which looks like she is sliding legs over floor. Just not as polished as in the third game. No more animation for But nope, it's still great, just nitpicking. Yes, it is great. It has a night time setting this time around, mostly.  Soundtrack is half and half. Literally. When it comes to normal or relaxish areas, it reuses Converenge soundtrack of a bit of jazzyness and such. While for a darker and ambient scenes, as well as emotional, it uses it's own kind of music, somewhere jazz, somewhere more of technoish. Not bad, but still not too memoriable. Though some scenes are quite affecting wtih such soundtrack.  As for plot, we still have Rose and Joey, spirit guide, searching and saving ghosts. Though she decided to get more public, so people could call her anyday, it didn't really improve her life or reputation much, just getting in even more troubles. Storyline seems to be bigger and more interesting, getting hinted at Joey's backstory. It also gets darker, more emotional. You even once again get to handle two cases of ghosts in same time, like it was in Unbound. At the end of a game you will even be hinted at what direction the series will take next and what kind of villians you will have to take down... Spolier: Nope, it didn't take that direction, don't expect it.  Once again a game comes with commentary mode. And it got improved for once. Instead of being randomly interrupted, each scene will have a buttons somewhere on the side, each with their own first letter, in which you can tell away which one is a voice acting blooper or a developer commentary. Much better. Though developer still think that everybody cares about voice acting a lot more. But it still got interesting stuff about game design.  So, overall, the finest Blackwell game, which finally set the formula for the best. You should should play previous titles. But next stop after this game is a grand finale.",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoy this seriers. BY now, you really should know what you're getting with these games. However, this game felt a little more refreshed than the last one. Good plot lines and finally a few more hints about Joey's background story lines. I need more. I really want to finish the series. Can't wait to see the finale.",
            "review_score": "1"
        },
        {
            "review_text": "Super intrigued by the glimpses into Joey's backstory, as well as the baddie in this episode. Now I'll HAVE to play the last game in the series.",
            "review_score": "1"
        },
        {
            "review_text": "If you're desperate for a point and click, try this out. I enjoyed it plenty, but I doubt others would enjoy it.",
            "review_score": "-1"
        }
    ]
}