{
    "app_id": 8140,
    "name": "Tomb Raider: Underworld",
    "release_date": "2008-11-21",
    "developer": [
        "Crystal Dynamics"
    ],
    "publisher": [
        "Square Enix"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 16,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action",
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "Action",
        "Female Protagonist"
    ],
    "achievements": 0,
    "positive_ratings": 1779,
    "negative_ratings": 594,
    "price": 6.99,
    "description": "Tomb Raider: Underworld represents a new advancement in exploration-based gameplay. As fearless adventurer Lara Croft explore exotic locations around the world, each designed with an incredible attention to detail resulting in breathtaking high-definition visual fidelity that creates a truly believable world and delivers a new level of...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/8140/header.jpg?t=1556062138",
    "minimum_requirements": "Minimum                     Supported OS: Microsoft Windows XP (admin rights required)/Microsoft Windows Vista (admin rights required)                     Processor: Intel Pentium 4 3+GHz or AMD Athlon 2.5+GHz                      Memory: 1GB (Windows XP) / 2GB (Windows Vista) system memory                      Graphics Card: NVIDIA GeForce 6 series 6800GT (or better) / ATI 1800XT (or better)                     Sound Card: Direct X 9.0c compatible sound card and drivers                     Hard Drive Space: 8 GB Free Space",
    "recommended_requirements": "Recommended                     Supported OS: Microsoft Windows XP (admin rights required)/Microsoft Windows Vista (admin rights required)                     Processor: Intel Core 2 Duo 2.2 GHz or Athlon 64 X2 4400+                     Memory: 2 GB system memory                     Graphics Card: NVIDIA GeForce 9800 GTX or ATI HD4800                     Sound Card: Direct X 9.0c compatible sound card and drivers                     Hard Drive Space: 8 GB Free Space                     Controller: Microsoft Xbox360 Controller",
    "reviews": [
        {
            "review_text": "Great puzzles. Crappy action. OK story. Clean look. A bit glitchy.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, but the Steam version MUST be installed on your C: Drive or you will get 'OUT OF TABLE RANGE' errors and it will not run.",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game just for Lara's ♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "To keep this short and simple, since very few if anyone will read it, and I tend to ramble and rant randomly, I'll simply list a few ways this title compares with similar games, from my perspective.  I have played most of the TR games since the original on the playstation. I always enjoy them to at least some extent, but often gave up on finishing them, rather than look up walkthroughs and strain my eyes and/or nerves for hours and hours. This game, however, I truly enjoyed. I watched part of one video walkthrough, because of confusion, but it was my mistake as I simply wasn't fully aware of the inventory system (since I had the item the entire time, but am quite used to notifications these days.) I played on the easiest difficulty, but that almost exclusively affects combat. The new functions available made the fighting even easier at times, but also tempting to fool around with, resulting in Lara's untimely demise more than a few times. To be honest, I tend to dislike the combat systems of tomb raider games most of the time, but looking back I can clearly state that if they had always had some of these abilities in earlier titles, especially the dedicated melee/spinkick/jumpkick/etc, I would have enjoyed them all much more. To me, the best parts of this 'original/non-reboot' Tomb Raider series, was the adventure aspect. Earlier titles varied greatly in their adventure/puzzle/combat ratio(s) but never quite like this game. Some was frustrating, even a couple parts that took dozens of attempts, but the issues were mainly my own.  All things considered, the puzzles were quite easy, levels often quite linear, and plot twists that weren't often surprising. But the most important thing about each of those 'negatives' is if you are comparing this game with others that specialize in one or two aspects. Despite simplicity at times, the puzzles often required thought, patience, and were fun. Any 'linear' issues are irrelevant to me for this game, as it was more of an interactive movie, not an open world RPG. And the story, despite it not being perfect, and often described as anti-climactic, felt more real and understandable than some big end fight. tl;dr. enjoy it for what it is.",
            "review_score": "1"
        },
        {
            "review_text": "Lara Croft Beautiful game, great gameplay, story and engine.",
            "review_score": "1"
        },
        {
            "review_text": "So far I am really enjoying this entry, but I am old and played the originals when they came out. I have also already played 2013 and that being said never really felt like it was a true 'TR' game, it just missed the mark for puzzles and vibes in my opinion. Underworld hits the nostalgia button just right, though I was sad to see they added the hints for people too lazy to figure it out for themselves. I've learned alot about Lara Croft during this adventure- mainly that she enjoys ancient tomato soup and playing D&amp;D. Despite the glitches, clipping and dated graphics I would recommend this to anyone who enjoys the series; unless you thought 2013 was amazing, then maybe you should just get Uncharted instead.",
            "review_score": "1"
        },
        {
            "review_text": "Looks like a reasonable game, but for some reason mine glitched and I got the terrible 'stuck under the boat' bug. Never did manage to sort it, so never managed to play the game at all. The boat sequence is in the first five minutes of play. Recommended? Well, I can't recommend it, no.",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed the story and I really enjoyed the parkour type places in the game. They added a couple new jumping mechanics on top of the ones from tomb raider legend. The puzzles were well designed as I felt challenged, taking a while to figure them out, but no so frustrating that I wanted to give up.  Here comes the big BUT.  They didn't fix the terrible camera tracking while climbing. You often find yourself having to blindly jump backwards because the camera angle wont allow you to turn far enough to see where to jump to next.  Also, a lot of the time throughout the climbing bits of the game I found Lara didn't respond to where I wanted to jump to and would often just jump off in some random direction resulting in a falling death. Which did get pretty frustrating, especially if you've been climbing for some time and been making progress.  Overall, I enjoyed parts of the game, but it got pretty frustrating at some points with poor mechanics.",
            "review_score": "-1"
        },
        {
            "review_text": "Play Tomb Raider: Legend first",
            "review_score": "1"
        },
        {
            "review_text": "Such a good game. Love Tomb Raider; it's easy to see how they became so iconic.",
            "review_score": "1"
        },
        {
            "review_text": "I love Tomb Raider games and Lara Croft too. This game is awesome. Graphics is great and gameplay is stunning. Music is breathless and cinamatics is cool. A must buy game.",
            "review_score": "1"
        },
        {
            "review_text": "Finishes puzzle door opens one inch off the ground   Reloads save 10 times   (Door opens)",
            "review_score": "1"
        },
        {
            "review_text": "Great game and has beautiful graphics",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful game, great gameplay, story and engine.  8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Classic tomb raider title, little buggy at times but overall a very good game.",
            "review_score": "1"
        },
        {
            "review_text": "I love that game. I am indeed a real fan of the Tomb Raider series, and that game is a great game. I highly recommand it to people interested in puzzle, adventure and action games. ",
            "review_score": "1"
        },
        {
            "review_text": "100/10 I can see Lara Croft with swimsuit.  + Boobs + ♥♥♥ + Smooth animation - Camera sometimes gone crazy",
            "review_score": "1"
        },
        {
            "review_text": "Gameplay doesn't matter its just a big fap",
            "review_score": "1"
        },
        {
            "review_text": "This is still quite awesome, I'm enjoying the nordic blended story immensly. The engines a bit fiddly but thats all, full recomendations!",
            "review_score": "1"
        },
        {
            "review_text": "I would definitely recommend this game, the controls are easy to get a hang of, leaving the puzzles the biggest part of the adventure. This game does not look nearly as aged as the other tomb raider games.",
            "review_score": "1"
        },
        {
            "review_text": "It's not a bad game, but they keep trying to add new stuff that doesn't work. After finishing TR : Legend ( a somewhat smooth but short experience ) I wanted to give this one another try. Could never finish it because most of the time I end up ragequiting, and here is why :  - the controls sucks sometimes and Lara dies - the balancing mechanics on wooden beams sucks and Lara dies - the wall multi-jump mechanics doesn't work and you have to start over, or Lara dies - the headshot system sucks and is completely useless - you have to fight the camera constantly, and Lara dies - Ai is mindless or berserk - the save system sucks  In fact this game could have been called Tomb Raider : Lara dies a lot. I died more time in the 2 first levels than in the entire Legend game, only due to bad controls, camera, or design. Maybe it's a good thing that they rebooted the series with the 2013 TR, because the next 'normal' TR game would have been a real mess full of useless gameplay mechanics just for the sake of adding something new, even if it doesn't work.  At least Lara looks good, when she doesn't die. Only play it if you can overcome the bad gamedesign.",
            "review_score": "1"
        },
        {
            "review_text": "This game works like ♥♥♥♥. Constant glitches from the start coupled with crashing when trying to change any settings. The second puzzle in the game requires the use of weighted blocks. Laura loves to slingshot them across the room. Sometimes chunking them into the water where you can no longer use them. No patches or work arounds. ♥♥♥♥.This.Game.",
            "review_score": "-1"
        },
        {
            "review_text": "This game makes an excellent case for why the series needed a reboot.",
            "review_score": "-1"
        },
        {
            "review_text": "To much bugs , i cant play bec i stuck . :(",
            "review_score": "-1"
        },
        {
            "review_text": "I really struggled with feeling motion sickness playing this game. I couldn't get past the first couple of levels due to the feeling. I think it has something to do with the laggy camera. I was really disappointed as I really enjoyed playing anniversary edition.",
            "review_score": "-1"
        },
        {
            "review_text": "Camera induces motion sickness. If I can't play it more than 5 minutes at a time, what's the point?",
            "review_score": "-1"
        },
        {
            "review_text": "First puzzle is broken.  10/10 would waste time and money again",
            "review_score": "-1"
        },
        {
            "review_text": "GLITCH PARTY USA!!!! GREAT GAME, BUT LAGS A LOT ON CERTAIN AREAS ON MY NEW COMP THAT PLAYS EVERYTHING PERFECT ON ULTRA REZ AND SO MANY GLITCHES SOOOOOOOO MMMANNNNNNNY GLLLLIIIITTTTTCCCCHHHHHEEEEESSSSSSSS SOOOOOOOOO MMMMANNNNNYYYYYY  yOU DROPPED THE BALL ON THIS ONE EIDOS. I'VE LOST A LOT OF RESPECT FOR YOU RELEASING A BUGGY PIECE OF GARBABGE AND THEN TAKING OUR MONEY WITH A STRAIGHT FACE  ",
            "review_score": "-1"
        },
        {
            "review_text": "I have to say that I don't recommend this game. The mechanics need more polish. One example is one jump might appear close enough, but since you're not supposed to go there, you'll fall and die. You will successfully leap across a larger gap if you are meant to go that route. This kind of trial an error sucks. There is a major physics glitch that nearly prevents you from completing the game. (Vsync helps.) You will be manually adjusting the camera almost constantly to undo the angles it automatically chooses. Combat is really an annoying part of the game.  What was good? The puzzles and climbing parts were fun. Unfortunately, everything else that surrounds the core gameplay to make it a more fleshed out game ends up detracting from the enjoyment of the game. That, coupled with the poor mechanics and glitches, ruins the game overall.",
            "review_score": "-1"
        },
        {
            "review_text": "Worst Prince of Persia game ever.",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this game and it gave me breast cancer ejaculations.   gr8 m8 8/8 I r8  -IGN",
            "review_score": "1"
        },
        {
            "review_text": "Almost everything about this game sucks. .Lame story .Awful combat .Autistic camera  .Controls have a mind of thier own  .If you screw up on a parkour you have to start the entire thing again  .Dies from a 30 cm drop",
            "review_score": "-1"
        },
        {
            "review_text": "Nope. A most definite 'Nope'. I played just 2 or 3 minutes effectively and cannot say anything about in-depth gameplay or story, but one thing already ruined the game no matter how good those may be: The controls. I'm not sure how it acts on controllers, i suspect no better though. You might have had some terrible experiences with the other, newer tomb raider games which all have poor controls, but this is a new dimension of 'f***ed up'. I'm playing video games for fifteen years now, several hours per day, and I've never encountered a game that made me nauseous so far. Until now. The little fact that the camera automatically tries to adapt to your character movement (which is glitchy already) and tries to overwrite your controls leads to an immense clusterf*** of camera movements. I proceeded in the game until you have to pull open the door with the grappling hook before I had to quit and empty my stomach in the bathroom.  I'll see if I can find a workaround for this (i.e. blocking this particular behaviour somehow), but since the game does not offer any solution or setting regarding this, it's definitely a reason not to buy the game.",
            "review_score": "-1"
        },
        {
            "review_text": "I've enjoyed all of theTomb Raider games that Crystal Dynamics has developed, and this one is certainly no exception. If you enjoy solving puzzles, there should be no reason to NOT try this one out.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a little hard out but still awesome. Good if you're procrastinating LARGE essays or suddenly become allergic to sunlight and have nothing but time 7/10",
            "review_score": "1"
        },
        {
            "review_text": "In my opinion, this game is the best of the old series, and really looking forward to what is to come next (Rise of The Tomb Raider). A great game if you like puzzles, there's gonna be a lot...",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game purely to look a Lara Croft's jugs.  the puzzles are ok too.",
            "review_score": "1"
        },
        {
            "review_text": "The old Tomb Raider formula is perfected in this game. Recommended for anyone who grew up with TR1/2/3. A worthy successor to the fabulously rebooted TR: Anniversary.",
            "review_score": "1"
        },
        {
            "review_text": "+Puzzels +Graphics still good  Got stuck on the secound puzzel quited and then uninstalled realized that i'm not that good at solving puzzels...",
            "review_score": "1"
        },
        {
            "review_text": "Stunning environments, lots of climbing and ridiculous story make Underworld very good Tomb Rider game. Worth playing.    Plus, riding on motorcycle into Valhalla! Immortal Joe would be proud of Lara.  ",
            "review_score": "1"
        },
        {
            "review_text": "the game is even more buggy than the previous one,but the graphics are just amazing,especially the water.Also doppelganger lara FTW",
            "review_score": "1"
        },
        {
            "review_text": "I like this game so much!!!",
            "review_score": "1"
        },
        {
            "review_text": "This game was, ok. It wasn't great but it wasn't bad either. Not nearly as amazing as the newest game but still worth playing. Sadly it isn't very long and the camera is extremely crappy. Still, its alot of fun with very clever puzzles and a decent storyline. Still, when you compare it to other treasure hunter titles, this one really is only so so. The story had some major stumbles and the ending wasn't great. Still, I had a fun time playing it and now I shall continue from this game backwards slowly playing over the tomb raider series.",
            "review_score": "1"
        },
        {
            "review_text": "Well...it's Tomb Raider...woman with guns shooting tigers and giant spiders...in some temple ruins...What did you expect?",
            "review_score": "1"
        },
        {
            "review_text": "B-E-A-UTIFUL! Everything about this game is beautiful...",
            "review_score": "1"
        },
        {
            "review_text": "apparently Deus Ex Human Revolution used a modified version of this engine, which explains why both scale well on midrange PCs.  Solid controls, great visuals, and great platforming puzzles. Could improve on the camera control, but it's not too much of a bother.",
            "review_score": "1"
        },
        {
            "review_text": "I was not a Tomb Raider fan before the entire Crystal Dynamics trilogy (Legend, Anniversary, Underworld), but their take on the franchise contains some ludicrous stories well told and some hair-tearing puzzles cleverly designed. Underworld is the standout. It's the most linear of the bunch (which means both less complexity and less tedium), but at the same time achieves a sense of epic scale not matched by the others. It's the little things Crystal Dynamics does so right - the art design is - as always - stupendous, the sound design some of the best in gaming...it'll take you places other games haven't even bothered to try...and oh, that climax...the final battle is a truly incredible, constantly shifting puzzle/firefight that will always hold a special place in my gamer heart. I highly recommend buying TR: Legend and Underworld in a sale, since the story links so well...as well as Anniversary, if you've got a lot of patience.",
            "review_score": "1"
        },
        {
            "review_text": "It's got classic Tomb Raider feel in terms of puzzles and level designs but on a far more grandiose scale - top quality graphics throughout with rich colours, environments and realistic light &amp; shadow effects make it more immersive.",
            "review_score": "1"
        },
        {
            "review_text": "On my computer the framerates were so fast that I ran into playability issues. I was so stressed out because whenever I would pick up a block and try to set it down it would fly hundreds of feet in random directions. So I was reading some tech support forums and found that some people were saying that if they turned the graphic settings or anti aliasing all the way up, it seemed to help but not cure the issue. This got me thinking. Maybe it has to do with framerate?   I usually display my framerate in an OSD with a monitoring app and realized that I was getting hundreds of frames per second even with the graphics and AA settings maxed out. So I started experimenting with VSYNC. This fixed the issue.   Turn on VSYNC to solve most playability issues.   It has been a fun game, the graphics are great, and Laura is hot as ever.",
            "review_score": "1"
        },
        {
            "review_text": "Well, personally, this game was good for its time. It graphics quality is even equal to XboxOne games. But I found the mouse sensitivty annoying and the puzzles frustrating...so there.  I only recommend this game to veteran video game players who like puzzles as this game in particular will drive you crazy. But other than that, it is a great game and have fun playing it.  Kirito Out!",
            "review_score": "1"
        },
        {
            "review_text": "Tomb Raider: &lt;anthology_name&gt; is yet another in the long line of &lt;positive_adjective&gt; Tomb Raider games. It is &lt;similarity_to_previous_versions_phrase&gt;, and &lt;positive_similarity_to_previous_versions_phrase&gt;. Worth &lt;reasonable_amount&gt;.",
            "review_score": "1"
        },
        {
            "review_text": "had fun puzzles were great and was a good quick adventure only thing i would note is that as i just said it does feel pretty short for a game however i did still enjoy the adventure part of it and i'm glad it was my first tomb raider game i played",
            "review_score": "1"
        },
        {
            "review_text": "Pretty enjoyable game! Decided to finally play through it after putting if off for a few years. Combat is pretty meh but luckily there's not a huge amount of it, and without shedding any spoilers it get's pretty fun later on. The environments the game takes you through are pretty breathtaking for their day in design, scale and scope, plus they all are filled with puzzles and climbing routes that sometimes span the entire level. Didn't take me too long to complete, maybe 8 hours or so. A couple of frustrating areas had me looking at a walkthrough for pointers, including the end sequence which was rather confusing at times. I'd highly recommend it if you like adventure games and exploration - if you can pardon the somewhat crazy magical story. Also Lara is looking her best which doesn't harm :) Underworld is under-rated.",
            "review_score": "1"
        },
        {
            "review_text": "I last played Tomb Raider: Underworld back when you ran it via a disk and really loved it. Now have the up to date version and it's still great fun so would definately recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "A good game with problems. Having to fight the camera half the time with a more open world setting than previous titles which doesn't live up to what it could be, however there are many jaw dropping moments and the end boss gameplay is so worth playing this game for. 7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely love this game. I am a 48 year old gamer and have seen it all. From beginning to now. Puzzles are great.I play it on a tripple monitor set up.Works very well. Lara is my video game girlfriend by the way. :)",
            "review_score": "1"
        },
        {
            "review_text": "A wonderful addition to the Tomb Raider game series. This is a direct sequel from Tomb Raider: Legend and you might want to play through that game first. The graphics are better than any of the game's before it and more realistic. This game may be considered 'old' in the Tomb Raider series now, but it's doesn't lack any of the great qualities Tomb Raider games have.",
            "review_score": "1"
        },
        {
            "review_text": "Tomb Raider Underworld wraps up the first reboot trilogy, tying loose ends of Legend and including the events of Anniversary. The story is darker and good. The graphics are good and the music epic at times. And the gameplay is what you would expect, with fluid controls for exploration and puzzle solving, once again in tombs. The combat is still average though. The length is somewhere between Legend and Anniversary. A worth sequel to two great titles. If you liked those, you'll like this one.",
            "review_score": "1"
        },
        {
            "review_text": "Controls are very bad and camera angle make me crazy time to time. Could be better if more optimized for pc.",
            "review_score": "-1"
        }
    ]
}