{
    "app_id": 8170,
    "name": "Battlestations Pacific",
    "release_date": "2009-05-13",
    "developer": [
        "Eidos Studio Hungary"
    ],
    "publisher": [
        "Square Enix"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Strategy"
    ],
    "tags": [
        "World War II",
        "Strategy",
        "Action"
    ],
    "achievements": 0,
    "positive_ratings": 1028,
    "negative_ratings": 542,
    "price": 6.99,
    "description": "Experience one war through two epic sagas where you will be a part of history or change it. Feel the power of the historically authentic and decisive battles of the Pacific War. Relive some of the grandest and most critical naval battles of recent history and for the first time, choose to lead your fleet to a completely different ending...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/8170/header.jpg?t=1528476899",
    "minimum_requirements": "OS: Microsoft Windows XP (admin rights required)/Microsoft Windows Vista (admin rights required)                     Processor: Intel Pentium 4 3+GHz or AMD Athlon 2.5+GHz                      Memory: 1GB (Windows XP) / 2GB (Windows Vista) system memory                      Graphics: NVIDIA GeForce 6 series 6800GT (or better) / ATI 1800XT (or better)                     Hard Drive: 8 GB Free Space                      Sound: Direct X 9.0c compatible sound card and drivers",
    "recommended_requirements": "OS: Microsoft Windows XP (admin rights required)/Microsoft Windows Vista (admin rights required)                     Processor: Intel Core 2 Duo 2.2 GHz or Athlon 64 X2 4400+                     Memory: 2 GB system memory                     Graphics: nVidia GeForce 9800 GTX or ATI HD4800                     Hard Drive: 8 GB Free Space                     Sound: Direct X 9.0c compatible sound card and drivers                     Input Devices: Keyboard and mouse / Xbox 360 Controller for Windows",
    "reviews": [
        {
            "review_text": "Following up on Battlestations: Midway, Battlestations: Pacific keeps the same mix of RTS and action together. This time the game has 2 campaigns, one for the Japanese and one for the US putting you right in the middle of large naval battles in the Pacific. Gameplay is the same giving you a large tactical view of all of your units and allows you once again to take command of any unit at anytime to let you control the action first hand.",
            "review_score": "1"
        },
        {
            "review_text": "An extreamly underated game. Nothing beats diving through a cloud of AA fire on a torpedo run agaisnt a american or japanse carrier. Or the the feeling of invicibility as you pound enemy ships with you main guns as a battleship or shoot an enemy squadron from the sky with your flak guns.",
            "review_score": "1"
        },
        {
            "review_text": "Destroying IJN Kongou and Yamato with Patrol Boat  10/10",
            "review_score": "1"
        },
        {
            "review_text": "I have been looking for so many years for a game like this. Battlestations: Pacific gives me more than I even wished for. This game is the best I have ever purchased in two years. This game gives you command of your own ship, then throws you into the heat of the battle. If you are looking for an excellent RTS, this is the game for you.  I recommend NOT using it on a Windows 7, for it runs insanely slow. Windows 8 works perfectly.",
            "review_score": "1"
        },
        {
            "review_text": "Requires 'Games for Windows' (which requires .NET installers/patches and Windows Live Sign In Helper) to run and save games. This game is not immediately compatible x64 systems. Huge headache.",
            "review_score": "-1"
        },
        {
            "review_text": "I loved this game when i played it in the past, i want to love it again, the problem is that out of the 15 (yes literally 15) times i have installed it on here and other systems since i bought it it has yet to work EVEN ONCE! I tried the whole GFWL and updates, those are a bust. The game loads up to the 'Menu' with NOTHING ON IT, then after a while it goes to a great cut scene, then right back to the BLANK MENU screen, i cant even exit it without killing the process........WTF ",
            "review_score": "-1"
        },
        {
            "review_text": "Won't work. No refunds. No fun. 0/10 Gaben, your shadow faileth us.",
            "review_score": "-1"
        },
        {
            "review_text": "I loved this game on the Xbox 360 and really wanted to play it on PC, but since the Windows Games Live service was shut down, this game can't run on a machine after windows 7. I've tried every workaround to try and get it to run, but it won't. If you want to play it, go do it on an Xbox.",
            "review_score": "-1"
        },
        {
            "review_text": "it dose not load and i cant play it",
            "review_score": "-1"
        },
        {
            "review_text": "Does not work on W10 !! Do not buy it!  Steam u disapoint me! No warning at all!!",
            "review_score": "-1"
        },
        {
            "review_text": "Failure to run on windows 10 due to microsoft service failure.",
            "review_score": "-1"
        },
        {
            "review_text": "Do not buy this game........ I'm terribly sorry, but without the Microsoft windows live program (which is no longer supported i believe) the game will refuse to work. Getting to fix the game by installing the program is awfully time consuming and often very complicated for anyone who is new to this game (on PC at least). Yes, I did have some time playing the game, I managed to fix it the first time but now it is just way too much to fix now. This makes me sad because the game itself is very, VERY good. Lucky for me, I managed to enjoy the game on console (Xbox 360).  It was just very heart breaking knowing I paid on steam for a semi-broken game, and I was going to recommend this game. I know this game is long past it's time, but if they ever fix the whole windows live program mess my life would be complete again. As of now I just really want to remove this game from my library, it almost makes me want to cry just seeing this game untouched almost.",
            "review_score": "-1"
        },
        {
            "review_text": "A very realistic game! A think that this game is underestimated and maybe the only wrong choice is windows live for who wants to buy the dlc but a very good game  10/10",
            "review_score": "1"
        },
        {
            "review_text": "why can't play this game ??????????????????????///",
            "review_score": "-1"
        },
        {
            "review_text": "Combining elements of ship/sub warfare, arcade flight simulator and real time tactics. The single player missions range from a mini-sub attack on Sydney Harbour, through to full fleet invasions involving multiple aircraft carriers and associated battlegroups. There is slightly more emphasis on flight compared to the previous title. There are some artefacts that creep in to illustrate that this is a console port, the ship guns now autocompute range and lead, but this is offset by the ships now having subtargets (fuel, engine, magazne, etc) that you can aim for. The control scheme isn't as good as the previous native title, but it is passable. The only really annoying oversight is that there is no way to assign aircraft rudder to the twist action of a joystick. There are some interesting new units, the kaiten torpedo (plays like a manually guided torp), the LSM(R), Ohka (kamikazi rocket bomb).",
            "review_score": "1"
        },
        {
            "review_text": "Who hasn't spent their days thinking about how much fun it would be to bomb Pearl Harbour? Unless you're a 90 year old Japanese man, this is the only way that you can experience it. I haven't shot down this many Americans since the last time I went to a bar in Portland.",
            "review_score": "1"
        },
        {
            "review_text": "Would love to have sex again.",
            "review_score": "1"
        },
        {
            "review_text": "i absolutely love this game to death. i keep coming back for more everytime i log on. everything about this game is a masterpiece from the graphics to the ships to the planes battlestations pacific is a truely wonderful game. although i was hoping that the battleships could open fire on each other from miles out i guess this isnt meant to be a full on simulator of ship vs ship battles. i was also hoping for a way to get the pearl harbor battleships and to play as them after they've been raised and rebuilt from there watery grave at pearl harbor but i guess that isnt going to happen either. but anyway i would say to get this game you will not be dissapointed.  my only problems with the game is how the battleships cant fire off all there guns at once and how the ai loves to spam the most powerful units, that is frustrating. also how in multiplayer the planes dont actually launch from there carriers they spawn above it. other then that the game is perfect. this game is really fun either way and i cant recommend it enough.you can fly planes, steer ships, capture island bases, launch recon planes, use submarines, drop destroyer depth charges to kill subs underwater, launch planes from carriers, change the planes payload when selecting your aircraft and there is so much more to do in this game.   there are two campaigns in this the american campaign which takes place after the battle of midway and starts off with the battle of the eastern solomons, and a fictional japanese campaign which starts off at the attack on pearl harbor. both campaigns require a lot of skill and effort to finally complete especially the last mission, and there are also 3 difficulty levels to choose from rookie, regular and veteran. both campaigns have a set number of main objectives you have to complete as well as the hidden objectives in order to get a gold medal on them. if you get a gold medal on certain missions you will unlock new units something that is definitely missing from todays games.",
            "review_score": "1"
        },
        {
            "review_text": "a very fun game ahead of its time, especially the ship elements, will keep u entertained for hours and hours, looks good and because of its age should play well on most systems",
            "review_score": "1"
        },
        {
            "review_text": "Doesnt work on windows 10. Sadly i bought the game before i got windows 10 so no refund for me. :(",
            "review_score": "-1"
        },
        {
            "review_text": "Being a Banzai bomber is actually a legitimate way to destroy a ship",
            "review_score": "1"
        },
        {
            "review_text": "Worth to play, very fun.",
            "review_score": "1"
        },
        {
            "review_text": "Good enjoyable game! Bought the Battlestations Collection. The Xbox controller works on both games. The controls are already mapped in this game, not the case for Midway.",
            "review_score": "1"
        },
        {
            "review_text": "To whom it may concern. So did read system require thing an took a chance as a couple of guys in discussion reckon they got it working on 64 x windows 8.1 . I tried the stuff suggested an since i aint an ace on the laptop needless to say cant get it workin , shame as i remember it fondly from xbox 360 . Be good if steam had a system checker or summin if thats poss before the download but my bad for takin a chance really (maybe ?) .. Should really just work though as the only thing that let them dodge my wrath is the fact midway works no probs ? Got the two on a deal for a couple of pound an its good id say as there is alack of decent naval warfare games .  Cheers gus",
            "review_score": "-1"
        },
        {
            "review_text": "Arcade-yet-not   Okay, so you get super quick repair times, except when you are more damaged it repairs less per second, as in, not only is there more to repair but it takes longer with 2 factors.   Aiming is pretty easy, but armor is very effective so dont think 'Hey, all my shots hit the big ship! its dead'  Nope. Maybe 1/16th of its health gone.   If you like sinking stuff, training mode is probably the best for you....nothing fires back except 3 ships in naval mode...   Bombing is relatively easy, just hold shift or whatever it was, and when the targets about to hit the ship, FIRE!   Overall:  PROS -Good graphics -Easy to learn -Soft on beginners -Great cutscenes, I feel like I'm in an interactive movie! -Controls are not over-the-top reactive  CONS -LONG Cutscenes, mainly in practice this is a problem -Ship damage listing wise is not good -Windows live seems to not let me make an account (you need it for cloud saving) -Windows live in general  Play if you like somewhat arcadey games with a good story.  The trailer does not lie.",
            "review_score": "1"
        },
        {
            "review_text": "Don't buy the game, the game is broken, the game would not load for me anymore",
            "review_score": "1"
        },
        {
            "review_text": "can't play. dont Buy !",
            "review_score": "-1"
        },
        {
            "review_text": "pretty good game, good history lesson as well :D",
            "review_score": "1"
        },
        {
            "review_text": "Its a great game... if you can play it I played it all the time on my old computer and enjoyed it a lot but now on my new computer it just stops on the main screen with no options which is a shame because I love the game.",
            "review_score": "1"
        },
        {
            "review_text": "nice game for Pacific Battlefield",
            "review_score": "1"
        },
        {
            "review_text": "this game used to be my favorite until i made a terrible mistake by closing the game while it was loading",
            "review_score": "1"
        },
        {
            "review_text": "Played this game like a champ on Xbox and was stoked to get it for PC. To me world rocking disapointment I was unable to play because the game is not compatable with my Win10 Customer Built PC.   I would ask for a refund but it's been outside the 2 week 2 hour marks. If you have a Win10 build beware and bewarned that this may not work with your build.",
            "review_score": "-1"
        },
        {
            "review_text": "i can not get this game working properly  i hate it!!!!!!!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "why wont it work ",
            "review_score": "1"
        },
        {
            "review_text": "pile of trash game play poor graphics poor mission set up poor all in all a poor game all round one to avoid. defend an aircraft carrier and sink an aircraft carrier you attack the enimy thay sink yours you defend yours the mission dose not end as you have to sink theres you have a limmited amount of aircraft on your carrier thay have an unlimited amount on theres how is that fair.",
            "review_score": "-1"
        },
        {
            "review_text": "Game will not work after repeatedly trying different methods it refuses to work ",
            "review_score": "-1"
        },
        {
            "review_text": "A nice graphical improvement over Battlestations Midway, but I think they made the fleet controls just a little overcomplicated and the storyline of the first game is missed.  I strongly recommend this game and its prequel",
            "review_score": "1"
        },
        {
            "review_text": "wont let me play game it stays in a little box in top left corner and after 5 secs it disapears wtf 15 dollas wasted",
            "review_score": "-1"
        },
        {
            "review_text": "how do you fix luancher problems",
            "review_score": "1"
        },
        {
            "review_text": "it's a must play game, fun and addictive",
            "review_score": "1"
        },
        {
            "review_text": "So bought it in a sale.... Old xbox game i used to love the multiplayer on.  Ok old fashioned windows live sign in done.... Hotmail login....30mins off updates done ready to go....  Your xbox live a/c has been reverted to silver and i cannot play a steam game multiplayer unless i sign up for xbox freaking gold at $5 dolla a month.... Scam and avoid refund me steam!",
            "review_score": "-1"
        },
        {
            "review_text": "i bought it and it doesnt run ive tried everything sell me a functional copy of the game next time",
            "review_score": "-1"
        },
        {
            "review_text": "Huge letdown.",
            "review_score": "-1"
        },
        {
            "review_text": "Absolutely amazing game that combines RTS and action elements that put you right at the heart of the largest sea war in human history. Every mission is masterfully crafted with no glitches or bugs that I have seen yet. The graphics are nothing to write home about, but on the flipside this game will run wonderfully on the worst computers this world can offer. In short this game is the living proof that gameplay design retains its luster even 6 years after its release date and few games to my knowledge have done so.  A 10/10 would even begin to do this game due credit and I would saw off my left pinkie for a sequel.",
            "review_score": "1"
        },
        {
            "review_text": "One of my all time favourite games 8) after a buggy start re-downloading Microsoft Live from Microsoft solved the crashing start 8) hope this helps 8) 10/10 great in multiplayer to just need more people!!!",
            "review_score": "1"
        },
        {
            "review_text": "Very good its very easy to get the hang of not ideal for a simulator but still just as good and is one of my favourite childhood games :), also you can even play as a kamikaze pilot not alot of games let you do that very nice graphics aloso very good just buy it if you like naval warfare and yeha thats about it. :D",
            "review_score": "1"
        },
        {
            "review_text": "Great series!",
            "review_score": "1"
        },
        {
            "review_text": "The game works know but the bad part is you need windows live to save the game that sucks so if you shut the game down it losses all your progress so thats the only down side but the game is really fun.",
            "review_score": "1"
        },
        {
            "review_text": "For everyone who wants to save their progress but doesn't have an xbox live account here's a way to save without paying $60 (granted, you can't play offline)  -Press home and click 'create profile'  -scroll down and click 'create local account'  -follow the steps  -there you go!  Your progress saves so you can now play with the glorious Yamato once you unlock it! ",
            "review_score": "1"
        },
        {
            "review_text": "Fun game with planes, boats and the like. For the windows live part that people are complaining about, simply do the following. When you load the game and are prompted by windows live, click new profile, scroll down the text that appears and click the 'local profile' link in the text itself. Create and done. Its a bit hidden, but now you can save. Done and done. Midway doesnt have to worry about the Windows Live thing.",
            "review_score": "1"
        },
        {
            "review_text": "The game is using Games for Windows Live 'services'. This means, that if you are lucky, then you can login and start to play, if not, then not. :( One of the worst things that can happen to a game.",
            "review_score": "-1"
        },
        {
            "review_text": "The Battlestations game were both really well made. This one just stole my vote though. I've had a lot more childhood memories from BSP and there are modders out there who know how to make this game even better. Not a bad purchase at all.",
            "review_score": "1"
        },
        {
            "review_text": "Fun but being able to control land units would make it better. :D",
            "review_score": "1"
        },
        {
            "review_text": "The front half of my ship was gone but it was at full health. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Windows 10 here. And I just wasted my 2 hours troubleshooting for nothing",
            "review_score": "-1"
        },
        {
            "review_text": "An Amazing Game for it's time, Amazing depth, cool Mechanics and lots of fun     I'd rate it 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is incredible, it has sea combat, under sea combat, and air combat, the game has a plenty of ships and two factions to use as well as plenty of planes to use. I recomend this game to anyone who likes being in control of ships, planes, and submarines being able to destroy other ships, planes, and submarines",
            "review_score": "1"
        },
        {
            "review_text": "Technically, A great game. But Microsoft Gaming ruined all of its feature. And, not executable on WIN 8 or higher.",
            "review_score": "1"
        },
        {
            "review_text": "Battlestations Pacific is an awesome game if you can get it working. Due to the Games for Windows Live packaging with the game, you have to have a Xbox Live account made in order to get the game to work. Once you get past the GFWL the first time, you shouldn't be promted by it in the future, OR you can opt for an offline profile, this will result in a complete lack of any multiplayer content however. Reviewing the actual game;    Pros",
            "review_score": "1"
        }
    ]
}