{
    "app_id": 8310,
    "name": "Bone: Out From Boneville",
    "release_date": "2008-06-17",
    "developer": [
        "Telltale Games"
    ],
    "publisher": [
        "Telltale Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "Point & Click"
    ],
    "achievements": 0,
    "positive_ratings": 78,
    "negative_ratings": 71,
    "price": 0.0,
    "description": "After an attack by a swarm of locusts leaves Fone Bone lost in the mountains, he sets out to find his cousins, with a little help from a mysterious red dragon, a couple of talking bugs, and a pretty girl named Thorn. But with hungry rat creatures on his tail, will Fone Bone ever make his way back to Boneville?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/8310/header.jpg?t=1447351351",
    "minimum_requirements": "OS: Windows XP or VistaProcessor: 1.5GHz processorMemory: 256MB RAMGraphics: 32MB 3D-accelerated video card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I dont write this as a review but more as information for those who dont know. This is the first Episodic game that Telltale Studios ever made, even though its old it has same gameplay with The Walking Dead and the rest of the Telltale series.",
            "review_score": "1"
        },
        {
            "review_text": "To save you all the trouble, when playing the hide and seek game, cold makes them go backwards from the direction they are facing, hot makes them turn direction in the place they are standing, warm makes them move forward in the direction they are facing.",
            "review_score": "1"
        },
        {
            "review_text": "3/10 amazing game here is why: 9th person shooter click to point game great music just like the original radio show Bone! having my gtx 970 makes it frogging amazing. it is pretty cool cuz you feeel like you are actually a bone actor.",
            "review_score": "1"
        },
        {
            "review_text": "If you love the series, then this game is for you.",
            "review_score": "1"
        },
        {
            "review_text": "If this should be recommended probably depends on the other acts of this series. As it is, Out From Boneville feels pretty unfinished, as if it didn't even make to the polishing phase. Altogether this seems to be more of a proof-of-concept adventure for the TellTale engine. From design (protagonists' models and movements are somewhat similar to Max's) and voice actors (e.g. main protagonist's voice is Sam's) I'd say this adventure was done to show the Sam &amp; Max adventures could be done, which incidentially are what I would recommend everyone to play way before touching this game.  + It's an adventure + TellTale engine: 3D world, camera 'following' the player + Good voice acting: David Nowlin (Sam) and other voices from TellTale's Sam &amp; Max  - Way too short and still somewhat boring - Story almost completely developed in introduction cutscene - Awful controls in action sequences - Skipping dialogue parts may skip more than can be read at the time  The story builds little momentum, mainly driven by the introduction cutscene and by some pieces of dialogue that appear disconnected at times. And the first act is over in nearly no time. Puzzles are very easy. Basically it's combining the few things you find with the environment, the main obstacle here is finding items as they are not highlighted in any way (which I'm fine with). Other times your current objective is helped by dialogue. There are three scenes with their own puzzle mechanics   - labyrinth, hide and seek -   which is nice.  Using items inconsistently makes the mouse cursor that object or the standard 'use' cursor.  There are two  very bad third-person action sequences  in which you have to escape whatever follows you. They are bad because your control options - jump, go left, go right (as opposed to turn left or right) - are executed with the mouse and the left-right movement control is nothing close to tight. There is no indication as to how far you just moved the character before it stops moving in that direction which can feel pretty long after you let go of your mouse and make you run into obstacles - not fit for reaction sequence. Both sequences are short but not short enough to not bore. Then again you can simply fail them after which the game offers to skip them.  Personal preference: I don't like it when the played character, one of two, behaves like a prick, more so if that interferes in no way with completing objectives. Maybe that's why the 'protagonists' are from Boneville.  I may recommend this act after playing the next one as piece of the overall experience but I don't expect the second part to take it away. For now, I don't recomment Out From Boneville.",
            "review_score": "-1"
        },
        {
            "review_text": " Not a huge fan of TellTale Games mainly because I hate Point-and-Clicks but this was okay I guess. Visuals are nice, the characters are pretty funny/interesting. but the mini games are pretty s****y. Walking around is akward especially with the odd camera angles you can't adjust. Had no idea what to do in-game so thank god for hints. A very very short game with little story to offer, meh.  2/10",
            "review_score": "-1"
        }
    ]
}