{
    "app_id": 8330,
    "name": "Telltale Texas Hold ‘Em",
    "release_date": "2008-06-17",
    "developer": [
        "Telltale Games"
    ],
    "publisher": [
        "Telltale Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Casual"
    ],
    "tags": [
        "Casual",
        "Card Game"
    ],
    "achievements": 0,
    "positive_ratings": 69,
    "negative_ratings": 77,
    "price": 1.99,
    "description": "Join poker's most outspoken players for a hand of Telltale Texas Hold'em, the card game stacked high with personality. Quips will fly, chips will fall, and you may just end up rolling in the aisles.This is your chance to play in a poker tournament against four characters of such lethal absurdity, you'll either die laughing or die trying.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/8330/header.jpg?t=1447351362",
    "minimum_requirements": "OS: Windows XP and Vista Processor: 1.5GHz processor Memory: 256MB RAM Graphics: 32MB 3D-accelerated video card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "It like hold-em with a little texas involved.",
            "review_score": "1"
        },
        {
            "review_text": "I have played Poker Night 1 and compared to this, I loved this game better. In this game you play 4 players entered in The TellTale Poker Tournament. All four characters I really enjoyed in this game over the characters in Poker Night 1. This game is great for Texas Hold 'Em newbies or old pros. In between turns you sometimes get dialouge from the characters who all have unique personalities. Harry is a guy who thinks he is the best because of his poker coach. Borris is a momma's boy who wishes that she'll grant him luck. Ted is a surfer who has some great one liners but seems to be hated by the group. Last, but not least, is Grandma who is just a sweet old lady trying to get some extra cash. Sure it might not have the cool atmosphere Poker Night has, but considering this game is 2 dollars cheaper and is has more enjoyable characters in my opinion, I say go for this one.",
            "review_score": "1"
        },
        {
            "review_text": "Telltale Texas Hold 'Em was the very first game Telltale Games ever made. It was released just a year after the company's foundation date and before they got licensing deals to make games on pre-exsisting properties, they started off with an independent title. The game is a predecessor to the more commonly known 'Poker Night' games. As common for most starting titles of a newly developed game company this game has its own share of flaws. There is no introduction sequence or a plot, after selecting 'new tournament' on the menu you are immidately in position at a random Vegas poker taple with four other opponents named Harry Weinhead, Boris Krinkle, Theodore Dudebrough, and Grandma Shakey. Harry resembles a barber shop quartet minus three other barbers to sing with him, Boris is the bald guy with a 'bad guy' look on him, Theodore is the frat boy, and Grandma Shakey is the elderly woman. All four opponents of the Texas Hold'Em tournament are ok. There is nothing too inventive or creative about them due to the fact that there is limited animation and amateur-ish character designs on all four of them. But if you look pass the flaws on the characters, the game is playable. It's not like Poker Night at the Inventory where there are awards and character skins to unlock. It's an average poker simulation and nothing more. All great game companies had to start off with something to get to where they are. And this game did help them establish new deals with other companies to create bigger better games. I can't promise that you will like this game, but it's only worth playing to see how much Telltale improved since they had started 12 years ago.",
            "review_score": "1"
        },
        {
            "review_text": "2.5/10 - Worth about $0.25  I played this game for 30 minutes. Complete... And I really suck at poker. A single tourny; 5 players. Easy to win.   This game has little replay value since it's so short, basic and easy.     Accidently Reviewed",
            "review_score": "-1"
        },
        {
            "review_text": "An attempt to create a humourus, Texas Hold'em experience, Telltale's rendition of the famous card game is painfully outdated. Though poor graphics and awkward pacing is fully understandable from a game released during the early months of 2005, the dialogue is cringe-worthy at best, coming off more desperate than amusing. The continuous commentary from the opposing characters simply feels clunky and unnecessary, forcing the player to click through the dialogue. In addition, increasing the number of a bet, as far as I am aware, requires clicking the 'Increase' button multiple times, as the game does not provide a slider to change the number that you wish to bet.  I have great admiration for Telltale Games' quality in their more recent releases, but this game simply is unable to keep up with newer, and cheaper renditions of Texas Hold'em.  Definitely pass on purchasing this product.",
            "review_score": "-1"
        }
    ]
}