{
    "app_id": 8340,
    "name": "Strong Bad's Cool Game for Attractive People: Season 1",
    "release_date": "2008-12-18",
    "developer": [
        "Telltale Games"
    ],
    "publisher": [
        "Telltale Games"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "Point & Click",
        "Comedy"
    ],
    "achievements": 0,
    "positive_ratings": 218,
    "negative_ratings": 25,
    "price": 22.99,
    "description": "Enjoy Strong Bad's wacky comedic adventures over 5 full episodes!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/8340/header.jpg?t=1495068280",
    "minimum_requirements": "OS: Windows XP / Vista                     Processor: 1.5 GHz                     Memory: 256 MB Required / 512 MB Recommended                     Graphics: 32 MB 3D-accelerated video card / 64 MB recommended.                     DirectX Version: Version 9.0c August 07 Required (November 08 included and recommended)                     Hard Drive: 900MB free space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "It's a cool game for attractive people.",
            "review_score": "1"
        },
        {
            "review_text": "If you're an adventure game lover that enjoys TellTale's other works, or you're just a web nerd that loves Homestar Runner, this game is a good one with a lot of detail and care put into it.",
            "review_score": "1"
        },
        {
            "review_text": "Dear Strong bad,  Please come back to the internet full time, we miss you.   Your friend with benifits, Miss galaxy",
            "review_score": "1"
        },
        {
            "review_text": "Oh man, this entire series. I've probably been aware of the Homestar Runner cartoons for at least half my life now so there's already a mild degree of nostalgia here. And Telltale really delivers on the concept; the characters and writing all match well with the cartoons and it's just as funny as ever. I've always liked that comfy spot between 'kid humor' and 'adult humor' that they found, it doesn't show signs of either's stupidity but keeps the good parts of each, making it humor that basically anyone can enjoy.   As for the game itself, then. It's a competent point-and-click adventure. The only real moon-logic puzzles are for the optional collectibles, while the main storyline is generally easy to progress with only mild experimentation, and usually the plot guides you in the right direction. Plus there's a hint system if you really get stuck, so the game should easily be completable on its own. I used a guide to look up collectibles but little else. It's certainly fun and clever about what you need to do. The minigames in each episode are also all pretty diverse and interesting; they all bear a degree of stylistic suck and aren't too terribly complex nor difficult but they're worth the 15-20 minutes I tended to spend on them, and a nice diversion from the puzzling and slower pace of the main game.   For the episodes themselves; it's not really possible to buy them separate I think? But they're all pretty interesting and unique in their own way. The first episode is very straightforward and vanilla and a good introduction to the series. The second's theme is strong as well as inducing plenty an amusing moment, and also contains my favorite of all the minigames (and really the most content in general). The third is a bit weak on the first half but the second half returns to form (plus the music being played is just... special.) The fourth is more linear than the rest but has an entirely different atmosphere that basically necessitates this; it's probably the funniest out of all the episodes too. The fifth also has a strong theme and provides a satisfying finale for the season. Even if they really all have nothing at all to do with each other, since each episode is, like the cartoons, pretty much standalone.  All in all though I'd highly recommend this for fans of the cartoons and still would consider it worth checking out even if you know nothing about Homestar Runner.",
            "review_score": "1"
        },
        {
            "review_text": "It's a typical Telltale adventure game, but with the added awesomeness of Strong Bad. How can you go wrong?",
            "review_score": "1"
        },
        {
            "review_text": "This game is lots of fun, although I wish you could make Strong Bad run faster. Lots of references to the show, lots of puzzles. I give it nine thumbs up.   Nine thumbs up? What the hell is that?",
            "review_score": "1"
        },
        {
            "review_text": "3 hours of gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "It's good, classic Telltale. The main characters voice is a little annoying, but it's supposed to be. Quite a few laughs here, so overall good.",
            "review_score": "1"
        },
        {
            "review_text": "I helped make this!",
            "review_score": "1"
        },
        {
            "review_text": "Look, if you've seen every one of 'the e-mails', watched every one of their 'toons', know every in-and-out of each of the 'characters', and are looking for some more cool 'games' for your 'downloads', the Strong Bad game is where it's at. Check it out at the Steam 'store'!",
            "review_score": "1"
        },
        {
            "review_text": "I watch a LOT of Homestarrunner back in the day and lemme tell you this is even better than the cartoons.   This is the Homestarrunner game I always wanted. It feels real Nostalgic seeing the gang. And each episode is only better   than the last. If you're a fan of Homestar and the rest this is a must have series!",
            "review_score": "1"
        },
        {
            "review_text": "I forced myself to play for some time but the game feels like pushing a boulder up a hill. You expect the hill to end somewhere but it just doesnt.",
            "review_score": "-1"
        },
        {
            "review_text": "the HSR guys did all the writing, voices, music. and they're still awesome at all that.  it's just that the Telltale guys designed the rest of the game around it, and that's kinda mixed. it kinda kills the pacing to wander around figuring out puzzles before you get the next joke. and they're not very good puzzles either, it's more like 'try to read the developers' minds' as you pick up items long before Strong Bad has a reason to want them. then you try the items on everything and everyone possible zzZZzz.  I'm really not sure whether to mark this positive or negative. I guess baaarely positive, because you can always just download a walkthrough and pretend these are very, very long SBemail episodes with awkward 3d graphics. And creating your own Teen Girl Squad comics is kinda fun (even if it's hard to 'win' at that minigame)",
            "review_score": "1"
        },
        {
            "review_text": "Wish I waited to buy it on sale!!! DAMN!!!",
            "review_score": "1"
        },
        {
            "review_text": "Dear Strong bad    Your game is pretty cool I have to say though it does suffer a bit from point and click syndrome but that is part of the charm  From Thomas Stobbs  Norton OH",
            "review_score": "1"
        },
        {
            "review_text": "If you love the series, you will probably love these games. If you like point-and-click adventure games, you will probably like these games. If you suck, you will probably hate these games.",
            "review_score": "1"
        },
        {
            "review_text": "It has Strong Bad and Teh Cheat. And The Corch Z. And Homestar. And Bubs. And Homsar. And Strong Sad. And ALL THE STRONG BAD PEOPLES! That makes it awesome!  15 emails/ 10 emails GOTY",
            "review_score": "1"
        },
        {
            "review_text": "I feel like this game series immediately lost a lot of its charm by going with 3D animations instead of basing it on the 2D art used for the Flash cartoons. The gameplay wouldn't have been affected, and where necessary it could've occasionally switched to a 3D sequence. Other than that, it's just not really as funny as the web cartoons. The dialogue for those is usually short and snappy, and here you get kind of mired in the necessary conversations for adventure game dialogue. A lot of the references to stuff from the web cartoons feel kind of tired. I've been playing it for a while now and after 10-15 minutes I just have to save my game and go do something else for a while.  I will say the adventure game aspect of the game is pretty solid, it can get tricky without becoming frustrating. It's not a bad game series, but a little disappointing.",
            "review_score": "1"
        },
        {
            "review_text": "Telltale's original point-and-click love combined with Homestar Runner's brilliant humor makes this game a great start to the SBCGfAP series.",
            "review_score": "1"
        },
        {
            "review_text": "Hey man, you like them point and click type games? The ones with the freakishly overcomplicated simplistic puzzles, and the weird drop down menus that seem to exist on a realm just slightly beyond mortal comprehension? No? Yes? Very yes? If yes, then you came to the right place! sorta...  Long before the other pointy clicky type of popular web series with Home in it's name, or that Walking simulator that's about as amusing as watching paint dry, there was the Homestar runner, terrific athlete and star of his own web series of pointy clicky type animations. And by 'star' I mean co- star. Honestly, even calling Mr. Tights in the hallway a co-star is pushing it. Like, REALLY pushing it.  The point here, Whatshisface, is that the folks over at TT did a collab with he guys that made That web series quite some times ago. It's full of that special heart healthy brand of clicky pointy action, mixed with the usual type of stuff You've come to excpect from both of them, for better or for worse. There's even games within the games! Lately ol Teetee's been slacking off with their newer releases in some respects, but this one pulls all the stops if you gotta get your strong dosage of bad. and by bad I mean good. The game is good. it was a joke. Laugh! On second thought, don't do that. I can't hear you anyway.",
            "review_score": "1"
        }
    ]
}