{
    "app_id": 8500,
    "name": "EVE Online",
    "release_date": "2010-12-15",
    "developer": [
        "CCP"
    ],
    "publisher": [
        "CCP"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Multi-player",
        "Online Multi-Player",
        "MMO",
        "Co-op",
        "Online Co-op",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Free to Play",
        "Massively Multiplayer",
        "RPG",
        "Strategy"
    ],
    "tags": [
        "Space",
        "Massively Multiplayer",
        "Sci-fi"
    ],
    "achievements": 0,
    "positive_ratings": 8317,
    "negative_ratings": 2832,
    "price": 0.0,
    "description": "EVE Online is a community-driven spaceship MMO where players can play free, choosing their own path from countless options. Experience space exploration, immense PvP and PvE battles, mining, industry and a thriving player economy in an ever-expanding sandbox.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/8500/header.jpg?t=1554916517",
    "minimum_requirements": "OS: Windows 7 Processor: Intel Dual Core @ 2.0 GHz, AMD Dual Core @ 2.0 GHz) Memory: 2 GB Hard Drive: 20 GB Free Space   Video: AMD Radeon 2600 XT or NVIDIA GeForce 8600 GTS Network: ADSL connection (or faster)",
    "recommended_requirements": "OS: Windows 10 Processor: Intel i7-7700 or AMD Ryzen 7 1700 @ 3.6 GHz or greater Memory: 16 GB or greater Hard Drive: 20 GB free space  Video: NVIDIA Geforce GTX 1060, AMD Radeon RX 580 or better with at least 4 GB VRAM Network: ADSL connection or faster",
    "reviews": [
        {
            "review_text": "Sub this game if:  -You dont value any kind of social life -You want to play a true sandbox game -You dont want a mindless faceroll where you get rewarded for minimal effort -You like teamwork and a mature, unique community -You want a deep, complex game with a steep learning curve -You like to be challenged to think and plan  I joined a nullsec alliance after 2 months, in my first week I was in a pvp brawl with 1100 people  The mechanics arent perfect but the devs are making improvements all the time and expansions are free every month  11/10 Best game i ever played",
            "review_score": "1"
        },
        {
            "review_text": "Crack is less addictive. Crack will probably also keep more of your social life intact. Crack might also be less destructive to your manners, behaviour, integrity and general well-being. EVE turns decent people into sociaopathic outcasts in a couple of days.  If you have to choose between EVE and Crack, choose Crack.   You'll thank me later  o7     (Eh, who am i kidding. Get in there.)",
            "review_score": "1"
        },
        {
            "review_text": "Kids, do drugs instead of this game, you'll thank me later.",
            "review_score": "1"
        },
        {
            "review_text": "it's alright i guess",
            "review_score": "1"
        },
        {
            "review_text": "On it's surface, EVE Online doesn't seem to be a very 'Immersive' game... No voiced dialog; a steep learning curve; unforgiving gameplay; limited Character Customisation; you can only walk around in one empty room in the entire game; other players are just profile pictures with descriptions and stats; there's no real storyline; there's not even a way to manually pilot your own spaceship.   Yet, somehow, at some point you begin to view  your own universe  as relatively   less  Immersive  compared to EVE.  You'll find yourself complaining that your entire life is spent on one single  High-Sec  system's planet, wasting your precious time in  tedious tutorials  on how to make money in a ruthlessly competitive world of  confusing spreadsheets  and market fluctuations in the endless pursuit of ever-climbing costs for your technologically-dependent way of life. You'll notice that people no longer speak, they just become dehumanised slaves to one corporate entity or another, each trying to validate their existence with some esoteric expression of individuality. None knowing what they really want, but everyone repeating the same mistakes, standing on the broken backs of others, in their fruitless attempts to attain it. Watching  every   transitory   obstruction  between you and your elusive happiness give way to another two greater barriers, you eventually look back and say:  'I could be playing EVE'.",
            "review_score": "1"
        },
        {
            "review_text": "“It was the best of games, it was the worst of games.”  EVE online is a massively multiplayer online resource management, economic simulator, tactical / strategical space combat social sandbox video game. You don’t play this game because you enjoy every moment, you play it because you know that at some point between vast vistas of emptiness something may happen that changes in-game history. That you may be a part of that change. You play it because it helps refine and maintain skills that you can apply in real life. You play it because you are a part of it as much as it is a part of you. If you come into EVE expecting a game with your goals clearly defined and the ability to assert power through in-game mechanics then you have set yourself up to fail. Much as the EVE wormhole led mankind to New Eden, EVE Online is a portal through which we the players are thrust, left to create a narrative that transcends the confines of the game client. EVE is unforgiving in that you may find yourself stuck forever in hi-sec performing mundane tasks, leading you to have a poor experience. But likewise if you have the motivation, the focus and the dedication you can learn how the game works and exploit it to your benefit. Just as Veldspar is an in-game resource, so is the miner who gathers it. Governing bodies are formed by real people, held together by real networks and real ideals. EVE Online is a game that demands the player to think 5 steps ahead. To prioritise and to plan. To think for themselves. For some this is asking too much. For others it is the only game worth playing.  10/10 would think for myself again.  o7",
            "review_score": "1"
        },
        {
            "review_text": "It's decent.",
            "review_score": "1"
        },
        {
            "review_text": "Eve is more of a job than my job. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Am Long time EVE Online player. As whole you start out and first thing you'll notice is all the menu and option windows. You will think that all menu and window confusing at first but once you set a path for yourself you'll find that menu and option windows be less scary. Once get a grip to how all menu work you'll find that game itself is GREAT FUN!. They say that get into larger ship take very long time, 'THIS IS NOT TRUE'. If you know what ship want to fly you can spent the skill points aiming toward that ship and not mind taking points in any other skill. As you start out you will get skill points given to you AND get 14 day booster that help with skill training. A good pilot will be able go from day 1 in friget to day 30 into battle crusier AND by 1 year you'll able to fly a full spec out battle ship with all trimming, 'even fuzzy dice hang from window of cocpit'.  Graphics: 89%, no matter what you do in Eve online it always looks pretty.  Music&amp;Sound Effects: 71%, audio on Eve online is well thought out and rare thing, full 3d sound and can even hear your engie on ship running and rawr of rocket heading toward you.  Controls: 90%, Eve online is point and click game for most part BUT can custom build key bind to whatever feel you need it to be, want buttion that fire all weapon? you can, want buttion that lock all enemrys? you can.  OVERALL: 98%, Eve online wonderful game that can be pick up very quick AND even after logged off from game, your char still continue on with buiness getting skill, making money off market, building BIGGER BETTER MORE POWERFUL SHIPS!  BAD POINTS. I could suger coat this and say Eve has no down side but it wouldn't be real review so. EVE Online has many down sides, specialy on Steam. I found that could buy 1 plex off steam store, am sure will be fixed at somepoint. Like I said above Eve has alot menu and option windows, I try open all windows once and found was 73 windows just in docking area, it is nightmare trying bring up market window, buy item and move item to ship hanger which might put alot players off, 'not me however'. Eve online to Eve Steam online, this I have found be very odd thing, Eve online support service I found to be VERY FRIENDLY but when say your steam user thing can get abit confusing. I try ask number of question about this and found lack of info to be SHOCKING!.",
            "review_score": "1"
        },
        {
            "review_text": "If you decide to invest your time in eve, know this, you're going to be thrown into a world teeming with content and other players going about their business. You won't have any clue what's going on, or what you need to do. And honestly, that doesn't change, I've been playing the game for two years and only know what I chose to specialize in. It will be overwhelming at first, but if you dedicate yourself to learning just the basics of the game, and find some friends to help you, you'll have a rich gaming experience awaiting you for as long as you decide to play. But seriously, don't try to solo this game, at least find some strangers in game to start playing with. Otherwise, you will cry, and you will quit.",
            "review_score": "1"
        },
        {
            "review_text": "I'm falling in love...  Edit* Since I started playing sleep becomes less important.",
            "review_score": "1"
        },
        {
            "review_text": "I play this game since late 2009 and up to now I still have a hard time describing the game to people that have never played EvE before, let alone writing a review about it that does justice to EvE!  In short, you either love EvE or you hate it. This game is not made for the casuals that just wants to have some quick fun in space. This is a hardcore unforgiving MMO where it is possible to lose everything you worked for in the game (years of work even) in a blink of an eye.   Surviving and thriving in EvE is an intelligence game, if you mess up and make a mistake then there are thousands of players that immidiately will try to take advantage of it. And the same goes for yourself as a player, your goal is to take advantage of other players in the game for profit and that does invlolves more than just ship combat. EvE is a beautiful but harsh universe, it is unforgiving and unfair, it is filled with tears of the weak, danger always will await you in space.    If you are cool with all that and are up for the challenge then you should really try the game out. You might love it too!    Edit: grammar",
            "review_score": "1"
        },
        {
            "review_text": "sooooo one does not simply play eve right,,, well let me tell you about my eve experience so far. ive played for a year and 5 month about 6 month of that time was spent inside a station training skills. this game is ruthless and unforgiving. if you are a wow or any other casual mmo player you should click back now. but if you want the challenge , if you wanna feel pain, and suffering , if you wanna feel suicidal, if you want your adrenaline lvls go sky high in pvp battles than install the game and start playing it. the game is what you make out of it, simple as that. i highly recommend this game 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. At first when I tried this game, it came off as boring, but I came back to the game and gave it a real chance and it turned out being super fun.",
            "review_score": "1"
        },
        {
            "review_text": "The most complicated game I ever played.",
            "review_score": "1"
        },
        {
            "review_text": "&gt;Be 18 year old &gt;Be a first year uni student &gt;'EVE Online on sale!' &gt;Buy a month &gt;addicted.jpg &gt;Failing course &gt;Ignoring girlfriend &gt;Alive solely because of Mountain Dew  11/10 would buy again",
            "review_score": "1"
        },
        {
            "review_text": "I've played EVE for months (non-steam), and think it's a nice and deep game. The player-driven economy is incredible (though more to observe than participate in, at this point), exploration and 1vX pvp are very fun.  The difficulty/learning curve is exaggerated greatly in most places (if I have to see that stupid learning curve picture one more time...), the game isn't hard to grasp, it's mostly just poorly explained, and there is a lot of research to be done. If you know how to use a search-engine to answer your questions, the game becomes rather straight-forward.  If you plan on joining a nullsec corp and get into fleet pvp asap (which you can do on your first day), I think subscribing to the game is probably worth it. For all other aspirations, while it's true that you can do wormhole exploration in week 1 (I know, I did it), realise that it will take months of passive training (= maintaining active sub) to train up the skills needed to become even remotely competitive in a field. For instance, even if all you want to do is 1v1 pvp in frigates, you will need a lot of gunnery skills researched to even be able to use T2 guns and ammo, not to mention the passives like tracking speed, etc, which you will need to compete with people who have been playing the game for years.  tl;dr: if you know how to help yourself, and if you come to the game with the knowledge that it is a time investment, I can absolutely recommend EVE Online.",
            "review_score": "1"
        },
        {
            "review_text": "EVE is love. EVE is life. #nowifenow",
            "review_score": "1"
        },
        {
            "review_text": "Its not really that fun.",
            "review_score": "1"
        },
        {
            "review_text": "new player-unfriendly, especially if you want solo. But it's a fun game and will ♥♥♥♥ u off",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would play if I were immortal and unemployed",
            "review_score": "1"
        },
        {
            "review_text": "Been playing eve for 3 weeks now, game's learning curve is as they say insanly high. After 2 weeks wandering around not knowing what I'm doing, I am realy starting to enjoy the game.. Once you get past a big chunk of the learning, game realy gets enjoyable! Absolutly gonne recommend this game to my friends, I just hope they get past the curve! :)",
            "review_score": "1"
        },
        {
            "review_text": "good corp+ paitent+ nice friends =good game",
            "review_score": "1"
        },
        {
            "review_text": "Oh god EVE Online Changed my life, i havent seen the sun in 3 years.  Its the most epic mmorpg game out there. You need to give it some time in the beginning, it can be hard to learn and understand all the functions and mechanics. My tips is get into a good corp that helps new guys and from there on it will be just amazing!",
            "review_score": "1"
        },
        {
            "review_text": "It's a little too early yet for me to begin an indepth review of what appears to me to be an intrigueing and complex game. However, I have found it EXTREMELY useful playing with an experienced player using PC to PC Skype (audio) for guidance. The menu system is daunting but having someone during play to speak to and, hence, offer step by step instructions has made it a lot easier to cope with the complexities.  Eve is deep embracing a wide range of challenges and approaches with room for 'sand play' as well as direct action/conflict.  Not all players are out to blow you to oblivion or steal your money with scams - many are very benign and will help out (sometimes giving you useful items). It's heaven and hell out there; but currently, it seems well worth the effort.",
            "review_score": "1"
        },
        {
            "review_text": "How do you summarize a game that can be played in a million different ways - even when the game is not even turned on?   I care about kills because I'm PvP oriented and I like green entries on my Killboard - maybe totally lame for a high-margin market trader or some sneaky explorer etc. Losing a ship in the early stages can be painful, you just spent maybe half your fortune on that thing. But here is the thing - maybe it was your own fault. You start in High-Security Systems in which you are kind of protected against random agressions (if you buy PLEX and sell those to get a lot of ingame currency and then buy really expensive stuff and put it in your cargo you have a huge Target on your back - don't do that), but if you go into low-sec or null-sec (or spooky spooky wormholes), people will engage you and murder you if you are not associated with them - chances are pretty slim that somebody lets you walk - what might happen is that people see that you are new and send you some money after they killed your ship and your capsule.  EvE is hard and there can be many reasons why you might quit early on. Frustration because of missing knowledge or boredom because you hang out in your Beginners-Mining Ship (Venture) and hack away at an Asteroid for a laughable reward. While frustration and boredom might be initial reasons to quit (among other things) these factors can be a constant threat to your enjoyment of the game. But here is the thing - you can decide how you play this game and how you want to spent your time. PvP, doing Missions for Agents, Mining, Building, Trading, Exploring etc.  Are you artistic and like doing things in GIMP or Photoshop? Create an interesting/funny/serious poster for your Corp or Alliance and receive ISK for it. You are an IT-Guy/Gal who can set up Stuff for your Corp/Alliance - expect ISK raining down from the heavens. Eve extends vastly over the Game itself, more than maybe any other Game.   If you are new to Eve here are some Guidelines:  - The start is not user friendly and it can be overwhelming (I wanted to punch my screen when I started and I was supposed to scan something). It ♥♥♥♥ing sucks, but hang in there. - Don't trust anyone, but also join a Corp, built relationships, think ahead while interacting. If something is free or too good to be true it's most likely a scam. Ask in-Game for help - also EvE University, Pandemic Horde, Karmafleet etc. are a few of the big Beginner-friendly Alliances, which are also involved in big fights. But don't overlook smaller Corporations or Alliances, there might be a perfect one for you out there. Additionally Corps, Alliances or single Persons can be pretty toxic, if something is not for you leave and search for greener pastures - because some people are ♥♥♥♥ing awful (not League of Legends awful, but still). - Don't fly around in Ships you can't replace / Don't buy Items with real world Money and fly them around (Plex and Skillinjectors is a nono in the cargohold - exceptions may apply here). - You are 'safe' nowhere, but outside of High-Sec (read it up) you are freely engageable. - Play EvE if you have the time and you want vast and slightly complicated - if you don't want a doughnut but go to the bakery to get a doughnut and write then a bad yelp review for the bakery you are just the worst kind of person. - Reviews and the enforcement of an opinionated culture are a platonic nightmare... We are all doomed. ♥ ♥ ♥",
            "review_score": "1"
        },
        {
            "review_text": "9.3/10 - Best Space Game Around  It's not Star Trek.. but it may be better! Countless high detail galaxies, upgradable ships, corporations and more. The best space based game I have ever played.  This is a monthly subscription though which causes me to stop playing after my steam deals expire. 'Plex' or month subscriptions are about $15/mo.  Look to grab this game on steam for about $15 which includes a few month bundle. Play hard then disgard or subscribe.     Accidently Reviewed",
            "review_score": "1"
        },
        {
            "review_text": "ZZzzZZzzzzZZZZzzz. i think i watched more porn while playing this game then any other time.",
            "review_score": "1"
        },
        {
            "review_text": "'addicting' isn't a strong enough word  This game is not for everyone. It doesn't hold your hand. It doesn't lead you by the nose. It does not have mercy for those not willing to put in effort to gain anything.   Pros: Beautiful scenery. Literal galactic vistas that can be more beautiful than your own night sky. Highly detailed ships. (So detailed you can identify what the armament is by looking at them.) VAST OPEN SPACE.. over 7500 different systems to explore and get blown up in. There is something for every play style: PVP, PVE, Marketing, Mining, Industry, Research, Exploration (that pays!), manufacturing, and even more. Constantly evolving game with direct player influence over everything in the game and a great deal of player influence on further game development. It's not, nor will it ever be, dumbed down to make it easier.  Cons: This game is one of the most unforgiving MMOs out there. If you blow up your big fancy ship that you worked months to save up for and trained to fly.. Too bad. It's gone now. Have to buy a new one. And if you had implants, they're gone now too. No magical respawn where you appear in a 'safe zone' complete with your newly rebuilt ship. Nope, you regain consciousness in your home station.. Naked, and with only what's left in your hangar. Sucks to be you. Another con.. players can be giant jerks sometimes and scamming is rampant in the trade hubs. The devs take a very hands-off approach to this. So be wary about deals that seem to good and read every detail of contracts.  I can not stress enough how much I love this game. It's not for everyone. If you played WoW or other simplistic MMOs.. this is like driving in a goKart and suddenly being handed the keys to the space shuttle. Its awesome but you have the learning curve of a baby bird getting punted out of it's nest!   They have made great strides in trying to make it new player friendly without dumbing down the game. I think you'll be pleasantly surprised.",
            "review_score": "1"
        },
        {
            "review_text": "from I was so young that I can't remember how old I was back then till now I still love space open world and complex game type, Eve Online is a massively multiplayer game on space that the system and the mechanic is so complex so I'd recommend this game because Eve Online have something that I want and that I need...",
            "review_score": "1"
        },
        {
            "review_text": "10 years EVE has been around.  10 years and still going strong.  More than just going strong, this game has a learning curve like no other and when you finally get your first PVP kill, it feels like you've acomplished more than right clicking a menu option.  Don't let the learning curve deter you though. The options are endless in the Sandbox. Personally I love the epic sized fleet battles that come with null sec when your hands start jittering and pulse is racing.",
            "review_score": "1"
        },
        {
            "review_text": "(Deep breath)  Do you know that feeling, when something gets under your skin so badly, that you can't help but want it more, and more? For me, EVE Online evokes that feeling, which either raises really weird questions about me, or points out the nature of this game.  The devs have done a wonderful job in smoothing out the early learning curve, which was a main frustration point for new players. Sure, it's still steep, but now if you can learn to read, the game actually teaches you the basics. Emphasis on 'the basis'. The game is still far, far away from holding your hand, which I do adore.  However, the game is still  extremely  harsh when it comes to penalties. Most of the major penalties can be avoided to some extent; insurance will pay for your ship if you're blown to smithereens (you still lose your junk on the ship, though), having an up-to-date clone will prevent skill loss (you still lose your implants). Death IS essentially just a slap on the wrist... If you make sure that your backup assets are sufficient, and active. Otherwise... Well, I hope you enjoy sitting in your rookie ship again.  The skill system is still as in-depth as it always was; the metagame is still as enticing as it always was. You are, as always, free to pursue whatever path you desire. There's no such thing as an unviable playstyle.  ... Just remember that at the core, this game is still about people.  And people never change. They'll always be  @ssholes .",
            "review_score": "1"
        },
        {
            "review_text": "Internet spaceships, they're serious business! A great MMO, but king of the learning-curves!",
            "review_score": "1"
        },
        {
            "review_text": "Ok so i promised i would wrtite a review when i had a few more hours under my belt before writing this, so i understand enough to give a basic opinion without sounding like another fanboy.  One of my only problems in terms of bugs was in the character creation screen. It requires you to complete all the steps, and i mean ALL THE STEPS, to finish. Thats only part of the problem. When i wanted to continue after creating my characters appearance, it told me i couldnt because i hadnt selected footwear. Lo and behold, THERE WAS NO FOOTWEAR SELECTION MENU. After spending about 10 minutes browsing everything it had to offer, i had to eventually restart the game and redo the process. It worked the second time through.  Ok so i spawn in and i thought 'Wait how does this work, its all complicated and stuff and my tiny brain cant understand these complex controls that i dont know are complex or not until i finish the tutorials!' (I said all of that out loud, alone, in my room guys. 100%.) However, the tutorial is very simple, step-by-step and thorough. Its not annoying either. Every time you complete a part of the tutorial (which doesnt take long), it asks you if you want to skip the rest. If you are new, i dont reccomend skipping.  The community, from what i have seen, is very kind (or just stays out of other peoples way). Theres even an entire chat channel called 'rookie help' where dedicated admins answer all your questions. I found it helpful on two seperate occasions.   There is an entire market system which is how any money you make (at least in the beginning) comes from. From what i have heard and read in the negative reviews, there are griefers who like to trash newbies ships for scrap. However, there is a VERY effective police force (at least in the gallente systems) called the CONCORD, which will effectively destroy anyone showing player-on-player violence. And there are sentry guns. I made my home station (the station i use for buying, selling, and storage and other services) the Federal Naval Acadamy in the Duripant system. There is a large asteroid field filled with Veldspar, which i can run out and mine for about 20,000 ISK (in game money used in EVE).  However, i realize this is very opinionated, which brings me to my next point; DONT BUY THIS IF YOU ARENT WILLING TO SPEND AN HOUR OR TWO LEARNING, AND WAITING AROUND AND REPEATING CERTAIN PROCESSES TO REACH A MORE GLORIOUS ROLE. Eventually, i plan on fighting for the Gallente, but i need a bigger more powerful ship and crew for that, and those are expensive.  TL:DR; This game is perfect if you are looking for an expansive, open-universe, independent and cooperative space exploration and combat-oriented game that is playable for hours on end if you get interested. Otherwise, its probably a waste of time. Then again. you can always refund.",
            "review_score": "1"
        },
        {
            "review_text": "I have so many hours on this game with the non steam client it's crazy.  When I first joined the game I joined a small mining corp and mined my mind to mush for about a year and a half. After getting bored of that I moved onto low sec and tried PVP which I was horrible with. Spent some time there and started a small corp with my brother and some random guy I bumped into in a station.  Then I joined Reddit and found out about Dreddit, moved to null and started blasting people in massive fleets! Got kicked out of null, lost all our sov and were stuck doing Faction warfare, ♥♥♥♥♥♥♥ off people with triple stabbed frigates and making butt loats of ISK.  Finally joined back with my alpha clone and got my first solo capsule kill since 2012, and am back to ratting.   EVE is my second home.",
            "review_score": "1"
        },
        {
            "review_text": "Steep learning curve. Find yourself a corporation and you'll see how amazing this game really is :)",
            "review_score": "1"
        },
        {
            "review_text": "Eve is a black hole ",
            "review_score": "1"
        },
        {
            "review_text": "A game that I always go back to and a universe I always follow even when I don't play.",
            "review_score": "1"
        },
        {
            "review_text": "Spreadsheet simulator was an enjoyable experience as long as it lasted.",
            "review_score": "1"
        },
        {
            "review_text": "This is not a game. This is your 2nd life. In Space.",
            "review_score": "1"
        },
        {
            "review_text": "Space... Am I right?",
            "review_score": "1"
        },
        {
            "review_text": "I heard you like spreadsheets so we put a video game into your Excel so you can spreadsheet while you play video games.",
            "review_score": "1"
        },
        {
            "review_text": "Its hard to review a game which has no peers. This game started as a project to create a universe. not some simple game universe where you are a mere tourist like in normal games, but a true universe where you have an actual impact. You don't just play eve, you live it. The entire game is built around giving the players control and as time goes players get more and more controll over the universe.  I could go and talk about how unforgiving the game can be to those who are careless or get to greedy (most oftenly a combination of the 2), but you shouldn't form a oppinion based on the reviews. You should experience it yourself firsthand trough the  FREE TRIAL  they always offer. I admit 2 weeks (or 3 if you ask a friend for a trial) isn't much to explore everything eve has to offer, but it should give you a better idea then any Review can give and help decide wether to give the game a chance or wether it isn't your thing afterall. This game isn't for everyone in the end",
            "review_score": "1"
        },
        {
            "review_text": "Really immersive sci-fi MMO. Don't let the skill curve fool you! There are plenty of resources you can read that will tell you how to get in the action in your first week of flying! Every ship counts! There is always a group of players that will take you in! Eve online is a game that truley lets you play how you want to play, you can follow any path you want! The choice is yours!   Fly Safe! 07",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best games I have ever played. If you are looking for an intuitive MMO that never runs our of new content or layers of complexity, this game is for you.  At the same, this game can be very intense and very casual, both of which are great aspects of the game. You can spend passive time mining and traveling which is nicely accompanied by great music and beautiful sights.   The PVP is crazy fun and intense as well as the mining, manufacturing and marketing aspects of the game.  The player controlled 'guilds' called corporations add another layer of fun to the game, creating leadership roles, support roles and all sorts of other cooperative efforts.  This has quickly became one of my favorite games, and the $15 subscription fee is well worth the price.",
            "review_score": "1"
        },
        {
            "review_text": "It takes some time to learn the basics of the game. But after that there is a great MMO to be played. Awesome player driven market, beatifull places to visit in space and hardcore pvp.",
            "review_score": "1"
        },
        {
            "review_text": "ITS IMMERSIVE AS HEAVEN",
            "review_score": "1"
        },
        {
            "review_text": "The most mindblowingly complex game I've ever played. Steep learning curve but massively rewarding once you've gotten the hang of it...",
            "review_score": "1"
        },
        {
            "review_text": "I played a little. It was fun.",
            "review_score": "1"
        },
        {
            "review_text": "Most of you have ever play World of Warcraft... now forget everything you know about it's mechanisms because this is entirely different kind of MMO. Tactics, economy and PvP/PvE has totally different meaning here. Epic ship battles, open universe so big that it takes hourse to visit every system (not to mention Wormhole space :D). You can buy your ships, construct other, pirate and kill others, sabotage, do courier missions... and eventually, if you are working hard enough, you play the game for free.",
            "review_score": "1"
        },
        {
            "review_text": "This is an amazing game. With a little bit of time and especially patience, you can make something wonderful from this experience. Don't worry about making enough money to pay for your next month. Rushing will just ruin the fun and magic. :)",
            "review_score": "1"
        },
        {
            "review_text": "Not everyone's MMO. Its basically a bunch of neckbeards who take internet spaceship empires seriously. EVE is real. 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "v.good game very complex and indepth with millions of possibilites where the universe is controlled by the out come of players actions",
            "review_score": "1"
        },
        {
            "review_text": "If you love space, if you love micromanagement, if you like to get a challenge, Eve is your game",
            "review_score": "1"
        },
        {
            "review_text": "if you got lots of time and can make it pass 100hours. yeah go play!",
            "review_score": "1"
        },
        {
            "review_text": "Been playing a lot of EvE Online lately. I'm definately enjoying it, sandbox MMO works well for me.  From the player driven economy that plays a lot like a stock market, to the PVP which is an ever present threat.  There is no grinding out levels like in traditional MMO, which is something I both like about EvE and somewhat dislike. When first creating an account you can boost the training speed of one character significantly for a while, letting you unlock some good skills early and quickly. It's important to figure out what you want to do in the game and develop your training plan accordingly, so you don't waste time training skills that you otherwise don't need to be able to pilot your ship well.",
            "review_score": "1"
        },
        {
            "review_text": "It's a sexy graphical frontend for Excel in space.",
            "review_score": "1"
        },
        {
            "review_text": "Just started playing, already love it. If you want a completely open, no handicaps, space sandbox with all the fun and despair of mmo pvp coop play, buy this game",
            "review_score": "1"
        },
        {
            "review_text": "Extremely fun once you get the hang of it. Huge sandbox of a game and anything you do isn't wrong.",
            "review_score": "1"
        },
        {
            "review_text": "Nazis in space.",
            "review_score": "1"
        },
        {
            "review_text": "Best sandbox out there.",
            "review_score": "1"
        },
        {
            "review_text": "New to the game enjoy it so far, space battle are very sweet! + it's free to play now :)",
            "review_score": "1"
        },
        {
            "review_text": "It's hard to describe EVE properly in a review as the game is completely different for everyone, you are given a framework (should you do the tutorial missions) of what you can do to give you an idea of roles that you can take on but you are not forced into anything, EVE is what you make of it.  You can sit in hi-sec relativley safe and run missions, mine ore, play the market, craft things to sell, run cargo for players, defend people, explore and more. That's pretty much more than most games like this offer, and that is just hi-sec.  Should you want to be a bit more daring, earn more money, blow up some people then enter low-sec and null-sec...  This is for me where the fun is, you get all of the above and more, join a corporation, defend your systems, enter faction warfare, mine ore that sells for millions, scan down combat / data / relic sites to earn a fortune or hell monopolise the corner of a market.   Like I said it's hard to describe because everyone has their own way of playing the game and enjoys different things.  I've tried a lot of things in EVE, some that I thought would be boring as hell that turned out to actually be really fun - This sentence has never rung more true for the actual game, I thought it would be boring but god damn I love it and every person I have introduced to it has thought the same and stayed!  Give EVE a shot, try and play with a friend or ask the amazing community in rookie help should you need any help, plenty of corps take in new players and are very helpful.  Fly safe o7",
            "review_score": "1"
        },
        {
            "review_text": "Space Chronicles of Elyria",
            "review_score": "1"
        },
        {
            "review_text": "I have tried to play this game many times just to find it to confusing and boring. IDK if i just matured but now find the games combat system, strategic and interesting, and i now find it grips me and i love the sheer possibilites for any player to do anything. I am still very new to this game even with 45 hours under my belt there is so much to learn. For anyone who likes space and is bored or traditional MMO's, I highly recommend this game.   The only negative i really have for this game is how long the tutorial is, and the learning curve is crazy steep, but if you put the time into it, It's a great experience. ",
            "review_score": "1"
        },
        {
            "review_text": "EVE Online is a game where I consistently see '2000 hours played, thumbs down' in the reviews. Well, this game is amazing, atleast from a shear data standpoint. Everything is on one server internationally (excluding China because of internet use laws) and every descision impacts the universe in some way. I am not going to lie by saying this game is easy, its a hard game! Also, the game discerns between the competent and incompetent people who play it. Do not take this the wrong way, but if you want to be generally successful in this game, you gotta be competent, or follow orders well. This game, like every game, has a darkside, but that darkside takes the form of certain player-bases rather than because of the game itself.   So I am gonna give this game what it deserves, my thumb up (because im only using one thumb).",
            "review_score": "1"
        },
        {
            "review_text": "I expected another MMO that took your money and gave you basic gameplay like every other MMO has with no originality or differenece maker. Let me tell you from experience it certainly can stand on its own. This game may be difficult for newbies to learn, but is worth it. They always say EVE has a learning CLIFF not a learning curve. Once you get past that the game can be A LOT of fun. One thing I did enjoy is, if you dont have friends that play it essentially can be played alone. Not as easy when you go lone wolf but its still a lot of fun and can keep you busy. The game has MANY ships you learn to fly and very unique and large skill tree and skill learning system. This also a game you can essentially play for a few minutes and then get off while your character still learns new skills (if you have it in queue that is). If you do have friends that would like to play this or do, this game can suck A LOT of your time so be ready to be committed and have a lot of time on your hands. Be ready to emmerse yourself into a rich economic and war gameplay. This game is definitely worth a try. Even for only a month.",
            "review_score": "1"
        },
        {
            "review_text": "A terrible game for terrible people. Perfect for the antisocial sociopath in you!",
            "review_score": "1"
        },
        {
            "review_text": "EvE is a very unique game. It is a sandbox, with doors open towards every path you want to take, and that can be anything really as the training, the gameplay, and the people that keep you company are just some of the things that you can decide. The market is phenominal as it is a player run economy, with inflation, prices increasing and decreasing all depending on the supply and demand of PLEX as well as the in-game items/materials. I'm not saying this game is for everyone, but that doesn't mean that everyone shouldn't try it out as there is a free 14 day trial (could be 20 if you have a friend) which allows you to try out the game even if it is simply to admire the amazing graphical design that it has. Also, the fact that you can pay for your monthly fee through in-game currency is freaking epic!! ",
            "review_score": "1"
        },
        {
            "review_text": "EVE Online is the best MMO out there. This is a lofty statement, but a true one. It is a higher class of game for a higher class of PC gamer. It has been in continual development for the past 10 years, where is has been polished to its current mirror-like sheen.  EVE is not a grind, you do not have to grind for experiance, it accumulates over time. The only possible way to grind is to grind shooting NPC pirates or mining, but that is by no means mandatory. There are creative ways to make money, or in some cases, relieveing other people of their money. Almost everything is legal, scamming is encouraged.  The real meat of the game is in its player driven content. The world is shaped by the players, both the economic, and political world, in a way that other static content games can't even begin to approach.  It's not a game for everybody, but if any of that sounded appealing to you, you should try it.",
            "review_score": "1"
        },
        {
            "review_text": "Love it!",
            "review_score": "1"
        },
        {
            "review_text": "This game. Is absolutely amazing. If you like missiles, space, lasers, huge fights between two alliances with over 1,000s of players? then this game is for you. But don't expect to get into that just yet. This game has skills you train, ranks you go through in corporations. Everything. Overall this game is AMAZING!",
            "review_score": "1"
        },
        {
            "review_text": "It's like middle school, except in space. Bullies (gankers), jocks (null sec/sov), nerds (miners/indy), etc. All trying to make a life in a harsh world.  Also has robot zombies trying to steal your body. #drifterlivesmatter",
            "review_score": "1"
        },
        {
            "review_text": "If you have the time this is the best game in the world",
            "review_score": "1"
        },
        {
            "review_text": "Very awesome graphics and gameplay!",
            "review_score": "1"
        },
        {
            "review_text": "So far one of the best mmo's out there. Needs alot of time and dedication to be succesfull. Sanboxyness causes many players quit after one month. learning curve of eve is also one of the reasons why someone would quit, its extremely hard to master. At the end if you are succesfull you can pay your gametime via ingame 'PLEX' gametime system. ",
            "review_score": "1"
        },
        {
            "review_text": "Just play it and find out.   10/10.",
            "review_score": "1"
        },
        {
            "review_text": "Best game ever didn't play much on steam but on independent client.",
            "review_score": "1"
        },
        {
            "review_text": "Just took a 40 man fleet out, got the whole fleet killed, ♥♥♥♥♥ commenced  10/10",
            "review_score": "1"
        },
        {
            "review_text": "You'll need to dedicate a lot of time to master this game.",
            "review_score": "1"
        },
        {
            "review_text": "The best virtual-life experience out there. That comes with ups and downs, which I will try to point out throughout the review.  First of all, it's a sandbox game so do not expect to have a clear purpose in your EVE-life. There are so many different careers you can choose from that you won't ever fully explore and know them all. It could take anything from months to years to fully understand and master every aspect of the game (and I'd be happy to laugh at anyone claiming that). One of the most hilarious reviews I've read about this game was 'I think I'm starting to get it' by a person with 1400+ hours on record (it should be somewhere in the reviews section). The thing is, it might not be too far from the truth. There's always something new to learn about the game, something interesting to read about. I always find myself having a few tabs open in my browser with articles, guides, forums, all related to the game, trying to stack up on knowledge to better understand different aspects of the game. However, don't think that you can't enjoy the game early on. I've been enjoying it from day one and having fun ever since. And if you don't like what you're doing anymore, just drop it and start doing something else. It's best to try out different things so that you can find out what you like doing most; and you can always come back to what you were doing, it's a sandbox, remember?  Second of all, it's a complex game that requires seriousness, patience and attention, to say the least. There's times for just having fun and not caring what's going to happen, and there's times when you have to be dead serious and can't even blink, all while your heart's racing to a -maybe even- dangerous level. There's times when you're wandering solo in dead silence, looking for that big prize that you're hoping to find before anyone sees you and there's times when you're running in a big fleet, everyone hooked up to a voice chat and you feel the adrenaline rush of being in the same space as dozens, maybe hundreds or (why not?) even thousands of other ships and you're just stunned by the view and scenery, trying to keep up and make the best of it while also making it back alive.  Third of all, it's all run by the community. From the ship you're flying to the modules you've eqquiped it with to the very market you use everyday and all the way to the stations (and lately citadels) that you're docking up into. It's all planned, constructed and placed by the community (except the initial NPC stuff already in-place of course, but that's only a small portion of it); and let's not forget it is all priced by the community as well, as the market is as realistic as real life markets in many if not most aspects, always being influenced by events and everything that's happening in the EVE universe. And there's also the aspect of corps, alliances and coalitions, which along with everything said above merge into the best game stories I've ever read and could fill out whole books. (oh, wait, it already has!).  All in all, it's a unique game that gives a unique feeling and experience which cannot be found in any other game. Its harsh world and complexity make it a hard game, but the satisfaction you get for acomplishments definitely makes it worthwile. That being said, it's not a game for everyone. However, everyone  should  try it out and if you remember to keep an open mind, who knows, maybe you'll find that it was the best decision in your gaming life.  Pros:  unique experience you can't find anywhere else  great mechanics  high complexity  run by the community  stunning views and scenery  story rich (mostly made by the community)  Cons:  time consuming  subscription-based (can be ruled out by paying with in-game currency)  can seem harder at first   Rated 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Real life is now meaningless.",
            "review_score": "1"
        },
        {
            "review_text": "EVE Online is about spaceships and doing what ever you want",
            "review_score": "1"
        },
        {
            "review_text": "Such an Amazing game the game makes everything feel real! could not be happier only been playing a month and already have 350 hours of game time im hooked",
            "review_score": "1"
        },
        {
            "review_text": "Fly safe, or dangerous.... Your choice.  You'll either love it or hate it. Probably both at the same time.  Did enjoy, will play again.",
            "review_score": "1"
        },
        {
            "review_text": "This game is definitely worth your time if you're willing to put the time into it. It is a fantastic game where a multitude of things can happen.it is basically a simulation life in space will be like one day.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best MMOs to date. Deep and complex ship customization with an extremely well done player economy.  Unless you're currently suffering from a brain hemorrhage. In which case you're this guy.   Chrøme 2 hours ago  sorry but wow &gt; eve",
            "review_score": "1"
        },
        {
            "review_text": "Player-run politics, player-run economy, player-run EVERYTHING.  It's pretty great if you're into games that reward you for being slow and deliberate.",
            "review_score": "1"
        },
        {
            "review_text": "'Scramble his warp, orbit at 15km and fire all cannons! Once his ship is destroyed let him watch from his capsule as you salvage the bones of his once mighty ship. Then send probes out to find more gas mining sites. We need to start building our booster factory. We need muscle and funds..cut a deal with some pirates who may be interested in setting up an illegal, profitable operation with us. But trust no one.'  Capsuleer Smoke Reed  this...game..is..awesome yo!",
            "review_score": "1"
        },
        {
            "review_text": "This game is plagued by apathetic devs, horrendous balancing issues and crippling lag and no one should play it.",
            "review_score": "1"
        },
        {
            "review_text": "been here since 2004 before steam. two thuimbs up :)",
            "review_score": "1"
        },
        {
            "review_text": "it is fun",
            "review_score": "1"
        },
        {
            "review_text": "It's hard and unforgiving, The highs and insane and the lows are mind numbing, you'll make friends and enemies alike, all while contributing to the story and history of the EVE universe. Enjoy your newfound lack of a social life.",
            "review_score": "1"
        },
        {
            "review_text": "Home to world record breaking PvP battles in terms of player participation and monetary losses, Eve Online is a polarizing PvP centric MMO that players will either love or hate. Especially new players; most will hate it while some will love it. While commonly described as an MMO and sandbox, a more accurate description of Eve Online may be that it is an economic simulator wrapped in a political simulator with “roguelite” elements. While initially intimidating to new players and overall unforgiving, especially endgame, Eve Online’s developer CCP has created a meritorious masterpiece that has received a bounty of awards since its inception.  The pace of the game will be off-putting to the majority of potential and new players. Unlike the majority of other MMO’s, acquiring new skills and abilities in Eve Online happens in real time; there is no experience to be gained by completing missions or killing rats (NPC’s). Training new skills will take a given amount of time in Eve online, but may be altered by changing a pilot’s attributes, by utilizing implants, which affect training time. Skills in Eve Online may take merely minutes to train or may take months. In ARPG’s, the point of the game is to acquire new, better, and rarer loot. During endgame, the new loot may augment the game in some facets, especially in the case of Path of Exile, but general gameplay elements (endlessly killing monsters) and those of the player’s chosen class largely remain the same creating stale, repetitive gameplay. The seemingly endless amount of skills to train in Eve Online means that there will almost always be something new to do in-game which functions similarly, yet superiorly, to loot in an ARPG.  Gameplay in Eve Online is unique and very much different from other MMO’s; a player cannot move his/her ship using WSAD. Instead, you give commands to your ship, such as “orbit at 30 km,” “approach,” “warp to,” etc. However, you can still double click anywhere in space and your ship will head in that direction. This lack of freedom of movement will also be unappealing to many, but it allows for more tactical gameplay especially in PvP.  PvP is heavily strategy based; an expensive ship can still lose to a relatively cheap one. PvP requires not only an in depth knowledge of what the function is of each ship, but the synergy amongst them. Also, it requires that a pilot know what modules to best fit his/her ship. However, a pilot’s individual mistakes and lack of understanding of the game may be made up for by other players, since PvP battle may consist of several thousand players.  Time Dilation (TiDi), is heralded by CCP as a triumph to reduce lag in epic, expansive battles involving thousands of players. TiDi supposedly reduces the passage of time in the system, where the battle is occurring by up to ten percent as to reduce the stress on the server’s hardware. CCP decided to introduce this so that things players did in the battle would not be processed out of order. However, players who have experienced TiDi will report that actions that would have taken no more than ten seconds instead take between several minutes and up to twenty minutes to complete.  Players are arranged into corporations, corporations may thus be arranged into alliances, alliances may thus be arranged into coalitions; all of which revolve around the economy. These arrangements allow for complex player run governments. These governments vie for control of various systems across the galaxy for the right to harvest various resources. Almost everything in-game can be made by players and then be sold on various markets. Unlike other MMO’s, such as World of Warcraft, the market in Eve Online utilizes a brokerage system akin to that of the stock market.   CCP allows controversial actions such as extortion, thievery, espionage, and scamming in Eve Online. If a player were to do any of these in the majority of other MMO’s, he/she would be facing a permanent ban. These controversial actions fit well into the governmental arrangement of players as well into the occurrences of wars.  The effects of PvP are wide reaching; they can be felt across the game. Such was the case of the costliest battle in Eve Online history; B-R5RB. Prices in in-game markets, especially those in the main trade hub in Jita, fluctuated more than normal allowing traders to secure large profits.  PLEX (Pilot’s License Extension) in Eve Online is analogous to gold in the modern world; PLEX is what determines the worth of ISK. Also, much like gold, the value of PLEX fluctuates. PLEX is an in-game item equivalent to thirty days of game time. It can be bought in-game with ISK, hauled to various markets, and sold. It can also be purchased for twenty dollars. Comparatively, a one month subscription that is instantly activated on an account (not PLEX) costs fifteen dollars. While not free to play, it is more than possible to play Eve Online without having to open a wallet, although this will most likely be difficult in the first few months of a new player’s account.  While not often addressed, Eve Online utilizes many roguelike elements and thus, may be classified as a roguelite. Ships may cost tens of billions of ISK and when they are destroyed in battle, the pilot lose ISK which translates to a few thousand dollars (USD) lost. Those ships take real time to make; potentially thousands of man hours to make and months of waiting for it to roll off of a production line. When they are destroyed, they are gone. There is no respawn; they no longer exist. The most expensive ships are titans, the Death Stars of Eve Online, are worth approximately three thousand dollars. When a ship is destroyed in Eve Online, a pod is ejected containing the pilot. Should a pilot be unable to escape in his/her pod and be killed in battle, he/she loses a clone which may have billions of ISK in implants. The most harrowing of losses, due to mistakes, involve pilots not updating their medical clones to retain the skill points they’ve trained. Should a pilot fail have failed upgrade the clone and be killed, he/she stands to lose millions of skill points which may have taken months to train.  Anyone one can be ganked anywhere by other players. Whether a pilot actively engages in PvP or simply mines asteroids, he/she can be ganked. Systems in Eve Online are assigned a security status. Depending on the security status, the in-game NPC police force, known as CONCORD, may respond and aid the victim by attempting to destroy the aggressor.  Players are most often drawn into the game by the epic, lurid tales they hear of massive battles, espionage, or betrayal. Eve Online is a massive game. While events do occur like these on a daily basis, they are rather uncommon. As a result, many players do not make it past the trial version or tutorial because of this realization, whatever or whoever made them decide to try Eve Online made no mention of the incredibly slow pace, or the unusual and very different gameplay style.  Eve Online is not perfect; no game is. Developer CCP has claimed through its public relations that TiDi is indeed necessary and successful in its purpose. Despite these flaws CCP has done many things right. According to the Guinness World Records Gamer’s Edition 2014, the battle of 6VDT-H in Eve Online reached a total of 4,070 pilots fighting simultaneously, making it the largest PvP battle in history. CCP is one of the few MMO’s that welcomes immoral actions into its core gameplay. Eve Online is a game in which there is an incredible amount of depth as is evident by the way players produce goods, the manner that player governments who want to do so must hold their own territory in which the resources to do so reside, the in-game economy, and the strategies utilized by players in PvP. While the pace will be appalling to some, Eve Online warrants a try from all.",
            "review_score": "1"
        },
        {
            "review_text": "Just 20 hours into this MMO. I already feel like it's definitely best MMO out there. This is what I love to call true MMO sandbox expierence.",
            "review_score": "1"
        },
        {
            "review_text": "EVE is a cool game, as a simple man i thought i would Mc♥♥♥♥ up every part of this game but once the semi-steep learning curve has been passed, this game has awesome depth and parts to it! The ship design is brilliant, the atmosphere and the look of the game is brilliant and it has a nice level of character as well. Don't be scared off by the subscription, you can dip in and out through a leniant subscription plan that you can just get rid of without any trouble! However i would get this game only if you're prepared to understand it and maybe take it slow, some areas (pirate filled, null sec etc.) will mess you up if you're not prepared or lost. But seriously ♥♥♥♥ pirates.",
            "review_score": "1"
        },
        {
            "review_text": "great game. very social. but very very slow. put a year into to. and you will enjoy it. when you can fly the big ships.  its not like war craft were you have to buy the next expantion. also if your good at it it will pay for itself",
            "review_score": "1"
        },
        {
            "review_text": "I like spreadsheets and data. Get used to 'stupid'...",
            "review_score": "1"
        },
        {
            "review_text": "Well 4000 hours in .............. thats all i can say!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Outstanding game. You get lost in this game very easily. Hours of gameplay, very challenging.",
            "review_score": "1"
        },
        {
            "review_text": "just one word to describe AWESOME",
            "review_score": "1"
        },
        {
            "review_text": "Well 4000 hours in .............. thats all i can say!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Love it!",
            "review_score": "1"
        },
        {
            "review_text": "Great game, even though it can be called Excel in space.",
            "review_score": "1"
        },
        {
            "review_text": "There is nothing like this game. It is a vast empty place filled with crazy players in a sandbox setting.",
            "review_score": "1"
        },
        {
            "review_text": "The only MMO to play",
            "review_score": "1"
        },
        {
            "review_text": "So cool...",
            "review_score": "1"
        },
        {
            "review_text": "Best MMO in hands down. Still the best",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game so far what a MASTERPIECE I've been playing just under a month. It requires getting many training manuals for your character (in-game) to train on the necessary skills for a desired path through the game. Basic training includes Jurry Rigging, Energy Weapons, Shields, and Scanners. These training manuals aren't free. They cost many ISK, which can be easily obtained through mining in the first part. There are sufficient enemies lurking about to keep the game interesting and the player aware of the environment, which is constantly changing based upon the players playing the game.",
            "review_score": "1"
        },
        {
            "review_text": "Pure Cancer",
            "review_score": "1"
        },
        {
            "review_text": "  THIS IS A PVP GAME. A PVP THAT YOU CANNOT AVOID",
            "review_score": "1"
        },
        {
            "review_text": "It has space ships.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "  So far so good. Even with startup glitches this game has so much promise that you have to stick with it. I'M HOOKED!",
            "review_score": "1"
        },
        {
            "review_text": "Most Amazing ever to be made",
            "review_score": "1"
        },
        {
            "review_text": "Waaayyyy before it's time!",
            "review_score": "1"
        },
        {
            "review_text": "Although the game does have a steep learning curve (i have to admit that i didn't know what the hell i was doing for the first couple of hours) after giving it some time it does grow on you especially if you spend enough time to understand its numerous functions. However the monthly subscribtion , at least for me, is completely unacceptable. I could accept paying 30-40 $ for the game upfront and even give 10-20 $ a year for major expansions but spending 15 $ per month or 130 $ a year is just too much. If the company reconsiders its pricing policy i would eagerly jump right back in the world of EVE online however as it stands right now i just can't.   Some people might find it strange that i give the game a thumbs up but besides the monthly subscribtion i really liked this game.",
            "review_score": "1"
        },
        {
            "review_text": "What can be said about EVE?  The game is more then a game. EVE confronts you with the absolute freedom to do anything you want, in space. This scares a lot of players as there is no path to follow, you create your own path. The new version of the tutorial is far better then it was ages ago when I started the game and shows off many of the systems the game offers to play in. The stories you've heard of this game about massive wars, huge corp espionage, and massive back-stabbing are all true. The game doesn't punish you for much and even then it is usually just a small decrease in your security rating. Gang teams do roam the 'safe' space areas and will kill you just for giggles. The learning curve of this game is not hard, the hard part is learning to play a game where consequences are real. Your ship got destroyed? It is gone forever, there is no save point to go back to. ♥♥♥♥♥♥ off another player, they may call in friends to grief you, or worse yet blacklist you across their alliance. Jumped into wormhole space and forgot to bookmark the exit? Lol, drift forever until you decide to self-destruct your ship.   What then draws people into this game? The fact the you do impact the overall universe, even if just in the smallest way. You choose to mine your days away? Your new influx of minerals can push down the market costs. Start taking transport jobs? You could be delivering the weapons/equipment an alliance needs to turn the tide of battle in a region of space. Became a pirate? Live on the edge and enjoy the rush of kills and looking over your shoulder.   The game is amazing. I play it for a few months each year because it is a blast to play. I can only do small chuncks of it because I become too involved in it. If you give EVE a chance, it will do the same to you. ",
            "review_score": "1"
        },
        {
            "review_text": "The ultimate space game. The supreme simulator. If you love space, you MUST give it a try. There is no level system, so nothing prevents a new player from opening a can of whoop-♥♥♥ on a veteran if s/he is skilled enough.  However, since there are no aliens, and since space is really, really, REALLY, ridiculously large and empty, you'll get bored REAL FAST (unless you've got contacts and an active Corporation for massive PVPs), since every system looks just like the previous one and single-player missions are repetitive.  But still, a must-try.",
            "review_score": "1"
        },
        {
            "review_text": "  Friend sent it to me during the sale last week. didnt think i would like it, I tried it and fell in love",
            "review_score": "1"
        },
        {
            "review_text": "Best Space sandbox with incredibly large open world and 45th thousands of players on a single server!",
            "review_score": "1"
        },
        {
            "review_text": "Classic EVE, very good way to lose all hope of having a fruitful social life.",
            "review_score": "1"
        },
        {
            "review_text": "Well.. First of all This is really good but if you are a noob and if you don't have a friend that plays this game than you really should not buy it! Cuz its hard to learn yourself ...belive me!",
            "review_score": "1"
        },
        {
            "review_text": "&gt; be me, a newbro &gt; be some ganker, idk &gt; i carry a plex to jita in a badger &gt; boom dead &gt; 10/10",
            "review_score": "1"
        },
        {
            "review_text": "use to play while back.... War never changes",
            "review_score": "1"
        },
        {
            "review_text": "Eve Online is one of those few MMO-RPG's that is actually manipulated and defined by player decisions. The wars, campaigns, skirmishes and everything from trading and mining is done by players. The big wars out in Null-Sec (Zero Security Status Systems which have no protection at all) are all players and their allies fighting over resources and such. You can mine, trade, run businesses, rule factions, declare war, explore new areas and so far all the Expansions are ALL FREE! The game is so huge and if you aren't committed, you won't do as well even in the short run of things. You need to choose carefully what skills need to be looked at, bought and trained. Also, it's good to try and not attack people if you can't back it up nor can you take on the local police in the sector. Travelling, mining, exploring, all of these offer an amazing experience! Eve Online is a fantastic game, but be prepared for a serious challenge!",
            "review_score": "1"
        },
        {
            "review_text": "Amazingly high difficulty curve, but amazingly rewarding in terms of the freedom the game allows. Be prepared to start at the bottom of the totem pole though. Go find a corp and just pilot the small ships for them to begin with.",
            "review_score": "1"
        },
        {
            "review_text": "Best game ever created. You gain a sense of wonder and amazement and manifest destiny while playing this game that i have never experienced before in a game. What you lose, is your real life.  Dont play this game.  Space/10",
            "review_score": "1"
        },
        {
            "review_text": "I managed to play this game thanks to the Steam sale and i liked it as it was rather laid back and chill. I did not prolong my subscription just because i do not have the time to play these days but made it quite far within a month.   I took the miners path and made it quite far within the time i spent in it. But as far as i know i managed to cover like a few per cent of the game content so this game is huge. The risk factor of losing your precious ships surely makes this a dramatic game.  Allows for a lot of flexibility in terms of weather you go for risk and rewards or take the more careful approach.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of those games that divides people. If you like instant action and little thought, then this won't be for you. This is a slow-burning, strategic game. There is plenty of action, but you have to prepare properley, otherwise death is all too easy.   The population tends to be, on average, older than most MMO's as well, probably because of the nature of the game, patience is required if you want to progress. It is a vibrant community, and the game structure lends itself to community action more than any other game.   It is a sandbox type of game, giving the user a whole universe to play in, but also a myriad of professions to take up. Even after several month of playing, I am still learning new things about the trades I have specialised in.   The game has also expanded in many ways over the years, leading to more diversity and a richer universe, with more to come. The design is also incredible, with iconic ships following a set style depe.",
            "review_score": "1"
        },
        {
            "review_text": "As long as you join a decent corpoartion, it will be a lot of fun. This is not a single player game.  Also, Local is primary. 7o",
            "review_score": "1"
        },
        {
            "review_text": "This game is terrible when i click play nothing happens. Ive tried loads of 'fixes' but nothing seems to work.",
            "review_score": "1"
        },
        {
            "review_text": "very nice game rlly enjoying it paying 15 euros a month is totaly worth it i swear",
            "review_score": "1"
        },
        {
            "review_text": "AWESOME! JUST ONE WORD!",
            "review_score": "1"
        },
        {
            "review_text": "AWESOME! JUST ONE WORD!",
            "review_score": "1"
        },
        {
            "review_text": "This game is pretty good, if you had flight control it would be a good game, if you had the abuility to higher npc crew or player crew and control a few ships at once, given you control everythin via buttons and menus it'd be a good game, tbh though been out too long for new players to even bother. The people who've been playing longest have the best stat boosts , the most monney etc... plus they can play for free. I got the game for £3.75 an for that its worth it paying a subscription fee though is massive greed on the part of the dev the game is 11 years old and it looks it , it plays like it , it's not anywhere near where it needs to be and the whole subscption model is outdated anyway. PAY TO WIN would be accurate . For anyone interested in games like this don't buy this buy a modern game that supports the features you want i.e Star Citizen. Fot the price of this game and one PLEX or 1 Mounth Subscription you could get -    ** STAR CITIZEN **    Starting Hangar : Discount  Starting Money: 1,000 UEC  3 Month Insurance  Digital Star Citizen Manual  Squadron 42 Digital Download  Star Citizen Digital Download  Beta Access",
            "review_score": "1"
        },
        {
            "review_text": "This future is fully approved by the Board of Win and is known by the State of California to cause cancer.",
            "review_score": "1"
        },
        {
            "review_text": "its a good game a few bugs here and there but overall good.",
            "review_score": "1"
        },
        {
            "review_text": "try this game",
            "review_score": "1"
        },
        {
            "review_text": "At the start you pay 20 dollars, then you complete start missions. Finally you join corporation and some ♥♥♥♥♥es declare you war. AT THE END U LOST YOUR ♥♥♥♥ING TITAN.  10 TITANTS/10 TITANS",
            "review_score": "1"
        },
        {
            "review_text": "This is the best game I have ever played, for me. It isn't for everyone. But for who it is for, it is amazing.",
            "review_score": "1"
        },
        {
            "review_text": "Long standing space MMO including combat, exploration, industrialization, mining, interaction with planets, and good old fashioned trading. This game has one of the highest learning curves for first time players, but once you start getting comfortable by doing a few missions or reading guides, the game really opens up. If you can dump enough time into the game, eventually you can pay for it with in game currency using the plex system. A solid choice for those who enjoy space games.",
            "review_score": "1"
        },
        {
            "review_text": "i do recomend this game but a word of warning. it will take up your life . this isnt even my only acount. great game hard learning curve.",
            "review_score": "1"
        },
        {
            "review_text": "i see it is about space and i LOVE that but the controls are very hard to find out :/",
            "review_score": "1"
        },
        {
            "review_text": "Timeconsuming game times 200. :) An exciting game if you have alot of free hours. Not a no-and-off game for fast fun or parents with small kids etc. :-)",
            "review_score": "1"
        },
        {
            "review_text": "Becauase as you know, spaceships are serious business. SERIOUS.",
            "review_score": "1"
        },
        {
            "review_text": "Its pretty. Its really freakin pretty. It works on a slow 7 year old computer. THIS. IS. AMAZING.",
            "review_score": "1"
        },
        {
            "review_text": "Nice game",
            "review_score": "1"
        },
        {
            "review_text": "When I first logged in to Eve Online I was excited. Not only was I about to join the most player driven MMO that I've heard of this week, but there was even a local chat for me to meet local singles. My first thought was, “practical online dating in a space sim, what a time to be alive!”  Unfortunately, it turns out that there are less women on here than there are on Ashley Madison, which was a big shocker/disappointment. It also turns out that “local” chat doesn’t connect you with local singles, which I found to be extremely misleading. If CCP can't offer a simple dating service, then what are they doing with my $15 a month!?!?   After receiving a tirade of angry messages from the 'locals', I decided to jump a few systems to Uedama try my hand at mining. These CODE ♥♥♥♥♥ showed up after a little while though, and told me I had to buy a “mining permit,” but I was like “♥♥♥♥ the police, #yolo,” if you know what I mean. That led to me dying even though I was in hi-sec, but I’ll have the last laugh since I reported them. I'm sure the GM's will do something any day now.  Eventually, I got in touch with some great people in Jita, and they told me that they would DOUBLE every single ISK that I sent their way. So obviously I went, bought twenty-five PLEX, sold them, and sent all of my money to my investment manager. He told me that because my investment was so large, it would take at least two weeks to get the funds ready. I’m anxiously awaiting my new fortune.  Anyways, I quit my job yesterday, once I realized that if I play it fulltime I can pay for the game just by playing it. My girlfriend told me that I was an idiot, but we’ll see who’s laughing when I’m a space billionaire… well, if she ever comes back.  Overall, this game is a 25/10. I absolutely recommend this game to anyone who ever thought about liking sci-fi, wanted to join the space mafia, or ever owned a computer.  Update: I NEVER GOT PAID! Update 2: After having a conversation with my investment manager, I straightened out the issue with my finances. I also got into his corporation as a low-level investment consultant. For a limited time, we can offer you a guarantee that if you sent us your ISK, it will be doubled in just one week. Convo me in Jita for details, or just send your ISK right over, you can trust us. GimmieYourISKStupid, is the best ISK doubling service this side of null-sec! ",
            "review_score": "1"
        },
        {
            "review_text": "Great game its good for casual nad full time players cause you can set skills to train and leave it even offline! and then spend time making your money and working as transport, Mining, Creating items and ammo and even fuels and other ships",
            "review_score": "1"
        },
        {
            "review_text": "When I first logged in to Eve Online I was excited. Not only was I about to join the most player driven MMO that I've heard of this week, but there was even a local chat for me to meet local singles. My first thought was, “practical online dating in a space sim, what a time to be alive!”  Unfortunately, it turns out that there are less women on here than there are on Ashley Madison, which was a big shocker/disappointment. It also turns out that “local” chat doesn’t connect you with local singles, which I found to be extremely misleading. If CCP can't offer a simple dating service, then what are they doing with my $15 a month!?!?   After receiving a tirade of angry messages from the 'locals', I decided to jump a few systems to Uedama try my hand at mining. These CODE ♥♥♥♥♥ showed up after a little while though, and told me I had to buy a “mining permit,” but I was like “♥♥♥♥ the police, #yolo,” if you know what I mean. That led to me dying even though I was in hi-sec, but I’ll have the last laugh since I reported them. I'm sure the GM's will do something any day now.  Eventually, I got in touch with some great people in Jita, and they told me that they would DOUBLE every single ISK that I sent their way. So obviously I went, bought twenty-five PLEX, sold them, and sent all of my money to my investment manager. He told me that because my investment was so large, it would take at least two weeks to get the funds ready. I’m anxiously awaiting my new fortune.  Anyways, I quit my job yesterday, once I realized that if I play it fulltime I can pay for the game just by playing it. My girlfriend told me that I was an idiot, but we’ll see who’s laughing when I’m a space billionaire… well, if she ever comes back.  Overall, this game is a 25/10. I absolutely recommend this game to anyone who ever thought about liking sci-fi, wanted to join the space mafia, or ever owned a computer.  Update: I NEVER GOT PAID! Update 2: After having a conversation with my investment manager, I straightened out the issue with my finances. I also got into his corporation as a low-level investment consultant. For a limited time, we can offer you a guarantee that if you sent us your ISK, it will be doubled in just one week. Convo me in Jita for details, or just send your ISK right over, you can trust us. GimmieYourISKStupid, is the best ISK doubling service this side of null-sec! ",
            "review_score": "1"
        },
        {
            "review_text": "ZzzZzzzzZzz Spread sheats in space",
            "review_score": "1"
        },
        {
            "review_text": "This may be the most complicated MMO I've ever played. Yet there is so much to do and so many ways to play this game. A true sandbox.",
            "review_score": "1"
        },
        {
            "review_text": "One of the hardest MMO I ever played, but it's worth to try, play atleast 2-3 hours, longer you play, more addicted you get. Love it so far.",
            "review_score": "1"
        },
        {
            "review_text": "Ding Ding Ding - It's rant time!  After playing 648.8 hours and wasting more than enough money on this game I can assure you, It is a complete waste of time.  Eve Online allows you to:  - Train skills for months on end! (In real time) for little to no reward! - Grind missions for measly amounts of in game currency, which amount to nothing next time some 'veteran' pirate ganker ♥♥♥♥♥♥♥ swings your way - Head into area's of space known as nullsec and lowsec with the promise of attaining great wealth only to be met with gate camp after gatecamp after gate camp, and lets assume you avoid these gate camps, there's no guarantee you wont find yourself at the receiving end of a covert ops bomb launcher. - Engage in cross platform combat with the players of the most generic space fps to release since the dawn of time - Buy a PLEX (Which can be essentially used as a pay to win feature) that gives a considerable amount of in-game currency to ♥♥♥♥ away on the next encounter with your friendly neighborhood ganker. - Shoot a laser at a rock for hours on end to 'mine' minerals from asteroids which you can use to make items or ♥♥♥♥ away on the marketplace. - Be a semi-anonymous sociopath with delusions of grandeur.  There is something EVE Online does very well though: It's very good at attracting megalomaniacal ♥♥♥♥♥♥♥'s to play it, all the newbies get reeled in by the flashy CGI trailers but it really is a trap.  EVE Online - A game for the unemployed, foolish or the mega tolerant.",
            "review_score": "1"
        },
        {
            "review_text": "It's ok.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun but a little laggy, amazing costom gameplay",
            "review_score": "1"
        },
        {
            "review_text": "Only good space MMO",
            "review_score": "1"
        },
        {
            "review_text": "help me to complete specialisation missions",
            "review_score": "1"
        },
        {
            "review_text": "love this game, u can taylor your character to what u want and blow ship up",
            "review_score": "1"
        },
        {
            "review_text": "I played the Game for a long Time.  At the beginning its hard to understand and making your personalized carrier is work of sysiohos :D   BUT in further time you will love it !",
            "review_score": "1"
        },
        {
            "review_text": "This game is very gud. Not spreadsheets required.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game !!! best investment you can ever make !",
            "review_score": "1"
        },
        {
            "review_text": "S'alright",
            "review_score": "1"
        },
        {
            "review_text": "Been playing for 11 years (long time prior to Steam) still cannot fly for crap!",
            "review_score": "1"
        },
        {
            "review_text": "This game is very gud. Not spreadsheets required.",
            "review_score": "1"
        },
        {
            "review_text": "It is good, unfortunately the alphas have a lot of restrictions",
            "review_score": "1"
        },
        {
            "review_text": "Only clocked 180 odd hours, I say only because it does take a while to get the swing of it. The curve may be too much and you may give up but if you dont you will find its like no other. It shadows the majority of my games now, it has to, as it swallows up time like a black hole. (in a good way) If you like Sci Fi I would advise you get this.   if you want fast paced shoot em ups and user friendly simplicity I really wouldnt bother though, its almost like a management sim with awesome graphics.   Everyone plays a part in this, every item you buy someone has manufactured, and every item you sell goes to a real person.   I havent even touched the PvP yet and their famous huge multiplayer space battles you have got utube for that, but you can customise like a mad man, everything. making this very competative so you can go full nerd with this or just like mining and buying big ships and blasting pirates in asteroid belts, like me.",
            "review_score": "1"
        },
        {
            "review_text": "Good Game Great Grafiqs",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Better than league.",
            "review_score": "1"
        },
        {
            "review_text": "Great game",
            "review_score": "1"
        },
        {
            "review_text": "Probably one of the best games I've ever played.",
            "review_score": "1"
        },
        {
            "review_text": "AS fun now as it was in 2003, a bit dry and there have been a few good ones since it came out... old faithfull really :)",
            "review_score": "1"
        },
        {
            "review_text": "'EVE Online is the best game ever' - Ray from Domino's Pizza",
            "review_score": "1"
        },
        {
            "review_text": "Great game",
            "review_score": "1"
        },
        {
            "review_text": "5.9 hours in-game learnt how to crash and loose my ship 10x over.",
            "review_score": "1"
        },
        {
            "review_text": "I got bored as soon as the game loaded in. 10/10 IGN",
            "review_score": "1"
        },
        {
            "review_text": "Best game ive ever played 10/10 on  KylePlaysGames.com ",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ this game No matter how much i win (in arow too). im stuck at MG 2. Today i only lost once 0-16 against a ♥♥♥♥♥♥♥ hacker. deranked to mg 1? ARE YOU ♥♥♥♥ING SERIOUS??? please close this game already as it is already filled full of hackers and smurfs. no matter how much wins you will be stuck in your rank for ever, lose a few = derank inc nice makes sense",
            "review_score": "1"
        },
        {
            "review_text": "EVE Online is the greates sandbox ever created, which is why it has survived for such a long time. Even though Steam says i've played it for a mere 55 hours, that's only the alt i created from steam, I've really played close to 1000 hours. I've played every bit of this game; i was a high-sec mission runner, low sec brawler, part of a null alliance, a mulitboxing miner (got bored of that), an Industrialist, Incursion Runner, you name it, i've done it. This vast experience has showed me that EVE is a game unlike any other I've played, because of the single constant world it allows for great characters tp be developed villians and heroes can arise, and it makes EVE feel like a real place, unlike so many other MMOs. If you have the patience to learn this game, you won't look at any MMO the same way.",
            "review_score": "1"
        },
        {
            "review_text": "MOAR SANDBOX! It is what you make of it. It requires some imagination to set your own objectives and establish your own narrative which is likely why many people have a hard time getting into it.",
            "review_score": "1"
        },
        {
            "review_text": "It has been four months since i started playing eve.I heard about this game through another space mmo called Star Trek Online (a game which i played for 6 years) I finally decided to try eve. I was spawned in a room with a blinking screen showing a battle. The was a overwhelming amount of buttons. Just sorting out what each one was meant for took me 4 hours. I undock to find that my rookie ship (your first ship) was not controlled in the typical way using your w-s-a-d keys. Instead you with your mouse to a point in space and your ship would go there. This was weird and difficult for me to get used to. But after that i was off. I left my academy system for jita (the new york of eve) the trip took me 30 minutes (and that wasnt even through most of the map) There i sold my first plex and decided to call it a day.   For the next few days i spent time talking to the jita community training skills to miminal levels and getting ready to head to the area known as low sec. Jita is a safe trading hub in high sec (as long as your not war deced) High sec space is protected by CONCORD a security force that prevents player to player agression. Low sec does not have that security (this is where pirates and pvp happen's) its every man for himself. I didnt care i fitted a amarr arbitrator cruiser carrier up and flew to low sec where i spent 4 days making money. I made about 7 million isk in my 3 days down there. Since i had sold a plex for 800 something million isk you could imagine how unimpressed i was with that. But anyway one day while i was running mission's a new ship i had never seen before popped up. It was a hurricane. i was eager to see how much money i could get out the ships wreck. But something was wierd the ships name ( i cant remember exactly whats its name was) PopMo maybe? I dont know but i locked it up and began shooting. The person began to talk in local chat and with 15 seconds i was podded. He then preceeded to invite me to join is pirate group (i declined)   This sent me back to high sec where i decided i needed allies while i train to become a pvp pilot. I ended up joining a small nullsec renting mine corp (not what i expected at all) There i was introduced to ratting (Killing npc ships for money rewards) I was making 7 million in 20 minutes with the help of others. That was fun for a while but i began to get bored and enemys were always runing through the systems taking pot shot's at you. but right before i was about to leave the corp. A merger was annouced, We would be joining a much larger alliance in Northern associates space. That alliance had few problems with enemys as they had multiple pvp wings to chase them out. They seemed to be a safe haven compared to our last nullsec location. For about 3 months everything went fine until the phoebe update hit. The region we lived in (detorid/wicked creek) began to destablize the whole of our 130 man alliance became more pvp focused than ever. We found ourself's being forced more and more to fight battle's to fend off russian invaders in distant systems. But over time that distance became smaller until they were knocking upon our doorstep. we fought until the very last second. We even dropped a elite group of pvpers onto the russians in one battle to get them to go away. But it didnt work. We were evacuating when we all realized who really was our enemy. The Empire which had control all space around us (N3) suddenly we found ourselfs enemy's with the northern coaliton and attempting to drive them from our region WITH the russians.And that is where i...*we* stand now. What will happen next? i dont know but i will be a part of it thats for sure.  Its diffucult to give eve a typical review. Because what you do in the game determines many aspects of the game for you. I went from sitting in highsec killing frigates to fending off hundreds of ships attempting to invade my alliances territory. You can make this game boring and quit. Or you can make it epic and heart pounding. When boils down to it. Its all just up to you...",
            "review_score": "1"
        },
        {
            "review_text": "great scifi game, a must have.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game when you devote time to it and realize it's not an instant gratification game.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most epic games out there. It's hard to believe at first but when you enter this massive MMO, everything will become clear!",
            "review_score": "1"
        },
        {
            "review_text": "Fun, but can be frustratingly difficult at times.",
            "review_score": "1"
        },
        {
            "review_text": "Not as unforgiving as people make it out to be. Unless you want it to be, anyway.",
            "review_score": "1"
        },
        {
            "review_text": "Do you see this? Yes it's like that.",
            "review_score": "1"
        },
        {
            "review_text": "There is a lot of misinformation about this game being floated around by frustrated people who couldn't figure it out. If you aren't a special snowflake and you don't take dying in a video game too seriously, you can have a ridiculously good time playing EVE without putting in a ton of time and effort. If you want to play a game where everything is handed to you, no effort is ever required, and you can pay to win, then EVE might not be fun for you. WoW is always there if you don't want a challenge. I'll go through some misinformation that unfortunately kept me away from the game for a while:  1) The learning curve is not that bad for most areas of the game. It is a huge game with a lot to learn, but it isn't 'difficult' to learn. People just get overwhelmed by the amount of information. For me, learning about everything is part of the fun. I'm a year in and have a ton to learn, and that's a good thing. I'm always improving and learning from my mistakes.  2) You do not have to wait months to skill up enough to do fun things. You can hop in a frigate and have fun in 1000 person fleet battles in null security space on day 1. Two words: ewar maulus. The hardest part about EVE is finding your niche and figuring out what's fun for you. Some people love mining (these pople are crazy), some people love PvP, some people love trading. The people that ♥♥♥♥♥ and unsubscribe after a month of mission running in high security space aren't giving the game a fair chance.  3) You can compete with and have fun with multi-year veterans. EVE is not all about skill points. They will determine how many ships you can fly, and to a lesser degree how powerful those ships are, but if you are smart and have some skill then the advantages are not insurmountable. Each level of a skill takes an exponentially greater amount of time to train than the level before it, but the benefit of leveling up does not increase. So you might train a skill to level 4 in a few days and get 90% of the bonus that a vet got from spending 20 days to train it to level 5 (max level).  4) Everyone is not mean and out to get you. Yes, if you spend $400 on PLEX to outfit billion ISK ships that you can barely fly in your first week of playing, you're going to get blown up, whether you're in high sec or not. People in local chat in trade hubs will try to scam you. Think about what you're doing and ask questions in the newbie chat channels and you'll be fine. You're never safe in EVE (what's the fun in being safe?), but if you're not stupid you can prevent yourself from being a major target. In most ships in most of high security space you will almost never just get blown up randomly. If you're having serious problems with other players in high security space then you're probably being dumb.  5) EVE is not 'spreadsheets online'. I'm really not sure where this one came from. It has kind of entered the mythology, like the supposedly impossible learning curve and everyone being out to get you. If you're a hardcore market trader or industrialist, or run a giant corporation, then you might want to keep records of things, but in no way does this define the gameplay. I suppose the inventory window is kind of like a spreadsheet because it has sortable columns? I really don't get this one.  6) Getting into a good corporation with fun people is easy. Google Brave Newbies. They are a bunch of newbies who won a 1000 person battle against a powerful group of multi-year vets this week by being smart.  Things that are true about EVE:  PvE is boring for most people and is usually a means to fund PvP. You will probably have more fun with other people than you will solo. You will probably end up with a few accounts/alts. Multiboxers are annoying, but you won't really encounter them much in PvP. The players, not the universe, make things interesting. The lore is mediocre, but null sec politics and wars are endlessly interesting. Some people play the metagame more than the actual game. EVE is challenging, but that makes it fun.",
            "review_score": "1"
        },
        {
            "review_text": "Play it. It's full of friendly persons and beautiful spaceships. Totally no reason to miss it.",
            "review_score": "1"
        },
        {
            "review_text": "Probably the largest universe in mmo existence at the moment. Crossing the language barrier, even game genres with its first person shooter tie-in Dust 514. Very large Ship selection with even larger customization to each one. The list of roles that can be played, is almost endless.    Generals leading large amounts of players in large scale warfare, to fleet commanders leading a small group of friends. Pirates killing, robbing their way to wealth and fame, at the same time fending off those players that choose to hunt the ever growing bounty on there heads. Crafting, fueling the players in universe from ship building to the list of parts a ship needs, and even miners gain mass wealth through the needs of crafting. Make your trade in buying from one side of the universe, and sell for a higher price on the other side of the universe. These are just a few things that a player can do, not including the 100s of other roles that help or hinder in others      PROS:  endless gameplay  very intelligent DEV team  brilliant and helpful player base.    CONS:  Learning curve is extreme at times (plenty of helpful guides if you are willing to learn)  Best played with friends, or making friends in the game early. (not exactly a con, but playing alone can be, well lonely)   My reviews are subject to change as play more and adopt better reviewing techniques.",
            "review_score": "1"
        },
        {
            "review_text": "a bad game for terrible people",
            "review_score": "1"
        },
        {
            "review_text": "The one and only space/spaceship mmo!",
            "review_score": "1"
        },
        {
            "review_text": "Amazingly deep sci-fi sandbox experience. Best in game economy I've ever seen. You choose your own fun. Join a pirate corp and kill players who stuffed their hulls a bit too full of valuable cargo. Scam players out of their hard earned ISK. Gang up with other players to take over a wormhole. Get rich playing the market. It's all up to you.",
            "review_score": "1"
        },
        {
            "review_text": "One of the greatest, if not the greatest MMORPG ever to grace this planet. A complete sandbox world with regards to plot, so you can do what you want as long as it works withing the confines of the game mechanics!  Cannot recommend enough!",
            "review_score": "1"
        },
        {
            "review_text": "the original space sandbox MMO, it's worth a try!",
            "review_score": "1"
        },
        {
            "review_text": "Extremely rewarding game experience if you take the time to get past the learning curve.",
            "review_score": "1"
        },
        {
            "review_text": "one of the best mmo´s i played ... but hard to learn and hard to play .... but its a sweet feeling to stay alive in eve !",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, but you don't want to get it from steam. Too many issues and a few limits on what you can do. Wait for a sale on the eveonline website, amazon, or GMG.",
            "review_score": "1"
        },
        {
            "review_text": "There is no other game like this. It can be super fun, but I warn you... Leveling in this game can take a life time. I got to a certain point and it told me that my next skill would level in 96 days... REAL LIFE DAYS. I quit at this point as it just did not feel worth it anymore to continue.",
            "review_score": "1"
        },
        {
            "review_text": "u get 2 b space n fly ships vrrrrrmmmm",
            "review_score": "1"
        },
        {
            "review_text": "Many of you reading this have probably heard of EVE Online before. Not much, but a little here and there. Such as there was something called 'Burn Jita' or some guy stole massive amounts of ingame money from players by a bank scam. You may hear about how difficult and unforgiving this game is with players killing for fun. All of this is true and so much more. EVE is not your standard MMO.    First off, I'll cover how you can continue your subscription. You've probably noticed the subscription plan, something called PLEX and you may have heard of the fact that you can eventully not pay at all for subscriptions. The subscription plan is self-explanatory, you can figure that out, it costs less per month the more months you pre-purchase. PLEX is a very interesting option though, you'll notice that it costs more than a subscription and yet all it does is add 30 days. There's a very good reason for this, PLEX is a sort of commodity in game, a very ,very valuable commodity. As in, it's not unheard of to get a billion ISK (Roughly $30) for selling one of these things though you're looking closer to 700-800 million for the lower priced ones. This means two things, players who need a boost in credits have an option to sell in game time, players in game who succeed financially will be able to effectively keep their accounts alive without having to pay real money. Now, I know what you're thinking, Pay to Win! This is not as true as it might seem. The reason is that in terms of what anyone would really deem 'Financially successful', this 1 billion ISK isn't that difficult to earn if you know how. It also doesn't get you far unless you know how to play at whatever it is you choose to do. Lastly, players trying to use real world money to get in game credits are paying not only subscription costs, but added costs for these PLEX cards. They're really just designed to give you a relatively small boost, not fuel the next war machine or your capital ship construction project.   Gameplay, where do I even start? First off, there's no classes. You can freely do pretty much whatever you want to do as the devs believe in emergent gameplay. You probably think this means pirates who kill for fun are allowed, well yes but there's a lot more. Remember that 'Burn Jita' I mentioned? That was a single player who made a group and they planned to change the game. There's a trade hub named Jita, it's the biggest of the hubs and it was getting to where you had to sell certain items at certain prices as you would either get massively undercut or make less profit and not even hurt the people charging more. This player got his group to target and destroy massive amounts of goods going through the system, forcing players to direct economic flow to other systems, making the market fluid again. Players took to the forums, complaining about the trillions in damages suffered, guess how the devs responded? They were actually told about it beforehand so they decided to beef the servers up so players wouldn't have to deal with lag. That's a rather grand example though. There's a lot more opportunities to do what you wish. Want to be a miner and stay in a high security system? No one's stopping you, have fun. However, if you want the really high value goods, get a corporation together and head out in to the dangerous null sec, basically meaning that there's no police protection and if you die it's your own fault for not being prepared, the wild west of space if you will. You can join in wars, manage supply chains, colonize planets, transport goods across the galaxy, pirate, kill pirates, kill people who kill pirates, explore hidden sites in space, be an industrialist, play the markets, just make something up! The two week trial gives you a feel for the atmosphere of the game, I reccomend just buying one month on a subscription plan, this will let you delve deeper in to the game and try to really find if this is for you.   In short, this game is supremely complex, the learning curve is high, the rewards for surmounting it higher, this is one of the very few MMOs that I can honestly say were worth every dollar. Before I forget, there is a real money paid for currency. I haven't really dealt with it, as far as I'm aware it's just cosmetic stuff so you're character can look more imposing in that portrait. I can't garuntee you'll like it, I don't know what kind of person you are, I just believe that it's worth trying before scrolling on to buy the next first person shooter that really is different this time.",
            "review_score": "1"
        },
        {
            "review_text": "I don't know if anything can be said that hasn't been said already. But, in short, this game is great. It's visually beautiful. It's got a great blend of action, economy/sim and RPG. Some have complained about the combat system, but this isn't a combat game. It's an economy game with a fantastically integrated combat interface. The stability, versatility and depth of this game make it one that will go down as one of the great greats.",
            "review_score": "1"
        },
        {
            "review_text": "meh, money sink 'till you are skilled up enough to make enough money in game to buy time.",
            "review_score": "1"
        },
        {
            "review_text": "Greatest, most dynamic sandbox MMO ever!!! ",
            "review_score": "1"
        },
        {
            "review_text": "If you are a smart person who likes science, you better start playing this ffs. It's awesome and lonely if you don't want to play with someone, but what do you expect when you're simply flying alone around in the universe? But remember you will never be alone. Wether it's a good or bad way. However if your brain runs out of capacity do not blame me for it.",
            "review_score": "1"
        },
        {
            "review_text": "Spreadsheets in space!  10/10",
            "review_score": "1"
        },
        {
            "review_text": "The best MMO game made to date.",
            "review_score": "1"
        },
        {
            "review_text": "hs game extremely complicated at first however after around 8 hours of play time this game strts to make sense and from there onwards becomes very rewarding....amazing game if you have the patience to stick with it for the first few hours.",
            "review_score": "1"
        },
        {
            "review_text": "EVE offers more personal freedom than any other MMO on the market. It has a complex economy, high stakes but balanced PvP, and can potentially be free to play. I also generally have some buddy invites, which can help you get started. Just ask.",
            "review_score": "1"
        },
        {
            "review_text": "It's a complex and hard game. You'll need to spend a lot of time playing and getting used to the dynamics and playstyle the game offers. You always have something new to try. Like you can see, i have more than 2k hours on record and i hardly can do half the stuff the game offers and i'm never bored.   Bad part about it is that the learning curve is very very difficult, especially for a &lt;3 month character. But with the new skill injector, i think that will be a thing of the past.",
            "review_score": "1"
        },
        {
            "review_text": "If you have speare time cheack out this title.",
            "review_score": "1"
        },
        {
            "review_text": "this game is amazing the player controlled economy usually works very well. However, this game does take a while to get into and it usuallly takes a bit of time before you can do the really freakin' awsome stuff.",
            "review_score": "1"
        },
        {
            "review_text": "The beast! The Legend! The one and only... EvE!",
            "review_score": "1"
        },
        {
            "review_text": "True Gem of an MMO. A definite must play for any space sim enthusiast",
            "review_score": "1"
        },
        {
            "review_text": "One of the greatest, if not the greatest MMORPG ever to grace this planet. A complete sandbox world with regards to plot, so you can do what you want as long as it works withing the confines of the game mechanics!  Cannot recommend enough!",
            "review_score": "1"
        },
        {
            "review_text": "addicting af",
            "review_score": "1"
        },
        {
            "review_text": "Great game for those who like a steep learning curve in a true sandbox environment.",
            "review_score": "1"
        },
        {
            "review_text": "epic ♥♥♥♥♥ adventures in space",
            "review_score": "1"
        },
        {
            "review_text": "Good game with very ♥♥♥♥ing steep learning curve..... wait that's my last mining frigate...... ♥♥♥♥! Still love it",
            "review_score": "1"
        },
        {
            "review_text": "Amazing MMO if you have the time and dedication to stay with it.",
            "review_score": "1"
        },
        {
            "review_text": "Despite the changes with Ascension, EVE can still be a fun PVE or PVP experience. Playing in a corp can increase the fun and opportunities available to a new pilot. It does take some time to learn the ins and outs of EVE but once you are off and running you start to see the possibilities that are out there.",
            "review_score": "1"
        },
        {
            "review_text": "Honestly the best MMO I've ever played, and the best thing in this game is the community, and the worst thing in this game is the community. Highly political with a 1001 facets of information. I would not quit this game if you offered me a grand.",
            "review_score": "1"
        },
        {
            "review_text": "OHMIGAWD. The Complexity kills me ._.  It's great, don't get me wrong but it's definetly nothing for People who ... just want to get right into the Action. Infact, the Game IS really boring at first since there isn't much to do besides flying around and doing errands.  I'll give this one another try this Summer, but I don't think I can really get into it.   I still recommend it though, since it IS actually awesome and quite stunning. It's just nothing for people with short temper or People who don't want to browse thourgh 1000 wikipages while they're playing.",
            "review_score": "1"
        },
        {
            "review_text": "The tears!!  They nourish!!",
            "review_score": "1"
        },
        {
            "review_text": "Now I haven't played alot so my words don't mean much but its good so far. this reminds me of x3. which is a good thing. but if your not sure about buying this, go to the main website and try 15 free days to help you get the hang of it.",
            "review_score": "1"
        },
        {
            "review_text": "I'm brand new to MMORPG and I love this. Action freaks may find it slightly boring but anyone with a sense of creativity and patience will love this.",
            "review_score": "1"
        },
        {
            "review_text": "This game of spaceships is well hidden inside the best real market simulator out there.  For people who find graphs and charts infinitely compelling.",
            "review_score": "1"
        },
        {
            "review_text": "I have at the time of this review owned this game for less than a week...what have I been doing with my time??!",
            "review_score": "1"
        },
        {
            "review_text": "Great game if you have patience and don't mind spending a lot of time learning and researching and planning. If you want to try this game for free for 21 days just send me a message and I'll get you an invite!",
            "review_score": "1"
        },
        {
            "review_text": "Space Exploration at its finest. If you havent played EvE by now, what are you waiting for? And, yes, there is a huge learning curve. I've been back and forth to this game for years now, but everytime I come back, I'm yet amazed again! Try it, maybe you'll like it too :)",
            "review_score": "1"
        },
        {
            "review_text": "The most challenging and yet rewarding MMO to date. And it's in space.... With lasers.",
            "review_score": "1"
        },
        {
            "review_text": "it is a game",
            "review_score": "1"
        },
        {
            "review_text": "Unlike any game you have ever played or will ever play; a truly unique experience...",
            "review_score": "1"
        },
        {
            "review_text": "Great Sandbox mmo. Nothing else like it out there right now.",
            "review_score": "1"
        },
        {
            "review_text": "It's not for everyone. But once you get in, you can't really ever get out.",
            "review_score": "1"
        },
        {
            "review_text": "A few things I want to clear before you read this review:  -This game is a HUGE time sink. The whole purpose of this game is to remove time from your life (you could be doing other things than playing this game). -This game has a subscription fee - money that could go towards a gym subscription instead. You look like you need it, fatty. -If you want an action-packed space adventure, then this is not the game for you.  Alright so now that I've cleared the air, it's time to begin my review.  This game is awesome. I'm enjoying every minute of it. If you have the patience to understand what each icon on your left does, then you'll have a fun time playing this game. The game relies HEAVILY on time rather than on grinding. You know those annoying facebook games that require you to log in every once in a while to do something? That's pretty much this game. Surprisingly that's not a bad thing. Here's why:  The reason this game is fun is because of the way the in-game world works. You can be anything and anyone you want. If you want to be an explorer, a pirate, a stock trader (yes there is a complex stock market in this game), a bounty hunter, a soldier, a corporate leader, a miner etc; you can be that. This game is a sandbox, but it still has enough barriers to regulate the game so everything doesn't go into haywire.  The galaxy is massive and there is ALWAYS a fight happening somewhere. You could be in a quiet corner of the world, but someone, somewhere else is being raided by pirates. If combat is your definition of fun, then this game is NOT for you. If economics &amp; politics are what you want, then this game is indeed for you.  It's complex enough to weed out the lesser-minded proletariats so that you may enjoy your brief impact on the in-game universe.  Do I recommend this game? Hell yes. It's one heck of an MMO and I can't believe I hadn't played it before. I'm an MMO veteran, mind you and I've played EVERY single MMO out there be it free or not. This is literally the last MMO I have on my list and I think I've fallen in love for a couple months.",
            "review_score": "1"
        },
        {
            "review_text": "Unless you know 5+ people who will join you, dont bother. The game promotes deception, most of the people you meet will try to rip you off. The concept of dont trust anyone yet build an empire in this mmo, clashes to the point of not being worth the time.  Its hard to go from the X3 games, where you control fleets of 100s of ships, to being restricted to 1. This is why no one bought rebirth...  I only recommend this because it could be awesome if you have a group and my support claims were handled amazingly well. CCP cares about their image and users. A+ support.",
            "review_score": "1"
        },
        {
            "review_text": "Certainly one of the most , if not THE most complex mmo out there. But also one of the very bests. It's gameplay is as deep as the space world of New Eden it pictures, and it is just begging for you to build your own story whichever way you see fit. I could go on for ever, but really you need to play this game to understand how deep it can be. Buy it !",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely LOVE this game! It is definitely one of the most in-depth and well-thought out games that I've seen made by an independent game studio, CCP definitely displays its capabilities well within this game. It is always supported/updated with FREE expansions that always work on providing a better enviroment for everyone, alongside the daily downtime where patches are applied! All players play within the same world, known as New Eden where I've seen upwards of 50,000 people and this is all in ONE server, ONE space..How will you live amongst us? There are many paths you can take within this game, there is definitely something for everyone: +Mining in High/Low/Null Security Systems +PvE +PvP +Manufacturing +Trading +Pirating +Join up with a corp and fly with friends and MUCH MUCH MORE!  I hope to see YOU in New Eden! Fly safe pilot! I'm able to give out 21-day trials instead of the generic 14-day, if you would like one then shoot me a msg here on Steam!",
            "review_score": "1"
        },
        {
            "review_text": "Welp, there goes my soul, body, and mind.",
            "review_score": "1"
        },
        {
            "review_text": "Just wanted to let eeryone know this is a great game but only for people who can respect a true space sim.",
            "review_score": "1"
        },
        {
            "review_text": "Only MMO that has captured me since years after my ventures into Lineage 2 and World of Warcraft. Definitly a must try. This is part of MMO History by now.",
            "review_score": "1"
        },
        {
            "review_text": "......its like mass effect mixed with battlestar galactica with a dash of star trek....i am sold! IF YOU WANT TO BUILD YOUR OWN LEGACY IN SPACE THIS IS THE ONLY WAY!!! (As of May 2014)",
            "review_score": "1"
        },
        {
            "review_text": "After years of listening to the incredible stories being egenerated by Eve, yet never being able to see how they matched up with an incredibly complicated-looking front end I finally gave this gem the time it deserved.  Is it very complicated? Yes, very! However giving the game time to explain itself to you, contacting the various player-run corporations and receiving help and training makes the learning curve more of a gentle slope than a cliff.  What is enjoyable about it? Well firstly it looks incredible, its software and graphics have been updating to keep up with modern hardware and the game runs beautifully and looks even better. Secondly the combat is so very tactical that you really can't get a feel of how complex combat scenarios are until you are in command of one, ie try it! Thirdly you have the sandbox. Full-blown economic sandbox with empires rising and falling, constant conflict and intrigue within the massive playerbase. Simple put: Fun and satisfying combat along a large-scale universe-wide simulation.  Progression? Contrary to how it looks, progression is measured in the skills your characters learns. These skills are learned in real-time whether you are on or offline. You need to always be learning something! Ships are bought and lost, but yuor characters remains permanent (well, sometimes he gets a little roughed up..).  PVE? Yes, and the majority of your early days will be spent doing some fairly enjoyable and in-depth PVE missions. There is enough content here to play the game only as PVE.  Go and try it out, you will not regret it.",
            "review_score": "1"
        },
        {
            "review_text": "one of the best games i have ever played . there are so many things to do like fight space pirates trade explore and the universe is massive however if you prefer fps games and first person combat games this is not the game for you",
            "review_score": "1"
        },
        {
            "review_text": "The only MMO worth your time, EvE Online throws you into an inter-galactic world full of possibilities ranging from solar-system conquest to wormhole exploration to industrial operations. In EvE online you could battle to conquer contested space or seek to create your own industrial empire - Anything is possible if you know how to manipulate others with subterfuge, or perhaps you'd rather crush the competition with firepower?",
            "review_score": "1"
        },
        {
            "review_text": "Honestly the best MMO I've ever played, and the best thing in this game is the community, and the worst thing in this game is the community. Highly political with a 1001 facets of information. I would not quit this game if you offered me a grand.",
            "review_score": "1"
        },
        {
            "review_text": "I love EVE. Awesome game.Just remember, trust no who you can't throw a pizza box at.",
            "review_score": "1"
        },
        {
            "review_text": "Came back after 4yrs away it plays and looks alot better well worth it!",
            "review_score": "1"
        },
        {
            "review_text": "Greatest MMO ever.",
            "review_score": "1"
        },
        {
            "review_text": "HUGE learning curve, long turorials... after you get through that the game is a lot of fun, very open to whatever the pilot wants to do",
            "review_score": "1"
        },
        {
            "review_text": "9.9/10 Would recomend. It is an awesome, unforgiving and complicated game. I suggest you try it. It is certainly not a game for everyone.",
            "review_score": "1"
        },
        {
            "review_text": "It's ok I guess.",
            "review_score": "1"
        },
        {
            "review_text": "Definetly reccomend",
            "review_score": "1"
        },
        {
            "review_text": "You can do anything from the piracy to trading ,you can even let you ship mining ,minimalize game window and go play The Sims 2 ,Robocraft ,CS:GO or Minecraft ,if you want... And many other games...   Driving you ship in to low sec and then you blow up ,becose of gatecamp ,or do gatecamp with you aliance and then get destroyed your battlecruiser ? This is awesome feel !...   Find extra rare item what cost 399 000 000 ISK and then sell it for 200 000 000 ISK becose you are dumb ? No problem !   In eve you can do anything what you want ,I can say buy the game , its a good deal !",
            "review_score": "1"
        },
        {
            "review_text": "80% idle 15% making money 5% intense adrenaline amazing space battles.  Have played for five years, would play for another five.",
            "review_score": "1"
        },
        {
            "review_text": "Great game if you have patience and don't mind spending a lot of time learning and researching and planning. If you want to try this game for free for 21 days just send me a message and I'll get you an invite!",
            "review_score": "1"
        },
        {
            "review_text": "This is a truly great space game, after being out for 10 years, they have truly perfected the game. It still is a little slow to get started if this is your first playing an MMO of this caliber.",
            "review_score": "1"
        },
        {
            "review_text": "Yea, just play it!",
            "review_score": "1"
        },
        {
            "review_text": "Best pvp MMO out there, greifers paradise!!!",
            "review_score": "1"
        },
        {
            "review_text": "In my opinion its the best MMO out there. Constantly moving forward, while continuing a timeless feel.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥♥♥♥t",
            "review_score": "1"
        },
        {
            "review_text": "The hours I've clocked on this game say's it all.",
            "review_score": "1"
        },
        {
            "review_text": "So much potential in this game. Be ready to be amazed or destroyed.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty awesome so far....",
            "review_score": "1"
        },
        {
            "review_text": "awesome game that is very deep and lots of run, will never get bored because of 'end game' or being too OP",
            "review_score": "1"
        },
        {
            "review_text": "Best sleep aid money can buy",
            "review_score": "1"
        },
        {
            "review_text": "I played one month, this is my gametime. I think that speaks for itself",
            "review_score": "1"
        },
        {
            "review_text": "This is a game I grind at for months, raising security status, mining, raiding pirates, and joining faction warfare. Then out of seemingly nowhere, my itch is scratch, then I don't play for a few months, only to find the itch coming back months later.  This is a fantastic space-sim-MMORPG and it seriously only gets better as time goes on. There is nothing out there as deep/intricate as EVE.",
            "review_score": "1"
        },
        {
            "review_text": "This is a game I grind at for months, raising security status, mining, raiding pirates, and joining faction warfare. Then out of seemingly nowhere, my itch is scratch, then I don't play for a few months, only to find the itch coming back months later.  This is a fantastic space-sim-MMORPG and it seriously only gets better as time goes on. There is nothing out there as deep/intricate as EVE.",
            "review_score": "1"
        },
        {
            "review_text": "Eve Online is a massive multiplayer sandbox set in a future where humanity long past reached the stars and expanded out into the galaxy through what was thought to be a stable wormhole. Sadly, they were wrong, and upon its collapse, those who were trapped in New Eden soon lost their ability to travel between planets. Over time, society rebuilt, and took to the stars once more.  This is where you come in. You are a new breed of starship pilot, having relinquished your humanity in favor for technological immortality through the use of clones. You can mine for much sought after resources, prey upon the weak as a pirate, become the CEO of the universes largest corporation, and much more.   All that said, Eve online has a rather steep learning curve, and it doesn't try to hide this fact. There are also griefers, as with any mmo, that will extort you for money, and kill you anyway, there are scammers that will cheat you out of your rightful pay, and there are people who will be tacitly unhelpful on purpose. And it's all perfectly legal.   So, while I will in fact reccommend this game to others, I will say that you will need patience, and a good dose of pure pig headed stubbornness to get ahead at the beginning. Almost every aspect of Eve can be tied to some form of conflict, even the market, which is a big part of the player run economy.   I guess you could say in Eve Online you'll never find a larger hive of scum and villainy, and you'd probably be right. Still, if you manage to make it past the 14 day trial, and actually find something to enjoy in the game, then Eve will continue entertaining you for quite a while. Just don't expect to progress as quickly as you might in a standard RPG.   And remember: In Eve, it isn't paranoia. There really IS someone out to get you. You just haven't spotted them yet.",
            "review_score": "1"
        },
        {
            "review_text": "If you can get past the learning curve, this game can be every as bit as enjoyable as it seems on paper.",
            "review_score": "1"
        },
        {
            "review_text": "I have played this games for a number of years now and felt I should finally write a review on it. I thoroughly love this game and how there is so much content to it you could play for years yet still there be plenty left to learn. It gives a great sense of challenge and achievement.   If you are not very patient and find travelling between one place and another boring when there is a long time to do so then this game may not be for you as there is a lot of travelling about between locations sometimes long distances depending on what you choose to do. But since the game offers a free trial period there is no excuse in not giving a go to see for yourself.  I also love the PLEX system that is implemented where you can earn enough in-game money (although this is a lot) to be able to buy a PLEX each month instead of paying real world money although due to how much of the in-game currency is needed this would need to be a goal to work towards affording.  As for actual gameplay the mining aspect can be a little boring in the high security areas and AFK mining is often the best way to in those cases, you wouldn't want to go AFK in lower security areas as there are more interesting occurrences there. There is also a very large PVP element to this game and so many paths to follow you can get hours of fun from it.",
            "review_score": "1"
        },
        {
            "review_text": "EVE is a hard game to get into. It's learning curve is a cliff, but once you get past the learning part, it's quite a enjoyable game. I recommend it if you have time to put aside or simply love games that focuses on player driven economics and politics.",
            "review_score": "1"
        },
        {
            "review_text": "Do you want a MMO that you have to work for? Do you want to do Space Exploration, PEW PEW, Mining and loads more that would take ages for me to talk about here? Then purchase EVE Online: &lt;Expansion&gt; - At the time of review, there is 18 expansions and every expansion is free to all subscribers. Beware: It's DEEP! You will have to learn a lot before you can 'truly' play the game. If you have the spare money, grab it.",
            "review_score": "1"
        },
        {
            "review_text": "I have played eve for about 9 months a total, mostly not on steam. I have been doing lots of stuff trough eve, and if there's something i haven't, a friend of mine was probably doing it.   First of all, eve is a complicated game, and is not for everyone. You think you want to start the game ? go ahead, its a great game. But what most people struggles with is, you need friends, and your casual 3 friends that you play everything with or known for years, a community that can help newbro's and is friendly.    Eve asks you to give your time into it, not by being online 7/24, but by at least training for sometime, casually several months, you need people to talk with, do things with, ask things to. Go ahead, join a newbie friendly null-low corp. Dont be afraid to exit high-sec, you will soon see even high-sec is not safe.   While playing eve, you will get scammed, you will see people outranking you, sometimes you will make the most basic mistakes. Dont worry about these, all players once did those mistakes too, just dont give up and always join op's with your alliance/corp.   Also, my last tip would be to, have a goal. Eve is a sandbox game, and it doesnt hold your hand like any other game. Eve wont tell you what to do, so after tutorials most people get lost, not knowing what to do. Look up to ships on wikis, their roles, read alot, and once you think you found a suitable thing like ' i want to live in a wormhole' or 'i want to fight for my favorite faction', go towards that. Never let a ship be your goal, it will only leave you with the emptiness after you obtain it.   Oh and also, forget about titans and capitals. Frigates are actually really cool, low-cost and you can pretty much do whatever you want with them, kiting, brawling, logi(repairing), PVE. It doesnt even take much time to master one.",
            "review_score": "1"
        },
        {
            "review_text": "The learning curve is high... the game is deep. There's a million ways to play. Mine and make the money. Pop pirates for pleasure. Battle buddies for bragging rights. It's all here on a detailed level, and if you want, you'll get sucked in.    Don't be a carebear, gankers will get you anyhow. Go null-sec and pewpewpew. Know what I mean?",
            "review_score": "1"
        },
        {
            "review_text": "If you're willing to put the time into it (i.e. all your free time for the rest of your life) this is easily the best MMO ever.",
            "review_score": "1"
        },
        {
            "review_text": "Great game:  Tip one: Get Overview set up flag a bunch of people as hostile, keep local open. Never AFK undocked. Suspect everyone but your corp/alliance to be an enemy. If your mining never trust someone that warps into belt in a combat/recon ship.  Once these habbits are in place your good to go, dont be afraid to lose. You will always gain back loses even if its the slow route.  Tip Two: Never move everything into null/WH space.  Tip Three: If wardecced and dont want to participate take a few days breather then come back wardecs fade if you wont give your enemy kills.",
            "review_score": "1"
        },
        {
            "review_text": "Very engaging and fun to play. It takes a while to learn the ropes, but once you do, you'll find that you have ended up in the future (few hours to a day or so).  The tutorial is small, and it is there only to help you understand the controls. I wouldnt focus on clearing them all, do the contracts. It thrusts you into the world without warning, and thats what's fun about it. Its thrilling and exciting, but confusing and scary at first. Just the inital shock.  Get this game, now.",
            "review_score": "1"
        },
        {
            "review_text": "i told myself i'd play a bit after the tutorial things got out of hand... nah but its a great game overall if you get to a good corporation, which is basically the equal of a guild, you will have tons of fun, it might look boring in gameplay video but when you play the game all the button pressing is almost overwhelming, ive actually gotten to prefer this than the dog-fighting experience, its nice in its own way. ",
            "review_score": "1"
        },
        {
            "review_text": "Outstanding game with multiple options for play and development.",
            "review_score": "1"
        },
        {
            "review_text": "Be a boss with spaceships.",
            "review_score": "1"
        },
        {
            "review_text": "At the time of this post I have 700+ hours on it and I dont regret it. I just cant seem to find a game that gets anywhere near what i need, at least not in release. King of the deep space mining rats :D",
            "review_score": "1"
        },
        {
            "review_text": "It's ok I guess.",
            "review_score": "1"
        },
        {
            "review_text": "The final frontier.",
            "review_score": "1"
        },
        {
            "review_text": "If you have the patience EVE Online will give you the skills and technology for you to virtually rule the universe. Completely addicted to this game! You know you want to join me!",
            "review_score": "1"
        },
        {
            "review_text": "Tough but great",
            "review_score": "1"
        },
        {
            "review_text": "EVE Online is one of the deepest, richest and longest running MMO's available today. The game has evolved drastically since its release 8 years ago and continues to attract a healthy number of players that all play on a single shard which offers a level of continuity that few other online games can rival.   If you garner a reputation as a Corp thief in EVE, that reputation will stay with you, if you fancy yourself as a Pirate or a Scammer then that's fine, but be prepared to pay the price when pirate hunters or those with a sense of justice come-a-knocking.  EVE will test your limits and emotions like no game has ever tested them before, losing your hard earned ships and equipment happens more often than not and if you want to stick with EVE for the long haul then you need to let go of this false sense of attatchment.  In EVE there is only one rule - Nothing is eternal. Eventually, you will lose your shiny ship, your +4 Implants, your expensive faction modules, live with it...",
            "review_score": "1"
        },
        {
            "review_text": "flew into nullsec and died",
            "review_score": "1"
        },
        {
            "review_text": "One of the top-rated MMO's ever, Eve Online is a game I highly reccomend. It features a leveling sytsem completely one-of-a-kind never seen in any other game and is very addicting. However, it is quite time consumming and isn't for those who expect a casual and easy going game, Eve is intense and requires planning and tactile for those who want to progress far into the game, it can take one a year or more even to be able to fly some of the more larger and advanced ships correctly and effectively.",
            "review_score": "1"
        },
        {
            "review_text": "Found a wormhole. Never felt so excited in my entire gaming experience. 9/10 (you have to pay thou)",
            "review_score": "1"
        },
        {
            "review_text": "docking request ACcepted",
            "review_score": "1"
        },
        {
            "review_text": "If you have speare time cheack out this title.",
            "review_score": "1"
        },
        {
            "review_text": "we are born to early to explore the universe atleast we have EVE",
            "review_score": "1"
        },
        {
            "review_text": "Sandbox game that is only as good as the person playing it makes it. This game is certainly not for everyone, the new alpha clone feature lets you play for free to try the game before you commit to the monthly subscription, so you certainly have the chance to make up your mind if the game is for you.",
            "review_score": "1"
        },
        {
            "review_text": "Imagine this.  Biggest battle of this game started in 2014. 4k players battled against each other. 72 titan class ships lost. over $200,000 of real money was lost during this war. 4x bigger battle than the big one in trailer.  That is what this game can do.  (This battle actuily happend in 2014)",
            "review_score": "1"
        },
        {
            "review_text": "An amaizingly fun game, 10/10 would recommend...",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely amazing game that has the downside of a big learning curve. Once you get an understanding of how to game works, it could be the only game you want to play. One thing for sure is you will always learn something new, even after nearly 3,600 hours.",
            "review_score": "1"
        },
        {
            "review_text": "Oh god damn this game is so good. This is one of the best, most inclusive, and hardest MMORPG's I have ever played. It is also the most rewarding.  Thank you so much CCP of Iceland =)",
            "review_score": "1"
        },
        {
            "review_text": "Hard for beginers... Othervise interesting",
            "review_score": "1"
        },
        {
            "review_text": "It's ok. Uhh. Haven't really put in enough time to decide if I like it. I'm still a noob.   This game will take over your life.  Save me....please... it's watching.",
            "review_score": "1"
        },
        {
            "review_text": "A lawless sandbox in space with a fully functional player-based economy.",
            "review_score": "1"
        },
        {
            "review_text": "All your base are belong to us.",
            "review_score": "1"
        },
        {
            "review_text": "Overall I've began EVE Online multiple times, and had fun every time. With each time I played the game got better and better the more I learned. Like everyone warns the game has an enormous learning curve, but to help new players there is a local chat to ask questions that are almost always answered! Finally, I think this game is a good game for that dedicated player that likes spreadsheets, a point click style gameplay, and literally an environment built for almost any kind of player!",
            "review_score": "1"
        },
        {
            "review_text": "Been playing this for a decade now, and probably a decade to come as well!",
            "review_score": "1"
        },
        {
            "review_text": "One of the deepest games i've ever played. Theres enough stuff to do, that you could play for years and not experience it all.   I also can't stop coming back to it.. I may leave for a bit.. But i always come back, and its always still great.",
            "review_score": "1"
        },
        {
            "review_text": "The longest running Space Sim game, which has all the elements of a virtual life experienced on a universal scale. EVE had me hooked for many many hours at end, and I can say safely say that it was worth it. Spending a fortune on a ship and travelling to far off planetary systems to fit it, only to lose it in a miscalculated jump through a lowsec or nullsec, and then doing the same with other players when you are skilled enough is what makes EVE truly different and unique. Overall a lovely game and worth a try.",
            "review_score": "1"
        },
        {
            "review_text": "No other game comes close to matching this spectacular MMO. It's a sandbox, in the purest sense, including the bully who just knocked your castle over and rubbed your face in it. The background story is intriguing. The politics are a minefield. The missions are repetative but still somewhat fun. The exploration is heart pounding. And the PVP... Well, let's just say, proper news stories have been written about what transpires during PVP. The combat is deep and complex, the markets are player driven and dynamic, the universe is ever changing, ever evolving. The bar was set extremely high with this title in the space sci-fi genre.  It's been 10 years and I'm still playing it.  11/10 would waste another decade lost in this beautiful game.",
            "review_score": "1"
        },
        {
            "review_text": "the persuasive and mystifying abyss that is ambient music online",
            "review_score": "1"
        },
        {
            "review_text": "Space is dark and scary, bring extra pants.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, with a high learning curve on, though not as high as it used to be. A great space MMO that doesn't dumb itself down to attract new players, like some of those /other/ MMO's.",
            "review_score": "1"
        },
        {
            "review_text": "'Games are about winning - EVE is about NOT losing'  A game like none that you ever played before. A trully unique experience. Now free to play!  I first started playing EVE 3 years ago (for about 4 months) and I wish I never stopped.  Back then it had a subscription based model and I just couldn't afford it in the long run. But now? No commitments. It's amazing too because I never wanted to quit EVE in the first place. FIRST MMO EVER THAT I DID NOT GET TIRED OF AND WAS SAD TO PART WITH.  The most amazing and mature community I've ever seen in any mmo game: 'If you get into the community it is impossible to quit Eve or not find enjoyment in it.'  Amazing crisp graphics and legendary and immerisve ambient music.  I could write pages and pages about EVE and it still wouldn't be enough (people dedicate entire books to it!). Put simply: it's the best scifi mmo out there, with a stupendously enormous universe with endless possibilities, player driven economy (anything you buy is player made) and a 'semi-permadeath' system where you lose all your belongings when you die (makes it extra spicy to go out and explore or try new things).   All of that on one worldwide mega-sever.  Be warned though: it's not so easy to get into as you might think. But don't get discouraged - it's really worth it and you will feel a great achievement with every step you'll take. With all the tutorial systems that are now implemented into the game, you will quickly be on your feet heading for that lost nebula to explore.... And don't ever be afraid to ask other pilots questions! They will be more than happy to help you out.  All I can add is: fly safe o7",
            "review_score": "1"
        },
        {
            "review_text": "I have played this on and off for over 10 years, starting many new trials just to see if its worth it then resubing , then getting ♥♥♥♥♥♥ off, leaving then coming back. EvE online is Gey, it's fun , full of ♥♥♥♥♥♥s and ♥♥♥♥♥♥♥s and I love them all. I hate PvP , but I loved Null Sec. Play it. its free to play up to 1.5mil skill points. You can always rage quite later",
            "review_score": "1"
        },
        {
            "review_text": "Can't go past this one, for socal experence and ability to learn new skills that actualy do apply in the real world. Get involed in the comunity and you will learn a lot. Game has a mature calture - yes their are ♥♥♥♥♥ but what online game doesn't have them, but one can at least deal with them instead of being a victium.",
            "review_score": "1"
        },
        {
            "review_text": "EVE online is one of the hardest games to learn alone but it can be great fun and full of adrenaline rush during fights between players and NPCs alike.  I Recommend you try a trial then downgrade or upgrade to f2p/p2p and join player owned corporations /alliances/ coalition full of players.",
            "review_score": "1"
        },
        {
            "review_text": "EVE online is one of the hardest games to learn alone but it can be great fun and full of adrenaline rush during fights between players and NPCs alike.  I Recommend you try a trial then downgrade or upgrade to f2p/p2p and join player owned corporations /alliances/ coalition full of players.",
            "review_score": "1"
        },
        {
            "review_text": "Needs more work but fun to play.",
            "review_score": "1"
        },
        {
            "review_text": "An amaizingly fun game, 10/10 would recommend...",
            "review_score": "1"
        },
        {
            "review_text": "1.0/0.0 would wormhole again.",
            "review_score": "1"
        },
        {
            "review_text": "Play of the game.... Going free to play for unpaying members... finaly taking after Runescape.  If you enjoy space simulator games, relaxed gameplay and roleplay this is the game for you.  This game takes alot of time so, if you do not have the time it is not worth starting it up at all.",
            "review_score": "1"
        },
        {
            "review_text": "I've been playing since launch, and was one of the many that came over from Earth and Beyond. Sometimes I wont play for days, but when I do its always fun. It's a deep game, and sometimes it can be overwhelming to decide what to do. That being said, new folks will find the learning curve steep and the rewards great.   As of Nov 2016 the game has gone free to play. The free account is very limited, but at least now folks can get deeper into the game before just writing it off as 'internet spaceship spreadsheets'.",
            "review_score": "1"
        },
        {
            "review_text": "Greatest space game ever",
            "review_score": "1"
        },
        {
            "review_text": "Some of the best PvP I've ever experienced in a game.  Join a null-sec corp. You don't need to 'catch up' to older players. You can fly smaller ships that help your fleet within the first week.",
            "review_score": "1"
        },
        {
            "review_text": "Complex and easy to learn. There is a subscription service, but it doesn't get in the way of being a FTP.",
            "review_score": "1"
        },
        {
            "review_text": "Just Geet lost in Space and give nothing Back also works as an awesome screen saver for sleep",
            "review_score": "1"
        },
        {
            "review_text": "I like the gameplay a lot, it reminds me playing Homeworld but with RPG",
            "review_score": "1"
        },
        {
            "review_text": "Though I do love and recommend this game, It is not for the impatient. If you want a quick, action all the time game, this isn't it. If you want action sometimes and are willing to put in some work in the game, this is it.",
            "review_score": "1"
        },
        {
            "review_text": "I have been playing EvE on and off for 6 years now. Do I like it? Yes. Would I recommend it? No. EvE is an exercise in humility. If you join now or at any point in the future, don't expect any satisfaction from this game. The trailers are made to make you believe that you can change something - the news broadcast about the battle of B-5RB are making your mind imagine things that just aren't here. EvE is not a Sandbox - it is a multiple choice point &amp; click adventure like those 'make your own adventure' books you read when you were a child. There is nothing new to be discovered, everything has been done by someone before you and better to the point where it is almost mandatory to use third party websites to fit your ship, mine, produce, explore or do anything in this game. You will not stumble upon a miner in distress in your first week and join his buddies fleet to see a large battle - if you venture into the PvP space you will be blown up either by the pirates or his reinforcements. Chatting to any of those groups will make you a target. PvP comes in three major varieties. Solo PvP revolves around finding a mark that you can take without any difficulties. If there is a chance that an engagement could let you lose your ship, you don't engage. For a new players this means that you will never get in any PvP you can win. Gang PvP revolves around finding a mark that your gang can take without any difficulties. If there is a chance that an engagement could let you lose your gang, you don't engage. Fleet PvP is just two massive blobs colliding. Most fleet battles are decided by who gets the drop on whom - since fleet battles tend to last for more than 10 minutes, a little tactics can be put into it with reinforcements.  The Sandbox that is often quoted is nothing more than a tech tree with premade options. Ships, Modules and everything you make has been made by a very restrictive system of blueprints that allow no individuality. Any two ships with the same name will look the same, behave the same and do the same until you fit them with modules with the same attributes.  So in conclusion this is EvE: You grind your ♥♥♥ off in the same missions or same mining belts for days on end, waiting for your skills that are based on real world time to learn to finish learning. Nothing you will do will have any impact if you haven't been playing this game for years, shelling out a quite high monthly fee for a somewhat dated game. EvE is the ultimate in waiting simulators. Get a better game.",
            "review_score": "-1"
        },
        {
            "review_text": "I have been playing this game for almost 6 months really trying to like this game. I ran missions, explored wormhole space, station trading, Industry, PI, and mining. However, I quit because this game is very focused on the sadistic side of human behavior. You cannot prevent someone from killing you and taking all of your hard earned stuff. You can avoid being killed for a short time but eventually you will be eaten by the bigger fish. This is what they don’t tell you - this game needs new blood so that the bigger fish can consume you. As a new player you are constantly flying around in fear of being cannibalized by others. I can understand that you are better than me and you caught me and you destroyed my ship. However, it doesn’t stop there. After your ship is destroyed they Pod you (and they really don’t have to do this) and you have to start all over again. The worst part is that people are constantly trying to scam you. They say they want to help you but in the end they take advantage of you. This is completely allowed - The game developers say this is the beauty of the sandbox mode. I say it is “Lord of the Flies” in space. A bunch of kids on a deserted island and all hell breaks loose.  Sandbox mode? Don’t think so. How can this be a sandbox game when you are limited to where you can go, and do, as a solo pilot? Yes, a few good people exist but you can’t trust anybody. I live this in real life why would I want to spend my recreational time doing this?  Final note: The game developers (CCP) have given-up on trying to resolve the new player retention problem. CCP releases updates that only cater to veteran players - nothing to aid the new player. The updates aid or assist the bitter vets complaints against null-sec or capital ship issues. CCP has given up on fixing the tutorials. They would rather have the existing players tutor the new players. The problem is this is one of the worst MMO communities around - just read the forums.",
            "review_score": "-1"
        },
        {
            "review_text": "Eve is a player content game with a real-time leveling system. This means two things to new players. There is no possible way to catch up to older players. And there is almost no player verses environment content. Eve is a massive PVP game with players either engaging in or supporting PVP battles or conflict. If you are not in pvp then there is mining, exploration, trading and production. All of these are to support the pvp battles. As a new player you will have no chance of success in pvp on your own.    Eve's real-time leveling system means you don't have to play to level your character. It also means you can not speed up your characters training. Because of this, as a new player, you will not be able to defend yourself against an older players attack or go pvp solo. This doesn't seem like too much of a problem at first because there is almost no new player training. So, you will be spending most of your time trying to figure out how to use the game mechanics and finding the limited training available in game. In the mean time your character will be leveling skills that your not sure are right. However, there will be players chatting you up willing to teach you and even more players recruiting into corporations aka guilds. I would suggest you lean heavy on youtube videos for your game mechanics training. There are many to choose from some much better than others.   The answer the players and I guess the GMs have come up with for the new player pvp problem is that you join a corporation and be cannon fodder. It works like this. You equip your rookie ship with a device that can hold a player of any level or experience in place and then your 'friends' warp in and make the kill. You will be killed for sure. But, that's all you can do and will be able to do for quite a while because of the training system. That's it there is nothing else you can do in the pvp area.   That leads to the other roles in the game. Mining, exploring, trading and production can be done solo. You will need to train these areas to be any good at all and that takes real time. This is where those videos come in handy. You can watch them while you character is leveling. 'that's what I did and still do from time to time' There are also help chat channels where you can get ok advice and better resource information like what website has the trade info you can't get in game.    The game has a lot to offer and leaves a lot to be desired. Like the lack of PVE content. There really isn't any pve content except for the professions trainers and the profession agents. They have about ten different missions at each level and they are the same no matter what race or corporation you get them from. Doing missions gets you loyalty points that are only good where you earn them. They get boring very quickly because you have to repeat the same missions quite a bit to earn enough points to get anything good.   If your looking for a good PvE game then look somwhere else. If your looking for a good craft / farming/ grnding game its not to bad. If your looking for a PvP game to invest a lot (several months depending on how fast you figuer out what skill are needed) of time waiting for your character to level skills and trying to figure out the game itself then I guess it would be worth it.   They say Eve is a niche game and I guess thats true. Alot of the players have spent years trying to develope their characters and don't want the game to change. The developers have done just that.  This is a post quote from a long time player concerning the PvE side of the game. I thought it should be added. I dont know how long it would take to get to this point but, after the initial rookie missions grinding you can do what is described below.  '1: Do missions for one of the thousands of agents in the high security systems, earning money for better equipment, rising from level 1 agents up to level 4 agents as time passes. 2: Do exploration, finding areas of interrest in the galaxy, and trying your best to exploit those areas for things to sell back at a starbase. Mind you, there are other things to do, but these two things are what I would define as action oriented Content in Eve. At some point during these first weeks or months, you start to figure out that there are a few more things to do, which would be the Eve equivalent of 'end game content'. 1: Level 5 missions, which is group oriented missions, using the same approach as level 1 through 4. An analogue would be 'dungeons'. 2: Incursions, which is a system wide alert, as a pirate faction moves in, locks down a system, and tries to kill everything. These Incursions will spawn areas in the system which are geared for anything between a few pilots working together, to dozens of pilots. The equivalent would be 'raids'. 3: Wormholes. These are systems 'off the grid' so to speak, with combat (and exploration and mining) quite a bit harder than what you would find in normal space. You could compare these to 'Elite areas' in other games. Keep in mind, none of what you do in Eve can be truly classified as PvE, since at any time, you can meet other players with hostile intent. It is like playing on a 'PvP Server', with no safe zones.'",
            "review_score": "-1"
        },
        {
            "review_text": "This game has a lot of strong points, but ultimately I cannot find it worth a subscription fee. It feels like endless grinding for something that can be lost in a matter of minutes -- and I'm not against that necessarily, but the grinding isn't particularly fun, either.",
            "review_score": "-1"
        },
        {
            "review_text": "Takes too long to establish yourself without becoming a wage slave to some other player. I can do that in real life, I don't need a simulator for that type of thing. ",
            "review_score": "-1"
        },
        {
            "review_text": "It's an alright MMO, but can get very boring if you're not in a Corporation in 0.0 (lawless) space. Also, annoyingly if you buy the game on Steam you can't use the 30 days with your existing character...",
            "review_score": "-1"
        },
        {
            "review_text": "I have played Eve for a long time before I had to stop for personal reasons. And the game is AMAZING. This game can offer something for every type of player. You like to fight get the right ship and wreck some pirates. You like to trade get your selfe a hauler and trade away. You like to mine get your selfe a Mining barge and melt some Astroids.  But why a negative review on a game that is apperently so good?  The negative review is not because of the game or what it has to offer but because of the way it represents it selfe in Steam. Its placed among the Free to play games. but its not free to play. When I was looking through the free to play games and found Eve I was absolutly stoked, finaly I could dust of my Retriever Mining Barge and get mining again. But when I logged in I found that free to play doesn't mean free to play in Eve. Free to play means 'hey heres your tier one ship get hooked and give us money'. Sorry thats not Free to play thats a demo.  If you like MMORPGs and you like spaceships and complex gameplay, eve is defenitly worth a look but don't be fooled that it is free.",
            "review_score": "-1"
        },
        {
            "review_text": "UPDATED REVIEW: I've returned and enjoyed EVE, but not for long. After mining and gearing up, I've spent some time in LowSec. The bottom line is: LowSec is DEAD. If CCP revives it, I'll be hooked. Meanwhile, forget about LowSec PvP. :(  OLD REVIEW: Give it some actual gameplay mechanics, it would be the best game in the universe.   It's an amazing world with a huge economy and tones of mechanics for social interactions between players and factions. It's great looking with a very classy style. People are friendly and mature. YET, it's a game you can play with only your left mouse button... Add twitch-based dogifhting and walk-in-spacestations, and I would probably play it forever.  Meanwhile, enjoy the best Excel simulator out there, and hope Star Citizen gets it right so that CCP feels pressured to turn EVE into the game many of us wish it was.",
            "review_score": "-1"
        },
        {
            "review_text": "I've always dreamed of a Space Simulator where I get to be in my spaceship and not fly it.  click click  click click-click click  So much fun ..... When is Star Citizen being released?",
            "review_score": "-1"
        },
        {
            "review_text": "A little too much micromanaging for me. It is a good game...if I had the time. Too hard to just pick up and play.",
            "review_score": "-1"
        },
        {
            "review_text": "+ Game is actually very good, graphics, gameplay ... everything is just perfect.   - And then you meet russian mafia. I guess - to enjoy this game to full extent you have to be very social - ideally play with group of friends. If you try solo, you end up dissapointed. Yes yes, you can join corp, but .. these people don't talk to each other really. It's like CS:GO but these people own half a universe and camp at all low-sec gates all day just to obliterate you. Aaand they have big big ships too. With bigger guns.   - The game itself is very, very unforgiving. Work hard to get enough ISK to get that dream ship? Ok - you might just get it, only to see it blown up when flying out of the station you got it. True story :) You work hard to get next one .... but this time you insure it. Another will get blown up, you will get the money, but ... then you spend half a day chasing that missing equipment you lost. That brings me to my point, most of the game you travel. And it's slow. If you have time to kill, this is ideal. Everything is slow (except when you find russian mafia). One of my combats with NPCs took 15 minutes to kill single transport. I went to take a dump, only to find it's not over yet.   + On the other hand, level of complexity - it's just amazing. So many items you can loot and put up on your craft, I have never seen so many. And I played for a week only. And I have explored perhaps 1% of it. Maybe less.   + It looks good too, while system requirements are pretty modest. That's a big plus.   - Also crashes a lot on Mac. What a shame (MacBook Pro 13, Late 2014).   Overall: Looking back after a week of intense play (played more hours than shown here), I have to conclude that this is very very slow paced game, if you don't mind getting blown up all the time by super aggresive russians, or to travel 1 hour just to get your new missile launcher, this game might be for you.",
            "review_score": "-1"
        },
        {
            "review_text": "151 hrs on record. 150 of them were sitting in a station queuing up skills and wandering off to make food or watch tv. It seemed like everything I tried to do in the game was wrong and any time I tried to venture to make money, I'd get gatecamped and lose more than I gained.  Progression is just far too slow unless you have a megacorp that you belong to. Unfortunately, that's just not my playstyle. Cool ships, cool concept, cool open-worldness. I simply don't have enough time between work and real life to make this game pay-off or be enjoyable.  Hoping Star Citizen allows a bit more freedom and feeling of reward.",
            "review_score": "-1"
        },
        {
            "review_text": "I enjoyed the game... but it didn't hold my interest I loved how skill training wasn't a grind fest. But I ended up logging in every 2~3 days to queue up skills... then log off  This game isn't for perfectionists who like to max levels before facing off bosses. In this game, bosses are other players who have played 3~8 years, and you stand no chance against them unless you play that long.",
            "review_score": "-1"
        },
        {
            "review_text": "I hate it.If you wanna play this game,don't buy it via Steam,you should subscribe it on the official website  www.eveonline.com . It can't be combined with any existed account,if you've got a account,don't buy it again through Steam.You can make your local application go on Steam, by'add a non-steam game'. Buy it via Steam,you'll be unable to log in except launching Steam. And the 2,this game perhaps needs you two or more accounts to play together,Steam doesn't let you do so. You'll get no service of Valve. You also can't play trail on Steam. THIS GAME ON STEAM IS FXXKED UP!!!",
            "review_score": "-1"
        },
        {
            "review_text": "The only way to enjoy this game now is to build a time machine and go back ten years, new players will always be inferior to veterans because of the skill queue system, and most of the ♥♥♥♥♥ who play this game greif new players and arn't very helpful. You can't play this game solo at all, and you can't do anything that even remotely resembles fun if you dont have the ingame money to pay for the ships and equiptment that you will lose to greifing players. So you're either going to spend a lot of real world money to buy fake in game money, or your going to spend all your time mining and auto piloting to stations to sell your ore for pennies on the dime because the player driven enconomy is ♥♥♥♥. THIS GAME ISNT FUN, its a job that you don't get paid to do. Peeling a sunburn is more fun then this trash.",
            "review_score": "-1"
        },
        {
            "review_text": "I love the fact that you have an MMO in outer space, I just didn't think space was this ♥♥♥♥ing boring!!!! With the new tutorials they have in place figuring out the game is pretty straight foward and easy, learning curve wasn't that bad for me, making money is fairly easy, but you have too in order to afford anything, my god the market is way out of whack for new players. I mean I made 20 million credit pretty easy, but I need like 400,000,000 credit for the ship I would want, I mean you literally have to have played this from launch to be in the upper tier and without help it would literally take you almost a year to get into that game, I mean if you want to pirate with a lesser ship you could probably do that in a few weeks, but frankly I think the combat is boring, mining is boring. I was really hoping to like this, it is unique but def not for everybody.",
            "review_score": "-1"
        },
        {
            "review_text": "Im like uhhhhhhh not really into a slow game.",
            "review_score": "-1"
        },
        {
            "review_text": "Game is sweet but very pointless when you have to work hard 3 months to be able to pay 1 month of gameplay, and i will not pay over 100$ each year to play this... I can't recommend this because i don't have will to play it my self, monthly paying is so re-tarded and gives you no freedom, and you can turn real money in to game cash and buy whatever you want if you have $$$, so it is pay2play and play2pay (both sucks).",
            "review_score": "-1"
        },
        {
            "review_text": "Never even got to play the game. Sad to say it was suppose to come with a free 30 Day Trial, but Steam didn't give the trial so I threw my money away. The only reason I wouldn't recommend is not based off of the game itself but the value you have to put into it.",
            "review_score": "-1"
        },
        {
            "review_text": "Almost impossible to for a alpha clone to get started. Everything is so risky and every small loss is hours of grinding to make isk.  ",
            "review_score": "-1"
        },
        {
            "review_text": "Don't get me wrong, I don't recommend it, but the game itself is great. I love it. The only thing is, its not free to play, its free to try. There are 2 types of players, alpha clones who play for free and omega clones subscribtion players. The restriction for alphas is huge. Only 1/4 of the games ships and skills are available and the skills that are available can't be upgraded to max lv. You can't use drones, omega's train skills faster and the list goes on.  Here's a vid with all the ristrictions.         YouTube™ Video:  EVE Online - Free vs Premium Accounts, What are the Differences? (Alpha vs Omega)&nbsp;",
            "review_score": "-1"
        },
        {
            "review_text": "0/10 broke all conflict in nullsec giving us unfinished work to play with while saying their goals were to disrupt large fights because they were 'not fun' haven't wanted to log in, in months. never again",
            "review_score": "-1"
        },
        {
            "review_text": "LOL I've never been bored so quickly, no cockpit view, joystick useless. Definitely not what I would call a space sim in the true sci-fi pc game sense of the word, more like a space economic sim or some such. If you're looking for something akin to Freelancer, don't bother, you'll just be bored.",
            "review_score": "-1"
        },
        {
            "review_text": "While the F2P addition is nice, CCP still don't understand what F2P actually means. With this update, they're just being like World of Warcraft, allowing players to play up to a certain point, and then charging them if they want to get to another level. It's just plain ridiculous. CCP should learn from Elder Scrolls Online. While it is not free, at least they don't require any form of subscription to play the game. Contents that are considered to be DLCs in normal games are optional, not really affecting the game in any way, thus allowing people to play the game without getting harassed on subscription fees every few months or so. They need to get themselves together &amp; decide which path they wanna follow. World of Warcraft isn't exactly flourising like it was 10 years ago, and EVE Online will not do any better unless you, CCP, decide to either go with ESO-style, or totally F2P. Just do something right for once, and prove you guys are better than Blizzard.",
            "review_score": "-1"
        },
        {
            "review_text": "Literially the WORST game I have ever played. The graphics and music are fine, but the controls earn a nice 0/10 with no joystick support, and the controls feel clunky, slow and hard to get used to. I wouldn't even buy This if it was $5. Not worth the $20 I paid. (I will refund it right after making review)",
            "review_score": "-1"
        },
        {
            "review_text": "From what i can tell, the user subscription thingy rips you off",
            "review_score": "-1"
        },
        {
            "review_text": "From what i can tell, the user subscription thingy rips you off",
            "review_score": "-1"
        },
        {
            "review_text": "It's trash.  You wait around for weeks or months to get into ships or use equipment, and then you barely know what you're doing. The games just for people that already have years of time put into it. OR spend 40 or $50 on ingame money so you can buy skillpoints and actually do something.  I've played a few hundred games at this point in my life, and I have to say, this could have been something, but it's just boring trash.  just tiny little itty bitty witty pixles shooting at eachother. Yawn.  Only good thing about it is the economy.  You wait, and wait, and wait, and wait, and wait, then wait, and wait, then wait, and it's so boring.  a yawnfest economy simulator. Do not buy",
            "review_score": "-1"
        },
        {
            "review_text": "It's trash.  You wait around for weeks or months to get into ships or use equipment, and then you barely know what you're doing. The games just for people that already have years of time put into it. OR spend 40 or $50 on ingame money so you can buy skillpoints and actually do something.  I've played a few hundred games at this point in my life, and I have to say, this could have been something, but it's just boring trash.  just tiny little itty bitty witty pixles shooting at eachother. Yawn.  Only good thing about it is the economy.  You wait, and wait, and wait, and wait, and wait, then wait, and wait, then wait, and it's so boring.  a yawnfest economy simulator. Do not buy",
            "review_score": "-1"
        },
        {
            "review_text": "The golden age of EvE has passed. They have continually added features to draw in more players that have been of a slap in the face to veterans. Most recently the ability to buy skill points.  It's not a terrible game, it's worth trying. But whatever you do, don't play by yourself.  Don't play this unless you are willing to invest hundreds of hours into a brutally steep learning curve. Don't play this unless you have at least a little interest in economics.",
            "review_score": "-1"
        },
        {
            "review_text": "When you install this game, there is a progress bar for the download. This is quite fitting, because watching progress bars grow and numbers count up (or sometimes down) is the core gameplay in EvE Online.  EvE Online has a huge variety of things to do. You can mine, which means watching a progress bar counting the time until your cargo hold is full. You can produce ships, modules and ammo out of the ore you just mined, which means watching a progress bar counting the time until your production is finished. You can research 'new' technology, which means watching a progress bar counting the time until your Incursus blueprint has a -8% bonus on material input instead of the -6% bonus it had before. You can drive a space truck through space, which means watching the autopilot do its job and wait until the number of jumps left reaches zero. You can do Exploration, which means doing a couple of minigames over and over in bland copy-and-paste environments, but gives you some nice loot. You can join Faction Warfare and orbit around beacons in deadspace, waiting for a progress bar to fill up, telling you that you captured the beacon and got a bunch of loyalty points for it.   Of course, other people can attack you while you do this stuff, which gives you the entertaining experience of pressing F1 and then hoping that your progress bar takes longer to deplete than the opponents'. Well, you could also run away, unless your opponent has a Run Away Prevention Thingy fitted on their ship, in which case you are screwed. But of course, that's not the end of the game. You can always bunnyhop all across the universe to buy a new ship (the old one is permanently lost) and modules for it, and only half an hour later you can be back in the thick of things and enjoy another ten seconds long fight. Maybe you will even win this time. If not, well. Just start again.  There is PvE combat as well - it's just like PvP, but without the risk and with even less variety in the enemies. It's a great way to get money and stuff, but like any good way to get money in this game, it's mindnumbingly tedious.  The learning curve is not as hard these days as it once used to be and there are always helpful people online in the newbie corporation chatrooms. That's a good thing. But still, EvE is not the most accessible of games, and every wrong decision can have permanent repercussions. There is a distinct lack of sandboxes in which people can try out, for example, how to do PvE combat without risking the loss of their ship. Every loss and every error is permanent. That's a huge part of EvE's appeal, but also a huge part of what makes it feel like a concrete wall for many new players.  EvE certainly is unique in many regards. The central cluster for everybody is an awesome thing and I wish more MMOs did that. The huge degree of persistency and player-driven politics is also certainly interesting, but it is far less appealing in the game than it sounded to me on paper. Yes, players have done great things in the game - the memorable Goonswarm / Band of Brothers wars, or some of the more famous scams. But the point is, you will likely just be a corporate drone forever. If that sounds appealing to you - go for it. If you are more interested in market manipulation than in spaceship combat, give it a try. But if you want to do awesome, memorable things in space, EvE is likely to disappoint you.  To end on a positive note - CCP has great customer support that usually responds to tickets in a matter of hours, and they deploy bugfix patches every couple of days. Many other MMO operators could really learn from that. But sadly, good customer service doesn't make a boring game any better.  I wish I could recommend this game, and I would probably love this game if the core gameplay could offer more interesting challenges and fewer boring routines. But how the game is right now, it feels more like work than entertainment.",
            "review_score": "-1"
        },
        {
            "review_text": "In this game you spend a lot of time just reading text and data on screen and clicking menu buttons. Click to fly, click to mine, click to trade, click to quest and so on. For me that limits the immersion I want to feel from an epic space game.",
            "review_score": "-1"
        },
        {
            "review_text": "...",
            "review_score": "-1"
        },
        {
            "review_text": "pretty much impossible to enjoy on your own, not recommended for people that don't enjoy being around others.",
            "review_score": "-1"
        },
        {
            "review_text": "An expensive 3D Space Themed Chat Room for Nerds. Think Second Life in Space.   Features include the ability to buy a $20 Virtual T Shirt &amp; $70 eye patch that only you can see.   Other features include a sandbox enviorment without any game content / missions / Story so that your immagination can fill in all the blanks like when dad gave you a block of wood for Xmas &amp; told u its the Batmobile and only costs £900 &amp; a 5 year wait to get a decent char.  Really awesome people get to pay twice to get a pretend friend to make them look rly popular!!!",
            "review_score": "-1"
        },
        {
            "review_text": "I tried this game during the free month I got with it, but I did not make it the whole month even.  Point and click games jsut are not fun to me any more, no matter how many spreadsheets they add to the game.  Save your moneyz for Star Citizen!",
            "review_score": "-1"
        },
        {
            "review_text": "First of all the comercial is deceaving, it makes it look like you can acualy controll the ship. Relly it's a point and click game. Iv'e ben playing for 1 hour and still havent finished the tutorial. It doesnt relly have any thing to do with skill, it's just who has the bigger guns. The player modles and ship designs are good, but that doesnt eaven out how the fact that you dont realy do more than sit around and click on things. I felt like a lot of my money was wasted and I could have bought a much better gamw for that amount of money.",
            "review_score": "-1"
        },
        {
            "review_text": "game for ppl of patience...uninstalled",
            "review_score": "-1"
        },
        {
            "review_text": "I don't recommend this, this game doesn't like to load. More importantly it doesn't allow you to change the game to windowed... I can't say one good thing about a game that doesn't allow me to even play... If this gets fixed maybe i'll redownload this, but for now this game is just trash... Oh and a thing to recommend, make it so we can change the graphics in the LAUNCHER! I'm saying this because that might work, and fix my loading problem :D.  Once this game is fixed and updated, i'll reconcider downloading it. ",
            "review_score": "-1"
        },
        {
            "review_text": "This Game gets boring fast. all you do day in and day out is mine mine reprocess anything else you can do?",
            "review_score": "-1"
        },
        {
            "review_text": "Note: I have played  wayyy  less than Steam records. I leave the game running at night, access it remotely, yadda yadda.  - Free accounts are extremely limiting + You get to buy premium time using ISK (in-game currency, not 'premium' ♥♥♥♥ or anything) - Game broke two or three times on my well maintained computer, refuses to work now + Has a good read-only API (even allows you to set up automatic payment systems) - Community consists of an incredible amount of scammers, gankers and people wanting to destroy you and your resources for sadistic 'fun'. + It sorta makes finding friendship much more valuable - You never know when your friends are gonna turn on you + Has a nice market system where you can buy/sell goods on, make some money space trucking - You have to spend months, even years on a game just trying to grow your virtual assets before you can amount to anything + This actually makes your assets worth something: your labor - People can literally just buy what they want if they invest real world money by buying PLEX and selling those for ISK - People can buy skill injectors and arbitrarily grow their character  I dunno, try it out if you want? It's free. I wouldn't spend real money on it. I have better things to do than worry about my virtual ships getting destroyed by ♥♥♥♥♥♥♥ Russians. Yeah. Lots of Russians already, so I'm sure they're going to ♥♥♥♥ up this game by being subhuman too.",
            "review_score": "-1"
        },
        {
            "review_text": "my spyware says this game, cimes complete with a viruis",
            "review_score": "-1"
        },
        {
            "review_text": "I have 5 years experience in this game, this game is designed to suck out money from you and yes its true u can play for free if yuo will spend 5h a day in game or soo : D PVP in game is terable because off lagg, specially large Fleets.And its too hard to make money in the game but very easy to lose.All you are doing in the game thet you killing the red croses or otherwise trying to earn money to buy plex (Game time).If you absolutely do not have your real life and then maybe you can play this game.Highly not recommended to start to play this game. It is my impression after 5 years in game.",
            "review_score": "-1"
        },
        {
            "review_text": "Im putting a no, I enjoyed the game until it got boring needless to say. I wanted to be a trader and go from one staion to the next......boring....the combat in this game is a bunch of clicking and its boring. its fun at first but pretty boring.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is real fun despite how complicate the gameplay is, no doubt. Highly depends on teamwork. But there is a real big issue - price of the game. you have to pay in game to play plus you have to pay in steam for the game, which really really sucks. I would not recommend this game unless you have 30 dollars every month to spare for it or enough free time to give up to it not to pay for it but to pay for real money but with in-game currency.",
            "review_score": "-1"
        },
        {
            "review_text": "I really like this game. I really do.  However, some things are not well explained, and it takes hours to learn anything.  If",
            "review_score": "-1"
        },
        {
            "review_text": "Didnt get to use my 14day free trial, downloaded it played then tryed to get on the next day and wouldnt let me on? Didnt get to play it that much to make a desicion if i liked it of not. But not happy i didnt get the 14days to be able to make a decision.",
            "review_score": "-1"
        },
        {
            "review_text": "The main of the game is that it is built to be played multiboxed. On top of that the game has been balanced over its lifespan with a 'cater for the goons' (one of the more sizable playergroups) mindset.  For even the basic PVE content you have to have 1 scout running, your actual character, and your 'suitcase' character, and you are disadvantaged heavily. If you want to do it effectively you need a scout covering every route to your farming system, 3-5 working ships, and 1-2 support ships, and you also need to be paying another playergroup money to provide deeper scouting/security (ie renter corps). Depending on what you intend to do you will need more than that, those '3000 account battles' you hear of only represent a few hundred players.  The game has ended in the situation where you have packs of 30 ships, which represents 3-10 players depending on what mutibox software they are using. Roaming around stamping on everything which does not have the numbers to stamp them out.",
            "review_score": "-1"
        },
        {
            "review_text": "Played it for months before steam, wasted more than 100 USD and couldn't get to the 'fun' part. You need to grind forever and with 'unique' leveling system you will never be as good as players that started playing years ago.",
            "review_score": "-1"
        },
        {
            "review_text": "You buy a starter pack and you play the game for how many hours then you cant play it anymore.... this sucks what a waste of money.",
            "review_score": "-1"
        },
        {
            "review_text": "IT was fun in the beginning but i got bored after 30 hours. Yep, you need ♥♥♥♥♥♥♥ hours to buy ship and also you have to train yourself to drive that thing too..",
            "review_score": "-1"
        },
        {
            "review_text": "This game takes far too much time to play, is extremely complicated to master, and is nothing but a simple murder society - everyone is killing everyone everywhere. The game forces you to make isk to progress, then gives all the advantages to the players that want to take isk from other players. A player is provided with very little defense, but the game provides all the advantages to the offense. IN summary, it is a pointless game, requiring lots of skill and time and money, yet you will never win, no one ever does. Move on from this game, play games that do have a win condition for you as a player, this one does not.",
            "review_score": "-1"
        },
        {
            "review_text": "good game but not worth the subscibtion money ",
            "review_score": "-1"
        },
        {
            "review_text": "This game looked really cool and it probably is really cool. The entire 40 mintues I played this game i did nothing. I spent 5 minutes going to large rock, then i asked for help in the help bar in-game, then get yelled at and told to go play cod. I picked an agent and set a destination to the agent but i didnt know what the destination looked like, so i asked on the bar, I was never answer, so i spent 10 minutes traveling to about 15 things none of which i could go in activate a quest on have anything to do other than ,orbit, approach, or keep distance. Over all I think this game would be worth buying if you are willing to spend 5 hours figuring out how do litteraly anything but fly to large rocks.",
            "review_score": "-1"
        },
        {
            "review_text": "/b/ in space plus combat spreadsheets, nuff said, If that appeals to you this is your wheelhouse, otherwise you'll play for a bit lose interest maybe pick it up again and quick lose interest again. Wasn't my cup of tea. would avoid playing again",
            "review_score": "-1"
        },
        {
            "review_text": "Decent enough game until you want to cancel your subsribtion. Then they start making you jump through hoops. But otherwise seemed like a good game, just not my kind of game.",
            "review_score": "-1"
        },
        {
            "review_text": "CCP Games does not care about their customers their support is non-exsitent, Dont play this game its rubbish.",
            "review_score": "-1"
        },
        {
            "review_text": "Failed to download update for EVE Online Launcher",
            "review_score": "-1"
        },
        {
            "review_text": "Nice to have tried EVE Online. Too bad I keep disconnecting and IDKY. So, no. Not playing this anymore.",
            "review_score": "-1"
        },
        {
            "review_text": "UI was way too small even at 150% on my 4k televisoin.",
            "review_score": "-1"
        },
        {
            "review_text": "Such an intricate game that I was ready to commit to for the long haul, but I refuse to pay a monthly or yearly fee to play a game. $131/yr, $15/month....that is way too much, i'm sorry. It's the same reason I never played WoW. We aren't all rich and have money to blow. Its too bad.",
            "review_score": "-1"
        },
        {
            "review_text": "The game has one of the most hostile communities in the world, the contnet is dull, the game is locked behind either a time or pay gate, it's up to you to decide if you'd rather spend months or hundreds of dollars in order to access even the most dreary content.   An hour spent in EVE Online is better spent attempting suicide.",
            "review_score": "-1"
        },
        {
            "review_text": "  *waits quite a long time to install the game*  *takes a long time selecting race &amp; bloodline, then customizing the character*  *finishes customizing the character*  *game turns out to be VERY boring*  i hope it's just because im at the beginning, because if not then i don't know how people can actually spend money on this crap.  on another note (that might not be as relevant) i heard that opportunities are more like achievements rather than tutorials... if you're gonna have achievements on your game why not just call them achievements?",
            "review_score": "-1"
        },
        {
            "review_text": "this game is SO TIME CONSUMING jesus christ dont get this game its so old and stupid. youll be sitting at your PC all day doing nothing. they even have a feature where you 'train your skills' without even playing the game because they know nobody plays this ♥♥♥♥ its so boring",
            "review_score": "-1"
        },
        {
            "review_text": "This game makes you work to play it. It could be a fun game, if you spend 3 hours learning the basics.  EDIT:  It took me over 5 minutes to get past the LAUNCHER. The launcher told me to sign up for an account, so I did. Then it didn't send me a confirmation email. I closed the launcher and restarted the game, and then the game told me I could use my Steam account to play the game. wtf?  Another great thing, I already had an EVE Online account beforehand. I tried logging into my account. The launcher told me I had to enter the name of one my characters. How the ♥♥♥♥ am I suppose to remember the name of my ingame character??? Why doesn't the security system just email me a code to my email and then let me enter it into the launcher instead of this bullsht.",
            "review_score": "-1"
        },
        {
            "review_text": "not free to play free to try you can't actually do everything in the game for free, straight up lying to consumers is a bad buisness choice.",
            "review_score": "-1"
        },
        {
            "review_text": "Eve online is a really cool game however, it is hard to figureout what they want you to do and it's very dificult to navigate, it even gets harder since you have to use your mouse to steer, shoot and warp, if they ever add a first person view with a 'WSAD' conrol suport it would be crate fully apritiated.",
            "review_score": "-1"
        },
        {
            "review_text": "the games a useless peice of ♥♥♥♥ing ♥♥♥♥ dose not run after about a week because of some ♥♥♥♥ing file lock which can only be removed by reinstalling windows and wiping out your entire game libaray to trick steam into running the game again and if you forget ♥♥♥♥ your going through it all over again",
            "review_score": "-1"
        },
        {
            "review_text": "Played it for 1 hour and a half, didn't understand anything. Rage Quit!",
            "review_score": "-1"
        },
        {
            "review_text": "Confirmation email didn´t show in my Inbox, so I can´t play. So, screw you! :D",
            "review_score": "-1"
        },
        {
            "review_text": "Fantastic game...but... Graphics are amazing, tech and research is fun, sooooo much potential to do pretty much whatever you want as a player. So immersive that it requires a second life (of which I do not have) to play and actually progress. Definitely not the kind of game you can decide to pick up for an evening. Monthly subscription (meh). If I didn't have a family, other hobbies, and a busy schedule, I'd play...but...",
            "review_score": "-1"
        },
        {
            "review_text": "At first this game overwelmed me and excited me with its content. Then I met the people in it and explored the universe. Lulz as so fourth. This game rating should be rated immature.",
            "review_score": "-1"
        },
        {
            "review_text": "After playing for 2 years here is my conclusion: The worst game you ever have to pay so much for so many Boring activities ,  Its made unplayable for all players especially new players so you keep paying your monthly fees with real money , you have to join Corps to do anything and will treat you like you are an employee working for them ,  it brings the worst to everyplayer I met there ,and when someone scam another it considered short of celebrity. Lots of trolls this game. The addiction to play lays on the negativity on losing something (ship ,isks were ever) and you get mad so you keep playing like gamblers do.  When you play at first you will be on a 'Hight sec' that will give you short of security to learn the game ,buy ships do stuff etc, guess what , there is not such thing , it s a game scam to hook you on their loop of addiction by losing. Practically the game developers favor big corps to market their poor product and not single players to have fun playing a game with couple of their buddies.",
            "review_score": "-1"
        },
        {
            "review_text": "Fix buy subscriptions with Steam wallet, its silly u demand us steam users to use the plex system instead of letting us buy monthly subs from steam wallet shame on you. until you fix this and make sure the intrigation with steam really hits its full potential i see no reason why i should recommend anyone on steam buying this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Fantastic game...but... Graphics are amazing, tech and research is fun, sooooo much potential to do pretty much whatever you want as a player. So immersive that it requires a second life (of which I do not have) to play and actually progress. Definitely not the kind of game you can decide to pick up for an evening. Monthly subscription (meh). If I didn't have a family, other hobbies, and a busy schedule, I'd play...but...",
            "review_score": "-1"
        },
        {
            "review_text": "When I started the game I felt optimistic about the game, but then when it started freezing up because of extremely high graphics settings in character customization and not even a change to change them until you finish customizing, it was a let-down, so until they let customers have a menu with settings and other things I'm not going to think about starting the game again.",
            "review_score": "-1"
        },
        {
            "review_text": "After this new Ascension update, EVE just went to hell. 3 of my 5 accounts are not accessible for some reason. It said my password/username is wrong. I know its not wrong because I write down all my username and passwords on a sticky note. And after several attempts at requesting a new password I was responded with bad links for resetting my password on all 3 accounts. Takes me to a eve webpage that says the link expired or is invalid. I give up. on this game. Its just sad to see a once great game turn into this. I can only hope that they revert this game back to when it was good back between 2005-2010. But most likely it wont happen.",
            "review_score": "-1"
        }
    ]
}