{
    "app_id": 90400,
    "name": "Blue Toad Murder Files™: The Mysteries of Little Riddle",
    "release_date": "2010-12-03",
    "developer": [
        "Relentless Software"
    ],
    "publisher": [
        "Relentless Software"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Shared/Split Screen"
    ],
    "genres": [
        "Adventure",
        "Casual"
    ],
    "tags": [
        "Adventure",
        "Casual",
        "Puzzle"
    ],
    "achievements": 0,
    "positive_ratings": 59,
    "negative_ratings": 13,
    "price": 2.99,
    "description": "Blue Toad Murder Files™: The Mysteries of Little Riddle is a one to four player co-operative episodic download game published by Relentless Software. Set in the sleepy village of Little Riddle, the main aim of the game is to follow clues to find the murderer.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/90400/header.jpg?t=1447353730",
    "minimum_requirements": "OS: XP/Vista/7 Processor: 1.7GHz Memory: 512MB Graphics: 128MB DirectX 9 compatible (Shader Model 2.0 minimum) or better DirectX®: 9 Hard Drive: 3GB Sound: DirectX 9.0 compatible",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "An easier, more entertaining version of Professor Layton games. With some of the funniest characters I have seen in a long time.  Also no one seems to use their arms. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I adored this game, although it is definitely one to play with a friend or two, as it might be a little boring played on your own. The game is cut into nice litle chapters, each taking probably an hour to complete, depending on how many players you have, and how good you are at the challenges.  The puzzles range from fairly easy, to downright nasty, and you may find yourself stuck a few times. The voice over that narrates the story was brilliant, and very entertaining, the voice acting was likewise very good. Each character in this story has their own personality and uniqueness, no two are the same! It makes for a very enjoyable, funny, and interesting game, and overall I would say this is a little jem. It looks childish on the surface, but I very much enjoyed it and think others would too!",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game! It is witty and fun while providing some challenging puzzles. Great for any mystery lovers (:",
            "review_score": "1"
        },
        {
            "review_text": "Technically this game isn't an adventure game, it's actually a party puzzle game with a story. Each player takes turn to solves puzzles to earns some medals and learn some truth and information. Although this game isn't an adventure game, you'll have to use your detective skills (deduction and observation) to find the real culprit in each episode.  The gameplay is pretty straightforward, you don't need to solved every puzzles or correctly guessing the real culprit, the story itself will move forward anyway.  For $19.99 this game is pretty expensive. I recommend trying the demo first. If you like it you should buy when it's on sale (probaly around $5-$7). I'm not recommend buying at full price beacuse for $19.99 you can buy better games with better story, such as Syberia, Broken Sword, or Emerald City Confidential.",
            "review_score": "1"
        },
        {
            "review_text": "Even though the game irritating time bazed puzzles (not my kind of casual...) it's nice and fun. The narrator is really a sole reason for playing through this game. Could have been really great, but I still recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Got this in a bundle.   There's about 7 hours of gameplay, depending on how fast you do the puzzles. It seems to be aimed towards children and has the vibe of playing a children's game throughout.. however the puzzles are definitely not aimed towards children. It also uses a large vocabulary which makes me wonder whether the game was supposed to be aimed towards children or not. I don't think that a young child would be able to complete a lot of the puzzles in the game.  The Good: -The aesthetics, graphics, character design etc are all pretty good. I like the way the town is designed. - The game has a lot of narration and is occasionally funny. - It has local multiplayer. Not sure if it's any good though because i haven't tried it.  The Bad: - The puzzles start off very easy but quickly get to be pretty difficult by the start of the second act. A lot of them i found to be not very well explained which made me end up skipping through a lot of the puzzles.  -There's a feature where you can replay a cutscene from the beginning by clicking the mouse towards the end of the cutscene. I found myself accidentally clicking just before the cutscene was over and that caused me to end up replaying entire cutscenes quite a lot.  - The game starts to become boring about halfway through, and it doesn't help that there's not much variation in the puzzles. There's 90 puzzles but there's only about 10 or so puzzles with different mechanics. You'll see a lot of the puzzles being repeated over and over but getting more different and with a different theme each time.  -You don't even need to 'play' the game, because you don't actually have to complete any of the puzzles to progress- you can just fail at them and then skip them. It doesn't help that there's no achievements either which makes it have no replayability.",
            "review_score": "-1"
        }
    ]
}