{
    "app_id": 91330,
    "name": "Iron Front: Digital War Edition",
    "release_date": "2012-05-25",
    "developer": [
        "X1 Software",
        "AWAR"
    ],
    "publisher": [
        "Deep Silver"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player"
    ],
    "genres": [
        "Action",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Simulation",
        "World War II",
        "Action"
    ],
    "achievements": 0,
    "positive_ratings": 434,
    "negative_ratings": 275,
    "price": 10.99,
    "description": "Command your own troops, man authentic weaponry and take to the sky in deadly warplanes.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/91330/header.jpg?t=1447355866",
    "minimum_requirements": "OS:Windows XP, Windows Vista or Windows 7 Processor:Dual-core Intel Core 2.4 GHz or AMD Athlon 2.4 GHz Memory:1 GB RAM Graphics: Nvidia Geforce 8600GT or ATI Radeon 3650 or faster with Shader Model 3 and 512 MB VRAM Hard Drive:10 GB HD space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "after dive bombing soviet convoy enemy AA took out my left wing, parachuted into Ukrainian village, found dead sniper and took his rifle, hid upstairs in restaurant overlooking the square and waited 2 hours, attempted to assasinate the Soviet commander but missed and was killed by a T-34 high explosive shell that came through the window into my face.  10/10 Would fly Stukas again.",
            "review_score": "1"
        },
        {
            "review_text": "Overall a great game! It has its issues but if you love WW2 history and are want to see the war from the German side, this is the game for you!",
            "review_score": "1"
        },
        {
            "review_text": "Anyone looking for an accurate layout of Omaha beach will probably be disappointed with the D-Day DLC. Although the map of the St.-Laurent sur-Mer area looks pretty accurate, it fails to translate to the ground (have been there personally). There is also a strange island off the shore and there are mountains visible where it should be only ocean. Also, there is no map of the areas involved in Airborne operations. Other than that, the game is a great WII shooter with the feel of ARMA.",
            "review_score": "1"
        },
        {
            "review_text": "Better then Arma but since the game spy shut down multiplayer is kinda hard to play now. Which was one of the best things on this game. Anyone that has a massive server and group still add me! The games singalplayer can be fun if you know how to make maps. Making a simple map is not that hard at all really. I do like it more then Arma. Deaths arnt so crapy looking. Just look up senarios online or use your imagenation to make a small simple map or a huge lag fest battle and have fun. This gmae should get more credit, but I will say it can be a time consumer when making a nice map. However its pays off most of the time.  EDIT If you get Hamatchi you can still play with your friends now. It's easy to set up and I do really suggest this game. This game is way better than Arma 2 was, the only thing they did wrong with this game was not advertise it enough! I got back into this game recently and man I missed it. I wish they would have kept updating it.",
            "review_score": "1"
        },
        {
            "review_text": "Very good game, i love it!",
            "review_score": "1"
        },
        {
            "review_text": "Good game, though like all arma games it requires quite a beast pc, however I would recommend for WW2 junkies.",
            "review_score": "1"
        },
        {
            "review_text": "I Recomend it to people who like WW2 Or the arma sieres as its got all the ww2 geeks want like the tiger panzer and t34 but if you dont like ww2 or arma i dont recomended to you :D",
            "review_score": "1"
        },
        {
            "review_text": "I think Iron Front is a good WW2 sim. I play it in Arma 3 with the mods.",
            "review_score": "1"
        },
        {
            "review_text": "this game is bad in a good way. the engine is WAY outdated, but thats what makes it fun. The only problem is it takes itself too seriously.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game! With more coming updates/fixes, sooner or later this game will easily outdo the Red Orchestra series, it's all up to the player base to make or break this game now, MORE PLAYERS ARE NEEDED! This is how RO2 should have been! I say give this game a chance people!",
            "review_score": "1"
        },
        {
            "review_text": "Love the game and looking for people to play it with if they have it on arma 3",
            "review_score": "1"
        },
        {
            "review_text": "Well this game is buggy and a little ugly, i like it, if you like mucking about in the editor for endless hours in Arma, you'll be right at home here, the campain is buggy aswell so campain fans beware!",
            "review_score": "1"
        },
        {
            "review_text": "Some bugs but overall great ww2 sandbox. Multiplayer is dead though",
            "review_score": "1"
        },
        {
            "review_text": "FUN! NO MORE ONLINE SERVERS THOUGH",
            "review_score": "1"
        },
        {
            "review_text": "Good game to have some fun in, the campaigns are good to have fun in, haven't really found any game breaking bugs, just a few small errors, overall it's a enjoyable experience. Although multiplayer is a thing it's still fun.",
            "review_score": "1"
        },
        {
            "review_text": "nice game but it's miss a MP server",
            "review_score": "1"
        },
        {
            "review_text": "A really good game, ARMA 2 on the Eastern front with almost everything used by both the armies, the main map is even bigger than Chernarus as well.",
            "review_score": "1"
        },
        {
            "review_text": "This game is one of the best representations of World War 2 that I have seen. It comes with 2 campaigns right away. Then you can create more and get more off the internet. The game uses arma's engine so it plays just as well. There is not a big community for this game, but there needs to be. You can make multiplayer missions in the editor also. I deffinitly recommend this to people who enjoy realism in games and world war 2 in general. Buy this game!",
            "review_score": "1"
        },
        {
            "review_text": "Kicks ♥♥♥ IE has great, MAPS &amp; TANKS !",
            "review_score": "1"
        },
        {
            "review_text": "Kicks ♥♥♥ IE has great, MAPS &amp; TANKS !",
            "review_score": "1"
        },
        {
            "review_text": "good if you want mass clash of world war 2 soliders and tanks ",
            "review_score": "1"
        },
        {
            "review_text": "Multiplayer is dead, campaign is literally unplayable because its so buggy, performance is worse than that of Arma 2. Nothing good to say about this game unfortunately, avoid at all costs (even the tempting 5 bucks that I paid for it)",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this game for multiplayer and it didn't give me that, cool cool.",
            "review_score": "-1"
        },
        {
            "review_text": "The game is dead , don't buy it , complete waste of money , ♥♥♥♥ you morons , game is dead no MP",
            "review_score": "-1"
        },
        {
            "review_text": " Make war! Or fail trying!",
            "review_score": "-1"
        },
        {
            "review_text": "I would say that this is basically a WWII version of ArmA II. In fact, if I didn't know it was a separate game, I'd call it a mod. The developers were too lazy to fix the game when GameSpy died, so there is no multiplayer. Their idea of compensation was a DLC that has no singleplayer campaign. The singleplayer campaign for the base game is cringeworthy anyway...  At least the tanks are cool.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a updated WW2 version of ArmA, but it has such a lack of content. Also the D-Day DLC is a joke, talk about lack of content. It has 2 tanks for the Americans and some cars &amp; trucks. Plus the American soldiers are crap, they have nothing to them, a helmet and a gun and maybe if you are lucky a backpack. Just does not feel right, And if your going to make a WW2 game why not put the japanese in it, Make war in the pacific. Leave it to Bohemia Interactive it leave so much out of it.",
            "review_score": "-1"
        },
        {
            "review_text": "Underpopulated servers, and honestly feels worse than the free I44 mod for ARMA:II, which comes across as more realistic (dependent on server). Don't waste your money when there's a free version of the game that's had just as much hard work put into it, runs on the same engine, and looks better.",
            "review_score": "-1"
        },
        {
            "review_text": "Just a version of ARMA modified to be WW2, not really that fun",
            "review_score": "-1"
        },
        {
            "review_text": "Instead of buying this. Take that money you would have spent and wipe your ♥♥♥ with it. Then burn it. Then flush the ashes down the toilet.  The end result is pretty much the same.",
            "review_score": "-1"
        },
        {
            "review_text": "where to start o-well  1. the countrols are to complicated 2. the team in single player never obey orders so there technically useless  3. don't know how to re arm team in single player  4. okay game but if they FIX so many things then it will be better  5. act's like that on recruit mode that it's sounds so easy but on Misson 4, 2 shots u are done and down until an idiot on the single player team decides 'um... sounds like I should go help him oh I'm sure he's fine'  6. good story line so far  FYI the Company that created the game took out the muiltiplayer WHY??  but at least there is the game Hero's &amp; Gen's.",
            "review_score": "-1"
        },
        {
            "review_text": "This probably has to be the worst game I've ever played. Never buy this game. It may look cool but it is glitchy and crap. The AI sucks too.",
            "review_score": "-1"
        }
    ]
}