{
    "app_id": 9160,
    "name": "Master Levels for Doom II",
    "release_date": "2007-08-03",
    "developer": [
        "id Software"
    ],
    "publisher": [
        "id Software"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Cloud"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "FPS",
        "Classic"
    ],
    "achievements": 0,
    "positive_ratings": 310,
    "negative_ratings": 69,
    "price": 0.0,
    "description": "Introducing the Master Levels for DOOM II. Twenty never-before-seen levels all with the same acid drenched, hell spawned horror of the originals. Each was created by independent designers and supervised by the demented minds of id Software. You might as well forget about seeing the light of day ever again.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/9160/header.jpg?t=1447351119",
    "minimum_requirements": "A 100% Windows XP/Vista-compatible computer system",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This is the ultimate version for all doom players like Plutonia experiment-it is very hard and very challenging-very good add on.  Rating: 85%",
            "review_score": "1"
        },
        {
            "review_text": "Id software compiled some of the best mods of the olden time and compiled them here. Now buy this. It's worth your time. It's like an early Steam Workshop!",
            "review_score": "1"
        },
        {
            "review_text": "This expansion for Doom II is only available through Doom Classic Complete, which I highly recommend. The Doom series was a popular series in the 90s and has had another game recently: Doom II. The expansion pack consists of 20 'WADs', with one WAD containing a secret level [the first screenshot on the store page]. Think of this as a bonus, as steam has yet to sell this separately.   This game runs via the acclaimed emulator DOSBOX, and you will find a copy of the application in the Steam directory. You will be able to select WADs via the Doom-It interface, where you can select one of the 20 levels. The WADs are extremely well designed and my personal favourites are TEETH and MANOR. However, this game is certainly not for everyone.  Try the Doom I shareware on DOSGames using DOSBox before you make a purchase. If you don't like the limitations from the original DOS version, you can copy the WADs into a source port's directory [such as ZDoom and PrBoomPlus] and you can play it from there. They introduce new High Definition graphics and add jumping and aiming abilities.   I cannot give this a score as it is not identifiable as a standalone title; you will need Doom II to play this so that is why Steam doesn't sell it separately. Overall, this is a great modification for Doom II. If you want to use other mods on Doom 2, you will need to use this command on DOSBox Doom2.exe -file [Mod].wad.  ",
            "review_score": "1"
        },
        {
            "review_text": "If you played Ultiamt DOOM &amp; DOOM II prepare for a more challenging experiance :)  Good points  1. Its harder :) 2. You can play in any order so choose a level that sounds intresting  3. Its an extra horde of hell spawned demons to slay and take your revenge on, for what they did to your pet rabbit daisy. 4. its like DOOM II Epiosode 3 so you got another whole DOOM experiance :)  The bad  1. nah just kidding DOOM is FREAKING AWSOME :) could not fault it.  so if you think the DOOM I and DOOM II levels are boring and old get this game :)",
            "review_score": "1"
        },
        {
            "review_text": "the people who made these levels were smart enough to not put terry traps in them",
            "review_score": "1"
        },
        {
            "review_text": "Master Levels for Doom II! AWESOME! COOL MUSIC! OVER 100 LEVELS",
            "review_score": "1"
        },
        {
            "review_text": "additional levels for Doom 2.",
            "review_score": "1"
        },
        {
            "review_text": "More of the same.",
            "review_score": "-1"
        },
        {
            "review_text": "  Does not work on my Computer ",
            "review_score": "-1"
        },
        {
            "review_text": "Being the Doom enthusiast (read: fanboy) that I am, you're probably going to guess that I highly recommend this and you're right. However, I'd only recommend getting this with the Doom Classic Complete package (which, as far as I know, is the only way to get Master Levels).  The 20 or so levels that you get range from somewhat easy to mind-numbingly frustrating, especially Jim Flynn's contributions (MANOR.WAD and TTRAP.WAD), so be prepared to save quite a bit if you're a Doom novice.",
            "review_score": "1"
        },
        {
            "review_text": "this game is really god  14/99 buy it with Doom II",
            "review_score": "1"
        },
        {
            "review_text": "timeless game will never really 'die' buy classic DOOM pack to get full 8-bit gore experience BTW if it doesnt work for you press CTRL+ALT+DELETE all at the same time, close game in task manager (or whatever the equivilant is on MAC) and then open again if it doesnt work, try as many times as necessary.",
            "review_score": "1"
        },
        {
            "review_text": "It's Doom. What else needs to be said? GET THIS GAME, NOW!",
            "review_score": "1"
        },
        {
            "review_text": "Nothing TOO challenging, especially if you can play Doom II: Hell on Earth on Ultra-Violence without much trouble, but worthwhile. Storywise... Well, they were meant to be a 21 Level Episode Expansion for Doom II, so in the canon of Doom II, there really is no story, but each map has their own story to go along with it (or at least most of them do). The best part is, you don't need to pay $15 for it (or at least I didn't), because it comes WITH Doom II: Hell on Earth. On the flipside, however, they don't introduce anything new. No new monsters, no new guns, no new obsticales. Just harder levels. Despite this, it definitely IS worth adding to your Steam Library. YOU SHOULD NOT buy the Doom Classic Complete pack, though, because you can get Ultimate Doom, Doom II: Hell on Earth, and Final Doom for $4.99 each, and as mentioned earlier, this comes WITH Doom II: Hell on Earth, so you would save at least $0.50 if you buy them seperate.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent addition to Doom! Although it takes some technical know-how to reap the full benefits of this expansion, it is most certainly worth it. Definitely recommend it!",
            "review_score": "1"
        },
        {
            "review_text": "Yez ♥♥♥♥♥ these levels is what i played on my ps2 like 4 years back and ive always looked for those maps on the pc on could never find theerniwerjuiworfjenjnkejrhrth 2 lazy 2 typ just buy it good maps yes",
            "review_score": "1"
        }
    ]
}