{
    "app_id": 92000,
    "name": "Hydrophobia: Prophecy",
    "release_date": "2011-05-09",
    "developer": [
        "Dark Energy Digital Ltd."
    ],
    "publisher": [
        "Dark Energy Digital Ltd."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 16,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Partial Controller Support",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "achievements": 13,
    "positive_ratings": 1270,
    "negative_ratings": 827,
    "price": 3.99,
    "description": "The ultimate edition of the jaw-dropping action-adventure game set onboard a floating city.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/92000/header.jpg?t=1447354153",
    "minimum_requirements": "OS: Windows XP / Windows Vista / Windows 7 with latest Service Pack Processor: Intel Core 2 Duo, AMD Athlon X2 Memory: 2 GB Graphics: NVidia 8600GT with 512MB RAM or Radeon HD 3650 with 512MB RAM DirectX®: DirectX® 9.0c Hard Drive: 8 GB Sound: DirectX Compatible Sound Card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Hydrophobia is a 3rd person action / shooter based around some great water dynamics. The water will flow from one room to the next, raise, lower, put out fires, and electricity will damage anything near it. Its a lot like being in a Zelda water dungeon.   This is a good game with gameplay mechanics that are on par with big budget games like Uncharted and Batman: Arkham Asylum. It has the ledge climbing, destructible environments, swimming, camera hacking, wall cover, sneaking and even a Navi, which is similar to Arkham Asylum's detective mode, which will let you find encryption codes on walls, open doors from a far, hack consoles with a mini game, access cameras.  There's a great balance between problem solving, shooting and exploration. There are only a few guns and really you won't need any other gun but the default phaser that you can hold the trigger to charge for bigger damage. There is a cover system, but I rarely used it. The downside for some purists would be the aim seems off since there's a 'target lock' system. What I mean is aim near something you can shoot and it lights red and will still count as a hit. Its not the best, but it stays in the realm of good. Even though the game encourages you to drown foes, electrocute them, blow up barrels and so on, it didn't really seem like I killed anyone in cool ways other than exploding barrels.  The controls feel good, aim, shoot, move, move camera, roll (although I never used it once), jump, sneak, weapon wheel, diving, emerging, sticking to cover and so on. The heroine's movement is just a little stiff, but that's one of the only downsides to this game.  The story is good for an indie action game, terrorists have taken over your cruise ship and you need to stop them. You've got a helpful voice that chimes in and tells you what to do, but it never feels like too much instruction. There are things left for yourself to figure out. There's even a nice waypoint to guide you in the general direction if you chose to use it to make the game easier for you to stay on task. It will always show you a dot on the screen where you need to go, but getting to that point is on you.  The game looks great, with really nice water effects and camera sprays. The voice acting sounds good and there are an over abundance of cut scenes at the start, but they ease up in frequency as the game goes on.  I've got the game on PSN and PC. Graphics wise I'd say PC is better, but it seems to be a beast on my PC's processor and not the graphics card. It is a game best played with a controller. The downside with PC is the camera feels chaotic.  The game is short and sweet. The whole single player campaign is like 3 - 4 hours (I completed it for PSN) and at less than $5 I'm fine with that. There are challenge rooms to extend the game's length. It doesn't overstay its welcome and its a game that makes me want to play other things that the developers come up with, but alas they're defunct as of 2012.",
            "review_score": "1"
        },
        {
            "review_text": "Great graphics, good story, pretty good gameplay...",
            "review_score": "1"
        },
        {
            "review_text": "First of all: the water effects are amazing! I liked this game very much for 4 simple reasons:  1 - It is an action-3rd Person-shooter game with a female caracter, unlike other action-3rd Person-shooter games. 2 - It is short, unlike other action-3rd Person-shooter games. 3 - Again, the water effect is marvelous, unlike other games in general.  4 -You can swim. Desperately swim for your life. Loved.  Recomended. ;)",
            "review_score": "1"
        },
        {
            "review_text": "Sadly no multiplayer, sadly it's short, and sadly the main character is a bit annoying.  But in gameplay it's a masterpiece. The best part (the end) is the shortest. The graphics are amazing, the waters physics are the best in this game yet. There is quantity, pressure, and every property it needs (or almost every).  And the atmosphere, the story is great. Use your MAVI and there will be some writings in walls. I found them really interesting. 'Save the planet kill yourself' and things like this. Great story.",
            "review_score": "1"
        },
        {
            "review_text": "Hydrophobia is an enjoyable little game that can easily be finished in two to three hours. It's a platformer with mild shooting elements set on a floating city beseiged by Malthusian-inspired terrorists.  The game is surprisingly feature rich for a small title like this, and the water effects are particularly impressive. You can open doors to flood rooms or drain them, you can use water to knock down and stun enemies, and you can also use water to overcome environmental hazards like fires or stray electrical wires. There's also a novel hacking minigame.  Considering the length, I'd appraise the game at $5.00 to $7.50 at most, and anything equal to or beneath that price point is a steal.   There's a plot, but it's told mainly through picked up documents. There's also a few fun little easter eggs for gamers.  If you like aquatic games, platforming, and blowing people away with a sonic pistol, then I recommend you check this one out.",
            "review_score": "1"
        },
        {
            "review_text": "I tried. I really did.   This game looked really pretty, and I'm a sucker for pretty things. It also looked like a decent platformer, which I also like.  It is neither of those these. It's a buggy mess, with useless puzzles that feel more like busy work, clunky controls. I could (and tried) to soldier on to learn more about the story, but at the third act it was still... boring. I can't say this any other way.",
            "review_score": "-1"
        },
        {
            "review_text": "After getting some much-needed post-release work, Hydrophobia: Prophecy turned into a pretty decent third-person action game. It combines light platforming, combat and puzzle elements, none particularly amazing but which work when taken as a whole. The visuals and water physics are mind-blowing at times, and the story has some philosophically interesting (if not terribly original or in-depth) overtones. I believe it was ported from XBL, so a controller might come in handy.  The main drawbacks are 1) the very short length, and 2) the fact that some of the coolest stuff in the game is held out until the very end, such that you hardly get to use it. Combat isn't bad, but it's simplistic, revolving around different types of ammo fired from the same weapon. The developer having gone under means this one is probably a relic now. Still, it's a good budget title and well worth the few hours of gameplay it offers.",
            "review_score": "1"
        },
        {
            "review_text": "It's a OKAY game. It functions and it runs fine. It's just that there's nothing special about it. It's short. The sounds are bland and the voice acting is subpar at best. The graphics (besides the water which looks great for 2011) Are subpar aswell oh and that ending. It ends on a cliffhanger. A really bad one. There will also be NO SEQUEL. The hydroengine was sold to another company! I only recommend this game if it's on sale I sadly cannot recommend it though.  Final score. 5/10-Average",
            "review_score": "-1"
        },
        {
            "review_text": "I was drawn to this game by the graphics and water physics which looked amazing, and it didn't disappoint in that regard. The water and water effects are pretty impressive.  Overall gameplay: From the start and through most of the game it is a relatively simple game, mostly solving minor puzzles and navigating around obstacles, and taking out enemies when they present themselves. All in all most of the game right up near the very end is not very difficult at all. More on that later.  There are a number of flaws in this game however and here is my take on them.  Story: Firstly, the story and plot are nothing remotely new in the general sense. Evil bad guy trys to take over the world (figuratively speaking), you must stop them under time pressure blah blah blah. There is nothing unique or nuanced about it, it's fairly textbook without any major surprises.  Controls: The controls for this game appear to have been designed for console gaming where there are not a lot of buttons/keys to press and so they have to be creative with how they present weapon selection user interface etc. in the game in order to allow players solely using a game controller to fully access all of the games controls. This is a pet peeve of mine because if you use a keyboard and mouse you have a lot more buttons available that would give you more intuitive control over the game, but games like this purposefully do not bother to use the available hardware options and instead force everyone to use a console-like interface instead. I hate having to press and hold a single button in a game to get an on-screen menu of weapon or ammo choices, then point out the one I want. I'd much rather have a one button press like you'd find in a standard shooter like Quake to select my weapon/ammo. These popups force me to lose immersion and have to think about an on-screen display instead of just hitting a button without leaving the game. Very immersion breaking.   Combat flaws: The weapon/combat mechanics are very awkward and unnatural feeling. That is a combination of the third person perspective and difficulty determining where your weapon's line of sight is compared to what you see and think versus what the game engine considers a line of sight. This makes it often very difficult to aim your gun at the target accurately when shooting around cover from the left or right. Even though you personally have a clear line of sight to the target, and the trajectory from the end of the gun to the target is clear, the game repeatedly acts as if the cover to the side is in the way and your bullets hit the cover instead of going where you can see that they should go. You're forced to put your self deep out of cover into harms way to get around this quirk and it's rather irritating and inconvenient when it happens. You usually end up taking fire, whereas in real life you'd keep your body in fire and just hold the weapon around the cover. Other games get this right, so it's designed this way on purpose and more or less makes hiding behind cover partially useless.  Sometimes you have a weapon/ammo selected and it wont shoot, it just hangs until you select other ammo then reselect the ammo you had. Very frustrating bug that occurs occasionally although not often.  I always felt like all of the weapons were very inaccurate, having to spray bad guys with endless ammo to take them down while they take you down with 1-2 shots. Also, you can pretty much visibly see the ammo travelling to the target at a much lower velocity than real weapons would fire, so the weapons just had this lame feel to them. I often wished I could just run up to the enemies and Mortal Kombat their arses face to face with bare hands than fiddle around with the lame weapons in this game.  Respawns: Enemies respawn out of thin air unexpectedly. If you're looking for an arcade-like game experience then that might be fine, but I like more realism and immersion in my games, and when enemies spawn in out of thin air I find it really annoying, especially when I've completely sweeped an area and there is no way in. IMHO, encountering enemies in a game should always feel natural, and visible or other obvious spawn-ins really takes away from the realism and immersion in a game IMHO.  Final Boss: Without any spoilers, the final boss fight is a severe challenge. The entire game up until that point was relatively easy to mildly challenging, but when you get to the final boss it becomes extremely difficult and for me it felt down right impossible. I tried over and over countless times to defeat the final boss and it just got tedious and repetitive and wasn't fun at all. The whole time you're getting your butt kicked the boss is laughing at you and firing off World War III in your face. Be prepared to die like 50 times while wanting to smash your keyboard and punch the monitor. The final boss fight is just totally not fun at all. I ended up giving up and just watching a Youtube video of someone else defeating the final boss who also was upset at the game for being so impossibly difficult.  Final verdict: I found the game to be an interesting diversion with nice graphics and physics, but the story and gameplay were lacking. The combat mechanics were awkward and the final boss scene was severely unbalanced and far too difficult to be fun. I like a good challenge, but it has to be fun not frustrating. Overall I think there are much better games out there worth the money than this one, and I think all but the most die hard gamers will simply give up on the final boss fight if they make it that far. Save your money and watch a youtube playthrough of this instead. ",
            "review_score": "-1"
        },
        {
            "review_text": "I want to say that I liked this game, I really did. It was beautiful, had a somewhat interesting story and many of the ideas in it were really cool. Then I got to the last bit of the game and it just went downhill. The water manipulation abilites are difficult to use and the final/only boss battle was pretty much impossible because of that. I ended up never finishing the game because of that, and honestly I think this was the first game I never finished for an actual reason; which is pretty sad.  TLDR: Beautiful and interesting story and gameply ideas, bad powers and ridiculous final boss.",
            "review_score": "-1"
        },
        {
            "review_text": "A visually pleasing trip through an appealing hydro-industrial environment, with a couple minor hazards on the way. And the protagonist is more dressed than Lara Croft.",
            "review_score": "1"
        },
        {
            "review_text": "This game is often on sale for $0.99 or less, and at that price, I think it is definitely worth it.   There are a lot of negative reviews for this game, and they aren't entirely wrong, but I don't think it's a terrible game. It has its ups and its downs and a full load of meh. So, let's break it down. Warning: Minor spoilers, but nothing that really gives away the story.  Positives:  - The water physics: they are definitely cool and a major positive. I wish more games would make such use of flowing water physics to affect the characters and environment. It is fun to use water flooding to disorient your enemies and sweep them off their feet, it's neat how the intensity, direction, and depth of the water flow affect your own movement and so on. In some cases, you can see flooded compartements behind glass barriers, and if you shoot out the glass, that water floods into an area to have several effects. Similarly, some destructable leaky bulkheads can be shot out for similar effects, in some areas even completely filling the corridors and compartments you are in, which can be a danger but finding an air-pocket is usually not too hard. - Use of the environment as weapons: not just the water, but leaky gas pipes, explosive panels and barrels, electrical panels and wires... all can be used strategically to trap and take out groups of bad guys. - The 'Mavi' device: I found the way you can use it to scan and control somethings in the environment as well as see invisible messages and such pretty nifty. Not awesome, mind you, but cool enough.  Negatives:  - The voice acting: it's very weak, and I'll be surprised if you don't find the main character's voice to be whiny and annoying.  - The keyboard and mouse controls: if you play this game, you'll definitely want to do it with a controller. Controlling with a keyboard and mouse is just really wonky. It's not perfect with a gamepad but it is much better and will save you a lot of frustration, especially later in the game when it comes to controlling water. - The final boss battle is pretty terrible and frustrating until you figure out what to do. It's darned near impossible with keyboard/mouse controls.  The meh: - The story is really weak. It wanted to be something good, but the writers didn't pull it off well. - The gameplay in general. It's not terrible but it isn't very good either. It tries to combine a lot of things: cover-based shooting, tomb-raider style climbing and platforming, and a bit of 'magic' in the form of a nanobot infection giving you the ability to somewhat control the water. But it doesn't do any of these these things particularly well.  - The challenge room is pretty dull (unlocked upon completing the game), and the gameplay is not good enough to make it much fun. Only worth playing if you must go for 100% achievements.   This game doesn't do a lot, so don't expect a lot. It wanted to be something amazing and utterly failed at that, but there is fun to be had. I think you can easily get several hours of enjoyment out of it for $0.99 when it's on sale, but don't go in with high expectations and you won't find yourself being too disappointed. Again, playing it with a controller is pretty much a must.",
            "review_score": "1"
        },
        {
            "review_text": "While maybe slightly buggy at times, this game will still immerse you in a good story, if you pay attention.",
            "review_score": "1"
        },
        {
            "review_text": "Hydrophobia is a puzzle/action/platformer akin to games like Tomb Raider, Prince of Persia, Legacy of Kain and countless other titles that we have probably played at one point or another. It's extremely atmospheric and it's got great visualizations (particularly the water effect- no kidding, right?) and sound. Here's the break down:  THE GOOD: Stuff I liked.  1. The Water The water is, as the name implies, the cornerstone of this game. It is the reason for the game's interesting atmosphere and environment based puzzles. The physics, graphics and visualizations (movement of waves, transition from surface to underwater, water on camera, etc) are superb. Best water effects I've seen in a game. Period.  2. The Environment Interaction/ Movement I really enjoyed the layout of the levels and their design in general. There was a decent mix of swimming and climbing, giving each zone a level of depth that I don't often notice in other games (save for some of the ones I mentioned previously). Or maybe it's just because I was actually able to interact with it to such a high degree that made it interesting. This includes shooting out glass doors, blasting through bulkheads and raising the ambient water level. Very cool experience.  3. NAVI Mechanic I really enjoyed the NAVI mechanic. The protagonist comes equipped with a transparent PDA gadget that acts as your GUI in the game, keeping all your notes, grants access to your in game menus, highlights secret messages in the game and enables you to do all your non-combat trickery (hacking, opening doors, etc).   4. PRICE!!! $$$!! I think I bought the game on sale for $0.50? So in the end it was money well spent. ^_^    The BAD: Stuff that was 'Meh.'  1, Clunky Movement So, while you can do all this neat stuff like roll, climb, swim and cling to cover... the controls felt somewhat unresponsive. Often I'd lose the ability to shoot around cover and have to back off and re-cling to get it working again. Likewise, occasionally the game would ignore a command to dive, roll, or jump. The fact that it occurred sporadically made it that much more of an aggravation when these missed commands would pop up... particularly in a heated, combat situation!  2. *Occasional* Camera Angles from Hell Again, these didn't happen very often but when they did it was really difficult to get out of them. It most often happened while swimming and most usually in tight corridors. Of course, this is typically a problem of any game with a high degree of mobility in a given environment.   3. Backtracking I don't mind a whole lot of backtracking personally. Given the NAVI's ability to help you perceive new things in the environment and the changing level of water, I'd rank this game about equal with such games as Legacy of Kain and Chrono Trigger. OF COURSE, there's backtracking... the designers want to show you how a place has changed. So I don't think it's a problem, but a lot of other reviews did.   4. 'Easy' Combat...? I played the game on Normal mode and died a total of 2 (maybe 3?) times while in combat. The badguy AI is fairly responsive in my opinion: when you don't shoot at it, they sneak closer to you. When you do, they scramble for cover. They try to flank you, etc, etc. They don't do any of this quickly, but they do it. They also deal enough damage that you can't go barreling in guns blazing very often either.   But, if you're like me and you rock the sneaky/cautious/clever game style, you'll probably breeze through the game since there's ample opportunity for you to use environmental hazards to your advantage. This is NOT Call of Duty, Counterstrike, or anything resembling a 'real' shooter. It just happens you can shoot things.   5. Voice Acting I've seen a lot of bad reviews because of voice acting... but honestly, I've heard a LOT worse (none come to mind this instant, but we've all heard worse). Plus, there's not a whole lot of it. I actually think the worst voice acting comes mainly from the protagonist (which is unfortunate) because I thought the acting of the antagonist and your plucky tech support ally were decent enough (if not reading from a very unimaginative script).      THE UGLY: Stuff that's unforgivable (imho).   In order,   1. Repetitive game play and goals.  The whole game is about finding keys to locked doors, almost without exception. This sucks. I'm just glad the environment was fun to navigate to make me forget that this was all I was doing. Blah.   2. Very few upgrades/collectables/etc.  You pick up about 3 'new' abilities that you use sporadically throughout the game. There was also about 6 different types of ammo you could collect... but you really never needed it until the end of the game. This is one extremely crucial difference between this game and the likes Legacy of Kain and Prince of Persia (also games like Metroid, Castlevania and Megaman)… you never really feel like your power level advances.    There is one HUGE exception to this complaint however, which brings me to...     3. INCREDIBLY SHORT GAME!   The final and coolest upgrade you get in the whole game is discovered and unlocked LITERALLY minutes before the game ends at the one and only boss fight. Not only is it a cruel move to throw a new game mechanic at you without giving you sufficient time to practice using it, but you also don’t get to enjoy it for more than a few minutes! Unforgivable! &gt;_&lt;     Overall, if you can snag this game for less than the price of a bottle soda at the gas station AND have a few hours to kill, you may as well pry what fleeting joy you can from it’s very beautiful, if somewhat flawed and arthritic fingers.",
            "review_score": "1"
        },
        {
            "review_text": "I finished this game to get my money's worth, but it's not even worth it free. It's not worth the emotional trauma because everything about it is terrible. Terrible story, terrible characters, terrible voice acting, awful controls and pointless time trials. I even encountered a bug where the final boss won't spawn lol. Thankfully the reload point wasn't too far off. The final boss battle was very frustrating and gave no sense of satisfaction once it was over.  The only good thing about this is of course the water physics. Next time I want to see good water physics, I'll go to the beach instead. Lesson learned, not all 90% off games are worth buying!",
            "review_score": "-1"
        },
        {
            "review_text": "Hydrophobia: Prophecy is 3rd person survival-horror style action-adventure game. While the PC keyboard/mouse controls are fine, the game also has platforming elements, as well - so, I wound up using the X360 Controller for this one.   While the graphics are not spectacular, they are good &amp; do get the job done just fine here. The water looks stunning. The voice-acting is good, though the story could use a little more kick &amp; depth to it. The water in this game is its own creature, as it will effect the environment &amp; its surrounding - especially since feels like it has weight to it. Using the environment for combat is another thing that makes this game stand out, since you really don't have very many weapons or skills at your disposal...until later on in the game.   When it's all said &amp; done, Hydrophobia: Prophecy is a pretty good start to what looks to be a series that could have a lot of potential, if they keep on building on the nice foundation that this game actually sets.   Grade = B-",
            "review_score": "1"
        },
        {
            "review_text": "8 minutes into play I kinda got stuck at the beginning, graphics weren't too shabby though. The story is good so far too. I have yet to complete it but when I do I'm sure the ending will be satifying. Plus the price was very cheap.",
            "review_score": "1"
        },
        {
            "review_text": "Solid storyline. Really enjoyed the twist of the water control at the end, but the ending was very lackluster. After the battle with S.A.R.A., the game just kind of ended. A little bit of what happened after the battle would have been nice to complete the storyline, but it was decent for what it was and what I got it for. Gameplay mechanics leaved a decent bit to be desired, but still not bad overall.",
            "review_score": "1"
        },
        {
            "review_text": "It's just that bad..",
            "review_score": "-1"
        },
        {
            "review_text": "Buy this just for its water engine because some of its breathe taking but I wouldnt pay more than £5, Everything else in it is below average.",
            "review_score": "1"
        },
        {
            "review_text": "Hydrophobia brings back new potential in a brand new gameplay! It's recommended to test out this new engine!",
            "review_score": "1"
        },
        {
            "review_text": "The story line could be interesting, but gameplay and others things are terrible!!! Don't buy it! When you die loading screen takes 4-6 minutes or game crashed! It difficult to play when U inpatient. Game is too expensive I think.",
            "review_score": "-1"
        },
        {
            "review_text": "It would be an excellent action adventure game, yet that backward jump requiremwnt, while you are back to the Plaza, it's ruining the whole game. Doesn't matter your position, how you are pressing the yeys, or the controller's buttons, Kate is always falling short, incapable of grabing those ledges to that duct. And that it's a general problem, for all of the players, you'll see that issue on so many forums. That pretended patch, it's clearly not working, and if the developers would have a minimal respect for the players, they would change that, by placing a platform, or a cynematic showing Kate performing that jump, or skipping it completely as in L.A. Noire.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a mess. Sure enough the water physics are great, but that isn't enough to carry it all. The controls are horrific, something I oddly enough only noticed during the final act of the game. For a game with a lot of water-based gameplay, the swimming controls are really cluncky: only willing to resurface when you hit the space key, only willing to dive when you hit shift. The camera is completely paranoid in these situations. The AI is hands down the worst I've ever seen. One enemy simply walked right by me after I literally bumped into it. Shooting mechanics are equally bad. Managed to deliver quite a few headshots with the bullet impact not even remotely near the guy's head. Not even remotely near the guy even. I only spent about 50 cents for this and for that money it wasn't really a bad purchase. It did manage to entertain me for about an hour and a half. But I cannot recommend this to anyone, it is simply too bad a game.",
            "review_score": "-1"
        },
        {
            "review_text": "Very well made game. Only lasted about 3 hours from start to finish on normal difficulty. Haven't attemted Challenge Room but I have high hopes.",
            "review_score": "1"
        },
        {
            "review_text": "You fight a bunch of Mathmaticians who try to solve algebraic equations with your sciency pistol. Science is way better than math.",
            "review_score": "1"
        },
        {
            "review_text": "'Earpiece guy' makes lots of water puns 10/10",
            "review_score": "1"
        },
        {
            "review_text": "A Nice Game With a Great But! Short Story of a Girl on a Floating City.",
            "review_score": "1"
        },
        {
            "review_text": "This game is pretty cool for .24 cents. Its not the best, but the water effects are cool and it has a bit of a story. I usually look at some of the cheapest games on sale and not one in the past few months compares to this one for the price if you can get it on sale.",
            "review_score": "1"
        },
        {
            "review_text": "It's like uncharted, but it's on PC It's like uncharted, but it's $0.50 It's like uncharted, but it's on a boat It's like uncharted, but it's poorly voiced It's like uncharted, but it's guns are weird It's like uncharted, but it's story is ♥♥♥♥ It's like uncharted, but it's gimmcky It's like uncharted, but it's finnicky It's like uncharted, but it's ♥♥♥♥♥♥ It's like uncharted, but it's plot is cliche It's like uncharted, but it's physics make no sense It's like uncharted, but it runs like ♥♥♥♥ meh. it was this or one of those weird dusty gumballs 7/10",
            "review_score": "1"
        },
        {
            "review_text": "      Gameplay   (2/5)       History   (3/5)       Graphics   (2/5)       Soundtrack   (3/5)       Characters   (3/5)       Setting   (2/5)       Multiplayer / Co-op   (-/-)       Difficulty   (2/5)       Fun   (2/5)     ",
            "review_score": "-1"
        },
        {
            "review_text": "Starts off really promising with an interesting setting, rather intriguing plot and the promise of unique combat. Ends up being a cookie-cutter shooter with little extra mechanics. While the water looks rather well and the utilization is alright (the swimming mechanics I really liked, compared to many other games that make you swim and dive through areas) with the mechanics and the hydrophobia of the protagonist, hence the game's title, being displayed comprehensibly, the advertised water control mechanics only become available shortly before the game ends. Which means there is really little to be had, as the expected unique selling points are implemented poorly or just too late in the game.  The developers are bankrupt, apparently, and it seems as if they ran out of money halfway through the game. I really feel like this game was either supposed to be a trilogy or just a lot bigger. But about 2 or 3 hours in the story leaps ahead, you have a huge room where you must fight many baddies and then suddenly a boss fight, a short and unsatisfying cutscene and then ... nothing. That's it. Nothing is really concluded, nothing really happened. It seems like a prelude to the actual game, which will probably never come.  Might be worth a bargain price for the water experience, but otherwise expectations will probably fall short, as the game severely lacks substance.",
            "review_score": "-1"
        },
        {
            "review_text": "Rewriting this due to my cringey old format of writing one giant paragraph.   I'll keep it short and simple. The game controls like ♥♥♥. The graphics look like vaseline is smeared all over your screen and you're playing a game released a good 2/3 years earlier than 2011. The parkour is ♥♥♥♥ing atrocious, linear, poorly animated, and just boring. It also doesn't ♥♥♥♥ing work. There are jumps that look like you should be able to make but no, you can't. You'll think you can grab a ledge but you can't. You'll hit a ledge you CAN grab but bounce off to your death.  Also the voice acting and script is hilariously bad. Especially with the main character. There's nothing redeeming here, it looks like a decent mid tier budget game but that would be insulting to the entire ps2/xbox 360 generation.   Why the ♥♥♥♥ would you design a game focused on platforming/parkour when you can't animate for ♥♥♥♥? The only thing the game has are the gimmicky water physics. I'd rather go play a falling sand game if I'm going to play with water. At least those are free.",
            "review_score": "-1"
        },
        {
            "review_text": "Ok, there were a lot of fun things about this game. I really enjoyed the first two acts. Especially the climbing bits, and I even got to enjoy the hacking, even though it was timed.  Of course, there were quite a few reasons I'd say 'skip this game.'   The plot goes from a pace of a car to a rocket jet by the third act. Once Kate gets hydrokenisis (not a spoiler since it's in the screenshots), you barely get any time to really get how it works before you're expected to use it for the boss battle. There are a whole lot of great things about this plot that aren't given a chance to be explained. Malthusians as the terrorists, with calvinist beliefs mixed in there (calling all non-malthusians 'reprobates' meaning doomed to die), an implied overpopulation, the idea Kate is living in a ship due to that... all great ideas, but never really explored to its true potential.  I guess I wished for a first level like Half Life's, where the player wanders around Black Mesa and gets an idea of the place before everything gets crazy.   The plot summary suggests there will be character arcs, and there aren't. The only thing that changes is that Kate stops yelling whenever she has to go balance on poles. Kate's goal changes inexcplicably part-way through (I suppose her boss being killed might have something to do with it, though he was a jerk to her anyway) from ignoring curing herself and finding her friend to chasing down the bad guy.  And it just kinda... ends.   This is one of those games where the controls sometimes flat out ignore what you tell it to. Which is especially frustrating considering how unforgiving it is. (There is no saving, just checkpoints.) On that note, this was another game where the hints couldn't be turned off, and they were always brought attention to by an annoying sound.   I'm normally not bothered by voice actors, but Kate's voice actor was incredibly distracting.   The fact is, this game does a lot of things right, which makes the things it does wrong even more frustrating. What a great world to just ignore.",
            "review_score": "-1"
        },
        {
            "review_text": "A fair game for it's cheap price, but in the extremly short time i did have with this game, i spent 30 minutes of it trapped in a wall. So that's always fun. Don't buy this game. Seriously, if you have five dollars (or more) go to the indie section and just avoid this game.",
            "review_score": "-1"
        },
        {
            "review_text": "I really enjoyed my time with Hydrophobia. It got mixed reviews when it first came out, but apparently I purchased a later version that was patched on the xbox 360 and as far as that version, I really liked it. It ended too soon (story wise in the game), and now there will never be a sequel due to the company shutting down. But I still recommend it here. Especially for .50 cents! Jeez. I would easily pay $5 for this older game now, but for the cost of a soda, get it!",
            "review_score": "1"
        },
        {
            "review_text": "Badly optimized. Awful controls. Generic story. Predictable gameplay. Amateur character models. Awkward animations. Terrible voice acting. A crappy showcase for a half decent water effect. Utter toss.",
            "review_score": "-1"
        },
        {
            "review_text": "On the plus side, it only took 3 hours to beat the main story. And I guess the water effects are kinda cool, though a bit dated at this point. On the down side - just about everything else. Medocre jank fest. Not really recommended.",
            "review_score": "-1"
        },
        {
            "review_text": "Poorly done gameplay, story and engine.",
            "review_score": "-1"
        },
        {
            "review_text": "the game doesnt work, and if you want it to work you will need to do allot of work for it. i have no idea if the games good or not because its not working and i have seen allot of these problems around already. fix the game then we'll talk.",
            "review_score": "-1"
        },
        {
            "review_text": "Absolutely full of ♥♥♥♥. (Excuse my language, but I'm EXTREMELY ANGRY) Seemed interesting at first with the lore and objects. BUT&gt; BUT BUT BUT BUT.!!!! I can't even get past the first part of the game, SHE NEVER JUMPS WHERE YOU WANT HER TO GO. I'VE TRIED A KEYBOARD AND A CONTROLLER. NOT ONLY DO YOU DIE, BUT YOU ALWAYS HAVE TO GO THROUGH A 45 SECOND CUTSCENE BEFORE YOU CAN TRY AND DIE AGAIN. THIS GAME IS ABSOLUTELY TERRIBLE. IF ONLY I COULD ACTUALLY PLAY AND PROGRESS THROUGH THE STORY MAYBE I WOULD CONSIDER A BETTER REVIEW. Jesus Christ. I spent the past 45 minuites just TRYING to jump to the other side, only having to go through the same 45 second damnsel in distress cutscene again. Would not play again. Not worth my $.50 cents.",
            "review_score": "-1"
        },
        {
            "review_text": "The most braindead main character i've ever witnessed. Voice acting almost as bad as Ride To Hell: Retribution, tedious to use/straight up bad controls. Little to know explanation or direction as to who these characters are, where you even are, and barely any character development. On top of all of that nonsense, the game just isn't fun and has one of the worst opening sequences i've ever seen.",
            "review_score": "-1"
        },
        {
            "review_text": "wow its amazing.nice gameplay super special effects and lights nice graphic. of course not the newest since its an older game but still its great in everything..controls are super. i love playing it with controller in big picture mode :D  and for 99 cents in steam sales..what do you want more :)",
            "review_score": "1"
        },
        {
            "review_text": "Infamous for it's developer's attitudes towards it's critics. It's mostly forgotten for good reasons.  The game it self is very unintersting. It fails to use it's 'verse effectively and the environments are boring grey enginerooms and cargoholds. The much brough-up water physics aren't used interestingly but instead used for boring repetetive puzzles.  Also contains sub-par stealth and combat.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is total dooki dont buy no matter how much it is. I bought for like 13 cents and I still regret having in library it just make my collection look icky with a gross game like this.",
            "review_score": "-1"
        },
        {
            "review_text": "PLS HELP   I CLICK START BUT ITS NOt STARTS PLS HELP ME - ADD STEAM FRİEND AND MESSAGE  BAŞLAMIYOR AMIN OĞLUNUN YAPTIĞI SİKKO OYUN AMK - Bİ EL ATIN EKLEYİN MESAJ ATIN",
            "review_score": "-1"
        },
        {
            "review_text": "This is a great game that i would recommend for somone lookign for a cheap game. the story is interesting, The character design is good along with character development. It is an overall fun game with solid gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "ISSUES WITH CONTROLLER. Windows 8.1 64 bits. Xbox controller. No way to callibrate the controller. It's always walking what makes impossible to accuratelly move on. It seems interesting but, impossible to play. ",
            "review_score": "-1"
        },
        {
            "review_text": "Be aware of cutscenes the game in the begining.",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty decent game, good gameplay, some decent puzzles, great graphics and physx style. Would love a sequal to it.",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed this game. It's a shame that the company that made it went under.",
            "review_score": "1"
        },
        {
            "review_text": "Currently this game lags and the minimum requirements are too high to do much. I couldn't even play five minutes do to lag. If you decrease render volume you can't read anything. I would suggest to look at whether or not your computer will run it. I hope to play it in the future with lag fixers.",
            "review_score": "-1"
        },
        {
            "review_text": "Fun to play. Cool water physic's. Works great.",
            "review_score": "1"
        },
        {
            "review_text": "I got what was on the tin, lots of water.",
            "review_score": "1"
        },
        {
            "review_text": "Really enjoying this game. Normally I am not one for the shooter style game, but so far it's interesting, fun and challenging for me. For the price it's on sale at it's a pretty good deal.",
            "review_score": "1"
        },
        {
            "review_text": "I don't get it. That was the whole game?  Worth $3 maybe, if you can survive the horrible camera while underwater.",
            "review_score": "1"
        },
        {
            "review_text": "Ok, this game has some AMAZING water effects. Water flows very much like it would in real life. It even has a tide that will pull you if you are caught in the current while water is flowing out of your room into the next.  Unfortunately, that's really all this title has to offer. The acting makes B-movies sound like emmy award nominees. And get this...2 hours! That was the playtime to get through it. I didn't even realize it was over till I started getting awards for 'Game completion'. So that is a terrible ending to a story when you are sitting there expecting to see the next level.   Luckily this game was cheap",
            "review_score": "-1"
        },
        {
            "review_text": "It was very short game, but quite fun. I liked the water power you gain in act 3. Overall, I got that game on sale for $0.50 and for that price it was a bargain worth playing. At that price I would recommend that game all the way up to $10.00. It was quite fun.",
            "review_score": "1"
        },
        {
            "review_text": "Nothing more than a tech demo to be frank. The water is night, but even on the highest settings the overall 'view' is slightly blurred when AntiAliasing is switched on, implying that they went for an easy AA method instead of a nice crisp non jaggy method.  As for the gameplay; there is very little. At first you feel ingenious using Security Systems and such, but it wears thin and gets stale and repetitive as you realise youve been doing it for the whole Act.  One to miss.",
            "review_score": "1"
        },
        {
            "review_text": "Too much water. 7.8/10",
            "review_score": "-1"
        },
        {
            "review_text": "The game it self is very good for story side, but the length was a bit short, all the game really needs is trading cards etc and some more DLC added. Overall for the game is 8/10.",
            "review_score": "1"
        },
        {
            "review_text": "It was okay, I think I got through it in a couple hours. Technically, there's some cool things in here but it works better as a tech demo than a game.",
            "review_score": "-1"
        },
        {
            "review_text": "Shame because it could have been better. I enjoyed it though but it's quite short. The water effect is one of the prettiest I've seen in a video game.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. BUT there is no ending. You beat the boss and then the game just ends. No final cutscene. no resolution. I REALLY want to know what happens to the main characters. And the game is very short. I would love if the devs remade the whole game using todays technology and polished up the story. That being said this game is incredible for the time it was made. I still have yet to see a game that models water was well as this game. Wish there was a part 2.",
            "review_score": "1"
        },
        {
            "review_text": "Tonns of water and loneliness",
            "review_score": "1"
        },
        {
            "review_text": "super squatter, impulse buy. save urself buy something better",
            "review_score": "1"
        },
        {
            "review_text": "Hydrophobia: Prophecy is not a great game. I'd say it struggles to reach 'Good' game, but it's an 'okay' game. And at $0.49 a pop (until May 19,) it's a good deal, even if you're likely to get less than five hours out of it. You'd pay more for a trumped-up Flash game for your phone.",
            "review_score": "1"
        },
        {
            "review_text": "Do not listen to what critics say about this game, this is pretty cool and pretty old school game, like Psy Ops and Second Sight combined with old school tomb rider, and a little bit of bioshock... or system shock. Stupid critics of these days criticise every game where you cant stick behind cover and cant roll from one cover to another (chertovi ukritiya i perekati) or cant run like COD tank under heavy fire, but this doesnt mean that games are bad, that just mean they are bad critics and cant see anything good if game isnt like COD or Gears of War. This game isnt perfect, but it clearly deserves non less than 85 of 100! Buy it and see yourself that you cant trust game critics these days!",
            "review_score": "1"
        },
        {
            "review_text": "It's good",
            "review_score": "1"
        },
        {
            "review_text": "the game reminds me on tomb raider, it has nice water and light effects, the music is good. the story doesnt make any sense to me, but the developer planned a triology as far as i know. the gameplay is terrible, the riddles obvious. better wait until the game is cheaper and try it yourself.",
            "review_score": "1"
        },
        {
            "review_text": "Ok adventure-ish game. Campy character and strange premise running away from the water before you drown. But eh (shrug shoulders) it's worth a play. I played it on my ps3 and on PC now and both are relatively the same.",
            "review_score": "1"
        },
        {
            "review_text": "The game was pretty cool. I tend to enjoy things for what they are and nothing is bad to me unless it's boring. I don't compare things to things that don't need comparing. I played the entire game in one sit through so its alright with me. To the idiot that said you don't have enough time with the powers: Incorrect. There are only two moves to even do with the powers and if you can't master those it's your own fault. You don't get the powers then boom boss fight. You get the powers, they introduce each move one at a time, you fight some enemies, then you fight a boss. There is more than enough time to use them.",
            "review_score": "1"
        },
        {
            "review_text": "A misery to play through that only brings sorrow to the medium.",
            "review_score": "-1"
        },
        {
            "review_text": "Up through Act 2 of 3 so far, and I can honestly say that no matter how tremendous the ending, no matter how much emotional gravitas it evokes, no matter the revelations and plot twists that may come my way, there is NOTHING that could make me want to actually finish this game.  But I am going to, because I am a completionist. Which brings me to its only saving grace: if I'm almost done with the second act, that means the game can't be much longer than six hours. Which, to be fair, is about five hours too many, but at least it's something to be happy about while playing this mess.",
            "review_score": "-1"
        },
        {
            "review_text": "One of the most rivetting gameplays I've had in a number of years, shooting seems a bit mechanical but it doesn't detract from the story and the water effects really are 'that good'.  I finished it in a single 5-hour sitting: something I've not done with any game before (played it to completion in the first go). For the price it was exception value, on sale for $0.49 - can't go wrong, but it would be worth up to $8 I'd reckon, I always wait for sales, this one was absolutely worth it, much better than Hard Reset.  The game is fairly linear, but the environmental mania with barrels and electricity make it really interesting. A worthwhile playthrough, the challenge room might be of interest, but I'm happy to have played this throughonce.  Great game.",
            "review_score": "1"
        },
        {
            "review_text": "This looks like a Gamecube game.",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this game when it was on sale, it's not bad but it is also not great. It's short, easy and basic in most of it. It is somthing worth a dollar or two.",
            "review_score": "1"
        },
        {
            "review_text": "This is a good game. I had a lot of fun playing it. However, the game is not finished. What you're buying is the first act and the beginnings of a second.  If you're looking for a short game with some beautiful water effects I would reccomend Hydrophobia. If you're looking for a complete game than you should pass.",
            "review_score": "1"
        },
        {
            "review_text": "Really good game with awesome water physics. It's a little bit short and has lousy plot, but everyone who loves playing with water should give that game a try.",
            "review_score": "1"
        },
        {
            "review_text": "Hydrophobia is a game that didn't get the best reviews, especially before it was pached. Personally I still like the game a lot and enjoy playing it. I think that this can be a very good and enjoyable game if you dont expect this it to be something its not and like this kind of games in general.   This is not a AAA game with all the aspects being of top quality. It doesn't have the worlds best story-line or a lot of new and innovative gameplay elements. This is the kind of game that you play for fun or to relax after a hard day. If you like 3D adventure games with a little action here and there, like I do, this could be the game you are looking for. For the most part, this is really just an simple modern adventure-game with fun and quite repetive gameplay. It's for you to decide if that is a good thing or not. Most of the gameplay is jumping, running and swimming around and solving some, for the most part very simple puzzles. In the later parts of the game there is also some shooting and similar action. One thing I liked so much about this game is that it is still relatively low on action, witch makes it one of the kind of games that there are still not too much around these days for those who like 3D-adventure games, but not a lot of action/violence.  Another thing that separates this from the masses is the gender-roles seen in this game. While most of the games we see have protagonists that are white, young, macho straight men with big muscles this game brings a protagonist that seems new and refreshing being more of a masculine woman. Of course, there's absolutely nothing wrong with macho men but for those gamers that don't identify with that kind of gender expression or simply like change this could also be seen as a good thing about this game.  Probably the best and most innovative thing about this game is still the water and the effects associated to it. The water is really fun to play with and I really enjoyed wathing it wave from room to room. The behavior of the water is more realistic than I have seen in any other game up to this day. The water, fire and electricity really make the athmosphere of the game and are beautifull to look at.  It is worth noting that these are just my subjective experiences and views of the game and I also have not finished the game entirely yet. This is also the first game review that I have ever written! :)  For the price I bought it (0,49 euro) and being an indie game I would say Hydrophobia is a really fun experience and even has a few new elements that I enjoyed.",
            "review_score": "1"
        },
        {
            "review_text": "this game is short but it is really fun",
            "review_score": "1"
        },
        {
            "review_text": "This game is great fun. I highly recommend it. It's part Oni, part Tomb Raider/Prince of Persia, and part Deus Ex. Plus it's cheap. Get it, you'll like it.",
            "review_score": "1"
        },
        {
            "review_text": "Eh, i guess you should get it on sale. Its not amazing, nice water though (would like to see water done like this in other games). 4/10",
            "review_score": "1"
        },
        {
            "review_text": "This game had bad review when it went out, and it is still mixed. I understand. It is a classic level game, with a classic character, a classic script and basic graphics, excepted the water effects that roxx.  It has no pretention, when starting the game you must understand you won't have the adventure of the year. But, you won't loose your time either. I finished this game two or three times and always loved the overwhelming panicquing feeling when water goes up and you don't know where to go.  The story is ok, like a simple tv show the evening before going to bed. Some clichés but entertaining.  Not the summum of the art, but a simple way of entertaining onself in a cheap and interesting manner.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Sadly not good triple monitor experience.  You need a desktop graphics card to run this game, i mean its not exactly the most demanding thing out there but with the heavy water detail, yeah you need something better then you usual. Im sad, i have to play this game on 1080p. It looks nice on triple hd, but it has some severe problems with the interface.   Also take to note that thsi game is pretty old, they probably weren't thinking about 3k or triple hd. The game runs fine, it looks nice enough has a decent story, its just for that small crowd, that does the triple monitor or 4k be aware. Otherwise its great!  EDIT: Man i did some messing around, figured out some thing about how to ensure i can play as much as i can with triple monitors. I used to love this game. Its sad, the lack of support for such a awkward aspect ratio. I mean graphically they used an awesome engine, its looks great runs great. Just mechanically, its total trash. Imma have to remove surround and play with it as 1080p. Also i believe the story is saved to your steam account, so no matter what comp you log into, you still have yor process saved, which is amazing ofr this old of a game. 2011, not decades old, but not new non the less.",
            "review_score": "1"
        },
        {
            "review_text": "Not bad. The water is WON-DER-FUL !!! But, I've given up the final boss because it was hard and I didn't want to waste my time on this. Buy this one cheap.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty dull on-rails so far. Not managed to die and controls are clunky",
            "review_score": "-1"
        },
        {
            "review_text": "I liked this game more than I disliked it, that is why I clicked 'yes recommend' this game. The reality is this game is, for me, very average and disappointing in many ways. My biggest complaint about this game is that it was short. Like really really short. It has 3 stages and then it ends, though the stages are fairly long it doesn't really help the matter. Stemming from that, the story for this game was very ill-handled, by which I mean it wasn't handled. You get a bit of backstory about how the world basically turned into a new, uninhabitable Pangea, with one giant ocean that a giant city on a boat sails on with all the sane/not criminal members of humanity, and there's a terrorist cell that lives/was exiled to the dried up husk of a continent who think humanity is ruining/ruined the world and needs to die. There's a lot that they could have done with this to flesh the story out and be something unique or unique-ish, but the story is basically in the background the whole game. The worst part of this complaint focuses on the main character: an engineer on the ship named Kate Wilson who it is implied by the title has hydrophobia. This would be a really interesting twist considering how much of the game revolves around water in different gameplay elements (haha, pun) but the only times it really comes up or affects anything is in the beginning when her coworker tells her she can do this, and when she stays underwater for awhile you hear a little girl laughing, which hints at why she has hydrophobia, but it's never explained or explored, and otherwise she might as well not have it at all. The only other complaint I have concerns the water-manipulating aspect of the game, which you don't 'unlock' until the 3rd stage, and when you do all you do is raise water into a pillar to splash something or raise something in the water up into the air to touch something for some reason or another. I can get why they would start out with only this because she's new to this ability, and if the game were longer maybe they would develop that further so she learns how to use water differently, but sadly the game ends before it can get to that point. At least we got to see the cool-looking glowing effect on her arm for a little bit. I lied earlier, I have one other complaint that I would have tried to go back and integrate into the first complaint paragraph but I don't feel like putting in that kind of effort right now. The ending itself is really disappointing. You (spoilers!) kill the terrorist leader and kill the nanites that are giving you water-bending powers from eating your insides out, then basically pass out of relief and the credits role. No thought is given about the giant ocean-liner with a city that has hundreds of people living on it that's sinking into the ocean, and I guess the rest of the terrorists that were stealing more of those deadly nanites gave up when some psychic call went out about their leader dying. The gameplay was pretty fun, reminded me of Tomb Raider like it reminded everyone else of Tomb Raider. The graphics looked good, nothing fancy but was nice to look at. And of course the water physics were exellent.  I may have been slightly drunk while writing this. I'm sorry.",
            "review_score": "1"
        },
        {
            "review_text": "This game gets a bad rap. DEFINITELY worth the dollar i paid for it!",
            "review_score": "1"
        },
        {
            "review_text": "The Good: Great water physics, platforming is kind of fun, using different ammo for one pistol is conveinent  The Bad: Almost no story to speak of, clunky combat, no cover system, dated visuals, technical problems  Hydrophobia was a game that was announced a few years ago, but quickly was forgotten about and seemed to have gone into the way of vaporware, but suddenly it came back as an XBLA game. The game was boasted for excellent water and physics to support it, as well as a mantra of 'the water is your enemy' selling point. Upon release the game seemed highly overrated with dated visuals, poor combat, and lackluster level design. While most of this is true there is still something to be had in Hydrophobia.  The PC port boasts better graphics, and refined gameplay mechanics, but there are still some issues. The water physics really are incredible and I haven't seen anything quite like it with water bursting in through a door and making Kate act like if you were actually in an ocean or being bombarded by waves. While it feels a bit stiff to maneuver through this it makes you feel like you are trying to desperately escape this sinking city. While the physics are good the story is a bit lacking with little to go by due to the short length. You are trying to stop some crazy Russian woman named Mila from using a corporation's nanobots as a biological weapon and that's about as far as it goes...literally. Why is the game called hydrophobia? Does Kate have it? It seems that way because when you get close to drowning you can hear her thoughts of maybe in her childhood she almost drowned? The game never explains this.  While you drudge on through the watery depths you can clamber your way up areas for platforming segments which are far and few between. The beginning of the game mainly consists of this then slowly becomes very combat heavy. Combat isn't very fun in the game due to a poor cover mechanic (there really isn't one except ducking) and the shooting feels a bit stiff. You have one pistol that you can swap ammo with such as semi-auto/auto rounds, explosive gel, electrocution rounds, and your main ammo type is a charged kinetic shot that can knock enemies dead. Later on in the game they throw so many enemies at you that it detracts for the watery atmosphere.  Another issue is level design because everything is very claustrophobic and is built of just tons of hallways. It's another problem when your MAVI unit tells you to go in one direction and some times it will be a pain to find out how to get there because of the lack of natural clues. Some times you have to go into a hacking mini-game, some times you have to find a decipher code on a wall that you can only see with the MAVI and finding these will drive you nuts some times.  The visuals are good for the level that they are at, but even with a high-end system you will experience frame rate drops and stuttering. They have gotten better since its initial release, but it still exists. The visuals overall have some low resolution textures, and the characters have terrible lip syncing and the art style is pretty stale. What should you play the game for? It's a decent 5-6 adventure with great water physics that haven't really been done before. That's pretty much it and for the low price point its well worth it.  ~Score: 7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "If you like the sort of games that involve running, climbing, swimming, jumping and shooting, you should get this one, because that's what it's about. And it is pretty fun.",
            "review_score": "1"
        },
        {
            "review_text": "I recommend you to save your money for something better.",
            "review_score": "-1"
        },
        {
            "review_text": "It is quite decent game. Will not knock your socks off but it has enough unique(ish) twists and gameplay to be worth it on this age of generic shooters. About 6 hours of campaign with little side exploration - as much as this is possible as game is relatively linear. A bit more character development would have been nice and few threads of the story were left hanging in the end (but then again it is possible that a follow up game was planned to deal with these somehow, dont know). That out of the way the main protagonist has at least some character and motivation in it.   So in a nutshell decent game - quite worth it on sale and if you have nothing to play then might be even be fair trade at it's full price.",
            "review_score": "1"
        },
        {
            "review_text": "While the game is fairly old, it's a bit too hand-holding and looks kind of unfinished. Also, the voice acting and ridiculous amount of cutscenes make it quite annoying. The most annoying thing to me is the fact that you cannot change the display resolution or controls, leaving you stuck with a big, pixellated mess with odd controls. I really, really don't like it. The only reason I have it is I got a coupon for it. 4/10  Alright, we're done here",
            "review_score": "-1"
        },
        {
            "review_text": "Among the worst games that I have ever played. It had some potential, but the story, the voice acting and the controls made me feel it was a waste of time. I hope the developers are working on more interesting projects.",
            "review_score": "-1"
        },
        {
            "review_text": "It is a game about maintenance engineer who gets the points for destroying systems of his ship.  Graphics are good, full voiceover, interesting feature of fluids filling the rooms.  And thats it in general.  I played game with mouse and keyboard [havent seen gamepad tab in options so i guessed it is unavailable - which is not true and probably game runs great on gamepad] and controls are really annoying. Game can have bad visuals, simplistic story and no vioceacting but pristine controls will do the job. Remember first Prince of Persia, or Doom. You start playing and you are the one with the avatar you control. Here you fight with controls to make the character move, climb, jump or dismount the ladder. Mouse sensitivity changes depending if you are in game or in menu or in 3d map or even between scenes - first i adjusted settings in starting room, then it changed when i was in the elevator so i tweaked it again just to revert back when i went out of the elevators shaft.  Gameplay is about runing here and there, following waypoints, doing some basic shoot-and-cover. Bit of climbing with separated buttons to release the grab - like good old crouch wouldnt do the job. Hacking minigame is really easy but really fresh and well executed in it s simplistic form. Then comes swimming... and this is disappointing - i thought that maybe other controls are bad because all effort went to hone underwater action. But not. Camera changes angle if you go under or over water which makes you disoriented a lot and causes 'major annoyance' when simple task like swimming forward is impossible because sometimes your heroine emerges over the surface - changing angle of the camera, so you counter, then she submerges but you changed angle so she swims upward, so again automatic change and counter again and again and again and you struggle to just swim forward. Then there are fast-swim-buttons - and to swim fast you press crouch and do dive you press sprint - just to mess with your mind :P. And you can swim fast in many directions... by using many buttons. So if you aim upward, press swim fast forward you will swim fast forward... in global coordinates, not in your current orientation [it means you will swim horizontaly, you wont swim upward]. On top of that water is usually crumpled with floating junk and you cant get the right feeling of enjoying little diving and uderwater sightseeing.  Fire will kill you instantly all of a sudden. You won't get warning that this little flaming desk is lethal, you will come close and die. Just like that. And first you think 'what happened'? but your character wasn't set on fire, didn't have the chance to step back - just come in the area for 1s and died. You can die easily in situation when there is somethink on fire swimming on the water and you just resurfaced close enough. Unnecessary and simply annoying because it doesn't provide any challenge or platforming difficulty - it is just unexpected sudden death in the areas you have to pass by.  But for sure it is not a game that nobody cared to make. Game looks good, works without glitches, water mechanic is quite unique. It s just possible that there were too many technical and art guys making this game and not enough 'game-feel' experts or somebody with clear idea what this game should be about. Or maybe it was about making visually appealing tech demo of fluid mechanic?",
            "review_score": "-1"
        },
        {
            "review_text": "I feel bad for this game and its developers. I wanted to be able to like it, for their vision, but in the end they remind me of the hill-billy domestic terrorists in Oregon. Instead of the grand, inspiring, ambitious outcome they envisioned, they instead got a bland, cheesy storyline lacking anything compelling, low end production values/graphics, no combat to speak of, and it wound up somehow being simultaneously both short and interminable. A shame, because it had some kernels of genuine potential, a fascinating setting, genuinely interesting water physics, and the hydro-kinesis that only made an appearance at the very tale end. Unfortunately these were drowned out entirely by the oceans of inadequacies in the rest of the game.",
            "review_score": "-1"
        },
        {
            "review_text": "A visually beautiful game, great gameplay and a truly immersive story. There is absolutly no reason to not pick this game up.",
            "review_score": "1"
        },
        {
            "review_text": "Bu this game with a too cheap price. Play this game with a game pad. And find this game worth the price no doubt.  I nominate Hydrophobia: Prophecy for 'I Thought This Game Was Cool Before It Won An Award' Award.",
            "review_score": "1"
        },
        {
            "review_text": "kinda fun, but it makes me a little motion sick",
            "review_score": "1"
        },
        {
            "review_text": "a different game but really good game it most of the time in the water",
            "review_score": "1"
        },
        {
            "review_text": "Right off the bat I have to say, this game has some of the WORST controls ever. The boss fight was a huge pain in the buttocks because of this. There is also an annoying thing that the camera does whenever you go underwater, it snaps the camera all the way down.  Putting that aside. If you can handle the terrible controls and mediocre combat then you're in for a treat. Especially the water.  THE WATER.",
            "review_score": "1"
        },
        {
            "review_text": "An interesting tech demo for water but the story was short and as an episodic game with a bankrupt company the story is hollow. needs more plot and character development if it's supposed to be a story.",
            "review_score": "-1"
        },
        {
            "review_text": "Not a bad game, interesting mechanics when manipulating water. However you get these powers too late in the game for it to be a massive part of the story. Short but sweet, completed it in 3 hours, wasn't bad for £1",
            "review_score": "1"
        },
        {
            "review_text": "An interesting adventure in water physics, with a cool female lead character and compelling story. Gameplay mechanics may take some getting used to, but it is nothing unmanageable. While it won't win any awards, it is just the type of game I love to immerse myself in.",
            "review_score": "1"
        },
        {
            "review_text": "Well, its got water and thats about it.",
            "review_score": "-1"
        },
        {
            "review_text": "For less than $5, it's probably worth checking out. But don't expect it to be a solid shooter, because it's anything but. Pretty much every mechanic is this game feels clunky in one way or another, and even the water physics feel rather strange despite it being the main feature. Underwater combat can get pretty hectic as enemies can come from any direction, barrels and crap floating around more often than not, get in the way of combat. And oh, did I mention that the enemy uses bullet while you use a sonic gun which projectiles are larger and move slower? Also have a slower firing rate? You do get some sort of superpower towards the end, but it's not so super, and well... Rather disappointing. That said, the water mechanics are interesting to look at and is rather unique. Grab it during a sale if you can though.",
            "review_score": "1"
        },
        {
            "review_text": "Water...some much water!",
            "review_score": "1"
        },
        {
            "review_text": "Don't buy this this game is just not great! :(",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty cool water physics.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting take on the 'Survival' genre. Decent value.  Plot seems nice while story is a little weak. You're a super-smart-super-brave systems engineer that just happens to be a totally-in-shape rock climber in her spare time and also, judging by the award on her kitchen table in the beginning (from 7th grade?!), an accomplished swimmer and combat shows her to be a crack shot with a pistol as well.  Wish they played up the 'Hydrophobia' aspect of the game as well as it seems the main character suffers from it, and it is the namesake of the game. She does verbally freak out when an area floods, but other than that stays calm as water rapidly floods and while she swims past dead bodies and such.  The whole reason I got this game tho was the amazing water physics, and to me, they more than make up for the shortcomings of the game. The way the water flows, pushes against your character, floods through doorways as they open, etc are all fantastic and add an extra dimension to gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "This game is very fun although it does crash quite a bit at random but otherwise ME LIKEY!",
            "review_score": "1"
        },
        {
            "review_text": "Good water effects....that's about it. 3 hours of gameplay. If you like to torture yourself with water levels, go for it. Ending was crap. Plot is crap. Runs like crap.",
            "review_score": "1"
        },
        {
            "review_text": "Mind blowing gameplay. This is a fantastic game and you should get it now. You're in for a lot of 'whoa!' moments!",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game with lots of cool things to do,the most impressive is the dynamic water and the game graphical engine wich is unique so far",
            "review_score": "1"
        },
        {
            "review_text": "This game surprised me. Great graphics and the fluids engine are superb!",
            "review_score": "1"
        },
        {
            "review_text": "Bought this for $1.25 during a sale. It's a neat game that reminds me of Oni. Finished it in one sitting, 5 hours of gameplay so catch it on clearance.",
            "review_score": "1"
        },
        {
            "review_text": "A good and innovative idea, that for once was actually done well. If you have $10 to spare, I'd suggest picking it up.",
            "review_score": "1"
        },
        {
            "review_text": "This was a really fun game, for the time it lasted. Stressing time. It was an EXTREMELY short game. I searched every single nook and craney in the game, and even went afk for half an hour, and it STILL only took me 2 hours. The gameplay made up for it a little... but I only paid 50 cents for the game and i'm still split as to whether i would buy it again if i had to.",
            "review_score": "-1"
        },
        {
            "review_text": "Game would be better with more action and less cutscenes. Plus it doesnt really tell you how to 'hack' you just have to figure it out on your own and thats really frustrating.",
            "review_score": "-1"
        },
        {
            "review_text": "Very cool as a proof of concept, best dynamic water physics I've seen in a game. The ai is playstation one terrible however, and it needs serrious optimization work. If you have a super powerful pc and want to see some cool water in a game that is basicly Tomb Raider from ps one its worth the low price. I definitly don't recommend it for everyone, but I hope this developer gets picked up by a bigger stuido so they can actually do something with this engine.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty decent game. Gunplay can be a little iffy at times and I wish the story was a whole lot longer, but otherwise a fun couple of hours",
            "review_score": "1"
        },
        {
            "review_text": "the game is pretty nice. The graphics is okay, the gameplay is okay. I would recommend picking it up while it's on sale. Worth playing though",
            "review_score": "1"
        },
        {
            "review_text": "S♥♥♥♥ing great. I dont know how anyone could ever live their life without the twists and turns of this waterwork. Glass! Water! Fire! this gamehasitall. Glass Water Fire! theres even guns, assasins creed brotherhood, hacking, and more! dont stop playing, ever, really. Theres even a story about terrorists. probably sharks too, if you get far enough. I don't know. Fun fact: Aquaphobia is the correct term. Let that ♥♥♥♥ sink in.",
            "review_score": "1"
        },
        {
            "review_text": "Gorgeous-looking graphics, awesome physics simulation on the water. Good action sequences, passable voice acting and story.  The gameplay is a little flat, and I felt that the game ended way too soon (and left quite a bit unresolved; as far as I know, there's no plans for a sequel).  But the price is right; get it for some fun. fast action.",
            "review_score": "1"
        },
        {
            "review_text": "Cool little game, did not think i would enjoy playing this very much but the concept was cool. it's quite old so remember while not graphically insane it's still fun to play and brings back the old feel for games like tomb raider.",
            "review_score": "1"
        },
        {
            "review_text": "Unexpected nice specially for the price. Story is entertaining &amp; and the overall gameplay good. It runs decent on my system and it looks pretty nice. Good water physics.",
            "review_score": "1"
        },
        {
            "review_text": "Hydrophobia in all its 3 hour long glory switches between dull 3rd person combat and frustrating climbing sections. Some neat water mechanics and effects (opening door to allow water to rush through, knocking enemies off their feet etc) but the game does nothing with them. Some of the most cringeworthy dialogue and voice acting I've ever seen. The controls are unforgivably bad and clunky, only slightly better with a controller. Only reccommended if you want to see the pretty impressive water effects and it's on sale.",
            "review_score": "-1"
        },
        {
            "review_text": "A lot of game for the money. Reminded me a bit of the Deus Ex and Mass effect games.",
            "review_score": "1"
        },
        {
            "review_text": "Shot a fire extinguisher with a bulletless gun, it burst into flames, and a man burnt to death in knee high water. 10/10  worth 50 cents just to see the game's failed potential as a stealth hacking game.",
            "review_score": "-1"
        },
        {
            "review_text": "Lick it... In your bum",
            "review_score": "1"
        },
        {
            "review_text": "The game feels more like a beta or tech demo than anything else. The controls are clunky, but the idea is interesting. I recommend it only cause I got it for 50 cents! Don't pay any more for it.",
            "review_score": "1"
        },
        {
            "review_text": "At the time of writing this, the game is less than £3 on steam - for less than £3 you get a rather fun game.  For the price, the graphics are outstanding, the camera could be improved, but otherwise inventing ways to kill people with the sonic ammunition for your gun got me through the game laughing from beginning to end.  WARNING: This game is EXTREMELY short.",
            "review_score": "1"
        },
        {
            "review_text": "you like that WA-WA?? then you in dere",
            "review_score": "1"
        },
        {
            "review_text": "This game is boring. I have 2 hours in it cause I was doing a virus scan on my laptop and it was on sale for a buck. It feels dry, yes this is a game about water and I said it feels dry",
            "review_score": "-1"
        },
        {
            "review_text": "It was a good game. Great water effects (of course) and the story line was cliche (take out the bad guys while you're a girl in tight clothing) but it had a unique touch to it which I liked.  The game was a bit buggy and in some instanses I didn't have a clue what to do because it wasn't defined well enough. But that doesn't bother me as much because all games have their flaws. But there were two things that set me off: for one, of course if you're on a ship taken over my terrorists, you're gonna see them. But what bugged me the most is I'm literally having a good time and I'm just about to reach the objective and then bullets start pelleting towards me from literal blind spots in the area. Of course the hallways and rooms that they had to protect were understandable but for God's sake I went into a hallway that was overflown (where there was no way to get air) and there were like three terrorists down there and it became really bothersome when they continued to respawn in one place in Act 3.  The other thing that bugged me is that I thought this story was going to have a nice smooth ending where we stop the entire attack but the minute I walked into the last room - boom: boss fight. I like boss fights but in all honesty this game didn't seem like it would have one. It felt like a last minute thing that the creators just dug up. It probably wasn't - since it was a nice fight, but it wasn't needed. Like, I don't even know what I was fighting. Some gigantic futuristic ball of metal. It felt out of place and random, ya know? Others may think otherwise but I personally felt like it wasn't a good ending.  I know I put that I would not reccomend this game but I do on some level because it is a fun game. Short game, as well, but fun. It just had some things that really ticked me off is all but the game itself was beautiful the storyline was good.",
            "review_score": "-1"
        },
        {
            "review_text": " It's not very good. 4/10.",
            "review_score": "-1"
        },
        {
            "review_text": "TLDR: Get when 5 dollars or less. It's a good physics demo but not a good game. The water physics are worth experiencing.  The game is very interesting for a showoff of a well developed water physics engine. That's really the whole point of the game and it is the protagonist and antagonist. You play as a security detail that suddenly gets flooded in during an uprising of the facility with the invisible guidance of your totally-not-boyfriend in a puzzle/shooter while racing or working against water for the most part.  The shooting elements aren't very interesting. You have a few ammo types and an infinite ammo type but these fights are nothing to write home about. It's just a third person shooter. The story wasn't all that moving. Rebels are uprising against the water-bound facility and you're trying to overcome your personal fear of water to stop the bad guy who somehow ties into this.  Now the selling point of the game is intended to be playing with water. You shoot out glass barriers and open doors to flood in a large current which turns the whole place upside down. Unfortunately the whole water-bender magic only happens in the last chapter of the game which is a really short time. You don't get to play with the magic as much as you should.  For a tech demo, I'd say it's worth it when five bucks or even on sale for less than that.",
            "review_score": "1"
        },
        {
            "review_text": "Hydrophobia quickly goes from being a believable and interesting story, to something else entirely. It goes from feeling like an intersting world with lore you want to know more about, to a different kind of science-fiction experience. You go from being rather calm at the beginning, to seeing everything go horribly wrong as your whole world goes crashing into the great, big sea.  Don't get me wrong, it is crazy good fun and a well developed mechanic... it just feels out of place. I liked the idea of using a non-lethal gun to shove my foes into areas they couldn't hit me, and also using it to solve puzzles, while also draining or adding more water to the area I was in so I could move onto the next section. The physics are incredible and the controls are intuitive, all in a world you can't help but be pulled into. It's one of those experiences that is like a bad B-movie but there's something oddly fascinating about it. It's not the violence, because this game isn't really that bloody -- in fact, there's really not much blood until you get firearms that actually shoot bullets instead of concussive blasts -- and it's not so much the thrills... it's the feeling of 'what else could they throw at me?' I was constantly asking myself 'What's next? What else is there? I want more.'  More is exactly what I got. The game only improves with each successive chapter, and then strange things happen... You get almost otherworldly powers. This is fun to use, creating towers of water, drowning your enemies or slowing down their bullets to a halt, but the water is mostly used for puzzle-solving. The puzzle-solving is definitely one of the better components of this game, but combat is actually interesting and fun. It feels almost like a cover-based shooter, but you know for sure that it's not what you're playing because you're not nearly as lethal as they are... at least... at first, you aren't. As things get more difficult, and you get more weapons, you think you have an understanding of just about everything. Then you get powers... Then you feel like you have a grasp on that and they throw more at you. There's so many good twists and turns in this game, it is surprisingly underrated. However... the ending is rather... anti-climactic. Altogether, a good experience.  + Physics + A sense of vulnerability + Puzzles + Combat + Puzzle combat? + Environmental kills; including drowning, electrocution, and explosives + Soundtrack + Story + B-movie feel + Intense without the violence + Collectables + Somehow satisfied by the end of the game  - Anti-climactic ending - Some parts where the story falls flat - Voice acting could have been better directed",
            "review_score": "1"
        },
        {
            "review_text": "You're gonna read a lot of horror stories about how this game sucks and their mean mean developers are harrassing poor victim game critics around.  On the other hand, I found the game to be fun enough (and surprisingly high quality, considering the price tag), and if you hit the Steam forums you're gonna find out that at least one of the developers is not only as polite and nice as they come, they will also hear your every complaint/request and strive to attend them right away.  Make of that what you will. Me, I think the game is good enough for the money, and from my personal experience the developer really deserves being supported.",
            "review_score": "1"
        },
        {
            "review_text": " Hydrophobia  is an unsatisfying but engagingly short tense experience throughout.  In this, we follow a young woman on a dangerous quest to escape a hijacked ship which then leads to unpredictable and intriguing outcomes through the true conspiracy. Though the main villain's reasons could be politically challenged, it's however a rather terrifying and eyeopening perspective on the instinct humans have for survival and balancing economical causes. At times, the protagonist and additional characters are tolerable but unfortunately lack enough depth to be totally memorable.  The toughest gripe about this video game is purely knowing and literally seeing the potential spread between the mess that's the length and shortcomings within the story. It's either presenting itself as a disjointed short cinematic film purposely filled with unanswered questions or what would become a bloated adventurous game had it been thoroughly developed with care. Various things were heavily underutilized to an extent and would've given it a broader identity had there been various adjustments. There's particular creative sequences that surprisingly twists expectations but are merged between some tedious ideas that could either downgrade the enjoyment or levitate the replay value.  Although its promising material was abruptly underdeveloped, it's definitively a self-destructive antique that shouldn't be lost or forgotten within the abyss of video game history.",
            "review_score": "1"
        },
        {
            "review_text": "This is an interesting one.  There is definitely a lot of potential here- the game is great showcase for impressive water physics which brings the game alive and I don't think it has been bettered in a 3D action game since. Unforunately there is not a very good game around the water physics.  It's a action adventure / puzzle game.   The Water  This is the big feature of the game- realistic water that I don't think I have seen bettered in any newer game. The water is the main gimmick of the game (the premise of the game being you're on a sinking ship). Water realistically sloshes about, bounces off walls, creates waves, and if you open a door water will realistically pour out of / into the next room. The really nice bit is that the water level will eventually settle down- if one room is full of water and the next empty, open the door and both rooms will end up half full. Actually, it is more than a gimmick.  In the last 10 minutes of the game you unlock a weird water movement super power that doesn't really add anything and is a pain to use (you use it only a couple of times).   The Puzzles   The puzzles are standard water-game puzzles: raise and lower the water level (by shooting leaky vents etc), put floating stuff under crates / containers (like the boat level in HL2). However the water physics distracted me just enough to not find them tedious. I would have liked to see 'better' (I know that isn't very informative!) puzzles (maybe with the ship listing to one side) as the water physics, in my opinion, can hold the game up on its own if utilised well.   The action   The combat is adequate and not really necessary; if the water puzzle aspect was built upon I think it could hold up the game by itself (after all it is the interesting game mechanic we're here to see!). You have a couple of different types of ammo for your one gun but it doesn't really add much- just shoot the bad guys and they die in slightly different ways. The game has a nasty habit of spawning dudes whenever and wherever it likes- you'll clear out a room, flick the switch to unlock a door and dudes will spawn back in the room you cleared (not even come storming through doors)  What I did like was the underwater gun battles- I can shoot dudes on land in thousands of games, but shooting dudes underwater is a lot rarer! Coupled with the water physics these were pretty good.  There are also uncharted-y climbing sections. These fit in a bit better with the watery game play and are again adequate but this time could definitely be improved and support the 'watery adventure' gameplay without the gunplay if it was integrated like it is in uncharted.   The Atmosphere and Immersion  (The graphics, the sound, the story, the voice acting...)  This is big let down for the game. The story is terrible, with the intro cutscene setting up some backstory of the player character having, you know, a phobia of water but it is not mentioned once in the game (nor is a prophecy). There is no backstory as to if the world is a mess due to overpopulation, and how it got like that. No inforamtion as to why the tech company is respectable (after all, they're usually the bad guys!), or why we should trust Scoot the voice over the radio (co-incedentally he disappears without trace 2/3 of the way in and we never hear back from him at all! Is he dead?). No information on the ship we're on and you wouldn't know it was a ship if you missed the few lines of dialogue saying it is a ship- it could be any old industrial unit / bad guy base really.  There are no cutscenes within the game (other than the odd pan around an environment to show you a door you need to get to), or even at the end! This is not necessarily a bad thing; all the story is presented through the dialogue between ***** (can't even remember the main character's name!) and Scoot. This worked for games like Firewatch, but I did not feel as if the events in H:P affected the relationship between the two characters at all. They'll shout 'OMG are you ok!?' over the radio but that's about it!  The voice acting is actually alright, especially when you consider it is an independent game from 2011. I've definitely heard a lot worse in the world of AAA games.  I would also like to add that the developers added a feedback menu within the game- choose the 'topic' you would liek to give feedback on (graphics, story, controls, water...) choose positive or negative, and why (boring, exciting, realistic, vague...). I think this is a really good idea and should be implemented as much as possible!    Conclusions   The developer has shut down their studio due to the low sales of H:P (their only game). This is a shame as the game (and water physics) had potential, and I hope they went on to do great things at other game development studios.  It is £3.99, give it a try. It is short and can probably be blasted through in an afternoon.",
            "review_score": "1"
        }
    ]
}