{
    "app_id": 92220,
    "name": "GundeadliGne",
    "release_date": "2011-09-27",
    "developer": [
        "Platine Dispositif"
    ],
    "publisher": [
        "Rockin' Android"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Co-op",
        "Shared/Split Screen",
        "Steam Achievements",
        "Partial Controller Support",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Bullet Hell",
        "Shoot 'Em Up",
        "Anime"
    ],
    "achievements": 12,
    "positive_ratings": 124,
    "negative_ratings": 22,
    "price": 2.79,
    "description": "Reload for more shooting action with GundeadliGne, the 2nd title in the Gundemonium Collection",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/92220/header.jpg?t=1530115310",
    "minimum_requirements": "Operating system: Windows® XP, Vista, or Windows 7 Processor: Intel® 1 GHz Processor (Recommended: 2 GHz) Memory: 256 MB RAM (Recommended: 512 MB RAM) Hard disk space: 500MB Video: DirectX® 9 level Graphics Card Sound: DirectSound-compatible Sound Card DirectX®: DirectX 9 or above",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Words cannot describe how wonderful this game is. And DM Ashura's remix makes it even better.",
            "review_score": "1"
        },
        {
            "review_text": "Great, but difficult. There is certainly a learning curve and even those will little experience with shmups will eventually, but surprisingly, find themselves gracefully dodging streams of bullets. The co-op is a pain, however, as the game is unforgiving and offers no continues or credits in that mode.",
            "review_score": "1"
        },
        {
            "review_text": "Closest we get to a Touhou game on Steam.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent 2D shooter with an interesting time-attack mechanic on each stage that varies enemy placement and even how many bosses you face. An improvement over the PS3 version due to the frequent patching it recieves.",
            "review_score": "1"
        },
        {
            "review_text": "i still don't know what the ♥♥♥♥ing hitbox is  also online co-op bullet hell. its 4 bucks. buy it. and it has moe girls!!",
            "review_score": "1"
        },
        {
            "review_text": "Much easier than I thought it would be. Pretty boring overall.",
            "review_score": "-1"
        },
        {
            "review_text": "I'm not a flying shooter fan, this is a flying shooter.  I would stay away from this pack.  1/5",
            "review_score": "-1"
        },
        {
            "review_text": "Alright, here's my first coherent steam review.  What can I say? This game is hard. I mean, I can 1CC a few Touhous on lunatic, but that's literally nothing compared to this. This is a real challenge for real men, real women, and real women who dress like men. This game throws everything and the kitchen sink at you, and I don't know about you, but I don't like getting hit with sinks very often (unless I'm feeling overly masochistic - but I digress). Anyways, the story is about a nun and a doll ♥♥♥♥ing ♥♥♥♥ up in Hell, and some crazy old warrior chick doing the same thing but for more personal reasons. And then there's Lotus - who if you're good enough, she gets naked on screen. I'm not kidding, but that's not even the least amount of nudity. Half the enemies are nude. Like, you almost want to stop playing and start fapping and BAM! That's how they get you. Keep your clothes on because with this game, there's enough nudity.   Final rating: 9/11 great challenge and naked cat girls",
            "review_score": "1"
        },
        {
            "review_text": "Highly addicting and alot of fun!",
            "review_score": "1"
        },
        {
            "review_text": "Cute Bullet hell, great mixed soundtrack, *fan service*, multiplayer co-op combination. great stuff !!",
            "review_score": "1"
        }
    ]
}