{
    "app_id": 92300,
    "name": "A.R.E.S.: Extinction Agenda",
    "release_date": "2011-01-19",
    "developer": [
        "Extend Studio"
    ],
    "publisher": [
        "Extend Studio",
        "ORiGO GAMES"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Platformer",
        "Indie"
    ],
    "achievements": 24,
    "positive_ratings": 564,
    "negative_ratings": 253,
    "price": 3.99,
    "description": "You are the ultimate weapon with an ultimate sidekick – Collect secret items and get power ups to become the perfect weapon.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/92300/header.jpg?t=1447353830",
    "minimum_requirements": "OS: Microsoft Windows XP, Windows Vista or Windows 7 Processor: Intel Core™2 Duo Processor, AMD Athlon x2 Processor Memory: Windows XP：1GB, Windows Vista, 7：2GB Graphics: NVIDIA GeForce 7600 series, ATI Radeon HD 2400 series DirectX®: DirectX 9.0c Hard Drive: 300 MB Sound: DirectSound compatible (DirectX 9.0c or higher)",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "A real gem of a platformer. I loved the currency system in here as you can replay previous missions to collect more recycled parts to create power-ups and upgrades to your character's weapons.   The actual levels are very well designed, there are plenty of jumping puzzles which can get frustrating but it's still a required feature in any platformer.   I really enjoyed using the plasma field weapon, you feel pretty overpowered while using it, although you are far from it as you will find yourself dying over and over again but wanting to come back for more.   Really recommend this as it's good few hours gameplay for cheap!",
            "review_score": "1"
        },
        {
            "review_text": "This game is very entertaining! If you are a fan of Megaman games, this game has a lot of those same features. There's a good variety of weapons and enemies to keep you interested for a long time, as well as secrets that will make you replay levels to collect. Overall, it's a top of the line game in the $10 tier, so definitely worth the buy.",
            "review_score": "1"
        },
        {
            "review_text": "How did it all go so wrong? You had decades of platformers to look back on to get it right. This is not a bad game per sé, but I could find faults with nearly every aspect of it without trying.  As hommage to Megaman (I presume), your starting suit is  bad . That's fine as you get the better suit quickly, but the weapon upgrades are something else. I only upgraded the Wave Emitter because a gun shooting through walls seemed OP. It is, and incredibly so. It made the game completely trivial until the last boss (where it still seemed to outperform all other guns by a long shot), and the SMG seemed similarly powerful.  Difficulty comes in 2 forms: surprise attacks (mobs that will charge at you as you enter the next screen, you'll quickly learn to zone with attack held down) and the lack of a second thumb on your right hand that would allow you to jump while firing. The controls are...it's hard to describe, it feels like there is some sort of weird animation-lock that prevents you from turning around/jumping as soon as you'd expect to be able to (which is awful in a game designed with heavy slide usage in mind) after firing. Example situation as I have witnessed it: I'm firing at something to my right, I'm on the left edge of a platform, the next higher one is up to the left. I fire, press and hold left and press jump. Character fires, turns around, walks off the edge. This can be reproduced 100% of the time, I'm not sure how this got through. Sure, you could say 'so you walk off a platform, big deal', but what if the platform is a laserbeam and my attempt to jump is an attempt to slide through it, but instead I get hit (this situation brought to you by the final boss)? These are real situations, and they make the game quite annoying.  Grenades seem kind of tacked on and pointless until you get the unlimited grenades-upgrade, you only need to grenade-jump very occasionally and the other weapons are so strong that you don't need grenades for combat. Speaking of 'tacked on', the crafting system also seems pretty redundant. It's not too painful, and it allows you to farm healthpacks, but you could always farm lives in these sort of games, so it's nothing really new (which is fine).  The boss patterns are very simple. I don't play these sort of games that often, yet I don't think I needed more than 2 attempts on any boss except the last one (on Hard). In fact, I think I oneshot all but 1 and the last boss boss on my first run.  The last boss is a three phase fight, and presented the only real challenge in the game for me. Sadly, however, this was mostly because of the bad boss(-room) design and phasing. The bottom left and right platforms regularly get you stuck (due to the ramp underneath), the big yellow laser orb has a larger hitbox than is visually apparent (I must have gotten hit by that about 20 times when it clearly didn't touch me), and if there are projectiles out on the screen when the boss phases, you will be rooted in place and take the projectiles in the mouth as there is nothing you can do about it. Mechanically the boss was somewhat challenging and fun otherwise, though still only what you'd expect in other games on Normal difficulty.  Overall, A.R.E.S: E.A. is a very short (~2.5 hours for first playthrough) and easy platformer with Twin-Stick shooting (please tag the game accordingly!), little innovation and many flaws. This is the kind of game you will best enjoy if you want to replay and master it (and you will have to if you want the achievements). For a one-time playthrough it is utterly unremarkable, but the upgrades from the first playthrough persist and make replaying it a somewhat appealing proposition.  With as little choice as we have on Steam for Megaman-like games, it's an okay buy. If I had to give it a rating, I'd say 6/10.",
            "review_score": "-1"
        },
        {
            "review_text": "A.R.E.S. is a 2D action platformer in the vein of the Megaman series of old. You move to the right, shoot anything that moves, get and equip different weapons, and die frequently.  The jumping mechanics are a little loose/rough, and the game is quite short. It's not great, but if you're into that sort of game, you can't go wrong with picking it up on sale.",
            "review_score": "1"
        },
        {
            "review_text": "ARES is an interesting game and is definately worth a look despite some of the negative reviews you might see. It's a side scrolling action game, very similar to Mega Man. The game's story is not it's strong point; essentially you're a robot sent on a mission to a space station to stop the evil AI from blowing up a planet. Typical stuff.  The gameplay is standard run 'n' gun for the most part, and features an upgrade system where all of your weapons can be upgraded to make them stronger. Although usually this doesn't seem to be worth it as the differences in damage are minimal. Besides what you should do is to take those components for upgrading and use them to make medkits for healing; with enough of them the game becomes a breeze since all enemies drop components.   Of course there is a higher difficulty setting, and rankings for each stage if you're a completionist. It's not the best game out there but it isn't the worst either, and recommended if you have some cash to spare and some time to kill.",
            "review_score": "1"
        },
        {
            "review_text": "It's, ok.  Get if its on sale and you REALLY want a quick mediocre fix for lack of Megaman games these days. The graphics look very N64-ish. The controlers do not feel as tight as they should be (like many N64 titles). Kind of sluggish. Even unresponsive at times. I've experienced a handful deaths where my attempt to make a simple jump ended with me walking right off a ledge to my doom. And for no obvious reason other than buggy controls.   Overall the game is fun for a short time and not nessesarily a bad purchase. Just don't expect anything amazing. Overall the game just looks sounds and feels weak but if you get past that and just enjoy it for what it is (a Megaman esc action platformer) then you might actually like it. If this were a console game I would sum it up as a good one to rent.",
            "review_score": "1"
        },
        {
            "review_text": "A review for me (so i know ive'completed' it) and my friends.  21 of 25 (84%) Achievements Earned  An alright platform game with some good music, its a bit like mega-man x super metroid.  can be played with a gamepad or mouse n keyboard.  has only 5 levels but gives you ranking at end of every level and rank SS is for the big badass players, the easyiest achivment in the game is teh facebook share one.  well worth the £7. wont say much about the story as heck it says a bit about it on the store page.  Give it ago!!!  7 / 10",
            "review_score": "1"
        },
        {
            "review_text": "ARES is pretty great. Mega Man-esque action and a great soundtrack by the guys who did the Iji soundtrack. The boss fights are frantic in hard mode. The only gripe I have is the need to farm materials to get SS rank, but if you don't care about tha t it's a good game, good for speedrunning and no-damage runs too.",
            "review_score": "1"
        },
        {
            "review_text": "This is a 2D platformer shooter with a very arcadey look. It doesn't bring much to the old, dead genre and there's technical limitations which give it the thumbs down.  The animations are pretty bad, really clunky and not smooth.  Controls are awkward and cludgey.  The enemies are all very samey and boring.   You can't set your resolution above 1080p, which was a popular gaming resolution about 6 years ago.  Worth giving a miss.",
            "review_score": "-1"
        },
        {
            "review_text": "For a quick fix action platforming A.R.E.S. Delivers.   Lots of playstyles are supported, the graphics are great, incentive for replaying in the form of unlocks and upgrades. Unfortunately the game is short. Very short.   The game is very cheap if you don't already have it hidden in your library. If you do you may want to try out this gem.  3.5/5 2 Hours To Complete",
            "review_score": "1"
        },
        {
            "review_text": "the game that WAS MIGHTY NO.9 before it was even spurted into existance by kenji inafune.  seriosly getting this is better then crappy no.9",
            "review_score": "1"
        },
        {
            "review_text": "This game is not worth the money you will spend on it. The gameplay is unoriginal, jumping between platforms is difficult at times, the enemies are boring, and attacks from the final boss are hectic and near impossible to dodge. The chosen style of art is not appealing, the animation is not well done, and the sound effects do not fit their actions. The campaign was only a few hours long--and could probably be finished quicker--and was not worth the amount I spent on it during the sale.",
            "review_score": "-1"
        },
        {
            "review_text": "A.R.E.S is a fun side-scrolling platformer, kinda like Megaman games (the first thing it made me thought of). It provided some decent challenge (at least if you play on Hard difficulty) and the storyline was a pass. You unlock 4 weapons throughout the game which you can upgrade into stronger versions, 5 levels each with its own boss, so the whole game was fairly short and could be finished within 3-4 hours. Although, there is a lot of replayability value if you want to upgrade all your weapons, find all the secrets and get perfect SS score on each level, and other things that are listed in the achievements.  For $5, I'd say the game wasn't bad and definitely worth trying. However, I do want to point out that there is a similar game called A.R.E.S: Extinction Agenda EX which is available for $5 extra (if you already own this game) and is apparently an improved version of this game with more content. I haven't got to play the EX version yet, but I'd say that this game has at least earned my recommendation.",
            "review_score": "1"
        },
        {
            "review_text": "Story: Crap Gameplay: Crap Graphics: Crap Music: Crap Sound: Crap  It tries to be Megaman and fails epically. It's just a really annoying game. I played it and got my trading cards so I can sell those and at least get something out of this horrible game. Now I am deleting it and adding to my crap games list.",
            "review_score": "-1"
        },
        {
            "review_text": "I bought a bundle just for this game, and for the most part, i'm not disappointed. If you enjoy Megaman, you'll feel at home with this. It has a fixed theme that escalates it art style, and provides gameplay that is fluid, even offering a crutch for player less adapted to it. For the most part, it's a fun, short experience. My only con is the game feels EXTREMELY slow, in terms of character and enemy animation. I had to check several times what my FPS was. It feels like it hinders the great animation cycles but once you get used to it, it's dandy.",
            "review_score": "1"
        },
        {
            "review_text": "Personal Rating: 4 of 10  If you are familiar with the Megaman series back in the days, you will definitely see the similarity here in this game. You control a futurisitc armored character in this 2D character with 3D environment side scrolling where you collects scraps to upgrade your weapon and equipment. However I must warn you that this game is much more challenging. I played this game using a game pad and how I loathe the jumping part. It sometimes does not register the jump when you press. Also there are many situation in the game when you die almost immediately causing to repeat a scene over and over again.  If you liked Megaman and love to take games challenges to a greater height then this is the game for you.",
            "review_score": "-1"
        },
        {
            "review_text": "I didn't like A.R.E.S. that much. It seemed like a side-scrolling action game in the vein of later Mega-Man games but didn't bring much new to the table.",
            "review_score": "-1"
        },
        {
            "review_text": "Not as fluid as i would like to but overall it's not bad. 4/10",
            "review_score": "1"
        },
        {
            "review_text": "A good game for those who like platform action games. It's funny to shoot robot enemies xD",
            "review_score": "1"
        },
        {
            "review_text": "One of the best Megaman's clone.",
            "review_score": "1"
        },
        {
            "review_text": "I finished this game once, couldn't be bothered to finish it again. The controls are clunky and the story is forgettable.   Still it only takes about 3h to finish it so if you have some time to kill and just want to play something different give it a go.",
            "review_score": "-1"
        },
        {
            "review_text": "Not very exciting game. Unplayable without controller ... don't waste time and money on it.",
            "review_score": "-1"
        },
        {
            "review_text": "A.R.E.S.... A great classic side scroller game brought back to life with new refined graphics and gameplay!!!",
            "review_score": "1"
        },
        {
            "review_text": "The developers of this clearly played a lot of Mega Man X. It's too bad they forgot to include any of the speed, precision, impact or fun.",
            "review_score": "-1"
        },
        {
            "review_text": "A.R.E.S.: Extinction Agenda is a crafty composition of Megaman and Metroid. If platforming shooters is your thing, this is the game to have.",
            "review_score": "1"
        },
        {
            "review_text": "The Diet Coke of Megaman. Just one calorie, not Mega enough.",
            "review_score": "-1"
        },
        {
            "review_text": "Yes, many people have said this is your regular platforming, side-scrolling, shooter. In some ways, yes, they are correct. However, I would have to disagree that A.R.E.S. is anything more than 'regular'.  First of all, I have to talk about the music. It has a taste of Megaman X in it with a pinch of awesomeness. While you make your way through the stages, scrapping the bots that stand in your way, you are more and more encouraged to continue the destuction. Once you hear the tracks, you'll want to listen while playing other titles too! More reason to pick up the soundtrack since it is available.  Next I need to talk about the art style. It has a retro feel to it, but has a very polished look. You really get to admire the artwork during the boss fights. The way they move and represent attacks really breathes life into the game.  Lastly I will touch on the gameplay. A.R.E.S. does not require a high skill in gaming to be able to pick this title up and get to the action. Of course, there are extras in the game that will require you to hone your skills, but are worth it in the end to make you a better bot buster! Let me mention the boss fights. Don't let the appearance of the boss on-screen fool you. They whip out attacks that will leave you dumbfounded about how to counter! While rough, it makes for fun fights.  All-in-all I was able to finish the game fairly quickly, but for gamers that like completing all the side stuff and maxing out your abilities, this title will provide plenty of replayability without you having to sacrifice hundreds of hours.",
            "review_score": "1"
        },
        {
            "review_text": "Somewhat janky controls, level design that varies between boring and aggressively frustrating, and an upgrade system that feels like it was thrown in just for the sake of having an upgrade system. You can pass on this one.",
            "review_score": "-1"
        },
        {
            "review_text": "Restraint and focus on a wide audience is visible in everything, and if not for the plot , ' comics ', one would think that ARES: Extinction Agenda made ​​somewhere in sunny California . The plot , at least , typically Hollywood : the space station going Rise of the Machines , and the rescue astronauts from Earth sent armed robot erectus .  Then - just like old times. Controlled by the player with the Guyver Megamena hybrid runs on a two-dimensional level , it jumps flying orange dot and continuously shoot everything that moves , including the inevitable 'bosses' the size of the entire screen. Of destroyed enemies while tumbled parts , in exchange for which we buy repair kits and upgrades for the four types of weapons . Free of quelling a riot seconds can devote burdensome (not yet Metroid ) survey corners and finding secrets. Curious award information about the world and - again - increasing the firepower of a lifeguard.  Unfortunately , Ares improved too quickly , so the first passage on the same high level of complexity is not difficult and it takes the strength of a couple of hours . Five beautifully drawn locations little offensively , even if to make allowances for the fact that Extinction Agenda - only the debut episode of the upcoming series.  Stretch pleasant leisure possible unless 'achievements' : complete the stage without using ' kits ' to get maximum combo smash into component parts thousand enemies , advertise game among friends in Facebook ... Complete all tasks quite real, so that the counter reaches five passages soon - ten ' races .' Even without these missions A.R.E.S. would not represent any interest in sports : in the 'life ' is not limited to, save points are placed on every third screen. I seem to miss in his fingers trembling at the prospect of starting anew because impenetrable final ' boss .'  Otherwise nothing to complain about at all desire. Management problems will not arise nor orthodox Old Believers with keyboard and mouse , no holders for the Xbox 360 gamepad . Cute soundtrack, neat and detailed landscapes , impeccable workmanship - probably to work Extend Interactive take only incurable perfectionists .",
            "review_score": "1"
        },
        {
            "review_text": "Pretty neat. Reminds me of Megaman X for the Playstation. You can upgrade weapons among other things, kinda neat. I'd give it more than a 68 metascore.",
            "review_score": "1"
        },
        {
            "review_text": "I liked it. Short and a bit challenging, nice graphics.",
            "review_score": "1"
        },
        {
            "review_text": "4/10  What is this: Remember an oldie called 'Abuse?' No? Well this games plays just like that game. It's a platformer where you have to use your mouse for aiming.  Graphics: The game looks good. Colors are vibrant. Nothing particularly stands out, however. It's probably a matter of personal preference, but game is not aesthetically pleasing. Monsters don't have 'personality.' Animations are boring. That's not to say the graphics are bad.   Sound: The game noise level is too high. Music and sounds don't complement each other. Instead, they mix into a mess.   Gameplay: The story is forgetable. Level design is decent and prompts interest in exploration due to secrets and upgrades. Respawning enemies become annoying, though. The game is pretty hard even on easy.   Verdict: If you are a fan of action shooter platformers, you may want to give it a try. Otherwise, there are better options out there.   Peace, friendship, bubblegum!",
            "review_score": "-1"
        },
        {
            "review_text": "Only you can save the world from gas.",
            "review_score": "1"
        },
        {
            "review_text": "It's like playing Megaman without it being memorable or endearing in any way.",
            "review_score": "1"
        },
        {
            "review_text": "This is sort of the opposite of a recommendation. I would recommend avoiding this game. It's very boring/repetitive and not very fun.",
            "review_score": "-1"
        },
        {
            "review_text": "This is one of those 2D sidecroller shooters that are almost there. It would be an okay game if it was smoother. That's what it's missing, your movement is all sudden and jerky, the jumps feel liks ♥♥♥♥, and it kinda feels... eh. Now if you had PHYSICS, it'd probably be ♥♥♥♥ing AWESOME, oh yeah, and nicer camera and level design would be great! And a better soundtrack too!  Cool concept, could have been done so much better.",
            "review_score": "-1"
        },
        {
            "review_text": "Mediocre platformer... the character feels too heavy even though the controls aren't that bad. It's not nearly as good as Cave Story+ but it does have some visual appear. It draws a lot from classic platformers. Unfortunately, the game draws upon a lot of the bad elements of the old platforming genre (too much instant death and a vertical climb stage).",
            "review_score": "-1"
        },
        {
            "review_text": "Critiques: -Art style is nice, but because the enemies' art designs are busy, they blend in a little too well with the environment. Could use more contrasting or brighter colors for visibility. -There is an odd dead zone where your bullets won't hit which is exactly next to your character's hitbox. -Can't pinpoint the precise issue, but the jumping feels 'floaty'.  Other than those issues, a very proficient game.",
            "review_score": "1"
        },
        {
            "review_text": "Not my style of game, but seems well made if you're into these kinds of things. The music is pretty solid. There's some kind of narrative going on here. Two thumbs up. Just not mine.  Also, cards.",
            "review_score": "1"
        },
        {
            "review_text": "Summer Gaming Project Review:  Feels like a slower, more deliberately, and linear, take on Megaman X. Decent boss fights.  3/5",
            "review_score": "1"
        },
        {
            "review_text": "I was about to give this game a silly, inconsequential review like 'You are the former spirit of a fireman possessing a robot, and all you see are fires on the faces of robots, and you must use your ♥♥♥♥♥♥♥t repeating laser hose on them to save them.'. Then I remembered that buying your own repair kits is actually kind of worse than regenerating health and that the game pretends to be a Metroidvania so that it can turn its five already short stages into farming and busywork. So this game doesn't deserve that review, because it is not cool enough.",
            "review_score": "-1"
        },
        {
            "review_text": "Kind of a weird mix of Contra and Mega Man with generally solid gameplay mechanics and a touch of indie jank to it. Controls can feel a bit stiff at times and I'm not a fan of the somewhat bland anime style artwork, but it gets the job done. Decent game if you like action platformers.",
            "review_score": "1"
        },
        {
            "review_text": "Somewhat rough looking Metroidvania game that starts to stagnate near the end and requires frequent grinding to power up the weapons and armor.",
            "review_score": "1"
        },
        {
            "review_text": "While it trys to be 'Metal Slug with upgrades', it ends up with none of the charm, with hlaf of the olverall time to beat. Unless you are really big about replaying stages to get SS and trying to get all of the achivements, this game will run dry only 2 hours in. Not really worth the $10 dollar pricetag.",
            "review_score": "-1"
        },
        {
            "review_text": "There really should be a 'maybe' button. Oh well.   This game is basically a Megaman clone. If you played it, you know what's comming. Hard stages, even harder bosses and close to no plot whatsoever. And that's it. It's a Megaman with funcy name. Oh joy.   Once you play throu this game, you realise, how short it is. It took me like 2 hours to almost finish it. Why almost? Well, it's close to unplayable without controller. So if you don't have one, don't even bother. On gamepad this game would be so much better, and fast-paced action really fun to play. On keyboard on the other hand it's ♥♥♥♥♥♥♥♥. Move along.  Music and sound effects are mediocre, so is graphics. Yea, it's indie game, but so is Risk of Rain, and music there is so ♥♥♥♥ing awesome (and it's in 8bit!) I want to rock out every time I hear it. Here? Meh, been there, done that. Generic sf sound.   The olny spicy parts are achievements, but they are impossible without controller.   Okay, if this piece is on sale and you happen to have some gamepad, it would be nice. It's old school and neat, well done, althou kind of limited. If you don't have a gamepad and/or it's on full price, don't buy this. You will spend your money better on Risk of Rain or Broforce. Nuff said.   Zawisza out.",
            "review_score": "-1"
        },
        {
            "review_text": "Fun, Can upgrade and get new gear. Too mauch mario brothers though. I get frustrated and give up.",
            "review_score": "1"
        },
        {
            "review_text": "A better Mega Man game than the last 10 Mega Man games.",
            "review_score": "1"
        },
        {
            "review_text": "If you are looking for mega man style platforming and are on a budget, I definitely recommend this game. It is rather short, but vcery fun. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "I like platform games, however, I find this one rigid and difficult, ok so you can craft health packs basically, wow, make pick ups a chore then.   I like a platform game character than can cater to different play styles, I just feel that this one doesn't suit me, ok, so I can't jump this enemy, is there a roll? no, perhaps I'm missing something? Was I suppose to just craft a few more repair kits? So that's what this boss is going to do, just charge, charge, charge.  You know a good platform game when it push's your skills, you can walk up to the boss, have a slither of health left, yet you dart around your enemy, near misses, excitement galore. This game has none of that.  Yeah, I can't recommend it.",
            "review_score": "-1"
        },
        {
            "review_text": "Great Story, Great Soundtrack. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "A solid gem of a platforming shooter. It's a bit short, only 5 levels, but you'll find yourself replaying levels to boost your score, get achievements, or collect raw materials for upgrades or health kits. Has a great pumping soundtrack.",
            "review_score": "1"
        },
        {
            "review_text": "Very reminiscient of megaman x and other old school shooters, with a unique art style. It's difficult enough to be rewarding, but not enough to be frustrating.",
            "review_score": "1"
        },
        {
            "review_text": "X's nephew!",
            "review_score": "1"
        },
        {
            "review_text": "Not a very interesting side scroller shooter. Enemies respawn off screen constantly, boss battles are lame, and there are tons of cutscenes you can't skip.  ",
            "review_score": "1"
        }
    ]
}