{
    "app_id": 92600,
    "name": "Xotic",
    "release_date": "2011-09-16",
    "developer": [
        "WXP Games, LLC"
    ],
    "publisher": [
        "WXP Games, LLC"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Partial Controller Support",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "FPS"
    ],
    "achievements": 46,
    "positive_ratings": 121,
    "negative_ratings": 39,
    "price": 7.19,
    "description": "Rack up huge scores by shooting enemies, detonating chain reactions, and discovering secret power-ups and point multipliers",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/92600/header.jpg?t=1447354691",
    "minimum_requirements": "OS: Windows XP, Vista, 7Processor: 1.7 GHz Dual Core or betterMemory: 2 GB RamHard Disk Space: 3.5 GB Available space Video Card: 512 MB DirectX 9.0c compatible graphics card (shader model 3)DirectX&reg;: 9.0cSound: DirectX 9.0c compatible",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I wanted to like this game, looks like a challenging FPS ... but its average 3D engine combined with weak movements system prevent me to enjoy it.",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty short game unless you want to repeat the same stages over and over and over, overall this game is not the best, its combat and movements seem clunky and the camera view of your character is not accurate, they have the camera placed in your characters chest rather than head so when it seems like you can fit though something you actually cant, the platforms become enraging, not even sure how i unlocked them but the more you get the more it turns into a junbled mess of invisible platforms blocking you in even when you are in mid air you can still get trapped from these platforms, enemies are stupid they barely make any sound when attacking you and sometimes you wont even notice your being attacked and then you will suddenly die, maps are boring and seem repetitive, main idea behind game is to just combo everything and get high score. Graphics are pretty crap and constant view of just weapon is annoying. Cant recommend this game, ive played better free ones online. DLC is also pretty average, basically just another average 3 missions, luckily i got this game in a bundle so it works out to about 10cents for whole game and all DLC so i wont hate on its value but its definatly not worth what they are charging.",
            "review_score": "-1"
        },
        {
            "review_text": "Odd, underrated, cool.",
            "review_score": "1"
        },
        {
            "review_text": "Like any good arcade game, it doesn't take very long to get used to the game mechanics but it DOES take a decent amount of skill to rack up high scores. There are rewards for being attentive and thorough and awards for being fast as possible, but to earn the most points you'll have to do both. On the highest difficulty it can get quite challenging to survive the combat levels, but if you're easily frustrated or just like looking around, on easy difficulty you can focus purely on exploring and getting 100% on every level.",
            "review_score": "1"
        },
        {
            "review_text": "Fast paced, addictive, a great assortment of weapons and great visuals. Who said FPS's need to be brown and grey anyways?",
            "review_score": "1"
        },
        {
            "review_text": "My name is Xotic and I try too hard to be different.  Please kill me.",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "play as xotic, the ♥♥♥♥♥iest rendition of peggle since peggle 2. now in 3d",
            "review_score": "-1"
        },
        {
            "review_text": "This is what happens when you let creative people be. ♥♥♥♥ gets weird. Your a very wierd lil alien dood with leaves growing out of him with a giant fly that u have your hand up its ♥♥♥ thats actually a gun, aaaand u can ♥♥♥♥ solid hovering holograms.   On top of this there is this huge orb thing that basicly destroys planets, and you and your fly are going to go kick his teeth in.  riiiight..  I'm still not really sure what to make of xotic, i am although constantly finding myself enjoying it.  I can see where the developers are coming from after watching the videos on the game store page, they wanted the 80s arcade shooter feel focusing on time, points and a chain scoring system. And to be honest they did that quite well, the game play mechanics are very solid although i would probably feel more pumped during levels with better more spacey (ala super stardust) music going on.  8.3 for me. (yes i know thats quite high, im shocked too)",
            "review_score": "1"
        },
        {
            "review_text": "Weird but in a good way.  Xotic puts you in a fantastic world with xotic (pun intended) plants and creatures, evolving and using special powers to defeat the orb. This is done by fighting for points - the objective is get the highest score possible. The game has a quick pace, you'll be jumping and flying and shooting your way around all the time.",
            "review_score": "1"
        }
    ]
}