{
    "app_id": 92700,
    "name": "Shadow Harvest: Phantom Ops",
    "release_date": "2011-04-15",
    "developer": [
        "Black Lion Studios"
    ],
    "publisher": [
        "Viva Media"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Cloud"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "Stealth",
        "Third-Person Shooter"
    ],
    "achievements": 0,
    "positive_ratings": 36,
    "negative_ratings": 79,
    "price": 6.99,
    "description": "BEHIND EVERY WAR IS A TRUTH YOU WERE NEVER MEANT TO KNOW",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/92700/header.jpg?t=1447354028",
    "minimum_requirements": "OS: Windows 7/Vista/XP Processor: 3.2 GHz or better Memory: 2.0 GB of RAM Graphics: 256 MB RAM DirectX®: DirectX® 9.0c Hard Drive: 8 GB Space Free Sound: DirectX 9.0c compatible",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Good game. Should be rated at least 60 easily. Definitely not 34. Not an AAA grade title, so don't expect CoD and you'll enjoy it. Single player only. No achievements. Good story and ending. Voice acting is good but lip synch not so much. Graphics are good once you switch OFF Bloom and Ambient Occlusion. Controls are fine.  So why all the rabid nonsensical reviews? Well, the game makes a very revealing and unfriendly observation on the real world US involvement in global terrorism as its ending, which I guess explains most of the smear campaign leveled against it by the establishment controlled mainstream reviewers and army of social media manipulation commenting staff. It is telling that all the major review sites harshly pan this game while almost all the minor lesser known sites are fair to favourable.  The real score for this game should be 6/10, and in my personal opinion 7/10. To sum up, I would say worth 20$, and definitely a must have on sale for 5$ or less.",
            "review_score": "1"
        },
        {
            "review_text": "The Good:  - interesting story - character switching (one stealth, one shooting) - some over the top shooting action (you get a mech) - all checkpoints are saved and can be reloaded later  The Bad:  - graphics are incredible dark and have a crap filter on top - you use night vision in broad daylight - no gamma control - performance not that great - no quicksave or regular save, only checkpoints - checkpoints to far apart, but managable - no ammo/health refill at checkpoints, only between missions - old-school healthpacks - bad audio mixing, voice gets overpowered by background noise - difficulty is a bit wonky, play on easy  Overall I enjoyed this one quite a bit. It certainly has issues, especially the graphics-filter is annoying and some game mechanics are never that well explained (never used attractor bolts, as they always caused more problems then they solved), but the game provides enough freedom to allow some fun trial&amp;error experimentation. It feels quite old-school in that regard for better and worse. It's certainly far better then the 34 Metascore would make you believe, but it certainly could have used another month or two of polish.",
            "review_score": "1"
        },
        {
            "review_text": "Overall, this game kept me entertained for a few minutes. The graphics are nice, and I enjoyed the limited amount of shooting that I did. I'm not sure why this game is rated so low by so many people... I've played MUCH worse games with higher ratings.",
            "review_score": "1"
        },
        {
            "review_text": "'Create RendererFailed'  All I can say about this game.  Really, I didn't expect much to begin with when I downloaded it (was part of a bundle I bought), but that I can't even play the game kinda sucks...",
            "review_score": "-1"
        },
        {
            "review_text": "Was not impressed with the gameplay. I took bullets through cement walls but couldn't shoot through them myself.",
            "review_score": "-1"
        },
        {
            "review_text": "Do not buy this game. If you already have this game, do not install it. If you have this game installed, delete it.  This game is not worth buying. Hell it's not worth playing even if you got it for free like I did. In my honest opinion, this is one of the ♥♥♥♥♥iest games I have ever played, and I have played a lot of ♥♥♥♥♥♥ games. It's like they looked at all the fps games currently on the market, threw out everything that was good about each of them, and combined all the leftover ♥♥♥♥ into one abhorrent abomination of a game.  0/10, this game should be nuked from orbit. It's the only way to be sure.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a great game for people who like ♥♥♥♥ games. The protagonist as far as I was able to withstand him, was an 'I'm more testosterone than you!' edgelord who clearly was just too damn good to be there. The acting is ♥♥♥♥, the gameplay is ♥♥♥♥.  if I were to summarize this experience, it would be a ♥♥♥♥ sundae topped with ♥♥♥♥ that just crawled away from gross sex with a lot lizard.",
            "review_score": "-1"
        }
    ]
}