{
    "app_id": 92800,
    "name": "SpaceChem",
    "release_date": "2011-03-02",
    "developer": [
        "Zachtronics"
    ],
    "publisher": [
        "Zachtronics"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Puzzle",
        "Difficult",
        "Programming"
    ],
    "achievements": 20,
    "positive_ratings": 3700,
    "negative_ratings": 324,
    "price": 6.99,
    "description": "Zachtronics is back with an ambitious new design-based puzzle game. Take on the role of a Reactor Engineer working for SpaceChem, the leading chemical synthesizer for frontier colonies. Construct elaborate factories to transform raw materials into valuable chemical products!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/92800/header.jpg?t=1548803761",
    "minimum_requirements": "OS: Windows XP SP3 / Vista / 7 / 8 / 10 Processor: 2.0 GHz Processor Memory: 1GB RAM Hard Disk Space: 300MB Video Card: frame buffer support recommended",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Sheesh, where do I begin? This game is a logician's wet dream. Sure, it's an exercise in humility, but I feel I can safely say it's also the most compelling puzzle game I have played to date. There is no chaos whatsoever--only increasingly complex order and efficiency. If ever there were a game that captured the passion of engineering, this is it.  The music is deeply inspired and provides a suitable background to your work. The story has some enrapturing quality as well, a smidge of suspense and intrigue enough to give you that extra nudge forward. This may sound insane, but reading the story between puzzles feels physically relieving, as though the stress on your mind is shifted to different regions, much like those atoms are shuffled so smoothly around the reactors, so orderly, clean and calm.  Wait, did I say 'work'? I mean that in the kindest sense possible. You'll understand once you start to 'play'; these words will become interchangeable.  I could see this game used in schools to outstanding effect. It's a masterpiece.",
            "review_score": "1"
        },
        {
            "review_text": "Bought whiteboard just to beat it. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "You will optimize this game to death. Or it will optimize you.",
            "review_score": "1"
        },
        {
            "review_text": "Tired of similar games genres (FPS, RPG and etc.) constantly coming out? You want something challenging and fresh? You play best with your brains and not your mouse and/or skill? You're not fast but very smart? Like insanely hard puzzles?  Then buy this. I'd say this one is the best and the hardest puzzle game I've played in my life.",
            "review_score": "1"
        },
        {
            "review_text": "SpaceChem is a genius game about 'chemistry', although you do not have to know much chemistry to play this game. Players are to design a set of instructions and algorithms for molecules to react and pass through for them to reach their output space. This game is quite challenging, and you will have to search for errors or optimize your algorithm. It is, in a sense, very similar to programming. I have spent hours playing this game because it challenged my mind and kept me thoroughly entertained. This is one of the most creative game I have ever seen and I recommend this game to anyone who enjoys intellectual challenge.",
            "review_score": "1"
        },
        {
            "review_text": "A few points for context. I have a Chemical Engineering training background. I do lots of programming in my job. And I really love puzzle oriented games. In other words, this game should be a perfect fit for me.  For the most part, this game is amazing. They took a very simple premise, and made a puzzle game that can get really complex. Additionally, since it is possible to design your own puzzles, I can easily understand the existence of online contests around this game.  Unfortunately, I think that it is my programming background that shows the flaws in the developement environment. The help screens (and tooltips) are a bit lacking in detail. The cut-n-paste mechanics are a bit too weak. The ability to save components for reuse are also not useful enough. I understand that this is just a game, and not an IDE, but it is a programming game... or perhaps, I am just being too critical.   In summary, I do recommend this game, but it is not perfect.",
            "review_score": "1"
        },
        {
            "review_text": "I thought I was smart. Then I played this game, and now I'm not so sure.",
            "review_score": "1"
        },
        {
            "review_text": "Congratulations! You’re hired as a reaction engineer for SpaceChem Industries, the galaxy’s leading chemical supplier. You’re going to be shipped off to far-flung worlds, harnessing their resources to generate the molecules that our space-faring society requires.   SpaceChem is a game about molecules. No, that’s not right. It’s a game about programming. Well, that isn’t exactly true either. SpaceChem is a game where you will take an impossible-seeming assignment, deconstruct it and build an incredibly complex engine to complete it, one bit at a time. This is a game of puzzles, of organic problem solving, of creativity.  In the most boring terms possible, here’s what you do in SpaceChem. Take input molecules, break them down or combine them, and then output a target molecule. Your “waldos” can manipulate the molecules on the board, but you have limited space to work in. After a few easy introductory levels, timing and layout become incredibly important to your success.  The best thing about this game is how open-ended it is. There is no “correct” way to solve each level. You could solve it with a small number of instruction symbols. Or you could strive to limit the cycle time of your reactor. Either way is valid, but you will hardly ever be able to minimize everything in one single solution. When you finally do conquer a puzzle, you will see your scores compared to the entirety of the playerbase. How did someone solve that level in less than 1000 cycles?! It took me hours to figure out how to solve it in 3000! You could revisit the problem again and try tweaking your reactors (as all of your solutions are saved when you finish them), or you could jump into the next problem right away.  The soundtrack is both familiar, and entirely new. Its’ epic soaring highs and quiet methodical moments are both uplifting and encouraging, but it doesn’t distract from the matters at hand. The visuals are likewise very well thought-out. This feels like an industrial console, and is likewise very simple and it is mostly very easy to grok what is going on. This is critical, as your understanding of how the different objects interact and the sequence they will perform is your only hope of debugging your solution.  SpaceChem is not easy. In fact, it is one of the most difficult games I’ve ever played. I couldn’t even beat the last few levels without looking on youtube for hints on how to set up my reactors. But, it is not punishing. Instead you feel joy whenever a little part of your setup finally starts working, and when you manage to finally get that last piece into place, its like you toppled an empire single-handed.  If you have experience programming, or want to try your hand at it, SpaceChem teaches you the most important skills that you’ll require. Not syntax or coding. But trial-and-error, debugging, and breaking a problem into smaller parts. If you think you can crack some of the toughest puzzles in video games, this is for you.",
            "review_score": "1"
        },
        {
            "review_text": "The best game ever made!  Sort of a programming logic game with a super ominous story. I love how every solution feels completely your own. I love how the leaderboards use histograms. Basically I love everything about this game.",
            "review_score": "1"
        },
        {
            "review_text": "This is an absolutly fantastic puzzle game, probably the hardest puzzle game I have ever played in my life, every time you start a new puzzle it just seems impossible. The satisfaction of finally beating a puzzle and watching your reactors all work seamlessly is the best feeling ever, it feels like a real achievement when you beat each puzzle. I don't know if I will ever be able to finish this game but I already feel I have gotten my money's worth from this game and im only on the 4th world after 8 hours.  Toughest puzzle game ever xD",
            "review_score": "1"
        },
        {
            "review_text": "When i first seen this game i dont really get the point. After 10-15 minutes i fallen in love &lt;3 Defenetly will play more.",
            "review_score": "1"
        },
        {
            "review_text": "Earlier on today I activated the steam version of this, and thought I'd write a review. Alas One needs five minutes of play time registered to play, so didn't I go and boot it up and play about for a bit. This being my first time playing it on steam, didn't I see my friends records for levels, and didn't I go try and beat them. And it's several hours later now. But I certainly don't think they were hours wasted. I didnt' even play that far in this time - just the first two worlds, but really enjoyed optimising my solutions to try match those of people on my friends list.  This is one of my favourite games.",
            "review_score": "1"
        },
        {
            "review_text": "Like programming meets... fake chemistry? Idk",
            "review_score": "1"
        },
        {
            "review_text": "This is probably one of the best puzzle games I've played in my entire life. It is also one of the most difficult games I've played and I suck at it terribly.  Basic premise is to program little robots on a constrained tilegrid (one action per grid) to turn atoms and molecules into different atoms and molecules by combining them, breaking them down and whatnot.  Trust me it's more exciting than it sounds. You build your paths and actions, and see what breaks. You fix that, and see what 5 other things break. Hours later you have this massively elaborate thing, but it works, you made it, and you're proud. It's a satisfaction of your own work that you don't see much in games. It makes you feel like a genius mastermind once you have a puzzle solved and your solution running smoothly, only to have the game throw another curveball at you in the next one.",
            "review_score": "1"
        },
        {
            "review_text": "SpaceChem is an amazing puzzle game, and one that I both love and hate, because it does one thing amazingly well: It makes you feel stupid and pathetic while it also makes you feel smart and clever. I hate that it beats me down with every new challenge, and then immediately makes me feel smart and awesome when I get through it. Nothing is more both satisfying and strangely depressing when you find that so few people used your solution that your don't even have a bar on the graph for your scores.  Do not try this if you want a casual puzzle game. This game doesn't know the meaning of casual.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing and challenging puzzle game. It has one of the best dificulty curves I've seen. Every level increases the challenge greatly but never so much as to discourage the palyer. It egged me on the whole game through. Levels also have good replayability finding the most effective solution, which you can compare with the global score curve. If you enjoy tough as nails puzzles this is THE game to pick.",
            "review_score": "1"
        },
        {
            "review_text": "A great puzzle/programming game for those who enjoy both.",
            "review_score": "1"
        },
        {
            "review_text": "I threw my computer and flipped my table 11/10",
            "review_score": "1"
        },
        {
            "review_text": "Hands down the best puzzle game I have ever played. It has a No True Path To Victory design philosophy I find really appealing. The field is wide open for solutions, making them feel very personal. You use the provided tools to create and break down different chemicals at the atomic level. Your solution's efficiency is graphed against the other players who have completed the puzzle, which is a fun incentive to go back and optimize your solutions. Finally the game will record your solution and upload it to your Youtube account, through a very simple in-game process. Not a necessary feature but a very cool one. With a level editor on the way, and other gameplay expansions this game is absolutely worth the price.",
            "review_score": "1"
        },
        {
            "review_text": "System Requirements:  OS: Windows XP SP3 / Vista / 7  Processor: 2.0 GHz Processor  Memory: 1GB RAM  Hard Disk Space: 300MB  Video Card: frame buffer support recommended  Player: IQ 190 or above.",
            "review_score": "1"
        },
        {
            "review_text": "Challenging puzzler, requires thinking in specific ways.  SpaceChem starts you off very simple to ease you in to the basic way of things, but then quickly ramps things up. That learning curve may leave a lot of folks out in the cold, as I've found you need to learn specific techniques to complete the middle to later levels, and if you don't happen to think them up (or perhaps look them up) you might be left frustrated.  If you enjoy puzzlers and difficulty I heartily recommend SpaceChem. Do come at it knowing that you may get stuck, but once you figure things out (or get a little help, perhaps) the satisfaction of beating a tough puzzle is well worth it.",
            "review_score": "1"
        },
        {
            "review_text": "It's mind bending so far, but rewarding when it all gets working flawlessly.",
            "review_score": "1"
        },
        {
            "review_text": "finally my decision to duo-major in theoretical physics AND boring videogame playing is coming into fruition",
            "review_score": "1"
        },
        {
            "review_text": "This game has little to do with chemistry. It's an automata programming game.  I remembered the first time I see such a game when I was in high school. It's called   Manutactoria   [jayisgames.com] . You are literally programming Turing Machines there. And I think SpaceChem is quite similar: the semantics of and the interactions between the elements are simple, but with these simple elements, you can do infinitely complex jobs.  It's hard, but not all that hard. I completed all the puzzles in the story line except for the optional ones and the final boss fight in a little more than 20 hours. You do need to focus on the most specific things like the placement of the bounders and routing the two waldos through the array of symbols, and some times these problems are solved with ugly ad-hoc tricks, but you definitely should go beyond that level. Once you discovered how to do a recurring task like moving around a cross-shaped array of bounders to assemble or disassemble a methane molecule or arranging several flip-flops to perform a sequence of commands a desired amount of times, the puzzles starts to get easier. You quickly figure out similar structures in the input and output and decide what should go where. Then you adjust your known structures to solve each step and the job is done.  Every time when you see in the statistics that your dashed yellow line is way to the left of the peak of the bar chart, you feel clever.  Those at the right end of the chart are not stupid either. Everyone who progressed to the later part of the game must be clever.  But some people are just more clever than others. The research net is the difficult part. It is organized into volumes and issues, just like real scientific journals. Amusing. But the puzzles there are seriously difficult. Most of the time you stare at the puzzles and think, 'How is that even possible? The author must be insane!'  When you finally solved a difficult problem and see your efficient and elegant (or not so mush so) production pipeline running, see those materials flowing in and products flowing out after some arcane transformation, you start getting fascinated, even though you are the one who built those things. Sometimes I am amazed at how good us humans are at discovering patterns and constructing increasingly complex structures from simpler ones. Maybe that is central to our intelligence.",
            "review_score": "1"
        },
        {
            "review_text": "If you suck at programming but you don't want that label on yourself--you should try this game",
            "review_score": "1"
        },
        {
            "review_text": "It's like molecular programming. This is one of the most thoughtful puzzle games I've ever played. A relaxing soundtrack, streamlined interface and the ability to play windowed are just icing on the cake. Compete with the community for space or speed efficiency with your builds.  The game is difficult to explain. Essentially you are tasked with building reactors that combine atoms from the periodic chart into molecules that are shipped away. You have various tools at your disposal to combine, split and fuse atoms and molecules. The solutions vary greatly from task to task and the difficulty ramps up quickly.",
            "review_score": "1"
        },
        {
            "review_text": "Devious, Inteliigent. No game has ever recreated the rollercoaster of feelings after beating a puzzle as this game.  'This is impossible', 'Aha, i see it now, its all so simple', 'I AM A GOD OF GAMING' 'On to the next level, Wait, this is impossible.'",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing. Challenging, yet rewarding. I love it. Great job to the developers.",
            "review_score": "1"
        },
        {
            "review_text": "In spacechem you don't look for the sollution to a puzzle, you design one. And it will keep you coming back to improve on your earlier designs.",
            "review_score": "1"
        },
        {
            "review_text": "Most satisfying puzzle game out there. The only bad thing about this game is it looks intimidating for beginners. Once you solve a few puzzles however you realise the true genius behind this game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is AWESOME. It will totally destroy your brain, but the feeling of accomplishment that this game provides when you beat a level is amazing. So much fun.",
            "review_score": "1"
        },
        {
            "review_text": "A lesser-known jem of a game, and one of the hardest (and unique) puzzle games I have ever known. Plus: Science!  My Brain still hurts every time I launch this up. It is truly a masterpiece.",
            "review_score": "1"
        },
        {
            "review_text": "An epic space adventure pitting modern chemical synthesis against anomalies and ancient gods. Brain-breakingly difficult at certain points, but it has an incredibly well-organized learning curve; every challenge is  one  step ahead of the player. The game pushes you to become skilled at molecular bonding with a real sense of urgency in its missions. Recommended for scientists, engineers, science geeks, and anyone who ever wanted to fight giant squids, spiders and pyramids with xenon beams.",
            "review_score": "1"
        },
        {
            "review_text": "If you are even the slightest bit interested in puzzles and logical thinking, you absolutely MUST try this awesome little game. Some of the puzzles will make your brain hurt at first, but when you solve them, you will feel like a total engineering badass.",
            "review_score": "1"
        },
        {
            "review_text": "I don't like puzzle games in general because they're either too easy, or are pure pixel hunt, or involve 'guessing what the developer wants you to do.' But this game is different. This game feels like real world design challenges. This game feels like a combination of programming, proving geometric statements and (just a little bit, despite of its name) chemistry.   This game's logic works like this: you have two loops running at the same time, each can carry out certain commands in their courses; your task is to time those commands so that they do the right thing at the right time, and in the end find a way to synchronize the two loops so that they can loop back to their oriignal starting point and the whole process resets. You have limited space to place your commands so you have to really think hard where you place them (like the steric hinderance effect in real world chemistry synthesis).   Overall, a really, really fun, thought-provoking game.",
            "review_score": "1"
        },
        {
            "review_text": "A genuinely brilliant puzzle game, with a darkly funny plot, the occasional completely insane 'boss' puzzle, and a slick interface. The underlying gameplay involves building automated systems to construct/deconstruct/reconstruct molecules from the constituent atoms, though no real understanding of chemistry is required. The game does an excellent job of teaching you the basics, then throwing an escalating series of complicating additional factors and new capabilities at you.   It has a large number of 'meta puzzles' in which you must link together individual reactors (each of which you design) to perform some larger and more complex task. It's very challenging, but in a rewarding way. There are no cheap tricks here, it's just a matter of thinking through what has to be done and how best to do it.   The developers have supported this title to an extraordinary degree. It contains quite a bit of bonus content with more turning up all the time, and also supports user created puzzles.",
            "review_score": "1"
        },
        {
            "review_text": "'Trainyard' (on iOS devices) meets computer programming meets chemistry. Way more cooler than it sounds. Tough but rewarding puzzler.",
            "review_score": "1"
        },
        {
            "review_text": "Easily the most satisfying puzzle game I've ever played.",
            "review_score": "1"
        },
        {
            "review_text": "Really intense stuff, pushes you to think about make your brain more flexible.. You'll find yoruself spending long hours on this trying to get the perfect system.",
            "review_score": "1"
        },
        {
            "review_text": "This is chemistry in a game. I didn't expect to see that this game will be amusing at all, but it actually is! I find it quite interesting and hard at the same time. The goal is to make different bonds of atoms. Quite simple in words...but quite hard in the game...  My rating: 8/10",
            "review_score": "1"
        },
        {
            "review_text": "I have played SpaceChem for 7 hours now and I am totally hooked. The puzzles are very intelligent (and sometimes very hard) but you get a real sense om accomplishment when you finally figure it out. The puzzles have amazing depth and it seems that you continously learn new tricks. I am a programmer in real life and SpaceChem will teach you skill applicable in the field. Highly recommended. Give it a try!",
            "review_score": "1"
        },
        {
            "review_text": "I am playing SpaceChem and I have got to say, I most definitely recommend it. I will admit I am not very far in to the game, I also have to say that SpaceChem is really as boring as dirt, I doubt it will keep my attention long, and I am easily entertained! So why then you ask am I so willing to recommend it? Pure and simply because of its difficulty of course! Not often will you find a puzzle game that is so 'simple' yet so hard, I think alot of it comes from them giving you so many different ways to complete each puzzle. You dont actually have to know chemistry to play this game. I think this is because the game is more pseudo chemistry really, so dont be afraid to try it.  Overall I have got to say, SpaceChem is a 'Simple Hard' puzzle game, that I would recommend to anyone who is a fan of puzzle games. It really does take a special kind of person to enjoy this game, and not get bored almost immediately though. So be warned, if your not good at, or not interested in puzzle games, this is a game you may want to stay away from. To everyone else though, go take a look, you may be surprised.",
            "review_score": "1"
        },
        {
            "review_text": "Are you chem?  Cool puzleish game. You are given some inputs materials and you have to produce some other output materials with the tools given.",
            "review_score": "1"
        },
        {
            "review_text": "This is a game. It is good. It is a good game.",
            "review_score": "1"
        },
        {
            "review_text": "Spacechem... Oh, Spacechem.. Where to start!?  Tax your grey matter to it's limit!  Do you hear the words 'Puzzle game' and get a general feeling of dis-interest? Do you think about chemistry and then immediately stop thinking about chemistry? Fear not! Spacechem is one of THE MOST unique puzzle experiences you will EVER have! Don't be afraid of it's chemistry topic, either - For while the compounds you'll be breaking down and assembling are real, with appropriate atomic bonds, you don't need to understand a lick of chemistry to play.  The puzzles involve you designing the interior of atomic reactors, using robotic manipulators called 'Waldos' that move on paths you specify and obey commands you place on those paths to grab, rotate, bond &amp; de-bond atoms and a host of other actions to transform raw input compounds - one molecule at a time - into the matter you need.  The game is free of bugs and has high production values. There are enough levels to keep you working for a LONG time, split into different chapters taking place on different planets with the beginning of each chapter introducing a new reactor [game] mechanic. The levels get devilishly difficult and due to it's nature, there are almost infinite ways to solve any puzzle. As long as you output the correct compunds to the waiting shipping barge, exactly the steps you take to create that compound are entirely up to you!  This game will tax your problem-solving, logic and lateral-thinking. Highly recommended for those with an above-average IQ and highly recommended for anyone who wants to sink their teeth into a real mental challenge.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of those puzzle games that you really just have to LOVE puzzles to play. Do I recommend it to those who fit that? Yes. Do I recommend it to those who don't really enjoy puzzles? Not so much. It's definitely an interesting game, though. How it works... just what it is in general. I personally enjoy it but find it really hard.",
            "review_score": "1"
        },
        {
            "review_text": "If you are into engineering/math/programming or simply into complex puzzles then SpaceChem is for you.   The campaign provides a nice difficulty curve. You will probably finish the first couple of levels in a few minutes each but as new concepts are introduced it get's increasingly complex and you'll really have to strain your brain and spend hours on a single level. If you're stuck, try your hands on some user generated levels. SpaceChem has A LOT of content, easily hundreds of hours.",
            "review_score": "1"
        },
        {
            "review_text": "trying to trick me into learning chemistry",
            "review_score": "1"
        },
        {
            "review_text": "BUTT GOOD GAME (NOT)",
            "review_score": "1"
        },
        {
            "review_text": "Programming meets puzzle games meets fake chemistry. It is hard but fair and I have nothing but love for the game.  Если взять основы программирования, скрестить их с паззлами и смазать все сверху упрощенной химией, получится эта игра. Составление алгоритмов решения — довольно сложная, но жутко удовлетворяющая и интересная задача.",
            "review_score": "1"
        },
        {
            "review_text": "Spacechem is a fun and unique puzzle game. But I believe it can appeal only to those who love chemistry or complex problem solving. The fascinating thing about this game is that there's usually not one, but hundreds or thousands of different solutions to each puzzle. Surprisingly, the game has an epic soundtrack and contains lots of funny jokes.",
            "review_score": "1"
        },
        {
            "review_text": "This is an interesting game from a certain point of view. I enjoyed playing it, does have a special graphic and game mechanics, the overall sound is okay. Keeps you entertained and wishing for more.",
            "review_score": "1"
        },
        {
            "review_text": "Very good puzzle game or rather problem solving game. Warning: some of the later puzzles can take multiple hours to complete. It does feel incredibly rewarding though. I recommend it to those that want to unleash the engineer inside them.",
            "review_score": "1"
        },
        {
            "review_text": "a game where you can be a chemist....or....A CEO!",
            "review_score": "1"
        },
        {
            "review_text": "IT DED GOOD. TICKET GET!",
            "review_score": "1"
        },
        {
            "review_text": "chemclick together to makemolcecule create create create ionize isomerize decalcify emerge vistorious",
            "review_score": "1"
        },
        {
            "review_text": "Programming meets chemistry meets space exploration meets giant alien battles. There is literally nothing to not love about this game.",
            "review_score": "1"
        },
        {
            "review_text": "this game makes me feel as stupid as i probably am.",
            "review_score": "1"
        },
        {
            "review_text": "wow this game is amazing and its superhard whoever likes chemistry they should buy it",
            "review_score": "1"
        },
        {
            "review_text": "This is perhaps the hardest game I have ever played. The complexity of the puzzles is not tedious, however. It is addictive, and anyone with an interest in programming or engineering will love this. There is some chemistry, but you need no prior knowledge to play. There is a quick learning curve, followed by challenges that become almost exponentially harder as the game progresses.  It won't appeal to all, but I certainly rate it 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Though daunting to look at, SpaceChem introduces elements slowly and doesn't drop the challenge on you until you've proven yourself capable. This is without question the most rage-inducing yet ultimately satisfying puzzler I've ever played and if you're remotely tempted, you have no reason not to try the generous demo.",
            "review_score": "1"
        },
        {
            "review_text": "This game is evil. It's the kind of evil that parents think lurks around every corner at night, when your child is alone. But, imagine this evil also being a guy giving out free candy. (A really nice person!). That's this game. It's so hard you will ragequit and go to bed, but when you finally get that 'Eureka' moment, and beat the level you've been stuck on for over 3 hours, it feels like you're in heaven!  I can only reccomend this game! Get it if you can stand the frustrations it brings.",
            "review_score": "1"
        },
        {
            "review_text": "Though daunting to look at, SpaceChem introduces elements slowly and doesn't drop the challenge on you until you've proven yourself capable. This is without question the most rage-inducing yet ultimately satisfying puzzler I've ever played and if you're remotely tempted, you have no reason not to try the generous demo.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome logic game.",
            "review_score": "1"
        },
        {
            "review_text": "If you like puzzle / thinking games, give this one a try. It may appear easy at first but later on it's quite challenging and rewards you with a really good feeling when you finally found a solution. If you want to get your own impression first, there is a demo version :)  PS: If you like this kind of games, look for the other Zachtronics games (e. g. Codex of Alchemical Engineering and Infinifactory) they are quite good as well.",
            "review_score": "1"
        },
        {
            "review_text": "my idiot brain cant handle this game but maybe yours can",
            "review_score": "1"
        },
        {
            "review_text": "Learn something about Engineering while having fun. Best puzzel game I have played that involved science! I cant belive I didnt see this back in 2011",
            "review_score": "1"
        },
        {
            "review_text": "Insanely hard logic game. I never expected this.",
            "review_score": "1"
        },
        {
            "review_text": "10/10   stopped my chronic masturbation.",
            "review_score": "1"
        },
        {
            "review_text": "The chemistry is fake but the fun is real!",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would stare blankly wondering wtf they did wrong again (rate: 9/10)",
            "review_score": "1"
        },
        {
            "review_text": "If you like chemicals, this is the game",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would spend 10 hours sciencing agian",
            "review_score": "1"
        },
        {
            "review_text": "Atoms comes in, molecules comes out. CAN'T EXPLAIN THAT",
            "review_score": "1"
        },
        {
            "review_text": "one of the best games i've ever played",
            "review_score": "1"
        },
        {
            "review_text": "This is an excellent puzzle game that is quite challanging, but very rewarding when you complete a puzzle.  The game draws most of concepts from chemistry and some basic knowledge on the subject might be useful, no actual chemistry knowledge is required in beating the game (and some of the chemistry ideas don't apply to actual chemistry e.g. no difference between covalent and ionic bonds). You would benefit more from some programming and general procedural thinking skills.  The game centers around designing reactors to make something from some inputs, by moving it around, bonding, debonding, fusion and fission. It can become quite complicated, especially with production assignments in which you need to use multiple reactors. There is also quite a bit of planning involved (on paper even), especially with fission and fusion challanges and when you want to optimise your solutions, and it is really cool when it all works and you make it work faster or with fewer symbols than your friends  If you're not sure about buying the game I would highly recommend playing the demo, which has quite a lot of content.",
            "review_score": "1"
        },
        {
            "review_text": "Easily the best puzzle game of the last year. It's really fun and it makes you feel very smart when you come up with a solution. The gameplay mechanics and interface keep you from getting frustrated. Don't be misled -- no chemistry knowledge is needed.",
            "review_score": "1"
        },
        {
            "review_text": "This is a very good programming puzzle game. Also, it's by the Infiniminer guy, so you can help offset that Minecraft purchase you're regretting by buying it! (Donate to Dorf Fort too)",
            "review_score": "1"
        },
        {
            "review_text": "Mind-bending. Infuriating. Difficult. All in the best possible sense.",
            "review_score": "1"
        },
        {
            "review_text": "This game is also available for Android, and I like it there. A very original and brain-blowing puzzle experience. Yes, to complete the level with the results that are better than average you need to think. A lot!  They also seem to have some community-made puzzles. Well, if you are ready for some really difficult and complex puzzles, this game might fit you quite well. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "This is a game for nerds. I am a nerd.  I am not sure if I like this game, whenever I complete a level I feel this overwhelming insecurity that this might have been the last one that I would be able to complete and that I might be stupid.  I then spend way too much time on the next level and as I complete it the cycle continues.  I will steal a quote from somebody elses review 'This is a game for when you are feeling smart and want to be proven otherwise'.  I am now gonna finish this review, I have a reactor to design...",
            "review_score": "1"
        },
        {
            "review_text": "Do you like science? How about mechanics? Spacechem bonds these two together to create a puzzler that it a class of its own! The tutorials ease you into constructing (and deconstructing/reassembling) all manner of molecules, and the story drives you the rest of the way. Be warned though - although there is many solutions to each puzzle, each of them is a real challange.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome puzzle game. Program your reactors to transform source elements and molecules into the chemicals you need. Each time you solve a puzzle you can see how efficient other players' solutions were which gives an incentive to optimise your own approach. The storyline is presented static written chapters which get unlocked as you solve the puzzles. It is strictly linear and actually not necessary for the game but at least it's well written. All in all I recommend the game for everybody who enjoys racking their brains and meddling with automated processes.",
            "review_score": "1"
        },
        {
            "review_text": "Overall: Good to Very good  Likes: - kind of like programming - open-ended puzzles where the focus is on engineering the solutions - challenging - for additional challenge, you can optimize your solutions to minimize the number of cycles, symbols, or reactors  Dislikes: - the multi-stage puzzles require a lot of time and work to solve, even when you see the solution. I felt that the short puzzles with small, achievable goals were more fun and accessible. - campaign puzzles are progress-locked",
            "review_score": "1"
        },
        {
            "review_text": "Very challenging puzzle game, keeps you thinking.",
            "review_score": "1"
        },
        {
            "review_text": "A pretty difficult science based puzzle game. It might take a while to beat a single puzzle but man do you feel accomplished when you beat some of the later difficult ones. Be warned, this game is pretty hard. You're doing chemistry for christ sake.  8.0/10.0",
            "review_score": "1"
        },
        {
            "review_text": "If you like puzzle games, and aren't afraid of a challenge, this is a must have.",
            "review_score": "1"
        },
        {
            "review_text": "This game is magic.",
            "review_score": "1"
        },
        {
            "review_text": "For those really wanting a challenge. This game will give you progressingly harder problems",
            "review_score": "1"
        },
        {
            "review_text": "Fun, and it's very satisfying when you get a puzzle working, but it makes me realize that I'm probably not cut out to be a programmer.",
            "review_score": "1"
        },
        {
            "review_text": "An incredibly complex puzzle game that involves elements of programming. With limitless solutions to each puzzle, competition to develop the most efficient system is a fun way to keep the challenge going.",
            "review_score": "1"
        },
        {
            "review_text": "At first, it's a neat little puzzle game where you have to move the atoms into the right spots and bond them to win. Then they start asking you to bond more atoms together, and that gets a little hairy. Then they tell you abolut pipelines and your brain melts. Then they start talking about fission and quantum tunneling and maybe you should just buy this game already, genius.",
            "review_score": "1"
        },
        {
            "review_text": "Easily the best puzzle game ever, this charming piece of a thinking man's entertainment has also managed to take a spot among my favourite games of all time.  SpaceChem doesn't actually have much to do with chemistry, but it has everything to do with programming. The puzzles effectively boil down to designing programs in a language reminiscent of Befunge, and unlike with many puzzle games, there's no feeling at all that you're trying to reproduce the game designer's contrived train of thought. Solutions always feel like a work of your own, and more often than not different people come up with vastly different solutions to the same problem. This alone makes the game extremely rewarding - but there's also a ton of potential for optimizing your solutions; or simply coming up with ones that seem particularly elegant.  Add to that a charming soundtrack, extremely competent writing and well over 40 hours of content even without DLC, and this becomes an undisputable must-buy.",
            "review_score": "1"
        },
        {
            "review_text": "Very different, but causes you to think..which is something more people need to do more often : )",
            "review_score": "1"
        },
        {
            "review_text": "This game is made of glory. That's all I can say.",
            "review_score": "1"
        },
        {
            "review_text": "Such an addictive puzzler that I found a solution to one in my dreams.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing puzzle game! Don't let the cartoony look fool you - this is chemistry at it's finest!",
            "review_score": "1"
        },
        {
            "review_text": "This is an extremely good puzzle game where you have to design reactors to synthesize chemicals. It's overwhelming at first as you are given seemingly free reign, only limited to mechanic constraints (and your imagination), to solve a puzzle as there are numerous ways to come up with a solution. You issue commands in the reactor; the grabby-things (waldos) pick molecules up, combine, rotate and successfully (or not) send to the factory. The beauty comes from being able to come up a solution of your own which is elegant in your own way. It may not be the 'best' solution, but you'll be proud of yourself watching those waldos whizz around in a loop. The game progressively adds a challenge- it forces you to think in a new ways, often making you think about past solutions that you could improve on. It's a game that focuses on planning; you really need to stop and think about what you are trying to do. It may not be for everyone but it's as about as 'manly' puzzle games get these days.",
            "review_score": "1"
        },
        {
            "review_text": "Hardcore game! Becareful this is not an easy game or a fun game... it's mostly like a second job. You must build a complexe molecule based on a 2 threads systems with basic instruction like Bond+, Bond-, Grab, Drop, Sync, In, Out. The 2 tutorials are bad and show only the basic. From that, starting is hard but this could turn to be fun after you have learned how this work. Great puzzle game.",
            "review_score": "1"
        },
        {
            "review_text": "Good Job. 10/10 overall",
            "review_score": "1"
        },
        {
            "review_text": "So.  I like chemistry and puzzle games. And  SPAAAAACE. This game is a brilliant combination of these elements (pun intended), and I really should get round to finishing it. AND SO SHOULD YOU.",
            "review_score": "1"
        },
        {
            "review_text": "A challenging puzzle strategy. Can be confusing, but gets more fun the farther you get.",
            "review_score": "1"
        },
        {
            "review_text": "Really fantastic puzzle game, its very tough which is good for games these days, the tutorial is very indepth and it gets across the message. Very simple but at the same time complex game.  If you want you can check out my gameplay video of this game on my channel or below         YouTube™ Video:  Space chem Game play&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Do you ever wish you could spend your entire day debugging programs but don't want to learn a programming language/do actual work? Then this is the game for you!",
            "review_score": "1"
        },
        {
            "review_text": "Unique and fun puzzle game, which gets fiendishly difficult.",
            "review_score": "1"
        },
        {
            "review_text": "for problem solvers and puzzle lovers, this game is instant addiction. if you like periodic tables, this is for you. if you like complex circuitry, this is for you. if you like timing and optimisation problems, this is for you. throw in online leaderboards, youtube integration, and puzzle creation; you can say goodbye to all other responsibilities. you must get and play, for science!",
            "review_score": "1"
        },
        {
            "review_text": "A fun game if you're OCD and like puzzles. Trying to figure out how to optimize your production line to make the finished product either in less turns, or in less moves and getting feedback for how you rank compared to other puzzle solvers.  Plenty of puzzles, no 'right' way to do things, I highly recommend it if you're logically inclined and enjoy thinking puzzles.  If you like action, can't stand to keep tripping up and don't like offbeat dark humor? Move on.",
            "review_score": "1"
        },
        {
            "review_text": "It's chemicals IN SPAAAAAAAAAACE",
            "review_score": "1"
        },
        {
            "review_text": "chem is love, chem is lyfe",
            "review_score": "1"
        },
        {
            "review_text": "not for the weakminded",
            "review_score": "1"
        },
        {
            "review_text": "It's a surprisingly fun puzzle game and is rather difficult too. Take that with a grain of salt though, as I only have one brain cell. Oh, and there are three achievements that give you the SpaceChem items in TF2.",
            "review_score": "1"
        },
        {
            "review_text": "Solid puzzle game. Infected my brain.",
            "review_score": "1"
        },
        {
            "review_text": "A challenging puzzler that'll keep you up all night!",
            "review_score": "1"
        },
        {
            "review_text": "an extremely difficult (I don't say that lightly) puzzle game that will keep you experimenting for hours, but in the good way. The puzzles remind me a bit of redstone in minecraft, but to a much higher degree of difficulty. Solving a puzzle in this game makes you feel smart, and that's what I like about it. WARNING!: actual chemistry is involved.",
            "review_score": "1"
        },
        {
            "review_text": "Spacechem is a construction game, where you attempt to create a contraption (with very limited space) that converts one set of input atoms/molecules into a set of output atoms/molecules.  It's a very good variation on the 'assembly line' game. I think this is the best game so far from Zachtronic Industries. It's a pretty large, challenging, logic/process bending, thoughtful game. And it's got cool music, too. And an interesting plot. And cool charts so you can see how well you did compared with the rest of the world.  Get it, play it, agonize over it's puzzles.",
            "review_score": "1"
        },
        {
            "review_text": "The toughest and most satisfying puzzle game I've ever played. Not for the faint of heart (or brain).",
            "review_score": "1"
        },
        {
            "review_text": "Spacechem is difficult and wonderful. The game is intelligent and requires quite a bit of thought but it makes it better puzzler. There are two puzzles in the game: molecule formation where you must take an input, route it around the playing field, and produce an input; and a smaller factory-routing puzzle that also provides a larger context, along with the brief backstory spinnets, as to why you're making molecules in the first place.",
            "review_score": "1"
        },
        {
            "review_text": "A challenging brain teaser with programming roots!",
            "review_score": "1"
        },
        {
            "review_text": "'From the creator of The Codex of Alchemical Engineering' - 'nuff said",
            "review_score": "1"
        },
        {
            "review_text": "A very nice puzzle game to keep you thinking even after you stop playing. Difficulty scales up quite nicely if you're up to the challenge and have the patience.",
            "review_score": "1"
        },
        {
            "review_text": "This is simply the best puzzle game I have ever played. No chemistry knowledge required, but it is the type of game that you will walk away from, only to come back days later and beat a stage. DAT FEEL.",
            "review_score": "1"
        },
        {
            "review_text": "A fun and rather addicting game where you create molecules by bonding together particles (duh....). You guide little waldos (you'll find out) around a small stage and pick up drop and bond particles. The story keeps you going on with the game and adds more depth to the game. This is the true defenition of fake chemistry. [7/10]",
            "review_score": "1"
        },
        {
            "review_text": "Who doesn't like a game with the name 'Space' in it?   This game had me in orbit just thanks to the puzzle type, but i never expected it to be astronomical. And sure, all puzzle games can make you react like a luna-tik more or less, but here i didn't even feel like i spaced out at all. It just kinda forms a great atmosphere.   So overall, crank up your Nep-tunes, get a cup of Starbucks and take out your sandwich from your launchbox, cause you got some puzzeling to do! After all, the best way to solve a puzzle is to planet.  Overall Rating: 8/10",
            "review_score": "1"
        },
        {
            "review_text": "I did it for the fishcakes",
            "review_score": "1"
        },
        {
            "review_text": "This lets you build machines that create awesomeness.",
            "review_score": "1"
        },
        {
            "review_text": "What initially appears to be a chemistry-related puzzle game reveals itself to be (multithreaded!) programming with limited hardware and a suspiciously Lovecraftian story. Difficulty is high, but in a scrupulously fair way.",
            "review_score": "1"
        },
        {
            "review_text": "Seriously difficult, but ultimately satisfying. Great game if you love puzzles or chemistry.",
            "review_score": "1"
        },
        {
            "review_text": "Don't start playing this game unless you want it to be way past bedtime before you know it.  It makes your head heart and then, when you figure things out, you feel super-awesome-smartness. (Until you see people on the leaderboards did it way better.)",
            "review_score": "1"
        },
        {
            "review_text": "Took a little to get used to but once you start to get it, it is totally fun. I almost feel smarter after playing this but still not learning anything new about chemestry or space...yet. Fantastic game I know there is so much more to come but the way I am going I feel so acheived after each level",
            "review_score": "1"
        },
        {
            "review_text": "The Dark Souls of puzzle games. ",
            "review_score": "1"
        },
        {
            "review_text": "quite fun game, but so hard to.understand at first sight and still after a fêw hours",
            "review_score": "1"
        },
        {
            "review_text": "You love science and computer game?Problem solve.",
            "review_score": "1"
        },
        {
            "review_text": "This game is the most challenging (single player) game I've ever played, probably. It's great.",
            "review_score": "1"
        },
        {
            "review_text": "If you like your puzzle games challenging, Spacechem is a towering acheivement. Its gameplay and level design are elegant in a way that solutions feel like personal creations. Its graphics and sound are clean and undistracting. Its storyline's superfluous but entertaining nevertheless. The basic game is quite long, and this length, along with the wonderful replay value in optimizing each level's stats makes the game a $/hr bargain.  As the creator has bemoaned in interviews, the name SpaceChem scares away potential players who believe that the game is chemistry based. However, a chemistry background is about as useful as a degree in ornithology for Angry Birds. What  will  help is programming experience, since the atomic manipulation is a veneer for a deep sequential instruction 'programming language.' In fact, this game would be a fun tool to indirectly introduce computer programming to kids. Well, super smart kids, since the game is  hard .  Last, and for some, least, there's an unheralded 'multiplayer' component in outdoing your Steam friends on each level. Some of the most fun I've had with the game has been the playful trashtalking earned by one-upping my pal's best scores just to see him retaliate with an even better solution. This back and forth improvment closely mimics the most satisfying part of the engineering process, and once again, is a testament to the fundamental elegance of the game's design.",
            "review_score": "1"
        },
        {
            "review_text": "This game is for you chemists out there. Here you can solve and create puzzles involving synthesising compounds from elements and the puzzles can get very very loopy. If you want something to work your brain on, then this is for you.",
            "review_score": "1"
        },
        {
            "review_text": "From what I played, I enjoyed it.  However, the game doesnt even launch anymore and I cant find a fix.   Broken/10",
            "review_score": "1"
        },
        {
            "review_text": "One of the greatest indie titles out there. Pick this one up if you're fed up with all the unimaginative titles that don't stretch your critical thinking skills.",
            "review_score": "1"
        },
        {
            "review_text": "I like it. I'm usually not all that big on puzzle games but never before has such an educational game caught my attention like this.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best puzzle games I've played.",
            "review_score": "1"
        },
        {
            "review_text": "DO YOU LIKE COMPUTER PROGRAMS AND MAKING ♥♥♥♥ WORK? THEN THIS IS THE SCIENCE GAME FOR YOU.  SET INSTRUCTIONS DOWN BOND THINGS TOGETHER DO SCIENCE MAKE CHEMICALS  ALL IN SPACE",
            "review_score": "1"
        },
        {
            "review_text": "A quite interesting game. The focus is designing automated systems that take a given input to produce particular outputs.",
            "review_score": "1"
        },
        {
            "review_text": "A rather unique logic game with a fun, comic book flavor.",
            "review_score": "1"
        },
        {
            "review_text": "you should buy this game if you regularly feel too intelligent",
            "review_score": "1"
        },
        {
            "review_text": "A brilliant puzzle game that gives you the freedom to come up with your own unique solutions.   Very challenging, but extremely rewarding when you finally solve a difficult level. No other game will make you feel this smart.",
            "review_score": "1"
        },
        {
            "review_text": "SpaceChem isn't a game so much as a program for converting your skull into a skull-shaped bowl for tapioca pudding. Vaguely akin to debugging badly written code, graphically represented, without the advantage of logs or tools or a paycheque. But fun...and more addictive. When things come together elegantly it is glorious, when they don't the urge to punch a baby is strong. At almost 50 hours in I still can't say if I like it, but I can say with certainty that I've never played anything else like it. Probably for good reason, but you should give it a try anyway.",
            "review_score": "1"
        },
        {
            "review_text": "A little daunting at first, but it quickly develops into one of the best puzzlers of the generation.",
            "review_score": "1"
        },
        {
            "review_text": "Actually a new and unique puzzle game with a simple interface and complex results.",
            "review_score": "1"
        },
        {
            "review_text": "This puzzle game doesn't force you to think like the developer. There isn't a single right answer and the game encourages you to improve your solutions.",
            "review_score": "1"
        },
        {
            "review_text": "Got this for a dollar in the steam black Friday sale. It is by far the best 1 dollar I ever spent. Total Biscuit was doing a whole, 'best games for under a dollar on steam' video and when I saw this game, having been a chemical engineer major in college, I had to get it. While it may use fake chemistry, it does in fact feel a little like solving organic chemistry problems mixed with electrical circuits and a bit of programming/logic type puzzling. The game follows a very specific model, as it slowly introduces you to each new element, you start to get used to them and are challenged with the ever increasing difficulty. Even for the scientifically minded this game can be quite difficult and rewarding. Pick it up if logic/puzzling interests you and if it sounds even mildly interesting then you can check out the extensive and content rich tutorial. (not that a dollar or two would break the bank)",
            "review_score": "1"
        },
        {
            "review_text": "Good Job. 10/10 overall",
            "review_score": "1"
        },
        {
            "review_text": "If you like challenging puzzles it's a great game. If you get frustrated easily... maybe not.",
            "review_score": "1"
        },
        {
            "review_text": "SpaceChem is a great puzzle game, and one of the rare games that makes a game out of the same kind of thinking that I use for programming, and it ends up being a lot of fun.",
            "review_score": "1"
        },
        {
            "review_text": "Wonderfully excellent puzzler. Requires helluvalotta thinking!",
            "review_score": "1"
        },
        {
            "review_text": "Fascinating pathfinding puzzle based (if loosely) on real chemistry. Clean design, no button mashing, and not timed; all distinct pluses. Only real issue with it is that progression is linear, so if you get stuck on a single puzzle, you are *stuck* until you figure it out.",
            "review_score": "1"
        },
        {
            "review_text": "This puzzle game doesn't force you to think like the developer. There isn't a single right answer and the game encourages you to improve your solutions.",
            "review_score": "1"
        },
        {
            "review_text": "Combining my love of puzzles and Chemistry is always a great idea, and it's been done excellently here. The game is excellently paced so you get new content every time you think you've mastered the game and surprisingly the story is equally as gripping (also banterous), which is uncommon in a puzzle game. I'd strongly recommend this as a game that you can keep coming back to for quite some time.",
            "review_score": "1"
        },
        {
            "review_text": "Great puzzle game, which ramps up the difficulty pretty fast - challenging.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome Game! Good puzzler introducing chemical compounds, even if they aren't the proper method of chemical synthesis for said compounds...",
            "review_score": "1"
        },
        {
            "review_text": "this is not for everyone, this game is mean, it doesnt want to be everyones friend. but if its your friend its ever so occupying. it will tell you you are clever and you'll know its telling the truth, because you earned it... unless you went and got a solution on youtube and ruined the game.  Be a dear and play the demo, the game might not like you, but you'll respect it.",
            "review_score": "1"
        },
        {
            "review_text": "Hardcore game! Becareful this is not an easy game or a fun game... it's mostly like a second job. You must build a complexe molecule based on a 2 threads systems with basic instruction like Bond+, Bond-, Grab, Drop, Sync, In, Out. The 2 tutorials are bad and show only the basic. From that, starting is hard but this could turn to be fun after you have learned how this work. Great puzzle game.",
            "review_score": "1"
        },
        {
            "review_text": "Great logical games, one of my all time favourites.",
            "review_score": "1"
        },
        {
            "review_text": "If you are a programmer, SpaceChem will sit in the part of your brain that likes solving little puzzles and lay happiness eggs there.",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite puzzle games.",
            "review_score": "1"
        },
        {
            "review_text": "'rayescapes assured' Stamp of Approval.",
            "review_score": "1"
        },
        {
            "review_text": "While it might not be for everyone and can at times make you feel inadequate in the brain department, this is an amazingly clever and unique take on the puzzler genre that anyone with a shred of interest should at least give a try. There is a demo available that should not just give you a good idea about the game, but keep you entertained and busy for quite a long time as well and in case you decide to buy the full game, you don't have to replay anything either and can seamlessly continue with the next missions. I haven't been surprised and fascinated by a game like this in quite a while. Very refreshing.",
            "review_score": "1"
        },
        {
            "review_text": "hard but fun",
            "review_score": "1"
        },
        {
            "review_text": "This is the best puzzle game that has ever been created.",
            "review_score": "1"
        },
        {
            "review_text": "This is the only game where you can make C20H25N3O!!! ^.^",
            "review_score": "1"
        },
        {
            "review_text": "What a damn fine game.",
            "review_score": "1"
        },
        {
            "review_text": "If you're an engineer or programmer, you'll probably find this game fun! Finishing a tough puzzle in this game is pretty darn rewarding.",
            "review_score": "1"
        },
        {
            "review_text": "If you like challenging puzzles it's a great game. If you get frustrated easily... maybe not.",
            "review_score": "1"
        },
        {
            "review_text": "At first I thought this would be a casual puzzle game, but it turns out to be a quite challenging 'design based' puzzle game. Build 'machines' to build or break down molecules. If you like chemistry, programming machines and challenging puzzles you should definitely give this game a try. At least download the demo!",
            "review_score": "1"
        },
        {
            "review_text": "You know that feeling in school when there's something you just absolutely do not know what to do on a certain problem, but then all of a sudden there's that 'Ah ha!' moment? That's basically every single in this game. Wonderful game!",
            "review_score": "1"
        },
        {
            "review_text": "The best puzzle game I've ever played? You betcha!  SpaceChem is joyous, it really truely is!  I love absolutely everything about this game, I love the music, I love the simplistic graphics, I love how smart it makes me feel when I figure it out, I love the critical thinking, I love the easter eggs, I love the user made content and I love the replayability of it.  This is a game that looks very intimidating and I think that may have hurt it, but trust me, it is very accomidating for beginners. First of all, you really don't need to know anything about chemistry, chemical elements is just the medium it used in order to keep the game flowing and to base the story line along something. I can't help but wonder if they had used shapes and colours like a pop cap game then maybe it would have looked a little less scarey. But even if you've never so much as glanced at a periodic table there is no real disadvantage. However, on the other hand, it really gives you this wonderful 'mad scientist' feeling especially during the special stages where you may have to blow up a storage tank.  The difficulty is very high and even after playing for 20 hours I am still no where near finsished with it, I really do intend to finish it though one day and I can't wait to see it through and what insane challenges it will throw at me towards the end! The difficulty is high but it's never unfairly so. The game really does carefully ease you in and will give you smaller proof of concept experiments before throwing you into a big mission where you need to put everything you've learned together. This is where the replayability comes in, as you learn more you can go back to previous experiments and optimise them. You see, unlike a lot of puzzle games, there are many many many solutions to each puzzle, and you could spend months tweaking and speeding up previous solutions. At the end of each level it shows you how everyone else solved the puzzle so you can see how you did. There really is a strange sense though that often your particular solution is completely unique to everyone else!  The music, the music is absolutely fantastic! It really has all the feelings of the story rolled into it, theres a hint of paranoia, a touch of sadness, melancoly studying and reasearching music and a large section of triaumphant music as well. The music is on the standard of a movies orchestral score and its soundtrack is saved on my harddrive (thanks humble bundle!) and finds it's way into winamp often!  This game boasts a huge library of user made content too, I haven't dared to touch it yet because it looks feindishly difficult! This is something that will give it thousands of hours of replayability though.  I honestly cannot recommend this game enough! I have to give it a 10/10. This is the standard that all puzzle games should aspire to. I just hope I can win some day.",
            "review_score": "1"
        },
        {
            "review_text": "Guaranteed to make your head hurt, but still worth it :P ",
            "review_score": "1"
        },
        {
            "review_text": ":)",
            "review_score": "1"
        },
        {
            "review_text": "Pretty much the greatest game ever made.",
            "review_score": "1"
        },
        {
            "review_text": "This fake chemistry game uses some real programming concepts to create an immensely rewarding puzzle gaming experience. Even though I program computers for a living, I couldn’t put this game down.  Sure, this game has a story. And while it is interesting and told well using short snippets, the real draw are the puzzles. The player is tasked with creating assembly lines for molecules and can earn extra points for efficiency. The molecules start off simple but soon increase their complexity and the number of assembly lines quickly grows to accommodate more complicated orders. So many different and interesting challenges are explored and new complications are introduced just in time to keep the tedium away. The learning curve gets steep(though exactly where it gets steep seems to vary from player to player) but never overwhelming. I was always compelled to keep thinking and trying out new ideas and the frustrations I felt were never enough to turn me off of the gameplay. I have recommended this game to everyone I know and now I am recommending it to everyone.(period)",
            "review_score": "1"
        },
        {
            "review_text": "The joy of finding that perfect solution.",
            "review_score": "1"
        },
        {
            "review_text": "If you want break your head until die or get the solution this is your game  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Neat puzzle game with a nice soundtrack. A thumbs up from me.",
            "review_score": "1"
        },
        {
            "review_text": "Really good puzzle game, may look intimidating at first but after you get the hang of it the game because really good. I recommend trying first the free demo since this game is not for everyone.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best puzzle games ever.",
            "review_score": "1"
        },
        {
            "review_text": "This is a neat little game where you make Molecules. It is a little hard.",
            "review_score": "1"
        },
        {
            "review_text": "pretty good",
            "review_score": "1"
        },
        {
            "review_text": "Brutally difficult",
            "review_score": "1"
        },
        {
            "review_text": "Guaranteed to make your head hurt, but still worth it :P ",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely stellar puzzle game that intrigues and will have you discovering new rules till about the third or fourth series of puzzles. really an excellent game that builds great thinking skills.",
            "review_score": "1"
        },
        {
            "review_text": "Maybe one of the best games ever made. Brilliant and challenging puzzle game with a perfect learning curve.",
            "review_score": "1"
        },
        {
            "review_text": "bought it just for the moustachium and pins 10/10 would buy again.",
            "review_score": "1"
        },
        {
            "review_text": "Actually an addicting puzzle game! Rated it as 9/10. :)",
            "review_score": "1"
        },
        {
            "review_text": "This game is really awesome. There is only one minus - no sterling tutorial, so its hard to understand what the hell is going on. This hard puzzle causes your gyrus to strain and that thing most of nowadays games deprived. Also worth noting another feature - game is not boring!",
            "review_score": "1"
        },
        {
            "review_text": "Create fiendish reactor controls to build all kinds of molecules .. what's not to like about this? =D It may look easy at first, but it will surely stress your brain!",
            "review_score": "1"
        },
        {
            "review_text": "Do you like games with a reasonable learning curve? Do puzzles make you cry at night? Have you ever said, 'Boy, there's just too much chemistry in my life'?  Then don't buy SpaceChem, one of the greatest and most challenging cerebral experiences you can have with your clothes on. It's a little like chemistry and computer programming, but with less of the wet stuff and more of the head-scratching frustration.  Seriously though buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "Great puzzle game with well thought out mechanics. Multiple ways of finishing puzzles plus leaderboards cause you to strive to make the most effecient reactor possible to complete the puzzle. Well worth its cheap pricetag.",
            "review_score": "1"
        },
        {
            "review_text": "Great game with difficult programming style puzzles.",
            "review_score": "1"
        },
        {
            "review_text": "Utterly cracklicious",
            "review_score": "1"
        },
        {
            "review_text": "Simultaneously the most frustrating and the most rewarding game I've ever played.  I'm almost done zone 4. I'm too scared of zone 5 to keep playing.  10/10 will induce emotional trauma",
            "review_score": "1"
        },
        {
            "review_text": "        YouTube™ Video:  Space Jam Theme Song&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "SpaceChem is a puzzle game with a chemistry twist. Would have loved to have this game when I was going through Organic Chemistry it would have helped explain some things that confused me in the early stages of my classes.   I like how the game saves the previous accomplished games to help figure out the current puzzle.",
            "review_score": "1"
        },
        {
            "review_text": "Keeping this short!  SPACECHEM is freakin' awesome but it's not a game for everyone. Imagine chemistry engineering and programming combined... 10 times as complex... on acid. That's SPACECHEM in a nutshell and boy does it rock. This is one of the games that is so simple yet so complex that it blows my mind! If you solve a puzzle you feel like Jesus, Einstein, Gandhi, Tesla and god combined. This is a game only for hardcore puzzle junkies! If you don't like puzzle games stay away but if you do this is the best one out there!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, challenging and funny",
            "review_score": "1"
        },
        {
            "review_text": "very satisfying puzzle game 100% recomended for anyone a fan of the genre, it also helps to be interested in chemistry and/or space (space-chem)",
            "review_score": "1"
        },
        {
            "review_text": "Melts your brain. In a good way.",
            "review_score": "1"
        },
        {
            "review_text": "Never finished it...  Never finished 2nd planet as well  Too hard",
            "review_score": "1"
        },
        {
            "review_text": "Simply the best and most addictive puzzle game I've ever played. The addition of a screen comparing your solution to others is a great idea and really helps push me to not only solve each puzzle, but to solve them efficiently.",
            "review_score": "1"
        },
        {
            "review_text": "SpaceChem is a puzzle game with a chemistry twist. Would have loved to have this game when I was going through Organic Chemistry it would have helped explain some things that confused me in the early stages of my classes.   I like how the game saves the previous accomplished games to help figure out the current puzzle.",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome. I thought I would have fun with the game for about 3 hours max at first glance, but I didn't know I would get sucked in this easily and play for so long. This game is a gem. I actually would recommend this game to anyone who love puzzles, but be aware it is rather difficult.   It's a shame there are a lot of negative reviews on the game suggesting that this game isn't for everyone, yet they have lots of hours on it and enjoy the game. It's sort of true and you can say the same thing on just about every game. I'm sure dev knows this and provide a free demo for people to try out. So suggest the free demo and stop giving thumbs down. You're not giving the game a fair rating when you thumbs down for that.",
            "review_score": "1"
        },
        {
            "review_text": "Great game!  Lots of higher level thinking and problem solving involved. My favorite of the Sandbox Puzzle genre (my favorite genre). Try the free trial if you are thinking about buying this game, it really is the best!",
            "review_score": "1"
        },
        {
            "review_text": "Challenging puzzles AND TF2 items! What's not to love?",
            "review_score": "1"
        },
        {
            "review_text": "This is programming made into a game. Brilliant. My very favorite puzzle game hands down.",
            "review_score": "1"
        },
        {
            "review_text": "Neat puzzle game with loops and fake chemistry. It'll probably teach you to be more organized and to become obsessed with efficiency too",
            "review_score": "1"
        },
        {
            "review_text": "potentially the most difficult game on steam, best headache i've ever had!",
            "review_score": "1"
        },
        {
            "review_text": "A+, would lose 2 weeks of my life again",
            "review_score": "1"
        },
        {
            "review_text": "This game is incredibly hard, but completely fair. Essentially it is an IQ test in puzzle form. Really the only thing I dislike about the game is the part where you connect reactors to each other. It's a good concept but feels clunky, and violative of the spirit of the game. I don't want to arrange reactors and pipes in a grid with artificial obstacles in the way. And if I screw up the placement it takes a lot of work to redo. Having said that, it's really not as bad as I'm making it out to be. If you like logic puzzles, you will love this game.",
            "review_score": "1"
        },
        {
            "review_text": "A difficult game to get your head around but once learned the depth and enjoyment derived from it are superb... A real sense of achievement when completing a section/task...I love it!!!",
            "review_score": "1"
        },
        {
            "review_text": "Very nice puzzle game. Extremely challenging, but not frustrating.",
            "review_score": "1"
        },
        {
            "review_text": "Really cool game, lots of Trial&amp;Error. It is hard tho...",
            "review_score": "1"
        },
        {
            "review_text": "play until your head hurts",
            "review_score": "1"
        },
        {
            "review_text": "If you liked The Incredible Machine, you'll like this game too. It's quite difficult, but very satisfying. The programmers were kind enough to include a leaderboard, so you can go from marvelling at your brilliance to despairing in the face of others' superior intellect in seconds.",
            "review_score": "1"
        },
        {
            "review_text": "This is the type of game that truly determines the boundries of the mind in both an entertaining and challenging way. In addition, it loosely bases its gameplay off basic principles of chemistry which gives the game a realistic edge to it. Aside from the gameplay, the plot seems to be similar to a Sci-Fi novel that I would read, in that it was entertaining and suspenseful. Honestly, I do not find many games on steam in which I can find these qualities.",
            "review_score": "1"
        },
        {
            "review_text": "Really cool game, lots of Trial&amp;Error. It is hard tho...",
            "review_score": "1"
        },
        {
            "review_text": "Awesome! It gets increasingly challenging but completing a level is very rewarding.",
            "review_score": "1"
        },
        {
            "review_text": "That's some mind bending puzzles right there",
            "review_score": "1"
        },
        {
            "review_text": "If you don't like puzzle games, turn back now, there's no fun for you here. This is probably the closest thing you can get to a programming game without actually writing code. If you're OK with this, why haven't you bought SpaceChem yet?  Everything in this is top notch, from the music to the qualities of each little mechanic. Easy to understand, amazing pacing, and a large variety of levels.  The learning curve is possibly the greatest one I've seen in a game. Whenever the game introduces a new mechanic, there's a simple level to learn it, after giving instructions about how it works. It lets you play around with the qualities of the new mechanic.  Just beware you might be kept up at night thinking about how to solve a certain puzzle.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing puzzler. Not for the faint of heart.",
            "review_score": "1"
        },
        {
            "review_text": "(09/10) - Near Perfection  With Hexcells the best puzzle game on steam. If you like puzzles where you really have to think, this is a brilliant game. Don´t get yourself stuck on the 'chemistry' part tho, even if you learn quite a bit about chemistry, the game feels more like porgramming an algorithm. Which, by the way, is super awesome. As i said: get this game, it really is one of the best puzzle games there are...",
            "review_score": "1"
        },
        {
            "review_text": "SpaceChem is a great idea for a game and I honestly don't remember anything similar to it. It creates some kind of visual programming methods and makes simple chemical reactions into sometimes very complicated topological problems. It's very fun to play, but I stopped in half when the problem was too complex to solve. Still I very recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "Challenging, intellectually stimulating, and most of all, fun.",
            "review_score": "1"
        },
        {
            "review_text": "This simple little puzzle game really taxes you to think of creative solutions. When you do, the sense of accomplishment is phenomenal.",
            "review_score": "1"
        },
        {
            "review_text": "This is an awesome game. I love to program, and I love logic, and this game pulls the two together into great puzzles. I keep coming back to this game. It's just awesome.",
            "review_score": "1"
        },
        {
            "review_text": "monthly realization that im never gonna be an engineer in software form  really good puzzle game tho, if you like machines",
            "review_score": "1"
        },
        {
            "review_text": "The most challenging puzzle game I've ever played, but I might just be stupid.",
            "review_score": "1"
        },
        {
            "review_text": "The Dark Souls of puzzle games. ",
            "review_score": "1"
        },
        {
            "review_text": "Great Puzzle / Programming Combination. And it gets ♥♥♥♥ing hard",
            "review_score": "1"
        },
        {
            "review_text": "One of the best puzzle games i`ve ever played.",
            "review_score": "1"
        },
        {
            "review_text": "Hardest game I've ever played! Intricate game level with endless possibility and creativity solution. If you are looking to challenge yourself and rock you brain out, this would be the game.  The creativeness!",
            "review_score": "1"
        },
        {
            "review_text": "How can you make chemistry, of all things, fun for a general audience? Sure, a fair number of people find chemistry fun as it is, but what about the rest of us? Enter SpaceChem. Essentially a simulator of how a molecular Universal Constructor would operate, SpaceChem (hereinafter SC) put you into the shoes of a chemical engineer, designing the operating program of Universal Constructors to produce tailor-made molecules from basic feedstocks. Start with loose carbon and hydrogen atoms and figure out how to produce acetylene. It's not just 'stick these here, stick those there, bond 'em and let 'em loose' because you need to figure out pathing and process, order of operations, and process management. SC calls upon quite a few skill sets, yet somehow never feels like work; it's surprisingly entertaining. The scary thing is that you're actually going to learn. Maybe not chemistry, as such, but programming, order of operations, process management, logistics... give it a chance, and you might find yourself sharpening skills you never knew you had.  I'm not saying this is equivalent to an MIT doctorate in chemistry, but it is a sweet fusion (NO PUN) of entertaining and skill-building. The only thing I'm disappointed in is how long I took to buy this.",
            "review_score": "1"
        },
        {
            "review_text": "It will make your brain explode and implode at the same time. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Not only is this a great puzzle game that sort of makes you code, it also has a funny story and later in the game you get a sense of purpose other than just solving puzzles!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best and hardest puzzle games to date.",
            "review_score": "1"
        },
        {
            "review_text": "Starts off easy... then it melts your brain. Frustrating initially, but rewarding when you figure it out.",
            "review_score": "1"
        },
        {
            "review_text": "If you like to feel stupid, spending hours and hours tweaking the tiniest intricacies of a reaction, then at the end, after hours of grueling mental torment, you like seeing how everyone else managed to do it 5x simpler than you have, then this is the game for you!",
            "review_score": "1"
        },
        {
            "review_text": "CLARIFICATION. Probably a great game for PC but the Mac port can be buggy to the point of not starting up. The whole third party sign in. Oh dear. How sad. Never mind.",
            "review_score": "-1"
        },
        {
            "review_text": "+ A nice and solid puzzle game + Challenging as you go + Purhaps a fun way to learn the elements - The game story and tutorial could be lengthy and confusing for some people - No way to clean the bored with one button  Not recommend for the price of $10 unless on a discount or you really enjoy puzzles like sudokus",
            "review_score": "-1"
        },
        {
            "review_text": "Spacechem is a indie chemistry based puzzle game with a high amount of depth. Even beating one level requires a lot of thinking, hard to solve but very satisfying afterwards. Price is a bit too much for this kind of game 10$, and there's no demo available so most people who get into this game won't know what to expect and might abandon due to high learning curve.",
            "review_score": "-1"
        },
        {
            "review_text": "Complicated games usually need a nifty introduction to draw the player in and make him want to play the game and understand it, and waste days upon days on staring at the screen while playing a game. But not this game. Straight from the start, there are just pages of text, and no interactive demonstration on how to work the overly complicated system.   I always say the FREE things are always better because they were free. Well not THIS game. Even though I got it for free, I can honestly tell you not to waste your time on it. God forbid that you actually spend money on this! Save yourself!",
            "review_score": "-1"
        },
        {
            "review_text": "It's one of those games you need to play to see if you would like it. If you like Chemistry and simple puzzles you can try it. Personally it's not my thing.",
            "review_score": "-1"
        },
        {
            "review_text": "I do not understand quantum mechanics nor do I know all the ♥♥♥♥♥♥♥ elements. Not even worth liking the PC Gaming page on facebook to get this damn game. -24/10",
            "review_score": "-1"
        },
        {
            "review_text": "Holy ♥♥♥♥ what the ♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "I watched the videos and tutorial, still don't understand it. Came part of a bundle, so i'm not that upset. Otherwise doesn't even look like it's fun to play. Maybe if your your life is chemitry or crappy puzzle games then this might be fun for you. The rest of us are better off without it.",
            "review_score": "-1"
        },
        {
            "review_text": "it looks good but dont buy it, its not worth it. I have a 1920x1080 screen and whatever i do it wont work, there is always a problem with the resolution. So except if you are a professional, dont buy it, otherwise buy it on your tablet.",
            "review_score": "-1"
        },
        {
            "review_text": "It's cute, but boring",
            "review_score": "-1"
        },
        {
            "review_text": "Don't buy this game. Only 30% of people have completed the first few levels and 3% have completed the game. It becomes unreasonably difficult extremely quickly. Only purchase this game if you enjoy failure and masochistic puzzle-solving.",
            "review_score": "-1"
        },
        {
            "review_text": "0/10 Boring game that is played for ten minutes and a unistall might happen.   Not my type of game.  *NOT WORTH TEN DOLLARS SO GO LOOK FOR A BETTER GAME*",
            "review_score": "-1"
        },
        {
            "review_text": "This game is seriously energy-draining, I'm not even kidding anybody. First minute of playing it, I ended up eating 4 slices of bread. See how this game would make you fat after 4 days of playing. Don't play this game. Aside from losing energy, you'll kill your own brain cells because of its difficulty. Not unless you're into mind-wrecking games. Then this game is for you.",
            "review_score": "-1"
        },
        {
            "review_text": "The reason more than 50% of people purchase this game is for the exclusive in-game items for Team Fortress 2 (Fishcake and SpaceChem Pin). People don't really at all understand this game except if they have a background knowledge in computer programming. It really helps!",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty sure SpaceChem is just another word for 'The opposite of fun'.",
            "review_score": "-1"
        },
        {
            "review_text": "i had to look up on youtube to see how this works to get the itmes for tf2 so 4/10",
            "review_score": "-1"
        },
        {
            "review_text": "not for anybody (not for me)",
            "review_score": "-1"
        }
    ]
}