{
    "app_id": 9350,
    "name": "Supreme Commander",
    "release_date": "2011-09-28",
    "developer": [
        "Gas Powered Games"
    ],
    "publisher": [
        "Square Enix"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "RTS",
        "Sci-fi"
    ],
    "achievements": 0,
    "positive_ratings": 1065,
    "negative_ratings": 162,
    "price": 8.99,
    "description": "For a thousand years, three opposing forces have waged war for what they believe is true. There can be no room for compromise: their way is the only way. Dubbed The Infinite War, this devastating conflict has taken its toll on a once-peaceful galaxy and has only served to deepen the hatred between the factions.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/9350/header.jpg?t=1525193447",
    "minimum_requirements": "Recommended: OS: Windows® XP Service Pack 2, Windows® Vista Processor: 3.0 GHz Intel or equivalent AMD processor or better Memory: 1 GB RAM or better Hard Disk Space: 8GB available hard drive space Video Card: 256 MB video RAM, with DirectX 9 Vertex Shader / Pixel Shader 2.0 support (Nvidia 6800 or better)",
    "recommended_requirements": "Minimum: OS: Windows® XP Service Pack 2, Windows® Vista Processor: 1.8 GHz processor  Memory: 512 MB RAM Hard Disk Space: 8GB available hard drive space Video Card: 128 MB video RAM or greater, with DirectX 9 Vertex Shader / Pixel Shader 2.0 support (ATI 9600+, Nvidia 6200+)",
    "reviews": [
        {
            "review_text": "I have now bought this game three times. I bought it on release for full price, lost the disk, rebought the game on disc a few years later, thats been lost forever, and i bought it a THIRD time and i still feel that i havent spent enough money to justify all the entertainment i've gotten from this game over the years. That tells you all you need to know, this is one of the best RTS games of all time. I've always thought Total Annihilation was the most underrated RTS ever made, and this spiritual successor does it even better. I will play this game in 20 years just like how i still play Total Annihilation even to this day.  You didnt come here to find out how the game plays, you want to know if its worth it or not. Well, this game has been out for a long time. All the info is already there for you. If you are a casual RTS fan, love giant robots and armies, enjoy building gigantic sprawling bases and high level strategy, all mixed with a decent to solid single player campaign, and great balance, you should definitely get this game, especially on sale.  Forged Alliance, the expansion, is also great and has the most players playing multiplayer. But to me the original will always hold a special place in my heart. Plus it seems more stable and the 4th race never quite felt as fluid or fun as the original three.  My third favorite RTS ever after SC:BW and DoW: Dark Crusade / Soulstorm.  UEF for life  10/10",
            "review_score": "1"
        },
        {
            "review_text": "This is the definitive game for any RTS player, new or experienced, as it gives large-scale, decisive battles involving extreme amounts of strategy. Hell don't even wait for a sale. BUY THIS GAME. NOW. 5/5",
            "review_score": "1"
        },
        {
            "review_text": "I nuked myself, my friend, my enemies and a few ugly trees all at the same time.  11/10 Would nuke everyone again. Twice.",
            "review_score": "1"
        },
        {
            "review_text": "It's got a mediocre story but it's a good RTS and the mechanics are brilliant.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing, no doubt about it.  I first discovered this game when my dad gave it to me as a gift, he had never played it so he though I might show some interest in it. I booted up the game from the disc and played campaign, after the first mission I fell in love with it instantly. I learned the controls and fucntions pretty easily and played for hours on end; making planetfall, constructing a base and an army, and took down the opposing commander(s). Although games can be pretty long and tedious to complete, it is still fun trying to protect yourself from onslaughts of planes, ships, and tanks while trying to create your own army. Multiplayer is just like campaign/skirmish: great gameplay, great fun, and with real people to play with or against. It is sad that this game doesn't get the credit that it deserves and that it isn't as popular as It should be, because this game has been a fantastic experience playing.  1000000/10 Would always recommend",
            "review_score": "1"
        },
        {
            "review_text": "2006's underrated game that should have gotten more recognition. In 2006, console games dominated the gaming market over PC, but Supreme Commander is the only exception. For the first time ever in a RTS game, you can actually build and control 500+ units to dominate your foes in the universal battlefields throughout the galaxy. You can build your ground forces, naval, and air forces in one map and is one of the greatest RTS games has to offer. If you play RTS before, then this should be more interesting. Though this game is barely known in the PC Gaming world (and aged), I strongly recommend this game to anyone who enjoys RTS.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best RTS games around.  This is better than number 2 because you have more control on your units.   The graphics are not amazing, but what you can do is. Multiplayer is the best fun when playing this game and I never ever touched the campaign because all I wanted to play was the multiplayer with friends.  If you like RTS then this is the game for you!",
            "review_score": "1"
        },
        {
            "review_text": "Not as good as Total Annihilation, but still it's not bad. Bloody hard though, and rather unpolished.  Buy it if it's going cheap. RTS fans will appreciate this.",
            "review_score": "1"
        },
        {
            "review_text": "If you love real Battles and Epic sound effects during gameplay , then this is your game !!",
            "review_score": "1"
        },
        {
            "review_text": "you can put 99999 airplanes in a boat at once  10/10",
            "review_score": "1"
        },
        {
            "review_text": "If you're looking to play it multiplayer with friends, go for the standalone expansion pack Supreme Commander: Forged Alliance and download FAF and whatnot (refer to my recommendation on that game). You do NOT need this game to play the SupComFA expansion pack.  If you're looking at this for the story, by all means dig in, especially if you find it discounted.",
            "review_score": "1"
        },
        {
            "review_text": "This game has nukes,,,",
            "review_score": "1"
        },
        {
            "review_text": "Oh my god, how come i haven't heard of this sooner?! This is an ageless game. It may be old but the gameplay is truely fantastic. GET IT!",
            "review_score": "1"
        },
        {
            "review_text": "Great and number 2 is even better",
            "review_score": "1"
        },
        {
            "review_text": "A shining example of pure RTS, though does not have the appeal of mass-market RTS as it is today. Not many people will like this - and chances are you probably won't if you're reading this - but I loved the hell out of this game and would recommend it to anyone seeking a truly epic RTS.",
            "review_score": "1"
        },
        {
            "review_text": "It was my first RTS that I played, maybe thats why I think its the best game of that genre. &gt;interesting storyline &gt;You can choose between 3 factions, every one of them has its own, unique units, and needs a different stategy. &gt;Different storylines for every faction &gt;Units look badass &gt;You must combine different units to win*  &gt;Graphics are a bit old    *unless you spam a ♥♥♥♥ton of one type, but that doesnt work everytime.",
            "review_score": "1"
        },
        {
            "review_text": "Very Good rts game. The only thing that is bad about it is the AI are not good and are too easy most of the time. They rarely attack. Id recomend this to anyone who likes a good campain with a good story.",
            "review_score": "1"
        },
        {
            "review_text": "I have passed more than 100 hours in this master pice of THQ game (i let out how much time i play in expancion). If you are fan of strategy and action you must buy this game. Supreme Commander is a masterpice of his company   Strong points for buying it  High A.I *PERFECT AND DETAILED GRAPHICS* (for his age) multiple and many missions 100000% worth to buy",
            "review_score": "1"
        },
        {
            "review_text": "This game is some sweet hotness. One of the finest RTS titles you can get.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic! As a long time Total Anihilation fan I dont know why I didnt buy this sooner. Seeing as its made by the same guy. Gonna get me some serious time on this and then later look at planetary anihilation oooh",
            "review_score": "1"
        },
        {
            "review_text": "if you have direct x 11 you will not be aboul to play",
            "review_score": "1"
        },
        {
            "review_text": "Best RTS EVER! 2000 units at your disposal, and you can que your units ahead of time to build, then move here, then patrol an area! I've Que'd up enough stuff before to where I could go get a beer or take a ♥♥♥♥ and pickup right where I left off!",
            "review_score": "1"
        },
        {
            "review_text": "I made a base that was under water it was k",
            "review_score": "1"
        },
        {
            "review_text": "if you loved old school total annihalation then you will love this mother ♥♥♥♥er. if you love good RTS then you will love this mother ♥♥♥♥er. if you love giant ♥♥♥ robots ♥♥♥♥ing up other giant ♥♥♥ robot then you will love this mother ♥♥♥♥er. if you love losing your job because you missed work so many times because you can't stop playing this game then you will love this motehr ♥♥♥♥er",
            "review_score": "1"
        },
        {
            "review_text": "It's almost as good as total annihilation, supmeme commander has better graphics tho",
            "review_score": "1"
        },
        {
            "review_text": "I don't recommend this game",
            "review_score": "-1"
        },
        {
            "review_text": "Why is it when I first purchased Supreme Commander from 'Steam' it worked perfectly, then after the 'MANY' updates that 'Steam' required to continue playing the game that it STOPPED working? This game was one of the old classics I played when 'Windows' was still in it's infancy. Now it seems all the games on here are being 'updated' out of existance. IF YOU'RE GOING TO SELL A GAME MAKE SURE IT WORKS ON YOUR SYSTEM !!!!",
            "review_score": "-1"
        },
        {
            "review_text": "I don't recommend this game unless you really enjoy turtling. It has good ideas, but they are poorly implemented. Painfully slow build times on units and structures, mass fabricators destroying any need to control the map and the resources scattered across it, and incredibly powerful defenses turn this into a painful slog. The ability to control and upgrade the commander who represents you in the game is neat at first, but they quickly become the big can which sits in the middle of its defense riddled, mass fabricator clogged base and never leaves. Because if the commander does leave, it runs a good chance of dying and losing the match.   What the game offers:  The Basics    You play as a commander aligned with one of three factions which can build basic structures. The factories let you get fabricators which build even better structures. Upgrade the factories to get better fabricators for better structures and units. You also need to balance production with your resource income, so make sure you're building mass pumps, power generators, and mass fabricators to meet your base's growing needs.   When it comes to crushing the opposition, you are given many options, and your three starting ones are land units, naval units, and air units. At higher fabricator tiers, you can get long range artillery, stealth, experimental units, and strategic missle launchers (nukes). Of course, all of this can be countered easily at lower cost by defenses. In order to defeat an enemy, you need to either catch their commander while it's exposed or have an overwhelming advantage to push through their defenses.  Mass pumps provide the most mass at the lowest energy cost, but they can only be built atop mass deposits scattered across the map. Ideally, the game would become a battle to control and defend mass pumps for a production edge over the opponent. Sadly, mass fabricators destroy this by allowing a player to acquire all of the mass they will ever need from the comfort and safety of their own base, often at a faster pace and at less expense.  The factions are almost entirely aesthetics, with their only major differences being what experimental units they can build. They all have the same unit classes and structures which do the same jobs. There are small bits of fluff like 'Aeon bomber does damage over (a very short) time, cybran bomber does slightly less damage over a slightly larger area, and UEF is a typical bomber with a large explosion and good damage.' But ultimately the differences are minimal.    Three Campaigns    The story is decent in each of the three races' campaigns, but the basics makes them a slow mess. Even the first map in the campaign takes at least forty minutes to finish simply because of how long it takes to build everything and amass enough firepower to win. And it only goes down hill from there. Expect one to two hours for each campaign map.    Skirmishes with AI's    These often take just as long as the campaign maps, although tech rushing (spending all of your resources on obtaining max tech units and structures as quickly as possible) can end an AI opponent quickly. It is impossible to beat the AI at spamming mass fabricators, so be prepared for a long slog if the battle isn't ended quickly. The AI skirmishes also seem to be buggy and occasionally crash to desktop for me, so beware.    Multiplayer    As other reviews have stated, look at Forged Alliances if you want an active online community. I haven't tried it, but from what I have read online, expect cheese.   This game may be worth buying on sale. If you're really liking some of these ideas, I'd recommend Planetary Annihilation when it is on sale instead if you don't mind its lack of a story filled campaign. It uses a large number of the same ideas in Supreme Commander, but is a better tuned experience overall.",
            "review_score": "-1"
        },
        {
            "review_text": "This game's Story mode feels like it falls pretty short and feels pretty terrible. All you had to do was build some defense so their small attack forces couldn't touch your base. And then build a small force of artillery and a little bit of front line tanks and destroy their whole base from the distance while they did nothing about it. The good part about the story is that the missions were pretty long in length so each battle felt like there was more to it. The multi player seems to be LAN and then you can join people hosting if you had their IP? I'm not actually sure, but this is pretty bad unless you find some community who host regularly but I personnaly don't like fighting the same people over and over in an RTS.",
            "review_score": "-1"
        },
        {
            "review_text": "get any uther supreme commander if your not going for the campain the match making system is rubish.",
            "review_score": "-1"
        },
        {
            "review_text": "I can't even get the game to load... WTF!",
            "review_score": "-1"
        },
        {
            "review_text": "I really wanted to enjoy this game. total Annihilation is one of my favourite games/RTS of all time. That game came out in 1998 and it seems to this day RTS games can't even come close. I was dissapointed by the units. It seemed very lacking. Maybe I'm used to TA, whic had hundreds of 3rd party custom units. I'm sure you can with this, but also the battles didn't seem satisfying. Maybe I'm missing something, I want a decent RTS, will try Ashes of Singularity but after that I give up.  All in all I couldn't help but compare to TA which is a miles better game. I also recently played the Warhammer Dawn of War franchise, which couldn't hold a candle either.  ",
            "review_score": "-1"
        },
        {
            "review_text": "It should be mandatory for every strategy game to have as good UI and controls as this game. Including you, my little Starcraft. This game makes me hate fixed camera, which prevents me from zooming out so much that I can see everything on the map and zoom in enough to enjoy the explosions -by blowing up the enemy commander, of course.   ",
            "review_score": "1"
        },
        {
            "review_text": "A very fun massive futuristic RTS, with massive battles and big maps",
            "review_score": "1"
        },
        {
            "review_text": "damn it this was a great game now people can't even open it I love this game even thought I can play supreme commander forged alliance and 2 this is broken now it won't work why!!! it's so sad really that you can't play it but an excellent game and so most people love it it's nearly 10 years old and it's younger brother supreme commander 2 has been disliked alot which is unfair",
            "review_score": "1"
        },
        {
            "review_text": "Built a UEF Backpack Nukor, launched it at an enemy formation. Said formation was T3 Cybran. I lost.  Would recommend 11/10",
            "review_score": "1"
        },
        {
            "review_text": "One of my first games and still enjoy playing it.",
            "review_score": "1"
        },
        {
            "review_text": "Epic Strategy!",
            "review_score": "1"
        },
        {
            "review_text": "Its good, buts its not quite   carling   the forged allience dlc  75/100",
            "review_score": "1"
        },
        {
            "review_text": "It's addicting.",
            "review_score": "1"
        },
        {
            "review_text": "If you've played Total Annihilation, you'll know the basics of how this game works already. And yet, this spiritual successor improves upon its unique RTS formula in almost every way possible. The price was worth it just for the single player campaigns, and I haven't even touched multiplayer yet. There's a simple hierarchy of 4 tiers and gives you so many options in combat. Unlimited resources (in a manner of speaking) lets you do more than other RTS games would. Even though Starcraft 1 and 2 are my favourite RTS games ever, this game is very refreshing in comparison with the freedom you have. You can turtle effectively with an impenetrable base and use long range nuclear missiles or artillery battery to destroy your opponent. You can send a swarm of 200 gunships to take them out. Or use an army of Tier 3 siege bots and AA bots. And you can use aircraft, land units and naval units. Then there's the unique, experimental units which take a lot of effort to build but are very fun to watch wrecking things. And let's not forget the ability to zoom out or in to almost any degree you feel like. The main campaigns are good and fun, even though the pacing could be a little better. I'd like to use the tier 3 siege bots, battleships and gunships a bit earlier. And you don't get to use the experimental units until halfway through the last mission- which is a little disappointing. There are only a few things I would say are bad about the game. Compared to Starcraft, it feels a lot slower. You need air transport to get your engineers anywhere other than your main base in an acceptable time fashion. Queing orders when selecting multiple units sometimes results in them repeating builds that have already been done, wasting precious time. The campaign also has an annoying unit limit that applies to buildings as well, and there's no quick way to delete units if need be. A simple 'delete' command would have been nice. Commanding armies has advanced controls but the units themselves still bump into each other and not attack as a clumped group (like Starcraft 2 handles very well). Projectiles operate in an immersive way, with bullets or missiles homing or not depending on the unit, but some units are nearly impossible to kill efficiently without transporting engineers and building defenses (tier 3 air superiority, ugh). The graphics are very impressive considering how old the game is, and I still like zooming in to inspect all the high tech lights and power networks I construct. My life for the Aeon Illuminate!",
            "review_score": "1"
        },
        {
            "review_text": "Simply awesome. I purchased my first copy of this game way before Steam has it. Played many times, including with friends in online matches, and then purchased it again when was available on Steam, mostly because i don't need to worry about instalation CD anymore. Its by far, the best RTS game i have ever played (SupCom and SupCom: FA). Just avoid the SupCom 2....its a huge crap that killed the name of the franchaise. ",
            "review_score": "1"
        },
        {
            "review_text": "The Most amazing Game For people who love Robots!! I remeber playing this 5 years ago",
            "review_score": "1"
        },
        {
            "review_text": "This is my all-time favorite RTS game. I really dislike having to micro-manage units at the level that games like Starcraft II require you to (are my soldiers that stupid?), but in Supreme Commander, macro-management is king and overall strategy is more important, as well as economy management. Check out  faforever.com  to get a free multiplayer client that receives regular updates (support for the official multiplayer servers was discontinued).  The depth and awseomeness of this game is off the charts. I can't even play RTS games without strategic zoom anymore. Definitely worth a buy!",
            "review_score": "1"
        },
        {
            "review_text": "Better than the sequel!",
            "review_score": "1"
        },
        {
            "review_text": "A really good strategy game I recommend. ",
            "review_score": "1"
        },
        {
            "review_text": "Do not buy if your using Win 7, Will not work using steam cliant. I have both hard copy and the steam cliant setup. my copy works. My guessing its the steam cliant. oh well... Plus you will not get yopur moneys back if it dont work out for you, too bad its still a good game even though its an older game.",
            "review_score": "1"
        },
        {
            "review_text": "Great game and great followup to Total Annihilation.",
            "review_score": "1"
        },
        {
            "review_text": "Good Game but a lot of trouble to get it to work for people who dont know how right click the steam icon and choose open as administrator took me ages to figure out i think steam should update it as its a good game.",
            "review_score": "1"
        },
        {
            "review_text": "A good strategy game. It really shows it has drawn on Total Annihilation in a good way. You will have to think tactically on an entirely different level than on other strategy games. [In which other game did you have ten factories strewn over a large map constantly churning out land units which are then transported by air to the battlefield(s)?]",
            "review_score": "1"
        },
        {
            "review_text": "Recently replayed this and it's still one of the best RTS games ever made. There is more complexity than in SC2, but I really think it adds to the enjoyment and challenge of the game. A great single-player campaign.",
            "review_score": "1"
        },
        {
            "review_text": "Exellent RTS game that shamefully not alot have heard of. great structure building and tech path, very well orchistrated and easy enough to get into. A 1/2 hour at most to grasp on its core gameplay and a variety of customization to play how u like. Whether it be a 2 on 2match with AI or friends, with tons of maps to choose from with some beautiful scenery and modifiers if wanted. only downside which there arent many, is the lack in fation variation. its not awful persay, but choosing a team makes no strategic difference other than the aesthetic look between the Cybran, UEF, or Aeons as they all have almost identical classes, structures, and units. Maps also play asymmetrical which leaves every round balanced and challenging. Again I have to back up to the first thing i said, its sucks that this game was passed up by alot of ppl so multiplayer is nearly impoissble especially now a days but if you have a buddy with the game and/or up for a good hour long battle then look no further. A real redifiner of the rts genre.. 10/10 in my book",
            "review_score": "1"
        },
        {
            "review_text": "If you've never played Supreme Commander, then you have missed something. A classic RTS with some very interesting elements, huge maps, lots of units and massive battles. The expansions and sequel are also very good, however they do bring very little new things to the table.  It reminded me of M.A.X. (Mechanised Assault &amp; Exploration.) Also a great game, better said a 'Good Old Game', however it is a bit aging now. MAX however is not on Steam, but can be found if you look on the web.  Supreme Commander 9/10 Supreme Commander : Forged Alliance 9/10 Supreme Commander 2 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Just re-bought this (lost my CD key for my old DVD copy), and yes, it is worth it. Hundreds of ways to play, and to me, this feels like a sci-fi version of WW1; defensive tactics, gaining ground by inches, and wave tactics with infantry and tanks. Air cover is only as good as the lack of air defenses allows, and offensives are bloody, attrition-style affairs. Resource management is very important, and who controls the best industrial base wins.   Buy this, and play it. The epic scale of the battles alone will stupefy and amaze.",
            "review_score": "1"
        },
        {
            "review_text": "Its 2015 and i still play this game because i still appreciate its features. since its 2015, ive looked at multiplayer and i think im the ONLY person on this planet who plays this game. I think the Developers did an excellent job on the game and im waiting on SC3 and i absoloutly love the SC game series. it is highly recommended to games with a good stategic mind.",
            "review_score": "1"
        },
        {
            "review_text": "Supreme Commander is one of the best games of its time and genre. -Massive battles with hundreds of units on screen at once. -Graphics are good, even today. -Multiplayer support. -Other things I cannot remember. One of my fav games ever.",
            "review_score": "1"
        },
        {
            "review_text": "A MUST HAVE for anyone who wants to get into RTS...s, It's a game that sets out to combine the massive scale of a grandstrategy with the fastpace action and basebuilding of RTS........s. It succeedes with flying colors making an instant classic worth playing even today. If I were to have any grip with it it would be the lack of value and face the lesser units have, they just arn't that valuable individually.",
            "review_score": "1"
        },
        {
            "review_text": "Its amazing! Its like Civ's Grandfather. Its not the most full game but its still really fun",
            "review_score": "1"
        },
        {
            "review_text": "Great Game really puts a standard for RTS games everywhere if you got a decent pc this game will give you hours of fun sadly though GPG net is dead so pla Forged alliance and get Forged alliance forever if you wanna play againt real people. Still The stiry is in depth and shows all sides of a war that you get to fight in.",
            "review_score": "1"
        },
        {
            "review_text": "Played in 2008 and now is year 2016. Time to nuke my enemies. With more nukes. More. Watch game lagged by nukes once more time.  Shorty.. excellent rts with good gameplay and....you know what. You want to play Supreme Commander. And nuke them all.",
            "review_score": "1"
        }
    ]
}