{
    "app_id": 94400,
    "name": "Nidhogg",
    "release_date": "2014-01-13",
    "developer": [
        "Messhof"
    ],
    "publisher": [
        "Messhof"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Achievements",
        "Full controller support",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie",
        "Sports"
    ],
    "tags": [
        "Local Multiplayer",
        "Indie",
        "Action"
    ],
    "achievements": 12,
    "positive_ratings": 5480,
    "negative_ratings": 758,
    "price": 6.99,
    "description": "Nidhogg is the epic award-winning fencing tug-of-war, full of graceful acrobatics and clumsy stabs. IRL yelling and excitement may occur, in this ultimate two-player showdown of fast-paced fencing and melee attacks. Beware, advantages in Nidhogg are often fleeting, as new opponents continually spawn in your way.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/94400/header.jpg?t=1543955209",
    "minimum_requirements": "最低: OS: Microsoft® Windows® XP / Vista / 7 プロセッサー: 1.2GHz processor メモリー: 512 MB RAM グラフィック: DirectX 8-compatible graphics card with at least 32MB of video memory DirectX: Version 9.0c ネットワーク: ブロードバンドインターネット接続 ストレージ: 200 MB 利用可能 追記事項: Microsoft Xbox 360 Controller or Direct Input compatible controller",
    "recommended_requirements": "推奨: OS: Microsoft® Windows® XP / Vista / 7 プロセッサー: 1.4GHz processor or faster メモリー: 1 GB RAM グラフィック: DirectX 8-compatible graphics card with at least 32MB of video memory DirectX: Version 9.0c ネットワーク: ブロードバンドインターネット接続 ストレージ: 200 MB 利用可能 追記事項: Microsoft Xbox 360 Controller or Direct Input compatible controller",
    "reviews": [
        {
            "review_text": "climb into a commodore 64 and throw a sword at your doppelganger",
            "review_score": "1"
        },
        {
            "review_text": "It's a great game IF and ONLY IF you have 2 controllers and friends to play with in real life. The online play isn't reliable the game feels really bad playing on a keyboard. Keep that in mind before buying.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game, I love it soo much. But I'm nearly very close to giving it a thumbs down due to the somewhat buggy gameplay and shallow content. I have played this game extremely competitively and have a current record of 9:11, and from that 27 hour experience I can say I've speculated about every mechanic in this game down the very brim and have noticed extremely miniscule mistakes in the programming. This game needs to be more polished. Thank you. 7 / 10",
            "review_score": "1"
        },
        {
            "review_text": "This game is so simple and silly, it reminds me of the 1v1 play sessions as a kid in my pajamas with my best friends fighting over the controller.  Best way to enjoy the game: - Invite people over (blackmail them if they don't want to come) - Boot Nidhogg and shove a controller in their hands - Give them a minute to figure out the controls - Scream 'PREPARE TO DIE' - Win - Repeat until tournament is complete",
            "review_score": "1"
        },
        {
            "review_text": "My first online match had me cackling with glee. Fast paced fencing! You can change from low, mid, high stances plus you can hold up to throw your sword in a last ditch effort. It's the most fun I've had in an arcade style game in a very long time. Don't let the simple graphics fool you, there's a very well thought out combat system here. You win a round and then try to advance screens in your direction so if you want to try to avoid combat after you win a round you can be a coward and beeline for the finish. Ok, enough typing, I have fast paced fencing to get to.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the most intense pvp experiences on steam. A classic example of less is more. A true minimalist masterpeice. Recommend to players who like to get competitive with their friends as well as those who enjoy spilling some technicolor, pixelated blood.",
            "review_score": "1"
        },
        {
            "review_text": "Bushido Blade 2014. Buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "Since updating the game's multiplayer, it's actually completely playable, even with 100+ms.  Love it",
            "review_score": "1"
        },
        {
            "review_text": "Don't know exactly how to describe this beside being wickedly good, both solo and on a party :)",
            "review_score": "1"
        },
        {
            "review_text": "Buy this game on a sale like i did.Its worth like anything under 5 bucks. Is this game hard? No its fairly simple in what you can or cannot do and you really only will play this game for its multiplayer.  Castle best and only map imo.",
            "review_score": "1"
        },
        {
            "review_text": "A better minimalist fighting game than Divekick. More complex, too, but better.  I imagine it gets very intense in local play. Have not had the chance yet though.   fight with those swords and offer yourself to the giant worm!",
            "review_score": "1"
        },
        {
            "review_text": "I personally think that this game is excellent gameplay-wise, but I also see quite a few flaws.  Pros: -Very addicting -Multiplayer -Rare yet astounding turn-arounds -Unique gameplay -Just plain fun  Cons: -Limited to only 4 maps -Repetative -Controls may be a bit hard to learn -Costs $15  Conclusion: I think that this is a great game. It's mainly the price that's the big problem. If it costed maybe about $5, then the cons could be neutralized by the low price, with the exception of the Controls con. I truly hope that the developers continue to work on this game, and give all players an amazing experience.",
            "review_score": "1"
        },
        {
            "review_text": "Do NOT buy this game if you plan on playing it by yourself. This game is best shared with others; other reviews basing their opinions off of the single player alone are not giving a holistic review of the game. This game is absolutely stellar when played with a buddy. Buy it, seriously!",
            "review_score": "1"
        },
        {
            "review_text": "This game is simply awesome. Anyone can play, but only a few can master it.",
            "review_score": "1"
        },
        {
            "review_text": "If you don't have friends willing to play this game , do not buy it . Cuz there's no one else playing it , it becomes boring by your own .",
            "review_score": "1"
        },
        {
            "review_text": "Nidhogg is great, simple to learn and a lot of fun. You will be shouting frantically at your opponent as you play, and it's a great game to bust out at parties/social gatherings. My girlfriend (who barely plays video games) was able to pick this up and we had a ton of fun with it.",
            "review_score": "1"
        },
        {
            "review_text": "It's like a low-fi, super simplifird smash brothers with some interesting independent elements that are born of the swordfighting theme. There's a lot that can be said about a simple engine that produces complex situations and gives such a wide flexibility to gameplay. It's one of those games that when you win or lose you never feel cheated and it's fun to end a match on either side of the divide.  I would say however that the price seems a little insane for the small amount of content, however if that's the price you pay for such a fittingly simple and robust online facility and touch perfect controls then I can understand even if I don't agree. The game really needs some free updates to it, perhaps even workshop level-editing. This really does feel like a proof of concept, albeit a really, really good one.",
            "review_score": "1"
        },
        {
            "review_text": "I can stab people and so can you. Pretty fun, but the last I tried playing online the netcode was pretty trash.",
            "review_score": "1"
        },
        {
            "review_text": "A fun little game to mess around with your friends",
            "review_score": "1"
        },
        {
            "review_text": "Addictive simplicity!",
            "review_score": "1"
        },
        {
            "review_text": "Nidhogg is a game about sword duels and giant snakes.  Nidhogg is the best game ever made.",
            "review_score": "1"
        },
        {
            "review_text": "Grab a few friends for an online tournament and you can have fun for hours with Nidhogg, but not days. This game is sadly a one-trick pony and you'll feel the brand-new game buzz wear pretty damn thin much quicker than you'd like. If you look past the shear lack of longevity to this game, you can no doubt appreciate the nice visual take on a classic look and the quirky and fresh (in the modern gaming world anyway) style of gameplay. If you're looking for a fun indie game to play solo (for more than an hour or two at least), in my opinion, this isn't it.   6/10",
            "review_score": "1"
        },
        {
            "review_text": "Edmond Dantes found a botte of absynthe, drank the entire thing and fell asleep, whereupon he dreamed that he was inside karateka on commodore64.   Hands down the best tug of war ever!!!  100/10   ",
            "review_score": "1"
        },
        {
            "review_text": "Very fast paced sword fighting, only issue is that the multiplayer is very laggy for whoever isn't the host, but other than that a very solid game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is going to try to trick you into catching your 'boomerang sword' but DO NOT BE FOOLED it is still just a regular sword.",
            "review_score": "1"
        },
        {
            "review_text": "Wounding your companions is seldom this much fun. A 1v1 fencing pull of-war. Ailing in substance, yet splendid mechanics and a wild aggressive feel",
            "review_score": "1"
        },
        {
            "review_text": "Great fun locally. Multiplayer holds a lot of promise if the lag and matchmaking problems can be addressed.  Definitely a must for LAN parties.  ",
            "review_score": "1"
        },
        {
            "review_text": "little over priced but great fun ",
            "review_score": "1"
        },
        {
            "review_text": "The most classy murder simulator I've ever played.",
            "review_score": "1"
        },
        {
            "review_text": "finally you can stab your friends not-in-real-life with this SMASH HIT baby mode sword spindly puncturizing sweltering gregor debonair RITUAL SACRIFICE SIMULATOR (no goat alowed)  buy it with money in real life",
            "review_score": "1"
        },
        {
            "review_text": "This makes me feel very confused and tired. The computer is very good at moving quickly while I am not. I like the music and the way my eyes water if I play for more than 5 minutes. I give this game 4 Tired Dogs out of 6. It could have been 5 out of 6 'TD's, but the only weapon is a small white line that is horrible to touch and there are not many move to do with it. Will change rating if any different lines or magical spells are added to the game.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game! Seriously, It's so competitive and very fun :D",
            "review_score": "1"
        },
        {
            "review_text": "This game is absolutely outstanding. It completely amazes me. It's extremely quick paced and everything is smooth. You need to adjust to your opponent's fencing style as well. Very innovative.",
            "review_score": "1"
        },
        {
            "review_text": "Nidhogg (NEED-hawg) is 'a serpent in Niflheim who gnaws upon the lowermost root of Yggdrasil' according to  dictionary.com , but according to me it is an AMAZING game, worth every penny spent on it. The game is centered around a style of swordfighting similar to fencing, with a few twists. The soundtrack and art design are amazing, and the multiplayer, when it works, is very enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "this is the first game that made me say 'What The ♥♥♥♥' everytime I push a button",
            "review_score": "1"
        },
        {
            "review_text": "Nidhogg is really enjoyable fast-paced dueling game, where two players sword fight in a side-scrolling environment.  Its fun to play with friends, guaranteed to make u laugh!",
            "review_score": "1"
        },
        {
            "review_text": "Fast, Simple, and Fun gameplay. Had a good time playing single player, and infinitley more fun playing multiplayer.",
            "review_score": "1"
        },
        {
            "review_text": "Best game that causes you and your friends to hate eachother since Mario Party.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing but since the last update me and my friend sometimes like both kill eachother on our screens and both just run to the final screen and when someone wins the other one's game freezes. it should be reproducable by playing for 15 minutes since it seems to be a commom problem. please fix.",
            "review_score": "1"
        },
        {
            "review_text": "Nidhogg is a small game developed by an indie developer Messhof. While the game isn’t the longest one I have ever played, it is definitely THE best local multiplayer game I have played in a long time. You can literally spend countless hours playing the local multiplayer against your friends.  In Nidhogg there is only one objective , kill your opponent by out-stabbing them by using only three sets of stances, high, middle and low. Maneuvers such as, rolling, dive-kicking, neck-snapping and sword-throwing are also at your disposal. While it may sound simple at first, the game is really hard to master, and sometimes it gets a little bit frustrating when you get stabbed couple times in a row.  After you kill your enemy you have to run to the right in order to advance to next level, the enemy can do the same thing, if you get killed, he can run to the opposite direction, this will get you back to the previous screen, and this gets really annoying because sometimes the enemy instead of fighting you, will just run past you just to get you back to the previous screen. Each ‘level’ is divided into couple smaller ones. In single player, there is a total of 17 AI opponents, the first one being the easiest and the last one, the toughest(I don’t know if that’s true but when I’ve played it, the game got harder every time with each AI opponent). At the end of each level your character is eaten by a giant dragon-like creature, by the name of Nidhogg, you can’t avoid it though(trust me, I’ve tried), I don’t know what’s the point of that but It’s kind of hilarious and random.  The art style is what I love the most about this game, it has that surreal look to it, kind of like Hotline Miami. The player animations are also worth mentioning because of how smooth and realistic they are, and also it feels really satisfying when you stab someone.  On the other hand, the game also has some flaws, one of them is the online multiplayer, it is seriously lacking in features and is very unstable, I kept being disconnected from matches, and I have experienced serious lag during several online matches. You can’t even properly communicate with your opponent because the chat can’t handle longer messages.  As I have said before, the single-player consists of 17 AI opponents, which is great but the same can’t be said about the level variety, there is only 3 or 4 different levels which are re-used during the 17 battles in the single-player. I really wish that there was more variety in level design, maybe we’ll get them in later updates.  Nonetheless, If you enjoy playing games with your friends then this game is for you but If you don’t like the local multiplayer I would still recommend sure the game isn’t very long, but the multiplayer is still there, it might be a bit lackluster but who knows maybe the devs will add some new features to the online multiplayer.",
            "review_score": "1"
        },
        {
            "review_text": "Competitive entertainment at its most simple by design.",
            "review_score": "1"
        },
        {
            "review_text": "This is true esports.",
            "review_score": "1"
        },
        {
            "review_text": "All glory to the Nidhogg",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥♥♥s with swords 10/10 would steal again",
            "review_score": "1"
        },
        {
            "review_text": "Incredibly original, exilerating multiplayer experience.",
            "review_score": "1"
        },
        {
            "review_text": "This game reminds me of puppies, like its so smooth and cute",
            "review_score": "1"
        },
        {
            "review_text": "A tight, simple, multiplayer FENCING game. Only 2 buttons and your movement keys are needed, or joystick if you're using a controller. Definetely a game better with an X-Box or Logitech controller. A few gripes, there are this strange black bars along the sides of the screen, which you can never rid. Also, very little customization options, no windowed mode, pretty sure you can't change the controls as well, although they're so tight there's really no need. All in all, pretty good find, the price though is a little steep at $17, but if given an update, adding features would make it more bearable. 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "An absolutely insane 1 v 1 game about fencing. The controls are simple yet give enough complexity to allow someone to really become a master at them. An insane tug of war that's great for parties, especially with the tournament mode. I highly recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "Cool little fast-playing sword-fighting game. Reminds me of 80's arcade games, but the multiplayer (two play simultaneous or Online) really makes it. Pull off amazing sequences like a pro one moment, snatching the opponent's sword, diving behind them, picking it up, stabbing them. Then next time, somersault across the floor into the blade by accident.  Great fun and well worth a few quid.",
            "review_score": "1"
        },
        {
            "review_text": "Please add Blood on/off and a 4-Player Last Man Standing mode please!",
            "review_score": "1"
        },
        {
            "review_text": "An intense and difficult singleplayer mode and fun sword fighting mode with your friends. Defenitley recommend to either tryhard or kickback with. ￣ω￣",
            "review_score": "1"
        },
        {
            "review_text": "Best to play it on the same keyboard with another person, the mistakes each one makes and the tension built by the urge to cheat by pushing them off the computer is great, online there are only perfect players that make it less fun.",
            "review_score": "1"
        },
        {
            "review_text": "The premiere fencing simulator! The best way to describe this game is 1v1 fencing tug of war, something that makes no sense without actually seeing the game. With the extra game modes, this game has endless replayability. It also has good online multiplayer as well as pretty good ai for the single player, but it is best played 1v1 local, so you may see the anguish of your opponent as you stab them, jump over them, then run for dear life as you win! Far too much fun to pass up. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "what is going on in online multiplayer",
            "review_score": "1"
        },
        {
            "review_text": "what is going on in online multiplayer",
            "review_score": "1"
        },
        {
            "review_text": "so fun and really good local multiplayer",
            "review_score": "1"
        },
        {
            "review_text": "great game but you can't play world wide players well i can't if it is in there then sorry!",
            "review_score": "1"
        },
        {
            "review_text": "Nidhogg is really enjoyable fast-paced dueling game, where two players sword fight in a side-scrolling environment.  Its fun to play with friends, guaranteed to make u laugh!",
            "review_score": "1"
        },
        {
            "review_text": "The game that kills friendships",
            "review_score": "1"
        },
        {
            "review_text": "Fight for the chance to sacrifice yourself to the nidhog. Very enjoyable, and very fast paced. Always be ready for a random attack. Glad i bought this game!!!",
            "review_score": "1"
        },
        {
            "review_text": "THE NIDHOGG MUST FEED. A SNACKRIFICE AWAITS. The question is, will it be you, or the other guy? Nidhogg is ostensibly a fencing game. But this appraisal is kind of misleading; it's definitely a game that features fencing, and the fencing is both simple and intense in the way many early-era 2 player games were (like Swashbuckler and Championship Karate). But there are a number of things going on here that you wouldn't see anybody getting away with in a proper fencing match, and that's where things start getting interesting. Throwing swords, sweeping the leg, and jump kicking the other dude in the chest are among the other tricks the Yellow Swoardsman and Orange Swordsman have at their disposal. But wait; the match isn't won when your enemy's body is at your feet. Victory is only achieved by reaching the end of the level, far past your nemesis' starting position. And you'll find several more of him waiting where the first one came from. So it's like fencing, even when it contains things other than fencing. Nidhogg is a must-play for anyone with a friend to play with, or hell, train your cat extremely well and play it with him.",
            "review_score": "1"
        },
        {
            "review_text": "its pretty fun ",
            "review_score": "1"
        },
        {
            "review_text": "READ THIS BEFORE YOU BUY. Presonaly this game is greate fun but only with friends, if you are a lone wolf dont read more and dont buy this game, i play only with my friends and the only time i played alone got bored, but with friends its a lagh of, it is missing a ton of content and updates or much more things the game could have but dosent. GOOD THINGS: -Its intense fun with friends. -Laugh all the time. -PvP fun. -great smooth gameplay. BAD THINGS: -only 4 short maps. -single player sucks. -only 3 game modes (multiplayer, singleplayer and tournament) -lack of updates.  Basicaly its a greate game but only with friends, i had a ton of fun so i gotta give the game a nice feed. -7/10 would play with friends.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely awesome, stab your opponent enough times and you can get eaten by a giant worm! One of the most entertaining 2 player PC games out there, wildly fun! Highly recommend this.",
            "review_score": "1"
        },
        {
            "review_text": "If you like 1v1 battles against your friends while enjoying a beer, grab this. It makes you jump the couch and curse like an angry scotsman. Its not 'the quicker you mash the buttons the faster you win', its a lot about timing, action and reaction. Great fun and the controls are easy to master. This game does not have the variety that makes you addicted for hours, but it certainly will be a good option at each gaming session.",
            "review_score": "1"
        },
        {
            "review_text": "Atari-tier murder fencing, I approve! In addition, the focus on positioning as a means to fulfill your victory condition is an interesting choice for a game's standard mode of play. While this is a game containing combat, it is moreso a game of competitive movement management. While it has some problems, mostly collision properties on the win screen, none of them seem to interfere with the core gameplay. I am of the opinion that Nidhogg is a simple but elegantly designed piece.",
            "review_score": "1"
        },
        {
            "review_text": "An amazing fencing game, this is most easily compared to the equally good Samurai Gunn, with fast paced combat, just replace katanas and guns for fencing, and japanese people for fully colored Nigel Thornberries",
            "review_score": "1"
        },
        {
            "review_text": "'EN GARDE F-UCKBOI.'  'HOW THE F-UCK?'  'WHAT THE F-UCK? HOW?'  'F-UCK YOU.'  'YOU'RE F-UCKING CHEAP.'  And many other quotes I have said while playing this with a friend.",
            "review_score": "1"
        },
        {
            "review_text": "An amazing game that tests the skills of every gamer. The only problem I have is that I can't continue after a singleplayer match. Other than that worth a buy",
            "review_score": "1"
        },
        {
            "review_text": "This game is really fun. I haven't played with it locally with friends yet, but i laugh and yell at the screen when playing it by myself, so i'm sure it will be a fantastic game to play with a bunch of friends at your house. The tournament mode will add a lot of fun to the local experience too. The only downfall to this game i see so far is the lack of an online community. I know it just came out on steam but whenever i search for an online match it says only 3 or 4 people are online. I find this disturbing since this game is fun as hell. Hopefully it will pick up.",
            "review_score": "1"
        },
        {
            "review_text": "Alright we been waiting for this game to come out in awhile already and they been pushing this game back when it will come out. I must say i think they did hell of a good job on the game controls and how they made it llike a old school game. AKa my first 2 games i played was the first doom and James Bond games. It sure made me feel great when i logged on this game. Don't let the looks of this game fool you....its a hard.....you need to out think you enemy in a sword fight. What makes this game really cool if you play pirates of the caribbean theme song in the background...then its amazing....  I will give it 10/10 and a Hell Yea Badge to it....I must say this game is awesome and I think this is a great buy.",
            "review_score": "1"
        },
        {
            "review_text": "The combat is ridiculously nuanced and satisfying. Sure, there's not much content, but the combat is just so good. Grab it on sale, for sure.  My gaming friends had been looking for a fighting game to turn to as our standard duke-it-out kinda game. We'd tried SF4, Injustice, and MK9. One guy picked Nidhogg up on PSN, and it's become the game we were searching for. You don't need a huge cast of characters, you don't even need much in the way of graphics. Just make the combat mechanics solid.",
            "review_score": "1"
        },
        {
            "review_text": "This game is rather fantasticly genious. A true gentlemans sword fighting game. Its a small amount of data for a large and intense experience. This game truly only shines with friends.",
            "review_score": "1"
        },
        {
            "review_text": "This is the greatest How did I do that of All Time.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "I strongly recommend this game. Even with the people complaining about lag in the forums, I played it with my friend and had no problems at all. And being a huge fencing fan, I think this game is perfect in the format it was made. You really need to approach the fight strategically or you'll get your derrière sistematically handed to you. The game is one hit kill when armed with sword and when disarmed if your opponent strikes you on the ground he'll snap your neck and kill you, but this is just a mean to an end, since your main goal ain't to kill your opponent but to get to the last screen you need to push to be devoured by the mythical serpent Nidhogg, hence the name of the game, and to do that you need to kill you enemy and move forward through each screen, being lead to a fence-fueled tug of war. And the graphics, soundtrack and sound effects match the game perfectly and until now I didn't experienced any major flaws on the gameplay of the game which is fluid and easy to get the hang. The single-player can be fun enough, but the game really shines in the multiplayer, the local versus can make for a really neat party game. So scrap some cash and buy this gem.",
            "review_score": "1"
        },
        {
            "review_text": "I jumped off a wall and killed a black man. 11/10 worth it.",
            "review_score": "1"
        },
        {
            "review_text": "The adrenaline will fly as you try to overtake your opponent in Nidhogg! The object of the game is to reach the other side of the map, to which there are seven sections; the only thing stopping you is your little set of legs and your adversary. There is a surprising amount of depth to this one on one side scroller, despite the only controls being jump, attack and the directions. You can hold your sword in three positions: high, medium, or low. Where you hold the sword dictates what attacks you will block.    All throughout you will have to make split-second decisions, and those decisions are what make the game so addicting. At times, you will be convinced that you have felled the enemy, only to be rolled into and killed. These are the defining moments of Nidhogg; while your jaw is on the floor from the surprise, your stinker of a roommate hoofs it to the goal.",
            "review_score": "1"
        },
        {
            "review_text": "Oooh, this is a clever little game we have here that essentially covers a 9 stage long map focusing on fencing and running for your life. Nidhogg is a tug-of-war game that relies on basic movement and attack mechanics (literally, there are 6 controls) to simulate fast-paced fencing and brawling combat in a race to be devoured by the beast called, 'Nidhogg'. While the end result of winning is less than appealing the gameplay itself is very clever, as players are constantly able to change their way of playing to adapt to their opponent's play style, and the cute graphical style while sometimes can be an eyesore (prime example being the pre-game chat, it's basically impossible to tell the letters apart.), it usually has this sort of retro charm that makes you want to wash the floors with your opponents blood once more. So, do I reccomend this game? Yes. Will I continue to play it for years to come? Yes.  -WolfEpiphany",
            "review_score": "1"
        },
        {
            "review_text": "You fight to the death...to sacrifice yourself.  To the death.  Sacrifice.  ...  Best game ever.",
            "review_score": "1"
        },
        {
            "review_text": "Grab two controllers and waste hours yelling at each other. Great pick-up-and-play fun.",
            "review_score": "1"
        },
        {
            "review_text": "  Amazing game! My friends hate it though because they claim, that I'm too good. This makes me happy.",
            "review_score": "1"
        },
        {
            "review_text": "Me and my brother only got bored after playing 1 hour i really suggest this game i just hope for more maps in a update or dlc",
            "review_score": "1"
        },
        {
            "review_text": "BEST BALANCED PVP-GAME!  if you think you are a great pvp-player then get this game and show your wickness.  the graphics are better as the 'Next-Gen' graphics from Xbone and PS and it runs at 60+ FPS (no tearing, smooth etc...).  you will need a controller for the best game experience.  break some necks... ",
            "review_score": "1"
        },
        {
            "review_text": "This game is great when you have guests or friends coming over, although this game is a game you don't play everyday, it's a good game to keep especially when guests come over. You can even make your own custom tournaments (not literally) such as when five people are at your house you just pretend to make a branch. Fun game but just a type you wouldn't play a lot.",
            "review_score": "1"
        },
        {
            "review_text": "It's a great game to play with a friend, or just someone random. While it's appeal doesn't last too long, it's great to hop on for a few rounds, and just have a blast.",
            "review_score": "1"
        },
        {
            "review_text": "The greatest fighting game that ever was or will be.",
            "review_score": "1"
        },
        {
            "review_text": "Better graphics than Sonic Boom.",
            "review_score": "1"
        },
        {
            "review_text": "I always enjoy stabbing my friends in the face.   Its got giant snake monster thingies too!!!   Worth..money..must spend..$$ ",
            "review_score": "1"
        },
        {
            "review_text": "This game is absolute genius. Very simple rules, about as gory as gory gets and with an amazingly high skill ceiling. An absolute must.",
            "review_score": "1"
        },
        {
            "review_text": "You fight to the death...to sacrifice yourself.  To the death.  Sacrifice.  ...  Best game ever.",
            "review_score": "1"
        },
        {
            "review_text": "A great party game in itself, but doesn't come with enough content to justify a $15 price tag. Get it on sale.  ",
            "review_score": "1"
        },
        {
            "review_text": "I HAD A FRIEND.",
            "review_score": "1"
        },
        {
            "review_text": "The game that my girlfriend and I are evenly matched in. The butt clenching is real and the button mashing can be evident. Nidhogg is one of those games that remind you of classical combat games in an arcade, it is one of the best indie platformer sword fighting games on the market at this price point. Saying that I think it is the only indie platformer sword fighting game around this price point.",
            "review_score": "1"
        },
        {
            "review_text": "This is the worst game I have ever enjoyed my ♥♥♥ off for many hours to. Buy it for everyone you know. 10/5",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME IS SO FUN!!!!!!!!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Best fencing-themed worm feeding simulator ever made.  Great two player hilarity, surprisingly nuanced gameplay, and well balanced.",
            "review_score": "1"
        },
        {
            "review_text": "This game is absolutely amazing and you should definitely add it to your Library because you will play this until your eyes and fingers bleed.",
            "review_score": "1"
        },
        {
            "review_text": "This game is so much chaotic fun, especially with friends",
            "review_score": "1"
        },
        {
            "review_text": "Nidhogg is a two player fencing duel to the death, where each player attempts to defeat the other repeatedly as they head to the opposite side of the stage from their starting position to be eaten by the dragon at the end of the world. No, really. There's a single player mode, but it's not where the game shines. The AI is unpolished, as it occasionally goes dumb and lets you mow it down. Far better is beating a friend in person. The netcode for the game is currently (as of release day) a bit rough and confers quite a host advantage at the moment.  Don't let that deter you. Grab it now while it's 20% off and get to stabbin' your friends!",
            "review_score": "1"
        },
        {
            "review_text": "Great game, simple and fun.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun",
            "review_score": "1"
        },
        {
            "review_text": "Stab out of stab.",
            "review_score": "1"
        },
        {
            "review_text": "Nidhogg is a fun split screen multiplayer despite the cheap and lazy art design. The games are quick, fast, and enjoyable to play with friends. When I find games like these with great mechanics I wonder if the devs just got lucky amongst a sea of indie games or they have some talent. Either way this game’s mechanics are solid and fun. I got this game for $1 in a humbe but I enjoy it enough that I would recommend purchasing it for as much as $3.  I give this a 5/10. It would have been a 7/10 if the graphics were better. If this game had a sequel with more content and more polished graphics I’d buy it. ",
            "review_score": "1"
        },
        {
            "review_text": "THe simplistic trappings hide the most nuanced and fun fighting game i think i've ever played. Get it! Get it now!",
            "review_score": "1"
        },
        {
            "review_text": "I give it a 9/10. It can get boring at times, but i always find myself coming back to it again and again.  It has never felt better to slice a baddie in half.",
            "review_score": "1"
        },
        {
            "review_text": "This game is coo. I played it with my niggs and we both LMAO our asses off. It was so cool while we were tipsy and I would rate it 10/10 would 10 again",
            "review_score": "1"
        },
        {
            "review_text": "killed by worm 11/10",
            "review_score": "1"
        },
        {
            "review_text": "get it if its on sale, not worth 15$",
            "review_score": "1"
        },
        {
            "review_text": "Stab people. For fun.",
            "review_score": "1"
        },
        {
            "review_text": "The best game on Steam. This is a gamer's game. Pure competition, no frills.",
            "review_score": "1"
        },
        {
            "review_text": "Cool game, online lags like hell though...",
            "review_score": "1"
        },
        {
            "review_text": "amazing and addictive game, although after a while it can get boring as matchmaking does not work ",
            "review_score": "1"
        },
        {
            "review_text": "Unless you have a friend to play with, you should probably avoid this game.  I bought this for me and a buddy and we're having a blast. But the online matchmaking is basically dead. I've only seen 2 people MAX searching for other players in matchmaking.",
            "review_score": "1"
        },
        {
            "review_text": "for $1.49 its def worth it. buy it on sale and make sure you and your friend have a good connection.",
            "review_score": "1"
        },
        {
            "review_text": "Nidhogg is perfect example that fighting games can offer more variety than what most of its competition would lead to believe.  The game is ultimately a game of tag with the objective being to run to your goal. You become 'it' when you defeat your opponent or they suicide. Whenever you die or trail off-screen, you will generally respawn in your opponent's path a few moments later. When you spawn, you are given a fencing sword to use in combat with the other player, but you can also fight unarmed if you throw your sword or you can also pick-up a sword dropped earlier on that section of the stage map. There is a decent variety of options that are simplistic in execution but add a lot of depth to the game, especially when used in conjunction with the terrain of the stage.  I highly recommend this game to anyone who enjoys versus multiplayer games, not just fans of the fighting game genre.",
            "review_score": "1"
        },
        {
            "review_text": "Reminiscent of (the original) Prince of Persia sword fights; only much faster and with versus multiplayer. Don't let it's simple concept and graphics fool you, this game is unbelievably fun. You'll be laughing your ♥♥♥♥ off at fluked victories and fumbled suicides as you play against your friends. Nidhogg is a great example of mechanics (gameplay) over aesthetics (graphics), proving that being FUN TO PLAY is the single most important part of game design; these developers could teach Square Enix a thing or two... but don't get me started on that old chestnut.",
            "review_score": "1"
        },
        {
            "review_text": "Invited my friend over and won every time   10/10-IGN",
            "review_score": "1"
        },
        {
            "review_text": "Cut down your enemy. Become Níðhöggr.",
            "review_score": "1"
        },
        {
            "review_text": "Worst game ever! I can't even replace my characters dinger with the sword.  poo/01  send me money  ",
            "review_score": "1"
        },
        {
            "review_text": "Amazing. Fun. Expendable. Showoffs. Rage. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Very Fun...expecially with friends.",
            "review_score": "1"
        },
        {
            "review_text": "Just finished my first 25-minutes-long 2-Player-faceoff...  Epic.",
            "review_score": "1"
        },
        {
            "review_text": "Fun, addictive, easy to get the hang of but difficult to master.   Half decent breakbeat sound track and one map looks pretty trippy.   Could imagine playing this with a friend would be funny.",
            "review_score": "1"
        },
        {
            "review_text": "The ultimate Sword vs You chase.   The sword is faster.",
            "review_score": "1"
        },
        {
            "review_text": "I don't know why i bought this game, I don't how to describe this game and I don't know why this game is so addictif.",
            "review_score": "1"
        },
        {
            "review_text": "Simple, yet addictive gameplay blended in with a great soundtrack and beautiful sidescrolling environment.",
            "review_score": "1"
        },
        {
            "review_text": "the most fun i've had trying to sacrifice myself to a giant worm diety",
            "review_score": "1"
        },
        {
            "review_text": "Nidhogg is a really fun 2d couch brawler it won't keep you occupied for long periods of time solo but it's a great game to pull out and play vs some friends.  I would recommend playing on a TV with controllers.  Max 2 players at a time but it has a tournament mode for 3-8.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun, but only if you have a friend to play with.  Online is pretty dead, but still good to play by yourself.  7/10",
            "review_score": "1"
        },
        {
            "review_text": "LAN fencing in Nidhogg is officially the best party game ever. Nothing more needs to be said. ... *draws sword*",
            "review_score": "1"
        },
        {
            "review_text": "Glory to the Nidhogg",
            "review_score": "1"
        },
        {
            "review_text": "Definitely should buy this game if you have someone to play it with. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Nidhogg is a fast paced fencing game, the duels you have throughout each stage are filled with tense action packed moments. This game is great to play with friends and can offer hours of fun. The singleplayer 'campaign' is decent and can be a challenge for new players, but once you get reasonably good at it you will have a thirst for pixelly blood that canb only be sated with the blood of near and dear friends. I have no regrets from killing any of them. 9.5 / 10 Wouldn't advise ACTUALLY killing your friends as that got me quite the prison sentence...",
            "review_score": "1"
        },
        {
            "review_text": "What an absolute blast. We played this game on our Beer and a Game, Partay Saturday video for Rogue Ocean Gaming and it was a complete blast. Not a complex game by any means, if you enjoy a fun local co op game, please check this one out!          YouTube™ Video:  ParTay Saturday - Nidhogg&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "srtlbmhihe'otihbmj'w5ohkwh",
            "review_score": "1"
        },
        {
            "review_text": "Worth every penny!",
            "review_score": "1"
        },
        {
            "review_text": "dude this game is sick",
            "review_score": "1"
        },
        {
            "review_text": "This game keeps showing a black screen that won't respond to anything. No sound or anything, just.. black. I have a Mac OS X version 10.6.8.  3.06 GHz Intel Core i3 processor and plenty of memory. Is there ANY way I can fix this?",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game for friends. You can play it through twice and by then you've had enough of the single player. The charm of this game is it gameplay. Bottom line: This game is not worth $14.99. True that it's quality is worth that, but how a gamer feels justified with their purchase after they've experienced the game, you will be satified if you paid in the real of $4.99. A quality game. Just wish there was a little more to it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a must play. Very intense gameplay with quick back and forth, very fun competitve action. If you haven't played this game then you don't know what you're missing. The game has only a few core features, but each is important and serves its purpose. With only two buttons you have the deepest combat experience, without all the fat of other fighters like SSF4 or KOF.",
            "review_score": "1"
        },
        {
            "review_text": "Needs more players online.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun, but only if you have a friend to play with.  Online is pretty dead, but still good to play by yourself.  7/10",
            "review_score": "1"
        },
        {
            "review_text": "Now I can kill my friends and not get in trouble!",
            "review_score": "1"
        },
        {
            "review_text": "Really REALLY fun with friends, make sure you pick up two gamepads before you play it.",
            "review_score": "1"
        },
        {
            "review_text": "Playing this with a friend will probably lead to raised voices and lots of vulgarity. Lots of fun. Great for local play, somewhat laggy online. Not worth $17, buy on sale.",
            "review_score": "1"
        },
        {
            "review_text": "You're not going to get much more than what you see here, but what there is is a well made extremely tight 2D platformer fencing simulator that is extremely fun to play with friends, maybe not as interesting against a CPU, recommend picking it up on sale because that price is pretty high for something with so little meat, even if it is quite tasty",
            "review_score": "1"
        },
        {
            "review_text": "I really really like this game. Buttt.......it's almost unplayable due to the extreme amount of lag online that you experience if you're not lucky enough to be the host. Other than that 10/10, really. I love the sword fighting mechanics, the different stratedigies, the way the game is won. All perfect. Except for the unbearable lag.",
            "review_score": "1"
        },
        {
            "review_text": "this game is SWAG!!!!!!!!!!!!!!!!!!!! ",
            "review_score": "1"
        },
        {
            "review_text": "Crazy game ! Awesome soundtrack !",
            "review_score": "1"
        },
        {
            "review_text": "This game is probably one of the best local multiplayer games you can buy on steam. Its a ton of fun and i definitely recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "this game is great. the combat is really fun and sometimes looks like something out of a movie! i've had some really great fights and it's awesome for parties. would recommend without a doubt.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best local multiplayer games I've played in a long time.",
            "review_score": "1"
        },
        {
            "review_text": "This game is #1.",
            "review_score": "1"
        },
        {
            "review_text": "Nidhogg is a rare title that has an even more unique popularity. It's the kind of game that has been more likely spread via word-of-mouth than anything. And for good reason, it's a fantastic game. Now, on the surface you might see pictures and think: ''Well, damn. This looks very basic, very retro -- I can't gouge out if the gameplay is good or not!'' But once you so much as take at let's play videos or even a few trailers, it becomes immediately apparent that this game - Nidhogg - is 100% unfilitered crazy gameplay.  In a nutshell, it's an extreme tug-of-war situation with fighting mechanics very similar to Joust, old school Prince of Persia and even a few beloved flash game titles like the XiaoXiao games and animations. Players are welcomed right off the bat with a very clean, very informative tutorial that teaches them how to fence, how to thrust, how to divekick and how to NIDHOGG.  There's 4 levels and an arcade ladder with a time attack incentive. So, you're wondering how the multiplayer is, right? The game looks and plays amazing but how will it fare for you and your online buddies? Well. Not very good. Every game has it's flaw, and unfortunately Nidhogg has an extremely flawed netcode. That is to say, it's more than lag. It's actually client/host biased. Depending on who is the host determines who gets a seamless performance, if you're the client, then you will experience the worst latency and detection possible. It's unplayable.  I have hope this will be fixed in the future, however. Nidhogg cost me around £12, like $20 in US. It would have been worth the asking price if (and only if) the online multiplayer was fixed. My final advice: If you plan on playing with friends over a few beers in real? Buy it. If you plan on playing over skype with buddies across the world? You may want to wait a while.",
            "review_score": "1"
        },
        {
            "review_text": "fun simple game, really fun to play against friends",
            "review_score": "1"
        },
        {
            "review_text": "A super fun local co-op game. Played it once and was sold. Low skill requirement. Lots of hillarity to ensue.",
            "review_score": "1"
        },
        {
            "review_text": "Awsome fast paced game that will have u banging your head against the wall within 5 minutes and be back on the computer trying to beat the last npc in single player within 10 minutes",
            "review_score": "1"
        },
        {
            "review_text": "really easy to pick up, really really hilarious.",
            "review_score": "1"
        },
        {
            "review_text": "I thought it was a orchestral conductor simulator, I killed all my friends.",
            "review_score": "1"
        },
        {
            "review_text": "The game is very fun, but very frustrating, while the $15 prie tag is VERY big for a game like this, it should be $5 no problem, its a very fun game to play, impossible to master, you will love to hate it, however I recommend you play the game with a controller as on a keyboard, it made my hand cramp up.",
            "review_score": "1"
        },
        {
            "review_text": "stupidly good fun and is an intense and fantastic game to play with friends, £11 is a bit much though, but its well worth it for the never ending fun you can have on it",
            "review_score": "1"
        },
        {
            "review_text": "The stabs are real in this game. After a bit of playing and dying the ground looks like somebody ate 5 million crayons and had diahrea on it. 10/10  P.S. You have to start each fight by dancing, then throwing your sword immediatly like a scumbag.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Deceptivly simple yet incredibly fun game, squaring off against an opponent can get very intense and pave's the way for crazy swordfighting action. grabbed it while on sale, very pleased.",
            "review_score": "1"
        },
        {
            "review_text": "Simple, yet addictive gameplay blended in with a great soundtrack and beautiful sidescrolling environment.",
            "review_score": "1"
        },
        {
            "review_text": "Still waiting for that lightsaber DLC...",
            "review_score": "1"
        },
        {
            "review_text": "Best LAN party game ever.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games to play with friends. It is simple to understand and so much more complex if you want it to be. The level of strategy involved is amazing coupled with good laughs and yells from friends watching waiting for their turn to take a stab at the winner or loser or however it is your playing. Its just a damn good time. My only wish though is that while there are plenty of options to tune the game how you want that they maybe include 4 player multiplayer for ♥♥♥♥♥ and giggles and maybe more stages, but that is just a wishlist of ideas.",
            "review_score": "1"
        },
        {
            "review_text": "I know it says i only have 6 and a half hours on this game but i probably have about 20 because i play this game whenever im not at home (airplane, school) this game is a great game to play friends who are at your house or at school",
            "review_score": "1"
        },
        {
            "review_text": "If you go into the game thinking it's going to last you a long time you won't care much for it, the mechanics are simple and if you have a competitive friend who you want to just one on one dual with for a warm up to another game, go for it. I typically played the game as an appetizer before jumping into another experience. Worth my $1.49 just for that.   +Game isn't that long, but still amusing -Can get very repetitive quick.",
            "review_score": "1"
        },
        {
            "review_text": "I seriously don't get the point of this game... But damn it's fun!",
            "review_score": "1"
        },
        {
            "review_text": "This game is just some good old fun with friends. I highly recommend it because tournaments can get pretty intense.",
            "review_score": "1"
        },
        {
            "review_text": "Glory to Nidhogg!",
            "review_score": "1"
        },
        {
            "review_text": "A random swarm of pixels that seems to be a fencing simulator. The movepool is ridiculously simple and yet it's so much fun to play ! I definitely recommend it !",
            "review_score": "1"
        },
        {
            "review_text": "Game is worth about $10, play it with a friend or alone, you will laugh out loud. Seriously.  8/10 +Great style, silly concepts, tight controls -Only 4 maps, can't change multiplayer color despite NPCs being able to be different colors",
            "review_score": "1"
        },
        {
            "review_text": "This is the most honorable of games. Challeneging your friends to a 1 on 1 fencing match either online or LOCALY, as in, on the same keyboard. You will duke it out on the field of honor in lovely pixelated garb to see who is truely the better man; and, when i speak of 'honor' and 'being the better man' I ofcourse mean throwing your sword like a ♥♥♥♥♥ then beating the ♥♥♥♥ out of your oponent if he survives...  HONOR!",
            "review_score": "1"
        },
        {
            "review_text": "This game is definitely made to be played with friends in mind. If you are looking for a fun game for you and your friends to goof off in, this may be a game you would enjoy. The asking price of $15 is a bit steep i think for this game. If possible, try and get it on a sale.",
            "review_score": "1"
        },
        {
            "review_text": "Thust! Parry! Lunge! Riposte! Slash! Get eaten by a giant worm!  This just replaced Smash Bros as my favorite party game.",
            "review_score": "1"
        },
        {
            "review_text": "really challenging but so rewarding. It's a game that actually makes you feel skilled, while there is the ocassional lucky strike, most of the time taking down an enemy relies on skills and techniques that you learn yourself. The mechanics of this game are brilliant, there is one key for an attack but so many possibilities and combinations for attacks it will take a while to master and fully understand the game.  One of the most stand out games I've played in a long time. I will say this though, set up your own controls. The control settings as they stand are designed for two people to play using the same keyboard, after some minor tweaking you'll find the optimal set up for yourself.",
            "review_score": "1"
        },
        {
            "review_text": "This is a must get game. It is so fun and has an awesome friend challenge feature and a cool single player...",
            "review_score": "1"
        },
        {
            "review_text": "THE BEST GAME EVER!",
            "review_score": "1"
        },
        {
            "review_text": "This game is incredibly fun, with very unique mechanics and a nice art style.  Two things to note before you buy: 1. Currently its $15, this is way to much money, I am pretty sure it used to be $5. If you can get it on sale, go for it, $15 is way to much for what you get out of this game 2. The networking usualy works fine, but i have had strange lag incedents were i acctually lost the round.  Overall fun game, not worth $15 dollars and with @#!&amp; networking.",
            "review_score": "1"
        },
        {
            "review_text": "Nidhogg is the perfect competitive 1v1 party game. It's like N+ style platforming with the  'trash talk'  competitive nature that Smash Bros. brings. 10/10, i have absolutely no complaints. most fun i've had with an indie game in a while! well worth getting.",
            "review_score": "1"
        },
        {
            "review_text": "Deceptivly simple yet incredibly fun game, squaring off against an opponent can get very intense and pave's the way for crazy swordfighting action. grabbed it while on sale, very pleased.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 BEST SWORD GAME IN THE WORLD!!! COME ONLINE AND FIGHT ME",
            "review_score": "1"
        },
        {
            "review_text": "Its a really good game, except the multiplayer has issues if there are people on to even play with. If you have people to play with in house 10/10",
            "review_score": "1"
        },
        {
            "review_text": "It's a fun game to have, but don't you dare buy this full price, it's nowhere close to worth a whole $15, just hold out until it goes on sale",
            "review_score": "1"
        },
        {
            "review_text": "A fun fighting game that reminds me of The Bushido Blade series but if it were on the NES. A great game for parties.",
            "review_score": "1"
        },
        {
            "review_text": "Pros: -Atari 2600 graphics are on point -Combat is quick, precise, and never gets old (which is surprising)  -Nidhogg is the greatest name for anything ever -Frog Parrying   Cons: -Network lag can be a huge game breaker if the other player doesn't have perfect connection -Only a few stages (but then again if they were going for the true 2600 feel...then I guess they succeeded)",
            "review_score": "1"
        },
        {
            "review_text": "Surprisingly complex combat and innovative gameplay. I picked this up for $1.50 during the sale and I would wholeheartedly recommend it at that price. Online multiplayer seems to be spotty, but playing local multiplayer is really fun. Not worth full price, but for sure a great pickup on deep discount.",
            "review_score": "1"
        },
        {
            "review_text": "Really great game but even better local than online",
            "review_score": "1"
        },
        {
            "review_text": "I thought it was a orchestral conductor simulator, I killed all my friends.",
            "review_score": "1"
        },
        {
            "review_text": "Surprisingly well done mechanics. Fun time waster. Single-player is boringly repetitive after awhile, but could be great fun to play with a group of friends.",
            "review_score": "1"
        },
        {
            "review_text": "I highly reccommend this game. I have tons of fun with it. This game takes one or two concepts and perfects them. Thank you for making this game, 5/5.",
            "review_score": "1"
        },
        {
            "review_text": "Really simple but cool game. One of those easy to learn hard to master things. Graphics are very interesting; I liked them but they're a matter of taste. Music is fitting and didn't annoy me. Great game imo.",
            "review_score": "1"
        },
        {
            "review_text": "Great game 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I was looking for a local co-op game, and Nidhogg (and it's spin-off, Eggnogg) were both great in filling that niche. Now that the genre is more fleshed out, this classic is great if you are willing to learn the nuanced controls.",
            "review_score": "1"
        },
        {
            "review_text": "Jackass Gladiators Simulator 2014  Soundtrack: 10/10",
            "review_score": "1"
        },
        {
            "review_text": "The price might throw some people but this game is seriously awesome.",
            "review_score": "1"
        },
        {
            "review_text": "We feed the all mighty Nidhogg!!!",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing 10/10 worth the money 100% replayability and fun through the whole game, i do suggest a controller to play.",
            "review_score": "1"
        },
        {
            "review_text": "The best dualing game i have ever played. Totaly worth the 14 euro's. The only con is the lag of levels and no players on the random internet matches. I still play it almost every day (in offline mode thats why only 15 hours it is almost triple now). Very good atmosfeer and style. This game is pure about skill wich i like a lot",
            "review_score": "1"
        },
        {
            "review_text": "great game",
            "review_score": "1"
        },
        {
            "review_text": "Nidhogg is definitely unique. It's a lot of fun to play in splitscreen, but the online matchmaking has never worked for me. Just fyi, you WILL make enemies playing this",
            "review_score": "1"
        },
        {
            "review_text": "FUUUUUN!!! (&amp; frustrating)",
            "review_score": "1"
        },
        {
            "review_text": "Pretty Fun solid game. Lacks content. would only buy on sale 75% or more. if you buy with to play with friends is the only real way to play.",
            "review_score": "1"
        },
        {
            "review_text": "Great offline game, with local support being the best option. Multiplayer is laggy and this is a game that is boring with lag and/or input lag. Single player is repetitive. One of my favorite games to play with my friends. I recommend it solely for the local support, but if you're into the other modes, fine. I bought it on sale, and I advise you do the same.",
            "review_score": "1"
        },
        {
            "review_text": "Stabbed my friend. Lost that friend. Got new friend. Stabbed new friend. Lost friend.  111/100 Would lose two friends again.",
            "review_score": "1"
        },
        {
            "review_text": "For all wanting to know about this game IT HAS MULTIPlAYER! Play with yor friends locally or on an internet connection STAB THEM! Dominate the enemy player with swordplay and divekicks DESTROY THE CPU! With a custom singleplayer mode for amateurs to professionals\\ WIN! Creat tourneys. UP TO 8 PLAYERS!  A FUN&lt; INTERESTING RETRO GAME FOR THENOOB TO STAR!!!",
            "review_score": "1"
        },
        {
            "review_text": "The nid to hogg the kill.",
            "review_score": "1"
        },
        {
            "review_text": "dank game only worth 70 per cent off sale price though!",
            "review_score": "1"
        },
        {
            "review_text": "Frankly, I didn't think it would be that great, but once you have a friend over and you both grab a controller each... it's just so fun. A must have for your party game library.  Perhaps 7.5/10: great gameplay, however you are limited to 4 arenas/stages.  If you're going forwards and backwards for 10-15 minutes with a mate and someone finally reaches the Nidhogg, the adrenaline will make you scream in unison 'This is the best game ever!!!'  ",
            "review_score": "1"
        },
        {
            "review_text": "There are a lot of people that say that there is no reason to play this game if you don't have friends to play it with you locally. I disagree, I enjoy playing the singleplayer and trying to beat my prior times. But if you're not that type of person and you want a more story driven game then I'll turn you away from this. Not to mention the graphic being 8-bit and a bit hard on the eyes at times, especailly when you get to the AI that change color. The game is fun to play in short bursts, but it loses it's edge after about 20 minutes. Though if you like games that make you go through a constant push to get to the end of a level, then this is probably the game for you. The soundtrack is okay, it's nothing I would listen to outside of the gameplay and the controls are sometimes iffy, I had to remap the control scheme due to the original being too confusing for me.  I give this game a solid 5/10.",
            "review_score": "1"
        },
        {
            "review_text": "One of the greatest competetive indie games iv'e played in a while. This a really good game to play with a friend + the controls are really simple to pick up. However the 'mod' mode isn't currently working but apart from that flawless and definitely worth the buy.",
            "review_score": "1"
        },
        {
            "review_text": "Oh you gotta get this game. Slashy cartwheels of doom, seal mode, and GTD? Gold.",
            "review_score": "1"
        },
        {
            "review_text": "Id have to say its avery fun 2 d fighting platformer!",
            "review_score": "1"
        },
        {
            "review_text": "Been stabbed in the ♥♥♥♥ so many times I don't think I'll be able to reproduce irl.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Fun to play with a friend on a boring Saturday night, just wished there were updates!",
            "review_score": "1"
        },
        {
            "review_text": "This game is the definition of hype. The most fun I've had with friends in a long time. I'm going to host so many tournaments, it's going to be the best.",
            "review_score": "1"
        },
        {
            "review_text": "Prince of Persia on crack. ",
            "review_score": "1"
        },
        {
            "review_text": "An amazing multiplayer fighting game. Absolutely worth picking up, especially if you have someone to play locally against, as that's really the way this game was meant to be played. Just be aware that the single player experience is pretty limited and there are only 4 stages, so you may want to wait for a sale if the amount of content doesn't quite justify the price for you. You can also get a Steam key through Humble if you want to support the developers more directly.",
            "review_score": "1"
        },
        {
            "review_text": "The price may turn you off for the amount of content you get, but if it seems worth it to you, either suck it up or wait for a sale because believe it IS worth it. Nighogg is one of the tensest and most easily accesible game I've played in years. The controls are simple and tight, and both players are on perfectly even ground. I have played matches with both friends as well as the CPU's, and they have varied in length from 20 seconds to 20 minutes on the same map. There is never a match where you aren't completely conentrating on winning, and you must utilize the few mechanics there are to achieve that victory. It is some of the best sword-play I have seen in any game, and you will hoot or holler at least once when you play with friends. There are only a few maps, and there's only one that can be considered 'Final Destination' level of even playing ground, as the few others have some sort of unique obstacles that clash with the core gameplay, but they all provide a slight and welcome variation in the same experiece. I've also had a bit of trouble getting matches to connect when trying to play online, but I'd hazard a guess and say it's because not that many people are trying to play online, so I can't reall call that a point against the game. Whatever little quibbles I have, the point I'm trying to make here is that if you need a game for one-on-one time with your pals, Nidhogg is one of the easiest to pick and most fun games you can find in that category.",
            "review_score": "1"
        },
        {
            "review_text": "pretty fun game to have with friends, but u got to be in the mood for it",
            "review_score": "1"
        },
        {
            "review_text": "Played for an hour so far, fantastic game! Trolling little sh*ts keep flipping and throwing their swords at me. Feels like it needs /something/ else in it, like button combos or something, or perhaps a 3D element so the players aren't too hard to distinguish from some of the environments.  9/10 - Love it, definitely worth it while its on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, but it's really multiplayer only.",
            "review_score": "1"
        },
        {
            "review_text": "THIS IS THE BEST FENCING SIM THAT COULD POSSIBLY EXIST. ALSO IT RUNS DECENT ON MY WINDOWS XP.",
            "review_score": "1"
        },
        {
            "review_text": "One of most fun arcade experiences i could get.  Its only made better if you have people to play it with.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. It's a great little time waster for when im bored and it also is a good brain challenger as it is very fast paced.",
            "review_score": "1"
        },
        {
            "review_text": "This little game is great, the few hours of intense gameplay were definitely worth the price.  HOWEVER: The multiplayer is a lot of times unplayable due to lag issues that result from poor optimization, which is a big negative. Also, the AI is pretty easy in general.  It's not worth full price but pretty much everyone is gonna get a few hours of great fun from it.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most minimalistic game but giving endless hours of fun !",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game. Simple controls without sacrificing depth. Easy to pick up and play. Great party game.  My only complaints is that it needs more maps.",
            "review_score": "1"
        },
        {
            "review_text": "All glory to the Nidhogg.",
            "review_score": "1"
        },
        {
            "review_text": "A very back and forth fencing game that is great to play with friends.",
            "review_score": "1"
        },
        {
            "review_text": "Honestly the greatest simplest multiplayer game for Mac!",
            "review_score": "1"
        },
        {
            "review_text": "LAN fencing in Nidhogg is officially the best party game ever. Nothing more needs to be said. ... *draws sword*",
            "review_score": "1"
        },
        {
            "review_text": "Mind Games at its finest",
            "review_score": "1"
        },
        {
            "review_text": "Awsome fast paced game that will have u banging your head against the wall within 5 minutes and be back on the computer trying to beat the last npc in single player within 10 minutes",
            "review_score": "1"
        },
        {
            "review_text": "i love this simple but hard fight",
            "review_score": "1"
        },
        {
            "review_text": "Nidhogg is one of those games that you really have to play to understand. You try to explain the game to somebody and you end up making it sound like a horrible game.  It is anything but. Nidhogg is an adrenaline fueled rollercoaster ride with fencing, karate moves, one-hit KOs and most importantly, dive kicks.  To even attempt to describe how hype this game is would be a crime. I purchased Nidhogg and my friends and I were playing it for two hours straight and yelling the entire time.  A must purchase.",
            "review_score": "1"
        },
        {
            "review_text": "Nidhogg is an 2D sword-fighter with tight controls and great replay value. The combat is adrenaline-pumping, and the music is very fitting. I have yet to play with friends, but if it's as fun as the single-player, I will not be leaving this game for a long time. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME IS REALLLY GOOD SH*T  I for one highly reccomend this game to anyone who has a friend they can play localy with because its the multiplayer that really sells this game.  why its fun:  the game nidhogg is fast paced and incredibly unforgiving at times while at others the sensation felt on the victory screen after the final showdown is like the equivelent of that found in no other game (outside of pummling invaders in darksouls)  Its gameplay is basic, your objective is to run one direction while halting the progress of your opponent who must advance the opposite direction. you have a very small set of moves (the game uses all of about 4 buttons) yet the combos and tactics you must instill to win are outright amazing.   I highly reccomend this game and hope for add on stages in the future (as the stages are the only lacking part of the game. ) or a way to play 2v2 or the likes. ",
            "review_score": "1"
        },
        {
            "review_text": "Extremely fun and awesome with a friend. Although with only 4 maps to choose from, I'd say it isn't worth the full price just yet. It also has a few bugs with matchmaking but nothing to annoying. I would definitley reccomend it, just wait for the sale ;)",
            "review_score": "1"
        },
        {
            "review_text": "Man, this game was very glitchy at the start but it will bring joy to your life. Abudant joy.",
            "review_score": "1"
        },
        {
            "review_text": "absolutely incredible fighting system, closest thing i can imagine is karate fighter from back in the day, only faster and prettier.",
            "review_score": "1"
        },
        {
            "review_text": "Really stupid game. Can't beat the worm boss and he is on every level. Stupid copy and paste indie game 0/10 not worth the time or money.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, but it's really multiplayer only.",
            "review_score": "1"
        },
        {
            "review_text": "Uh...yeah!  Great game for a few friends. There is room for improvment but the actual fight system is so much fun.  I do wish there were more levels, and that you could pick your color. Something aesthetic. ITs short and sweet enough to play a few games with my pals and I am happy for that. This is not a 100 hour adventure RPG, just a very well made, very well animated, very pretty fighter.  ",
            "review_score": "1"
        },
        {
            "review_text": "The purest expression of same-screen competetive gaming I have ever had the pleasure to experience, and at an amazingly low price.  The single player is fine as a tutorial, and the online play is surprisingly excellent, but this is best played mano-a-mano in the same room.  Expletives will be hurled, controllers will be crushed, cries of joy will be cut short. As balletic as it is vicious, Nidhogg perfectly captures and distills the very essence of the fighting game genre.",
            "review_score": "1"
        },
        {
            "review_text": "HOLY COW. Incredible fun with friends. Huge amount of gameplay depth. Play it with beer.",
            "review_score": "1"
        },
        {
            "review_text": "Great laugh, full of surprises, and great way to let off steam",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome and nuts and everything like that. You are likely to be eaten by a nidhogg.",
            "review_score": "1"
        },
        {
            "review_text": "Great party game!",
            "review_score": "1"
        },
        {
            "review_text": "I will stab you in the face, then I will be sacrificed to the glorious Nidhogg. Multiplayer is fun, too.",
            "review_score": "1"
        },
        {
            "review_text": "The glorious Nidhogg has chosen me.",
            "review_score": "1"
        },
        {
            "review_text": "Bought this off the Humble Bundle and am having nothing but trouble trying to get the control scheme to work correctly. It randomly comes and goes. Sometimes when I press right, it attacks. When I attack, I jump. I can't pause the game either.  I've tried everything to fix it, and nothings working. Even tried uninstalling a few times then reinstalling.  A shame really, I was really looking forward to this.  ADDENDUM: Got this working by simply just sticking to the original control scheme.   Buy it. It's glorious.",
            "review_score": "1"
        },
        {
            "review_text": "While $15 for this game is slightly exessive, I have gotten many hours of gameplay from this. Whether it be Single Player, Local Multiplayer, or Online Multiplayer, if you enjoy quick pickup&amp;play games where you only have to play one or two games at a time and still get the same excitement that you would get out of a game that you would play for a multitude of hours, then this game is for you.",
            "review_score": "1"
        },
        {
            "review_text": "Face paced fencing gameplay with the best ending ever. 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "Total riot when played with friends. Don't miss out on the hilarious variants, particularly turbo mode and boomerang swords.",
            "review_score": "1"
        },
        {
            "review_text": "Only buy this if you have real-life friend(s) and two controllers that work with your PC. (Recommended: the controllers should have good D-Pads.) If you meet the prerequisites, this game is INSANE in local multiplayer. My palms went beyond sweaty as each match came dangerously close to an end multiple times.",
            "review_score": "1"
        },
        {
            "review_text": "Nidhogg is a very fun and exciting game at first I did have to change controls but besides that factor the game play is awesome and some of the moves are op, but that's why its fun, it gives different advantages to both players bad and good. All in all this game is amazing and you should really consider buying. ",
            "review_score": "1"
        },
        {
            "review_text": "This game is extremely fun, simple to play and hard to master. Unfortunately the biggest downpoint is currenlty the lack of people playing this online, perhaps if it was cheaper more people would buy it but it is worth $15 while many of the big budget titles do not deserve your money.  Most people are going to be scared off by the retro graphics but this would be the very definition of judging a book by its cover. The screens might show an archaic game but the game mechanics and enjoyment are far superior when compared to many of my games.  If you like Divekick or any fighting game you'll love this. If you like platformers and have friends you'll love this. If you like entering or making tournaments you'll love this. If you want a party game to put on you'll love this.  More people should buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great. Ridiculously simple, yet deceptively challenging, Nidhogg provides an experience like no other: the thrill of stabbing your silhouette-man opponent in the face so you can get eaten by a giant worm... thing.  Seriously though, the game is very good. I've seen virtually no fencing games, so this game is in a very small category, but it does capture the feel of a sword duel very well; the waiting, positioning your sword for an advantage, looking for an opening to strike like lightning. I would know; I'm a fencer.  The controls are quite simple, but there is a lot you can do with those six buttons. The tug-of-war mechanic is pretty clever, and adds a nice level of tension to the swordplay. If you screw up, your opponent could make a straight run to the end, virtually unopposed.  The graphics are not impressive, but that should be obvious from the screenshots. The art style is interesting enough, if not terribly complex. However, the main focus of the game is the swordplay, so the visuals are not important in the slightest. in fact, something more realistic might actually detract from the experience.  All in all, Nidhogg is a very good game. Definitely a solid 8 impalings out of 10. I personally think it's worth the $14.99. I've spent that much to see a two-hour movie, and this game can easily give me much more entertainment value for at least that long. Probably longer. I highly recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "Great game even though muliplayer is hard to come by.",
            "review_score": "1"
        },
        {
            "review_text": "This game is fantastic. It brings back not just the nostalgia of playing heated matches with your friends on the couch, but also the pure skill and difficulty to truly master the game. This is not something that will give you instant gratification while holding your hand the whole way, like most games that are released nowadays seem to do, and yet anyone can pick it up and play it within minutes.   It has to be said that those who bought this game expecting a single-player experience, or a game with a lot of combos and superficial depth, are going to be disappointed. Since the beginning of development, the game was, in my opinion, clearly focused on local multiplayer. This was meant to be a party game, or something that you and your friends could enjoy giving each other grief over on those late nights. I am pretty old school, and have gotten weary of the online matchmaking systems that most games implement - you just can't be certain you will be paired with someone that will make the game enjoyable for you. If you really want to have fun, you should be playing with your real friends anyways. And if that's your opinion on gaming as well, do yourself and your friends a favor - buy this game. It is absolutely worth it.",
            "review_score": "1"
        },
        {
            "review_text": "Played with my brother. Ripped out his spine and used it as a boomerang sword.   11/10 would boomerang spine again.",
            "review_score": "1"
        },
        {
            "review_text": "Swordfighting race! It's so much fun!  Probably one of my favorite games out recently.",
            "review_score": "1"
        },
        {
            "review_text": "Fast paced local multiplayer action that's easy for people to pick up and have a good time with. Buy it on sale though; it's not worth $15, but it is worth $3.74 or maybe even $7.49.",
            "review_score": "1"
        },
        {
            "review_text": "Nidhogg is a great multiplayer game, but it may likely only be worth it for you if you have a friend who can play it with you in person, the online is broken and nearly dead. The single player can help you learn the basics of combat, and can be a refreshing way to just fool around for a few minutes whenever you feel like it, but the meat of the game is in multiplayer, and right now the online feels dead and lags too much to enjoy consistant fair matches.  Nidhogg's gameplay is fast paced, fair, and rewards creativity and skill. You will probably enjoy how the match goes too much to have hard feelings over winning or losing. Each match is played on one of 4 stages, each with 5 screens, one neutral screen and two screens for each player. Each player has an unlimited stock of lives, the goal isn't to kill your opponent but to reach the end of your opponent's last screen, killing them simply makes it harder for them to stop you.  There is no skill floor or base APM that you need to meet to compete, no ganking or equipment advantage in Nidhogg, each player has only their foil and their wits as tools to reach their goal. Many times you may lose to an opponent only to find yourself learning a new technique or tactic to add to your toolbox, making playing against a more skilled opponent a much less daunting experience than in other games. Roping your friends in to play with you as your opponent doesn't feel like a chore or unreachable task if they have no knowledge base or skill in the genre, since they will pick up very quickly on the intuitive controls and learn how to play from simple observation.  TLDR: Nidhogg is a game that feels perfectly easy to play and difficult to master, but at the same time avoids many problems of more hardcore dedicated multiplayer games that have the same strengths, and never comes off as unfair or unfun. If you have a friend to play against, or can nab Nidhogg in a sale I strongly recommend trying it. The game is bare bones, but the gameplay itself is fantastic and intuitive.",
            "review_score": "1"
        },
        {
            "review_text": "If someone on your friend's list has this game and you are both competitive people it is a ♥♥♥♥ing blast. I tried matchmaking in it for a while and I loved it, but the game is dieing down now. Extremely fun game still, and absolutely worth the rather high price. Great to throw on at a party or hold tournaments in.",
            "review_score": "1"
        },
        {
            "review_text": "Wow, What a fantastic game... This Game is so much easy to learn the controls, but it's hard to complete the matchs. The graphics are very simple, the AI ( Artificial Intelligence ) is very good and the game is very fast so you can complete it with &lt;1 hour. The multiplayer mode is very fun and the tournament mode too. My Review : 9.0",
            "review_score": "1"
        },
        {
            "review_text": "holy hell this is a good game. please for the love of nidhogg, BUY THIS.   this is the kind of game where you dont need days and days of practice to get good at. take note of its 'principles' (such as if your opponent's sword is high, you cant divekick them, and if you arent standing still, then youre vulnerable, etc), and after that, just try your hardest and dont button mash. its pretty easy to get the hang of with only about an hour or two of single-player practice. not to mention, this is rediculously underplayed. please please PLEASE get this.",
            "review_score": "1"
        },
        {
            "review_text": "It's a good game, fun to play, especially with friends but the price is too high, even the sale for it when it first came out was high considering what the game is and it's style",
            "review_score": "1"
        },
        {
            "review_text": "I'm having an insane amount of fun with this game, i've noticed alot of complaints as far as net code is concerned, and while i've had 1 or 2 unplayable matches for the most part my online experience has been decent. The game play seems simple at first but there is an insane metagame here. I recommend this game to fans of fighting games, the game play feels very similar to playing footsies in a fighting game. Overall pleasant experience. could use more stages though. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Great game, easy to play with or without a controller or any real skill/commitment.",
            "review_score": "1"
        },
        {
            "review_text": "I stabbed a guy and wiggled my sword in the wound while laughing like a mad man.  9/10  (If you can get it on sale, do. It's not really worth it full price.)",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game with smooth, fast-placed gameplay and just plain hilarious to play/watch with the simple graphics. The only downsides are the price and bad multiplayer. But the truth is, if you're getting this game, you're getting it for local co-op matches against your friends, not to sit at home like the forever alone person you are and play by yourself. And then there's the price of $15, which I think is over the top. But if you ever see this game on sale (you know how good Steam sales are), then it's a no-brainer.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. It is the right mix of excessive violence and fun for the whole family. I laughed, I cried, I had my organs forcefully ripped out of my bleeding yellow corpse, covering the ground with the blood of myself and my victims, repetedly.",
            "review_score": "1"
        },
        {
            "review_text": "best multiplayer game in years",
            "review_score": "1"
        },
        {
            "review_text": "Don't let the graphics decieve you into thinking this is an inferior game. This is actually one of the best one-on-one multiplayer games and makes for some intensely entertaining matches. The graphics just drive the point that the gameplay is simple and could have, indeed have been done several years ago. The type of game that makes you say 'why hasn't anyone done this before?' This is one of the simplest controls in a fighting-style game, yet despite its simplicity there is a lot of depth and split second strategy involved. It's easy to see what your opponent did and say 'Oh, now I know I can do that next time' without thinking which button to press. This is like a Versus fighting / sidescroller where both opponents start in the middle and try to fight / run their way to their victory side. Like American Football one team is able to proceed at a time while the other acts on defense to keep you from moving forward. A kill means you can go forward to your goal. You're in the constant frontline of a battle between yellow and orange. Do you go in slowly picking out each of your opponents one by one? Or did you see an opportunity to throw your sword and dash like hell to the next screen? High, medium, and low sword attacks for poking (lower goes furthest) move your sword between the three positions with up/down keys, switching position to an attacking sword parrys it away. You can roll underneath a mid-high sword while low sword pokes a rolling opponent in the eye. You can jump and divekick your opponent to make them drop their sword, while they can throw their sword at you for an easy in-air hit. Thrown swords can be blocked in mid and high position... Very simple in motion and with an answer to everything a very well balanced breakfast. I give it 5 stars.",
            "review_score": "1"
        },
        {
            "review_text": "its the funniest game ive ever seen",
            "review_score": "1"
        },
        {
            "review_text": "This game is really good to play with friends on local, but in the singleplayer it lacks of content. Still a fun game but a liitle bit too expensive.",
            "review_score": "1"
        },
        {
            "review_text": "A blast of a quick two player arcade fencing game. Best for couch multiplayer - the lag on multiple PCs, even on the same network, makes the game much less enjoyable, as well as gives the host an unfair advantage.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing. It has a constant thrill and it is the most fun with friends I have had in a long time!",
            "review_score": "1"
        },
        {
            "review_text": "This game.... Where do I begin. Well for one it will have scratching at the throats of even your closest friends. the animations are solid, and the swordplay is amazing..... and the deaths are SOOO satisfying. For single player the AI is sluggish and easy to trick so it needs work in that respect... but for a local multiplayer no amount of money could begin to be enough. BUY THIS GAME. 9.9999999999999999999999999999999999999999999999999999999999999999999999 out of 10",
            "review_score": "1"
        },
        {
            "review_text": "Why do I want to win exactly?",
            "review_score": "1"
        },
        {
            "review_text": "Simple, tough, and thoughtful fun. Fencing just got less frilly.",
            "review_score": "1"
        },
        {
            "review_text": "great game to play with friends beautiful music and sweet variations to mix up matches. a game you can artfully master with enough practice",
            "review_score": "1"
        },
        {
            "review_text": "A great game with smooth controls. The single player mode is a bit lacking, but that doesn't matter because the real draw to this game is it's local multiplayer.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun game for something casual, fast paced, and quick to play with a friend.",
            "review_score": "1"
        },
        {
            "review_text": "Simple, yet endlessly playable. Also, a fantastic game to play if you have two controllers to plug in, up to seven friends to play against, and a crate of beer to drink.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great. Makes me feel first hand how Nibbles the mouseketeer was in Tom &amp; Jerry. Sword fight tug of war. Not just any tug of war. Hearty sword/fist fights along the way. Easily one of the most entertaining games i have played.",
            "review_score": "1"
        },
        {
            "review_text": "I may not know much about reviewing games but I do know two things. 1- I can ♥♥♥♥ yo ♥♥♥♥♥, and 2- I can ♥♥♥♥ yo ♥♥♥♥♥ while I ♥♥♥♥ you in Nidhogg. This very well may be the best two player time waster on the market. Same keyboard, same map, different outcomes. All you gotta do it rapier your friend with your little pointy sword. 12/13",
            "review_score": "1"
        },
        {
            "review_text": "WAY over-priced at $15. But worth it for a couple dollars. Very little to the game: fence another dude, while trying to advance to one side of the level (stopping him from reaching the other). Very simple, but a lot of fun, and a lot of laughs, can be had from this simple formula. Just don't wear it out in one sitting.",
            "review_score": "1"
        },
        {
            "review_text": "challenging and lots of fun",
            "review_score": "1"
        },
        {
            "review_text": "Most multiplayer fun there is to be had. I love the music on the stages but i certainly wish there were more to play in. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "yes I do recomond the the only thing is that no one play multiplayer every time I checked no one is playing",
            "review_score": "1"
        },
        {
            "review_text": "When I first heard about Nidhogg, it sounded like a dream. There were whispers in multipayer communities about a rise of local multiplayer games that truly captured the imagination. The rise of games like Samurai Gunn and Towerfall Ascension have been popping up in the gaming scene, and it has been much better for it. Nidhogg, much like the aformentioned titles, offers that same sort of experience to players.  Nidhogg could be describe as a combat simulator, but of the flashy variety. It offers various levels of play with a basic control scheme. At first glance the game seems a little lacking in levels, but once you dive in the game reveals it's levels of depth. In some regards it seems similar to the high level of play found in a Smash Bros Melee game. Some levels provide a 'gimmick' to playing them, as others offer simplicity. The Stages, Castle and Mines, offer the most straightforward approach to combat, while other levels lik Clouds and Wilds offer more strategic play for more wilely players.  When picking up the game, it's important to ask why you're doing it. This is not for the solitary experience, certainly not worth the price point. Get some friends together and have yourself a classic gaming night.",
            "review_score": "1"
        },
        {
            "review_text": "A great test of skill and friendship (multiplayer only).",
            "review_score": "1"
        },
        {
            "review_text": "This game is quick and dirty.   The single player 'campaign' takes less then an hour. But the multiplayer....that is a thing of beauty. Nidhogg's multiplayer is the kind of game that should be played on a movie screen or by Fred Savage in The Wizard. It is one of those perfect little games that you could just play over and over and over and laugh as you skewer your friends or rip their face off(?!).   All that being said....I wish there was a bit more to the game. There are only 4 levels to fight on and a pretty barebones options screen. If this game was beefed up a little bit, it would be one of the most popular and timeless multiplayer games ever made.   ",
            "review_score": "1"
        },
        {
            "review_text": "Dodged a thrown sword, and leg sweeped my opponent into his death. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "An absolutely astonashing game, get it while it's on sale, not worth more than 5 euros in the least It's practically a minigame, but loads of fun",
            "review_score": "1"
        },
        {
            "review_text": "Fun little game worth only getting if u can get it cheap.This game is really fun to play with friends.",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun game where you stab people.  Playing online really sucks, with how bad host advantage is.",
            "review_score": "1"
        },
        {
            "review_text": "That one scene from Princess Bride the game. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Stabbed my brother in the balls repeatedly 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Nice game for a quick match with anyone mad enough to follow you into the endless row of painfull death awaiting both of you. Really easy to get the command, hard to master and totally addictive ! I like it",
            "review_score": "1"
        },
        {
            "review_text": "Grab a controller or two, bring a friend, and stab each other. That's all there is to it. Lots of fun, but could use a few more maps as the only four do get repetitive after a while",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun, fast paced, and the best time of your gaming career. The games main goal is to go the other direction from your area its like arm wrestling except 100,000,000,000,000,000,000,00 better because its fencing and 16-bit. The games especially fun when your online because its fun to outsmart other people with the skills you have learned and what you have trained for the best thing to do is play with friends especially if they're new to the its called PWNING NOOBS and thats fun sometimes. my rating is 9/10 because the thing that doesn't make it 10/10 its that once your able to beat alot of people and youve finished the singleplayer it gets boring yet its still fun so yeah thats a GOOD GUIDE FOR YOU GET THE GAAAMMMEE.",
            "review_score": "1"
        },
        {
            "review_text": "This fast twitchy fencing simulator is a delight. Simplistic yet elegant visuals coupled with a fanatic and fluid fighting system this game is ideal for two players with controllers.   8.25 / 10",
            "review_score": "1"
        },
        {
            "review_text": "GOOD:  - the best party game ever made - offers great facility for local play - quick, addictive action of the 'just one more match, I'll show you this time' kind - this game is as fun to watch others play as it is to play it yourself - simple controls (directions + 2 keys), yet the gamplay isn't shallow/simple at all, even against the AI - minimalist, aesthetically pleasing graphics that really make the game easy to follow - the MODES the game has for local 1v1 are insanely fun and can be stacked/combined, i.e. turbo speed, slow motion speed, no weapons mode, no dive kick mode, players leave multicolored traces mode etc etc.  BAD:  - forget about playing this game over the network, not only no one is ever available when you try the matchmaking, but also due to the quick nature of the game any latency is gamebreaking - too few maps to fight on  OVERALL:  If you have friends/roommates/anyone with whom you can play often locally, get the game by all means. If not you will mostly be left playing against the AI, which is OK but not nearly as fun as stomping your friends in local 1v1.",
            "review_score": "1"
        },
        {
            "review_text": "Ok, when I saw this game at first, before it was gifted to me, I thought to myself, 'This game looks kinda cool, and seems kinda. . . strange'.   After this game was gifted to me, I had a few of my good friends come over and we basically laughed out loud constantly from this game. A few quotes were:    'QUIT BREAKING MY NECK!'   'Dive Bomb, OUT!'   'Die, Die Die!'   'Nidhogg get to eat me, not you!'  You get the jist of it.   I love it, the graphics make for a good looking game (by my standards), and its incredibly fun to make your friends wait for you to get them off your sword while blood is constantly spewing out of them. I enjoy the mechanics eg. Divebombing, rolling, leg sweeps. But I think that there needs to be more different stages, that, and the fact that when playing with a keyboard, the running/fencing movements are really finicky are my only cons to the game. I cant describe how much I like playing this game.   9.768943543/10   (My low ammounts of hours are because we were playing on my friend's computer)  -(Papayas)3",
            "review_score": "1"
        },
        {
            "review_text": "What an absolute blast. We played this game on our Beer and a Game, Partay Saturday video for Rogue Ocean Gaming and it was a complete blast. Not a complex game by any means, if you enjoy a fun local co op game, please check this one out!          YouTube™ Video:  ParTay Saturday - Nidhogg&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "One of the best fight games ever.",
            "review_score": "1"
        },
        {
            "review_text": "Super fun game. Nobody really plays the multiplayer, but if you've got a few controllers it's fun to challenge your friends. Not a whole lot of variety after playing through a few times, but still good in terms of replay value because of it's sheer awesome quality of intense fencing swordplay. You'll feel chivalrous and dastardly at the same time.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely destroy your opponent and win flawlessly. Die anyway.  11/10",
            "review_score": "1"
        },
        {
            "review_text": "Simple graphics with a simple combat system thats soooo smooth and sharp as far as controls. Great game, however my main gripe is it's a bit pricey and the community has pretty much disappeared",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing for 2 players.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great for so many reasons. The tournament-style makes it great for parties, and the different things you can add to every match can totally change the dynamic of the game.  Strongly recommend.  12/10 would play again",
            "review_score": "1"
        },
        {
            "review_text": "mildly dissapointed with the lack of hogs.",
            "review_score": "1"
        },
        {
            "review_text": "I mean, holy ♥♥♥♥. As entertaining and irritating it is, one of the best games I have played for a long a while, that kept me going for eons///",
            "review_score": "1"
        },
        {
            "review_text": "This game is so much fun as long as you have someone to game with!",
            "review_score": "1"
        },
        {
            "review_text": "stabbed my friend in the chest witha sword... 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Does what it intends to do, very, very well.",
            "review_score": "1"
        },
        {
            "review_text": "Nidhogg is an insanely fun game, given, you have a controller to play local multiplayer, as it is relatively difficult to find other online players in matchmaking.  It has much more depth than the game first lets on and there are hidden mechanics that you can take advantage of that will help you beat your opponent.  I recommend this game, but it's NOT worth $15. Wait until it's on sale and then hop on it, you won't regret the purchase",
            "review_score": "1"
        },
        {
            "review_text": "I don't know why the tracker is off, but I've played about 30 hours more than it says right now. I know, because I have literally played this game for hours at a time. This game has about $5 worth of content, but $70 worth of gameplay. It is so oddly addictive.",
            "review_score": "1"
        },
        {
            "review_text": "Totaly epic! simpel and advanced  micro action time initiate ♥♥♥♥ off  just play the damn game",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best fighting game I've ever owned, sick graphics, even sicker music, and the gamplay is insanely addicting!",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game. Very fun with friends. Very tense game with loads of tricks, jump kicks, and mad fun :)",
            "review_score": "1"
        },
        {
            "review_text": "Thanks for porting this game to Linux!",
            "review_score": "1"
        },
        {
            "review_text": "Praise the Nidhogg!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "I got eaten by a worm.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Fun for multiplayer. Especially with ur relative or friends... it will be so much fun xD Bring u to the world of pixel xD",
            "review_score": "1"
        },
        {
            "review_text": "End of friendship",
            "review_score": "1"
        },
        {
            "review_text": "Kinda like playing tag in the bag seat on a road trip.",
            "review_score": "1"
        },
        {
            "review_text": "As much as this game may have an insanely addictive combat syste with a small yet effective learning gap, it suffers tremondously and can get very old due to the limitation of only 4 stages, a crappy singleplayer experience that only puts you up against bots, and ugly graphics. Still an amazing experience with friends though.",
            "review_score": "1"
        },
        {
            "review_text": "Not worth $15 but if it goes on sale get it. Local co-op is some of the most fun I've ever had.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game, the graphics, the controls, the moves, and the overall feel. However I would like to see a little bit more to the campaign and multiplayer. Maybe like an arena mode, or like 2 v 2, capture the flag. Overall though, I really enjoy the game.",
            "review_score": "1"
        },
        {
            "review_text": "This is relevant to my interests.",
            "review_score": "1"
        },
        {
            "review_text": "its just one of those games where you can not put it down. You also may stop speaking to friends who may/may not win",
            "review_score": "1"
        },
        {
            "review_text": "Had a fun time with my mates! Competitive yet retro, love it.  Pros: Competitive (It is in our nature to be competitive, this game shows who's alpha) Great SFX (New &amp; interesting but yet arcade-like with a touch of oldschool) Retro (The way I like my games, 2D &amp; simple but with alot of depth) LAN multiplayer (Every new game lacks this, fortunately Nidhogg doesnt!)  Cons: Maps (Not enough) Map Editor (Non existant) Characters (Lack of basic character customization &amp; ability to choose Main &amp; Alternate color) Weapons (Fists &amp; Swords is not enough, more variety like bows &amp; axes would create more depth)  7/10 - In my list of 2015 Top 10 &amp; I've played alot of different games last year. (With more maps, map editor, character customization &amp; more weapons this would get 10/10)",
            "review_score": "1"
        },
        {
            "review_text": "I like this game.       7.9/10",
            "review_score": "1"
        },
        {
            "review_text": "Simple game,. FUN to play with friends on LOCAL CO-OP. non-stop laughter~! Recommend to buy it on 75% sale, not at its ori price.",
            "review_score": "1"
        },
        {
            "review_text": "this game is a blonga sandwithc",
            "review_score": "1"
        },
        {
            "review_text": "Amazing party game! Sadly that is all it is. With friends I could play this for hours on end, but it is so boring to play by yourself. It is a game ment to be played with your friends, therfore if you have none do no't buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "Not worth $15, buy it on sale.",
            "review_score": "1"
        },
        {
            "review_text": "My friends are bad at it so i feel better than them",
            "review_score": "1"
        },
        {
            "review_text": "Better graphics and story than Skyrim    Wow!/10",
            "review_score": "1"
        },
        {
            "review_text": "Ive never had so much fun with a game like this but i recommend playing with a controller",
            "review_score": "1"
        },
        {
            "review_text": "Sometimes when I play this game I pretend I'm the great Donald Trump. My enemies are usually Shilary or Jeb. The final boss is usually the dirty socialist Bernie Flanders. I am going to build a wall. And I promise that the Nidhogg will pay for it!",
            "review_score": "1"
        },
        {
            "review_text": "This game is fantabulistically great. The default controls are garbage, but can be easily changed. There is so much satisfaction in a giant horned space worm eating your character every time you pwn your friend.",
            "review_score": "1"
        },
        {
            "review_text": "Nidhogg is awesome. very simple gameplay and controls, but tons of fun with friends. more fun than it looks, with options for slow mo, low gravity, turbo mode, and more craziness. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "The game is extremely simple in its gameplay, yet there are so many things that can happen. It is a pixelated masterpiece.",
            "review_score": "1"
        },
        {
            "review_text": "  DISCLAIMER: This is a first impressions review, and NOT a full review, if you want a full review, then please read better reviews then mine",
            "review_score": "1"
        },
        {
            "review_text": "+ Very fun  + Fast paced or slow paced  + Old styled graphics  + Giant worm kills you after every single winning round  + Good music  - Rarely anyone on multiplayer  - Gets dusty after a while and sits in your library, not played in months  - granola bar sat in the sun too long  - Overpriced  - You can like, anime kick people and then like, snap their necks and run away really fast  ",
            "review_score": "1"
        },
        {
            "review_text": "chill acrade game to play when your friends are over. Only bad thing is that it can get repetitive and online multiplayer never seemed to work for me. ",
            "review_score": "1"
        },
        {
            "review_text": "Like the final Star Wars Episode I Pod Racing challenge that caps off any proper evening of drunken N64 Mario Karting by testing the room's blood for midi-chlorians, this is THE game for putting a roomfull of idiot nerds to the ultimate test of their Princess Bride literacy, with all the grace, bloodlust, swashbuckling pratfalls, and surging swells of victory-roars that could possibly ever be produced by a bunch of idiot nerds.  Absoultely pick this up if it's under $5 and you have any friends.",
            "review_score": "1"
        },
        {
            "review_text": "What a great game.  I played the single player mode when i was ♥♥♥♥♥♥ off,what a journey!",
            "review_score": "1"
        },
        {
            "review_text": "has local mulitplayer, very fun. praise worm lord",
            "review_score": "1"
        },
        {
            "review_text": "  Great game, a large amount of different attacks, involves different strategies. I would recomend buying it to play with a friend, not just going through the singleplayer campain, because can get quite boring on your own. Overall I give it a 9 out of 10.",
            "review_score": "1"
        },
        {
            "review_text": "It doesn't say much play time but that doesn't mean I'm not well experienced at the game.  This is such a fun action game from such a small dev team. I wish they would develop more quality games like Niddhog. Dynamic gameplay with fencing and sword-fighting dynamics. You also have the ability to use martial arts moves to subdue your opponent and break his neck to keep continuing forward. This game goes great with a friend.",
            "review_score": "1"
        },
        {
            "review_text": "ONe of the most fun indie multiplayer games I've ever played, a bit expensive though.",
            "review_score": "1"
        },
        {
            "review_text": "Still one of the best 1on1 pre-buzz games I ever played!",
            "review_score": "1"
        },
        {
            "review_text": "Best played with a friend on the same PC or on his own. Fun for a short amount of time, with a beer.  Well suited as a drinking game. 9/11 would get stabbed again",
            "review_score": "1"
        },
        {
            "review_text": "this game is pretty good  but   the matchmaking doesnt work very well.   ",
            "review_score": "1"
        },
        {
            "review_text": "This game needs some time to get into, but once you 'git gut' at it is amazing fun when you play with friends. I had this game and two controllers when I went on holidays with my friends to the middle of nowhere. I just started up the game cause I was borred and my friends wanted to join in. We ended up playing this game for at least 60 hours and holding one tunament after the other.  11/10 would get crouch jump attacked again",
            "review_score": "1"
        },
        {
            "review_text": "Very simple but really fun game to play with friends!",
            "review_score": "1"
        },
        {
            "review_text": "Sometimes when I play this game I pretend I'm the great Donald Trump. My enemies are usually Shilary or Jeb. The final boss is usually the dirty socialist Bernie Flanders. I am going to build a wall. And I promise that the Nidhogg will pay for it!",
            "review_score": "1"
        },
        {
            "review_text": "One of the most minimalistic game but giving endless hours of fun !",
            "review_score": "1"
        },
        {
            "review_text": "Simple and fun so why not.",
            "review_score": "1"
        },
        {
            "review_text": "Grab a friend, swashbuckle, throw some swords, paint the ground orange and yellow, crawl, leap, parry, run for victory, feed the Nidhogg.",
            "review_score": "1"
        },
        {
            "review_text": "This game is sooo funny to play Local Multiplayer when you've had a few beers.",
            "review_score": "1"
        },
        {
            "review_text": "1. buy Nidhogg 2. get good 3. invite your friends over 4. destroy them like the computers once destroyed you 5. defeat them  6. banish them until they are worthy to face you again 7. get new friends 8. restart at step 3",
            "review_score": "1"
        },
        {
            "review_text": "A very good game, makes a lot of fun to play against friends. Sadly the connection is sometimes a problem",
            "review_score": "1"
        },
        {
            "review_text": "Great game to play with a group of friends.",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome. Very fun and strangly satisfying.",
            "review_score": "1"
        },
        {
            "review_text": "Fun and intense co-op. It has a limited replay value however, more arenas, fighting styles, weapons or challanges could've made it into a proper classic.",
            "review_score": "1"
        },
        {
            "review_text": "A perfect blend of arcade style gameplay, simple but complex visuals, and a great soundtrack. This is one of the best quickplay multiplayer games around. Fun for casual players and hardcore at the same time. 100% recommendation.",
            "review_score": "1"
        },
        {
            "review_text": "Fun, competitive, 1v1 melee game. Very simple graphics with tight controls make for some very competitive playing. Fun for a few late nights of fun but not much beyond that. what you see in the first 5min is basically what you get. Worth a buy on sale.",
            "review_score": "1"
        },
        {
            "review_text": "This is my first review on steam.  This game is awesome to play against friends, it is intense and purely skill based. The biggest problem with this is the multiplayer system only works when it wants to so you can't even play online with your buddies unless the 'Server' is feeling okay. When the server is working which is probably isn't right now, you are unable to customize the online multiplayer match which is a huge part of the multiplayer experience in nidhogg.   In conclusion this is not a $15 game. I am glad I bought it for $3 and it is worth that when it is working. Offline mode locally I am sure is the only use for this game. Do not pay $15, beyond waste.",
            "review_score": "-1"
        },
        {
            "review_text": "Want a fun little game where the pure aim is to stab your friends repeatedly and run to the other side of the map? Then this is the game for you!  Pros:  The game is fun, fast paced, keeps you on your toes, music is perfect for the game and comedic moments are never far behind.  Cons: It's very limited, you fight your way to the other side of the map then rinse and repeat. Matchmaking is terrible it takes too long to find an opponent unless you are playing against friends, this is primarily due to the fact that having very little to do in the game results in short play times and once you've done it there's really no need to go back.  Overall: It's not really worth the money for what it is. It's very fun but the fun will soon run out. I would only recommend it if you have the money to spend on it for only a couple hours of fun. ",
            "review_score": "-1"
        },
        {
            "review_text": "not worth 17 dollars at all",
            "review_score": "-1"
        },
        {
            "review_text": "Terrible matchmaking. Would be decent as a local only game, but if you want to play online, you're out of luck.",
            "review_score": "-1"
        },
        {
            "review_text": "Good mechanics but.. unfortunately, as other comments mention, networking seems to be completely broken. Probably still a good time for hot-seat play, if you have a regular group of buddies for that. I only paid bundle price, but for me the broken online play leaves me not recommending it.",
            "review_score": "-1"
        },
        {
            "review_text": "Fun game, but absolutely infuriating. The gameplay is innovative and complicated, but it basically goes to waste because of the glaring flaws in its mechanics. It is far too easy to simply run past your opponent and prevent them from attacking you. All you have to do is evade their attacks when the arrow is on you and you can skip right to the end. You can also cheap-shot them if their sword isn't in the right place, making it even harder for a defender to turn the tide. It's advertised as a fencing game but it's really about trolling. If you want to get good at this strategy and use it to ♥♥♥♥ off everyone you play against, absolutely, buy this game. Otherwise, skip, it's not worth the price tag, especially considering how short it is.",
            "review_score": "-1"
        },
        {
            "review_text": "Nidhogg is great, but I cannot recommend it because of it's price. What is there is very cool, but there is only 4 stages, 4 songs, and one cpu opponent that varies difficulty as you progress through the games dozen or so single player matches. The online multiplayer doesn't work well and there is very little beyond what you see in the trailer. None of it is really bad but for 14.99 USD, it certainly is not worth the price. Pick this up for less than 2.50, and you shouldn't regret it.",
            "review_score": "-1"
        },
        {
            "review_text": "dont buy this game. its not worth 15 dollars. 10, maybe, but probably more like 5. The controls are screwed up to the point were its incredibly hard to control your guy. The mechanics allow your enemy to stab you from the exact same distance you TRIED to stab him. In fact, overall the mechanic where you NEED to be doing a specific action (in this case, sprint and duck/up) to either throw your sword, or do a leg sweep, is stupid, and only has a chance to work. I have died so many times as I have attempted to perform a sword throw, and rather have just raised my sword stupidly. additionally, the game system itself is flawed. Nidhogg uses a system called right of way to determin the winner. This means that when someone kills the other, they can just continuosly run to the endzone of the level, winning. Only one person can have right of way, but the person without spawns in front of the person with right of way whenever they die. First of all, this system is broken, as whoever has right of way can just jump over the enemy whenever they spawn. The spawning itself is flawed too, as you will find yourself having to kill someone three times just to move five feet, because they respawn the second after you kill them. These game mechanics arent broken, they just make the game frustrating rather than fun. Overall, this game is like a math test, it tests for skill, certainly, but its never fun, ever.",
            "review_score": "-1"
        },
        {
            "review_text": "The game itself is fun, but way too expensive for this amount of content. Plus it won't even start for some reason. I've asked the devs for help, but they don't seem to care. I get this message after launching the game btw:  ___________________________________________ ############################################################################################ ERROR in action number 1 of Create Event for object SteamNetworkingTest:  Error defining an external function. at gml_Script_dll_init ############################################################################################ -------------------------------------------------------------------------------------------- stack frame is gml_Script_dll_init (line 0) gml_Object_SteamNetworkingTest_Create_0 ",
            "review_score": "-1"
        },
        {
            "review_text": "Doesn't support the D-Pad on X360 or Xinput controllers. As a controller focused game I find this unacceptable.",
            "review_score": "-1"
        },
        {
            "review_text": "I cannot recommend this game ... for online multiplayer. If you want to play against bots or have someone you can play with locally it's okay, but the game has severe issues with any kind of lag, and it's unplayable against people in the same country, let alone against people across the world.",
            "review_score": "-1"
        },
        {
            "review_text": "It's like a flash game someone would make in a game jam: fun, but not worth money. There aren't enough maps to play on, making the game repetitive. The uninteresting A.I. doesn't help, either. The game is only fun with a friend, but if you don't have one to play the local multiplayer with, it's not worth you money. It's only worth five dollars, not fifteen.",
            "review_score": "-1"
        },
        {
            "review_text": "I purchased a number of copies of this game. Under the hopes that I could play it with a few friends.  I couldn't.  Because, contrary to the game's steam page, this game has no functional online mode. Everything is terribly laggy, which ruins any fighting game. Don't buy this game if you ever want to play online. You most likely can't.",
            "review_score": "-1"
        },
        {
            "review_text": "Probably decent at a LAN party, if you're into this kind of thing.  otherwise ♥♥♥♥ game",
            "review_score": "-1"
        },
        {
            "review_text": "WOW NOT WORTH $15. Cool game, not near worth $15. Also once you beat 15 npcs there's nothing to do, and multiplayer is unplayable beacuse of lag. Don't buy.",
            "review_score": "-1"
        },
        {
            "review_text": "good game but i cant recommend it.Cuz there are only 4 map. This is quite unsufficent.so this game is boring after a few hours.and they dont update this game so dont buy it.",
            "review_score": "-1"
        },
        {
            "review_text": "Is literal ♥♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "pros: fun as ♥♥♥♥ and very challenging.  worth what i bought it for $1.59  cons: 1.bad controls(unless you have an xbox controler) 2.multiplayer is bull ♥♥♥♥(if I host the server, no lag for me. But is someone else host the server I lag real hard and i have good internet) 3.when you play multiplayer and someone jumps over you, they now have the ability to run to win(when you kill someone you have to go in there direction to win, i found that people will abuse this if they killed you, jump over you, and they will start running for an easy win.) 4. buggy friend invite(you have an easy access to invite friends, but it will also give you the option to invite people who don't even own the game....) 5.'I.B.M.S.'Instinctive Button Mashing Simulator(Remeber when I said bad controls)  Rating:4/10 needs some work",
            "review_score": "-1"
        },
        {
            "review_text": "This game is so stupid, money badly spent on this S***! Don't buy it. AIs are bad, controls are the worst if you use a keyboard. Don't waste your money on this C***.",
            "review_score": "-1"
        },
        {
            "review_text": "  Nidhogg   is two-player showdown of fast-paced melee attacks.  Pros + Great Graphics + Some fun + Achievements + Multiplayer  Cons - Is very very boring - Where is story? Logic? When you win you are ate by worm o_O - It cost a lot, buy it only on sale! - Sountrack is medium - There is no tactic you just run and throw sword at your enemy :P ( = Dead) - Multiplayer is very boring too     Buy or don't?   Only on big sale! Game is fun but only some time! Would love like it, but i can't",
            "review_score": "-1"
        },
        {
            "review_text": "What looks like a fast-paced tactical fun bit of fencing, is a stressful torturous sequence with poorly laid out rules, and no victory or defeat passing without 'That was Bull****!' from your opponent. The psychadelic backgrounds in certain stages work far too well at being disorientating, as the game becomes physically painful to play, bringing on headaches and RSI after bare minutes of playing.",
            "review_score": "-1"
        },
        {
            "review_text": "6/10 This is a very interesting game and has alot of potential but so far it is quite boring. Unless you have a person to play with dont but this game. And if you really want it wait until its on a discount",
            "review_score": "-1"
        },
        {
            "review_text": "I have a Mac, and I got this to play with a friend who has a Windows. Turns out, only Mac users can play together. Thanks a lot, you lazy *** developer. What a load of ****",
            "review_score": "-1"
        },
        {
            "review_text": "For the love of god don't buy this ♥♥♥♥ing game",
            "review_score": "-1"
        },
        {
            "review_text": "Worth $2,- max.",
            "review_score": "-1"
        },
        {
            "review_text": "TL;DR: Buy for local mutiplayer only.  I don't really know how I can express my hatred toward this game. The worst part about that, is that it is quite a good game. The game is funny to play with friend for a time, graphics and music are very well made.  But first, the game looks extremely aggressive, there is always a flickering element in any moment of the game and it flickers quite fast too, graphics are gory and depict many things not nice to watch. Second thing, the content is very low, 4 maps, you can't change players colours. Third thing, the AI is very badly done, it is not funny at all to play single player. Another thing I need to add, the game sometimes doesn't care if you modify your control setup and sometimes doesn't register some of your inputs, playing this game is kinda playing lotery: you know it can be nice but if you try too much it will most certainly brings more pain than pleasure. Last thing online mutiplayer is very crappy.  To conclude, this game is good so if you want to take it consider only for local battles with friends and only a few times.  For people who are willing to rate this review down, I am willing to hear why.",
            "review_score": "-1"
        },
        {
            "review_text": "Used to play this game for a while, before I realized that it was better as a multiplayer. I had gotten rid of it but now went to download it again, and it takes 4 seconds to download out of its estimated 3 minutes, and than instantly crashes when run. I will change my review if I can get it working again but if this is really a bug, than that is terrible.",
            "review_score": "-1"
        },
        {
            "review_text": "Horribly over-priced game with simple repetitive gameplay, along with the absolute worst multiplayer you will ever play",
            "review_score": "-1"
        },
        {
            "review_text": "How to lose friends and alienate people, the game.",
            "review_score": "-1"
        },
        {
            "review_text": "Online multiplayer is broken. Refunded.",
            "review_score": "-1"
        },
        {
            "review_text": "Absolutely the worst thing to come along in gaming since Pong. Even that was actually worth something when it came out though.. so this game... is an insult to Pong when compared to each other.  The controls are horrible, there is no such thing as 'swordplay' as you stand toe to toe switching the height of your 'sword', there is nothing you can do if you lose your sword and only the computer can block a thrown sword.. and once your sword is gone, you're dead. No chance at all.  Worst game I've played.. and I've played hundreds of thousands of bad games.",
            "review_score": "-1"
        },
        {
            "review_text": "I purchased this during the steam sale along with one of my friends. We had watched videos of others playing it and it looked super fun. However it has terrible lag issues when playing over the internet. We only live two hours apart and we both have extremely fast internet speeds (50MB+) yet the lag was so bad, that whoever wasn't hosting litterally had no chance of winning due to stuttering and lag issues in game.",
            "review_score": "-1"
        },
        {
            "review_text": "Fun at first, but soon becomes tiresome and frustrating",
            "review_score": "-1"
        },
        {
            "review_text": "boring",
            "review_score": "-1"
        },
        {
            "review_text": "I was incredibly excited about this game. When I first heard about it during development (when it was just an arcade cabinet), I even contacted the creator and urged him to put the game on steam. Then I bought it right when it was released, and I've had it ever since. Well, the good news is that the actual gameplay is really fun and fast-paced. The HUGE downside is that online multiplayer simply doesn't work. I literally can never get it it work at all, it is entirely broken. I've managed to enter a couple matches, but I always get disconnected. This doesn't happen with any other online game I've ever played. And I'm not by myself in this, almost everyone seems to have enormous problems with the online multiplayer. And since this is basically exclusively designed for multiplayer, the game is unplayable, I'd like a refund, since I was sold a product that doesn't work, but I'm sure Steam will not help me in this. DO NOT BUY THIS UNDER ANY CIRCUMSTANCES.  EDIT: I've just managed to get a couple matches today, but it's still pretty hit-and-miss. Also I just remembered that the game is way overpriced.",
            "review_score": "-1"
        },
        {
            "review_text": "Yeah it's a great game, but it should be free. The fact that it costs what it does is a joke, since this could easily be a flash game on newgrounds...",
            "review_score": "-1"
        },
        {
            "review_text": "Do NOT buy this if you are looking for some online multiplayer fun. The network code is absolute garbage.",
            "review_score": "-1"
        },
        {
            "review_text": "Very limited gameplay. Even when considering the minimalistic/retro style of the game, the complete lack of content makes the game hard to play for more than 30 minutes. I have played it from time to time, just playing through the singleplayer mode, and have hardly got my money's worth. I played this with my friend a little bit when I bought it, but the run-to-the-other-side objective system doesn't work very well with the combat system.  Not recommended.",
            "review_score": "-1"
        },
        {
            "review_text": "Fun at first, but soon becomes tiresome and frustrating",
            "review_score": "-1"
        },
        {
            "review_text": "I grabbed this game during the Steam summer sale for about three dollars, and it was well worth the price. That's not a compliment - this game is three dollars worth of fun, now at five times the worthy cost.  It might be more fun if there was an online community, but there isn't, or at least there wasn't when I was playing.  Overall it's a decent game. Fairly fun. The basic idea is that you get to flip, jump, and run around like a normal platformer, with the added bonus of having to fence/fist-fight enemies. Once you kill an enemy, you can start running towards the end goal. If an enemy kills you, HE can run towards the end goal. Whoever dies gets to respawn and try to stop the other from getting there, but the guy running can literally jump over you and keep going. It takes a bit of skill and getting used to, but when you pick up the controls and start really understanding things, you'll get the hang of it.   Again, it's a decent game, it's just not worth fifteen dollars. Maybe if there were more people to play online with, or there were more stages, characters, or weapons, but there's only about four or five stages (if even that many), one type of weapon (not counting hand-to-hand), and there's only the one character (you can't even choose your color). So, all in all, it's just not worth it.",
            "review_score": "-1"
        },
        {
            "review_text": "lots of lag on multiplayer 0/10",
            "review_score": "-1"
        },
        {
            "review_text": "This game should only be bought if you have local people to play with.  Simple yet well designed fighting system. It is all about the tension of landing the perfect strike. Unfortunately the online is bad. It is hard to find anyone else playing, and when you do get a match, most likely lag will happen. From my experience the lag isn't the same for both people playing. One person could be lagging out and the other has a perfectly smooth experience. This game can't fall on a single player experience either. This type of game loses much of its satisfaction with lifeless opponents.",
            "review_score": "-1"
        },
        {
            "review_text": "after buying the game on sale for $2.99 I was confused with the 14.99 price.  This game is really fun, and I really enjoy it, but it doesn't offer enough content to be worth more than a few dollars.  If anything, get the game when it's on sale, it is a neat game to check out, otherwise don't waste your money.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't get me wrong. The game is fun but... It's missing more content for the price we are paying. Maybe a few more stages should have been included. Maybe diffrent wepons you know? Character customization like skins. The wepons could all do the same thing just different skins for those. Like a rubber chicken. You know? Quirky things. Small things like these would make the game alot better.",
            "review_score": "-1"
        },
        {
            "review_text": "Not a fan, controls were not quite to my liking. Gameplay gets old pretty quick too. Actual time &lt;30m ingame.",
            "review_score": "-1"
        },
        {
            "review_text": "Reaaally not worth the money for the amount of content in the game. I've played free flash games that are more fun.",
            "review_score": "-1"
        },
        {
            "review_text": "Nidhogg is somewhat interesting, but not amazing at all.  It's price is far too much to make up for what's in the game. Online multiplayer is extremely broken, and the single player mode isn't very good, as they get to an unfair level of difficulty. The fighting feels really random as well. I've put roughly 30 minutes in to the game and I've seen all it has to offer, and I can't say I was too happy with any of it.  It does however somewhat well in local multiplayer though, so it offers a bit of fun here and there. It is very fast-paced, so if you don't mind a bit of glitchy fighting, and fast paced action, this would probably be for you. I however was looking for something that had a bit more content, and this didn't deliver.  While it's a fun idea, it was executed very poorly.",
            "review_score": "-1"
        },
        {
            "review_text": "A vary fun game, but I can recommend it at its price. Buy it at a discount of you want it.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a lot of fun, but I can't say I would buy it for anything more than 5 or 6 CDN, and even then that's pushing it. I was lucky enough to receive this as a gift, and I absolutely love the versus mode, however it does seem to get a bit buggy at times-- like other reviewers have pointed out. The single-player mode is alright, though the same handful of environments from the versus mode are recycled here, and the music is the same as well. I personally think that a game being sold for this much money should have at least a bit more to it than a few environments and 2 game modes.. I'd wait for it to go on sale.  TL;DR this game is a lot of fun (especially with friends) but the pricing is a bit excessive, so for that reason I can't recommend buying this unless it's on sale or part of a bundle.",
            "review_score": "-1"
        },
        {
            "review_text": "I like this game, I really do. But 15$ for a single player game such as this one...? Are you guys in a desparate need for cash or something? Because you're basically doing a disgusting thing that a respectful buisness wouldn't have done, You are selling a barely finished product for a very unreasonable price. I bought 2 copies, one for me and one for a friend.. I figured, if I can't play matchmaking (and when I can - it lags like hell) At least I'll probably be able to play it with a friend who lives in my city (almost my freaking neighbour) and guess what?... WE STILL CAN'T PLAY. It lags to the point the game is almost unplayable, And both of us have very decent internet packages AND we live nearby to each other, so tell me, messhoff.. what the hell did I just pay 15$ x 2 for? THIS? I've been much, much more satisfied from games I've bought for 2-5$, I would have never paid 30$ for 2 copies if I had known you guys ----want to make money first, and work after----- that's a sneaky snakey way to get paid, you guys. I'm disgusted, and I'd either like a refund for 2 copies or at least ♥♥♥♥in show your presence, fix the damn problem, let us play it with friends.. DONT STEAL OUR MONEY. thank you.",
            "review_score": "-1"
        },
        {
            "review_text": "game runs on 20 frames no matter how good your pc is multiplayer host usualy teleports even if you kill him hes somewhere else killing you",
            "review_score": "-1"
        },
        {
            "review_text": "Good fun with a buddy on the couch, until your buddy gets mad, rages, and nearly breaks your nose. Then you are all alone, having no fun.      4/10",
            "review_score": "-1"
        },
        {
            "review_text": "This game does not work since I upgraded to Windows 10. It opens. The screen resolution changes, then it asks me if it can make changes to my computer... I tell it yes then nothing pops up.. then it self-closes without an error. I love this game.. but I cannot recommend it until it works again on a modern operating system, and game designers need to be held accountable for keeping their products up to date if they remain for sale on Steam.",
            "review_score": "-1"
        },
        {
            "review_text": "Good fun with a buddy on the couch, until your buddy gets mad, rages, and nearly breaks your nose. Then you are all alone, having no fun.      4/10",
            "review_score": "-1"
        },
        {
            "review_text": "Update: I originally rated this game positively, but since then there have been no updates to address the terrible lag in my favorite part of the game: multiplayer. And there is no word of the developers working on any extra maps leaving the game with only four maps and terrible multiplayer. Not happy. Until the developers fix this unplayable multiplayer lag and add more maps I wouldn't recommend this game.  Original Review: This game is REALLY fun! If you like platforming games and have a friend to play with, you will have hours of fun at a time. I've only played multiplayer with my friend so far so I have no comment on the single player but I bet it is equally as fun. I got it from a humble bundle (you only need to pay $1 on Humble to get this game along with two other fun games), and I am very happy with my purchase. I'm glad that I got a bunch of fun games and donated to charity all at the same time! My only complaint with this game is that it will occasionally lag in multiplayer, and will very rarely glitch my opponent one one screen closer to the winning screen sometimes. This is definitely not an issue with my very powerful PC or speedy internet, so I'm guessing it's just a bug that will likely be fixed. I highly recommend this game if you have friends. PS. It would be awesome if new maps are added on to the base game later in development to give it more variety. And just a pet peve of mine, it would also be nice if the game ran in full 16/9 ratio so I dont have the black bars at the edges of my screen",
            "review_score": "-1"
        },
        {
            "review_text": "Great game for singleplayer, lots of fun and more than worth the price if you get it on sale, but the multiplayer ruins it. The netcode is terrible, makes the game unplayable. I can imagine most people would buy the game to play with their friends, so without that feature it's somewhat lacking",
            "review_score": "-1"
        },
        {
            "review_text": "The game is stupidly simplistic. The controls are horrible for keyboard users. There's not much to the game. If you don't have friends to play with, a high tolerance for frustration, or a controller, don't buy this game. However, I can't really speak for people who DO have these things.",
            "review_score": "-1"
        }
    ]
}