{
    "app_id": 94590,
    "name": "Puzzle Agent 2",
    "release_date": "2011-06-30",
    "developer": [
        "Telltale Games"
    ],
    "publisher": [
        "Telltale Games"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements"
    ],
    "genres": [
        "Adventure",
        "Casual"
    ],
    "tags": [
        "Puzzle",
        "Adventure",
        "Point & Click"
    ],
    "achievements": 52,
    "positive_ratings": 588,
    "negative_ratings": 86,
    "price": 6.99,
    "description": "Agent Nelson Tethers just solved his biggest case yet. So why isn't he satisfied? Venture back to eerie Scoggins, Minnesota to solve the mystery of &quot;the Hidden People&quot; once and for all!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/94590/header.jpg?t=1447354362",
    "minimum_requirements": "OS: XP Service Pack 3 / Vista / Windows 7 Processor: 1.8 GHz Pentium 4 or equivalent (Rec: 2.0GHz Pentium 4 or equivalent) Memory: 2 GB RAM (Rec: 3GB RAM) Hard Disk Space: 500 Mb Space Free Video Card: ATI or NVidia card w/ 256 MB RAM (Rec: ATI or NVidia card w/ 512 MB RAM) DirectX®: Direct X 9.0c Sound: Direct X 9.0 sound device",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Puzzle Agent 2 is a game marred by plot inconsistencies and an unsatisfying story. While the characters and atmosphere pull the player in, the gameplay and story problems are overwhelming.  After competing Puzzle Agent 1, I was excited to play the sequel. Unfortunately, this game doesn't hold up. The story has suffered, as the overloaded plot crashes and burns in a chaotic confusion, leaving plothole debris everywhere. A list of which includes:     Agent Tethers keeps his job at the FBI despite returning to a case without authorization; breaking and entering into the local police department; tampering with government evidence; assaulting another government agent; espousing conspiracy theories to his superior; and stealing and destroying government property.   Mrs. Garrett did not want someone to know that Tethers was staying at her inn, but we never find out who or why.   It is never revealed what happened to all the missing people in Scoggins, because...   It is never established whether the astronauts are murdering the missing people or if this was another wild goose chase. Since there have been a few false leads in both games, intentional to the plot, there is no way to know.    This leads to another problem for the story: If the astronauts aren't murdering people, what's causing the disappearances? If the astronauts  are  murdering people, why didn't they murder Tethers when they cornered him and injected him with something to make him fall asleep?   It is never revealed what happened to the astronauts aside from Isaac.   Why did the astronauts remain in the forest for 16 years?   What are the Hidden People? Where was their home? What was their home?   Why did Glori and Isaac agree to go the Brotherhood if he was disturbed, when he never appeared to be disturbed?   Did the government know the space lander was in Scoggins since the first game? If they did, then why did they wait until Tethers sent back tapes in the second game to go there? If they didn't, why didn't they let Tethers finish the case is Scoggins the first time around? Why did they let Tethers stay in Scoggins after they found out he was there investigating a case off-duty?   This is a minor point, but Agent Tethers never draws his gun once in this game, even when his life is in danger. In the last game, I believe he uses it only once, and he misses. For some reason, the game's title card on Steam shows him drawing a gun. Again, I know this is a minor point, but why give him a gun if he never uses it? Especially since it's so easy to write in a reason he doesn't use one; He's an office agent in the Puzzle Research Division who almost never goes on field missions. There's even less of a reason for him to have a gun this time since he's not even on offical busniess. It just shows a lack of thought in the writing.      The list goes on. This is totally unacceptable and unprofessional story-writing. You can beat the game in under 2 hours (I've played the game a couple times to get all the achievements) and the number of plot-holes is unbelieveable. Why else would a game so short have a plot explanation on Wikipedia that's as long as a PhD dissertation?  I've heard great things about Telltale's more recent work, but there's still no excuse because Puzzle Agent 1 was satisfying as far as story goes. Yes, there were loose ends and mysteries at the conclusion, but the main goals were achieved and the mysteries were largely related to things out of Tether's control the whole time: He couldn't understand this odd little town, and he never would. It was over his head, and he caught a glimpse of something greater than he could ever imagine. The player is left intrigued. In Puzzle Agent 2, parts of the mystery are revealed and simply make no sense, leaving the player very frustrated.  The biggest problem with the first game were that the puzzles were inconsistent in difficulty and clarity. Here, it seems the difficulty has been smoothed out a bit, but they have lost variety and at times still have difficult to interpret rules. The biggest problem I had was that the puzzles had little to do with the story and actually broke the pace.  Not to say I disliked everything. Sheriff Bahg was my favorite antagonist from the first game, and his condescending skepticism of the meek FBI man Tethers is always so well-played. The voice acting for Bahg is excellent. The atmosphere in the game also retains it's X-files allure, and Tethers searching for clues is still exciting. Korka was an interesting new character, and she gave the story some funny payoff and comedy relief. I always liked Tethers as a character; he's an excellent straightman in a world full of insane people. He also always has this idiotic confused look on his face that's actually pretty endearing.  ACHIEVEMENTS: Since this is a point-and-click adventure game, this is pretty hard to screw up, but Telltale pulled it off. One achievement requires a perfect run of all puzzles in the game. Even if you beat the game with one failed attempt at one puzzle and go back to that puzzle after the conclusion of the story, it doesn't matter. You have to open a new file and play the entire game over and do everything perfectly. Kind of a waste of time.  Overall, the game is atmospheric, exciting and well-acted, but the gameplay and story problems are too great for these high points to overcome. Not recommended unless heavily discounted, you have played the prequel, and are looking for achievements.",
            "review_score": "-1"
        },
        {
            "review_text": "One of the easier reviews to figure - if you don't own Puzzle Agent, leave this page and check that one out.  If you enjoyed the first Puzzle Agent, pick up this one: it's more of the same, and continues (and finishes) the story. If you didn't enjoy the first one, you won't enjoy this one. Simple as that.",
            "review_score": "1"
        },
        {
            "review_text": "I didnt want to sleep ever again anyway 10/10",
            "review_score": "1"
        },
        {
            "review_text": "When the first  Puzzle Agent  released, it was an unexpected but welcome change from developer  Telltale Games 's typical point-and-click adventure game that they are know for. Given it's cliffhanger ending and complete lack of closure it was inevitable that a sequel would eventually emerge, and thus we are presented with  Puzzle Agent 2 , a direct continuation of Nelson Tether's previous escapades in the odd little town of Scoggins and a fitting end to the story that was begun in the last game.  Although it's marketed as a full sequel, PA2 is far more akin to a second episode, which is fairly typical of  Telltale . It ties directly into the ending of the original game, tying up loose ends and finally shedding a light on what happened to Issac Davidson, what have Nelson's visions been about, and who the heck are the hidden people. While many of the revelations are absolutely absurd taken in context with the rest the series they don't feel at all out of place, instead just one more bizarre happening in the day to day occurrences of a puzzle agent. I was very pleased to finally get some answers for the many questions that had previously been asked, and in the end everything tied up quite nicely (or as nicely as anything this unusual could).  Gameplay is identical to the original game, mixing Professor Layton-like puzzles with the Twin Peaks-esq setting and dialog to great effect. The puzzles are a bit fewer in number this time, but as a whole they are better designed and effectively tied into the story than before. Many characters return, with better writing and voice acting while still retaining the original off-kilter charm that made them what they are. I never did adjust to the stilted animation style, but like everything else has a unique appeal to it that works with the rest of the game.  If I had any problem with the game it's that it's short, shorter than it's predecessor, and yet costs twice the price. I couldn't say that the quality of either of the two games is far apart (I think both are excellent for what they are), but at double the cost of admission with less content, it's hard for me to recommend purchasing PA2 at least outright, and would definitely advise waiting for a sale.  Other than the length,  Puzzle Agent 2  is a treat for fans of the original. You're getting more of the same, and that's a good thing as so far there isn't anything else like the series available on Steam. Playing the first game should definitely be considered a prerequisite, and if you didn't like it then this won't change your mind. For those wanting for more this is a worthy sequel who's biggest flaw is actually being called one. Think of it instead as  Puzzle Agent: Part 2  and you're unlikely to come away disappointed.",
            "review_score": "1"
        },
        {
            "review_text": "  It's not as good as the first game and the story was taken to an unnecessary level of confusion, but it's still good. This needs a sequel! I would love to play this game with my choices actually making a difference, which is something that's missing from this series in my opinion.",
            "review_score": "1"
        },
        {
            "review_text": "If you're playing this game for a satisfying ending to the first Puzzle Agent, look elsewhere. If you're looking for a good puzzle game with really funny gameplay, you came to the right place.",
            "review_score": "1"
        },
        {
            "review_text": "A huge disappointment after playing the first.  Less thought provoking puzzles and more 'Move thing until it fits' Trial and errors. Shorter story. Really wish it was as good as the first one. It also crashed once it was beaten, so I couldn't see the ending.  Wish I had just let the first stick in my mind instead of getting this one.",
            "review_score": "-1"
        },
        {
            "review_text": "It has a brilliant story and great puzzles like Puzzle Agent 1! Buy it too!",
            "review_score": "1"
        },
        {
            "review_text": "This game is about solving puzzles [You don't say] And you play as FBI Agent Tethers.  Good Points:  -Nice graphics -Good idea of paint -Very good places  -Easy movements  Bad Points:  -Some puzzles are impossible to solve -Some puzzles don't make any sense -The game becomes slightly boring -You wander around until you actually KNOW what to do -No RADAR or Something that shows your current possition or your objective   I still recommend this game, even if it has alot of bad points, so yeah, worth it.",
            "review_score": "1"
        },
        {
            "review_text": "Another game, another ♥♥♥♥ and balls.",
            "review_score": "1"
        },
        {
            "review_text": "If you liked/played the first one you know what to expect, really fun and short game, and also easily to get 100%, be careful though , you might need a guide to not screw up the Puzzle agent achievement, since a mistake will make you restart the game if you want that achievement  7/10",
            "review_score": "1"
        },
        {
            "review_text": "Back to 'Scoggins' we go in this awesome sequel, even more wackiness and puzzles to be mastered, even better then the first game, loads of laughs with the original cast + new kooky 'scogginites' and a special guest apperience by 'samsquanch'. I had a great time with this series, would love to see a 3rd or perhaps something 'new' with Agent Teathers in it, all in all, good times - 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game, if a little short.",
            "review_score": "1"
        },
        {
            "review_text": "The biggest problem of this game is that it brings barely anything new to the table. It continues the story of part 1, reuses many locations and, most of all, reuses most puzzles. If you don't know these games, get the first one. If you already know the first one, you get more of the same and on that basis can decide if you want to pay for that.",
            "review_score": "-1"
        },
        {
            "review_text": "The Annable-illustrated and written puzzle game is back, but this time with more of the watered down puzzle mechanics and less of the wonder and style that made the first one unique. TellTale's second title did manage to tie all the loose ends from the first, and sets the stage for the next one. A definite letdown for a game that could have done more with the setting. 2/5",
            "review_score": "-1"
        },
        {
            "review_text": "The resolution to the puzzle agent mystery is unfortunately a little dissapointing, having both less charm and suspense and the variation in the puzzle types falls a bit short of what I wanted.",
            "review_score": "-1"
        },
        {
            "review_text": "A fun and quirky puzzle game with a very enjoyable story.",
            "review_score": "1"
        },
        {
            "review_text": "More of the first, but still enjoyable. I'm going to start right off saying PA1 was better, but with the 'open case' from PA1, PA2 was really needed to seal the deal on the story. PA3 may come from PA2's ending, but it's not left open like PA1 was.  The ending of the story of the 'Hidden People' and the soundtrack was enjoyable in PA2. I also felt the puzzles were a bit easier, but I still had 2-3 I 1 star'd because I just couldn't get the hints to click.",
            "review_score": "1"
        },
        {
            "review_text": "even slightly better than first one !",
            "review_score": "1"
        },
        {
            "review_text": "If you've played Puzzle Agent you will now be able to ifnish the investigation in Scoggin's with Agent Tether.  Story builds upon the events in Puzzle Agent, so you meet familiar characters. It's good value if you can rab it while you it's on Sale.  Note: I had to play offline once and I finished the game. Unfortunately, after reconnecting to Steam, I did not receive the Staem Achievements.",
            "review_score": "1"
        },
        {
            "review_text": "Things I got:    Another Puzzle Agent game  Things I still need:   Some hot dish  This game is even better than the first game, and improved in many ways. The twists are better and I thoroughly enjoyed my whole playthrough.",
            "review_score": "1"
        },
        {
            "review_text": "Really nice and amazing sequel! I enjoyed it a lot! The adventures of Agent Tethers are continued and he goes to the core of the problem! =)  - Intersting gameplay - Amazing puzzles and story - Achievements! - Simple Graphics - Great sound effects - Great voice acting  only minus (for me at least) is that i found many puzzles a bit too easy than i hoped (but that's just my opinion)  Game is 10/10 Price is acceptable and i suggest you to buy it :)",
            "review_score": "1"
        },
        {
            "review_text": "Childs game part 2",
            "review_score": "1"
        },
        {
            "review_text": "A satisfying conclusion to the story which began in Puzzle Agent.  More of the same great direction, writing and puzzle solving. Compelling stuff!",
            "review_score": "1"
        },
        {
            "review_text": "A fun little humorous game. Some puzzles can be a little challenging. I hope Telltale can fit in another episode between all their bigger projects.",
            "review_score": "1"
        },
        {
            "review_text": "A fun and quirky puzzle game with a very enjoyable story.",
            "review_score": "1"
        },
        {
            "review_text": "anything telltale games has a great story, as long as you like what the game is based off of you will not be dissapointed",
            "review_score": "1"
        },
        {
            "review_text": "Pretty much exactly the same as the first game, Puzzle Agent 2 follows Agent Nelson Tethers of the FBI's Puzzle Research Division as he continues his investigation of the Scoggins area and it's mysterious happenings. The puzzles felt a little weaker this go around but the story was about as good.",
            "review_score": "1"
        },
        {
            "review_text": "Herschel Layton is infinitely more macho than Nelson Tethers. It's the truth.",
            "review_score": "1"
        },
        {
            "review_text": "The Story of Puzzle Agent 1 ends with a cliffhanger that is now resolved and we finally get some answers to our questions. The formula is the same as the first game, adventure with puzzles, though this time, they are more challenging and there are more of em. If you got the first part you need the second one to wrap things up and understand what is going on. Again, a nice entertaining game in between.",
            "review_score": "1"
        },
        {
            "review_text": "Puzzle Agent 2's story is as great as the first one, but the puzzles themselves is kinda let down. Some puzzles are reused, some are too hard without hint, and too many 'generic' puzzle types (such as rotating pieces, rearrange items). Overall Puzzle Agent 2 is still a good adventure game, but just not as good as the first one.",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant storytelling, I class this as a play yourself movie, took me about 3h to run through the whole thing.",
            "review_score": "1"
        },
        {
            "review_text": "i love puzzles, . even those easy ones. :) a mystery underneath just makes it more fun. .... and better than the first one.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Very story driven with good puzzles.",
            "review_score": "1"
        },
        {
            "review_text": "A lovely little game that I am almost ashamed at how much I used a guide. A nice break from blowing things up. Puzzles, humour, mystery, it was a good bit of fun. Took next to no time to 100% it either.",
            "review_score": "1"
        },
        {
            "review_text": "The easiest way to sum up this game is to say, if you liked the first game, then you will probably like this game as it is more of the same. This game really doesn't do much to improve upon the first game, but it also doesn't break anything. It's got fun puzzles and a quirky story (which, fair warning, you probably will find confusing if you haven't played the first game). All in all, this is a solid puzzle game that's pretty addicting for the short span of time the story lasts.",
            "review_score": "1"
        },
        {
            "review_text": "Played through both games and some of these puzzles are just illogical , and some are just too easy. Story was okay if you play through both...",
            "review_score": "1"
        },
        {
            "review_text": "I don't understand what went wrong.  The first game was pretty solid. Good varience in puzzles with varying difficulty (a few poorly worded and broken), conveying plot.  This was a culmination of 'guess-and-check' puzzles, with 'outside knoweldge' puzzles. 'Here is a series of numbers. What comes next?' was used at least 4 separate times, even more if you include the times when it was reskinned with coins or something similar. Do you know how many    days of are in each month of the year, when added all together one by one    ? How about    reconizing binary when the counting units are coins    ? This knowledge had nothing to do with the game, so here I was multiplying and dividing and square rooting these numbers trying to find what they had in common, but no, they were just    how to count on a clock, 11, 12, 1, 2     Finish the pattern puzzles, spin the thing to make it line up puzzles, bounce the laser around puzzles, move the blocks around puzzles. There wasn't a single unique puzzle in this entire game, even unique to itself. All of the puzzles in this game have been done to death, were used at least once in the previous game, and repeated at least once in this game.  I was disappointed with the first Puzzle Agent game, due to the poorly written and downright difficult to understand puzzle decriptions at times, but at least it tried to be unique. It felt like a challenge. This on the other hand, well, I hope you can spin squares around to match them up.  And as a separate issue, on the last puzzle I had a glitch where the main items of focus didn't even render. They were black squares. Through the final puzzles, through the very end of the credits, I had no idea what the items of interest were. Even the after-credits scene didn't load properly. I hadn't had that problem with either of the games up until that point.  So I got to shlep through 5 puzzles with different skins for four hours without even a final feeling of completion.   Rad.",
            "review_score": "-1"
        },
        {
            "review_text": "Probably my favorite game of all time. Played through both Puzzle Agent 1 &amp; 2 about 5 times. I played it the first time through with my brother, an amazing experience I'll never forget. We always used to play these kinds of games when growing up and this one blew us away. Awesome story, chilling yet inviting. I love this game and it's prequel.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Puzzle Agent 2 continues story from where Puzzle agent left off, throwing more puzzles at the player, that with addition of great story makes game enjoyable.",
            "review_score": "1"
        }
    ]
}