{
    "app_id": 9500,
    "name": "Gish",
    "release_date": "2007-07-20",
    "developer": [
        "Cryptic Sea"
    ],
    "publisher": [
        "Chronic Logic"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player"
    ],
    "genres": [
        "Indie"
    ],
    "tags": [
        "Indie",
        "Platformer",
        "Physics"
    ],
    "achievements": 11,
    "positive_ratings": 160,
    "negative_ratings": 94,
    "price": 5.99,
    "description": "Gish isn't your average hero. In fact, he's not your average anything...you see, Gish is a ball of tar. A Sunday stroll with his lady friend, Brea, goes awry when a shadowy figure emerges from an open manhole and pulls Brea below ground.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/9500/header.jpg?t=1447351091",
    "minimum_requirements": "Windows 2000/XP/Vista, AMD, Intel or G3 1000+ Mhz processor; OpenGL Compatible 3D Graphics adaptor (ATI, NVIDIA, Intel, etc.) with 32 mb of video memory; 256MB of memory Recommended: AMD, Intel, or G4 1500+ Mhz processor; OpenGL Compatible 3D Graphics adaptor (ATI, NVIDIA, Intel, etc.) with 64 mb of video memory, 256MB of memory",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Don't pay attention to where it says I only played this for one hour. Gish is one of the games I had before they started recording that information. Anyhoo, this game is a lot of fun. The mechanics of the game are really different from other games I've played, which is a good thing. I like the art style, as well as the music. I do remember the game having a few bugs, but nothing that I found to be game breaking.",
            "review_score": "1"
        },
        {
            "review_text": "It's a good thing and it's really |=ucking hard to play and agravating.",
            "review_score": "1"
        },
        {
            "review_text": "An interesting platformer with a fun game mechanic. A quick play, but worth picking up.",
            "review_score": "1"
        },
        {
            "review_text": "This is really old, but the game had the freshes gameplay ever seen.",
            "review_score": "1"
        },
        {
            "review_text": "i don't even know what this game is",
            "review_score": "1"
        },
        {
            "review_text": "This is a pretty cool game. It was the first major game by one of the main people behind Super Meat Boy.",
            "review_score": "1"
        },
        {
            "review_text": "Yet another game for people who like black balls of goo",
            "review_score": "1"
        },
        {
            "review_text": "Gish is one of the oddest games ive ever played, a sort of puzzle platformer slash action game, and Binding of Issac creator Edmund Mcmillen's first creation, it truely has a little bit of everything. Granted, it is a challenging game but take into consideration, its not impossible. Give it a try, and get sucked into the sticky and slippery world of GISH.",
            "review_score": "1"
        },
        {
            "review_text": "Gish is a game I don't actually enjoy playing. I could not play it when it came out and I can only play it marginally better now. Still a cool game that was on the forefront of physics based hybrid action puzzlers. 5 Tar Balls out of 5 Stars (this is actually not that good a rating because tar=/=stars)",
            "review_score": "1"
        },
        {
            "review_text": "It's a fun little platformer, good for killing a boring afternoon. Not for everyone though.",
            "review_score": "1"
        },
        {
            "review_text": "NOTE: Steam version has not been (and is unlikely to be) updated to the latest / final version.",
            "review_score": "1"
        },
        {
            "review_text": "It is overly buggy. I seem to die for no reason sometimes.",
            "review_score": "-1"
        },
        {
            "review_text": "Bad music, bad gameplay. It's one of many in my 'crappy indie stuff' folder. This should at least be free. If you're buying it, you're paying for the smooth graphics and the capitalized 'G' in the title.",
            "review_score": "-1"
        },
        {
            "review_text": "A clever and different platformer that's quite a bit different than others...at face value. Pretty fun, until you realize how frusterating this game is due to buggy deaths. Many of the platforms that move kill you randomly when they move fast, the lives system is terribly designed and just outdated. This becomes obvious once you hit the hell themed levels (world 3) and it gets significantly more difficult. You get 6 lives to get though every world which consists of 5 levels. If you die 6 times in any of those levels, you are sent back to the first level in that world. That may not sound so bad, until you experience randomly dying from stuff you didn't die from earlier. It just comes off as poorly designed and unfair.",
            "review_score": "-1"
        },
        {
            "review_text": "The idea of mechanics in Gish are innovative and creative, but the controls and implementation are absolutely horrible. The music gets repetitive, as it remains the same for several levels without changing. Then, there is the awful pseudo metal music with wailing that is completely unbearable. The game does not fit the entire screen even if you selected full screen in the settings. There are additional bonus levels as well as fan made levels that can be downloaded, but there aren't any reasons to bother. Plus, there are the local Versus multiplayer and Collection modes, with multiplayer possibly being where Gish may shine, as two people suffering through the horrible controls, physics, concept, and design might actually be funny. Each level is short but of adequate length because of the horrible controls, mechanics, and the time it actually takes to complete many of them. The story is nearly nonexistent, and the few parts where you are given a bit of background information on the character, it cuts off prematurely, without giving you a real chance of reading it. The level design is not well done, nor is it clever. They rely on the repetition of them for longevity and game play. The more difficult levels will force you to repeat them an extreme amount of times until you are able to get the horrible controls tamed. Once you are able to pass these levels, there is no feeling of accomplishment, and you are not rewarded for any of your success. The artwork is plain and unmemorable, going along with the game's general lack of charm. There is simply nothing interesting to look at while playing. Gish is not a platformer. It is an exercise in frustration and patience. The controls, mechanics, and physics are the worst I've ever experienced in a game. Accomplishing a simple, single jump, is something synonymous with a miracle, or some kind of supernatural phenomenon, if you believe in these sorts of things. The platforming (if you can call it that) is so disastrous, it is comparable to bouncing jello/jelly off of pieces of Legos, and hoping for the best. The controls are outrageous. I have never attempted a game with controls this unreasonable. It's like playing with a severe physical handicap. Gish is nearly unplayable. In the later levels, the only reason why they are able to be completed is almost by pure luck. The skills garnered by playing this game are so unprecise, that they can not be considered actual skills at all. It is a matter of chance that the physics of this train wreck behaved a certain way in order for you to proceed through the levels. I am a veteran of old school platformers, and never have I been so frustrated at the shortcomings of games of the genre before Gish came along. It is an example of game development malpractice and poor implementation of all aspects involved. Gish is quite possibly the worst game I have ever played. There is no excuse for a game of such rotten design to come out in 2004, let alone charge people to play it. Gish is a perfect example of how not to make a game.  Gish is awful.",
            "review_score": "-1"
        },
        {
            "review_text": "Gish is like a warm embrace from a large, sweaty man after a marathon. You appreciate the love, but find it utterly repulsive in the end. It wishes it could do a lot of things, but falls short of most of them. Clunky controls that might be impossible to master quickly lead to rage quit worthy amounts of frustration. This game tries to pull its weight with its quirky charm, but falls flat on its face after its first few steps, much like the large, sweaty man.",
            "review_score": "-1"
        },
        {
            "review_text": "I couldn't get into it.",
            "review_score": "-1"
        },
        {
            "review_text": "Gish comes from 2004, a time when every single game had some physics gimmick (Half-Life 2 was released around that time, too). Gish implements a nice physics engine in a 2d game, but then DESTROYS any chance of being a good game due to one very stupid decision: limited lives. It isn't a problem in the first or second world, but then there's a LOT of instant-deaths in the third (the 'fall in the lava and die again' world). You don't combine these two things, instant-deaths and limited lives. It's not 'challenging'; it just turns boring to do levels 3-1, 3-2, 3-3, 3-4 and then die on 3-5 because of a tiny mistake that throws you back to 3-1. Games like VVVVVV work because, even if you die a lot, you don't have to do again previous levels - even if it is hard as balls, it never becomes boring.  And the worst thing is: since Gish is a physics based game, your movement can't be very precise (as in VVVVVV), so you are prone to more mistakes and stupid deaths.",
            "review_score": "-1"
        }
    ]
}