{
    "app_id": 95700,
    "name": "The Cat and the Coup",
    "release_date": "2011-06-15",
    "developer": [
        "Peter Brinson and Kurosh ValaNejad"
    ],
    "publisher": [
        "Peter Brinson and Kurosh ValaNejad"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Partial Controller Support"
    ],
    "genres": [
        "Free to Play",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Free to Play",
        "Cats"
    ],
    "achievements": 0,
    "positive_ratings": 823,
    "negative_ratings": 52,
    "price": 0.0,
    "description": "In The Cat and the Coup, you play the cat of Dr. Mohammed Mossadegh, the first democratically elected Prime Minister of Iran. During the summer of 1953, the CIA engineered a coup to bring about his downfall.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/95700/header.jpg?t=1553475273",
    "minimum_requirements": "OS: Windows 10   Memory: 4GB RAM  Dedicated Video Card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "A short but interesting game. The concept is engaging, and I learned some history as well. Definitely worth the time.",
            "review_score": "1"
        },
        {
            "review_text": "This brief work of art in Parajanov/MontyPyton style ends abruptly into some photo chronicle, yet it is brilliantly made and lefts wishing it were much longer to tell more of the story. Everyone should try it.  Короткое произведение искусства в духе Параджанова и Монти Пайтон резко заканчивается фотохроникой, но сделано прекрасно и оставляет лишь желать продолжения истории. Каждому стоит попробовать.",
            "review_score": "1"
        },
        {
            "review_text": "A brief, solemn experience that I highly recommend for one of those rainy days.",
            "review_score": "1"
        },
        {
            "review_text": "8.5/10 - 13 Minute Documentary Style Game!  I really dig this style. I love documentaries and games so putting the 2 together is a clever move. You play as a cat to the first democratically elected Prime Minister of Iran. Different simple destruction based puzzles trigger new events and progress the biography.  The art is brilliantly done and I actually retained quite a bit of information from this short game. I'd like to see more of this genre!  FREE - A wisely spent 15 minutes.     Accidently Reviewed",
            "review_score": "1"
        },
        {
            "review_text": "Short, fun, free, interesting and novel. What's not to like?",
            "review_score": "1"
        },
        {
            "review_text": "A very original way to view a very important part of Iran's history. One of the first steps I have ever seen to document history in a video game.",
            "review_score": "1"
        },
        {
            "review_text": "Okay, I don't get it, well, I slightly get a part of it, I know it is about some guy, and it is interesting.  It is a nice art game, I would recommend checking it out since it is free.",
            "review_score": "1"
        },
        {
            "review_text": "This took me 16 minutes to complete. It has effecting haunting music from NIN. It's a physics game at heart, the gameplay is minimal, it's more like an interactive story book. The art style has been compared to Monty Python, but it is more like an early illustrated book. Good game, well worth a look considering it's free.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game, the story of the cat and its master is really quite touching, it brought tears to my eyes, its really quite depressing, but its a magical experience and I'd recommend it to anyone, its relatively short but those 11 minutes were some of the best moments of my life. A++, Play it. Can't recommend it enough, its art at its finest. The developers really knew what they were doing when they created this magical gem, all of my friends haven't played it but are turned off, simply cause of the art style, even though its actually quite ingenious. Play this game, I could go on and on, but I don't really want to make a huge wall of text, Farewell my friends. P.S Play The Cat and the Coup.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent piece of interactive history - narrative. Very short, very different.",
            "review_score": "1"
        },
        {
            "review_text": " Short Review",
            "review_score": "-1"
        },
        {
            "review_text": "This is actually a very neat little game. The concept of combining documentary and game actually works with the way the designers did it. Although I was already aware of this little part of recent history, it is good to know about if you do not know about it.",
            "review_score": "1"
        },
        {
            "review_text": "This isn't so much a game as it is a documentary. It's rather short, but it provides a good insight into the life of Iran's first democratically elected Prime Minister. Its 'gameplay' is simple, you just have to do typical cat stuff to make Mossadegh move through his life.",
            "review_score": "1"
        },
        {
            "review_text": "textbook game for story telling",
            "review_score": "1"
        },
        {
            "review_text": "lols u totally gotta get catcoup. 1/10 game 10/10 interesting historical information. more at home on huffington post than steam.",
            "review_score": "1"
        },
        {
            "review_text": "An abstract but simple puzzle game about a cat and a ghost, with some great visuals. Calling it a game is maybe too strong, more of an interactive story, about the life of Mohammed Mossadegh a former Iranian Prime Minister. It will only take you 20 minutes or less to finish this out.",
            "review_score": "1"
        },
        {
            "review_text": "Not so much a game as an interesting way to present the story. Worth checking out if you have 15-20 minutes to kill, especially if you're not familiar with the history behind it.",
            "review_score": "1"
        },
        {
            "review_text": "What the hell is this!?!",
            "review_score": "1"
        },
        {
            "review_text": "A very short, informative and insteresting game with a unique style. Game play is simple which keeps the focus on the story and information. It's free and small file size so sure can't complain. Worth a try. You could even finish this while on a coffee break.",
            "review_score": "1"
        },
        {
            "review_text": "It's not a 'game' actually. It's a story. A short story. Very unusual experience. It totally worth the time. I liked it. I think I will walk through it once more later to watch details carefully.   And one more thing i should warn you: it is related to politics.",
            "review_score": "1"
        },
        {
            "review_text": "It asks you for 5 minutes of your gaming life to present you a unique and bizzare-poetic story which left me indifferent. Anyway you should invest these 5 minutes for something different",
            "review_score": "1"
        },
        {
            "review_text": "The Cat and the Coup is a nice little addition in favor of the 'games can be art' debate. It's quite short, but doesn't need to be long to get its point across. It is part history lesson and part surrealistic visual story, and although the game play is sparse, it's still there. This game wasn't 'fun' in the traditional sense, but rather it was more intriguing, as well as somewhat haunting with it's bizarre imagery coupled with the sad lingering soundtrack.   For those who didn't understand the metaphors in this game, I will explain below.  Scroll down or 'read more' for spoilers.                            You play as the black cat, traditionally established as a symbol of misfortune, who manipulates the various items and situations in a series of rooms. By doing so, you move Dr. Mossadegh through those different rooms as he struggles to adapt to the changes you are indirectly creating. Note that at no time is it stated that the cat belongs to Dr. Mossadegh, but rather it is a cat that incessantly follows him around.   The rooms are a double-metaphor serving as both the various political/social occurrences at the time, and as stages of Dr. Mossadegh's life. The cat is a metaphor for the CIA. The cat's behavior is the covert tampering that CIA agents performed to maneuver Dr. Mossadegh into the situation where he would be removed from power. The bulldog represents British interests who, behind closed doors, asked the Americans for undercover aid to depose Dr. Mossadegh from power. The reasons for Britain doing this are spelled out at the end of the game in the vertical assent back through the imagery the cat initially fell downward through. So, long story short, when you play this game, you play as the CIA covertly creating a social/political environment necessary to bring about a coup in Iran in the 1950's.   Why was the story told in reverse? I assume that is just artistic license in story telling, but I could be wrong.",
            "review_score": "1"
        },
        {
            "review_text": "That was really dang cool, the art was fantastic, i loved the surrealism put into it, and the music, the puzzles were fairly easy, and it was over-all fantastic. By the time your done reading this you culd have it downloaded, c'mon! TRY IT!",
            "review_score": "1"
        },
        {
            "review_text": "I saw this game on a friends library, and decided to check it out  11/10, especially for a free game... about 5 minutes of a history lesson of the later part of the career and life of a democratically elected leader  Beatiful Art made by a mix of Arts... Great story, fiction cannot beat the tragedy of real historic events.  while playing this game I was reminded of another game 'The Plan', although The Plan possibly could be true, this is by far a more depressing story. (unless you of course dont care about the place or its people or its effects on you...)  To the Devs, Wonderful job getting this story out there!  So many tragedies are being writen every day, there is pleanty more material for them to build off... heck, a second one in Iran alone about 21 years after this story ends...",
            "review_score": "1"
        },
        {
            "review_text": "Interesting, I recommend",
            "review_score": "1"
        },
        {
            "review_text": "Finally got it to work. It's a bit glitchy, but very beautiful. If you don't bat the clock in the beginning fast enough the game just crashes. Also at the end I have to force quit the game as it crashes right after the credits.",
            "review_score": "1"
        },
        {
            "review_text": "It is what it is. What it isn't is fun or informative.",
            "review_score": "-1"
        },
        {
            "review_text": "Terrible. Pointless. You 'swat' like three things and you're in for a boring history lecture.",
            "review_score": "-1"
        },
        {
            "review_text": "Waist of time",
            "review_score": "-1"
        },
        {
            "review_text": "boring ",
            "review_score": "-1"
        },
        {
            "review_text": "I have to say, this game needs to be played. It shows a possibility in games that most wouldn't have thought existed.  And it teaches you about the Iranian revolution. So there's that.",
            "review_score": "1"
        },
        {
            "review_text": "Free, and a quick but profound experience. The gameplay is based on very simple 2-D physics puzzles, and it took me ten minutes to play through, but the game is very, very beautiful and rather haunting. It teaches its subject sparingly, but effectively. This is a wonderful game that I'm very glad I took the few minutes out of my day to play. I'd love to see more like it.",
            "review_score": "1"
        },
        {
            "review_text": "Cats are cool therefore this game gets bonus points for featuring the main character as one of our furry feline friends, plus the art style is pretty dope.",
            "review_score": "1"
        },
        {
            "review_text": "So beautiful, so true. Fascinating. Must-play",
            "review_score": "1"
        },
        {
            "review_text": "This game is meant to be more educational than anything else. It's not fast-paced, but instead is simple and leisurely-paced. It goes through the tale of an Iranian coup in the 1950s. In this, you play the cat, the instigator of change to lead the story. Overall, it's less something that you play, and more something that you watch unfold.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most depressing and metaphorical games I've ever played. This requires deep thought off the computer. No, this isn't good because of the graphics, gameplay, or replay-ability. This is great because of the emotions it evokes and the overall tone ala Exoptable Money. And, no, the game isn't just about the Iranian Oil Crisis of 1951-1967. It's much more than that.",
            "review_score": "1"
        },
        {
            "review_text": "An excellent, thoughtful little game. LOVE the art and music! I was mildly familiar with this part of history before I played the game, which probably helped my enjoyment, but I don't think you need to know Iranian history in detail to play.   It feels like as the cat, you're guiding Mossadegh through a sort of purgatory where he relives his most challenging, painful memories, and it's your job to snap him out of it so he can move on. By the end of the game I felt a great deal of respect and sadness for Mossadegh.",
            "review_score": "1"
        },
        {
            "review_text": "Instructive.",
            "review_score": "1"
        },
        {
            "review_text": "I learned that lizard people run america.   Also the story was sad and the cat is mean.",
            "review_score": "1"
        },
        {
            "review_text": "An important 10 minute history lesson of the US backed coup of democratically elected Mossadegh, all because he nationalized oil. I welcome more games like The Cat and the Coup, games that teach us valuable history.",
            "review_score": "1"
        },
        {
            "review_text": "This is a short story... nice made :) Poor dude in game...",
            "review_score": "1"
        },
        {
            "review_text": "It is actually not a game but a rather artistic 15 min remembrance of events surrounding the rise and fall of prime minister Mohammad Mosaddegh, blaming context and circumstances such as the USSR and the US getting involved, including the manipulation of the media and the Majlis. It is sad how things worked out in Iran but denial of what happened has been worse on the long term.",
            "review_score": "1"
        },
        {
            "review_text": "A huge series of events in Iranian history condensed into 15 minutes of enjoyable artisitic design and gentle puzzling.",
            "review_score": "1"
        },
        {
            "review_text": "A great little 10m educational/historical 'puzzle' game. Look - if I paid money for this I'd probably be disappointed, but for free.... it's brillant, touching, artistic, and thought-provoking. Well done!",
            "review_score": "1"
        },
        {
            "review_text": "Well time for another review. Tha Cat And the Coup   Art Well.... This is one of the most BEAUTIFUL GAMES I've ever played. It's really a work of art. No joke This game IS LITTERLY ART.  Gameplay When I first saw this game I came in hating it. When I beat it I loved it. It has fun ad intersting gamplay. The Story Well you are a cat hints the name, That is trying to get rid of I forgot his name from screwing over the oil indsurey. Thats pretty much it.  The Flaws Not much really just needs to be a bit longer. Thats it.  The Verdict  Well 10/10 Amazing,Exellent.GET NOW AND STOP STAREING AT THIS REVIEW",
            "review_score": "1"
        },
        {
            "review_text": "guys this is a very coll game there is much new weapons i really recommend it",
            "review_score": "1"
        },
        {
            "review_text": "Great little game, that exposes a piece of history you hear little about.",
            "review_score": "1"
        },
        {
            "review_text": "completely unreviewable. some indie people trying too hard to be artsy to hide the fact they can't make a good game",
            "review_score": "1"
        },
        {
            "review_text": "-Visually appealing. -Easy to complete the given tasks as the cat, kept me alert and aware. -Instrumental was calming. -The facts were informative.  It's not difficult to set aside 15 minutes to complete this game. It was a wonderful experience and I would play more things like this.  ",
            "review_score": "1"
        },
        {
            "review_text": "I wish there would be more little presents like this, considering the amount of time necessary to finish the 'game' this has to be free as it is, but the wonderful style and interesting facts are well combined and remind me of older games like Myst somehow... you should give it a try although you will be through in less than half an hour.",
            "review_score": "1"
        },
        {
            "review_text": "Very short, but it's free to download and play, and you might learn something. A work of art.",
            "review_score": "1"
        },
        {
            "review_text": "Despite the straightforward in-game mechanics and my considerable experience with the surreal, it took awhile for me to wrap my head around the puzzles, due to the sheer strangeness of it all. Thought-provoking, beautifully detailed and immersive. If I've any complaint, it's the shortness of the game and the lack of time to fully enjoy the symbolism worked into some of the scenes. A worthwhile playthrough for history and art lovers nonetheless.",
            "review_score": "1"
        },
        {
            "review_text": "Neat!  'Neat'?!  What? It caught me off guard! What did you want me to say?! What would you have said?  Uh... 'weird.'",
            "review_score": "1"
        },
        {
            "review_text": "Short, sweet and educational. Was engaged and fully focused in the short time span. Also loved the collage art style. Looking forward to more of these!",
            "review_score": "1"
        },
        {
            "review_text": "Its an awsome puzzel game but it took me like 15 minutes to compelete but support them they are awsome!!!",
            "review_score": "1"
        },
        {
            "review_text": "This game was a great experience combining history, artsy stuff...among some others. Its short, seet, and informally informative",
            "review_score": "1"
        },
        {
            "review_text": "a very interesting game that excelently shows how games can be used in art it's a VERY short game (no really, took me 15 minutes) however still fun puzzle based solving game not a whole lot more to say that the game description won't",
            "review_score": "1"
        },
        {
            "review_text": "+ good timeconsumer, might learn something, if yoiou read the text, nice story. ITS FREE!!  - pretty boring, you press the arrow keys to move the cat and spacebar to knock things over, basic cat ♥♥♥♥.  download it if you are bored. nothing really good about it. 10 minutes of gameplay. more or less. calm music you can play if you wanna fall asleep really.",
            "review_score": "1"
        },
        {
            "review_text": "It's about a cat .....? Who gets his owner to trabel back in time?",
            "review_score": "1"
        },
        {
            "review_text": "The game was pretty nice it gives you a nice overview, and it was fun playing as the cat. i encourge the team to update the game and include more details and make it longer id buy it. i also wish to find more games like this a great way to learn and have fun.",
            "review_score": "1"
        },
        {
            "review_text": "A rather unique experience to say the least. This had a great artistic interpretation to this event. The history that they presented here was very well laid out an cleaverly told. The controls were a bit wonky at times and one of the puzzels didn't have a very clear objective but those are minor annoyances. I highly recommend downloading this title. It's only 20 minutes long and it is free. So what do you have to loose?",
            "review_score": "1"
        },
        {
            "review_text": "One of mister Langley's attempts at running the world. Move along, nothing to see here.",
            "review_score": "1"
        }
    ]
}