{
    "app_id": 95900,
    "name": "Air Conflicts: Secret Wars",
    "release_date": "2011-07-15",
    "developer": [
        "Games Farm",
        "3Division"
    ],
    "publisher": [
        "Games Farm"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Achievements"
    ],
    "genres": [
        "Action",
        "Simulation"
    ],
    "tags": [
        "Simulation",
        "Action",
        "Flight"
    ],
    "achievements": 25,
    "positive_ratings": 167,
    "negative_ratings": 111,
    "price": 4.79,
    "description": "Soar through the unfriendly skies in Air Conflicts: Secret Wars - an arcade flight simulation set in World War I and II era. Buy before July 21st and save!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/95900/header.jpg?t=1447354357",
    "minimum_requirements": "OS: WINDOWS XP/WINDOWS 7/WINDOWS VISTA Processor: INTEL/AMD CPU (1.1GHZ+) Memory: 1 GB RAM Graphics: SHADER 3.0 COMPATIBLE GRAPHICS CARD WITH 256 MB RAM Hard Drive: 4.5GB HDD SPACE",
    "recommended_requirements": "OS: WINDOWS XP/WINDOWS 7/WINDOWS VISTA Processor: INTEL/AMD CPU (1.8GHZ+) Memory: 1.5 GB RAM Graphics: GEFORCE 9X, OR HIGHER GRAPHICS CARD WITH 512MB RAM Hard Drive: 4.5GB HDD SPACE",
    "reviews": [
        {
            "review_text": "Air Conflicts: Secret Wars is an arcade flying game published by bitComposer Games.  Set in World War 2 with linear storyline. It's not about military power of the Nazi, Red Army or even RAF. It's about a person who try to survive in the war that consumes many other. But of course, you will be joining the Allies in the war against the German. From the desert of Tobruk to the plains and forest of Europe, you fight for your survival.  Air Conflicts: Secret Wars has good gameplay, it's just since the game is about a person, it doesn't have so many great battles and some of it are stealth mission. Still, it's a challenges, not a bad game for me. The graphics is quite good, the sounds are good and the music is kinda good. I still recommend this if you like arcade games.  Rating 6/10",
            "review_score": "1"
        },
        {
            "review_text": "Plus: Great arcade flight simulator! Decent graphics and reasonably challenging gameplay make this a winner. Interesting storyline, and no noticable graphic or audio flaws. Fast load times. Level skip feature, on the off chance you cant get past a level. Minus: Simulation controls are nigh impossible to smoothly work with. Storyline is kind of wandering. Infantry and paratroopers are rediculously difficult to hit although you are required to at times. 8/10 Overall: For what it is, its a pretty solid little plane game, with decent graphics and sound, and fun gameplay if you use the arcade control scheme with a controller.  AMD Phenom II X6 1100T 3.3Ghz. 6GB DDR2 2.5TB 7200RPM, 16MB, SATA II 16MB/s Cable/N300 Wifi XFX 2GB Radeon 6950 Vizio 42' 1080P 3D LED",
            "review_score": "1"
        },
        {
            "review_text": "Air Conflicts: Secret War is a sequel of the original Air Conflicts from 2006. It is an arcade turn-and-burn WW2 flight game with some interesting story line rarely covered in WW2 games: the Balkan conflict, and how the resistance in Poland, Azerbaijan, and other eastern European countries fought the Nazi invasion. You play the daughter of a WW1 Ace, 'Deedee' as you attempt to work your way out of Africa into Eastern Europe, attempting to work your way through the war, as sort of a mercenary / smuggler for hire of the Allied side, along with your mentor Tommy (who flew with your father) and Clive, the best mechanic / drunk. You start working for Flight Captain McIntyre of the RAF, but you'll end up helping a lot fo different factions on the Allied side, not all of whom are that friendly, as you attempt to survive WW2.   The game has quite good graphics, and fully supports high resolution screens, as well as all sort of eye candy, from bump maps to high polygon models to post processing effects, and more. However, your windows need to use the regular DPI instead of any enlargement (125% or 150% under display) or you won't be able to run the config program as you can't see the buttons. Sound is quite good.   The game play has variety of mission types, such as eliminate all enemies. Though it's the timed missions, as well as the 'plinking' missions that are the most frustrating. As an example of timed mission, you have to destroy advancing German tanks within 2 minutes (or they'll fire upon the convoy and you'll fail the mission). Another example is the 'plink the parachutes' mission... German transports are bringing in paratroopers. You need to shoot down the paratroopers. Yes, you are here to shoot parachutes (WTF?!) And you need to shoot dozens and dozens of them... until you killed at least 12% of those darn parachutes. There's another one where 'kill 70 soldiers on the ground with bombs or strafing'. YIKES.   That parachute missions is the most hideous I've encountered so far, with the 'kill 70 soldiers on ground' a close second. And I don't mean the objective, but the sheer frustration attempting to finish such. The parachute mission lasts 12 minutes, and you are barely informed of how you're doing. You simply keep shooting parachutes until you get a 'pass' or 'fail'. And yes, the paratroopers will scream as they fall from the sky. Same with ground soldiers you kill.   On the other hand, there are some missions that are more... subtle, such as the 'smuggle' missions where you are trying to stay undetected (with a stealth meter), or a rescue / recon mission about finding a signal (radio finder blips). There's also a mission or two where you simply pilot a captured Luftwaffe plane and fly over enemy territory for recon... and hopefully not get caught by air patrols. That can get tense.   Depending on the aircraft you fly (and you fly a lot, from WW1 fighter to civilian transport, from fighters to fighter bombers, even a B-24... ) you get guns, bombs, and maybe rockets. The bombs and rockets are unlimited but takes time to regen. The guns are unlimited too, but won't fire if overheated. If you can hit a plane with a rocket, you get insta-kill, but obviously that'll be quite difficult. Hit ground targets with bombs or rockets, but you need to be VERY precise... or you don't get the kill (and fail the objective). The bigger planes have additional turrets and tail guns, and those fire automatically. You can even take control fo the turrets and let AI fly for a while. Bombers may be able to drop salvos of bombs rather than one at a time.   There are missions set in both WW1 and WW2. The story is told from POV of Dorothy 'Deedee' Derbec, who fight in the various conflicts (that you play) in WW2, but also relive the missions talked about by friends of Deedee's father in WW1.   As you complete missions, depending in kills and objective completion you gain 'stars', which you accumulate to add a point to your four attributes such as luck, leadership, armor, and damage, giving it a slight RPG flavor. This also controls what planes you can unlock, and there are more than a dozen planes from all sides: German, American, British, Russian, even a few jets and rocket powered planes, not to mention bombers, fighter bombers, and pure fighters.   The locations are interesting, at least to those accustomed to regular WW2 games, as you do a lot of fighting in Eastern Europe (but that's understandable, the developers are from Slovakia), and they mixed in quite a bit of WW2 history (or at least, hypothetical history).   The game has simplified landing... basically fly through a series of 'rings' and you're considered 'landed'. Taking off is easy: full throttle and you'll take off.   Controller is fully supported, and can be set to arcade or sim mode with different control schemes. There's also multiple difficulty levels to customize your game. There's also plenty of quick dogfight missions (random AI opponents) and plenty of multiplayer options.   Enemy AI is not bad, as they do try to get on your tail and stay there.   Overall, my impression of the game is positive, except for those painfully tedious 'plinking' missions (i.e. kill paratroopers and kill 70 ground troops). I'm about 60% complete and I sincerely hope I don't run into more missions of that type. Once I got past the female narrator (female French accented English) the game is actually quite enjoyable. Enemy planes smoke and break apart convincingly, and at Rookie difficulty you generally do breeze through the missions (except for those tedious plinking missions).   if you like the genre, arcade WW2 flight game, this game is quite good. Not a must play, but definitely something to try.",
            "review_score": "1"
        },
        {
            "review_text": "Arcade flight combat game best suited to gamepads, not joysticks.  The story is pretty boring and tends to drag on, told through pre and post mission briefings, narrated scenes with paintings and some in-game conversations (radio chatter).  The campaign is alright and it does get better as you get further in. The flight model/controls is highly simplified (designed for consoles) meaning you only turn up/down (pitch) and left/right. It is possible to roll the aircraft in 'simulation' mode but without rudder controls it is rather pointless. Ammo also refills automatically.  Shooting down lots of enemy planes and bombing lots of tanks, soldiers etc. is pretty fun. There's a bit of variety to missions but overall you still spend a lot of time shooting down planes and bombing vehicles. The AI for enemy planes, particularly for evasive manoeuvres is just awful though.  Multiplayer is so laggy it's unplayable.  6/10.",
            "review_score": "1"
        },
        {
            "review_text": "Very good game even though it is from 2011. Great graphics and gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "Beware! Buggy sound, the game makes a noise like a dying mouse regardless of sound settings. Really irritating, ruins the game as it is too annoying to play. Probably a compatibility problem with Win8.1, would be nice to see this fixed, yet I have a feeling that will never happen since this game is so old. Bit of a shame.",
            "review_score": "-1"
        },
        {
            "review_text": "The game wouldn't even start.",
            "review_score": "-1"
        },
        {
            "review_text": "Not exactly a high quality AAA title, lacks very basic settings you should now expect from any PC game, resolution settings at the very least, but sadly, nothing, so you are forced to play in a square box at some pretty poor looking models.   The game play itself is pretty solid, I assume this is very basic flight simulator stuff though, taking off and landing is very easy, it takes a lot for you to stall your plane. There is a wide selection of different planes to choose from at the start of your missions, each having their own different stats, strengths and weaknesses. I won't spoil too much, but one of the planes is so much better than any of the others so the large choice is kind of pointless once you work it out.   There is an essence of customization when you reach certain goals, you will be granted experience points to improve your character (planes). I focused on agility and luck (which increases your critical shot chance), and this turned my plane into a little nippy bomber that could avoid pretty much any rockets!   The main story took me about 8-9 hours to complete, and it was quite an enjoyable play through. There is plenty of re-playability in the arcade mode, which is where I spent most of my time.   I would recommend this game, however if you are playing this expecting a crisp AAA experience, you will be disappointed, if you go into this with the only expectation is that you are going to fly a plane and blow stuff up, you'll enjoy it.   7/10",
            "review_score": "1"
        },
        {
            "review_text": "will not run vido. will run blank screen if i could see it it might be good",
            "review_score": "-1"
        },
        {
            "review_text": "Make no mistake, this is NOT a simulation. It's Mario Kart with WWII airplanes; that being said, it's kinda fun. Doesn't take itself too brainnumbingly serious, like it's more recent successor.",
            "review_score": "1"
        },
        {
            "review_text": "Holy Crap! This is awesome!!",
            "review_score": "1"
        },
        {
            "review_text": "Turned out to be a surprise win for me. Didn't expect much, but was a really fun set of about 50 or so missions. Difficulty goes way down low, you can set the controls to 'arcade' mode and just fly around kicking ♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "A good flying arcade game with storyline but dead multiplayer. It may take a while to adjust with the mouse movement if you played other fly simulation games, overall it's not bad.",
            "review_score": "1"
        }
    ]
}