{
    "app_id": 97130,
    "name": "Kohan II: Kings of War",
    "release_date": "2011-08-24",
    "developer": [
        "TimeGate Studios"
    ],
    "publisher": [
        "TimeGate Studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 12,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "RTS",
        "Fantasy"
    ],
    "achievements": 0,
    "positive_ratings": 91,
    "negative_ratings": 8,
    "price": 6.99,
    "description": "Even as the world erupts in civil war, an ancient evil gives out a call, and the Shadow-touched begin to gather.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/97130/header.jpg?t=1447354558",
    "minimum_requirements": "OS: Windows 98, SE, Me, 2000,XP, Vista, 7Processor: Pentium IV 1.5 GHz or AMD Athlon equivalentMemory: 256 MB RAMHard Disk Space: 700 MB Video Card: 64 MB NVIDIA GeForce 3 / ATI Radeon 8500 or equivalent Video Card with 100% DirectX 9.0b compatible driversDirectX&reg;: DirectX 9.0b Sound: 100% DirectX 9.0b compatible sound card with speakers or headphones",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Classic RTS of another era. The graphics show its age, but the originality of the title still shines through. Unlike most RTS games where single units are recruited, in Kohan you recruit companies make up of a variety of frontline, flank and support units, which offers a level of customization in its thousands of variations that you don't see in any other RTS game. Flanking attacks and finding defensible terrain are keys to victory, and breaking your enemy's units morale can turn the tide of battle.   On the downside, it requires a certain level of micromanagement, and if you don't keep an eye on your troops battles often become a cluster♥♥♥♥. Its resource system is also firmly in the early 2000s with multiple resources but only one that really matters. Gold is the only resource that one can have a stockpile of, and thus the management of other resources is to ideally have a minimum deficit with no surplus so that they do not impact your gold income. Still, it's a fun game and the ability to integrate independent towns and creeps into your army is something we're only very recently seeing come back in strategy games.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best strategy games I have ever played I strongly recomend to anyone who is a fan of RTS to buy this  Now before you jump right in let me tell you why its good. Its a old fashion RTS without the micromanagement Sure their are towns and units you must control, but you do not have to manually spawn new units to make a group, instead you simply design your own self populating groups that do the dirty work for you. In addition the game offers a lot of replayability with random maps, pretty dang good AI for skirmishes as well as the occasional frantic if some what funny multiplayer game  Overall it is a really good strategy game in my opinion and is worth trying it out for anyone who might be interested in something some what new despite how old this game is its uniqueness is greater then that of most modern day RTSes",
            "review_score": "1"
        },
        {
            "review_text": "Still one of my favorite strategy games. You make a squad sized units and they move around as a group rather than trying to control a bunch of individual units and make them enteract they way you expect they should. If your into heros in your strategy games it also makes since that should your hero die they are imortal so they can come back rather than just knocked out when the rest of the unit dies. (Would also make great since if they did a MMO like this.)",
            "review_score": "1"
        },
        {
            "review_text": "90000000/10",
            "review_score": "1"
        },
        {
            "review_text": "I played the original Kohan years ago as one of my first RTS games when I was a kid. Given the amount of hours I spent with the first Kohan as a youngster I was almost afraid to play Kohan II for fear that it would tarnish my opinion of its glorious predecessor. Fortunately, my fears were totally misplaced!  While Kohan II is certainly showing its age, if you’re willing to look past that you’ll find a fun with game that combines some elements of grand strategy games like Civilization with the quicker pace of RTS and RPG games. A fun return of the immortal Kohans; definitely worth trying out for RTS fans new and old. ",
            "review_score": "1"
        }
    ]
}