{
    "app_id": 9760,
    "name": "Act of War: High Treason",
    "release_date": "2008-03-12",
    "developer": [
        "Eugen Systems"
    ],
    "publisher": [
        "THQ Nordic"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "Strategy",
        "RTS"
    ],
    "achievements": 0,
    "positive_ratings": 157,
    "negative_ratings": 38,
    "price": 1.99,
    "description": "The highly anticipated sequel to the critically acclaimed game Act of War: Direct Action picks up where the techno-thriller left off. On the eve of the U.S. Presidential elections, simultaneous terrorist attacks hit both candidates. Clues point to corrupt elements within the U.S.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/9760/header.jpg?t=1538645788",
    "minimum_requirements": "Supported OS: Windows 2000/XP Processor: 1.5 GHz CPU or better RAM: 256 MB RAM Graphics: 64 MB video RAM with full hardware T&amp;L support DirectX Version: DirectX® 9.0c (included) or higher Hard Drive: 7 GB free HD space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "If you liked C&amp;C Generals, but: - It doesn't work on your PC anymore - You cba to go and get the disk / can't find it / it's so old it's scratched to s***. - You don't want to buy it electronically on Origin - You don't want to install Origin - You don't want to give Origin your monies - You don't like EA / Origin - EA / Origin  Then buy this instead. Very similar, a few years newer, and more realistic.",
            "review_score": "1"
        },
        {
            "review_text": "A fix on the Steam Froums finally allows this game to work. It's basically an improved Command and Conquer Generals, with an intricate infantry building garrisoning system, including the ability to breach enemy held buildings WHY THE ♥♥♥♥ HAS NO ONE ELSE DONE THIS AGAIN? It also works on Airstrikes like World In Conflict, except you can have your planes shoot down other planes trying to strike.The game itself is pretty solid, you can't play with naval units with AI though, which sux. Pick it up during a steam sale, it's definitely worth the $5.",
            "review_score": "1"
        },
        {
            "review_text": "good game but depends against who you are playing",
            "review_score": "1"
        },
        {
            "review_text": "Act of War: High Treason is a fairly good expansion to the original Act of War: Direct Action. The game play feels different with the incorporation of a few espionage and techno-thriller missions. Since this is an expansion, expect the graphics to be the same if not better than Direct Action. The explosion animations/graphics are also very satisfying. The only gripe I have with this game is that some missions are obscenely hard. Like super meat boy level 200+ hard, it’s nothing a veteran RTS player can’t handle, but if you’re new to RTS you will probably cry from the difficulty. Also be warned this game takes up a lot of HDD space for a 4 year old game. It is about 8 gigabytes in size.",
            "review_score": "1"
        },
        {
            "review_text": "I am really enjoyed both AOW high treason and AOW direct action but now i am reviwing high treason right? So its a real masterpice of good old RTS, i totaly recomend it 8.5/10 (i would give a 9 but.....) so lets review the pros and cons  Pros  -many diffrent units- soldiers,tanks,support vehicals,mercs,ships,heli,airplanes,commandos,NUKES :D -intresting plot -big maps(main game and scenarios) -good and challenging AI -pretty realistic -diffrent factions with cons and pross  -pretty good graphics and music -if you dont try you will lose :D (i think those are major pros)  cons -sometimes sound bugging -If you are get unluky like me the game will start buging in regular base (ONLY in campain mode and in 2-4 certain missions) and game will force to shut down  -Gamers have stoped entering in multiplayer :&lt;",
            "review_score": "1"
        },
        {
            "review_text": "I think it is one of the best RTS games ever made and with few tweeks could be the best RTS game. First thing that I liked about the game was realistic graphics. Smoke, flames, units done beautifully camera is shaking from explotions. While it is a bit outdated still looks nice. I was also inpressed with building capturing - fighting on roof mechanics. This is one of those rare RTS games where soldiers can actually clime on the roof tops and snipers can take out soldiers standing close to windows as well as soldiers with assault rifless can actually try and take the building from the inside. Naval battle is another amazing thing about Act of War HT, where ships has multiple tipes of weaponary can carry units as well as aircraft. Unfortunately naval combat is not supported in skirmish games, only in campaing and actual multiplayer games. The main story of the game is interesting, probabaly the most interesting story of all RTS I've ever palyed, however the campaing is challenging. On down side this game has compatability issues. I don't believe internet games servers still works properly (if at all) and when playing LAN game my computer tends to freeze at the bebinning of the loading screen for enough time for other games to assume it's dead. If loads normally after some time, but I am kicked by then. I hope, that's will be fixed soon.  Sorry for my poor English. I hope I've been helpfull.",
            "review_score": "1"
        },
        {
            "review_text": "love the game. story is not as good as the previous but the new units make up for it. sadly enough mulity player does not work anymore because the server has been shot down",
            "review_score": "1"
        }
    ]
}