{
    "app_id": 98500,
    "name": "Naval Warfare",
    "release_date": "2011-05-25",
    "developer": [
        "Game Distillery s.r.o."
    ],
    "publisher": [
        "Immanitas Entertainment GmbH"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Shared/Split Screen",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Steampunk"
    ],
    "achievements": 0,
    "positive_ratings": 134,
    "negative_ratings": 121,
    "price": 1.99,
    "description": "As Commander of a Naval Super-Destroyer, wage war in a military campaign of epic proportions in, under and above the surface!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/98500/header.jpg?t=1454920233",
    "minimum_requirements": "OS: Windows XP SP3, Windows Vista, Windows 7  Processor: Intel or AMD Dual-Core Prozessor (1.9 GHz) or better  Memory: 2GB RAM Hard Disk Space: 1.5 GB hard drive space  Video Card: NVIDIA Geforce GTS250 / ATI Radeon HD4800 or better DirectX®: DirectX 9.0c  Sound: : DirectX 9c compatible",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Graphics Clicthes and the controlls are not logical. The controlls are unlogical, instead of foward, left/right turn, you get up,down, right, left and have to zig-zac trought a diagonal canal. Fixing those problems could make the game rather good, but no.. they don't care to fix it :(",
            "review_score": "-1"
        },
        {
            "review_text": "Absoultely no recommendation. Mainly due to the horrible NVidia flickering bug and the overall lack of support.  I would want to like this game but the devs dont care about fixing their sh*t.  It's amazing how often this ends up on sale lately, they should just update the store page informing that this game wont work properly with Nvidia cards.  Seriously STEAM you've gotten sort of horrible when it comes to communicating both with your customers and the Devs that are allowed to release these unpolished products. Its a shame!",
            "review_score": "-1"
        },
        {
            "review_text": "A great potential unfortunately a bit light in the realization, Naval Warfare is a good idea, lack of resources, a steampunk world and a very interesting universe, pallet unit, a story, good movie' cuts ... but what are you waiting for ? Try to develop this idea and make it a real game with a developed story? I like this kind of game, a little too short (finished in 5 hrs), it need to bring to maturity ... This is it, go ahead...",
            "review_score": "1"
        },
        {
            "review_text": "Navel Warfare is a shoot and race game.  Tutorial gives you good idea what the game is about and how everything works. Single player is a very nice thing to play though. It's a shame the extended story mode is single player based only.  Multiplayer is local only so no online play with friends. It's very small and playing this can only be done with some controllers. Yes keyboard is supported only this makes playing the game no fun of the horrible repsonse.  It's a fun game personally not my favorite if you ask me. I prefure Renegae Ops because you can play this together co-op online as offline.  I give this game a 6/10. ",
            "review_score": "1"
        },
        {
            "review_text": "well worth the 99 cents",
            "review_score": "1"
        },
        {
            "review_text": "Terrible controls - instead of forwards/backwards and steer left/right, you have up/down/left/right/diagonals. This means you're constantly hitting walls because the nice looking maps don't match the control inputs - makes torpedoes entirely useless. The rest of the game might be good?",
            "review_score": "-1"
        },
        {
            "review_text": "this game might be fun in an arcade..it sucks on pc need to let the mouse drive the boat...i can fire better with wdas",
            "review_score": "-1"
        },
        {
            "review_text": "I really liked the game.  pro: - steampunk - interesting plotline (for 3 hours) - nice ship variety - no glitches/bugs encountered  meh: - controls  no spoiler: the final boss fight is a bit of a thinker. all fight up until then are pretty straightforward. the final boss requires a bit of thinking but is do-able.  picked it up for 79 cents wouldn't recommend at 4 Euros",
            "review_score": "1"
        },
        {
            "review_text": "DONT BUY THIS GAME you can buy a better game with the same price! ",
            "review_score": "-1"
        },
        {
            "review_text": "Uuurhhhghhgh. Worth some of the 89p I spent on it.",
            "review_score": "-1"
        },
        {
            "review_text": "ːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamː  Well, it does have controller support Unfortunately the controls need fixed,they're too sluggish. The controller support was so bad I only played 20 minutes.  I bought it for 49 cents on sale,so not really a complaint, It wasn't worth the drive space for me though,  This would be a good cheap game for someone who can't afford the big titles",
            "review_score": "-1"
        },
        {
            "review_text": "Naval Warface (Fargus)",
            "review_score": "1"
        },
        {
            "review_text": "Im going to be honest, after seeing most of the negitive reviews I didn't even play this game until this morning. Now, im glad I did. This game is really a decent twin stick shooter if your using a 360 controller. It plays nice and its only real short comings is the voice acting is like a B movie gone bad, but who cares about that. This game is about game play and I personally think they did a pretty good job of it. This is a game you should add to your library as specially if you can get it on sale.  6/10 Decent Game",
            "review_score": "1"
        }
    ]
}