{
    "app_id": 98600,
    "name": "Demolition Inc.",
    "release_date": "2011-09-19",
    "developer": [
        "Zeroscale"
    ],
    "publisher": [
        "Zeroscale"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Workshop",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards",
        "Includes level editor"
    ],
    "genres": [
        "Action",
        "Casual",
        "Indie",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Indie",
        "Casual"
    ],
    "achievements": 37,
    "positive_ratings": 197,
    "negative_ratings": 53,
    "price": 4.79,
    "description": "Assume the role of the daring demolition worker Mike and start a devastating chain reaction on earth!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/98600/header.jpg?t=1447354653",
    "minimum_requirements": "OS: Windows XP, Vista, 7  Processor: Pentium 4 1.8+ GHz or equivalent Memory: 1 GB (2 GB recommended for Windows Vista and Windows 7) Hard Disk Space: 500 MB Video Card: 256 MB video RAM DirectX®: 9.0c Sound: DirectX 9.0c compatible",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "If you love to blow stuff up then this game is for you. Also being able to create your own levels and play them and others levels in the workshop adds a lot to this game . lots of fun and the closest we may ever get to destroy all humans on pc !",
            "review_score": "1"
        },
        {
            "review_text": "Mischievous alien destroying buildings by setting up traps. A very simple and amusing game.",
            "review_score": "1"
        },
        {
            "review_text": "+1",
            "review_score": "1"
        },
        {
            "review_text": "Fun Game, but won't take long to finish. Worth it on sale",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun game to play, Uses strategy quite a bit and levels gradually get harder as you go up and unlock more districts.  Just picked up this game today and i have to say it's pretty fun and for 6.49 dollars is not bad.  If you like strategy games that don't get repetitive quickly i would suggest this game.  8/10!",
            "review_score": "1"
        },
        {
            "review_text": "This is Really NICE GAME (y)",
            "review_score": "1"
        },
        {
            "review_text": "Very very short (around 90 minutes to complete the first campaign) and I haven't tried the DLC. It's a fun little waste of time to play with the physics and figure out the puzzles. That said, sometimes the physics are frustrating because you might know exactly how to blow something up but a barrel doesn't fall just right.   Still, it's pretty cheap and has workshop support so I guess buy it if you want a short little physics-y action-y puzzle game to waste some time with?",
            "review_score": "1"
        },
        {
            "review_text": "Terminally ill",
            "review_score": "1"
        },
        {
            "review_text": "Because wrecking stuff isn't fun.",
            "review_score": "1"
        },
        {
            "review_text": "Second best physic based game I've ever played",
            "review_score": "1"
        },
        {
            "review_text": "7/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is now one of my fav's. It is the most satisfiying destruction game ever with alot unique weapons and player generated maps, it is endless fun.",
            "review_score": "1"
        },
        {
            "review_text": "This game is so simple and still awesome just download th demo and try it out!",
            "review_score": "1"
        },
        {
            "review_text": "Demolition Inc is a fun game just to destroy buildings and see the cars crash into it and the may be some levels were its nearly hardcore for me and im sure there is pros out there who are a master at this game and the animation is not to bad",
            "review_score": "1"
        },
        {
            "review_text": "Fun but frustratingly difficult",
            "review_score": "-1"
        },
        {
            "review_text": "It's an uninspired port of a mediocre mobile game that will get boring within the first hour or two. The concept is solid but the execution leaves a lot to be desired.",
            "review_score": "-1"
        },
        {
            "review_text": "I think you blow some stuff up? I don't know, already forgotten it.",
            "review_score": "-1"
        },
        {
            "review_text": "I just cannot seem to grasp the point of this game. I want to, but have not successfully figured out just what the programmers had in mind.",
            "review_score": "-1"
        }
    ]
}