{
    "app_id": 98900,
    "name": "Alien Hallway",
    "release_date": "2011-08-19",
    "developer": [
        "Sigma Team Inc."
    ],
    "publisher": [
        "Sigma Team Inc."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements"
    ],
    "genres": [
        "Action",
        "Casual",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Action",
        "Indie"
    ],
    "achievements": 20,
    "positive_ratings": 141,
    "negative_ratings": 91,
    "price": 3.99,
    "description": "Players measure stamina with a never-ending stream of green creatures within the borders of a special military mission.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/98900/header.jpg?t=1552378200",
    "minimum_requirements": "OS: Windows 7/Vista/XP Processor: 1.6 GHz Memory: 1GB Hard Disk Space: 100MB of free space Video Card: 128 MB DirectX 9.0c compatible or better video card with pixelshader 2.0 DirectX®: 9.0c Sound: DirectX 9.0c compatible sound card Additional: Microsoft XNA Framework 3.1",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "'Get ready to send marines to kill aliens that no man's seen before!'  That, my friend, is the plot of Alien Hallway in one sentence. Sorry for spoiling it. Alien Hallway is a light strategy game where you only manage the finances and hiring troops, who handle the destruction by themselves.  Drones get you money by scavenging electronics. With money you can send marines to destroy the alien teleporter, the objective of every level. The marines are AI controlled and you can only choose, when to throw their grenades. At the same time you must not allow the aliens to destroy your base.  Apparently, these aliens are fairly technologically advanced. There's no telling which side threw the first stone but because of the mentality of the storyline, my bet would be on the humans. Most of the aliens are fairly mindless and naked green little men who just come and smash your hyper-trained marines but their elite troops have powerful swords and advanced armour, ranged weapons like blasters, forcefields that make the aliens nearly indestructible and even huge exoskeletons with tank cannons attached to be reckoned with. One alien type clearly tries to fry the brains of your troops with some kind of telepathy and another one is an exploding kamikaze troop.  On your side, you've got a fairly diverse bunch of soldiers and a manually used air strike that can be used every once in a while. Curiously, the flame-thrower guy is the cheapest and weakest of the bunch. The pricier ones are generally better, so later I ended up usually simply stacking up on snipers, missile troopers and heavy laser troops to beat the levels quickly and efficiently. This is important because it gives you gold.  In between missions you can upgrade your troops and other assets with the gold, which in itself is pretty cool. Higher upgrades are more expensive with diminishing returns on investment. The most significant upgrade is the soldiers getting better grenades at level 5, otherwise they just do more damage and can take more beating before dying.   All levels are really similar to each other, with just stronger varieties or larger amounts of mobs. There are a mere couple of special ones like the one where you start with a large amount of funds but no income. There's some replay value to the levels because you can do them in four different difficulty levels - indeed, one of the achievements for the game requires you to beat every level on the highest difficulty (Expert) level. You can also try to 5-star each level, which amounts to doing them fast enough or with just a small number of casualties. Unfortunately, it's not very obvious what's enough for 5 stars, but the above goals seemed to nail it for me.  Too bad the game is very grindy. To survive the last levels even on easy requires a good bit of grinding to get powerful enough troops to survive the missions. You can redo missions for gold, but it's rather boring because you already beat them before and they're no different when repeated. To get just one troop to level 10 requires on hour or more of grinding and to survive the expert mode you need several more troop types to high enough level to survive. One could call it a challenge, but mostly, it's a grind.  This might not be a problem if you could control your soldiers a bit more. Generally they shoot the closest enemy and walk towards it, and the same goes for the aliens. However, often times it would be very useful for the snipers to concentrate fire on the forcefield units or the big enemies, but they will also just target the front-line. This is especially frustrating, when the alien teleporter is very close to being destroyed. The troops keep shooting some big tank enemy that could be finished off after the teleporter was down, but before the creature is down more enemies pop out of the teleporter. Just general orders to 'target large enemies' and/or 'target the alien teleporter at all costs' for different troop types could have made it so much more interesting.  My stance to not recommend Alien Hallway stems from the lack of control over troops, because it's not enticing to just buy all the snipers, missiles and laser dudes your money can get, if you can't give them useful commands (throwing a grenade is not really a good one). This lack of control also makes the game rather casual. I got some 11 hours out of it, but probably first 2 or 3 of them went to finishing the game, the rest being just grinding for gold. It's not a bad game, but it's not very interesting one either. While its base price 5 € is not too bad, I'd still advice to get it on sale.",
            "review_score": "-1"
        },
        {
            "review_text": "You'll find some Flash games better than this game, I quit playing after 1hour playing. I wouldn't have bought this game unless I had got it via 'Alien vs Zombie' bundle for US $0.99. lol  (Japanese translation below)  ==================================================  その辺のFlashゲームのほうがマシに感じられる内容、1時間で投げ出しました。 101円のエイリアン対ゾンビバンドルが無ければ、まず買うことは無かったです。",
            "review_score": "-1"
        },
        {
            "review_text": "Not as bad as I expected, considering it was part of a 99p or so bundle of 5 games.  I'd obviously never recommend someone buy this direct for £3.99, that's a joke, but if it's ever in a bundle for next to nothing then happy days.",
            "review_score": "1"
        },
        {
            "review_text": "Not worth playing, you will hate it after a time and find it boring, aside from being too repetitive, there really isn't any sense of progression nor it seems that upgrading your units does actually anything.",
            "review_score": "-1"
        },
        {
            "review_text": "2/10 I can't believe that they had the nerve to charge money for this. Sigma team have produced some simple fun and mindless games in the past. They also made this piece of drek. From the somewhat lost in translation 'Story' which makes little enough sense to the awful execution of the game this was just bad.",
            "review_score": "-1"
        },
        {
            "review_text": "An enjoyable couple of hours. Get it for 50c on gala store",
            "review_score": "1"
        },
        {
            "review_text": "Awesome, relaxing, thinking game",
            "review_score": "1"
        },
        {
            "review_text": "It's actually half decent as a time waster.",
            "review_score": "1"
        },
        {
            "review_text": "Allthough it is fun and challenging, it is awfully short.",
            "review_score": "1"
        },
        {
            "review_text": "It's not Sigma Team's best foray into gaming, but it's decent for a push defense game. The game isn't particularly challenging; most of the difficulty is dependent on how patient you are. Prepare for quite a bit of grinding if you want to make the basic units powerful enough to survive the last few levels. If you're all about push defense this game is for you, otherwise it'd be wise to pass.",
            "review_score": "1"
        },
        {
            "review_text": "has potential but no updates or anything. slow. extremely lacking of any progression other than through the story to get a few new things.  too simple, plain. waste of money. dont buy. not worth it. also my AV picked up a spyware or something from it. STAY AWAY.",
            "review_score": "-1"
        },
        {
            "review_text": "Not the best graphics or sound, but if you want a decent pick-up-and-play, it will satisfy. Recommended that you get it on sale.",
            "review_score": "1"
        }
    ]
}