{
    "app_id": 9940,
    "name": "Blade Kitten",
    "release_date": "2014-05-22",
    "developer": [
        "Krome Studios"
    ],
    "publisher": [
        "Krome Studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure"
    ],
    "tags": [
        "Anime",
        "Platformer",
        "Female Protagonist"
    ],
    "achievements": 20,
    "positive_ratings": 746,
    "negative_ratings": 149,
    "price": 1.99,
    "description": "In Blade Kitten, join Kit Ballard as she explores the mysterious world of Hollow Wish to hunt down rogue mechs and soft targets.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/9940/header.jpg?t=1507677497",
    "minimum_requirements": "OS: Windows XP SP2, Vista SP2, 7 Processor: Intel Core2 Duo 1.8 GHz or AMD Athlon X2 +3800 or better Memory: 1GB RAM Graphics: ATI Radeon X1800 or NVIDIA GeForce 7800 or better DirectX®: DirectX 9.0c Hard Drive: 3GB free Sound: DirectX 9.0c-compatible Other Requirements: Internet connection required",
    "recommended_requirements": "OS: Windows XP SP2, Vista SP2, 7 Processor: Intel Core2Duo E8400 or AMD Phenom II X2 555 or better Memory: 2GB RAM Graphics: ATI Radeon HD 3850 or NVIDIA GeForce 8800 or better DirectX®: DirectX 9.0c Hard Drive: 3GB free Sound: DirectX 9.0c-compatible Peripherals: Xbox 360 Controller for Windows, Logitech Dual Action, Logitech Rumblepad 2 Other Requirements: Internet connection required",
    "reviews": [
        {
            "review_text": "Well, well, well. Am I Surprised? Hell Yes!  I choose to play  Blade Kitten  based on name of the title. Yes, that was the reason I installed it and dive right into the game - name  Blade Kitten  and you will get what it say kitten with badass blade (set of blades).  And my thoughts on this game? This pink hair kitten won my heart, I am pleasantly surprised, I didn't expect amount of fun I will have in six hours of gameplay (only ep.1).  So what is here to like? Main character for sure. Kit Ballard is funny, smart, cute and badass kitten with really sad past; and when I play fun-to-play character with actual character, game is always better for me. Hollow Wish is world we play in and is lovely to look at, but dangerous to explore because of various enemies that makes your life harder. Some of them are really easy to get rid off, but you will find some tough and annoying mothereffers here as well.  Eliminating single targets, or smashing thru hordes of enemies is fun and enjoyable; but sometimes it is really far from it, because when you find yourself in siege of enemies from left and right and they are upon you, closer then you wish, and it is really difficult to get out of their deadly grasp. And besides few glitches events, this is probably my only complain for this game.  As story goes. Yeah, there could be improvements, story could have been more rich, deeper, and all other things you could describe great story. But storytelling was good, story was easy to follow and good enough for me to care what is going to happen next, where is this leading me, and i really want to know how all things from part one transcend to second part, so i most definitely pick up episode two when i can.  I had a lot of fun and this matters most for me.  8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Well is this game real hidden gem or what! I put off buying it for a long time despite very low price because of a few negative reviews on game mechanics. Turns out those reviews dont know what they are talking about.   Yes this game has a few kinks that you should know about combat. There for instance is a kickback during which time you are stunned. This kickback+stun can be stacked on you by multiple enemies resulting in unexpected beatdowns and deaths. We are not talking about La-Mulana type of kickback here that defines the whole combat system but it's significant enough that it should be taken into account. Melee enemies dont let you go once they connect with their blows resulting in half your health going away. You regenerate fast but sometimes its not enough.   And what about your weapons and moves? Standard sword slash works well on 1-2 enemies but a group of enemies all at once? your DPS is not fast enough and you dont hit them all so the enemy will retaliate so adjust your tactics accordinly. You CAN take them out most of the time. but not always.   Enemies deliver their blows once they have progressed on their move and some of them are non-interruptible even if they die. The long range sword throw does not connect every time as it works bad in close range. In addition it consumes stamina which is important when you jump around trying to do your moves so it's better to be used when skirmishing or as an opener.   Use your head - your character can easily in normal situations just spam on the normal attack and win. But sometimes even the basic grunt can kick you down from a ledge if they have the height advantage or form a tag-team with another one to beat you up if you fool around too much.   Use that shield of yours. Jump on top of enemies and throw them. Their bodies trigger doors, switches and even crumbling walls.   And what about platforming and levels? Well it sure is overdone. Just the start screens of levels, you can basically just spend 5-15minutes clearing the opening screen. See a ledge? there is a secret there - there always is. Every. single. time. at least money if not a chest or a teleporter to some other area.   Arrows tells you to move forward? nope. go back, there is still a ton of secrets or there is a alternative way forward with loot on the way. I dont recall any other game overdoing secrets the way this game does. A typical level has the arrows pointing where to go but you must do the traditional 'uh-oh, game wants me to go here - i need to go back' -routine as much as possible and instead look for walls and ledges where to jump. or just hang from walls and make your way to seemingly impossible places - where there is a huge section of the level and here you will spend the next 5minutes. In another game called Limbo you got an achievement for 'going left'. this game takes 'go everywhere, there are so many secrets it will take time' to a whole new level. On average levels last for a very long time so there is plenty to do.   To sum up the good this game has weapons, upgrades, costumes, nice artwork. good responsive platforming controls and easily learnable combat with small details that you can learn if you like but it's not mandatory. To get ahead in the game you dont need to learn all the details but it sure helps a lot.   I am very entertained this far. Unique game for me. Good looks and interesting stuff to do.   9/10.",
            "review_score": "1"
        },
        {
            "review_text": "This game&gt; Mighty number 9. Inafune should learn a lot of these guys.",
            "review_score": "1"
        },
        {
            "review_text": "great game glad they came out with the other half.",
            "review_score": "1"
        },
        {
            "review_text": " My playtime:  23h (based on steam, 100% achievement, both episode 1 and 2).  Grindy Achievement:  Yes (2 achievements (can be more based on your money after you beat the game)).  Optional Achievement:  Yes (10 achievements).  Difficult Achievement:  No.  Developer Response:  No (last response is in Mar 2015, i think).  * You need to buy Blade Kitten: Episode 2 DLC to 100% the achievement.   Intro",
            "review_score": "1"
        },
        {
            "review_text": "Here is an old guide I made for all the collectibles:         YouTube™ Video:  Blade Kitten Level 1 Collection Walkthrough.&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "I had originally planned to get this game shortly after it's initial release back in 2010, but after hearing news that Episode 1 ended on a cliffhanger and the publisher (Atari) was holding back the release of Episode 2, I decided against it. However, now that Atari's license/publishing rights to the game has expired, Blade Kitten is back on track in the hands of the developer, Episode 2 is in development, and Episode 1 is better than ever with full Xbox 360 Controller support, an option to unlock the framerate from 30 to 60fps, and support for higher resolutions. Oh, and did I mention that the price has been reduced to roughly 1/3 of its original cost with Episode 2 planned to be released at around the same price?  Gameplay-wise, Blade Kitten is a solid 2D Action Platformer with tight controls, good physics, decent combat, fun level design, and enough optional exploration/collectibles to appeal to folks who are into that sort of thing.  Graphics-wise, Blade Kitten looks good. The graphics are by no means ground-breaking or cutting-edge, (this is a game from 2010 by a rather small developer, after all) but they serve their purpose by illustrating a colorful and interesting world.  Sound-wise, the game is average but adequate. The voice acting is decent and the music (while somewhat forgettable) is by no means unpleasant to listen to.   Story-wise, Blade Kitten is fun and interesting. Kit is an amusing and likeable protagonist, and most of the other characters are amusing and likeable as well. The story so far is incomplete as Episode 1 ends on a cliffhanger, but it left me wanting more and I eagerly await the release of Episode 2.  Overall, Blade Kitten is a solid buy for the price. It's a fun game that will keep fans of the genre entertained and leave them wanting more. If you enjoy 2D Action Platformers with solid gameplay, colorful graphics, and an amusing cast of characters, then I highly recommend checking out Blade Kitten.",
            "review_score": "1"
        },
        {
            "review_text": "* meow * me likes ...   The main character is not just a cute costume, she is a strong good fighter, jumps far,  climbs well and gives a smooth feeling of being a cat. The cel shaded graphic looks amazing  and with the voice acting this game just gets better with that :)   I will mention that this is a decent platformer, but sometimes lacks the action fight scenes,  which I expected would scale to a higher level through the game.   All in all, a fun game to relax with.",
            "review_score": "1"
        },
        {
            "review_text": "Well this is possibly the most annoying piece of ♥♥♥♥ ever to grace my hard drive Lovely concept just too bad it sucks so much ♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "Great fun platformer. Nice graphics, great soundtrack and dialog.  Pretty much needs a controller. Unless you have mad micro skillz.",
            "review_score": "1"
        },
        {
            "review_text": "I wasn't expecting much since this game is for only 3€ but i was surprised how good Blade Kitten is.  +Pretty long if you want to collect everything +You can let your kid play this(unlike many anime-style games on steam) +Dialogues +Graphics(on 2715x1527 looks really good even in 2016) +Huge levels +Secret rooms inside Hidden rooms +Animations +Tentacle porn joke +Soundtrack +Value for money  -You cant set difficulty level -Not really challenging yet there are harder parts -Sometimes your character is blocked in one place for no reason(just for a while but still)  If you like games like 'Duke Nukem:Manhattan Project' you will love this. 10/10 would buy again, its much better than it seems.",
            "review_score": "1"
        },
        {
            "review_text": "Blade Kitten is a decent game for a (Currently) very cheap price of $5.99  It is a game based upon a rather popular Webcomic that (Unfortunately) hasn't updated since 2012.  The story is not too hard to understand, yet has a few twists here and there to keep you entertained. But, it most likely will not entertain you if you aren't a fan of the webcomic.   The gameplay really depends upon what controller you are using..This is one of those games in which i can barely play it with a mouse and keyboard. You NEED a controller. Without a controller, i kept getting stuck to walls, slashing in the wrong direction, and i had a lot of trouble just getting through some of the very easy puzzles because of how bad the keyboard/mouse controls are. With a controller, it is MUCH easier to control and works quite well. The only issues i had is that the combat is somewhat imprecise.  The graphics are Cel-shaded..But in a style that doesn't compliment it too well. It seems extremely cartoonish and silly and appears very 'Meh'. Had they focused more on making it like the comic style (emphasising the lines and details of the characters), it would have worked better.  Considering the current price, i give it a recommendation to buy.  As for the game itself, i give it a 6.5/10",
            "review_score": "1"
        },
        {
            "review_text": "A fun little platformer. Nothing new or groundbreaking but it has a pleasant art style and a quirky little story and characters.   The story however does end on a cliffhanger since originally this game was meant to be a trilogy of games. There have been rumours that the next parts will be released after all but as DLC and not as new games.   Overall if you're looking for a platformer with some rudimentary combat some fun and quirky characters and are in to cat girls this is one for you.",
            "review_score": "1"
        },
        {
            "review_text": "Fun and enjoyable game cant wait for next episode",
            "review_score": "1"
        },
        {
            "review_text": "Is cat game 야옹~",
            "review_score": "1"
        },
        {
            "review_text": "Recommended by popular demand.",
            "review_score": "1"
        },
        {
            "review_text": "65p TO FUEL MY ADDICTION. WHAT A LIVING.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. The webcomics are decent too.",
            "review_score": "1"
        },
        {
            "review_text": "A decent 2.5D Action Platformer that has a lot of purrsonality.",
            "review_score": "1"
        },
        {
            "review_text": "Cat wifu with big sword makes my sword happy #Kappa",
            "review_score": "1"
        },
        {
            "review_text": "58%",
            "review_score": "1"
        },
        {
            "review_text": "action and an beauty character make this game awesome,i loved the 2d style in this game and her mind power are just amazing!",
            "review_score": "1"
        },
        {
            "review_text": "sick game",
            "review_score": "1"
        },
        {
            "review_text": "There has never been stronger proof of video games as an art form until now. Blade Kitten is a masterpiece in every sense of the word. From it's gorgeous graphics, immersive musical scores, clever dialog &amp; witty humor, to it's amazing character presentation, Blade Kitten outdoes itself in every category from start to finish. Kit Ballard is a strong female protagonist that's not just the paradigm of the purrrr-fect hero, but a model for all women everywhere. The games story is a classic tail of adventure and self discovery. But don't be fooled by this jolly romp: it's also very intelligent, sprinkled with political commentary on topical issues that affect our lives today, covering topics such as the equal rights of women to the war in Iraq. The gameplay is a creative mish-mash of 2D platforming seamlessly rendered in 3D environments for an experience unlike any other! The bottom line is that if you have ever enjoyed video games in your life, you owe it to yourself to get this game ASAP.",
            "review_score": "1"
        },
        {
            "review_text": "+ Art style is nice to look at. Cel shading will age well and always give a nice clean look. - Some of the murky sections with the pale greens and brown looked out of place.  + A wide variety of combat and movement mechanics. Can lead to interesting platforming and fights. - Controls feel sluggish, especialy when enemies hit you. Most of their attacks will stun you, which will lead to very slow and frustrating fights, especially when you get swarmed by enemies all stunning you with their multiple attacks.  + Excellent audio. The sound effects work and the soundtrack is awesome. I've listened to the OST a couple of times for fun. - Voice acting can be a little annoying at times, especially with the main shopkeeper. His accent will really get to you and his dialogue can get really repetitive. More variety in his dialogue and an accent easier on the ears would've been much nicer.  + The game features 13 levels, 4 different blades, 13 costumes and 10 passive upgrades. This all adds up to more content than usually expected for such a cheap game. Additionally, more content is on the way when Episode 2 release. - The following is what I find the most annoying about the game. While the levels are open, which is nice, the are littered with the ingame currency, treasure chests and a multitude of collectibles. The game for me went from a fun action-filled light-hearted adventure, to a game about walking to every single corner of each level, making sure that I hadn't missed some sort of collectable. I don't enjoy spending all of my time searching for the 142 Treasure Chests, 20 Skiffs, 20 Datapaks and the seemingly infinite amount of hex across every level. Sure, a couple of treasure chests for each level would've been great. It would've been fun exploring each location for that 1 or those 2 treasure chests, however, having 142 makes every single one seem sort of meaningless. That's not even taking into account the other 40 collectables that you have to find. I feel that this game could've easily been much better if there were far less collectables. I eventually just gave up crawling around every location to collect every Hex, and instead tried just running through every level. I found that much more enjoyable.  If you enjoy the Blade Kitten Webcomics or you are a fan of sidescrollers, you will probably enjoy this. For everyone else, just expect a few hours of fun. There are a few minor problems, as listed above, that could be easily fixed. Change the colours of some areas. Change the effects of most of the enemy attacks so most of them don't stun the player. Change the voice actor for the shopkeeper and give him more lines of dialogue. I doubt that fixing these should take up too much time, and in my opinion it will bump up the game from a 6 or 7/10 to a 7 or 8/10. The biggest problem, in my opinion, is that there are collectables scattered everywhere, and too much of my time playing the game was spent look for every single one of theses. I gave up in the end, but making the levels smaller and reducing the amount of collectables could allow the players to focus their time on the combat, platforming and story. Still allow some exploration, and keep a few collectables, but having 182 things to find over 13 levels is too overwhelming, and just makes the game kind of boring. Fixing this, along with the minor problems, would make this game a solid 8/10, or even possibly a 9/10. For now, the game is 7/10 from me.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun platform game, takes a bit of time to get used in the controls if you use a keyboard but other than that it features a very cute and funny main character, lots of levels to play with and even small upgrades with different costumes and weapons. Strongly recommended and excellent quality especially for its price.",
            "review_score": "1"
        },
        {
            "review_text": "The story animation and dubbing is kinda poor.  If you hate English dubbing this is especially not for you. If you hate really weird looking 3D animation, it also isn't for you. That's only a problem during cutscenes though.  I really don't care about the quality of either and the gameplay physics seemed okay from the vid. And it was cheap.  The gameplay physics seem fine, but it's one of those games that don't allow you to use your arrow keys on your controller, thus I cannot play because of my controller having broken joysticks.  Alas keyboard works. Game is okayish.  Also also, this game sort of has a Sly Cooper vibe to it, I suppose.",
            "review_score": "1"
        },
        {
            "review_text": "Cute and funny writing and characters with great platform action make this one a must-play!",
            "review_score": "1"
        },
        {
            "review_text": "The plot is awfull, but the gameplay is fun. The game is like Strider but more 'indie'.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty solid 2.5 action platformer. It is bit easy and cheasy (no rhyme intended) but still good game. Altough don't expect something like trine 1&amp;2 level or story.",
            "review_score": "1"
        },
        {
            "review_text": "This game is seriously fun and feels very high quality and intelligently made. Polished and fun - keeps me coming back!  The combat feels a bit... cheap at first... like, it lacks impact, I guess would be the best way to explain it. Almost like your attacks are going through each other and have no real punch. However, you get used to it quite fast and it kinda works well with the overall fluidity of the game. Not perfect but still definitely enjoyable.  The acrobatics are really great and the game handles very well.  Definitely recommended! :D",
            "review_score": "1"
        },
        {
            "review_text": "You need this game, and this game needs you, go get it!",
            "review_score": "1"
        },
        {
            "review_text": "This is so simple, yet purty to look at simultaneously, that you just HAVE to play it for some light relief! It's a sword-wielding pink-haired catgirl for ♥♥♥♥'s sake. What's not to like?",
            "review_score": "1"
        },
        {
            "review_text": "A cute action platformer game, the main character has a lot of abilities which will aid in battle. Very easy game though, I don't think there is a game over.",
            "review_score": "1"
        },
        {
            "review_text": "A seriously underrated little platformer. Flawed, for sure, but definitely entertaining.  It's got some refreshing ideas about how platforming should work, while being somewhat reminiscent of the '90s Crash Bandicoot platformer style (Which I guess comes from Krome having traditionally been competing directly with the famed bandicoot).  Anyway, it's colourful, cute, and has attitude (though I will fault Kit for being just a little too teenage-Facebook-user-y in her dialogue, but, c'est la vie.), and is well worth a few of your dollars, presuming you can deal without the conclusion of the story, as Krome Studios have all but folded, and a conflict with Atari has put the IP in limbo.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty decent platformer :D",
            "review_score": "1"
        },
        {
            "review_text": "An entertaining decent platformer. Because of Steam Summer sale discounting this game to ~3 dollars, this game with its steam trading card literally paid for itself within about 4 hours. The cards were worth about 50 cents each. lol.",
            "review_score": "1"
        },
        {
            "review_text": "An example of high quality production. The writing for the game is witty and with great humor and care, with great graphics and music. The game has a bunch of interesting traits such exploration for collectibles to increase a completion percentage and a simple, yet functional combat system with moves like controllable angle short range slashes, middle range slashes, low, sliding kick attacks, a jump and dive slash and others that let you adapt to changing circumstances and enemies. it's not slash, slash, slash, jump, slash again.   The story presentation is done through animated cutscenes instead of stills or simply the in-game character models. The voice acting is also excellent, which makes for watching them a much more enjoyable experience.  The game can feel a bit short, but the amount of unlockables and exploration greatly make this game worthy of revisits and its replayability makes it much more inviting.  Give it a good shot. Play the demo or jump straight into the game. This is a game that has much more heart in every piece that comprises it than many other rehashed game entries we see year after year.  The second episode has been released in the form of DLC. This adds a few more stages and more achievements, with a final boss that is the right amounts of tricky, difficult and requiring of a proper strategy to defeat.   And for the price the game is at, it's almost absurd not to, considering the amount of work that has gone into it. Amply recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Catgirl Game! Catgirl Game!!  Having said that, why should one play this game: The title music is great, full Voice Over, have only found 2 bugs so far (one minor, one made me die, again), and because the game mechanics are quite fun. (I like how Kit can climb up walls, hang on the ceiling etc and the resulting freedom of movement)  And did I mention she's a cat girl?  EDIT: Episode 2 is out. And I still think that Blade Kitten is a good game. Admittedly if you are searching for a game where absolute precision jumping and complex combos are on the menue, well, not here (or I haven't found it yet).  So, Episode 2: Played 1/2h, as expected some new game mechanics, more content (duh) and the plot starting to thicken (things get storywise more interesting). And I got a comic to read!",
            "review_score": "1"
        },
        {
            "review_text": "If you open any video game design text book, the 1st guideline is pink hair cat girls makes every game better. Ok maybe my text books don't say that, but it's still factual!!!",
            "review_score": "1"
        },
        {
            "review_text": "Really simple and nice game but nothing great to say, sidewalker with a strange catlady and a flying knife. 6/10",
            "review_score": "1"
        },
        {
            "review_text": "This game has a fun protagananist, good concepts, and awesome gameplay. RECOMMENED",
            "review_score": "1"
        },
        {
            "review_text": "PROS: Astoundingly well done for the price point. Fully voice acted, fairly good platformer controls. Give you flexibility to play it old school on a controller or do several keyboard+mouse styles. Plot is... kinda disjointed, but evocative enough, especially with the voice acting.   CONS: It's a little wonky getting used to having your weapon float and learning how to time your attacks so your blade is actually available to launch another attack. Wall climbing is somewhat touchy and more than once I got stuck in a slide or to a wall. Never permanent, but it happened enough that it makes some of the rapid movement and combat sections somewhat annoying. Short. Two hours in I had completed more than half of the game.   MIXED FEELINGS: Some replayablility to find all the hidden collectibles, but it's no Metroid-vania. You don't revisit areas with new options, you just revisit them to find what you missed. Despite the tooltips scattered around through the first few levels, They still leave some things out. Go into the options menu and read the manual first, as it also gives you some important context.  Overall, I definitely recomend it. It's low cost and it's a fun platformer for the price. I picked it up on sale for under a dollar, but I'd definitely recommend it, even at the full $3 price tag.",
            "review_score": "1"
        },
        {
            "review_text": "i pick'd blade kitten at a bargain bin price and so should you, just puting a hour in to the game it seems rather ok, the game doesent throw any story on too much tutorials on you'r face but gradually introduces new mechanix what is a god thing.   as of the game it's a mix of super meatboy and megaman with a anime styled catgirl as a main character, 4/5 not bad would bang",
            "review_score": "1"
        },
        {
            "review_text": "Sorry my fatlardass friends, but noone of heroines will be Your waifu.  And game was nice tho. But still wait for TY remaster.",
            "review_score": "1"
        },
        {
            "review_text": "Very Underated Game. Get it, whats holding you back?",
            "review_score": "1"
        },
        {
            "review_text": "While I'm a fan of platforming hack'n'slash games, I can't recommend this one. Some of the puzzles are okay, the rest of the game is not. Even with a gamepad, platforming basics like double-jumping or long running jumps are hampered by the game thinking it knows better than you and auto-aiming jumps. Combat is clunky and it is easy to get stun-locked to death by enemies. But by that same token, there's no challenge, as you respawn with no penalty and checkpoints are incredibly common. The sword selection is passable, but the only other upgrades are HP and Stamina ups, and nothing really unique. You CAN dress your character in a selection of very stylized japanese costumes if you like, but once you realize you're playing in pajamas and bunny slippers, it loses its appeal. The worst part is the voice acting, however. The protagonist never misses a chance to spout squeaky cutsesy dialogue in a voice that grates on the ears. I stopped hunting down treasure chests because I couldn't stand to hear another 'Win Get!' or 'Awwwwwlright!' It even does it when auto-aiming your jumps for you. I could not finish this game, and recommend other, better titles in the genre like 'Dust' instead.",
            "review_score": "-1"
        },
        {
            "review_text": "i thought this game was cool for a while, but getting further in, i liked it less and less. the characters are cool and interesting, and the platforming can be kinda fun, but thats all there is for the positives. the controls feel delayed, the platforming can wonky as hell, the you can buy the best sword in the game very early after the first 4 levels and by not buying the other swords, but it wont feel like ur getting any stronger against enemies since you can just spam the attack button, few enemies will make you actually have to try to defeat them, and the story progression feels like a sort of bad random, like the character just goes with the flow, as if theres no objective. i wanted to like it for the aesthetic i guess, but too much got in the way",
            "review_score": "-1"
        },
        {
            "review_text": "it's great game i guess ? but you don't want to play this game if you have motion sickness i don't know if there's way to fix this but i keep getting headache with this game  like the graphics fps the camera just make me want to vomit i'm fine with mirror's edge but can't even play this game for about 5 minutes ",
            "review_score": "-1"
        },
        {
            "review_text": "cant even move",
            "review_score": "-1"
        },
        {
            "review_text": "I see the fun factor of the game but I just couldn't get into the game, I wish steam allowed neutral reviews.",
            "review_score": "-1"
        },
        {
            "review_text": "Technical execution of this game is good but not great - it's clearly a console port and has irritating prompts for the player to use a game controller.  Graphics are fine, the game runs smoothly, but for some unknown reason they used all the engineering and artwork to make a 2D platformer.  Gameplay itself is where the game lets you down - 2D platformer with limited 'fighting' (button mashing like a console gamer does). Bonus thumbs down for prompting you to give them even more money for their DLC on the front screen of the game.   If you really love console ports, 2D platformers, or games for children, this would be a good choice. But it's most certainly not aimed at PC gamers.",
            "review_score": "-1"
        },
        {
            "review_text": "Cheap, cutesy, and handles like swimming through wet cement. You're almost guaranteed to find a better time waster if you're that desperate.",
            "review_score": "-1"
        },
        {
            "review_text": "beware: this new update has ♥♥♥♥ed the game.  unless you enjoy nausea and watching the characters flicker across the screen, i'd say steer clear until they update the terrible 30fps issue or until someone comes up with a new hack for it.  for four years it worked fine only due to a third party hack and now that no longer works.  only time will tell if they will really fix it but they didn't touch this game in the four previous years that i've owned it.",
            "review_score": "-1"
        },
        {
            "review_text": "Based on the popular webcomic of the same name, Blade Kitten is a rare gem that is completely under-appreciated by the gaming community... Spactacular graphics, awesome sound, an addictive storyline and brilliant gameplay make this one of most favorite games, Blade Kitten is most certainly worth every last cent and my only complaint is that at the time of writing, Blade Kitten is not yet available for Linux-based operating systems (such as SteamOS and Ubuntu) - for this reason alone, I cannot recommend this game at this time.  Should Blade Kitten become available to Linux-based operating systems however, I will surely update my review accordingly...",
            "review_score": "-1"
        },
        {
            "review_text": "The game looks fun and has a cool name like 'Blade Kitten.' But don't let it fool you, the controls are floaty and hard to use, voice-acting does not match with mouth movements and is generally very badly done. The combat in most cases doesn't work since you're blade GOES THROUGH the enemies. I found myself spamming the attack button just to see that no damage was administered and they had no shields up which some enemies have. The antagonist seems to have no other purpose to be a bad guy and does not have any other redeeming qualities. As a platforming fan who loves almost any action platformer in the world, this one truly goes on my very small sh*t list.",
            "review_score": "-1"
        }
    ]
}