{
    "app_id": 99700,
    "name": "NightSky",
    "release_date": "2011-03-01",
    "developer": [
        "Nicalis, Inc."
    ],
    "publisher": [
        "Nicalis, Inc."
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Casual",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Indie",
        "Platformer",
        "Casual"
    ],
    "achievements": 22,
    "positive_ratings": 748,
    "negative_ratings": 100,
    "price": 6.99,
    "description": "Nominated as a IGF Seamus McNally Finalist, NightSky is an ambient action-puzzle game that offers a gameplay experience unlike any other—cerebral challenges fill uniquely designed picturesque worlds. The player must maneuver a sphere by using realistic physics to advance; each of these worlds is broken into different areas.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/99700/header.jpg?t=1466790646",
    "minimum_requirements": "OS: Windows XP or newer Processor: Intel Atom or above Memory: 512MB RAM Graphics: 3D graphics card  DirectX®: N/A Hard Drive: 100MB",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "NightSky is a well-crafted little physics puzzler. You maipulate a small sphere through a series of 2D mazes with obstacles and puzzles.   In a single sentence: 'Limbo' meets 'The Ball'.   The visuals are striking. It looks like perpetual sunset, with silohuettes of Edward Gorey-style monsters lurking in the background, which are actually more interesting than the game itself. Good sound, too.  Pretty good game on the cheap if you like environmental puzzlers. ",
            "review_score": "1"
        },
        {
            "review_text": "It's a calm and enjoyable little game. It's a bit simple, but that works in its atmosphere. Ten dollars admittedly might be too high of a price, but if you can get it for less, it's not bad to play through, especially if you need to relax. It has a few good puzzling hours in it, and even the more difficult levels aren't game-ruining.",
            "review_score": "1"
        },
        {
            "review_text": "NightSky is a simplistic platformer in which the objective is to move an innocent sphere to the end. The end of what? You will have to decide as there's no narrative but your own motives to drive you there.  The controls are simple, movement based, which change depending on the level. In a lot of the levels you are the sphere and directly move it where you want to go. Some levels mix things up a bit and let you control things around the level, where the sphere relies on gravity to move. In one level you control pinball style flippers and in the next just need to hang tight on a moving cart and not fall off. Its all done in a tasteful and simplistic manner to break up flow a bit and make things a tad more interesting.  The world is wrapped in beautifully gradient colored backgrounds which let your mind fill in the gaps where the levels are taking place. Shaded foregrounds representing the physical world you move around and obstacles in your path are complimented by factory-brown backgrounds or misty-white rain plains and orange-yellow sunsets behind shades of trees. It's a good example of less is more and its works very well. Music wise, the soundtrack feels genuine to what you see on screen. Ambient and experiential tacks help with invoking the right emotions that coincide with each levels color.  The developers included a new game plus mode which involves the same levels with some objects modified to make them more challenging. This works for the most part and provides an extra set of achievements to complete and lengthens the game if you are into that sort of thing. I would recommend NightSky to anyone looking for a simple platformer to wind down and hey, if you get addicted to the gameplay - there is the challenging NewGame+ to complete after you are done. Took me about 10 hours to complete to 100%.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty decent with nice atmosphere and overall worth to play as you can have some trouble with alternative version. Solid 7,0/10",
            "review_score": "1"
        },
        {
            "review_text": "This is a nice relaxing game for when you do not want to be on the edge of your seat, but also want some challenge. I can say that I have no real complaints about this game.",
            "review_score": "1"
        },
        {
            "review_text": "Oh my God, the music. The music and relaxing background sounds are just perfect. Music is a bit of a mix between Minecraft and Borderlands music.  Little puzzles are fun (although sometimes look similiar to puzzles found in LIMBO) and the atmosphere is very calming too.  The game is a bit overpriced for what you get, if you ask me. So if you're interested, definietely get it on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Great ambience and relaxed gameplay. Its strangely satisfying to see your little black ball roll around, over ramps and through puzzles. None of the puzzles are especiall hard unless you're trying to unlock the extras.",
            "review_score": "1"
        },
        {
            "review_text": "A bit of a different sort of platformer, quite a bit of fun, and a neat art style as well.",
            "review_score": "1"
        },
        {
            "review_text": "A simple casual game but very enjoyable with puzzles that are challenging enough to be interesting, but never annoying. Altogether a triumph of artistic programming.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun take on these sorts of games. The controls handle really well, the levels hit a good balance of being a quick challenge (although some are FAR too easy, and some can be a bit frustrating to get them right). Good polish, enjoyable music. Just a fair warning to people who care, but the majority of achievements did not pop for me, not exactly sure why. Not something I care too much about but I know a lot of people really like them, so there is a chance you might have to replay or switch game slot saves.",
            "review_score": "1"
        },
        {
            "review_text": "Great relax-em-up type of game.",
            "review_score": "1"
        },
        {
            "review_text": "THIS IS DA BOMB DIGGITY - FadedRainbows",
            "review_score": "1"
        },
        {
            "review_text": "Much better game than DayGround",
            "review_score": "1"
        },
        {
            "review_text": "Trippy little game. Short but fun. Kinda reminds me of sonic, the way you speed through levels and use loops and bumps to get places.",
            "review_score": "1"
        },
        {
            "review_text": "feels like it's more proof of concept than a game",
            "review_score": "-1"
        },
        {
            "review_text": "This is a review for 'Hold Right Arrow Key to Win Game' in which you ...hold right (perhaps left occasionally) to win. Thats.. basically it. You may think I am kidding, but thats the actual game. There are speed up and slow down powers, anti gravity powers and some other neat stuff that breaks up the fact you just hold right... but still, 90% of the game is holding right and knowing when to not hold right. There were screens and puzzles I never even had time to figure out because holding right just beat them for me. Sure, there are some 'nice' puzzles and some 'fun' challenges... but ..honestly.. I didn't like those parts. It felt kinda like those terrible moments in Sonic where the fluid of the level design stops and you have to struggle to regain it. Its awkward and you just want it to end so you can get back to holding right.   I beat the game, it was painful to do. I have fond moments of holding right..and I have many many bad memories of this game. I have labled it terrible and buried it in the graveyard of games I wish I didn't own. If considering purchase, please skip over this game. There are plenty of similar games that are much better examples of what you really want.",
            "review_score": "-1"
        },
        {
            "review_text": "Nightsky is a pretty interesting platformer that can only be described in a few words unique and rage inducing. In Nightsky you roll around a ball and try to get through some levels. The concept is interesting but theres no story. Theres a ball found on the beach and then it rolls around random levels. While the Art style is beutifull the game could get angering because the controls are too tight and dont fell smooth and the game does revevolve on tought phisics which does ruin the fun. And if you want to finish the game you have to find all the hidden stars which is just insane but there only twelve of them so thats not that bad. So overall this game is good but for the rage inducing and the Abysmal level desing im gonna bump down the rating so i give it an 8/10.",
            "review_score": "1"
        },
        {
            "review_text": "A relaxing puzzle game, based around the momentum of a magical sphere.",
            "review_score": "1"
        },
        {
            "review_text": "Just plain awkward. An interesting idea that was poorly executed. There's worse titles out there, but I was just left disapointed.",
            "review_score": "-1"
        },
        {
            "review_text": "you do nothing in this game just useless i absolutely dont recommend it  this game sucks if it was worthing 1€ i would maybe recommend it but not sure",
            "review_score": "-1"
        },
        {
            "review_text": "NightSky tries so hard to be memorable. It has variety in its mechanics, a soothing presentation, and many cool ideas. But that's not enough to give life to a title that's mostly, well, boring. Only in the game's final levels does it begin to feel fresh, but by then you've probably already had enough of NightSky. 7.1/10.",
            "review_score": "-1"
        },
        {
            "review_text": "Bad game. Not worth any money.",
            "review_score": "-1"
        },
        {
            "review_text": "Utterly adorable, very relaxing game with a brilliant little soundtrack",
            "review_score": "1"
        },
        {
            "review_text": "Great mobile game. Not my favorite on the PC.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic and thoughtful little platform game. Around 3 hours long, but both fun and challenging to play and a simple but beautiful art style to accompany. Would highly recommend!",
            "review_score": "1"
        },
        {
            "review_text": "Great relaxing and peaceful game, which tests your skill to the max in alternative mode.",
            "review_score": "1"
        },
        {
            "review_text": "It beautiful, enchanting, simple yet challenging. A wonderful game with puzzles that become progressively more challenging, A slow rise not quick like in some games. The look of the game is brilliant.",
            "review_score": "1"
        },
        {
            "review_text": "This is a very good game and I really recommend it to anyone. It's fun and enjoyable. Not too difficult and not at all frusturating (unless of course your being stupid while playing it, which is what i tend to do). It is short as well, well worth buying it, especially when it's on sale for $2",
            "review_score": "1"
        },
        {
            "review_text": "Pretty awesome momentum based puzzle game. You should buy it.",
            "review_score": "1"
        },
        {
            "review_text": "Nice, relaxing puzzle. The soundtrack is nice, but the sound of the ball clinking against something is intoxicating. ",
            "review_score": "1"
        },
        {
            "review_text": "puzzle game where you play as a marble",
            "review_score": "1"
        },
        {
            "review_text": "Its Worth Trying! Its a ball puzzuler. Pretty Much it",
            "review_score": "1"
        },
        {
            "review_text": "6/10 Very zen puzzle game until it makes you want to throw your mouse across the room",
            "review_score": "1"
        },
        {
            "review_text": "Relaxing and fun puzzle game.",
            "review_score": "1"
        },
        {
            "review_text": "I nice game to relax to after a long, hard day of zfg",
            "review_score": "1"
        },
        {
            "review_text": "Not bad. Its a 2D ptalformer that really pushes the 'try, try again' feeling of gameplay. If it it didnt work the first time, jsut do it again and see if the fates will let it work this time.",
            "review_score": "1"
        },
        {
            "review_text": "Mellow strategy game where you play as a ball. Really thats all there is, but it does it well.",
            "review_score": "1"
        },
        {
            "review_text": "Nightsky is one of my favorite puzzle games period. You roll a ball around multiple stages, find secret exits, and enter vehicles! This game is also VERY low resource, and that means almost any computer can run this.",
            "review_score": "1"
        },
        {
            "review_text": "A pretty cool indie game about trying to get a ball to the end of checkpoints that are every three screens. The normal game is a solid campaign, but the alternative one, is more of a puzzle game, that takes much more time, and is tedious. The art style is a mix of Obulis and Limbo. There are no lives, but endless attempts. It's a good game if you have a few minutes to spare.  Rating 7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "NightSky is a simple yet engaging physics puzzle platformer using a ball and the various terrain and objects to get through each level. The controls are simple to move the ball which moves quickly, but extra controls are given to move it faster, slower, or upside down depending on the level along with various contraptions and other objects that are required to solve the levels. Each level is crisply and cleanly drawn with black vector objects along with a well textured sky background in nature or non-nature settings. The art style opts for a simple and almost minimal look along with more intricate and articulate designs in other levels. The music and sounds are also ambient to suit the level styles, with natural sounds and small pieces of music to go with each level. Some levels may be really straightforward and easy, while others give a good amount of puzzle thinking or platforming skill to complete. While it looks like just a simplistic game, NightSky gives a good experience with some interesting design and gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great puzzle game. Great ambience and a relaxing soundtrack. Challenging but not frustrating. When you fail a level you generally know why, and just have to be a bit more precise. Highly recommended!",
            "review_score": "1"
        },
        {
            "review_text": "relaxing little puzzle game with excellent music, atmosphere, and gameplay",
            "review_score": "1"
        },
        {
            "review_text": "Nightsky is a challenging physics puzzle game where you control a ball with various abilities as you try to navigate across progressively difficult playing fields. The developers have done an exceptional job here, not only with the attractive and stylish visuals, but with the excellent soundtrack as well. My major complaint with the title is that it is presented on a tiny window that cannot be scaled, making the gamefield tiny on a widescreen monitor. However, I found that after playomg for a few minutes I stopped noticing this as the rest of the presentation is so engaging. I would recommend this game to puzzle gamers who are not turned off by a high twitch requirement and are willing to attempt to complete the same puzzle multiple times before getting it right. Overall this is a very well made game and worth the price.",
            "review_score": "1"
        },
        {
            "review_text": "It's a platformer with the same very artsy style as Braid (Including the very beautiful classical music), but with less puzzle gameplay and more straight platforming. Only downside is a lack of screen resolution options, so you'll be playing either in a small window or an unnecessary fullscreen mode.",
            "review_score": "1"
        },
        {
            "review_text": "Not bad little puzzle game. kept me busy for a couple of hours :)",
            "review_score": "1"
        },
        {
            "review_text": "Balls to the walls",
            "review_score": "1"
        },
        {
            "review_text": "8 / 10",
            "review_score": "1"
        },
        {
            "review_text": "Really chill super marble. Weird, easy, and challenging.",
            "review_score": "1"
        },
        {
            "review_text": "awesome, relaxing game",
            "review_score": "1"
        },
        {
            "review_text": "NightSky really brought artwork and creativity to gameplay. It uses physics to beat puzzles. Some of the puzzles feel like you can never beat it but with some patients you can beat everyone of them. Its has great artwork in it and awesome ways to complete puzzles. The music in the game is calming. The sounds of the ball with the different area to be played really gives the ball life. There are different powers the ball has, to slow down and grip to a fast pace sprint. The ball can fly in certain areas and use different machines to glide or jump through the level. This was a enjoyable game from beginning to end. I highly recommend this game to anyone ready for a beautiful game that brings casual gaming to a whole new level.",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best puzzle game I played since Thomas was alone. Great game to chill down to. And the music also is good. :3",
            "review_score": "1"
        },
        {
            "review_text": "A really simplistc plataform that is amazing cause works very well, it works easily and soft. Peacefull. The credits...total worth!",
            "review_score": "1"
        },
        {
            "review_text": "Love it. Chill atmosphere with great puzzles and perfect difficulty. It's one of my favorite indie games. Overall, a beautiful game. Got it on sale, but it was so good and well made that I wished I had payed full price just to support the creator. Buy it, you won't regret it.",
            "review_score": "1"
        },
        {
            "review_text": "A soothing experience, don't expect more than that. Not worth the $10. I got it on sale so I recommend it nonetheless.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic 2D platformer/physicsy game.",
            "review_score": "1"
        }
    ]
}