{
    "app_id": 99900,
    "name": "Spiral Knights",
    "release_date": "2011-06-14",
    "developer": [
        "Grey Havens, LLC"
    ],
    "publisher": [
        "Grey Havens, LLC"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "MMO",
        "Co-op",
        "Steam Achievements",
        "Steam Trading Cards",
        "In-App Purchases",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Casual",
        "Free to Play",
        "Indie",
        "Massively Multiplayer",
        "RPG"
    ],
    "tags": [
        "Free to Play",
        "Massively Multiplayer",
        "RPG"
    ],
    "achievements": 54,
    "positive_ratings": 15666,
    "negative_ratings": 3202,
    "price": 0.0,
    "description": "Join the ranks of the Spiral Knights. Stranded on an alien world, you must explore the ever-changing Clockworks beneath its surface.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/99900/header.jpg?t=1520626238",
    "minimum_requirements": "OS: Windows XP, Vista or 7 Processor: 1.3ghz processor Memory: 512MB for Windows XP or 1GB for Windows Vista/7 Graphics: 64MB Video Memory. GeForce 5 series, ATI Radeon 8500. Latest video driver. Display: 1024x600 DirectX®:  Hard Drive: 700MB Java: Version 1.6",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "How To Get The Tf2 Hat :  1) Get through the tutorial to the Refugee Camp 2) Play And Complete The One Arcade Mission (Play Solo Instead Of Creating A lobby) (Play Solo Because To Open Gates or to use the elevator, all teammates have to stand on a big button or stand together(for elevators) which they probably won't because they will be busy doing something really stupid)  3) After Completing arcade mission you will get an achievement: Mission Accomplished  4) Open Tf2  5) Click On The Blinking Notification On The main Screen  ",
            "review_score": "1"
        },
        {
            "review_text": "Having played the game for over 300 hours, seeing many iterations of the game, and seeing the general direction of where the game is headed, I honestly can't recommend it for most players. There's a lot of problems with the way the game is run and how it is being developed that are more than a little concerning. Over the course of the two years I've played this game, I've gone from having a lot of hope for it and being really excited to see how it develops, to being sorely disappointed with the quality of the updates and actually feeling sad for all the squandered potential the game had.  Let's get into details now shall we?  Positives: - Gameplay Pretty unique in its gameplay. Haven't seen any other MMO that plays quite like it. A good take on translating the top-down Legend of Zelda style play and turning it into an MMO. It's easy to understand and play, with some advanced techniques to pick up along the way. The randomly generated levels also add a bit of replayability to the game. - Sound The music for the game is pretty good. Though generally upbeat and calm, it can get hectic or atmospheric when it needs to. The sound effects are also pretty decent and add a lot of character to the colorful cast of enemies you'll find yourself beating down. - Art The absolute biggest positive of the game in my opinion. Virtually every art asset is well designed and rendered in a very unique and eyecatching style. They're also very well animated to boot! Granted, there are some exceptions where lazy design or lackluster work sticks out (an example being a certain line of upgradeable helmets only has 2 textures between all 6 of them), but overall the art is what stands out the most to me. - Community Honestly one of the nicest MMO communities I've seen. There's hardly any hostilities towards other players and most players are genuinely helpful towards one another. The glaring exception being the PvP minigame, Lockdown.  Negatives: - Updates One of the most disappointing things about the game is the general lack of content brought by updates. It is understandable that updates aren't frequent when you realize how small the OOO dev team is, but the amount of content released over the course of the two years I've played is pitifully small. A lot of the 'new' content is just rehashed older content to pad out the game or one-time bosses, enemies, and set pieces put into single Missions while the rest of the gameworld (which is played VASTLY more than most single Missions) is in sore need of more variety. And that's not even getting into the annoying cash-grab updates dedicated solely to costumes. - Performance Being an MMO built on Java, there's definitely going to be performance issues unless the game is perfectly optimized (which it isn't). An abundance of entities on the screen can slow the game to a crawl no matter the quality, which wouldn't be a problem if there weren't also an insane abundance of levels that use huge hordes of enemies and particle effects. The game lags a lot and that's not even getting into the extremely small number of servers causing problems for those that can't get a decent connection. Then there's also an inherent problem with the game running on Macs which further harms performance. Not as pronounced a problem, but definitely noticeable. - Balance One of the biggest breaking points for me. The balance of the arsenal of weapons and armor is abyssmal. Some weapons are inexplicably far more powerful and useful than others. Others are so painfully useless or weak that it's a wonder if they get used at all. Example: Any armor that 'emphasizes' defense doesn't offer much more defense than other armors that also offer major attack bonuses. Even then, most of the defensive sets only allow you to take a single extra hit or maybe two incomparison to the offensive sets. Essentially, any armor set that doesn't boost your attack power in some way is obsolete to those that do. It's been this way for YEARS, with the community clamoring for balance and suggesting ways to balance things out. Some balance changes were even promised for underpowered or broken weapons, but after more than a year on some of them, no changes have been made. It completely baffles me why the devs can't simply change numbers around on the equipment, but it apparently is too tough for them to do so. Speaking of broken balance... - Lockdown The broken balance certainly doesn't help things in Spiral Knight's PvP mini-game. Aside from equipment making it hard to take seriously, it's a PvP game and generates all the toxicity that a PvP crowd can. Unless you're really into PvP, it's best to steer clear from this unbalanced mess. - Grinding Being a Free-to-Play MMO, grinding is to be expected. However, with the limited number of randomly generated areas and how little moneyand experience some areas offer in comparison to the boss levels, it gets incredibly dull, incredibly fast. And then there's the issue of the Forge, a mechanic that slows down a player from levelling their equipment. Aside from needing the game's equivalent to experience, you also need a rather big number of rare items for a CHANCE to bring your euipment to the next level unless you use a LARGE number of said rare items to get that chance to 100%. Then there's the fact that you can't access the Forge from everywhere in the game, which creates a disconnect between gaining a level and that rewarding feeling of leveling up. - Difficulty I don't quite agree with OOO's idea of difficulty being to add more health and damage onto monsters or to throw so many monsters at the players that damage is nigh unavoidable. It just reinforces the superiority of the offensive sets of equipment since they can deal with both sitautions faster and more efficiently. More diverse groupings of enemies or improving the AI along with the general power given to the players is the more fulfilling and strategic route to go, in my opinion. Giving the mosters more health and damage just makes battles long, grindy, and extremely frustrating should they touch you. - Revive system This used to be a big plus for the game until the mechanic was completely overhauled earler this year. Before, players could pick up any allies that got incapacitated at the cost of half of their health. It encouraged teamplay and helping each other out, while also making most players cautious with their health since it could save a teammate as well. Now, you can't offer your health to revive your team. It instead relies on a rare item that you can either get from treasure drops or purchase with your own money. If you want to revive a teammate it's going to cost you one of your own revive items and to even do so you have to open a menu and select to revive said teammate. It takes a lot more time and is never even mentioned as an option in the game as opposed to the old method where all you had to do was stand near your teammate, see the revive icon, and click. This change really broke the teamplay aspect of the game for me. Instead of your team making daring rescues to revive one another, now you have your team lying on the floor begging for a revive because they don't want to use their own. - End game The end game has been stagnant for more than a year now. Once you have your 5 Star equipment set and reach the end of the Missions there honestly isn't much to do unless you have money to pay for the Shadow Lairs. Even then, the Shadow Lairs are seriously just rehashed boss levels with hordes more enemies to make it more 'difficult.' What's worse is that you have to pay an exorbitant amount of Energy/real money to even enter one of them ONCE. All for useless, gimmicky pieces of armor.  -----  And that's my review for the game. Feel free to give it a look (it is free afterall), but be warned that there are a LOT of problems with the game. Personally, I'd recommend trying out another free MMO like Warframe or maybe Vindictus.",
            "review_score": "-1"
        },
        {
            "review_text": "If I was writing this review 2 years ago I would say, 'HELL YEAH! PLAY DIS ♥♥♥♥♥!' but as time moved on there was a new update which gave the game a new overhaul of mechanics. For those who are unfamiliar you might not notice any difference, but back then there was an energy system that stopped players from playing or reviving in the dungeons when they ran out; this was known as the mist energy system. You were allowed up to have up to 100 mist each day which would be used for crafting, elevator fees to get to missions, and revives. As much as I complained about the old system to my friends, it still had a nice balance to the f2p model, since if you went into the dungeons others can help pay the fees and other players can revive teamates by giving them part of their health. This idea allowed for more cooperative play with others and made the community more nice. Even though some may argue the idea that restrcting time played was a bad thing, I think it was a good idea, especially considering that those who play games for hours on end eventually get bored of playing them. Think of how the horrible android and ios games keep others playing, because they don't tire out the game the whole day through charging towards beating it. Besides if you liked the game and wated to continue playing for as much as one wants you could support the devs and pay real life money for energy (ingame currency) for as low as 2 bucks!  Now to fast forward to today, the overhual update ripped the energy system which means no more elevator fees, good right? Well for that reason alone, yes, but as for what happens to the balancing I didn't think it was worth it. Now that you can play as much as you desire, the devs needed to add more artificial time which creates the lovely mmo sin of grinding. Grinding is a standard for many f2p mmo's but this game takes it to a new extreme. If you weren't a vanguard (the highest level in the game) before the update then you would most likely never reach that feat without sacrificing your time away for social life, friends, family, every other game, or even talking on the phone before you can possibly think to reach the next rank. (Yes most of that was exaggerated, but it is the slowest leveling process I have ever experienced to date.) For players who aren't badass vanguards with their awesome guild will most likely be spending their time grinding for months, the game looses its playability and gets boring and stale. Another major complaint is that revives can no happen by someone sacrificing health for others, nope! Instead they decided to go with another approach to balance the game for making profits, which is the sparks of life system. You NEED sparks of life in order to revives or wait as you team goes to the next floor. If you run out well too bad for you now go buys some more. I know someone will argue that you can buys some from the auction house, while yes that is true it also gives another reason to grind even more beside leveling and gear which you need in order to progress to the next rank.  Now to talk about pvp! Oh boy what to say...well if you aren't a vanguard with high level gear and an awesome team full of vanguards also with high quality gear, then you will always die in an unfair fight. The reason why this happens is because the matching system has the same algorithm system as  christianmingle.com  (no offense to christians of any sorts) and will pair you up against a team that out guns you the whole way, so no pvp unless you are high level with good gear and a good team of friends or a guild. This system was broken before and after the overhual update so that aspect would be a complaint either way.  Now we get to talk about content and updates, 'oh goody, tehehehehe!' *Ahem* I don't exactly know who to point my finger at but I'm going to direct the blame towards Sega since publishers usually have more control over monotization and content updates than the actual developers. Sega I'm sorry to have to inform that, costumes and outfits don't count as extra content as those are asthetics that you only buy, thus the word monotise comes in. Content should be more updates to add to the game that will give it more play time and replayability not a cheap ploy and tactic to make more money besides the ludicrous sparks of life system. Now content in this game is just an expansion to the new minigame called 'auction house madness' (yes I made that up) which means that if you want to get access to the new 'content' well then go grind for three months to buy them from the auction house or just use your real life money to exchange it for ingame currency. I am not ♥♥♥♥♥♥♥♥ you I once put $20 into this game when I returned to play with my friends and guess where most of the want to... yep you are most likely correct, a ♥♥♥♥♥♥♥ costume! I am ashamed of myself for not realizing what I fell for, and then I bought 20 sparks of life that I shared with my friends and our guild, to which we then ran out within the first week in order to not start over on the rediculous boss fights that we were not prepared for. I now hate Sega and I will never trust them with ANY game, period! Do NOT put any money into this game, I swear, I hate everything that the corrupt publishers in this industry stand for and ruining our favorite games. If you do spend money after reading this review then shame on you, you don't derserve to be viewed as a gamer as they would not stand for the ♥♥♥♥.  Now for a little story: Spiral Knights was once a love for me, she would give me happiness and give my friends and I something to do when we were seeking a game to play. I mean sure she would sometimes just sit there after a certain amount of time but I would usually repay her kindness in full to which she then spent more time with us before the day was over. Unfortunately, she now has suffers from a mental dissorder that her step father induced to fullfill his greedy needs. As much as I hated to, we left her and never looked back.  Now ending off after the cheesy story telling, I give this game a thumbs down with the side note of thanks Sega, you truely opened my eyes, now I know who lies behind the real ideas of what a gamer want and it defenitely wasn't you.",
            "review_score": "-1"
        },
        {
            "review_text": "The game is good, I was recommend playing it, unfortunately after you get to a certain point the game changes to pay to win type thing, which is a shame.",
            "review_score": "1"
        },
        {
            "review_text": "A puzzle-based, RPG, PVE/PVP, dungeon crawling game. Ever since the F2P update where you can actually find and work for items for free rather than pay energy to do literally everything, the game is now 100x better. Plenty of weapons, plenty of events (often prize box events though), plenty of customization, plenty of costumes. The PVE is probably one of the better Co-op PVE's out there, let alone it being free to play. However, it can be frusturating to farm for orbs to get weapons. If you get past that and do the missions given to you, it isn't a big deal. The market as well is completely capitalism based, so finding good deals can be tough unless you try your luck on auctioning. If you are outbid, you are refunded.   I've been playing this the day it came out on steam, stopped because of the P2W ♥♥♥♥, but came back again to this lovely update. Give it a shot, but get a friend why don't you.",
            "review_score": "1"
        },
        {
            "review_text": "  Alot of my friends seem to be getting back into this curiously, so I'm going to make a review of what I think.  Spiral Knights is an MMORPG.. Thing. If you're like me, that means people with too much money watching anime and buying 'Sooper instant upgrayd DLC STARTER PACK!!!11!!'  And you're right. SK has that, too. But to a much lesser extent.  You'll see these dudes running around in full dragon armor with flying dragon pets and think, 'Holy ballsacks, this dude just blew $250 on this game, yeah?' But no, you can get those easily and pretty early in the game. This game rewards skilled players in a way I personally love. It's so satisfying to see a person who paid to get all his ♥♥♥♥ and being bored out of his mind and then seeing yourself PLAYING the game and HAVING FUN.  This game is %500 better with friends. You get 3 friends and start rushing these rooms, you're gonna have a blast.  You can either use guns or swords in this game, or use both, whatever floats your boat. It makes for fun varying play styles.  All in all, this game is a blast with friends, it's good to play it in waves because it can get kinda stale running room after room, but it's always fun to come back to.  Plus I mean, cmon, it's a free game where you can fight skeletons and ghosts with guns as a knight.",
            "review_score": "1"
        },
        {
            "review_text": "This game stole my soul for a month straight. I must of been drunk or something but I only have good memories of this game. They have ruined this game for me with the recent updates but hey, what do I know. From experience I say this game is worth the $0.00 dollars you pay and you should try it, you just might like it!",
            "review_score": "1"
        },
        {
            "review_text": "  I'm so sick of all the kids who download this game to get the free tf2 hat and say the achievement doesn't work and just leaves a bad review. If you have nothing good to say, then get out of this community, because that is the cancer of Spiral Knights.  This game is just a simple dungeon crawler game with a lot of good mechanics. It might be irritating to play, but when you reach a high rank and you find the item that you need. You feel happy inside.  I suggest actually giving this game a try. I have been playing this game from 2013-2016 (I quit for two years), and I always loved the game, I didn't quit because I was bored, I quit because I didn't have any time.  I highly suggest this game to someone who has a lot of time.",
            "review_score": "1"
        },
        {
            "review_text": " Spiral Knights seems great, but lacks in plenty of places   Spiral Knights is an alright MMO, alright for free at least. It's definitely worth a try, seeing as how the initial pricetag is agreeable. For me, however, it's more of a social platform than a real kind of game. Allow me to explain as to why I see it as I do.   Part 1: The Gear   Spiral Knight's selection of equippable gear is quite wide at first glance, there are plenty of different resistances and weaknesses to all kinds of armor, all of which can be interchanged at a moment's notice, but the variety is wasted upon especially superior gear that provides a kind of range that none other can provide. For example, if you were to choose between say, a Seraphic set or a Wolver set, the seraphic would give a damage buff equal to that of the wolver. However, the Wolver set gives a universal buff to swords, meaning that it does what the seraphic does, but can go beyond that, as well. It's armors like those that begin to break down the options available through common sense and unfair stats. Why anyone would go with an armor so selective versus an armor completely open-ended is beyond me, and most likely anyone else. An even better case is when it comes to early-game bombers and bombers overall. Bombs themselves are fairly underpowered items when working up, so it's more likely people go Gunner or Swordsman, for better attack and whatnot. Bombers overall that strictly follow the bomber line can choose the Mad Bomber Gear, giving them amazing stats for bombs, but horrible defense. There's another armor that does this, surprisingly, but, get this,  it does it for EVERY WEAPON.  Whoever decided that was a good idea must've thought pretty lowly of bombers, as it completely voids the Mad Bomber gear, allowing for sidearms and whatnot to be used in conjunction with bombs. All in all, the gear doesn't stop there, and most likely won't as the game progresses.   Part 2: Updates   You'd think with the previously mentioned, they'd begin working on balancing armors and fixing things up, right? Hah, no. You want some costumes? Here's a few hundred. You want some reskins? Here's a box of 'em, have fun. Balancing the game is about as much of a lie as Santa. As while it's not real content, some people still love ripping open the new boxes and slapping whatever colorful paper that was inside right onto their character. I can understand dishing out some cash for a thing to make you look snazzy, but why feed a company more money when their game's pretty darn broken? I understand wanting to make the most out of the overpowered gear, but seeing one team of adventurers run into a dungeon all brandishing the same kind of gear is boring, stale, and just sad. There is no unique quality among players, no matter what little accessory they slap onto their armor, it's still the same cookie-cutter formula. I had more fun running into a dungeon with some close friends of whom we all chose oddjob gear, it was complex, it was different, it was confusing, and most of all, it was fun. Don't even begin on promised 'updates' that hold new gear, as they delay for as long as they can. I'd get more in-depth with it, but I'll have to get back to you on that one. (Pun intended.)   Part 3: The Monotony   So say you've finished the endgame, you've beat Vanaduke, heated your gear as far as you please, and have successfully reached the coveted rank of Vanguard. What's left? Apparently not much, if you don't have a guild, some good Spiral Knights friends, or anything immediately tying to it. The endgame leaves very little left, sure you have PvP, sure you have Blast Network, sure you might have guildruns, but why bother? PvP offers gear that has an alternative spin on some of your favorite (not-by-choice) weapons, with some stats made exceptionally worse, or some still a bit broken. But what's that to you? You've spent all this time grinding through repetitive missions for the things necessary to create your god-tier gear, so why bother struggling through all of that again? And don't try to play the card that PvP is interesting, it's usually the people with the broken gear using the broken swords. More often than not it's always Skolver wearing Strikers with the occasional Gunner or Snarbolax wearing Striker. Blast Network's just a bomberman port, playable by all skill levels no matter what, and to be fair, it's fairly fun. However, the lack of discrimination between skill levels can make it harsh on those who try it out, and more experienced players could potentially offset newcomers who'd like to begin playing as well.   Part 3-2: The Monotony   Don't think it's just endgame, either, as the monotony can set in as immediately as when you first begin to start. The missions assigned to you to gain rank feel incredibly scripted and not as free as they could be. It feels more like a chore than anything else, and nowhere near as fun as the random generation of the Clockworks (Which seems to be, for the most part, swept under the rug.). The Clockworks now takes discovering on your own to find, which the game already doesn't reward, making it harder to want to do so. Missions are also more likely to have the boxes you need to find to use for the drop system to give you the main crafting materials that you need for better gear, so that's another hit against the Clockworks. If you find that grinding much to your distaste, don't worry, the online store will be happy to help, for the right price, of course. Online store not your cup of tea either? The Auction House sells them at prices only a 'few' monotonous boss runs can pay for!  I'm sure I could go on, but the review's already long enough as is.    Overall   Spiral Knights is an okay MMO, not great under any means, but it's not horrible. The only shining light that keeps this game from a true dark abyss would have to be it's community. The community has it's fair share of mean customers and nice folk. You can find some pretty good friends, and some truly cool people on this game. All it takes is a little bit of chatting, and you've found one heck of a pal. The missions and so are more tolerable with a fun group, as the dulling world can take on a new sense of rejuvenation with good talks, funny dialogue, and crazy moments. This game is saved by it's community, whether it be a good or bad thing. I only ever come back to Spiral Knights more for the people than the actual game, truth be told.  All in all, Spiral Knights receives a 6/10 from me, for what it's worth. The game has alot to fix, and sadly, they haven't done much fixing. The experience can only really be fulfilled with friends, as going alone can dull the sense of wonderment you'll receive initially. I say you take some time out and find a little clique of sorts that you do things with, and you'll make it one great of an experience.",
            "review_score": "-1"
        },
        {
            "review_text": "This game use to be good..until they did the rework on energy/heat level up a long time ago. The ability to not revive the other player by using your hp was the cherry on top that destroy the game for me. I did not write a review. I am writting one now because I miss the game, but I want the developper to do some change (unless they already did some, in this case, feel free to leave a comment in this review)  until those change are not reverted, I will leave a negative reviews",
            "review_score": "-1"
        }
    ]
}