{
    "app_id": 99910,
    "name": "Puzzle Pirates",
    "release_date": "2011-08-31",
    "developer": [
        "Grey Havens, LLC"
    ],
    "publisher": [
        "Grey Havens, LLC"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "MMO",
        "Co-op",
        "Steam Achievements"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Free to Play",
        "Massively Multiplayer",
        "Strategy"
    ],
    "tags": [
        "Free to Play",
        "Massively Multiplayer",
        "Puzzle"
    ],
    "achievements": 220,
    "positive_ratings": 961,
    "negative_ratings": 239,
    "price": 0.0,
    "description": "Every activity in Puzzle Pirates is a uniquely fun puzzle: be it sailing, gunning, or hauling treasure, your own puzzling skill determines your success!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/99910/header.jpg?t=1528402403",
    "minimum_requirements": "OS: Windows 98, ME, 2000, XP and Vista, 7 Processor: 500 MHz Memory: 256 MB Hard Disk Space: 100 MB                                                                 Java: Version 1.5",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "i have lost complete control of my life",
            "review_score": "1"
        },
        {
            "review_text": "Great game, entertaining puzzles, and of course  economy . Yeah, puzzles are great, but in this game you can have your own stall, shoppe, vessel and even an island. If you've got someone to play with, that game is the best, if you don't, it's still lots of fun. You can choose who you want to be - plunderer, businessman or poker player, but being a pirrrate is not optional. Do what you want cuz a pirate is free. Pure win :D",
            "review_score": "1"
        },
        {
            "review_text": "My childhood and reason i love puzzles.",
            "review_score": "1"
        },
        {
            "review_text": "I would highly recommend this game i have probs played this for 6/7 years, the puzzles are great fun and you actually meet some really nice down to earth people, more adults then kids as well which is good as on first glance you would think most of the player's would be kids which is incorrect...  its wortha try! its free and downloads in like 5 mins so whats to lose??   Enjoy ",
            "review_score": "1"
        },
        {
            "review_text": "Do you like pirates? Do you like puzzle minigames? Then stop wondering and start to play! You won't regret",
            "review_score": "1"
        },
        {
            "review_text": "I have been playing this game for a while and I greatly recommend this game. It's a nice break from other games I usually play and you can relax and just puzzle your way through. However, one downside is that there isn't as many players as there used to be, and seeing as it's an MMO, that kind of makes it hard to do anything.",
            "review_score": "1"
        },
        {
            "review_text": "It is pirates and puzzles, two things I enjoy. :) The only thing I would want to change is that personalized items (clothes) seem to wear out and break so that you have to get more money to buy a new set.",
            "review_score": "1"
        },
        {
            "review_text": "Came back to this after 3 years away. Still fun!",
            "review_score": "1"
        },
        {
            "review_text": "It's one of those games you play for a week then get tired of it, but you always come back.",
            "review_score": "1"
        },
        {
            "review_text": "GOD ♥♥♥♥IGN DAMMIT THIS GAME IS BEAST.",
            "review_score": "1"
        },
        {
            "review_text": "cool game if you like puzzling",
            "review_score": "1"
        },
        {
            "review_text": "My first MMO, now on Steam. I'm happy to play it again.",
            "review_score": "1"
        },
        {
            "review_text": "Okay, on first glance, this games looks like a kids game. Don't get me wrong, the graphics are pretty colorful and childish, but it makes it up with gameplay. This games has one of the best MMO mechanics in the industry; you, the player, get to own ships, shoppes, and even islands (if you're rich enough). The direction of the economy is at the finger tips of merchants or pirates -- you choose.  The infusion of puzzles with the jobs on the sea makes for a great time if you join a random crew or sail with your friends. I would recommend this game to anyone who loves a pirates life (and puzzles).  Another great thing about the games is that it's cross-platform with Android and iOS.",
            "review_score": "1"
        },
        {
            "review_text": "Played Poker,   Got Money,  Got Achievements,  Went Outside,  Learned I was not actually good at Poker,  Lost more money than I made,  Made a review,  Tried to remake my small fortune of 2 dubloons.",
            "review_score": "1"
        },
        {
            "review_text": "Great game activities! Many different things to do with a unique environment and free to play! :D Also has in game currency exchange!",
            "review_score": "1"
        },
        {
            "review_text": "If you love puzzle games, pirates, sailin around the seas, or just playing card games. This is a great game for you, Use the money you earn to buy clothes weps housing ships furnature n pets, always fun tournaments going on as well. become the best pirate in the whole ocean!",
            "review_score": "1"
        },
        {
            "review_text": "It think this is the worst game because most of the Oceanmasters do not pay attention to what you say and some of them are to lazy to do their work and Ban you right away, Like my friend who wasted 20 bucks on this stupid game, got banned for saying bad words and did he apologize??? Yes he did, did the oceanmasters accept? no they didn't they were too lazy to, my friend wasted so much time on that useless game and later regretted he played it, he was permamently banned ofcourse and the worst Oceanmaster of Puzzle Pirates is... EURYDICE! Yes, you hear me Old Lady, DO NOT BE LAZY TO DO YOUR WORK.",
            "review_score": "1"
        },
        {
            "review_text": "Ooooh, spoicy!  This game was the first MMO I ever played, and I'm so glad it was because it's amazing, and I've sank so many hours before this came to steam. It's exactly what the name says; if you like puzzles and/or pirates, please play this game.",
            "review_score": "1"
        },
        {
            "review_text": "Best expearience of my life. Imagine Les Mis x10. This game makes you cry, scream, and shout. You just want to let it all out. This game is the best thing you will ever see in your life. If you haven't downloaded this game then you need to put down that hot pocket and give this game a look. '10/10 Like Skyrim with guns'.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game, once you get into it you can't stop. Recommened for everyone",
            "review_score": "1"
        },
        {
            "review_text": "Arr!Avast the puzzle pirates are the fun which you can get booty,fight crea and play puzzles! this game also avaliable at  www.puzzlepirates.com  get your OWN adventure for your pirates life!Arr!",
            "review_score": "1"
        },
        {
            "review_text": "I've never seen such an amazing community. Everyone helps each other out  I wouldn't recommend playing PP on Steam though. There seems to be a glitch that freezes the client. The web client is much better",
            "review_score": "1"
        },
        {
            "review_text": "I've never seen such an amazing community. Everyone helps each other out  I wouldn't recommend playing PP on Steam though. There seems to be a glitch that freezes the client. The web client is much better",
            "review_score": "1"
        },
        {
            "review_text": "is fun",
            "review_score": "1"
        },
        {
            "review_text": "Puzzle Pirates has been a longrunning game which has almost been around for a decade from what I recall, either way.  Puzzle Pirates is a game orienting on the exploration of a virtual sea world in which you will plunder, hunt (and potentially bet thousands if you're a poker player). Last time I had played this game was in 2009 and it is still familiar to me with barely any extreme changes that would put me off, the game itself is nowhere near Pay-2-Play and is entirely F2P as the economy relies on people who pay into the game. Gameplay itself is quite simple and revolves around minigames to either gain money, prowess or for fun.  Either way I recommend this to anyone who is wanting to play a simple F2P game and you have time aside to get accustomed to the game.",
            "review_score": "1"
        },
        {
            "review_text": "nice game to play",
            "review_score": "1"
        },
        {
            "review_text": "not like much , a free game",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ing pirates and you just go and do ppuzzles motherufkcer ythis game is flawless suck my pirate ♥♥♥♥ you flaccid ape",
            "review_score": "1"
        },
        {
            "review_text": "this is a great game for anyone who likes puzzle games and pirates, like me. I highly recomend it though some of the puzzle games require money in the way of coins or something I think, if I remember correctly, but they do a different one of those games, the ones you have to pay for, and it is a different one you ca play free every day.",
            "review_score": "1"
        },
        {
            "review_text": "good game nice to play",
            "review_score": "1"
        },
        {
            "review_text": "It's a fun little puzzle game...it's free, so totally worth having whenever you have a few mins to kill.",
            "review_score": "1"
        },
        {
            "review_text": "Play this game if you're bored of FPS games. Its actually really fun!",
            "review_score": "1"
        },
        {
            "review_text": "If you know guns of icarus and looking for a ♥♥♥♥ ton of puzzles then you'll enjoy this game I played this game when I was younger still enjoy playing it now",
            "review_score": "1"
        },
        {
            "review_text": "Its great fun for people of all ages with easy to solve puzzle and cute graphics",
            "review_score": "1"
        },
        {
            "review_text": "The games can be a little tedious at time but really think about it. You are a pirate afloat in the carribean sea, many of these games are like the actual jobs they are based upon, not realistically though.. and many of those jobs were tedious to do. They are not that difficult to do though. And although there is premium content in the game, everything can be done without ever paying a cent as if you get in with a good crew that travels and does pirate things on a daily basis, you can get enough poe to trade for dubs and buy the premium items such as ships and ranks and commerce badges and such.. It just takes a little more work.",
            "review_score": "1"
        },
        {
            "review_text": "fell so good , thanks",
            "review_score": "1"
        },
        {
            "review_text": "Fun game. :) Takes some time getting into, but its fun when you get the whole idea. :D",
            "review_score": "1"
        },
        {
            "review_text": "Fun little game if you are bored with the rest of them, the communities are amazing! Find a nice crew get settle in and fight your way to becoming captain of your very own crew, Admiral of your very own fleet, Monarch of your very own flag!",
            "review_score": "1"
        },
        {
            "review_text": "Been playing this game for about 7 years. Its extremly addictive.",
            "review_score": "1"
        },
        {
            "review_text": "Even back when the game was young, it was already breaking the norms and creating something entirely different among games of its time. It continues to do so, now more than ever, being a sandbox MMO that offers something no one else can.  Skindeep, the game floats on dozens of different puzzles representing combat, keeping your ship seaworthy, crafting, harvesting, and just having a good time in the inns. The game is still much more deeper than that; the game is built on the shoulders of its players with a constant world heavily impacted by the politics of massive crews and flags and the entrepreneurship of individuals.  The path you choose is entirely up to you. As many will find, you will probably start off getting jobs aboard ships but this can quickly branch off into what YOU would like to do. You can continue to keep jobbing for crews or join your own doing the same thing, work at shoppes, run your own pillages as an officer in a crew, become a trader sailing island to island, become an adventurer or monster-hunter sailing to unknown dangers and looting giants, join the polticial scene among many of the top flags and crews who run a good fraction of the ocean, or even conquering entire islands owned by other players.  It's presented with a 2D setting and environment, but its very stylized and clean. The only true downside is the lack of effort put in by the developer's interest; the game has constantly taken blows due to poor management and bad decisions. You'd think a game like this would absolutley THRIVE in the current situation we are in now where puzzle and casual games rule. Alas, even Three Rings botched that up making a failure of a transition to mobile.  Still, what the game truly needs is more player activity. It's a highly social, very detailed yet entirely simple game that may be the best MMO made as of yet. If you're looking for something new and fresh, that is skill-based, detailed but without a steep learning curve, easy to learn but hard to master, or simply just one of the best casual games there is, then I highly recommend this to you.",
            "review_score": "1"
        },
        {
            "review_text": "Oh My, Oh My, 'Ow many an Hour i did waste pillaging this silly game, yohoho'ing as i rumble me' mates, and loot ye booty,  In all seriousness though, a misleading little game, you think its gunna be a bad excuse of what 500mb? but really if dare to waste 10 bucks on this game to get a subscription for a month, ye'll find it's quite the entertainment, it's hopelessy addicting and the only game i can find that has anything to do with pirates properly. In short a good little game for wasting hours at a time, it however can leave you with an empty feeling so, play in moderation.",
            "review_score": "1"
        },
        {
            "review_text": "Yo, I recommend this game",
            "review_score": "1"
        },
        {
            "review_text": "Like this game very much",
            "review_score": "1"
        },
        {
            "review_text": "I like this game",
            "review_score": "1"
        },
        {
            "review_text": "funny game, good to play",
            "review_score": "1"
        },
        {
            "review_text": "well this game is so good",
            "review_score": "1"
        },
        {
            "review_text": "I spent way too much time playing this game before it was on Steam, but Too bad your account get deleted after a couple months of inactivity. So much time and money gone...",
            "review_score": "1"
        },
        {
            "review_text": "free + puzzle + many achievements = good time killer",
            "review_score": "1"
        },
        {
            "review_text": "Ive played this game alot before, and found the puzzles engaging and fun. However, i find the overall lack of a clear direction makes this game hard to get into. Give it a shot.",
            "review_score": "1"
        },
        {
            "review_text": "Incredibly fun with friends, near or far. (I play on the Emerald ocean!)",
            "review_score": "1"
        },
        {
            "review_text": "Need some event in game",
            "review_score": "1"
        },
        {
            "review_text": "Most complex economy in a free-to-play game. Ever.  Honestly, I can't believe this is a kid's game. You may own islands and be a governor, you can own shops and stalls, can own ships and crews - it's very sandboxy for its time.  Every time you want to craft items and sell it in your shop, you HAVE to play a mini-game. You can hire other players to 'work' for you. Every amount of orders they fill, you pay them. The puzzles are challenging but simple as well.  Prices for commodities go up and down just like in real life. You need these commodities to fulfil orders in your shop.  Long story short: this is the perfect game for any person who wants to become someone in real life but they can't. It's like a real-life simulator in a way.  9/10 - if they updated the graphics and made the game more action-oriented it'd get a straight up 10 from me. A masterpiece.",
            "review_score": "1"
        },
        {
            "review_text": "best community ever",
            "review_score": "1"
        },
        {
            "review_text": "best game in this world or any other BAR NONE!",
            "review_score": "1"
        },
        {
            "review_text": "it was hard but i was able to fap to this game -10/10 ign",
            "review_score": "1"
        },
        {
            "review_text": "This is THEE greatest game I've ever played. Every day I join a teamspeak named after this game. Would reccomend highly.",
            "review_score": "1"
        },
        {
            "review_text": "Ive played this game alot before, and found the puzzles engaging and fun. However, i find the overall lack of a clear direction makes this game hard to get into. Give it a shot.",
            "review_score": "1"
        },
        {
            "review_text": "Puzzle Pirates is a great game that my wife and I enjoy playing together.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game, lots of content, the community despite being small is very active and enthusatic. It may look rather simple but there is so much indept content, not to mention constant small updates.",
            "review_score": "1"
        },
        {
            "review_text": "i like this game very much",
            "review_score": "1"
        },
        {
            "review_text": "Best game you will ever play, SERIOUSLY screw black ops and mw3 THIS IS THE SHEET",
            "review_score": "1"
        },
        {
            "review_text": "A game I've been playing for years and years, very pleased to see it made its way onto Steam. Very relaxing gameplay and a great overall game. Many features, the only thing that's lacking is the amount of players.",
            "review_score": "1"
        },
        {
            "review_text": "Who doesn't love pirates? It's a cute little puzzle game :-)",
            "review_score": "1"
        },
        {
            "review_text": "All in all, be good in a puzzle, master that, work like a slave. Create your own crew, find people who master other puzzles. Grow. Repeat.",
            "review_score": "1"
        },
        {
            "review_text": "Ever time i see this game in my library I want to play it! I miss sailing the seven seas on adventure... Maybe it's time to update the game so that it look better? This is truly the best MMO I have ever play todate.   I have played the game over 9 years and nothing has change and it's still the best MMO.",
            "review_score": "1"
        },
        {
            "review_text": "This was my first MMO sooo many years ago. Still love it, even if I just hop on once in a while to puzzle. :) Pirates! Arr!",
            "review_score": "1"
        },
        {
            "review_text": "probably the best game ever made.",
            "review_score": "1"
        },
        {
            "review_text": "AWSOME GAMES 72 hours played",
            "review_score": "1"
        },
        {
            "review_text": "This looks like 'Where's Waldo' mixed with Diablo2. The only reason I hate this game is because I didnt think of it first.  I'll tell you another thing. I had a hell of a time finding Waldo in this ♥♥♥♥♥♥♥♥♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "Best game of all time you better play it before you die. Which wont be long ARR!",
            "review_score": "1"
        },
        {
            "review_text": "Fun, entertaining. CONFUSING. Seriously, I don't understand anything in this game. Ranks for how good I am at something? Captain of the Archipelago? Island Admiral? Badges? Doubloons? Pieces o' Eight?  NOTHING MAKES SENSE. I'm not saying this game isn't fun, though. I'm saying that while it is fun and entertaining and kills the time, if you want to be a Captain or Island Commuter or something, you'd need to read an online wiki for HOURS researching it all.  I suggest you buy this game if you easily understand anything related to this. If not, you can still buy it as the mini-games are quite fun, but don't try to advance way into the game and become a Ocean Master or something.",
            "review_score": "1"
        },
        {
            "review_text": "By far the best time ive ever had the pleasure to play. I am unemployed and have been having troubles keeping myself occupied and happy in times of depression and loneliness. This game not onlt pull me out of my hole, but it also skyrocketed me into outer space with its flashy graphics and challenging puzzles. I no longer worry about finding a job in this tough economy (thanks NDP) because I whole heartedly think that my career in puzzle pirates is just starting. So color me gay and pop my cherry, this is a game of a lifetime.",
            "review_score": "1"
        },
        {
            "review_text": "Have so many good memories with this game, it's so good. You create your pirate, enter a crew and go pillaging with them, playing awesome puzzles and feeling like a true pirate. It used to have a lot of players, sadly nowadays it only have a few, it's still good but I miss when the servers was full of pirates of all continents.",
            "review_score": "1"
        },
        {
            "review_text": "I highly do not recommend this game. I played this game back in the day, it was well ran and a big community. Then the company started getting ran by the Ocean Masters because three rings couldn't afford it and it went to ♥♥♥♥. My boyfriend got banned for botting when he had all new stats on his account so there was no possible way he could have. I used another account because I forgot my old account and I got accused for real world trade. We emailed the staff of this game about the bans and they provided no reasoning or proof, just simply said it is the rules and linked the rules and perma banned. It's like they want this game to die. People are getting banned left and right for no reason and the community is basically dead so don't waste your time and do not play this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Before the days of standard F2P there was this little game. It was java based. I played this game in 2005 til about 06. It was one of those I used to take away from WoW(Back then things were much different). I'd puzzle and hang out with people. Got a girlfriend to play it, broke up with her. Faced her crew in a blockade and sunk her ship.   All to say this, the game WAS fun. However, it should have sank a long time ago. The subscriber oceans(Business model much like the current Sub games) is dead. There were 2 and they were well populated, now they are 1 and the last tally I did had 70 players on it... that's 1.2 islands to each player.  The dubloon oceans(The F2P counterparts) are still active but pulling in 1/5th the numbers they used too. And most of those are people searching for people who used to play the game and finding no one.   This Jolly Roger should be retired. It's sailed more than it's fair share of lasts.",
            "review_score": "-1"
        },
        {
            "review_text": "played for days and days online after atleast a year playing this game i can say, its a payto wn game that is dead now",
            "review_score": "-1"
        },
        {
            "review_text": "it's like habbo hotel was face♥♥♥♥ed by bejeweled puzzles",
            "review_score": "-1"
        },
        {
            "review_text": "Wow. No. Just no. I can't believe Steam even lets you install this without warnings. Don't do it guys. I think the positive reviews were trying to be sarcastic.",
            "review_score": "-1"
        },
        {
            "review_text": "game is to out dated",
            "review_score": "-1"
        },
        {
            "review_text": "  Grade :  65/100   Difficulty :  Varies, depending on activity.   Pros :  A variety of things to do and puzzles to play.   Cons :  Not very immersive, very bland graphics. Games are either too complex or too easy. None feel engaging enough to replay on a consistent basis.   Replayable :  No. Do not recommend unless you're really bored.",
            "review_score": "-1"
        },
        {
            "review_text": ".",
            "review_score": "-1"
        },
        {
            "review_text": "Fun for about 10 mins or so but some might enjoy for longer....",
            "review_score": "-1"
        },
        {
            "review_text": "MAybe some nice ideas, but for me it was boring.",
            "review_score": "-1"
        },
        {
            "review_text": "Puzzle Pirates sucks... its so boring gaaah!",
            "review_score": "-1"
        },
        {
            "review_text": "What is this? I don't even....",
            "review_score": "-1"
        },
        {
            "review_text": "This was at one time a great game ! I spent many, many hours puzzling and pilaging. However the game is now dead. Without a strong population this game just doesnt have the same appeal it once did.",
            "review_score": "-1"
        },
        {
            "review_text": "It is terrible because I cant ge on because of the age!!!!!!!!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "Was fun for the first 30 minutes or so, got bored for the rest of the gameplay  Also, why is this game rated T?",
            "review_score": "-1"
        },
        {
            "review_text": "I really ove this game but it needs somethings. It's basically a Puzzle MMO. It's pay to play in that you have to get badges to have access to everything all at once. You dont have to pay but you need to grind hardcore to get sufficient in game currency to buy badges. Now, This game is a blast when there are lots of people playing. Like 5 years ago. Now it's a ghost town. You can still find some crews. This game needs a serious revamp, New Puzzles maybe just update the puzzles. But it is fun and very addicting considering all that.",
            "review_score": "-1"
        }
    ]
}